{"id": 384436, "author": "reshm", "title": "Win-Win Prism DID Integration", "url": "https://cardano.ideascale.com/a/dtd/384436-48088", "category": 26254, "amount": 20000, "description": "Win-Win, a new alternate dispute resolution marketplace powered by Cardano, needs a mechanism to trustfully connect mediators with clients.", "funded": 2, "upvotes": 72492506, "downvotes": 3416410, "votes_result": 69076096, "votes_cast": 192, "f6_no_assessments": 8, "f6_rating": 4.458333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, this proposal effectively addresses the challenge and is a unique use case for the inclusion of DIDs. The rise of dispute resolution will become important in the online space as individuals will require recourse should an agreement go south, and their win-win app is an excellent solution, as witnessed by top marks and top votes in Fund6. Now, the integration of the Atala Prism DID within the win-win seems like an obvious evolution. By integrating DIDs within the dispute resolution application, users will be able to confidently identify and select a mediator that fits their needs, and also allows the professionals to begin building their reputation system that can be leverage to acquire more jobs based on their past work. This seems like an obvious next step in the roll out of the app and I think the community would benefit greatly. ", "q0r": 5, "q1": "With the experience and plan presented above it is extremely likely that the proposal will be implemented successfully. The team has already proven their track record, not just in fund 6 but through the many ways they participate in the community, this should give voters a very high sense of confidence in their abilities. Another reason why I believe this is likely to be a success is because the win-win app is already being developed and is ready for testing and integration. This inspires confidence because a large portion of the work is completed and the remaining integration appears as more optimization. I also find confidence in the fact that the proposers highlight how the intend to progress the app upon integration of Atala Prism and listed partners whom will advance the adoption. The timeline, roadmap, and budget all appear more than reasonable for what the potential result could be. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The team does a good job identifying the problem, presenting their solution, and explaining how the introduction of DIDs will help achieve their goals. I would have liked to see the proposers expand a little more on their process around the \"smart contract audit by 3rd party\" or instead a clearer articulation of opportunities for the community to be informed on the progress. With that said, given how visible the team is across the ecosystem and in a variety of different fora, there are likely many opportunities for community input. Overall, awesome project and best of luck. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 21, "ne": 13, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal fits very well with the objectives of the challenge and will probably bring great results to the Cardano ecosystem. The idea is to integrate a project that already exists, the Win Win platform, built in Cardano and aimed at resolving conflicts outside the judicial system, with the DIDs of Atala Prism. Note: point for the authors when explaining what Win Win is about, giving a brief summary of the project and attaching a lecture lasting more than 1 hour on the f6 proposal, which was financed. The proposal will certainly be a success and will increase the number of DIDs in circulation because: the platform is already in use, it already has some users and with the investments requested (proponents are looking to expand and improve it, I have already evaluated other proposals regarding Win Win in that fund) will definitely get better and more popular. This means more users, and by promoting this integration with Atala Prism, new DIDs would be generated, and without the need to \"convince\" anyone of the benefits and the need to have a decentralized identity. I think one of the most complicated things is to attract attention, to captivate new users, the Cardano universe is quite new, who will say Atala Prism, often the community members themselves do not have much knowledge about this new form of identity, so linking a project that already exists, I already have users and getting them to acquire the DID without starting \"from scratch\" is a great way to generate new DIDs. Therefore, I believe that it is a high-value proposition and that it aligns very well with the objectives pursued here.", "q0r": 5, "q1": "The team is certainly capable of making this project happen. We have an individual description of each member, so that we can know what their formal specializations and previous projects they have carried out outside and within the Cardano ecosystem. Because they have already founded the Win Win platform (in addition to other projects, such as CA/vCA tools, etc.), we have practical examples of their capabilities in turning ideas into reality. There is no way not to trust the preparation of those who have already delivered such good results and have such rich academic backgrounds and specialization. Therefore, when it comes to the team, 100% confidence is conveyed. They also have a very detailed roadmap on what would need to be done to result in the final product, with subdivisions in each phase, that is, the tasks that would make up the whole. Some of these have already been done, as is indicated by the check symbol, and we know when and in what order the others would happen (they divide them into quarters, and chronologically order what would happen within each period). The way it is presented to us, it is possible to have full understanding of the process to be done. And finally, speaking of budget, the money requested is very fair for the level of complexity of the project, divided into two blocks: 18k for salaries, with an average of 2k per month for each professional involved, which is a value coherent, and 2k for dissemination. It would be very interesting if they had clarified how this marketing would take place. I believe that it would be a work of disseminating the idea internally, that is, for Win Win users, mediators and customers to make their DIDs. I would like to understand how this process would take place. However, that is the only observation I have to make. Regarding the team, script and budget, we are very well informed, the proposal will certainly be well managed and we have a visible and financially fair development.", "q1r": 5, "q2": "Unfortunately, the team forgot to define the KPIs. We don't have direct information here on how to measure the results, how to monitor whether the project was developed as promised. However, it is possible to audit it through the development of steps. As you know which steps would be done and which tasks these phases would be composed of, it is possible to monitor if the activities were being done in the right order, in the right way and getting the desired results. In this sense, the team could prepare a report containing data from each of the phases, partial data from the whole, and present them to the community. A very logical way to verify if this project would be working is by monitoring how many people who use the Win Win platform have made DIDs. This % would certainly point out if what we are looking for has been achieved. The team should provide us with such data as well. Finally, I conclude: despite not having direct KPIs traced, by monitoring the phases and controlling how many DIDs are generated from Win Win, it is quite possible to audit this proposal.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 27, "ne": 15, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement chosen targets at creating a marketplace with provision for trustfull mechanism and dispute resolution to connect mediators to clients. The solution suggests integration of Atala prits being (a decentralized identity solution built on the Cardano blockchain), this way the the Decentralized IDs of the moderators can be verified by the concerned client this way there is lesser scope for fraudulent moderators in the marketplace. Also they have mentioned provisions for opportunity where organizations and universities and also certify people on the same this way it effectively addresses the issue. ", "q0r": 5, "q1": "The team has good number of software engineer who can get this proposal to reality as most of them have multiple years of experience in the relevant field, including experince in negotiation, Conflict Resolution dispute resolution domains adding better oversight over building such a marketplace they have also provided a well segregated phase wise plan of execution and corresponding timeline so the proposal likely to be completed and delivered efficiently.", "q1r": 5, "q2": "The proposal has detailed phase wise plan along with corresponding timeline for the same, so the progress of the project can be well monitored and funded based on pace with wich things progress. Also they have provided a decent fund breakdown yet a phase wise fund breakdown as a success measure wrt fund against work would have been great to audit the same, since they also have  a VCA in the team the proposal looks good for most of the part to understand and audit the same  ", "q2r": 4, "assessor": "z_assessor_16", "no_vca": 28, "ne": 2, "ng": 16, "nfo": 10, "vca_o": 1, "reply": "The rationale provided doesn't seem to match the scores given."}, {"q0": "The proposal is in the accordance with the challenge because it aims to implement DID with Atala prism on their platform (which is currently under development), and therefore contribute to its adaptibility. The goal is to connect mediators with their clients using the verified system of DID, which sounds nice, but there is no proof of demand (how many people would be interested in such a service) and it aims only to US marketplace. The impact of the proposal is lacking more supporting evidence. ", "q0r": 4, "q1": "The proposal contains a very detailed information of each team member which is sufficient to reach the desired goal. The budget seems reasonable - 2k / month / developers and project manager and the roadmap is set quarterly describing planned tasks to be done. From the proposal it is not clear whether they already have the required \"labor\" or they plan to hire them. ", "q1r": 4, "q2": "The key metrics are stated within the roadmap, and the solution is clear. Nevertheless, I am missing a rationale of why it is required. According to the guidelines, a clear problem description is required, but the proposal is rather describing what is going to be done, not what is wrong and needs to be fixed/corrected. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 27, "ne": 3, "ng": 24, "nfo": 0, "vca_o": 1}, {"q0": "These proposers want to build a plateform that will help resolve disputes before it reaches the legal system. This will be done by using DID. I think that the proposal has successfully identified a problem within the challenge. However, the proposal can be improved by adding more details such as examples and practical cases that can help us better understant the concept. All in all the proposal has given enough details to get a positive for the impact.", "q0r": 5, "q1": "This proposal has been funded in fund 6. This means that the proposal has been adopted by the community. The team seems on point but the linkedin profile is only available in an external link. Why not add it within the proposal?. This should be added to improve the feasability score of this proposal. Luckily for them I know a member of the team from the community. That's why I can give it a rating of 4. I would also like to see the progress of the team since the previous fund. To sum it up, I recommend to the proposers to add linkedin profile of the team members in the proposal. ", "q1r": 4, "q2": "The proposers have added a detailed roadmap that can help track the progress of the project. However I didn't see strong KPIs. They should be added in order to improve the proposal. Other than that, I think that the proposal can be audited easily.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 29, "ne": 2, "ng": 26, "nfo": 1, "vca_o": 1}, {"q0": "The proposal makes a lot of sense. It hopes to integrate DID into a mediation platform already under development. This will certainly give win-win a greater impact. In my opinion it is not an exact fit for the challenge brief but falls best under the \"Self-governance of Emergent Communities\" suggestion. ", "q0r": 4, "q1": "The team is highly qualified and was previously funded by catalyst. The team includes plutus and prism pioneers, and have been winners of multiple hackathons. The proposal itself seems like a straightforward prism integration (as straightforward as that can be) and I believe they have what it takes to be successful. ", "q1r": 5, "q2": "There is a clear roadmap that provides auditable milestones. Funding is not broken down but the total requested funds are modest and seem realistic. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 27, "ne": 1, "ng": 23, "nfo": 3, "vca_o": 1}, {"q0": "This product would definitely add value to the Cardano Ecosystem. The only issue is that this same team is present in so many proposals. If they can spread themselves so much the project will be effective. But this should be carefully considered. This proposal falls within the scope of the challenge brief .No key metrics and goals of the proposal have been stated clearly.   ", "q0r": 4, "q1": "The team is experienced and recognized in the Cardano Community.  Therefore they could have the skillset to do the project. The budget is also reasonable and the cost factors have been clearly laid out.", "q1r": 3, "q2": "There is a clear Roadmap and well laid out path to achievement.  the proposal provides a sensible and conductible plan for implementation. the proposal clearly explains  technical aspects like architecture, language and technologies if they are crucial for implementation. the proposer has not considered challenges and risks relevant to a successful implementation. ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 27, "ne": 1, "ng": 19, "nfo": 7, "vca_o": 1}, {"q0": "Decentralized economy need to evolve a reliable dispute resolution mechanism. Arbitration using Atala based identity is an unique proposal and there is a need to have such a mechanism. There might be arguments on usefulness of the same since in the face of it it looks as if both parties have to respect the decision of the arbitrator for this to be effective. However i feel that there is need to have this in the ecosystem. ", "q0r": 4, "q1": "The proposers have impeccable credentials and are pioneers in Cardano Ecosystem. The technical capability of the proposers have been demonstrated in the capstone projects during Cardano Summit.", "q1r": 5, "q2": "The cost is for hiring of developers. The project is expected to be developed in open source format. The arbitration code is likely to have associated benefits in terms of helping other projects in use of Atala. Therefore the progress and success of the project is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 24, "ne": 0, "ng": 18, "nfo": 6, "vca_o": 1}], "solution": "Integrate Win-Win with Atala Prism so that mediators can be verified by DIDs and universities can issue credentials to their graduates.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and Atala PRISM pioneers, participants of Gimbalabs PPBL program."}