{"id": 369884, "author": "", "title": "Global Mission Driven News Room", "url": "https://cardano.ideascale.com/a/dtd/369884-48088", "category": 26106, "amount": 8000, "description": "カルダノのエコシステムにおけるSPOについては、世界中のさまざまな言語での参加とストーリーの共有が、一箇所では十分ではありません。", "f6_no_assessments": 2, "f6_rating": 3.6666666666666665, "videos": ["https://www.youtube.com/watch?v=CJF4mCTvhLM&t=1s"], "media": [], "f6_assessments": [{"q0": "The proposal seeks to increase meaningful participation in the Catalyst community by collecting and sharing stories from mission driven stake pool operators and stakeholders from around the world. It has a focus on providing stories in all language groups and from every country. Stories to be shared via a website and social media channels and break out community meetings. The proposed solution aligns very well with the challenge and scales.\r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "Based upon their LinkedIn profiles the proposers are recent graduates with multiple recent startups and who have already been networking extensively within the Catalyst community. The proposal is well written and their social media sites are professional which is clear evidence that they have the relevant skills and are passonate about the Sustainable Development Goals.\r\nThe budget and plan are clear and reasonable. No risks or challenge are identifed however there may not be a SPO in all 193 countries so the mission goal may not be achievable. Highlighting the lack of representation within specific countries might actually spur someone in the country to start a SPO so that could ba an unintended side benefit.\r\nBased upon my experience, I agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 4, "q2": "The proposal provides a roadmap but the timeline and milestones are vague. It is not clear when the collection and distribution of 500 stories is intended to be completed. The metrics are mostly reasonable however the methodology for collecting some of the metrics is not clear.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal may contain a good idea, but I don't see how the problem stated fits the challenge. The other issue is that the problem statement is very confusing. I suggest to the proposer to better articulate the problem statement. Althought this proposal contains articulate the value the will add in the cardano ecosystem, I think it is congruent with the rest of the proposal. Besides the key metrics and goal are not aligned with the challenge and I don't see a viable way it can scale in the next funds. My suggestion as a digital marketer, is treat this challenge as a user acquisition challenge with the goal to increase voters, community advisors and proposers.", "q0r": 3, "q1": "When the problem stated in the proposal lacks clarity and doesn't fit the challenge, it is difficult to judge it's implementation. The proposer didn't provide a link ou enough informations about the team needed for this project. The budget breakdown is vague but it is difficult to judge if it's reasonable. I don't see a detailed plan about addional funding. But, there is an effort to provide a timeline to complete the work. The proposal contains enough details about the plan for execution. The only problem is that there is a confusion on what the proposer is trying to build. ", "q1r": 3, "q2": "This proposal contains a roadmap with milestones, wich is a positive sign. There are also some KPIs . The problem is that the target problem is pretty confusing as it lacks clarity, and the solution is not clear. I think that this proposal can be refined in order to be more understandable.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1, "reply": "I do feel it does fit the challenge because we are improving the stories and use cases shared across Africa and the rest of the world! This will naturaly and ultimately allowing more people to learn how they can join the Cardano community to use this technology to better their lives, communities, and businesses all over the globe which will allow people to also learn about catalyst and put forward future proposals!"}], "solution": "ストーリーを共有し、使命感を持ったSPOや利害関係者がカルダノにグローバルに参加することを促進し、有意義なものにする。", "experience": "経済学、サステナビリティ、人文科学、社会科学、NGO、社会起業家、ライター、ブログ、ビデオ編集、Figma、Canva"}