{"id": 380966, "author": "felixweber", "title": "After Town Hall by Catalyst Swarm", "url": "https://cardano.ideascale.com/a/dtd/380966-48088", "category": 26234, "amount": 25000, "description": "Town Hall is attended by highly engaged participants of the Cardano ecosystem. They need a moderated space for discussion and networking.", "funded": 2, "upvotes": 71673902, "downvotes": 9490218, "votes_result": 62183684, "votes_cast": 447, "f6_no_assessments": 13, "f6_rating": 4.589743589743589, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer clearly has the interests of the Cardano community at heart. Leading after town hall events are a great way to build more community because individuals can meet with others who share similar interests, which can lead to potential proposals in the future. Awareness about the Cardano Catalyst project is crucial in its continued development, so providing spaces for voters and proposers to interact is in line with the challenge.\r\nOne question I do have is in regard to the marketing strategies mentioned by the proposer. I am unclear as to what kinds of strategies the proposer hopes to implement. If the proposer could supply more concrete information about the types or marketing strategies they plan to use, it would allow voters to better understand the impact of this proposal. (score given: 4)", "q0r": 4, "q1": "The proposer has successfully led Cardano after town hall events since the summer of 2021, which have all been successful. Since these events have run well in the past, I have confidence that the proposer will be able to implement the changes they outlined in this proposal to improve the after town hall events. Given the data and information provided in the proposal, it seems clear that the proposer will be diligent in their work on this proposal. (scorer given: 5)", "q1r": 5, "q2": "The proposer has provided sufficient information to audit the progress and success of the proposal. The key performance indicators are all concrete enough so that the Cardano community can observe the progress of the proposal. For example, the metric of 80% town hall retention for after town hall events can be accurately tracked to observe the success of the proposal. The proposers have already been tracking the metrics of past after town hall events and they will continue to do that in the future. Additionally, the proposers have provided a clear timeline for the project's rollout (Jan 2022-Mar 2022) and outline for the budget. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 25, "ne": 13, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "After Town Hall is an existing feature of the Town Hall that was initiated by the community and continues to add value not only to the community but also to the Town Hall. This can be measured by the growth of the number and the variety of rooms opened by the community themselves. In these After Town Hall are various workshops from the Catalyst School, various discussion group that covers a range of topics which attracts newcomers from different fields and also proposers discussion groups that talk about and promote their proposal etc. What once was only just a feature of the Town Hall now perhaps has become the main attraction of the Town Hall. There is no doubt this proposal effectively answers almost all of the Challenge settings.", "q0r": 5, "q1": "The proposer is a high value individual of the Cardano community that has created a network of high-performing individuals that supports one another. From time to time, the proposer has consistently created community placeholders for individuals to congregate and develop themselves through a common topic. Catalyst Swarm, Catalyst School, After Town Hall, Eastern Town Hall are all products of the proposer. Add to that a proven implementation plan with clear OKR's and KPI's, this proposal continues to build confidence on their capability to deliver. Though the budget break down needs some further fleshing out, most specifically regarding the new feature that will be tested out, which is researching the reward system. There is not yet a clear definition what is the reward system and how it works in concept. There is also no assessment regarding the potential challenge and risk this proposal may face, for an example; 'With the introduction of the rewards system, how can sustainability beyond funds from Project Catalyst be achieved?' For that, this proposal in this section only receives a 4-star rating.", "q1r": 4, "q2": "A clear roadmap with milestones which is accompanied by a healthy mix of OKR's and KPI's with numerical target enables auditing this proposal to a large extent auditable. There is a clear connection between the problem statement and solution which enabled the proposer to flesh out a strong proposal.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "The key aspects of this challenge are to facilitate and encourage a diverse community characterized by high engagement collaborative problem sensing and strong execution teams. The team behind After Town Halls, Catalyst Swarm are proposing to encourage further dialogue and collaboration about Catalyst events through hosting break out rooms after the Town Hall meetings. \r\n\r\nConsidering the team have a track record of delivering 20 After Town Halls so far, which have been attended by hundreds of people with a further 2000-4000 views on Youtube, it is likely their further proposal to host break out rooms is informed by articulated needs from the Cardano community. Hosting smaller and more dedicated and streamlined conversations will encourage wider participation from people that are potentially highly skilled but poor on time and unable to commit hours to lengthy unfiltered conversation, working to add skill and value to the Cardano community. \r\n\r\n\r\nThe proposed breakout rooms will undoubtedly bring the community together, increase meaningful participation, encourage deeper connection to peers in the community and create opportunites for people to increase their own networks by meetin other active members in the community. \r\n\r\nCatalyst Swarm are also proposing that this breakout space is an open platform, enouraging Cardano community members to register to host a breakout room. This encourages discourse, increased participation and opens the community up to not only participating in established conversations, but to start and host their own which will lead to the diversifyication of the community and encourage leadership from within the cardano community. ", "q0r": 5, "q1": "Given the track record, commitment and ongoing engagement of this team it is likely that the breakout rooms will see some success. Catalyst Swarm have initiated a number of projects that have expanded the use, knowledge and networks around Cardano. Based purely on the Catalyst Swarm's past acheivements it is likely the team experience is aligned with the project objectives. However, without specific detail as to who is involved individually and their specific skill sets, it is difficult to fully comment on this. That said, based on reputation alone and previous commitment and execution of the After Town Hall projects, there is a high liklihood of success for this project. \r\n\r\nThe proposed timeline commences in February 2022 and is ongoing for three months, running concurrently with Town Halls. The plan is mapped out, however there is little detail in the marketing campaign with a budget spend of $2000 USD, nor is there capacity targets for increased participation that would be tracked through said marketing campaign. This makes the project difficult to measure in terms of the success of the marketing campaing. If increased participation is the primary concern of this campain it would be advantageous to include specific participation numbers at this point and breakdown who the target markets are, and why and dig further into how the marketing campaign has been successful or indeed how it could be improved throughout the project. \r\n\r\n\r\nThere is a further 6k allocated in the budget for \"research & experimentation on After Town Hall Reputation and rewarding systems\" however this significant spend is unclear and doesnt' seem to be addressed anywhere else in the proposal. The expenditure amount is comparitively high within the context of their overall budget, so it is a shame that this essential component of their budget lacks detail and specificity. ", "q1r": 4, "q2": "Given the frequency of the After Town Hall events, there is some grace afforded in the lack of budgetary specificity for one item in that the auditability of this project is very high. On a weekly basis the community has not only an opportunity to ensure the project is on track, but they also have an opportunity to participate and buy-in further to the events and activities surrounding Cardano. \r\n\r\n\r\nThe current KPI set is clear, with a target of 80% participant retention for After Town Hall, however as mentioned previously there are no clear numbers attached to KPI's around current and target particpation acheived through the marketing campaign and there are also no specific numbers around the uploaded breakout rooms discussions (however this could be deduced by the proposed targets mentioned previously in the proposal.)  \r\n\r\nThe delivery dates are clearly defined, as they sit alongside the Town Halls. There is however detail lacking in the roll out and execution of the Marketing campaign which would likely need to commence in January, not leaving a great deal of time for the February commencement of After Town Halls. Again, without any specific measurements attached to the current and target participation, or details about the target markets, style of campaign or what the Marketing campaign is setting out to achieve specificially - it is hard to determine if this timeframe is suitable. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 17, "ne": 12, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The Catalyst Swarm - After Town Hall provides space for veteran and new people that active in Project Catalyst to engage more and have some discussion or even getting answer for their question. I think, this is a good forum/place where people could interact and produce better idea for Cardano community.\r\n\r\nThe key metrics and goal of this proposal also align with the challenge settings. It would like to increase the number of proposal and also active participation from community in the After Town Hall event.", "q0r": 5, "q1": "The team consists of experience people in Project Catalyst. And they already do this After Town Hall for quite some time now. I've participated in several of the After Town  Hall. Basically, this proposal will be implemented successfully if funded. \r\n\r\nBudget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion. Moreover, the team also include realistic time frame to complete the work that they mention in the proposal.", "q1r": 5, "q2": "Roadmap and milestones for each month are clearly defined in the proposal. In addition, the team describe the targeted problem clearly. And community could track the project progress via their website and also by joining the After Town Hall every week after the Global Town Hall is held.\r\n\r\nIt would be nice if the team could also include number on how many participants do they have now and by how much do they want to increase it. The rest, I think it's quite clear & easy to be measured accordingly.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 22, "ne": 5, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "Catalyst Swarms are a great way of supplementing Catalyst content and helps its improvement. I also like Felix's collaboration with other Town Halls so feel this project would assist the community as a whole in this way, as well as the content these Town Halls produce.", "q0r": 5, "q1": "Felix is great at organizing, and capturing feedback in these events. I have seen him in action many weekends and Wednesdays and am confident if he is involved: this project will go well.", "q1r": 5, "q2": "Lots of good info with the spreadsheets and other Google docs. These events are indeed good ways of getting the community involved and to grow it. Community is one of the foundation pillars of Cardano, and I think and feel this proposal will grow the community well.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "I strongly agree with the idea coming from this team as it falls within the scope of the challenge brief. This proposal clearly identifies the problem needing to be solved and articulates it with an understanding solution.", "q0r": 4, "q1": "I agree the proposer provided evidence references links, of relevant skills and experience needed to implement the proposal, links are sufficient and active contacted to relevant people.", "q1r": 5, "q2": " Budget have been outlined clearly and broken down into identifiable items that is for how many meetups approximately, awesome very much needed and reasonably price to achieve the set goals, given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q2r": 5, "assessor": "z_assessor_399", "no_vca": 24, "ne": 1, "ng": 14, "nfo": 9, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely ighly engaged participants of Town Hall need a moderated space for discussion and networking. It is clear that this proposal falls within the scope of the challenge brief by organizing breakout rooms after each weekly Town Hall to discuss current events and to provide space for funded and upcoming projects and ideas.This proposal shows how it adds value to the Cardano system by creating  these moderated break out rooms    Key metrics  would be  number of users,  number of breakout rooms, number of participants in each breakout room, number of hosts and organizers. The key metrics and goals of the proposal fall within the scope of the challenge. Proposal can be scaled up to address future challenges by adding more rooms and events. I can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating", "q0r": 5, "q1": "The proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events.  The links are sufficient. the proposers are well experienced and competent to do the event. The type and number of team members required to implement the proposal is stated. THe team structure is listed and experienced. The budget has not been given in detail. The budget is  reasonable to achieve the set goals. The proposer has not provided a verifiable plan if additional funding is required. .Theres a realistic timetable  to complete the work. The proposal gives  a sensible and conductible plan for implementation.  .\r\nResources  necessary to implement the proposal are described.   The proposal has technical aspects which have been addressed The proposer has not identified risks in this proposal. Given experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.  \r\n \r\n ", "q1r": 5, "q2": "There is a roadmap with milestones.   There are  Metrics such of number of participants and number of B/O rooms.   The proposer has not identified possible hurdles, challenges and difficulties.The information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n \r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 23, "ne": 4, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies an important point within the challenge which by adressing it, will bring an immense benefit to the Catalyst community and the Cardano ecosystem; by connecting people from all over the world that are united by the same idea and providing them a space to discuss the current topics of the townhalls and Catalyst in general. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince the swarm is a great multiplicator on many accounts, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "Felix Weber and the Catalyst swarm are a really active and vital part of the Catalyst community. Without a doubt they will be able to successfully enact this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large part of the community as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is without a doubt a perfect example of a good, feasible proposal.", "q1r": 5, "q2": " A well-defined roadmap with relatable, detailed milestones is presented. Auditable Metrics and KPIs are presented that define the success of the proposals.A clear, understandable problem description is supplemented by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 24, "ne": 10, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I believe this proposal can be summed up well in the phrase: \"Offering an open stage for the community also allows us to meet, speak and discuss topics and themes that are important to us and our community.\" The objective here is to promote post Town Hall meetings, to discuss specific issues, debate on funded projects or projects that are yet to be launched. It is interesting how the authors explain the functioning of After Town Hall, both for guest and presenter. This makes us understand the activity developed more completely. The question would be, then improve something that already exists, according to the points raised - timestamp, implement reward systems, promote marketing and so on. In my honest opinion, the 25k requests could be used to create new projects, After Town Hall has been in existence for a few months now and works well in the current way, I believe the goal of promoting debate and connections between engaged members of the community is already being achieved without such improvements, so I don't think this proposal would have that much impact. The Catalyst Swarm group has already had a lot of impact on the objectives of the challenge of promoting a meeting and reflection on the projects/technologies of the ecosystem in the current model, and the funding could give other projects a chance to be born.", "q0r": 2, "q1": "Catalyst Swarm is already a well-known/consolidated group in our community. Because they already have a working history and have already started After Town Hall before, a lot of confidence in the group's ability to carry out this project is conveyed. However, it would be interesting for the team to provide a short description of each member, so that we can know their names, functions and a brief résumé of what they have done so far (inside and outside the Cardano community). About the script, it is very simple, the authors indicate what would be done in general next year and specifically in February and March. But would the project focus on two months? Who would do what, in what period of time, in weeks, to achieve the proposed objectives? I don't know if the rest of the script has yet to be completed or that's it, but it gives the impression of being very dry, so there is not enough detail or length of time for us to fully understand what will be done, how, by whom and and When. About the budget division, I believe it would also need more detail. For example, when asking 6k to research and experiment with the rewards system, what is the justification for this amount? How would this research be worked out, what would be researched, who would research it? How much reward would each person receive, individually? Overall, I believe that both the team presentation, script and funding are explained quite superficially, lacking more detail for a satisfactory understanding of the proposal.", "q1r": 2, "q2": "I think this is the most complete part of the proposal. The authors provide us with several topics that would serve as content to be followed for auditability, such as holding 5 rooms after Town Hall, 80% retention (this portion is very high and optimistic) of the general meeting participants for the After Town Hall and etc. All of this could be directly monitored by the meeting participants themselves, we could select some members who were not members of the group but who had a commitment to regularly participate in the Town Halls, to, according to their interests, enter the rooms. The Catalyst Swarm Group itself could provide feedback through infographics to be presented during the Town Hall's own progress. Therefore, I believe that the team was concerned with providing content to exercise auditability in a satisfactory manner.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 19, "ne": 9, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "this proposal opens an opportunity for public discussions as well as allows new Cardano members to learn and express their ideas/thoughts publicly. This is a great way to expand the Cardano community as well as engage the Cardano ecosystem members. \r\nTown Hall event is attracting a lot of active and highly engaged community members and therefore the option to have an option for anyone to create a breakout room creates a great opportunity for everyone to express their thoughts/worries/comments. ", "q0r": 5, "q1": "Taking into account that this team has already successfully managed the After Town Hall breakout rooms, they have gathered an impressive experience to deliver a high-quality event. So based on the proposer's solid track record of previous After Town Hall breakout room organization, it is highly likely this proposal will be implemented successfully. The requested budget looks small compared to the amount of work they are planning to do as there are some tasks (like video editing) that requires a lot of organizers' time, still, it's doable as they have previous experience on doing these tasks. ", "q1r": 5, "q2": "As these are event-specific tasks, then it's quite easy to audit the proposal weekly. the roadmap is easy to understand and detailed. Also, the team has a ready-made reporting system that they have used for previous funds which give insight into the member participation. ", "q2r": 5, "assessor": "z_assessor_713", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a great idea, very impactful for the growth of Cardano ecosystem and Project Catalyst by organizing breakout rooms for participants of the Cardano community to discuss about current events after every Town Hall. The proposal is completely within the challenge and clearly going to add value to the Cardano ecosystem.", "q0r": 5, "q1": "The proposal team are Catalyst Community members (fulltime); besides, they have organized the After Town Halls successfully. (This is the scaling up of the funded 'After Town Hall' proposal in Fund6). Therefore, feasibility of the proposal should not be a problem. The budget is outlined clearly and broken down into identifiable items and be reasonable to achieve the set goals. I was a newcomer joining a Town Hall and breakout room after Town Hall, and watched Swarm Youtube videos since I could not arrange the schedule to join live. So I completely agree the proposal is going to be successfully implemented.", "q1r": 5, "q2": "I strongly agree the proposal is fully auditable since they provide a transparent and understandable process by documents and Swarm Youtube videos. Roadmap with milestones and time horizon are provided clearly. The targeted problem and the solution is described in understandable details.\r\nI would like to ask about section (C) How the After Town Hall works, right above (3) the proposers said: 'Upload the recorded videos on:' (then (3)). Was the team missing something?", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a brilliant idea. The goals align with the challenge settings and if successful will earn Cardano good points.", "q0r": 4, "q1": "From the information provided in the relevant experience section, I believe the team possess the skills and experience needed to implement the proposal (links are provided). The proposer has broken down the budget into identifiable items. The proposal has also got a detailed plan for implementation.", "q1r": 4, "q2": "The proposal has outlined a roadmap, some key milestones and KPIs for the success of the proposal. The proposer has clearly described the targeted problem.\r\nWhat is lacking is a detailed timeline for the implementation of the proposal.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal has been achieving huge positive impact on the goals and objectives of the campaign in the past and will continue to be a welcome  development considering the immense benefits of the proposal.", "q0r": 5, "q1": "In addition to the requisite experience of the team from past event activities, the proposal is well detailed and articulated by providing detailed plans to effectively moderate  and make adjustments when necessary. Therefore in my opinion, the team has the capacity and competence to implement the project successfully.", "q1r": 4, "q2": "The project has provided more than sufficient information and  metrics to assess its progress and performance of the project.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 23, "ne": 2, "ng": 13, "nfo": 8, "vca_o": 1}], "solution": "Organize breakout rooms after each weekly Town Hall to discuss current events. Provide space for funded and upcoming projects and ideas.", "experience": "We are highly engaged fulltime Catalyst Community members and successfully organize the After Town Halls since June 2021"}