{"id": 381273, "author": "tobrien", "title": "Sustainability & Food Provenance", "url": "https://cardano.ideascale.com/a/dtd/381273-48088", "category": 26234, "amount": 7300, "description": "An unmet need to engage with the rest of the world in areas we cannot solve alone.", "funded": 0, "upvotes": 17083972, "downvotes": 18412295, "votes_result": 1328323, "votes_cast": 206, "f6_no_assessments": 11, "f6_rating": 2.212121212121212, "videos": [], "media": [], "f6_assessments": [{"q0": "While this proposal presents an interesting endeavour, and does fit within the challenge setting, it does not describe in detail how it wants to achieve what it sets up to. The title and intro suggest that the hosted events would be about sustainability and food provenance, but later on it is presented as a more generalised event. I would suggest re-submitting the proposal with a detailed description about the focus of these events and the areas of expertise that would be discussed. That would also make it easier to evaluate the impact it would have on the entire Cardano eco-system.", "q0r": 2, "q1": "While the proposer has written only a brief description about his relevant experience that might suggest why he could complete this proposal successfully, a more elaborate description on the tasks he fulfilled in prior events would consolidate his assertion. \r\nThe proposal does not contain information regarding a detailed timeline, the people or skills needed to perform the necessary tasks or what those necessary tasks are. There is mention of speakers being selected by the Cardano community, but this selection process is not further described.\r\nI think this proposal is a good concept that needs more time, so it can be assessed properly.", "q1r": 2, "q2": "The proposal lacks some very important information regarding KPIs, roadmap, and potential risks that would help the community in evaluating its progress.\r\nThe problem is not sufficiently described, thus making it hard for the solution to be clearly understood.\r\nTo conclude, the progress and success of this proposal is hard to evaluate.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 22, "ne": 4, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "Yes it does because they would be putting on a sustainability conference as a community event. ", "q0r": 4, "q1": "Because this proposal doesn't have any detail on the project team other than stating founder of the eastern town hall, and host of Cardano summit.", "q1r": 2, "q2": "Unfortunately, I don't think this is able to be audited. They give a road map but am sure when the conference would take place if funded, and doesn't show any key metrics for future auditing.", "q2r": 2, "assessor": "z_assessor_263", "no_vca": 25, "ne": 0, "ng": 14, "nfo": 11, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely that Cardano needs to engage with the rest of the world in areas we cannot solve alone\r\n\r\nIt is not clear that this proposal falls within the scope of the challenge brief by creating some mechanisms to inform investors\r\n \r\nThis proposal does not show how it plans to do this beyond hosting a conference\r\nNo metrics are stated\r\n\r\nNothing has been proposed  as a solution\r\n\r\n \r\nI cant say that this project adequately addresses the challenge  hence i have given it a 1 star rating.\r\n \r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Work on some smaller zoom events with perhaps one speaker at a time who would speak voluntarily. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.", "q0r": 1, "q1": "\r\n \r\nThe proposers have provided   no evidence  of themselves  The Linkedin Profiles have not been provided.   \r\n \r\n  \r\n The links are  not sufficient  \r\n \r\n   \r\nIts unknown if the proposer is competent to do these online classes. Though he has organized the Easten Town Hall, this is a much larger event.\r\n \r\n\r\nNumber of team members required to complete proposal is not known. \r\n \r\n \r\nA sum of 7300 has been given as budget but no indications as to what it would be used for to solve the challenge. \r\n \r\n  \r\nThe budget is just one figure. Nothing has been told as to how it would be used.\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nThe proposal gives no sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are not described.   \r\n  \r\nThe proposal has no technical aspects which have to be addressed \r\nThe proposer has not identified risks in this proposal  \r\n  \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\nGiven experience and plan presented it is impossible that this proposal will be implemented successfully . hence I am giving this proposal a 1 star rating.\r\n\r\n", "q1r": 1, "q2": " \r\nThere is no roadmap with milestones and a time horizon for achievement   \r\n \r\n\r\n \r\nThe Metrics/KPIs that define the success of the proposal have  been specified.\r\n \r\n  \r\nThe proposer has not identified some possible hurdles, challenges and difficulties such as translation of technical terms.\r\n\r\n \r\n \r\nAre there contingency plans in place for various outcomes?\r\n\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence I have given it a 1 star rating.\r\n ", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 24, "ne": 4, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "The scope of the problem statement in this proposal is too large and vague. There is indeed aspects of truth in the problem statement, most specifically \"...unmet need to engage with the rest of the world...\". If it were to be specified what area would be the direct focus, this proposal would be more impactful and measurable. It also does not clearly state the value added to the Cardano ecosystem besides engagement and talks. Though there are definite merits in engagement and talks, but the topic of the event and method of engagement should be more specified. The proposer does mention this briefly, the topic of \"Sustainability and Food Provenance\" but unfortunately does not go any further than using it just as a headline. Since it is an online speaker event, perhaps engagement can be build by using tactics such as mini-tasks or incentives or simple yes-or-no quizzes etc. Due to this proposal in general being not specific it is ineffective in addressing any specific problems in the Challenge setting.", "q0r": 2, "q1": "Experience wise the proposer does show ability to host such an event but an event of this magnitude needs a team. This proposal has no mentioning of it, this generalist approach also continues on into the budget and timeline details. An example of this, is the marketing budget, where it is stated the need of $4000. Which is a substantial amount for this proposal, for it takes over 50% of the total budget. Yet there is no detailed plan on what will be achieved, how to achieve it and timeline to achieve it. There is also no fleshing out of the proposer's experience or does it consider any risk and challenge that might be met. This proposal would most likely not achieve it's intent.", "q1r": 2, "q2": "Information provided by the proposer is unfortunately insufficient in almost all areas. Starting from a clear and detailed roadmap with key milestones to KPI's and various metrics. All information are again still very general. This perhaps stems from the problem statement and solution provided, that although it connects, is still to vague and open-ended. I suspect the proposer due to one reason or another did not have more time to flesh out this proposal. Recommend the proposer to attend workshops held by the Catalyst School.", "q2r": 2, "assessor": "z_assessor_635", "no_vca": 20, "ne": 9, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "---------------------------"}, {"q0": "\"Proposal is trying to create a community event that brings together all people interested in various global issues. As a result, it can be beneficial for Cardano to host that conference. This is a pretty good idea to connect people in different fields and introduce them to Cardano. Because Cardano is aiming to be a solution that can solve problems in different areas of the globe. I appreciate this idea.\r\nBut Proposer has yet to offer a specific plan for that conference content. How to attract people from many different fields to converge on one conference? Participants usually only care about 2-3 topics in the conference, do they have to listen to all 10 speakers? How to link Cardano content to that conference to get people's attention? With 10 speakers in 10 different fields but the goal is only 50 participants, on average 5 people interested in 1 field is too few or not?\r\nI think the team should spend more time coming up with a concrete plan for this idea\"", "q0r": 3, "q1": "\"The team is founding member of Eastern Town Hall and organizer of Vietnam Cardano Summit is a great experience to do Cardano related conferences like this. But I have yet to see the team give evidence for the experience they offer. So it is difficult to verify that the experience of the above team is true or false.\r\nI've seen a proposal that gives numbers about the goals they want to achieve, over 10 speakers who are leaders of their field and over 50 attendees, but the team hasn't come up with a specific plan to achieve those numbers. Therefore, it is very difficult for this proposal to be highly feasible\"", "q1r": 2, "q2": "Although the proposer has shown us the budget breakdown, it is still not specific about the plan and the tasks. The goal of this conference with 10 speakers in different fields will attract more than 50 participants. But I still have not seen the key metrics related to Cardano such as the number of newly registered wallets, CA, vCA or proposer,.... Therefore, it is difficult to successfully audit this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 21, "ne": 5, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Can you describe in more detail how this proposal contributes to the community? The project can also be better placed within the Miscellaneous Challenge.", "q0r": 2, "q1": "Organizing the conference will be possible, but the roadmap has not been worked out well, also here, if there's no good connection between the proposal and the community this lowers the chance to get implemented. ", "q1r": 3, "q2": "The success is described but very minimal, I would still like to read more details and implement more KPIs in the project proposal. There is a budget that looks plausible, but also does not include all costs or there is too little subdivision, I also miss several categories that will require a budget.", "q2r": 2, "assessor": "z_assessor_667", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Love the idea to provide an opportunity of partnerships and network towards sustainability and food provenance. Though what's lacking is what are the potential speakers that the proposer have in mind? How do the proposer achieve these sets of goals? A list and detailed key metrics and roadmap should be stated to have a broader vision and mission for the idea.", "q0r": 3, "q1": "With the given success metrics, it can be improved by breaking down into a more in-depth key point of the how(s). For example, the proposer have already initiated an incentive of listing leaders that have potential to give a conference. A detailed ways of marketing and planning to reach attendees to increase participation into the proposal.", "q1r": 3, "q2": "The fund required seems reasonable, but breaking the the allocation more detailed will be easier for auditability. Moreover, tracking and documenting specific data for each conference held will be important too. Lastly, how does the budget flow in the marketing to align with the success metrics. What are risks involved and have been calculated? What are the challenges that will faced when minor problems occur? ", "q2r": 2, "assessor": "z_assessor_669", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "It is a good idea. However, I can't see the relationship between the problem and challenge settings. The proposal has left out the goals for the implementation and without the goals, it is difficult to determine whether the proposal fits into the challenge settings.", "q0r": 4, "q1": "The information provided is not strong enough to ascertain the skills and experience of the proposer. There are no links and references. For the budget, it is presented well.\r\nThe proposer has not factored in risks/challenges involved in the implementation of the proposal.", "q1r": 3, "q2": "The roadmap and time horizon for implementation are stated. There are no success metrics for the proposal. For the purposes of future proposals, it important to add metrics/KPIs so that the proposal would be more auditable. If the proposed solution is implemented it provides a useful solution to the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The proposal would consider being specific to solving a particular problem. The conference topics must fit into solving the chosen solution as well.", "q0r": 2, "q1": "The team has great experience therefore I am a bit surprised about the input in the proposal. More details are needed .", "q1r": 1, "q2": "There is no road map or documentation of activities to enable auditing of successful outcomes. ", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 17, "ne": 0, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The proposal struggles to address any of the objectives of the challenge.  The proposers request for $7,300 to organise conferences led by leaders in their field, does not explain how it promotes awareness of Cardano.  The only comment that is slightly related is that \"there is a hope\" that he will be able to recruit new members to the Cardano community.\r\nThe proposer should spend time looking in detail at each section of this proposal and possibly look to engage a Catalyst Mentor to help deconstruct and then reconstruct in readiness for a future Fund.   ", "q0r": 1, "q1": "The proposer states that he is a founding member of the Eastern Town Hall and organiser of Cardano Summit but no references have been provided ie. links and no details around what the proposers actual role and responsibilities were in these endeavours. Providing this would give voters confidence in the proposer abilities.\r\nA very basic outline of a plan is provided.  Insufficient detail has been provided to assess it properly.  Once again a very brief cost breakdown is provided the proposer should provide more details on who and how the speakers will be recruited, also provide a breakdown on how the marketing budget of $4,000 will be spent.\r\n", "q1r": 1, "q2": "Unable to assess this section as no metrics have been given that relate to the ones outlined in the challenge brief.  If this proposal were to come back in the future fund, taking account of the comments above, the metrics should be defined in terms of number of new people integrated into Cardano (new voters, proposers and CAs).", "q2r": 1, "assessor": "z_assessor_774", "no_vca": 19, "ne": 6, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The proposal aims to promote events outside project catalyst community to engage and create awareness for Cardano and its ecosystem. In my opinion, the problem statement does not clearly address the goals and set objectives and thus may not bring much impact to address the goals in this campaign.", "q0r": 3, "q1": "The team has requisite experience and skill, having successfully hosted townhalls meetings and cardano summits in Vietnam. However, there is no information about how to reach your target audience and any drawbacks that might be encountered", "q1r": 4, "q2": "There is no much information to assess what success would look like such as the no of participants targeted, Number of potential new members that can be onboarded to project catalyst per event etc.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 21, "ne": 1, "ng": 14, "nfo": 6, "vca_o": 1}], "solution": "Organize a global conferences that features speakers who are thought leaders in their respective field.", "experience": "Founding member of Eastern Town Hall.  Organizer of Vietnam Cardano Summit"}