{"id": 381926, "author": "felixweber", "title": "Challenge Fest by Catalyst Swarm", "url": "https://cardano.ideascale.com/a/dtd/381926-48088", "category": 26234, "amount": 5000, "description": "Challenge Teams and Proposer need a place to connect and to align ideas and actions in a early stage of a Catalyst Funding round", "funded": 2, "upvotes": 64031671, "downvotes": 4257266, "votes_result": 59774405, "votes_cast": 334, "f6_no_assessments": 11, "f6_rating": 4.484848484848485, "videos": [], "media": [], "f6_assessments": [{"q0": "the proposal falls well within the scope of the challenge setting. such an event would greatly enhance the effectiveness of challenge teams, which in turn will greatly enhance the effectiveness of catalyst as a whole. this will lead to greater efficiency and higher quality proposals, and thus greater return on funds distributed through catalyst.", "q0r": 5, "q1": "the owners of this proposal have been successfully running a number of very successful events online for catalyst, including the weekly swarm sessions. there is every reason to expect them to be able to successfully implement this proposal.\r\n\r\nfurthermore, the team has already successfully run the proposed event for fund 7, this leaves no doubt at all to the success of the proposal.", "q1r": 5, "q2": "the proposal is easily audited. looking at the fund 7 challenge fest suggests a very high return on the funds requested in this proposal.", "q2r": 5, "assessor": "z_assessor_218", "no_vca": 22, "ne": 3, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely Challenge Teams and Proposer need a place to connect and to align ideas and actions in a early stage of a Catalyst Funding round\r\n.\r\n It is clear that this proposal falls within the scope of the challenge brief by organizing a place where Challenge Teams and proposers a place to build relations and connections to increase Proposal Qualities and Impact\r\n\r\n This proposal shows how it adds value to the Cardano system by creating such a place. \r\n\r\n   Key metrics  would be  number of participants,  number of breakout rooms, number of participants in each Challenge fest session, number of proposers and voters.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more rooms and events\r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members in presentations and discussions.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n ", "q0r": 5, "q1": "\r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events as well as previous Ideafests. \r\n \r\n The links are sufficient. \r\n I have visited these links and contacted the relevant people\r\n The proposers are well experienced and competent to do the event.\r\n The type and number of team members required to implement the proposal is stated.\r\nThe team structure is listed and experienced.\r\n The budget has not been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n\r\nResources  necessary to implement the proposal are described.    \r\n\r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\n \r\nThere is a roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms. \r\n  \r\n\r\n The problem has been clearly understood and solution has been given in much detail.\r\n  \r\n The proposer has not identified possible hurdles, challenges and difficulties.\r\n  \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n .\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 17, "ne": 5, "ng": 4, "nfo": 8, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies an important problem within the challenge which by adressing it, will bring an great benefit to the Catalyst community and the Cardano ecosystem; the problem of communication of the challenges goals to proposers - We still see a lot of proposals that struggle to properly adress the challenge. This will sure do something to increase the overall quality of proposals. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince the Catalyst Swarm is a great multiplicator and people active in it keep on growing, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "The Catalyst swarm are a really active and vital part of the Catalyst community. Without a doubt they will be able to successfully enact this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large part of the community as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is without a doubt an example of a good, feasible proposal.", "q1r": 5, "q2": " Well-defined, detailed metrics and KPIs are presented that define the success of the proposal. A clear, understandable problem description is supplemented by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 5, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "Although this problem does address a need for current proposers, it doesn't address increasing involvement from voters or new members into the community. It will help to have a setting for propers and the challenge team for meaningful participation for existing members, but it doesn't address voters, newcomers, or the larger community. ", "q0r": 3, "q1": "It does not give details on the teams experience or who they are aside from stating they've been holding events since fund3. It would be helpful to provide more details on their roadmap and what will be happening in these events. The budget breakdown is also very vague as it is just \"organize the event, host the event, and event post tasks.\" They could successfully create the space, but their proposal does not give confidence that they will do so.", "q1r": 3, "q2": "This proposal would benefit from providing specifics on their roadmap, what they intend to provide in this event, how they can continue this event, and exactly how the funds will be spent. Auditing this would be difficult and subjective as we don't have specific KPIs to measure that really show the impact of this proposal.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 18, "ne": 2, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is providing a service that will streamline and create a structure that assists in the creation of high quality proposals. The creation of Challenge Team was great, but it did not fully meet it's potential due to that there was no available placeholder. By having this Challenge Fest, a gatekeeper prior to CA's, expect a natural progression of quality to occur not only in the proposals but also the quality of CA's assessment review. Through their solution  this proposal addresses various problems and key metrics to achieve in the Challenge settings. This is a proper example on how to approach a Challenge setting, with that said the solution provided will definitely scale.", "q0r": 5, "q1": "The proposers are not just high functioning individuals but also high functioning community in the form of Catalyst Swarm. These proposers have from time to time proven they provide solutions that grows in value, not only for their own solution but the Project Catalyst community as a whole. There is no doubt, they will execute and deliver on their implementation plan, even though the dates are not fully detailed. In fact they have already done a pilot. Budget is indeed broken down but criminally underbudget. What factor drove these hi-performing proposers to ask such a low budget is beyond me. Is it because the CA system is broken? The voting system is broken? Or even perhaps the Challenge setting is outdated? Questions need to be asked. As much as I want to be bias and give them a 5-star rating in this section, it is not possible. For they have not considered the risk and challenges, for example; even after going through this Challenge Fest, proposals still submits low quality proposal for whatever reason, 'How do they account for that?' or the classic question, 'What will happen if not funded?'. Despite that, this proposal if funded will be implemented successfully.", "q1r": 4, "q2": "There are roadmaps with adjoining actions but only a precursor timeline. KPI's are also available though without measurable metrics. Will overlook these missing metrics on the basis of; they have already done a pilot project and the various other community projects they have successfully delivered are to my knowledge, on-time and on-budget. Problem statement and solution is solid and interconnected, which manifest itself into this concise proposal.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 21, "ne": 10, "ng": 11, "nfo": 0, "vca_o": 1, "reply": "If the initiative goes well we will be requesting for continuation funds in F8, and possible F9. As part of our commitment to the Catalyst purpose, the idea is to find ways to make this initiative sustainable on its own, so it won't depend on the treasury, but that will be build and decided within the community's first steps. "}, {"q0": "I can see that there is a clear problem identification from that of the challenge. Cardano undoubtedly is going to benefit once the proposal is executed, because it's whole idea is to give more insight to proposers and other Cardano community members. The goals of the proposal do not conflict with the challenge settings just that I expecting that the proposal will state the goals clearly.", "q0r": 4, "q1": "The team was part of Catalyst since fund 3 and that I believe that they are skilled and experienced. It's good that they have added a video and relevant links. The team still looks vague. The budget of the team is well presented. The detailed plan of the proposal has given more insight as to how the proposal would be implemented. I was also hoping to see resources that will be needed for the implementation to be stated\r\nThe team have not stated risks/challenges that would come up as a result of implementation.", "q1r": 4, "q2": "The proposal has a roadmap and KPIs that define the proposal's success. However milestones and time horizon for implementation are not clearly stated. One thing I can also see is that, the proposal has a great potential in solving the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The ideas provide direct benefit to the catalyst community. Empowering challenge teams and proposers to refine their idea before submitting them. This effectively address the problem by providing mentorship for proposers.", "q0r": 5, "q1": "Catalyst Swarm team experience is well endowed and popular among the community. I think this event is strategic to help refine the idea and provide ample time for the teams or proposers to work on polishing the idea before submitting it. \r\n\r\nThe activities are practical and achievable. The outcomes are measurable too. I think successful proposals that get funding after this event should be included in the deliverables. The track record and experience of the team are enough to prove that the event would be implemented successfully. ", "q1r": 5, "q2": "The proposal has a trackable road map that would prove useful for auditing. The team is transparent and open. The collaboration with other challenge team would be helpful for auditing as well.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "A good idea that can improve the participation and quality of the proposers and proposals respectively. I wish that the budget had some more details of what the stated amounts are going into . it will be good if the budget is clarified. Also you needed to explain further the value and need for the piloted programme as mentioned. These explanations will give a great proposal. Kudus", "q0r": 4, "q1": "Given that the project has been piloted already, I believe the team has what it takes to implement the project in fund8 except that I wanted to know who qualifies to be a challenge member. Another question is what if we are all first-timers in a group? \r\nthe team should find a way to let veteran/successful proposers interact with new ones", "q1r": 4, "q2": "the KPIs are clear enough but I expected numbers to be attached. how many challenge teams are looking forward to bringing on board? how many participating proposers will you attract? this clarity will be very important for audit.", "q2r": 3, "assessor": "z_assessor_728", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Providing the platform to bring proposers and challenge teams together with the aim of connecting, mentor and build relationships is a great way of enhancing the cardano ecosystem.", "q0r": 4, "q1": "Despite the experience of the team, the timeline for the project is not well structured to include when each event will take place under the project. However, there are well outlined events scheduled under the project and a clear work breakdown structure outlined to execute the proposal. Finally a detailed breakdown of budgetary allocation is provided for the proposal.", "q1r": 4, "q2": "By way of determining the progress and success of the project, the team intends to capture the number of participating challenge teams in the challenge fest and the number of participating proposers in the challenge fest", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 17, "ne": 3, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal does solve a problem by providing a space for challenge teams and for proposers to come together and meet and exchange ideas knowledge etc. This will have a positive impact on the Catalyst Ecosystem, and increase the quality of the proposals submitted in the end. The KPI's in the proposal does match the ones in the challange. I hope to see this projects continue.", "q0r": 5, "q1": "The Proposer has been involved in community events since fund 3, so has demonstrated the capability to successfully host these. a Link has been provided, and shows that the team are successful. The budget has been broken down and seems reasonable. A plan/road map has also been laid out. As a whole to proposal clearly states what they are trying to accomplish. There is no mention of risk or challenges. I have noticed in one of their idea fest presentations someone's presentation was not recorded, but they have apologized and are committed to fixing where things go wrong.\r\n", "q1r": 5, "q2": "The success of the proposal will be measured by the number of participating challenge teams and proposers. This seems to bee a reasonable way of measuring the success of the project. It is not clear how the community can track the progress, and indication here of where and how the success of the project can be tracked would be a great idea especially for community members not directly involved in these events.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This is a great community event that has enormous to ensure active collaborations between specific catalyst community members ( that is, Challenge teams and Proposers). This proposal has the potential to help engage, resolve project catalyst issues particularly, a  producing more quality and funded proposals, and make catalyst community, efficient and effective in directing the future of the cardano ecosystem.", "q0r": 5, "q1": "From the past experience and hosting of other  events in the catalyst community, the team is more than capable to deliver on this proposal successfully. In addition, there is also a reasonable and well articulated deployment of the funds to ensure success of the project.", "q1r": 5, "q2": "The KPIs and/ or metrics provided is sufficient to assess the eventual performance of the project. ", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 20, "ne": 1, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "The Challenge Fest offers Challenge Teams and proposers a place to build relations and connections to increase Proposal Qualities and Impact", "experience": "Catalyst Swarm organize and hosts successful Community Events since Fund 3"}