{"id": 383542, "author": "tevosaks", "title": "Mini Proposal Workshops", "url": "https://cardano.ideascale.com/a/dtd/383542-48088", "category": 26234, "amount": 3456, "description": "Proposers don't have the experience to make their proposals understandable for voters", "funded": 2, "upvotes": 85513606, "downvotes": 3930052, "votes_result": 81583554, "votes_cast": 403, "f6_no_assessments": 7, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is excellent and fully meets the objectives of the challenge, because it seeks to create small workshops (events) in order to teach, guide and support people who intend to submit proposals, in order to make this experience more collective and with results of high quality. I believe that one of the biggest problems with Catalyst is when, precisely, the authors are not able to express themselves properly. Various situations can happen; authors may not be able to translate into simple language and that everyone understands their idea, especially if it is very technical in nature; they can also write an unbalanced proposal, in the sense of: authors often spend most of their time talking about why their project is important, arguing for relevance, but they don't explain very well what will be done (the focus goes almost entirely to impact and there is no space for a script, for example). With the advent of these workshops, people who have been involved for a long time with Catalyst could guide newcomers, because there's really no point in having a great idea and not knowing how to express it. I believe that the proposal is of high value, not least because it is a continuation of a proposal submitted in the past (I would like to know if the previous one was financed!), which also demonstrates that the authors already have the idea and are working in it for a long time, thus increasing the position of trust. Furthermore, they provide several links, such as a youtube channel with several workshops already done, a docs with some proposals attached (I confess that I was a little confused about this part, would these be the proposals broken down in the miro?) and a very document. rich in the miro, where we can graphically see the process of collective creation of proposals.", "q0r": 5, "q1": "The authors demonstrate in a practical way their ability to carry out the project, through the various attached links, which I mentioned in the previous topic, they show that the work is already being done, transmitting total confidence in its preparation. However, I would like to know who they are one by one, I would like to see this detail here in the proposal itself. What is Tevo trained in, what is your area of ​​professional activity? How did Cauê get to know the catalyst, what has he been doing since bottom 2? It would be good if there was more accurate information about both, in order to get to know them more intimately. I know they are capable of how much content they create, but if such information were provided, we would have 100% knowledge about the pair. About a script, this proposal is different from the others because it is not made up of several different activities that together would compose a whole; what happens here are the workshops and the follow-up through the miro, right? It would be interesting then for them to inform us how often these meetings would take place, how many proponents are expected for each one, how the follow-up would take place (do they have a channel in discord where they keep in touch with the people they help?). I felt a lack of detail in this regard, understanding the logistics beyond the meetings themselves, because about them, we have several examples on youtube that demonstrate how they would be. At a certain point in the proposal, the authors cite several professionals who would be involved, and how much would be the total working time for each. But I think this information got a little loose, I mean, who would these people be, would they make up the rest of the team, apart from the two authors of the proposal? And finally, regarding the requested financial amount, it is very reasonable, I think it is totally fair for the project. It's divided by hours - we know it's $30 an hour, and we know how many hours each professional would work. I just got confused about what \"buffer\" would be... English is not my mother tongue, I've never heard it before, it would be good if the authors would clarify this question. Furthermore, I believe that the proposal is well covered in this topic, needing only improvements in specific parts.", "q1r": 4, "q2": "The authors include some straightforward information about auditability. This could also be done in a simple way, just follow the sessions and also the construction of the viewpoint, see the quality of the proposals launched by the people who participated in the workshops, it would be interesting to compare a proposal from before and after they received the guidance. I suggest that any member of the community who has already submitted proposals participate in the workshops in order to assess their quality and provide feedback to the rest of us. Authors could also prepare a doc with a link to the proposals (if there are many, it could be just a few) that they have guided and send it via e-mail to community members; that way we could see in practice what was done. It is more appropriate for this to be done after the evaluation period by the CA's, so that we can monitor the quality of the work. Therefore, I believe that, in this proposal, auditability is quite possible and clear to be done, through the monitoring of the miro, participation in workshops and preparation of reports with the final results; it is enough that there is mutual collaboration between the team and the community.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Good idea. These sort of workshops do two things, bring the community together and assist the proposers in executing their plans. Reminds me of toastmasters except for proposals", "q0r": 5, "q1": "The team appears to have experience with past funding rounds and have demonstrated that they are equiped for the task because this proposal itself is well laid out and makes sense", "q1r": 5, "q2": "metrics, plan,supporting video and more all makes it look good to succeed. They have already been doing the work and it shows. With this, it looks pike they will not have any issues to expand their work and progress in helping others", "q2r": 5, "assessor": "z_assessor_119", "no_vca": 28, "ne": 1, "ng": 19, "nfo": 8, "vca_o": 1}, {"q0": "This proposal although only caters to a specific aspect of Project Catalyst, which is mentorship to submit a proper proposal, the effect it provides is massive. There are numerous talented individuals with great ideas that lose their value when transferred into the proposal format due to how it was communicated. What this workshops aims to do, is basically improve the communication process, from idea phase to a proper proposal format. A process that is clearly articulated by the proposer in their various YouTube uploads and Miro boards. Key metrics this proposal seeks to achieve definitely fits an aspect of the Challenge setting. Though in terms of scaling, it might prove challenging, for the mentor is a key aspect here. Another key aspect, is the intimacy of the classes, where this workshop is best suited for 1-to-1 or small groups sessions.", "q0r": 4, "q1": "This workshop has been consistently held by the proposer and has consistent traction. From iteration to iteration there is a notable increase in the quality of this workshop. This current proposal, seeks to take this workshop more mainstream or more visible to the wider Cardano community through the addition of various new team members. This shows how in tune and adept the proposer is with their workshop format. How the budget is fleshed out is quite detailed for it starts from identifying the workload of individuals first. This makes it very clear and can be traced back to the method how the budget was calculated. Through this reverse assessment, we can also gauge the proposers capability to identify the skills needed to further develop this workshop. Unfortunately, there are no clear timeline to; organizing feedback, promote the workshop, timestamping the video etc. or even when does this workshop happen regularly. Or is it a per request basis? Having details like these would be helpful to fully gauge the probable success of this proposal.", "q1r": 4, "q2": "Unfortunately though, there is no clear roadmap and milestones but this is balanced by having compete KPI's that are attached to numerical targets, making this very auditable and measurable. KPI's that are all measurable is something rare in the various proposals submitted in Project Catalyst. For that, this proposer should be applauded for. Between the problem statement and solution is a clear connection, a strong indicator this proposer knows the deliverables of their proposal well.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 18, "ne": 6, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The Mini Proposal workshps seek funds to support workshops in the preliminary phases of a project proposal to increase the quality of the overall proposal through shared insights and discussion on strategy and what makes a quality project proposal. This meets the needs of the challenge through creating an entry point for new entrepreneurs to gain insights and knowledge from others that have more experience and understanding and would have a global impact. While the quality of the delivery of the workshops could increase there is no specific way for this idea to scale as such. ", "q0r": 4, "q1": "The proposer has been running this initiative in previous rounds so has a proven track record of delivering this style of workshop. The timeframe for the project is clearly mapped out with specific hours attached to the team roles that are clearly outlined in the proposal. The overall budget request is minimal and very clearly allocated to work performed in order to acheive the suggested outcomes. ", "q1r": 5, "q2": "The community would be able to see this through the Catalyst Swarm Youtube channel and have some assurance for auditing the outcome delivery. There are some clear goals in this proposal including having small and achievable inputs from community, there are therefor not hugely ambitious numbers included in the target reach for this, however since the project will live onine and act as an educational tool, there are some KPI's specifically and again moderately outlining that. \r\n\r\nThe delivery dates are clearly defined and in alignment with the next funding round of Catalyst to support applicants in that round and encourage further participation. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This Proposal meets the objectives laid out in the challenge section, and will have a positive impact on the Cardano/Catalyst ecosystem. The proposal sets out clearly how they want to measure their progress. I believe this to be a good proposal as the team has been busy with this for a while, and has shown dedication and persistence, they also have achieved funding in the previous fund 6.", "q0r": 5, "q1": "I believe this proposal will be implemented successfully as the budget is set out clearly, and the team has the experience needed. They have provided proof of their experience. The proposer is also not requesting a large amount, this leaves a lot more funds available for other proposals in this challenge.", "q1r": 4, "q2": "The Proposal is clear and there is enough information about the team and metrics which would help the effective tracking of their progress. Their budget is clear and not to much. Maybe add more info on how the community can also track the progress of this project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1, "reply": "In all the sections asessor only states postive facts, but gives less than perfect score. They seem to repeat the assessments in all of the sections."}, {"q0": "The  proposal is definitely needed to continually educate , engage and address challenges towards improving and increasing the number of quality mini proposal that are eventually funded. The proposal is a follow -up funding request to create the workshop events to facilitate collaboration and education of both existing and new community members towards adding value to the project catalyst through presentation of quality mini-proposals. ", "q0r": 5, "q1": "The team has the requisite experiences from anchoring this project successfully since fund 4 and coupled with its detailed resource deployments and roadmaps, it is very likely to that the proposal will be implemented successfully. However, there is no mention of any form of promoting these events so as to enhance chances of more active participation from the community, this idea will be helpful to the success of the project.", "q1r": 4, "q2": "There is an elaborate detailed metrics to assess the performance and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "This fits in perfectly with the campaign requirements; it addresses the disconnect between proposers and the proposal process. The proposed collaborative workshops will provide meaningful support to new and veteran proposers alike, and they have potential to create significant connections between participants.", "q0r": 5, "q1": "I am confident this will be successful based on the proposers' past experience in putting on these workshops. The question really should be: how successful will this be? That is going to depend on marketing and outreach, and that is not currently a major part of the proposal. The proposers need more emphasis on marketing their workshops and other products to proposers/potential proposers for this to be exceptional.", "q1r": 4, "q2": "The proposal has realistic metrics for gauging success, and the progress will be easily identifiable as the workshops progress. Easily a 5-star rating for audibility.", "q2r": 5, "assessor": "z_assessor_947", "no_vca": 22, "ne": 1, "ng": 17, "nfo": 4, "vca_o": 1}], "solution": "Workshops that help entrepreneurs to create a proposal and effectively communicate with voters", "experience": "Actively facilitating and learning how to create proposals together since fund 4.\nPublic workshops: https://cutt.ly/oTLgWu6"}