{"id": 384076, "author": "cardano4climate", "title": "Cardano4Climate Community Events", "url": "https://cardano.ideascale.com/a/dtd/384076-48088", "category": 26234, "amount": 4181, "description": "Cardano's impact on Climate Change must be measurable. Events & meetings are crucial to connect local challenges & mission-driven solutions", "funded": 2, "upvotes": 109109384, "downvotes": 9475141, "votes_result": 99634243, "votes_cast": 873, "f6_no_assessments": 9, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "As an active Catalyst community member, an event/community organizer myself and a very concerned earth citizen on the Climate issues we are about to face, I totally agree that this initiative will produce a great impact, not only to the community via the Events they are hosting, but also to the wider community of the Planet, aiming to help to solve two key problems, the Challenge one and the Earth/Human one.\r\n\r\nThe proposal has a clear statement in how to create this impact, by solving a specific problem, which is drive a conscious community and promote Cardano's capabilities to help in solving critical aspects of the Climate problem.\r\n\r\nThe challenge objectives seek to enable community events to promote participation, onboard new members, form new teams, etc. and this proposal aligns very well to all those objectives, providing relevant KPIs to prove so.", "q0r": 5, "q1": "The proposal timeline and milestones and clearly outlined, the proposed timeframe is adequate and the number of events as a combination of weekly (12) and monthly (3), can be achieved, based on the evidence, track record and the team assigned.\r\n\r\nThe team is composed of several relevant Catalyst community members, that are not only very active within the community, but also already delivering on other initiatives and projects. Their show a good combination of skills and knowledge to form a diverse and well prepared team, up to the challenge.\r\n\r\nThe budget requested though is detailed and very specific, is kind of conservative, I foresee that some costs are going to be higher than what is outlined in the proposal, I do remain confident that the project will be done anyway, as per the support by WADA and SWARM, but it would've been better to request a proper amount that doesn't create doubts on that front.\r\nAlso if you are planning to have other sources of funding, such as with the 150 members of the community, personal funds or thru collaboration with other groups, I recommend you mention that on the proposal, to further show stronger transparency and feasibility.\r\n\r\nAs with many proposals in this space, that aims for a continual producing of events, there could be some risks on the road, that can be mitigated if they are identified and understood properly, that should be part of the proposal on next funds, to show how you plan to address continuation and sustainability of the initiative.\r\n", "q1r": 4, "q2": "The Timeline, Milestones and KPIs provided are specific and well thought, with SMART concepts within them.\r\nThe community will be able to track and audit this project without any problems, and also the proposers will be able to clearly provide evidence and proof of accomplishment.\r\nThe github provided and the commitment to document and publish all the activities produced will be a great resource to produce also public evidence of the accomplished efforts and impact .\r\n", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 20, "ne": 12, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The topic of this proposal is pressing for it addresses a part of the 'Existential Risk' our society is currently facing which is Climate Change. How this proposal approaches tackling this is issue within the Challenge setting is by creating a placeholder for like-minded individuals to discuss this topic and eventually submit a proposal on it that utilizes the blockchain Cardano. A refreshing a new community will come out from this proposal, opening up a variety of new solutions that perhaps Project Catalyst have never seen. All this addresses various Challenge settings; from onboarding and integrating new members to Catalyst, using events to create new teams and workshops/break out rooms to increase collaboration. Unfortunately though, the technical expertise supply and regulations supporting the union of climate change with blockchain makes this a bit down the priority. Bottom line, Cardano needs more developers. The case of 'Regenerative Farming', although logically, ecologically and numerically makes sense in the long run, it is too disruptive and time consuming to make it easy to apply in the current market. Especially with covid, farmers and such need a quick turnaround to profit.", "q0r": 4, "q1": "Although there are no links to verify their experience the team are active members of the community. At the very least, 5 out of 8 are highly active and continuously provide value to Project Catalyst through direct contribution and to the Cardano ecosystem, through funded proposals. There is no doubt this proposal will be successful. Their budget although very clear and accompanied with correlating action plans, again raises questions on Project Catalyst's system or structure. How could 8 active and proven members who are creating a whole new team low-ball themselves? A budget of only $4000 for 8 individuals for 3 months? Initially thought this was a proposer issue, but this is the 7th case of low-balling. Regarding implementation timeline is also clear, it seeks to follow-up their pilot project. Only difference here is that they are asking funding's to develop this initiative so it can impact and reach more individuals. Unfortunately they have not considered potential risk and challenges they might face in the further implementation of their movement.", "q1r": 4, "q2": "Roadmap provided is very detailed and there are enough milestones that makes tracking this event auditable. This also takes account their KPI's, although not all are accompanied with numbers, the core KPI's are indeed measurable. Though both problem statement and solution connect, the message intended to be delivered is a bit vague. In their problem statement, it is stated 'Cardano's impact on Climate Change must be measurable.', the questions is 'Why?'. If the answer is so people can find recordings, discussions and data on it to build awareness and know-how, then this overlaps with the work of QA-DAO. Which in the case of QA-DAO, their doing and proposing stellar work. The proposal content though is great and had a clear goal but do not know how this proposal's appearance will pan out in the voter app.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "C4C has grown a small proposal into a community that is now hard to miss for anyone involved with Cardano and Catalyst.  They bring a positive, solutions oriented voice to the climate change dialogue, centered on Cardano's sustainability and Project Catalyst's ability to help find solutions and achieve success.  Their current proposal seeks to increase the exposure of this message within the Catalyst Community, and with that exposure find and develop proposals that address climate change and Cardano adoption.  Those proposals in turn should scale the whole effort to drive Cardano adoption as a sustainable blockchain for the future.  ", "q0r": 5, "q1": "This proposal team has already implemented many of the deliverables for this proposal, including breakout rooms and meetings on a regular basis and organized events such as their \"Catalyst Sustainability Goals\" with 7 hours of content and collaboration, output that could 3x or better if funding is generated.  They have provided clear  guidelines for the disposition of the budget, and timelines for delivery of the first meetings (basically instantly).  Their team is enthusiastic and extensive, a real bargain on this budget, and testament to their commitment.  They have provided a number of specific KPI that they can pursue within the community, such as discord membership onboarded over time, but they also hint at the ability to increase twitter and youtube outreach, which has potential to bring in more participants from outside the Catalyst community, so those metrics are equally valuable.", "q1r": 5, "q2": "Because the product of this proposal will be a lot of publicly available videos and events, it should be easy for the community to follow along, and since being originally funded in Fund6, they have been quite active engaging with others and keeping everyone up to date.  Additionally, this round of funding they indicate a desire to increase their transparency even more, logging a public github repository (perhaps consider being added to QA-DAO gitbook?) which will be useful for anyone wanting to track the project from its inception.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Strengthening climate action in the Cardano ecosystem is fundamental to strengthening our competitive advantage as one of the lowest carbon footprint blockchains on the planet.  \r\n\r\nIt would be a mistake to ignore the power of engagement and commitment that ecological concerns possess. Today, they are an issue that breathe for itself. Their rationale is clearly understandable. Their ability to inspire the best in human beings, that fire that is believed to be lost in the darkness of the everyday world, is incredible. So, as a matter of both strategy and human decency, Cardano4Climate and its related initiatives should be as high on the Cardano agenda as they are on the global agenda of the 21st century.\r\n\r\nTherefore, when talking about community events, this proposal must have all the support it can possibly offer.  Also, look at their budget figure: $4181.  I bet all my chips that no proposal presents its budget figure in dollars and cents (181).  A sign of honesty and commitment. Every drop of budget used for exactly what is required.", "q0r": 5, "q1": "Please provide more detailed information about the budget.  The information presented is too general.", "q1r": 4, "q2": "Its KPIs are adjusted to the reality of events implementation and are presented as instruments that are easy to measure and relate to the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_541", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "This is a meaningful project that will help a lot to human life now and then, developing more to spread this meaning is the mission of humans, not just this team. As the team said in the proposal, this project will have a strong impact globally and will inspire everyone about Cardano community. \r\nThe KPIs shows clearly the team is really concerned about what challenge givens and they're trying their best for making a better impact on not just Cardano ecosystem but human life. ", "q0r": 5, "q1": "The team had held 1st event in 11/23/2011 and also hosted a lot of Catalyst event. Hence, no doubt that they can do it further. They have a well-explanation about what will happen in this project that helps the roadmap make sense. About the budget, is reasonable with their 1-week event plan. \r\nMoreover, they have shown clearly how feasibility this proposal is in detail with the past experiences and future co-create with other partners. \r\nThe budget required in the scope of this project is reasonable", "q1r": 5, "q2": "They have a detailed roadmap, inspired KPIs and milestone that includes monthly goals and overall metrics guideline. Those infos is fulfilling to help to audit easily this project. \r\nThe team also states the content of the problem in very detail, and that helps their solution make sense and perfectly to solve that problem ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "Awesome idea. Not creating a 'one size fits all' climate solution but driven to host community focus events to discuss climate ideas and provide a participatory solution-based with community members involvement.", "q0r": 5, "q1": "Given the experience and strategic collaboration with other community members, I trust the team to deliver. The proposal has a detailed round of activities and specific and achievable outcomes.  ", "q1r": 5, "q2": "There is more than one process of documenting activities within the proposal. It tells much about the teams' transparency and openness. I think the metric for tracking success is open and easy to follow as well. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The heighten urgency to address climate related problems within the climate community provides the opportunity for the cardano community to show how eco-friendly the cardano community is. Indeed a mission-driven solution to solving climate change will help market the cardano brand. Therefore funding this proposal is laudable.", "q0r": 5, "q1": "The experience of the team in the Cardano community cannot be overestimated hence their track record makes them the ideal team for the climate change project. More importantly, there are well outlined events scheduled within the project and a work breakdown structure is also incorporated within the proposal as well as a well-developed timeline for the proposal. The events scheduled for the proposal will definitely increase the awareness of climate related problems and also enhance the cardano brand. Additionally, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully when given the fund.", "q1r": 5, "q2": "By way of determining the progress and success of the project, the team intends to meet set targets. For instance, the team has an expectation of increasing its; \r\n  1. Monthly growth rate of their telegram channel & discord server by 33% per month\r\n   2. Average number of participants in Cardano4Climate meetings & events by 50% per month\r\n   3. Number of Followers on Twitter\r\n   4. Number of Video-Clicks, Likes & Followers on YouTube\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 17, "ne": 6, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I totally agree that this proposal is creating a robust and collaborative environment, promoting engagements, discussions and iterations about  a particular niche that  is of  tremendous importance  to the global environment and using cardano ecosystem to chart the way to a sustainable global climate through collaborations in free, transparent and friendly manner. ", "q0r": 5, "q1": "The proposal has given more than enough information on the capacity and competence of the team to implement the project successfully. In addition, the well articulated plans and budgetary breakdowns goes to indicate that the proposal is highly feasible", "q1r": 4, "q2": "Am convinced that the proposal has provided adequate and effective measures to assess its progress and performamce if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "With all of the talk surrounding the negative environmental impact of Bitcoin, it would be a huge selling point to position Cardano as not only better for the environment (due to our proof of stake approach) but also as a true visionary in the space. Having the opportunity to convene and plan a coordinated approach is a great idea.", "q0r": 5, "q1": "It is outlined in the proposal the experience that the core team brings to the table. The feasibility and project plan are all explained in a very detailed manner. If the in-depth nature of this project shows anything, it's that this team notices the details.", "q1r": 5, "q2": "The team has outlined their success metrics, budget, and project plan. With this in mind, we have all the necessary information to determine their success if funding is approved.", "q2r": 5, "assessor": "z_assessor_964", "no_vca": 24, "ne": 4, "ng": 13, "nfo": 7, "vca_o": 1}], "solution": "Organize, facilitate, expand, promote, & record monthly events & weekly meetings", "experience": "Hosted after town hall breakout rooms during Fund 6\nHosted weekly pre town hall meetings since mid October\nHosted first event 11-23-2021"}