{"id": 382893, "author": "djrthree", "title": "Tutorials and Hackathon", "url": "https://cardano.ideascale.com/a/dtd/382893-48088", "category": 26247, "amount": 88200, "description": "No hay muchos servicios de IA en el mercado de SingularityNet.", "funded": 1, "upvotes": 23868751, "downvotes": 15262648, "votes_result": 8606103, "votes_cast": 114, "f6_no_assessments": 5, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Whilst this proposal is to create a website, tutorials and hackathons which could be a great idea, there are not enough details on what these would focus on, who they would target etc. ", "q0r": 2, "q1": "There are not enough details on how/where the hackathons would be held, what they would focus on and who the target participants would be. The same goes for the website and tutorials. What would they be teaching, how much content would be provided etc. \r\nWithout those details it is hard to verify the proposer has the expertise to deliver them and expect them to be delivered succesfully.", "q1r": 1, "q2": "The proposal need more information on what is intended to be delivered so that progress can be audited. How many people in the hackathon, virtual or physical, target audience etc. How much content will be produced, what will be the focus. \r\nThe proposal also need to set some metrics and goals against which success can be measured. How many people enter/participate in the hackathon, how many watch, what other media coverage of the event. How many people watch the tutorials, how many unique views of the website etc.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 34, "ne": 3, "ng": 26, "nfo": 5, "vca_o": 1}, {"q0": "Organising a tutorial video series and hackathon to train developers in the field of AI could have a positive impact on the SingularityNet ecosystem. As SingularityNet is undergoing a process of symbiosis with the Cardano ecosystem, it would also benefit this blockchain. More services means more potential adoption and it could accelerate that process significantly. ", "q0r": 5, "q1": "The proposer has claimed relevant experience as a developer (solidity) and teacher. However, there is no mention of relevant experience in the field of machine learning, nor who would perform the video-editing. If these people are still needed, I suggest making use of the seek-tags to find potential collaborations as they might miss an open-submission period if not advertised properly. ", "q1r": 3, "q2": "The information present is sufficient to determine auditability for a video tutorial series and hackathon. To improve the proposal's strength, consider adding additional information on relevant experience. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 28, "ne": 2, "ng": 21, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is about developing a platform for SN so that the AI provided on SN will have a higher quality. The proposal wants to make technical tutorials about start to finish on how to develop AI services, organize a hackathon, all in favor of the quality. This is within the challenge settings as it would improve overall quality on SingularityNet.", "q0r": 5, "q1": "Regarding the team, we see that the proposer is a solidity developer which gives him the relevant experience to build this platform for SN. Regardless, we are missing some relevant skills regarding AI, the proposer does not state he has knowledge of AI. Does he still need to search for a team member or not? This is a crucial skill to make sure the technical tutorials are of high quality. This could've been elaborated on the budget breakdown if this went into a little more depth. We don't see the number of team members in the budget breakdown.", "q1r": 3, "q2": "We have the necessary information to decide auditability. We are presented with a roadmap and budget breakdown. What could improve the proposal is adding more information on the team as well as adding some KPIs/metrics. What is the active user goal of the platform? How many AI models does the proposer see coming out of this?", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 20, "ne": 3, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "The proposed solution does not match the problem description. Assuming that there are not enough AI services in the SingularityNet marketplace, it is unclear why spending $88K on another website and a hackathon will address this problem. \r\n\r\nThe proposal states that it will deliver \"YouTube videos and Github repositories available for developers to more readily get involved in creating services for SingularityNet\", but producing this kind of generic education solution has a very weak connection to the proposed result. It is also not realistic to teach \"AI service development from start to finish\" -- this is a huge topic, and more focus is needed.\r\n\r\nAlso, given the proposal to reserve $50K of the budget for prizes in the hackathon, one would expect a lot more detail about the hackathon -- e.g. goals, process, prize structure, etc.\r\n\r\nFor these reasons, I strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposer states that he is a teacher and hackathon participant, which is relevant to delivery. However, the linked Github page includes repositories that are mostly fairly basic programming assignments and incomplete projects, with little linkage to AI. There is little evidence that the proposer is qualified to teach \"AI service development from start to finish\".", "q1r": 2, "q2": "The proposer specifies that he will deliver a website, videos and a hackathon, which could be audited. However, beyond that there is very little detail on what specifically will be delivered (e.g. website features, how many videos, what topic, size of hackathon). So overall I disagree that there is sufficient information to audit the success of the proposal.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 21, "ne": 4, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "I understand the proposal wanting to develop more AI services in the SingularityNet marketplace through the solution of creating a website with video tutorials, an active developer community, a problem & solution team, and a hackathon. with awards. The video tutorials right on the web of SingularityNet I found quite complete, it is not clear what the content of the proposed video is and what advantages it has. I fully agree to develop research groups and organize hackathons", "q0r": 4, "q1": "The proponent mentioned creating a website hosting the tutorials, I haven't seen a description of how the website functions or the demo when interacting with the user, is it convenient or not. The application of AI is very wide, video tutorials that focus on architecture or any field of work are not mentioned in the proposal. How will the development community channel be managed and promoted, what other benefits are there for the participants, on what metrics are the ideas supported?.", "q1r": 2, "q2": "Proposer of roadmap information for 6 months at a cost of $88,200, this is not a small amount that needs to be more clearly used for what (For example: $8000 in 1 month of website development how much programming is required. How long, how much it will cost to buy/rent a server and domain name, especially the $50,000 Hackathon organization needs to list details of the prize, rent a place, organize work, buy support tools ...). Objectives or indicators of success are not clear with challenges and risks when implementing. After the Hackathon, how will the project continue to develop, how many people will join the community, how many ideas?", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}], "solution": "Crear un sitio web con vídeos instructivos, una comunidad de desarrollo activa, un grupo de reflexión sobre problemas y soluciones, y un hackathon con premios.", "experience": "Desarrollador y director de equipo de Solidity. Profesor. Participante en el Hackathon."}