{"id": 383020, "author": "burnttoast", "title": "IlluminatAI SWARM", "url": "https://cardano.ideascale.com/a/dtd/383020-48088", "category": 26247, "amount": 35000, "description": "A medida que las comunidades crecen, se abren a las estafas y a la desinformación con pocas soluciones.", "funded": 1, "upvotes": 48943736, "downvotes": 5936273, "votes_result": 43007463, "votes_cast": 158, "f6_no_assessments": 7, "f6_rating": 3.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "Look like a great small project to deliver an AI project which can be applied by the community and port from Polygon over to Cardano. Producing AI projects which solve real problems is what brings real world attention to the technologies involved.", "q0r": 5, "q1": "The team is already working on the project and has significant experience in the space. There is a clear project plan so every expectation they will successfully implement. ", "q1r": 5, "q2": "The proposal has a clear delivery timeline which will make progress auditable. It would be nice to see some clear metrics with goals attached for the output of the project.  Technical delivery doesn't define success, deployments and effectiveness do. How many scams/post etc to they expect their swarm to block per deployment. How many subscribers are they aiming to get at each point in the timeline? Are there any other metric you would propose to define success?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 30, "ne": 1, "ng": 24, "nfo": 5, "vca_o": 1}, {"q0": "Creating a network of communicative bots in combination with a database of malicious accounts would create a short-term solution and improve online security. An alternative line of thought, which the proposer has touched in the proposal, could be to deploy AtalaPRISM to carry this task, but that in turn would create potential privacy issues as it becomes harder to retain anonimity. ", "q0r": 4, "q1": "The proposer is a moderation member of the SingularityNet community. I have personally witnessed him getting impersonated by numerous accounts at the same time on the SingularityNet community Telegram-channel. Impersonators who were in turn contacting community members to try and get their keys in order to steal their crypto. This illustrates the need for a deterence-system in online communities. The proposing team has over 50 combined years of relevant experience and a partially finished product already. ", "q1r": 5, "q2": "The proposal holds everything it needs to determine auditability. The only thing that can still be improved would be to finish the website (which holds nearly no content). ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 27, "ne": 2, "ng": 20, "nfo": 5, "vca_o": 1}, {"q0": "Interesting idea and approach to defending against scams bots. By providing a safe place for the Cardano community to communicate and using AI agents wrapped around the SWARM this proposal fits within the challenge.", "q0r": 4, "q1": "It is certain that the team behind the proposal is very capable of bringing this proposal to success. We are provided with background knowledge of the team members and handle names on telegram for further questions if needed. Concerning the plan, we get a fundamental breakdown of the budget and a success timeline which gives insight into what the team plans on doing. They are currently already working on an MVP to implement in their telegram group.", "q1r": 4, "q2": "As stated above we have a roadmap, breakdown of the budget, and information on the team members, in short, the proposal has everything needed to assess the progress. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Scams and monitoring for them is an important problem that needs solutions, and opportunities to do with AI solutions are large. However, it is very difficult to understand the solution being proposed. \r\n\r\nIt is not clear how the SWARM of social bots will monitor for and detect scams. I understand that this will involve some kind of integration with ScammerDB, but how? There are a lot of moving pieces here -- Bot-DSL, the SWARM built on top of it, ScammerDB, tokenomics, etc -- and it is not clear how they fit together. In sum, there seem to be some reasonable ideas here but more clarity is needed.\r\n\r\nThe proposal also does not explain how AI / machine learning will be used (other than saying that ScammerDB will use \"advanced NLP AI\"), or the relevance to SingularityNet (is it because Tomas is a developer \"for the singularity\").\r\n\r\nFor these reasons, I neither agree nor disagree that the proposal effectively addresses the challenge.", "q0r": 3, "q1": "Because of the lack of clarity of precisely what is being proposed (see comments on impact), it is very difficult to form a view on deliverability. Accordingly, I disagree that the proposal provides information demonstrating that it is highly likely that it will be implemented successfully.", "q1r": 2, "q2": "The proposal provides a roadmap for development and timeline for delivery, but given the lack of clarity on what the solution involved, I disagree that the information provided is sufficient to audit the progress and success of the proposal.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 18, "ne": 0, "ng": 13, "nfo": 5, "vca_o": 1, "reply": "Hi thanks for your feedback! As noted the bot swarms are in fact connected to each other through BOT-DSL an API of APIs, of which our partner ScammerDB is one of those APIs the bots may access. The tokenomics aspect is a complex discussion, but in short, as in the inner layers of the AGIX token, agents communicate via metadata and reward job completion in micropayments. AI & ML exist throughout our SWARM, we train constantly to keep up with new scams (we actually did this all day today using OCR implementations with various funny results). We will also be integrating OpenAI shortly, as they have added a cool new live web search tool which is very useful for returning fast answers for communities, live. \nUnfortunately, most of our team didn't want to share private information but yes we have some people associated with \"the singularity\". One of whom wanted it known he was also handsome.\nFeasibility is one thing we are 110% absolutely proving to ourselves and in our test groups. We want to make chat groups a scammer-free environment, which of course is impossible given human nature. So the ultimate solution is simply to educate people as best we can that all direct messages are from scammers. Education is truly the best weapon. Don't click that link!"}, {"q0": "This proposal is targeting an area of concern that relates to anyone who accesses social media platforms. The idea has the potential to create significant value to the community on a local and global level. If successful this project would have a massive impact on how users interact in social platforms.  ", "q0r": 5, "q1": "I sense that the team are highly skilled and have substantial knowledge and experience in this field and I in no doubt the enthusiasm but to date I could not fully confirm with the links provided. The plan seems reasonable and logical. The budget is realistic and the timeline seems appropriate. Greater detail of the MVP and what that would look like may have greatly increased my own understanding but overall a worthwhile project with much merit.  ", "q1r": 4, "q2": "Terrific proposal that seeks to address a extremely pertinent problem of social networks. The information provided is solid without being exceptional. I feel this may be due to the need to cloak the IP from potential scammers rather than a lack of effort or understanding by the team. The auditability of the project may be a drawback of the nature of the topic rather than anything else. It is of course that vary nature of adaptation that allows scammers to learn to game systems designed to stop the scamming.  ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I understand the proposal to combat phishing and misinformation by building a scalable, scalable Auto-Response Module enabled by Bot-DSL. I agree with this idea, this is very necessary to bring a clean environment for sustainable development to the community, create trust and attract new people to join. Tokenomics is mentioned but the information is incomplete, how will the problem of identity verification using fingerprints and the stored database used in the project affect decentralized development .", "q0r": 4, "q1": "The proposal states that development on a Bot-DSL for MVP would include Telegram and Discord APIs as well as a cryptographic testnet on Polygon and I understand not being implemented on cardano in the first place. I have yet to see what the information associated with SingularityNet will look like and how it evolves after that. The proposed cost is specific to each function of the proposal but it is not clear how to calculate it properly (for example, most of the functions are related to programming but no number of participants, working time to calculate). cost). It would be great for the proponent to publicize their experience and expertise on social networking sites", "q1r": 3, "q2": "What are the risks and challenges of this project, whether connecting to social networking sites will be difficult for partners and legal. Proponents clearly add functions that will be built according to the timeline with expanded SWARM subscriptions for companies. It would be better to have a demo so people can easily visualize the benefits of the product", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "Malicious actors and trolls within social media platforms and chats are a real problem and one that is difficult to prevent without serious manual effort in most cases. The impact of automating any detection and removal of bad actors is one of high value to the Cardano ecosystem as well as many others.\r\n\r\nThere are existing services that offer the services detailed in this proposal - https://securitybot.xyz/ & https://docs.carl.gg/ & https://top.gg/bot/394019914157129728 as just some examples found from a quick google search for usage in Discord. There are also often in built detection tools in these services which would also be worth being mentioned by the proposal team and where they fall short.\r\n\r\nWith the information given in the proposal it is unclear on how the solution detailed will be different or better than existing solutions that exist in the market for different social media platforms or chat services. It is difficult to gage whether the suggested solution would provide a step forward in this market or whether the team has a firm grasp on the current market. \r\n\r\nAs a community advisor we don't have time to go through the market to work out whether the outline of your solution is impactful, in future proposals our recommendation would be to ensure the advisors can easily understand the problems with the existing market solutions and why their own one will help to solve existing problems.", "q0r": 3, "q1": "A team of four people has been listed in the proposal, one LinkedIn profile has been provided. The website provided has very little background information on any previous solutions built or work performed by the team. With the lack of sources and evidence provided it is difficult to gage whether the team has the expertise needed to execute the proposal. The proposal is fairly well explained which helps to give some minor benefit to the doubt on what is claimed however this is not sufficient for a higher rating.\r\n\r\nScammerDB is mentioned as a ready built database yet have provided no links for this product which would be used to verify it exists and that whether it is indeed functional and ready for usage. More evidence of this with sources would be great for easily verifying the team has some part of the proposal solution ready for integration or that has been implemented. This would be an example of where further confidence can be given about the feasibility of the proposal based on sources for solutions the team has implemented or integrated.\r\n\r\nThe budget appears reasonable and is broken down to parts of the website development. It would be great to understand the allocations concerning AI and SingularityNET specifically here in any future proposals made.\r\n\r\nSome benefit of doubt in the scoring will be rewarded for the responses provided due the number of responses given by the proposal team to the comments provided on the proposal. Ultimately more evidence and sources are needed about the team and implementation so far too confidently say this proposal is highly feasible.", "q1r": 3, "q2": "A success timeline is provided which is more precisely a roadmap of when certain actions will be implemented. No KPI or success outcomes are detailed on how the proposal team will measure the impact of their proposal. The proposal team have no sources on previous work and implementations and have also not included any information on whether this proposal will be open source.\r\n\r\nThe proposal provides some clarity on what it is trying to implement however lacks information on how it will be audited. Without previous evidence of execution by the team or open source code it is difficult to give the benefit of the doubt in this area for the proposal team.\r\n\r\nCommunity advisors would greatly appreciate proof in any future proposals from this team that include how their proposal will be audited along with sources of previous experience and execution.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1, "reply": "My question for you would be: if such a handy bot exists, why isn't Cardano using it? Combot is $800/yr and works \"sometimes\". The funny thing is, when I joined the Cardano group on telegram, I had to verify my existence three times and sign up for a forum to get access. Upon success, I was immediately DM'd by a scammer offering support. Scammers don't join public groups very often. They sit outside the group and watch!\r\nThe Cardano Catalyst official group has no bot and is FILLED with scammer bots. \r\nIn short, we are building the tools to combat this mess, which as a moderator myself I deal with all day, every day. We are training AIs, building an education platform (truly the most effective weapon) and building a massively scalable, decentralized solution for ALL bot uses."}], "solution": "SWARM de bots del ejército suizo y agentes de IA envueltos con ScammerDB", "experience": "Desde la moderación del chat, la automatización de la ingeniería, hasta el desarrollo de nodejs, somos un equipo internacional de amigos con talento y experiencia"}