{"id": 383977, "author": "hr100", "title": "Sustainable AI anti-fakenews system", "url": "https://cardano.ideascale.com/a/dtd/383977-48088", "category": 26247, "amount": 110000, "description": "Los sistemas automatizados de IA contra las noticias falsas carecen de un modelo de financiación sostenible y sufren de centralización, lo que los hace manipulables.", "funded": 2, "upvotes": 98489203, "downvotes": 5323561, "votes_result": 93165642, "votes_cast": 433, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Señalar y detener la difusión de la desinformación y las noticias falsas es una misión fundamental para mantener la eficacia de la democracia, especialmente en un mundo cada vez más polarizado y alimentado por opiniones en lugar de hechos. El reto que intenta abordar esta propuesta es importante y lo apoyo de todo corazón. Expone claramente diferentes aspectos de los retos y las soluciones correspondientes: descentralización para luchar contra la manipulación y aumentar la credibilidad de la fuente de información, modelos lingüísticos a gran escala para marcar los contenidos, frontend que no sólo proporciona una estimación de la puntuación de credibilidad sino también la explicabilidad, programa de incentivos propuesto para aumentar el uso de la herramienta. Por lo tanto, estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el reto.", "q0r": 5, "q1": "El equipo parece estar afiliado a una institución de investigación y todos sus miembros tienen experiencia en PNL. Desde el punto de vista de la preparación técnica, algunos de los modelos lingüísticos de código abierto son realmente potentes y su ajuste para tareas posteriores, como el análisis de sentimientos, es sencillo. Sin embargo, el equipo necesita un ingeniero con suficiente experiencia en blockchain para desarrollar la solución para el mecanismo de financiación descentralizado. La arquitectura de la solución también parece razonable. Los planes de ejecución y las pilas tecnológicas pertinentes están claramente especificados. Por lo tanto, estoy totalmente de acuerdo en que esta propuesta se implementará con éxito.", "q1r": 5, "q2": "Los hitos/objetivos de 3, 6, 10 y 12 meses son claros y tangibles.   10.000 usuarios en todo el mundo al final del ciclo de desarrollo parece alcanzable dado que el 10% de las escuelas checas están probando Verifee según el equipo. Yo animaría al equipo a considerar métricas adicionales para medir la adherencia de la solución en lugar de sólo el número de usuarios. Por ejemplo, el número medio de noticias por usuario en las que se aplica la herramienta. También sería útil que el equipo publicara cómo planean seguir y mejorar el rendimiento de los modelos ML de evaluación de noticias falsas. Dado que los modelos se publicarán en el mercado de SingularityNET, y se desarrollará un front-end, la comunidad puede responsabilizar al equipo y asegurarse de que están en buen camino. Por lo tanto, estoy de acuerdo en que el equipo ha proporcionado la información adecuada para que la comunidad revise el progreso.", "q2r": 4, "assessor": "z_assessor_960", "no_vca": 22, "ne": 12, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Seems like a great project to port over an existing MVP to run decentralised on SingularityNet and expand to cover English. The product uses AI to detect manipulation/fake news and will incentive users to interact with the system through it own token on Cardano. I wonder could you improve this by also maybe allowing people to stake their AGIX tokens as security to then provide training data to the system. You could test them by providing some labeled data or comparing to predictions and if they are providing malicious bad data you slash their stake?", "q0r": 5, "q1": "The proposers have already built an MVP and have most of the roles required. They have a clear plan and I would expect they should be able to deliver. Obviously their is a lot of work to be done in moving a system from centralised to distributed, but only they can know how easy it will be for their system.", "q1r": 5, "q2": "The proposers have a clear road map for deliverables which can be audited. they have set a success metric with a target for the number of users world wide and a percentage of Czech schools. Perhaps they could also set some metrics on engagement of those users.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 31, "ne": 3, "ng": 25, "nfo": 3, "vca_o": 1}, {"q0": "This is an interesting project that proposes a browser plugin to detect fake news, mainly funded by SPO revenue. The proposers are willing to migrate to the Cardano blockchain along with SingularityNet. \r\nHowever, it is important to note that there needs to be a very clear definition of what is 'fake news'. It can't evolve into something that starts to label anything and everything against a certain agenda as hatespeech. It is good that there is an acknowledgement in the proposal that this project is not supposed to tell what the truth is, as these are all subjective in nature and pose a real danger to censorship. So the question that needs to be asked would be wether or not the world would be a better place by censoring articles that are (politically) incorrect? Because indirectly, even with a numerical indicator while the content would still be accessible, this proposal is threatening to the notion of freedom of speech and personal liberty. \r\n", "q0r": 2, "q1": "The team's relevant experience claimed in the proposal should suffice to transfer this already functioning prototype from Ethereum to Cardano, keeping in mind that the code it is written in on Ethereum (I presume Solidity?) should theorethically also be able to run on Cardano. The prospected budget is benchmarked to Czech Republic salaries and has been pegged to respective time-equivalents as it isn't full-time, which is a thought-through choice. There has been put some thought in making this project self-fundable by means of SPO-funding and revenue from ML-services on SingularityNet. \r\nOne possible loophole that could be identified is what would keep a user from intentionally searching from articles that are registered as malicious in your system in order to reap daily rewards. Is there a failsafe in place for this or not? ", "q1r": 4, "q2": "The proposers are trying to be as transparent as possible to make this project's funding proposal as auditable as possible. The funding mechanism has been communicated very openly and the budget breakdown is detailed. The public launch date has been presumably set within 10 months after the funding governance phase. The lack of a roadmap has been accounted for for reasons that the proposers do not wish to make guesses on uncertainties in the near future, but they have vowed to publish this as soon as possible, an openness which is appreciated. On the website there is limited information available on the team members, which could be elaborated a bit more in terms of auditability improvement. Another thing that I feel is necessary is a risk assessment, as there is a real risk that this technology could be misused towards censorship and possible stimulation of agenda. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 25, "ne": 11, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "Interesting proposal, If I understand correctly - had to re-read this a couple of times - the proposer is suggesting transferring all ML models they have to SN and developing a tokenization system where their fake news plugin is rewarding AGIX. IF this is correct it would certainly help provide activity on SN and Cardano networks. The problem I have is that how far does their plugin goes into telling something is \"fake news\" since the plugin doesn't actually tell you it's true/false to quote them \"Verifee does not determine what is and is not true. Instead, it infers the credibility of an article by analyzing its properties and parameters using artificial intelligence.\".", "q0r": 3, "q1": "Since the team already has work done and is planning on transferring their ML/AI to SingularityNet, I have no doubt they are capable of this proposal. For the detailed plan itself, we have a rudimental roadmap and well-explained budget breakdown, where they state that they are in need of a blockchain engineer. What is also a surplus is that the team thought of a way to self-fund this proposal after the funding is done. By creating an SPO you make this a self-sustaining plugin that needs little funding. One thing that should've been stated in the proposal and that I couldn't find is the reward system, will there be a cap on the reward system? Because the way I see it now there could be a problem here in people malicious using advantage of this.", "q1r": 3, "q2": "Regarding auditability, we are missing some information. The roadmap is not really defined but we get a glimpse of what the roadmap holds through the milestones. A more detailed map would be beneficial to the proposal. The budget breakdown is detailed and reasonable. The team also gives a good explanation as to why they are working half-time on this and not full-time.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 8, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This team was aware of a big crisis of this info world, fake news - this can make a huge bad effect on the human world that is hard to prevent nowadays, this team shows a solution that uses their existing ML models for fake news detection to SingularityNET. This development to the next level to AI will help not just Cardano ecosystem but the whole blockchain world avoiding fake news that can drive the market to bad decision making.\r\nThere is no content in the proposal show how the team will benefit the Cardano ecosystem directly, but their milestones and goals show that they will help a lot to Cardano communities. And all of these goals is fit with challeng givens.", "q0r": 5, "q1": "Throughout the content of the problem context inside this proposal, and their detailed technical deployment plan I can see that the proposed roadmap is fitted with the ability of the team - talent guys that really care about the disinformation for years. \r\nHence, the budget is reasonable with their plan. \r\nI think it is not a big deal when porting the existing model to SingularityNET, but hope that the team can show some risk that they think will meet. ", "q1r": 5, "q2": "The team has a roadmap that is clear enough to audit their project, their goal is also promising with 10k users after 12 months. \r\nFor that number, I hope they can add more info about the plan they will attract users around the world. Inside the proposal, the team states clearly about the problem context and technical explanation already and that clarify what this project will bring to users is very useful. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 2, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "AI is necessary for a regular \"fight\" with fake news because of the many articles or information we encounter daily. Fake news detection on SingularityNet/Cardano can bring required innovations in Artificial Intelligence and make the world a better place.", "q0r": 5, "q1": "Proposer/team understand the SingularityNet/Cardano ecosystem. The main challenge is to find a missing blockchain engineer/developer.", "q1r": 5, "q2": "The roadmap with milestones and funding usage is clearly defined. The milestones are reasonable in the specified time frame.", "q2r": 5, "assessor": "z_assessor_962", "no_vca": 24, "ne": 2, "ng": 12, "nfo": 10, "vca_o": 1}], "solution": "Portar nuestros modelos ML existentes para la detección de noticias falsas a SingularityNET y utilizarlos con el frontend de compromiso de cara al usuario y DAO en Cardano.", "experience": "Equipo de ML con experiencia, dirigido por un investigador y ejecutivo senior de IA. El backend de ML fuera de la cadena ya está funcionando. Equipo: https://www.verifee.ai/en/"}