{"id": 384555, "author": "vivek", "title": "Cardano Analytics Data Hub", "url": "https://cardano.ideascale.com/a/dtd/384555-48088", "category": 26247, "amount": 60000, "description": "Los datos relativos al ecosistema de Cardano son granulares y están dispersos, lo que dificulta su acceso y uso para el análisis o el aprendizaje automático.", "funded": 1, "upvotes": 29137245, "downvotes": 12857274, "votes_result": 16279971, "votes_cast": 108, "f6_no_assessments": 4, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"q0": "AI can't happen without data. This is a nice project to provide a single point to access various types of Cardano related data. Meets the challenge goal of enabling more AI in the Cardano space.", "q0r": 5, "q1": "The team has great experience with the data in the Cardano domain. They have a clear budget and plan for delivery. This is purely an engineering project and I would expect them to deliver.", "q1r": 5, "q2": "There is a clear plan against which progress can be audited. In the end success depends on the data being used so it would be good to have some metrics and goals around number of users, API calls, projects developed off the data etc.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 28, "ne": 1, "ng": 22, "nfo": 5, "vca_o": 1}, {"q0": "Gathering analytical data is extremely important to identify trends in any system. The proposal aims to gather all this data in a data hub to make it easily accessible in one place. What is nearly unmentioned in the proposal, apart from making this data available to 'machine learning', is a link with SingularityNet. The presented plan is to store all this on an infrastructure of servers, which is a rather centralised solution. So if the solution were to utilise a protocol from the SingularityNet ecosystem (NuNet?) it would have fit the challenge better. So in short; great idea, wrong challenge or challenge link missing in the proposal. ", "q0r": 1, "q1": "Both proposers are very well placed to develop a data hub. The requested budget, although broken down by role, is not made clear through time. It covers the first 3 months of development and 6 months of infrqstructure cost, but it hasn't been made clear how long development would take in total and how the project would fund itsself when up and running. A roadmap would solve this issue and improve the proposal greatly. ", "q1r": 3, "q2": "This proposal has elements that are very well worked out, like the budget breakdown per role and the proposers' relevant experience. It also doesn't hold some key elements that could make this proposal great with minimal effort. It needs a roadmap to determine the cost. It needs to point out where SingularityNet could come in and be applicable. It needs a risk assessment as the data would be stored on servers. For example; what would happen if the servers are down? ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 24, "ne": 4, "ng": 19, "nfo": 1, "vca_o": 1}, {"q0": "Great idea, for AI to work we need data. By gathering all data of the ecosystem provides a useful tool for machine learning. What I am missing in the proposal is the link with SingularityNet (SN). How does this utilize SN?", "q0r": 2, "q1": "Regarding the team's relevant experience, they both seem more than adequate to develop the project. They provide the necessary details on their work and experience. Looking at the roadmap they talk about that the budget will cover the work in the first 3 months and 6months of running cost but we actually get no roadmap on what they plan on doing in these months. As well as an end date is not presented. How do we know when the project is finished. They talk about an attached file but There is only a link to their GitHub page.", "q1r": 3, "q2": "Since no roadmap is providing it will become hard to follow the progress on this proposal. There is a GitHub link provided so I assume updates will be provided on GitHub but with no roadmap, we have no guideline to see when what needs to be finished. We get background information on the team members and a well-explained budget but we are still missing valuable data for auditability.", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is looking at improving the data access within the Cardano ecosystem by bringing together more depth of the available data from on chain that is currently hard to query. Machine learning models need accurate and complete data sources so improving this part of the ecosystem could have a large impact on what can be learn from the transaction history and all on chain data.\r\n\r\nThe proposal better matches developer ecosystem or open source tool focussed challenges as it provides infrastructure and data that the rest of the community can use in their own projects. This includes projects concerning AI and machine learning that may need this type of data. Due to this the match up with the impact of this proposal and the challenge is indirectly aligned which makes it difficult to provide a better assessment rating for impact. ", "q0r": 4, "q1": "The proposal team has provided a team description of their experience and a GitHub repository of existing projects in the ecosystem. The GitHub repository provides some evidence that proposal team is familiar with what is required to implement this proposal. It would have been preferred if the proposal team listed their professional profile such as a LinkedIn to give the advisors more confidence in their background being legitimate as without this the information given is hard to verify. The budget is broken down into roles and represents what appears to be fair values for the task at hand. It is assumed that the two proposers will perform those roles as no mention has been given on whether they are seeking other people to work with. ", "q1r": 4, "q2": "The proposal has been laid out clearly and is easy to follow what the proposers are intending to implement. No success objectives or KPIs have been provided. What would have also been useful is to discuss how much existing data sources are used that they mentioned and any specific projects that would use their own data hub in the short and medium term. How often would they require this data? What type of metrics are they expecting to see with them adopting the API data sources?", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Un centro de datos para el ecosistema de Cardano que pone a disposición conjuntos de datos históricos y modelados a través de múltiples mecanismos de acceso.", "experience": "Fundadores de Cardano Canucks y Canuckz NFT con más de 30 años de experiencia en infraestructura de datos, análisis y visualización de datos para empresas."}