{"id": 384617, "author": "grisemetamoonverse", "title": "AI in Trading and analyzing data.", "url": "https://cardano.ideascale.com/a/dtd/384617-48088", "category": 26247, "amount": 10000, "description": "El comerciante humano puede obtener una visión de las máquinas inteligentes, para tomar decisiones basadas en la fusión de 2 inteligencias, aumentando la rentabilidad.", "funded": 0, "upvotes": 17862544, "downvotes": 12347109, "votes_result": 5515435, "votes_cast": 108, "f6_no_assessments": 5, "f6_rating": 2.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "As an idea yes it would meet the challenge, but it is not a plan. there are no details. Incentivizing an algorithm when it gets thins right sounds like reinforcement learning, however this is not mentioned. Please present more detail on you algorithm. More importantly, even if it works, what is the output. Is it a trading strategy people can follow? A portfolio they can mimic?\r\n\r\nIt seems they want to produce something that will predict BTC and ETH future price movements, but they have no presented a concrete plan on how they intend to go about it.\r\n\r\nPrice predication in financial markets is the holy grail. Its not really a tractable problem except perhaps in high frequency trading (see the hedge fund Renaissance Technologies).", "q0r": 3, "q1": "There is no clear plan on what the deliverable from this proposal would be. How would people use it. What are the outputs? How is the algorithm trained. Are you just running it slowly going forward, in which case you will never get convergence, or are you training on batches of historical data?\r\n\r\nThere is just not enough details on the algorithm or the product to be delivered from it. If you had an algorithm that worked already, why would you need $10k? You would quickly earn that much using it. \r\n\r\nI have a good understanding of what is required here having both been a trader at a large investment bank and having a PhD in machine learning. I don't see enough details here to make me confident they have a good process set up to attack this problem.", "q1r": 2, "q2": "There is no delivery timeline you progress cannot be audited. Please provide metrics on how you would measure success of the algorithm.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 32, "ne": 4, "ng": 26, "nfo": 2, "vca_o": 1}, {"q0": "This proposal wants to implement already existing predictive protocol much like SingularityDAO's dynasets into Nami-wallet. The funding request is meant for the sole purpose of creating the algorithm to connect to Nami. As a SingularityDAO-investor, I can't help but ask myself why the proposer's GRISE-token would be a better option than the upcoming dynasets as activity in the token data seems to be quite low. So for this reason I can't see a potential impact exceeding a minimal status. Perhaps a collaboration could come into reality to create a partnership with Nami. ", "q0r": 2, "q1": "The predictive AI-protocol is already made, so the creation of an implementation algorithm should be very doable. The proposer has adequate competencies to perform the task. Judging from the roadmap on the website, this project intends to move extremely fast with a prospected date to release a fully integrated product by April 2022. This seems very optimistic, but with an already finished product it isn't impossible. ", "q1r": 4, "q2": "There is not a great deal of information present in the proposal, but after some searching, a lot could be found on the attached website. There is a roadmap, a funding breakdown, a security audit and various channels of communication present. What is missing is who exactly is in the team as only the main proposer has identified himself. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 28, "ne": 3, "ng": 23, "nfo": 2, "vca_o": 1}, {"q0": "In my opinion, the proposal does not fit within the challenge settings. The challenge is about connecting Singularity and Cardano and showing the Cardano community the benefits of AI. This proposal is about implementing his own AI system which has no connection with Singularity or Cardano.", "q0r": 1, "q1": "Regarding the team, the stated experience is reasonable and relevant to the proposal and because the AI index is already made, this shows the full competence of the team. What I am concerned about is the speed this proposal is going. Looking at the roadmap on their website this would all be done by August 2022. AI is something that needs to be tested over and over. It would've also been better if the team added the roadmap on the proposal, now the community needs to search for all the information we need.", "q1r": 3, "q2": "Regarding auditability, this proposal is lacking some information. For instance, the roadmap is missing as mentioned in the above rationale. I know it is present on the attached website but it's community-friendly to give all the information needed on the proposal itself. The second thing that is missing is information about the team, who is working on this, and what are their roles. there are Linkedin pages provided but one of them is to someone who left GRISE this month.", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 21, "ne": 3, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about creating an AI model that is self-feeding. This is a great and interesting idea. The problem statement convinces me, however, for better understanding, it would be great if some problem explanation is provided. The solution is not clear enough/remains very abstract, expected impact seems limited in the space of traders ? My advice is: in a proposal, the proposer should: (1) provide full component [I will list in the suitability note]; (2) provide \"impact analysis\" for showing how you think your proposal may address the given challenge and has potential impacts on the Cardano ecosystem as a whole.\r\nTherefore, based on the given information, I strongly am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "The profile is described enough for understanding and show suitable skills, experiences [Data and AI scientist] for implementation. As mentioned in the proposal, the \"AI Index is completed\", however, it can not be found. The budget is provided with items structure but without explanation of calculation base. Besides, the roadmap (and KPIs) and the risk are not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "The proposer should provide full components: (1) Goal; (2) Roadmap (with measurable KPIs); (3) Budget breakdown with explanation; (4) Risk and mitigation.\r\nTherefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "It is difficult to fully comprehend what the proposal is setting out to do. They state - 'AI Index is completed we want to develop the algorithm to be incentivized every time it produces a return of over 30 percent against bitcoin and Ethereum.' \r\n\r\nWhat needs incentivizing? If it's an algorithm it can just run on a server - are the economics not profitable or by incentivisation do you mean it requires human inputs into the algorithm? In either scenario the incentives and model needs to be better explained so a community advisor can understand the impact of what you're trying to achieve.\r\n\r\nThe proposal needs refining to much more clearly define the problems, current market and their solution. More information on how the algorithm they use functions and the economics of any tokens involved should be highlighted to increase the impact rating.", "q0r": 1, "q1": "The team has two members with two LinkedIn profiles provided. The team also has a link to a supposedly working project (as an advisor I have not tested this). The budget is low and how it is allocated has been listed. Overall there is some evidence that the proposal team can feasibly implement this proposal and the budget is of lower risk. However as the proposal is not clearly defined on what they are trying to achieve it is hard to give any better rating than the one which has been given.", "q1r": 2, "q2": "No clear roadmap is provided, the proposal clarity is low and hard to follow and no KPIs have been provided. We recommend the team adds in these details in a future proposal to make it clear what impact the proposal is trying to achieve and how they will measure it.", "q2r": 1, "assessor": "z_assessor_758", "no_vca": 20, "ne": 0, "ng": 17, "nfo": 3, "vca_o": 1}], "solution": "Un modelo de IA que se autoalimenta. Lo que significa que se incentiva cada vez que predice un beneficio contra btc y eth del 30% en una semana.\nÍndice ROI", "experience": "Nuestra plataforma de IA se ha completado y LIVE queremos fusionar con nami wallet. Aparte de esto queremos crear el modelo anterior e implementarlo."}