{"id": 384654, "author": "deborah", "title": "NFTs to own one's own data and IP", "url": "https://cardano.ideascale.com/a/dtd/384654-48088", "category": 26247, "amount": 39000, "description": "Las actuales empresas de datos fabrican productos a partir de los datos personales y de propiedad intelectual de sus clientes y empleados sin una compensación proporcionada.", "funded": 1, "upvotes": 42351022, "downvotes": 10081687, "votes_result": 32269335, "votes_cast": 128, "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer has great IP and the spin of company they run out of SingularityNet seems great. However most of this proposal is talking about everything else she is doing and very little on this proposal itself. It seems this proposal is specifically to create an IP NFT product (not the Data and Product NFTs she is already working on). But there is very little explaining what this actually is?\r\nIn the delivery plan this proposal seems to be delivering two components and a final report. However the two components are not explained apart from that and after reading them multiple times I am still not sure what they are (I have degrees in commerce, quantitative Finance and a PhD in Engineering and IT which was focused on  Machine Learning).\r\n\r\nThere may be something great here, but the specific discussion of this project, rather than the wider objectives of the proposers company, have not been clearly stated. Thus I can't say if it clearly addresses the challenge", "q0r": 3, "q1": "As stated above, whilst the proposer clearly has a wealth of knowledge, the plan for the specifics to be funded under this proposal are not clearly stated so it is not possible to say it will be implemented successfully. ", "q1r": 2, "q2": "It is really unclear what is to be delivered other than the few sentences under the tasks thus I am not sure how we can audit if it has been successfully delivered. What are:\r\n1) \"market ranking based on consumer social value preferences including equitable and proportionate distribution within a decentralized autonomous profit generating organization\"\r\n2)\"Social Simulation with which to pre-test NFT IP equity blockchain\"\r\nFurther than that, no metrics for success have been provided. How would you measure success for this project? Presumably it would be the learnings from the report being used to actually make the product?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 26, "ne": 4, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "This project proposes a partnership with SingularityNet's health spinoff 'Rejuve' in terms of leasing personal medical data in the form of NFTs. \r\nPrivate data ownership is one of the best usecases for blockchain-technology and in addition NFTs. The idea of leasing private data instead of selling it is a novelty which could spark a systemic change in how personal data is handled. What is unclear is how personal information can be handled 'equitably'. What would make one's personal information worth more than another? Shouldn't that be equal for all? ", "q0r": 4, "q1": "The proposer has various relevant experience in creating NFTs and furthermore a collaborative bridge with Rejuve. \r\nFrom the comment section below, there is an indication for a prospected release date of around the second quarter of 2022, which is within a reasonable timeframe. \r\n", "q1r": 4, "q2": "The plan is well described, but there are some key aspects missing in the proposal. How many users would be considered a success? There also seems to be a considerable risk in diversifying data value. Mentioning this risk in the proposal would reassure confidence that it would be handled properly. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 25, "ne": 1, "ng": 21, "nfo": 3, "vca_o": 1}, {"q0": "The proposal fits well within the challenge settings. It makes use of Rejuve which is a spinoff of SN and smart contracts on ADA Blockchain. The idea to lease off your data in the health sector is a great way to start using AI and Blockchain technology. The health sector is something every person in the world uses and but by owning your own data and leasing it to them you are provided with a level of security that makes you feel safe handing over data.", "q0r": 4, "q1": "The proposer is CTO of Rejuve the spinoff of SN which gives him the right qualifications to pull off this proposal. We get plenty of information in the proposal but what is missing is a clear roadmap. We get some insight on a roadmap in the comment section. It would've been better if the proposer added this into the proposal itself since not all voters look at the comment section.", "q1r": 3, "q2": "Regarding auditability, we get information on a basic level. Roadmap and budget breakdown are provided and give enough information to assess the progress of this proposal. Although the budget only funds 2.5 months while the roadmap continues to 2023.", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "The proposal looks to provide a way for people to gain more ownership of their health data using NFTs within the Rejuve ecosystem. The proposer states Cardano Data NFT will allow data to be leased but not bought instead of just purchased. \r\n\r\nSimilar to the issues of social media sites such as Facebook which collect and benefit from our data there is a growing concern for the implications of health data as more tools are used to collect data in our daily lives. Who owns this data is paramount and constructing systems that allow people to have control over this is of high value to society, Cardano as an ecosystem and within the SingularityNET ecosystem. \r\n\r\nThe proposer has very clearly provided responses to the challenge brief and why the proposal is applicable and due to their own work within SingularityNET itself working closely with the team it is clear this proposal has a very high chance of being high impact.", "q0r": 5, "q1": "The proposer has provided links to a GitHub repository they have worked on, resources provided detailing their own research and analysis on areas such as the tokenomics relevant to Rejuve. The proposer has listed their LinkedIn details, has a long history in the field of AI and works closely with the SingularityNET team. The budget has a basic break down of the hours and cost per hour to work on the project. There is sufficient evidence this proposal is highly feasible and the proposer has the right expertise and surrounding team to execute what is required.", "q1r": 5, "q2": "The budget, tasks and success objectives are broken down by the proposer. The definitions of success relate more closely with a roadmap which is acceptable. To improve here it would have been good to understand what kind of metrics of KPIs may be useful in the context of this proposal. How many users are realistic? What type of health data metrics would be good to see being used by the end users? Finally it would have also been good to be specific on whether the work executed in this proposal will all be open source. However the proposer has provided an open source repository already so benefit of the doubt will be given here as both useful resources and open source code is provided. I will make the assumption this open approach is likely to continue with the execution fo this proposal which makes the proposal far more auditable.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 19, "ne": 8, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "Las NFTs para rastrear los permisos de uso de datos en productos concretos, de manera que los datos de uno sólo se alquilan y siempre se compensan al vender el producto.", "experience": "CTO Rejuve, PhD, hizo Rejuve NFT tokenomics, treinta años de aplicación de la IA a los incentivos sociales, inventó la simulación social agente inteligente."}