{"id": 384917, "author": "deborah", "title": "Anti-Polarization Social Platform", "url": "https://cardano.ideascale.com/a/dtd/384917-48088", "category": 26247, "amount": 49000, "description": "El problema de la polarización, alimentado por los incentivos de los medios sociales a las opiniones extremistas, la información poco fiable y las operaciones de información.", "funded": 0, "upvotes": 18976382, "downvotes": 13222330, "votes_result": 5754052, "votes_cast": 121, "f6_no_assessments": 7, "f6_rating": 3.380952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal start with an awesome grand goal. Lets make a new social media platform where people control what they get advertised by stated preferences. These could even include don't show me adds that are also marketed on divisive content. Awesome idea, would love to see it happen. \r\nThe proposal itself is much smaller however. It is to implement a ranking algorithm and test it in simulation. No details are given of the simulation. Therein lies the rub. Without testing on real world data, its hard to know if the algorithm achieves anything. Its relatively easy to solve for a desired outcome in a simulation you designed. I'd love to see this somehow applied to real world data. Even if its  a prototype application with a smaller set of real users interacting with it. Maybe it could be something that Singularity net uses to manage its interactions with the wider community in collaboration with (https://cardano.ideascale.com/a/dtd/Semi-public-collaboration-platform/383792-48088)\r\n\r\nIts an important problem, but 49k to implement an algorithm which the author states they already heave and test it in simulation and write up a report seems expensive.", "q0r": 4, "q1": "The proposer has the experience and claims it is implementing works she has already done so there is no reason to doubt she would be able to deliver the roadmap outlined.", "q1r": 5, "q2": "We can audit delivery of items which match the descriptions in the road map. However there are no details of the simulation environment within which the algorithms are to be tested. Thus measuring how successful these algorithms are, if to be deployed to the real world, which is what really matters, is not possible. \r\nThe definitions of success given, are more definitions of delivering something. I would like to see some metrics and goals stated which show what would be success and thus what would be failure, for the simulation of the algorithm. If we allow this to be defined after the experiment, we cannot really evaluate success. ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 27, "ne": 4, "ng": 17, "nfo": 6, "vca_o": 1}, {"q0": "This proposal might have a great potential impact, but such an impact is not necessarily a positive one. In this particular case, the proposal implies heavy censorship on a social media platform, specifically designed to censor divisive material, which is subjective. Who would decide which content is classified as divisive and which is not? Current polarisation in society is a symptom, not a cause and as a blockchain aspiring to become full open source, it should remain as objective as possible. To that respect, the idea would be more compatible with this blockchain's philosophy if it were a social media platform without the censoring aspect. So an alternative could be a social media platform with an advertising filter that the user can define. As a social media user myself, that part could certainly have some future, but please uphold the internet's status as the last free medium. ", "q0r": 2, "q1": "The github implies a team of 6 people who contributed to the project's simulation. The proposal only lists 2 people, one which doesn't correspond with the names on the github. So it is not entirely clear who is in the team and what their function is. The github-content is elaborate and looks professional, so the technical capabilities seem to be adequate to develop this. There is mention of previous collaboration with the USDOD. What I am kind of missing to fully determine feasibility properly is how the platform would be marketed. Why would society opt for your platform and how would you 'sell' it to people? ", "q1r": 3, "q2": "The plan is an elaborate description of the idea presented and the text is pretty well formatted. The github-attachment is a plus to get an idea of the team's capabilities.  However, as you are proposing an idea with a real potential threat in terms of censorship, I feel that a risk assessment would not be out of place. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 24, "ne": 5, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "The solution and proposed plan do not really align. In the solution, the proposer states he wants to build a social media platform but if you look at the plan itself he wants to build everything that involves a social media platform, such as market ad ranking system, social media algorithms, and an online monitor of information. Since blockchain technology is open source and decentralized how does this fit in this ideology? The proposer wants to build tools against polarization build reading through the proposal it feels like the tools he wants to build will be censoring a media platform which is not an incentive we want to bring forth. I'll leave this neutral because I might be in the wrong.", "q0r": 3, "q1": "Concerning the team, we get a LinkedIn page of the proposer himself. What we are missing however is the rest of the team. When we look at the website provided (GitHub) we get 6 team members from which we get no information. I could find one correlation between GitHub and the Key Management on Rejuve in these team members. This still leaves 4 unknown members. In the budget, we see that there is a need for AI developers and AI social science experts, are those already included in the team, or do you still need to hire them? ", "q1r": 3, "q2": "The proposal does not have everything needed for an audit. We are missing a clear roadmap in the proposal, which I did not find on GitHub as well. We have a budget breakdown that is well explained. As stated above we are missing crucial information about the team, what relevant experience do the team members have, we only get information for two members. We need more information to assess the progress of this proposal", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem of polarization via social media is a massive global challenge, and certainly one that deserves attention. This is a good area for Cardano and SingularityNet to be exploring.\r\n\r\nHowever, this proposal is not clear about how AI will be used to do that. The initial description seems to suggest that the key approach is that advertising will be shown based upon stated preferences, which may not require AI. Later on, the proposal states that it will apply \"AI monitoring of blockchain's distributed ledger and AI monitoring of social media algorithms for social effects like social coherence and polarization\".\r\n\r\nGiven this lack of clarity as to means, I agree but do not strongly agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The proposal identifies three tasks, which are focused on the ad-ranking model rather than the broader AI tasks defined elsewhere. However, these tasks are not defined with much precision -- for example, how will the \"social simulation\" to test the model be built? One would think this would either need to occur on large human scale or involve a very sophisticated machine simulation. Accordingly, and related to the lack of clarity on means that is mentioned in the impact assessment above, it is difficult to assess whether it is likely that this proposal will be implemented successfully.\r\n\r\nRelated, it appears clear from observing the social media market that the problem of polarization is largely drive by large social media platforms (especially FB/Meta) prioritizing engagement over all other metrics. We know how to fix that technically, but the financial incentives go against implementing the fix. Given that the challenge appears more economic than technical, my view is that we must be quite precise on proposed solutions before spending technical effort developing them.\r\n\r\nFor these reasons, I neither agree nor disagree that this plan is highly likely to be implemented successfully.", "q1r": 3, "q2": "The project defines clear deliverables for 3, 6 and 12 months, although these are subject to the limited specificity mentioned above. Also, there are no numerical KPIs proposed. Accordingly, I neither agree nor disagree that there is sufficient information to audit the proposal. ", "q2r": 3, "assessor": "z_assessor_495", "no_vca": 18, "ne": 7, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This is an outstanding proposal that has the potential to create a huge amount of value for the Cardano community and the progression of social media standards. The game theory component applied to social actors operating in the social media space is detailed and represents a very current topical problem to be solved. This project seeks to explore incentivizing social actors in order to address the malaise that \"social media has not preserved the protective natural social institutions that uphold social discourse\". ", "q0r": 5, "q1": "The proposal team appear to have outstanding experience and understanding of the tools necessary to address the problem being defined. While, experimental in nature the plan has identified a deliberate course of action and has the collaborations required to bring that plan to fruition. I strongly agree that this proposal will be successfully implemented.  ", "q1r": 5, "q2": "Overall, this proposal has provide excellent information with a clear roadmap and and articulation of the problem to be solved. The budget is explained and the KPI's are achievable. The community will be able to audit the progress and implementation of the project and will likely find this proposal is at its heart a fundamental step towards greater understanding of the social machinations of polarization in social media.  ", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "It's nice to go for a world that is less polarized, but for me, it's better to do this better by informing people instead of censoring content. Who decides what can and cannot be seen? Who has the right to censor? Perhaps it would be good to create a platform for social media that informs because even censoring can have a polarizing effect, giving users the opportunity to judge and filter for themselves.", "q0r": 2, "q1": "I can't find out which members the team consists of and what their background is. You can also mention how you want to market the platform and how it can become known.", "q1r": 3, "q2": "I am still missing a budget allocation to increase audibility. The roadmap may also be thoroughly worked out, based on which criteria will you determine the success? Do you also take risk factors and obstacles into account?", "q2r": 2, "assessor": "z_assessor_667", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal addresses an enormous, unsolved to date, challenge, which qualifies for the \"award\" as a \"wicked problem\", namely polarization on social media platforms. If solved this can be of priceless societal benefit - which will improve the lives of people significantly and make social networks usable for the benefit of humanity. The proposal describes the challenge in great detail and proposed a solution which integrates several pieces developed by the expert along decades of successful hard work. \r\n\r\nThere is one big caveat however - which is not clarified in the proposal - namely if the solution will be implemented on the Cardano blockchain or on the current infrastructure which SingularityNET uses for their platform, namely the Ethereum blockchain. \r\n\r\nIf successful this work has the potential to revolutionize social networks and make then useful for a series of high impact applications, such as in Government (homeland security, defense, etc) as well as in education and for personal social use.", "q0r": 4, "q1": "I have no doubt that given the extensive experience of the proposer, including in deploying systems with the Department of Defence, this proposal can be successfully implemented as planned. The plan is clear and the budget requested aligned with the plan resources needed to accomplish the work in the proposed timeframe.", "q1r": 5, "q2": "There are no KPIs nor other measures of success proposed by which the success of this proposal can be tracked. There are no KPIs proposed based on which the accomplishment of the proposed milestones can be determined.", "q2r": 2, "assessor": "z_assessor_721", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Una plataforma de medios sociales basada en la ciencia social con incentivos de blockchain para construir un discurso social, y detectar operaciones de información adversa", "experience": "Inventó la primera simulación social con agentes inteligentes y las premiadas simulaciones con agentes de redes neuronales de la polarización de las operaciones de información en los medios sociales"}