{"id": 366762, "author": "", "title": "Cardano Africa Starter Kit (CASK)", "url": "https://cardano.ideascale.com/a/dtd/366762-48088", "category": 26108, "amount": 24809, "description": "Lack of tangible, impactful utility can contribute to low Cardano adoption in Africa and limit its spread across the continent.", "f6_no_assessments": 2, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal mostly articulates how it will add value to the Cardano ecosystem by bringing new people to Cardano. The proposal aligns with the community sponsored projects being run by young and developing Africans.\r\n", "q0r": 4, "q1": "The team shown is small. There is no reference to whether they are capable of developing and implementing this solution. They have specified that their Core team includes: Full Stack Developer (2), Cardano/CASK Operations (1), Implementation Lead in Ghana/DRC (2 part time). But only 1 full stack developer is shown in the proposal, with no link to verify their abilities. More information about all team members is needed to assess their capabilities. \r\n\r\nRe: Funding. How are the 2 new locations going to be opened? Where will they be opened? What is the roadmap for implementation? Will there be advertising? What's the budget for marketing? The token exchange is supposed to be done through the Yoroi wallet. There is no information on how this will be integrated into the process. \r\n\r\nThe team might be able to implement their proposal, but with the information given, many important questions remain unanswered, so I neither agree nor disagree that this proposal has a high probability of successful implementation. \r\n", "q1r": 3, "q2": "The go-to-market strategy is unclear. Developing a token is one thing, but implementing it successfully is quite another. In Ghana: Green Lion is a target retail partner, where CASK will look to launch in 2 stores Green Lion provides supplies to 1,500+ Ghana shops\r\nIf the KPI metric is to have 750 new wallets; Green Lion would have to serve 7,500 shops to introduce and have the expected uptake in 6 months. (It's taken 2 years for Bitcoin Beach to turn around and gain uptake.) The timeline may need rethinking. \r\n", "q2r": 3, "assessor": "z_assessor_311", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal very well meets the objectives of the challenge, as it focuses on the main problem addressed here: the lack of popularity of the Cardano community and the use of ADA in Africa. By distributing a rewards card to the population, which operates through our community's Tokens, people will be able to have an initial and attractive contact with the technology, and with this it is very likely that they will adopt this use, or at least understand how it works and distribute knowledge further on. In addition, retailers would also benefit, because they would keep a share of the profit, according to what is said in the proposal. In other words, this proposal would benefit the African continent in several ways, and would also popularize Cardano there, meeting very well what is proposed.", "q0r": 5, "q1": "As far as the team that will carry out this proposal is concerned, I believe there is no doubt about its capacity. We are provided with a lot of content about it. To start with, a very well done website, full of information about the Wada Alliance, in which we can see: projects, goals, services and so on. The site is super well detailed and has great navigation, the interface design is amazing. Wada Alliance's social media are also provided, which we know today is indispensable for maintaining direct contact with the general public. The only thing I missed on the site was a tab that spoke directly to the team members, explaining who they are and what they do, their experiences and so on. It would be ideal if you provided as much information from the team as was provided by member Jon Saginaw, who I believe is the leader. Even your linkedin has been attached, which is great for understanding who this person is in addition to the proposal. Apart from this detail, I believe that this item is very well demonstrated.", "q1r": 5, "q2": "In the proposal, we have a great deal of detail about how the action would be put into practice. We know the intention is 3 months of planning for 4 months of adoption, with fewer employees. It is also said how the financial amount would be used, in a very specific way. About the roadmap, we know which activities are carried out according to the phase. I always find it beneficial to have tables or visual mind maps included, because good time planning brings a lot of safety to the activity, and the team does that here, through the attached slides. In addition, a series of small actions that would result in the final product were delivered. It is accepted that some pod partners would be from Ghana and \"RDC\" (which we can better understand what it is through the slides). That way we know exactly where the cards distributed. In addition, the team also provides information such as the metrics used to calculate the project's success and what that success looks like, which greatly helps the community to track the progress of the proposal. For these reasons, I believe that a proposal is detailed in a more than satisfactory way, if they all had a slideshow to illustrate the information it would be perfect.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "CASK distributes Cardano Community Tokens in the form of a 'rewards card' that can be redeemed at participating retail partners. .", "experience": "Jon Saginaw: 20+ years experience in Technology Consulting with well-known companies.\n\nWADA Skilled team of practitioners and entrepreneurs"}