{"id": 367014, "author": "", "title": "P2P:Trade Cardano tokens with Cash", "url": "https://cardano.ideascale.com/a/dtd/367014-48088", "category": 26108, "amount": 36000, "description": "How do we increase the adoption and trading of Cardano's Tokens in Africa when 90% of transactions are conducted in cash?", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "I believe this is a great idea and ones which completely fits the challenge!! Quite honestly, I'm surprised that a platform such as described doesn't exist, but I believe whole heartily this would solve two different problems: growing Cardano within Africa, and helping people have access to further trade and use ADA for both P2P and it could grow with local merchants adopting the platform.   ", "q0r": 5, "q1": "I think the roadmap given, is put together well, and with the right, knowledgeable team, it can be accomplished in the timeline set forth. I also like how you added the references to help show the demand for your idea. Having a team who was part of the Alonzo-test cohort tells me that your team has a good working knowledge on how to put together a platform that's as described.\r\nI'm giving this a 5 star rating with the hopes it'll help draw attention and help get funding. I know I'll personally be following along, can't wait to see where it goes from here!!!", "q1r": 5, "q2": "As I mentioned before, I think this project has set goals which will be easy to follow, and provided that there is good commutation between the team and the community (things happen), I see this as being pretty transparent.\r\nI'm also giving this category a 5 start rating because I believe the people of Africa need a alternative to some of the laws and regulations they are subjected to. And I believe this idea fit the bill...  \r\n ", "q2r": 5, "assessor": "z_assessor_418", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Africa is still rely at 90% on cash transaction and access to bank services is limited by government regulation, and also availability of banks in certain areas. This proposal brings a solution to that, and addresses it based on the experience of some countries, like Kenya where the P2P is popular.\r\nThe impact is really clear and the outcome would be beneficial to the population.\r\nI totally agree with the proposed solution ", "q0r": 5, "q1": "The plan as presented is detailed and explained in simple words that allows people like myself who don't have much knowledge in programming to understand how the mechanism will work between the seller, buyer and arbitrator.\r\nThe timeframe is reasonable and detailed. The proposer's team is composed by people with background in programming, however I would love to see that team includes also other expertise, like in finance, marketing, communication. Since, it's a big project and scalable to other countries in Africa. Tht work needs people for marketing, promotion to attract more users.\r\nIn the proposal, it should have been better to specify what country in West Africa would the first to get this proposal implemented in. And give some characteristics of that country and the reasons of choosing that one compare to others.", "q1r": 5, "q2": "One of the challenge that the proposal may face was raised by the proposers, what I couldn't find was how will the community be doing audit of this proposal, since on some stage, work will be done locally by technician before being visible to the community.\r\nWould be better to develop a mechanism to connect with the community as this is very interesting as proposal.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "P2P is an excellent solution.  Most Africans I met even back in 2017 had smart devices making a Mobile dApp ideal.", "q0r": 5, "q1": "The expertise is exhibited in the statements and links provided.  The uncertainty only exists due to the amount of hiring required.  Are there any leads?  Does proposer have experience vetting and hiring staff? ", "q1r": 4, "q2": "Strong Auditablility.  The detailed road map laid out will make following progress simple.", "q2r": 5, "assessor": "z_assessor_521", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal meets the objectives of the challenge, since it intends to facilitate the purchase of tokens among the inhabitants of Africa, making it easier for them to participate in the activities of the Cardano ecosystem. However, I believe that the author of the idea could use the best concepts, so that we could understand his project more deeply. For example, it would be good if he went into more detail on the concept of peer-to-peer networks, because I couldn't fully understand how they work. I found it interesting that he explained how the process for acquiring ada on the continent is, and in fact, it is quite bureaucratic, probably causing people to give up on the acquisition, both because there may be a lack of information about the benefits of the currency and also the complications in the purchase. If the author goes further into other concepts in his proposal, I believe that credibility would be increased.", "q0r": 4, "q1": "Regarding the ability of the team to execute the project in a satisfactory manner, I believe there was a lack of detail. We know that the team is currently composed of 3 professionals and also what their functions are. However, it would be interesting if there were a little more detailed description of each person there, for example: places where they worked previously, a linkedin profile, their backgrounds, locations ... We do not know if they are from Africa and also if they intend to include professionals Africans on the team, as I understand it, will still hire the back-end and front-end developers. We have a little more detail regarding the author of the proposal, but as he claims to have many years of experience with dApps and blockchain, it would be positive if we had examples of some of his work in the area. We also have a website attached, but it doesn't have a very long content or easy to understand for those who are visiting it for the first time.", "q1r": 3, "q2": "The authors make a very objective script regarding the activities that will take place to continue the project. They initially divide the time into months and then quarters, establishing a chronological order for such activities, which is very positive. They also establish success metrics, making community tracking simpler. Regarding the monetary breakdown, I thought he detailed it satisfactorily, we know how much will be directed to each professional and also for how long. So I think the auditability is pretty complete.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal targets a pressing need in Africa to exchange local currencies for Cardano. Such a platform would facilitate onboarding in African countries. Few details are given as to the Fiat side of the exchange.", "q0r": 4, "q1": "The team includes Cardano developers. They have a detailed plan for development of the P2P platform, but few details are given for the actual exchange of fiat for crypto. This is key to the proposal and I would expect a better communicated roadmap in this respect. ", "q1r": 3, "q2": "the team provides a detailed roadmap, but it is uncertain when/how we can expect P2P cash for fiat transactions. Since this is the main  problem statement for the proposal, I would expect more measurables related to the implementation of p2p exchange for local fiat. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "A Peer to Peer  exchange where  Africans can buy or sell  Cardano Blockchain tokens with Local Fiat Currencies", "experience": "Small team of Shadowy Super-Coder building DApps. \n\nhttps://github.com/orgs/Volibra/people/\n\nmetalamp.io(Consultant) : **Smart Contract Audit**"}