{"id": 367209, "author": "", "title": "Plutus Lottery ADA Game", "url": "https://cardano.ideascale.com/a/dtd/367209-48088", "category": 26108, "amount": 47500, "description": "There are not enough developers in Africa working on projects related to the Cardano Ecosystem.", "f6_no_assessments": 2, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a beautiful proposal with great impact on Cardano, African Cardano developer community and Charity combined. Kudos to the team.\r\nThe proposal clear defined a problem and went ahead to give a detailed breakdown of the solution in a clear manner but i have a few questions which the solution did not cover as stated below:\r\nHow will the payments be disbursed to the Charity organisation ? Will the selected Charities be manually funded or they will have their addresses coded in the smart-contract ?\r\nIf they will be manually paid, how will you ensure that the funds get to the charity and properly used ?\r\nIf these questions are addressed , this is a winner.\r\nI agree .", "q0r": 4, "q1": "The proposal provided verifiable experience with verifiable links .\r\nThe proposal has a clearly written workable implementation plan, milestones and cost breakdown.\r\n\r\nThe implementation clearly indicated that subsequent funding will be requested in future funds  which is thoughtful and considerate of other proposal.\r\n\r\nI agree.", "q1r": 4, "q2": "The proposal provided sufficient information to help audit the project progress and success.\r\nI agree.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "I believe this proposal fits very smartly with the challenge's objectives. I'm gonna explain. They intend to create a kind of lottery that will run daily and people will bet on ada, and the entire team of game developers will be African. This is extremely positive as it represents work opportunities and a (generous) remuneration, as mentioned at the end of the proposal description. The winner would receive 70% of the fund from each round, and the other 30% would go towards both maintaining the game and supporting small pools and charities on the continent. In this way, Africa would benefit in many ways, and if investment promises are actually fulfilled, a wide range of Africans would benefit.", "q0r": 5, "q1": "Regarding the team that proposes to run the project, I have two comments. First, it would be interesting that, in addition to the descriptions provided about the 4 current team members, some examples of previous work and linkedin profiles (if any) were attached, so that we can get to know even more deeply who they are and their past experiences . Another detail is regarding the future developers that would be hired, we only know that it would be from the continent itself, but we don't know how many professionals they intend to call, how many hours per day they would work, what they would do, individually... For these reasons, I believe that the current team is indeed very well educated (they have specializations and indisputable technical knowledge), but it lacked to demonstrate a little more in practice what they do (the attached site does not provide much easily understandable information for Ca's and Vca's) and to know better what they do intend with the hiring of future developers.", "q1r": 3, "q2": "About the applicability of the proposal, I also have two comments. The organization of what will be done is perfect, in my opinion, because we know what will happen in a certain period of time: activities are measured based on days and weeks, depending on their complexity. And in relation to the budget division, we also have an idea of ​​how much money would be allocated to each group of professionals and activities, but I still missed a detail. For example, 28500 or 60%: will be used for developers. It is a high value, it would be important to know, as I mentioned in the previous item, how many developers would be involved in the project and how the work routine would be. It would also be essential to understand how that division of the raffles of the drawings would reach each destination, how the contact with the pools and charities that were contemplated would be like. As it is a complex proposal, there is a lot to be detailed, and I felt that without these well-established notions it is not possible to satisfactorily visualize how everything will happen.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}], "solution": "We propose to create an entire team of African developers that will work on a project that will further adoption by creating lottery games.", "experience": "Abdoul Koanda Born in Burkina Faso, University of Ouagadougou, SPO of Faso Pool. Graduate Plutus Pioneer Program, member of Alonzo purple."}