{"id": 367639, "author": "", "title": "Smart Thrift Savings Wallet", "url": "https://cardano.ideascale.com/a/dtd/367639-48088", "category": 26108, "amount": 29250, "description": "Lack of orientation, knowledge & product for personal finance management in Africa. As Access to the internet & cryptocurrencies increases", "f6_no_assessments": 2, "f6_rating": 3.833333333333333, "videos": ["https://www.youtube.com/watch?v=BlXFqWHyomg", "https://www.youtube.com/watch?v=VA4wWlgwWMA"], "media": [], "f6_assessments": [{"q0": "The development of a savings wallet with additional smart contract functionality aligns well with the challenge of Grow Africa, Grow Cardano. More detail on the role of local currencies and the interface with ADA within the proposal would help explain the practicalities surrounding implementation and give a valuable insight as to how effective the project would be at meeting the challenge. ", "q0r": 3, "q1": "The roadmap provides good detail related to app development but would benefit from information about critical factors that are not related to the app. eg. partnerships, bank integration, legal considerations currency and token mechanics.", "q1r": 3, "q2": "Outcomes are tangible and well defined which will help in the assessment of progress. More detail describing success and sub-optimal scenarios would be useful and help to better gauge overall progress. ", "q2r": 4, "assessor": "z_assessor_373", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses a common problem in Africa which is a poor banking system. I think that they could have done a better job when stating the problem as it was a little bit confusing. Nevertheless, as an African myself, I can clearly see that the proposal fits the challenge. Besides, the poposal includes parts that explain the benefits of the solution for the cardano ecosystem. All in all, this proposal can be beneficial for the community if it is executed proprely. If this project is implemented correctly, I can see it scale in next funds.", "q0r": 4, "q1": "Based on the informations provided on this proposal, I think that it can be implemented successfully.  The proposal contains enough informations about the team. The links of their linkedin have been provided. Also, They have a clear roadmap with the expected progress and the time for the execution. The budget has been broken down in a precise way. The only issue if know if the budget is reasonable as I'm not a developper. But, based on my intuitions, I can believe  proposer has provided informations about the languages and the timeframe needed for the execution of the project.  This informations provided in this proposal are precise.", "q1r": 5, "q2": "The proposer has provide a clear roadmap with milestones. Unfortunately this proposal doesn't contain  KPIs. They should have provided some metrics, in order to allow  to the community, to track the progress of the project easier. Besides, the problem statement lacks some clarity, but the solution is detailed and clear. ", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Develop user-friendly financial intelligence mobile wallet to drive Cardano adoption in Africa through savings & open decentralized finance", "experience": "Our Team has a combined experience of 35 years in blockchain, finance, machine learning, business analytics, African business & big data."}