{"id": 367824, "author": "", "title": "Wutano Token - Africa Health System", "url": "https://cardano.ideascale.com/a/dtd/367824-48088", "category": 26108, "amount": 45000, "description": "Millions are without affordable health cover in an inflationary environment of 40 currencies, 54 states and 2000 languages", "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal has the potency to improve the lives of millions of individuals on the African continent, but also in other places in the world. As stated in the comments; the African setting is a pilot to scale up the system globally after the initial 6 month timeframe. That means that there is a potential to increase general Cardano adoption as users would have an incentive to enter a health system like this. ", "q0r": 5, "q1": "The project is already live off-chain. The proposal aims to integrate this system into the Cardano blockchain in order to create digital assets to attract investors and users. \r\nThe WADA partnership is favorable to this objective, as they have recent experience in this exact field. \r\nThe rest of the team is very well placed, on the ground, in Zimbabwe. \r\nThe project includes sending out experts in the field to persuade medical personnel. \r\n", "q1r": 4, "q2": "Both the proposal as the website contain a lot of information. \r\nTo better be able to grasp all of this, creating an infographic would be very suitable. \r\nTo further improve the proposal, it would be helpful if there were hints of which types of investment assests would become available in the future of this project. As right now, it is difficult to asses if it would prove beneficial in today's markets. \r\nGreat funding breakdown and risk assessment, though. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 11, "ne": 6, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "This is a very clear and detailed proposal highlighting the problem of Medical Cover in Zimbabwe and proposed a well detailed solution.\r\nThis is an important proposal as it will help in reducing the huge gap in Most African Health sector , not specifically Zimbabwe alone.Great work by the team.\r\nI Strongly Agree.", "q0r": 5, "q1": "The proposal did a good job of providing Verifiable experience with links and also presented a detailed implementation plan. kudos to the team\r\nI strongly Agree.", "q1r": 5, "q2": "The proposal did a great job of presenting necessary information that can help in the audit of its progress and Success.\r\nI strongly Agree.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "There is great potential in this proposal. The use of Token the provide Healthcare for Wutano members would give the people in Africa an incentive to enroll in this system for healthcare. Meaning an increase in users of Cardano. Looking at the comment the proposer provided he stated that this model could also be used outside of Africa meaning there is huge potential behind this.\r\n", "q0r": 5, "q1": "Looking at the website it is clear that this project wasn't born yesterday.  Wutano already exists and this proposal is a means to connect the project to the blockchain to have a bigger pool of funding for Wutano. Since Funds6 has set its eyes on WADA this proposal is a perfect partnership. the relevant experience of the team speaks for itself, the work is already being done and now they are looking to add members to the team to develop the blockchain connection. The plan is simple and comprehensive, leaves no place for errors. The budget is reasonable and the breakdown gives insight into what the proposers plan to do with the budget.\r\n", "q1r": 5, "q2": "As stated about an excellent budget breakdown. Risk assessment is also provided which is something that gives a confident look on the proposers that they know how to handle projects. Although the roadmap isn't perfect and leaves some assets open to suggestions there is enough information provided to give a good assessment of the project and help build a guideline on needs to be done. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Prioritise access to a community owned crowd-funded healthcare service, digitising tangible assets, and rewarding healthy behaviours", "experience": "Existing, unchained, healthcare system being served by 200 health professionals in a unique Wutano model that will grow through a BLC token"}