{"id": 368112, "author": "", "title": "JUNGLE", "url": "https://cardano.ideascale.com/a/dtd/368112-48088", "category": 26108, "amount": 50000, "description": "SME's lack the digital infrastructure necessary for them to properly utilize the internet as a tool to compete in the modern marketplace.", "f6_no_assessments": 2, "f6_rating": 2.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Jungle identifies the problem: adoption of Cardano is low and addresses it: by providing digital technology to SMEs. How this solution will add value to the Cardano ecosystem is unclear. Putting SMEs on an internet based marketplace and increasing African adoption to Cardano are two separate ideas. There is no technical information on how this is supposed to happen. \r\n", "q0r": 3, "q1": "There is no evidence of  relevant skills and experience needed to implement the proposal. There is no evidence of the type and number of team members required to implement the proposal. Finding a team is proposed, but nothing further. There is no budget outline or reason $50000 would be required. Information on what Jungle is, how it would be built, and what technical aspects like architecture, language and technology would be used for implementation is missing.", "q1r": 2, "q2": "The KPIs are vague and the timeframes can be reworked. The community would not know what to expect or when to expect it. The Roadmap, while beautifully presented, has only a fifth complete.", "q2r": 1, "assessor": "z_assessor_311", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal initially might seem disconnected towards the Challenge parameters, but if you were to have a deeper dive into their attachments, there is a clear effort to utilize Cardano technology in the form of Atala PRISM.\r\nOutside of that, it's aim to provide digital infrastructure as a foundation of SME's growth does fit with the Challenge. Goals intended also coincide with the potential entry points of Cardano's use case though Atala PRISM, which would potentially act as a gateway for end-users to perhaps copy and upgrade this business model, or develop something else altogether. Seeing that it intends to provide digital infrastructure, scaling is most likely possible.", "q0r": 4, "q1": "This proposal does not provide further evidence that would cement that the proposer have the required skills or experience to execute their deliverables. At the very least years of experience of some sort unfortunately has not been provided. Although all their attachments indicates they have a potential business model or the sense of it, after reading through time and time again, no mentioning of the proposer details are fleshed out. One would expect since it seems that the majority of the work would be contracted out and not team-based, their would be an emphasis showing experience in project management, this proposal unfortunately again falls short. The type and in-depth number of contractors are also not identified clearly enough therefore assessing the selected contractors is not possible. Budget wise, sufficient breakdown is not provided, therefore assessing whether it is reasonable unfortunately becomes a guestimate. This also trickles down to various other pressure points, even down to identifying challenges and risk. The words, \"...actively recruiting..., ...has identified contractors..., ...has a detailed plan...\", unfortunately are not followed up by a trackable or numeric evidence.", "q1r": 2, "q2": "This proposal leaves auditing the progress and success in the realms of guesstimate though it has soo much potential. The proposer should make an effort to learn on how-to-make a proposal with the Catalyst School and linger in the community to find collaborators. Highly suggest and encourage to please try next fund, this proposal has potential to \"kill it\" next time.", "q2r": 2, "assessor": "z_assessor_635", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "Jungle's platform provides digital infrastructure and tools, creating utility of the internet and digitizing the local marketplace for SMEs.", "experience": "Kenneth Joseph Eilor\n\nMechanical Engineer\n\nInnovation Fellow at Iowa State University\n\nFounder (Proposer)"}