{"id": 368275, "author": "", "title": "SHiELD Africa, grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/368275-48088", "category": 26108, "amount": 144000, "description": "How do we improve the flow of information and productivity in Africa while growing Cardano ecosystem?", "f6_no_assessments": 2, "f6_rating": 1.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal presented a problem (Which is a question) and a clear solution utilising the SHIELD blockchain but seems to be doing exactly what Cardano is already doing with Atala Prism(https://atalaprism.io/app).\r\nThe proposal has a huge budget request without clearly breaking down how the funds will be utilised and considerations of other Proposals.\r\nThe proposal feel more like an advertisement of the SHIELD Blockchain which is counter-productive to growing The cardano African Community.\r\nI do not agree that this solution address the challenge.", "q0r": 1, "q1": "The proposal lacks a clearly defined implementation plan with the breakdown of timelines, milestones and cost implication.\r\nThe proposal failed to justify the request of $144000 by breaking down how this funds will be utilised to make the proposal a success.\r\nI strongly disagree that this proposal will be implemented ,also seeing the size of the fund request without considering other fund application reduces the chances of the proposal being funded (The project funding can be split into smaller chunks and the scope broken down also)", "q1r": 1, "q2": "The proposal did not provide any means to be properly audited for progress.The proposal needs more work and clarity on each individual milestone, timelines and individual cost breakdown to be done .\r\n", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "While the proposal might present some useful tools, if thoroughly explained and executed, it does mention a lot of the Atala Prism functionalities. I don't see the benefit of building up a parallel blockchain with some of the same functionalities", "q0r": 3, "q1": "Milestones or a timeline are not presented. The homepages are all hostes on the same platform and seem to be made by the same person. The companies were only recently founded while they suggest big experience and ties to african governments on their websites. It is unlikely that a recently founded one man company by a student will successfully implement an entire, vast blockchain solution without a schedule or a proper budget presented.", "q1r": 1, "q2": "Since the project does not have any proper milestones or diversified budget it will be difficult to audit it's success apart from checking whether the functionalities are actually built (even thise are kind of vague as well.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "SHIELD blockchain provides a free hybrid public-private distributive decentralized database for all nations within Africa.", "experience": "James Chelley is a computer science student at San Jose City College, with technical & sales work experience from AT&T and Clearwire"}