{"id": 368445, "author": "", "title": "Cardano Fellows Uganda (CFU)", "url": "https://cardano.ideascale.com/a/dtd/368445-48088", "category": 26108, "amount": 65000, "description": "In Uganda, Cardano's visibility and entrepreneurs' understanding of future opportunities are extremely little.", "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal clearly describes how the proposer would like to address the challenge. From impact point of view the 10 CFUs will benefit most, others will gain only awareness about crypto and Cardano. Therefore I think it would be worth of expanding with some more ideas how a wider crowd could be addressed with the requested founds. From scalability point of view it gives a good basis for future expansion, thus keep on working on it.", "q0r": 4, "q1": "The proposer has a clear view how they would like to implement the proposal and in the same there are clear plans about who will do the job. I would be interested to see some more information about curriculum development in order to understand how it will be developed, since based on the description this will be the first one.\r\n", "q1r": 4, "q2": "The proposer has set targets to measure which is great. Participation in the workshops are clearly measurable, however it would be interesting to see how the general awareness what the program brings could be measured, e.g. feedback collection during the whole campaign. ", "q2r": 3, "assessor": "z_assessor_33", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is clear and effectively address the challenge of growing Cardano in Africa with a focus on Uganda.\r\nIt is a great well rounded proposal but the budget seem to be on the high side.", "q0r": 4, "q1": "Verifiable experience was provided alongside added video material to further give in-debt understanding of the ability to implement the proposal.\r\nThe Proposal presented a clear implementation plan and cost but the requested amount seem to be high in which the cost breakdown clearly shows .cutting down the cost or breaking the proposal to different funds can help in getting the proposal to be funded considering other proposals will need to be funded also.\r\n\r\nThe presentation of the key metrics seem to be of no use as there are no real references to work with.\r\nConsidering the above, i agree that given experience and plan presented will be implemented successfully. ", "q1r": 4, "q2": "The proposal did a great job of highlighting timelines and auditable milestones for the proposal to be audited.\r\nConsidering the above, i agree that the proposal presented sufficient information for the audit of the proposal progress.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The idea to create a network of fellow Cardano enthusiasts within Africa is what this challenge symbolizes. The added value of this proposal is not directly linked to the ecosystem. But by bringing awareness to the proposal and building a bigger network it gives publicity to Cardano which will lead to people being engaged in the community. I fully support this proposal for the challenge not because it fits within the objectives but also because the idea wants to focus on females and youth. Execution wise the proposal is somewhat lacking as I will explain further in the next criteria.\r\n", "q0r": 4, "q1": "The proposer has a clear understanding of what needs to be done for the proposal. What bothers me a bit is that he does not provide the necessary evidence of experience. There are no links provided about the proposer. The only link that is provided is a youtube link or the organization he wishes to address. The plan is detailed on a primary level. We get the objectives of the plan but not how they actually plan on implementing it. How will you recruit the CFUsand where will you search, the community, or on a different platform? Do you already have ESO in mind? There are still a few points in the plan that are not addressed and not documented on how you intend to do them. Budget wise this is well explained but appears like it would not support this proposal. You ask for a fund on building curriculums for CFU's but wouldn't this be included in the training at Finding XY. It seems like the scope of this proposal is a bit too much to handle and this should've been handled before proposing. Because of this, I won't put a verdict on feasibility and let my Co-CAs handle this.\r\n", "q1r": 3, "q2": "As I've described above the roadmap/plan included is basic and does not clearly state any points in time where assessment is viable. Nor are we seeing milestones for the plan. This makes it hard later to assess the project. This is because we don't have any foothold in the project, nothing we can base questions on. The idea in the proposal is a great one and I hope this comes to life with the necessary help of supervisors. ", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Cardano Fellows Uganda will build capacity amongst local stakeholders in order to flank Cardano's expansion across East Africa.", "experience": "Well-positioned in the ecosystem of African Enterprise Support Organizations to sign up Cardano Ambassadors (CAs), starting in Uganda."}