{"id": 368818, "author": "", "title": "Cardano and Christianity for Africa", "url": "https://cardano.ideascale.com/a/dtd/368818-48088", "category": 26108, "amount": 250000, "description": "Further economic identity and empowerment, for financial inclusion across the African continent in harmony with Christianity.", "f6_no_assessments": 3, "f6_rating": 1.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "Draft proposal. There is no problem in the problem statement. The idea described is not clear and understandable. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility  assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability  assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 3, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The solution proposed through this proposal is realistic, and consists in making Christian parishes in Africa become stake pools. This idea may scalable and expand to various cities, countries. However it should be well presented, and with clear collaboration with religious institutions (parishes) that need a buy-in fir the idea for it to be successful.", "q0r": 4, "q1": "The proposals is incomplete. It doesn't respond to the question HOW in order to allow assessors to be able to measure the feasibility. Spend $250000 on a proposal is a lot of money that need to be proven and supported with a plan that has to be detailed and clear to understand.\r\nThe way the proposal is presented doesn't allow me to assess it. Hopefully the idea would be considered for next funding rounds.", "q1r": 2, "q2": "The proposer team didn't complete adding necessary information that would have allowed to rate this proposal.", "q2r": 2, "assessor": "z_assessor_478", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Religion has no place in Project catalyst and nothing to do with the mission of Cardano. Please keep it secular. Not sure how more stakepools at auch high costs will further NOTE: I notices tge proposer has asked to withdraw the proposal themselves which has not been done yet. Due to the sheer amount of proposals in this funding round and the possibility that this might be overseen completely because they just wrote it in the comment, i have still left an assessment so this proposal does not accidentaly go to funding stage even though the proposers don't want this themselves cardanos mission. NOTE: I noticed the proposer has asked to withdraw the proposal themselves which has not been done yet. Due to the sheer amount of proposals in this funding round and the possibility that this might be overseen completely because they just wrote it in the comment, i have still left an assessment so this proposal does not accidentaly go to funding stage even though the proposers don't want this themselves", "q0r": 1, "q1": "No plan is presented and the proposers disclose no information about themselves. An insanely high budget is asked with no rationale.NOTE: I noticed the proposer has asked to withdraw the proposal themselves which has not been done yet. Due to the sheer amount of proposals in this funding round and the possibility that this might be overseen completely because they just wrote it in the comment, i have still left an assessment so this proposal does not accidentaly go to funding stage even though the proposers don't want this themselves", "q1r": 1, "q2": "No milestones are provided and no detailed objectives that can be audited. NOTE: I noticed the proposer has asked to withdraw the proposal themselves which has not been done yet. Due to the sheer amount of proposals in this funding round and the possibility that this might be overseen completely because they just wrote it in the comment, i have still left an assessment so this proposal does not accidentaly go to funding stage even though the proposers don't want this themselves", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We envision accelerating Cardano in Africa by making each Christian Parish, a Cardano Stake Pool with an Atala PRISM dApp.", "experience": "We are the FAITH Stake Pool Startup. We come from Big-Tech and are passionate about Cardano and how it will change our world."}