{"id": 368928, "author": "", "title": "Digitised Certificate of Origin", "url": "https://cardano.ideascale.com/a/dtd/368928-48088", "category": 26108, "amount": 50000, "description": "Many projects to export goods from Africa fail due to a lack of Certificates of origin.", "f6_no_assessments": 3, "f6_rating": 2.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal presented a real world problem  of manufactured product origin and offered a solution but failed to give further details on how the solution will be implemented .\r\nConsidering the lack of details , i neither Agree nor disagree.", "q0r": 3, "q1": "No Implementation plan provided.", "q1r": 1, "q2": "No audit information provided.\r\ni Strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Draft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "This idea has a lot of potentiel. Certificate of origine is a good idea but the proposer doesn't elaborate on this. I hope that the proposer will refine this idea and come up with a clear solution in the next funds.", "q0r": 4, "q1": "This proposal does not have any details about implementation. The whole proposal is just an idea.", "q1r": 3, "q2": "This proposal is not complete. The whole proposal is just an idea", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "To develop Cardano blockchain-based solution to help small businesses who want to export goods get certificates of origin.", "experience": "20+ years of IT industry expertise"}