{"id": 369320, "author": "", "title": "African Learning Institutions SPOs", "url": "https://cardano.ideascale.com/a/dtd/369320-48088", "category": 26108, "amount": 10500, "description": "Africa's population (2019) below 25 yrs old was 60%. Africa is the world's youngest continent. Youth need more opportunities + more support.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Providing education through the use of a stake pool is brilliant. They will learn so much from this and in return their community will benefit greatly from the future entrepreneurs this project will create. If the local communities see the success of the project and the results it brings, adoption of Cardano will grow immensely.", "q0r": 5, "q1": "Very involved and committed proposer. Sufficient links to provide more background and showcase projects involved in. The budget allocation and plan behind it is also sensible. With potential risks accounted for.", "q1r": 5, "q2": "The proposal has a clear roadmap with key performance indicators along the way. Potential risks have been accounted for. The solution to drive Cardano adoption through education to benefit local communities will be well received in Africa.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a well written proposal highlighting a problem and a very clearly communicated solution.There is not much here as the solution is self explanatory .\r\nThe proposal presents metrics to justify the need for a solution but failed to provide references to these metrics(\"A report published in 2018, by the International Labour Organization (ILO) on the topic, indicated that 94.9% of people between the ages of 15 and 24 in Africa work in the informal economy\").It is important that references are provided considering the solution is related to education.\r\n\r\nI agree the proposal addresses the challenge and also brings value to the cardano African Community.", "q0r": 4, "q1": "The proposal provided verifiable experience with provided links.\r\nThe proposal did a great job in the implementation plan breakdown which is easy to follow.\r\nThe proposal also did a great job highlighting potential problems during implementation and ways to mitigate them.\r\n\r\nI agree.", "q1r": 4, "q2": "The proposal provided sufficient information to audit the progress and success of the proposal with timelines, milestones and cost breakdown.\r\nI agree.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I agree because the proposal states the problem fact that DR Congo and Ivory Coast children who lack the computer resources for their studies need support.  Onboarding of learners need to be supporte.", "q0r": 4, "q1": "The timeline between November 2021 and January 2022 is feasible and easy to monitor implementation. Also learners will be able to schedule their calendar \r\nand focus on learning.", "q1r": 4, "q2": "The budget is well explained and figures outlined clearly for efficient auditing. The information is not or ambiguous and can be seen clearly for monitoring and auditing.", "q2r": 4, "assessor": "z_assessor_352", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Engaging education institutions in Africa (DRC + Ivory Coast) onboarding 1000s of learners using stake pools as a learning + business tool.", "experience": "Educators | Wada | Social Entrepreneurs\n\nhttps://www.linkedin.com/in/razali-samsudin/"}