{"id": 369427, "author": "", "title": "Black Rhino", "url": "https://cardano.ideascale.com/a/dtd/369427-48088", "category": 26108, "amount": 75000, "description": "Numbers of endangered species continue to rise, and no easy way currently exists to support conservation efforts utilizing blockchain.", "f6_no_assessments": 6, "f6_rating": 3.8333333333333335, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=1620"], "media": [], "f6_assessments": [{"q0": "Involving conservation organizations and trying to protect endangered species with blockchain technology can be a great catalyst for adoption. Especially getting people to contribute and donate using this technology will educate them and drive adoption. ", "q0r": 5, "q1": "Already committed team with added inks and resources. Adding more info about your developers and showcasing their skills would boost voter confidence. The budget allocation and plan seems sensible. ", "q1r": 4, "q2": "Proposal defines success with key performance indicators and milestones. The solution to support wildlife conservation by using blockchain technology is great because it also educates and drives adoption. Enabling token holders to vote will make the project resilient to future risks and challenges.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a detailed carefully written proposal , clearly outlining a problem and providing a clear real world solution. The proposal also addresses the challenge problem and has great real world importance.\r\nThe requested amount of the proposal seem to be high and to give the proposal a better chance of being funded , it will be great if the implementation of this proposal is split into various funding rounds .This will give more room for other projects to be funded also.\r\n", "q0r": 4, "q1": "The proposal clearly outlines the experience with verifiable links and also clearly outlined detailed implementation plan.\r\nThe Cost breakdown seem to be over-generalised and would improve the chances of the proposal being funded if more details are presented to justify the $70000 dollar request which is considerable high for funded projects.", "q1r": 4, "q2": "The proposal clearly provided detailed breakdown of timelines and milestones information which will be sufficient to audit the progress of the proposal.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This is an important project: to help save endangered species. This is certainly an issue in Africa as, hopefully, more land development will mean more protections needed for these species in danger. However, this is questionable the effect it would have on growing Africa, or growing Cardano. The biggest impact I could see is favorable media coverage of this then having an indirect positive influence on Cardano.", "q0r": 3, "q1": "Clicking on their attachment and then going to their slide deck will give details about this team. I would have liked to have seen more qualifications about this team and their previous efforts. The team looks young, so would be concerned about the deliverables of this project for the amount of money requested involving an inexperienced team.", "q1r": 3, "q2": "The slide deck was helpful, and their rollout plan seems realistic. I am concerned with the price tag of $75,000 when the campaign has a budget of $250,000. With the other two elements being questionable if the project directly grows Africa and Cardano, and then also the possible lack of experience with the team (at least I couldn't find credentials readily enough when reviewing this proposal): seems like results in not having enough information to advance this idea. It is a very worthwhile idea, however, and one that brings value to the planet while not necessarily addressing the campaign well. I think with more development, and then giving Catalyst some more team credentials: that this will become a proposal in the future worth advancing.", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Problem statement being helping to conserve endangered species with blockchain technology the proposer is proposing to building a platform to receive crypto token and donations will be very helpful to raise the funds which intern will be used to help endangered species hence the proposal effectively addresses the challenge", "q0r": 5, "q1": "the proposer has given a detailed plan and steps to be implemented hence it's likely this proposal will be successfully delivered but the experience details given by the proposer is generic ", "q1r": 4, "q2": "The proposer has given a detailed timeframe on implementation of the project this would be very helpful to track the progress of the proposal and a more detailed fund breakdown would have been very helpful to audit the progress and the success of the proposal", "q2r": 4, "assessor": "z_assessor_419", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "In terms of building momentum and helping the world focus on Africa this proposal meets the objectives exactly. I am wary of NFT's (probably because i don't understand them enough) so i don't know if this proposal will be successful with a NFT lead concept. However i do have a project management background and have written and reviewed many project briefs, discussing plans and budgets. The work done to date and the resources involved is transparent as is the roadmap.", "q0r": 5, "q1": "The resources identified as part f the proposal look to have the appropriate background and skills. The work done to date , looking through the website and social media shows this project gaining momentum.\r\nMy only slight hesitation is i would like to have seen a much more detailed breakdown of where the money is going to spent (eg 40k on marketing - need breaking down into plan vs resources vs budget)\r\nHaving said that , the overall purpose of the challenge is to promote  growth i have seen enough to put trust in the people behind this, the detail can be forgiven in this instance (this is the only proposal where i have forgiven it) ", "q1r": 4, "q2": "The measure of success and how they will be tracked is  simple to understand and transparent. The only feed back on this i have for the proposers is to have these milestones visible on your website (ie a simple troll/kanban board). at the moment the roadmap slide in the project deck doesn't align exactly with what is written in the proposal. Having a 'live' view of progress will benefit everyone interested in the work being done.\r\nThe proposal also doesnt call out and specific risks or challenges. e.g. are there any regulatory hoops to jump through? again be open with the community and the community will help you.", "q2r": 5, "assessor": "z_assessor_45", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does identify a problem that fits the Challenge parameters and in terms of it's deliverables potential effect can be related to growing Africa. This connection can be made by it's effort to provide financial sustaining opportunities for non-profit conservation organizations in Africa. Non-profit conservation organizations tend to rely on grants and donations, though there are some that also generate sustainability through sales of merchandises, leasing of land etc. By utilizing blockchain, and what this proposal is proposing, the leveraging of NFT, done in a thoughtful and detailed manner can perhaps not just sustain but help grow those non-profit conservation organizations. This proposals effort will add various values to the Cardano ecosystem in terms of providing awareness to other non-profit organizations, NGO's and similar organizations the potential empowerment that Cardano can provide to achieving the goal of Cardano being a force for good. Seeing it's business model, it should be scalable and deployable easily to various entities and regions.\r\n", "q0r": 4, "q1": "This proposal although has beautiful intentions it breaks my heart that it falls short in this category. There is no evidence written in the proposal or in all their Linktree links or in their pitch deck that clearly describes who are the team, what are their relevant skills and experience. It quickly becomes a guesstimate in gauging the capability of this proposal to deliver their goals. Although there is an effort to identify team members, it does not state their background. Seeing the potential massive undertaking this team will face, their proposed budget is underwhelming. It is very much still in it's early stages. The budget and timetable needs to be clearly defined to maximize deliverables and minimize unexpected hurdles for again this is a huge undertaking. To that matter, this proposal has not took in the effect of potential hurdles, such as, the willingness of African non-profit conservation organizations to even undertake learning blockchain. This perhaps should be the proposers first concern.", "q1r": 2, "q2": "This proposal as much as I love their intentions in short, the information provided is not sufficient to gauge the progress and the success of the proposal responsibly. The proposer may refer to the points prior to find out what to work on. A further suggestions is to study on how-to-make a proposal with the Catalyst School. Speaking with WADA, although not related with conservation efforts, might yield connections that could act as partners or collaborators in the future iterations of this proposal, which perhaps will act as validators or/and act as a great initial partner to bounce off this proposal's idea. Looking forward to the future iterations of this proposal. Please keep your head high and continue to work on this.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "We will provide an in-house platform enabling users to support wildlife conservation through a crypto token, donation portals, and NFTs.", "experience": "Our Team has experience in conservation work, marketing/communications, digital design, application architecture, and development."}