{"id": 369801, "author": "", "title": "DApp Binding Arbitration Africa", "url": "https://cardano.ideascale.com/a/dtd/369801-48088", "category": 26108, "amount": 35000, "description": "African countries have adopted new laws for arbitration of disputes. It is unclear how this will play out in disputes over smart contracts.", "f6_no_assessments": 2, "f6_rating": 2.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "With the described delays in resolution of arbitration cases in certain parts of Africa, the need for a solution to this problem is apparent. The utilization of smart contracts running on Cardano seems like the targeted win-win-win. It will give a reason for new people to adopt Cardano, provide a much needed solution to a problem which will help the people in Africa, and the added use of the blockchain will increase value for ADA holders.", "q0r": 5, "q1": "The plan is solid and the team seems to be well experienced and up to the task. However, with the complexity that comes with such an ambitious plan, it leaves room for the possibility of unforeseen problems draining the funding and leaving the community with an unfinished project. This is my primary concern for the proposal. Additionally, I'd like to see something planned in terms of ongoing support to amend the smart contract templates as needed as laws change. I'd like to rate this 3.5 stars. I chose 4 rather than 3 in an attempt to give the team the benefit of the doubt, but 4 stars is slightly overstating my confidence that there won't be a malfunction in one of the many moving parts contained within this proposal.", "q1r": 4, "q2": "There is a loosely defined timeline that can be used to monitor progress. Ideally, the time frames for each part listed should be tightened up with more chronologically defined checkpoints to monitor progress, so fewer parts of the proposal are left up in the air until the targeted time of completion. Potentially, the board of advisors could help relay pertinent information and progress updates to the community.", "q2r": 4, "assessor": "z_assessor_207", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal clearly presented a problem and a potential Solution, but the proposal has failed to highlight how this Solution fits in this particular Challenge Category as the scope of the proposal is almost global and not unique to Africa which would be well suited for other Fund Challenge Category.\r\nThe proposal Solution seem to give sweeping generalisations  on the causes of delayed arbitration without highlighting other co-factors (https://www.premiumtimesng.com/news/headlines/459604-special-report-how-extortion-delay-in-getting-court-judgments-frustrate-justice-in-nigeria.html , https://core.ac.uk/download/pdf/234649906.pdf , https://legalpediaonline.com/eradicating-the-problem-of-delay-in-criminal-justice-administration-in-nigeria/) that can affect the Successful delivery of the proposal.\r\nThe proposal fails to describe how it will reconcile various arbitration laws from various regions and how it will fit with their local laws , then translating that to a single Smart-Contract (Are there going to be smart-contracts specific to every country considering how fragmented the arbitration laws are moving from country to country in Africa?).\r\nThe proposal problem indicated a change in laws without providing references to the new and old legal frameworks (\"African countries have adopted new laws for arbitration of disputes. It is unclear how this will play out in disputes over smart contracts.\").\r\nAdditional video link presented to further understand the solution leads to a youtube page with zero content (https://www.youtube.com/channel/UCn7mp5BXNH3pWkHtM85Z3rA).\r\nConsidering the above concerns , i do not agree that the proposal effectively addresses the challenge problem and it is well suited in a more broader Fund Challenge due to its broader scope.\r\n\r\n", "q0r": 1, "q1": "There are no knowledge / experience with verifiable links provided by the proposal to prove that the solution can be executed. Considering the solution has a very broad scope, there was zero effort in trying to clearly outline how the solution will be implemented and potential pitfalls that may arise such as the local legal regulators banning the use of the process.\r\nProvided timelines are unrealistic for such a very broad Solution and there seem to be little or no research on the problem to be solved in itself.\r\nConsidering the above, i do not agree that this proposal will be implemented Successfully, i believe it requires more work. \r\nThis proposal will go a long way if various aspects are broken down into smaller more manageable scope and the utilise subsequent funds to request for further funding when milestones are clearly achieved.", "q1r": 1, "q2": "The proposal provided sufficient information on how the progress of the proposal can be audited with clear timelines and milestones. This is the only part of the proposal clearly defined.\r\nThe proposal milestones and timelines for such a huge solution seem to be unrealistic considering that the same factors that delay arbitration will affect the access to proper guidelines (The local Lawyers willing to assist in every locality that this solution will affect will have to delay more court cases to attend to this if a thorough work will be done.).\r\nConsidering the above concerns, i neither can agree or disagree that this project can be audited to success with the provided timelines and milestones.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "1.  Develop educational resources for the Cardano community in Africa about arbitration\n2.  Create legal templates for binding arbitration", "experience": "J.D., Ph.D., contract law, business law, creator of educational resources, stack developer."}