{"id": 370247, "author": "", "title": "Cardano Health Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/370247-48088", "category": 26108, "amount": 10000, "description": "Lack of ***Secure Healthcare Infrastructure*** to provide needed medical records systems and interoperability to health facilities in Africa.", "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"q0": "Congratulations on the great idea and hope it sees the light for implementation. It's a brilliant use case.\r\nWould you be able to break down which kind of projects (hardware, content, API, product) failed, along with how many, who was involved, and the main reason why they failed, like more data support? And why the specific initiative to Africa? ", "q0r": 4, "q1": "I suggest a deeper check of the assumptions for the financial projections and look for areas where costs were underestimated or omitted altogether, so a more practical assessment can happen and for a clearer understanding of possible pitfalls and challenges.", "q1r": 4, "q2": "Felt the impression that was missing a better overview in terms of the management team and how the proposed team can offer solid conditions for a successful rollout of this project.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The team has addressed the challenge with a solution which could and should spread well beyond Africa alone but will help to provide Africa with the high level grassroots infustructure they need.", "q0r": 5, "q1": "This project is nearly completed and expects to finish HAPI chain and intergate Hapi Dao into the Cardano blockchain in 8-12 weeks. It would be good to see a list of KPI's to give more information on what is involved. ", "q1r": 4, "q2": "A clear list of KPI's would help here with a budget for each would be fantastic. I also think the completion and successful launch of the project within the specified timeframe will show the success of this proposal.", "q2r": 4, "assessor": "z_assessor_327", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "\"Problem statement :\r\nThere is no truly secure, trustless, and Decentralized Healthcare Infrastructure & Information Exchange.\" After looking through the proposal and documentation, it does appear that there was a lot of work put into this. One thing to note: There is duplicate proposal for fund 6 by the same proposer. (https://cardano.ideascale.com/a/dtd/Cardano-Healthcare-Infrastructure/370215-48088) Catalyst may want to keep this in mind when tallying the votes for the projects.", "q0r": 5, "q1": "The plan itself is very interesting, and well thought out. There seems to be some existing infrastructure to build upon which are listed in the proposers links. The execution of this proposal is quite possible. However, I also think that the success of the project would be greatly determined by the team that would be working with the proposer, combined with the proposers overall experience. As I do not have a window into either, I can only guess on how successful the roll out of this project would be", "q1r": 3, "q2": "I do think the idea has a lot of merit, and is worthy of consideration. The documentation on HIPAA compliance and the solution itself does seem sound. With that being said, I see a request for $10000, but It do not show how the funding will be utilized. As indicated in the earlier blocks, there is no identification of the proposer, the team or their experience. I did not see a project road map either. Please consider adding these to future proposals. These items allow voters to get familiar with the people behind the project and understand the project breakdown at a glance. This also allows community member to track milestones within the project rollout.", "q2r": 3, "assessor": "z_assessor_350", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has touched one of the pain points of africa which is a rather bad healthcare system. Improving this area with the help of the blockchain technology is a good win for africa and huge benefit for the cardano adoption. This is a great idea and I give it a 5.", "q0r": 5, "q1": "Given that there is already a prototype in place, I think that the execution of the project can be done without major issues. The only flaw that I see is a lack of a precise roadmap or some clear expectations. I give it a 4.", "q1r": 4, "q2": "This proposal has some strong points but also present some weaknesses. The lack of a precise roadmap and a detailed budgetization, make the audit a little bit difficult. The idea is really great to me and I hope this proposal can be improved and get funded in this, or the next rounds.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Secure and interconnect people health information would allow a lot of health institutions to operate well in Africa, especially since in some countries, hospitals are concentrated in cities, which is not accessible for those people living in villages or small towns.  \r\nProviding secure Health Information Systems to Doctors & Health Facilities that would help the African community and health professionals.\r\nThis proposal brings a solution to that situation as presented. I strongly agree with it, and since I personally  know the situation of health infrastructures in Africa.", "q0r": 5, "q1": "The proposer's team if formed by experienced individuals who have already developed other platforms, and put up the current one, what they would like to improve. Their expertise is tangible, however I don't see any mention of collaboration or partnership that they have started with African health systems in some countries or cities. It may be necessary and interesting for people to know what has been done on that side. \r\nThe budget has no details, what would also be important to see, but the overall feasibility of the proposal is there, and proof of what's already up and running.", "q1r": 5, "q2": "Having the HAPI Hub and HAPI Cure running will be the starting point for the Catalyst community to follow the progress if the proposal is funded.\r\nThe timeline of the the project is set to 8 to 12 weeks to complete the addition of the HAPI DAO.\r\nI strongly agree with the auditability of this proposal.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "This proposal addresses enough challenges, it's a well laid plan, understands and forecast the challenges as well as solve the basics ", "q0r": 5, "q1": "A well experienced proposal that's very tough but doable with the fact that it has people with a existing system that's already running. ", "q1r": 5, "q2": "This is great. Not only does this proposal has sufficient details, it has experienced and also established personnel with a clear and well laid plan. I love it ", "q2r": 4, "assessor": "z_assessor_608", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is a great idea to apply technology and blockchain to the health system, which will be widely applied in the future.", "q0r": 4, "q1": "The documentation and website are complete, plans and resources are available, explaining the technical aspects of the building into very clear blocks. Missing a bit of budget breakdown information", "q1r": 4, "q2": "Well-defined solutions and modules, need to add Timeline for each stage", "q2r": 4, "assessor": "z_assessor_610", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Providing secure ***Health Information Systems to Doctors & Health Facilities in Africa*** making them *interoperable* citywide or even nationwide.", "experience": "We've been in the health sector since 2016 building a healthcare platform - ++*www.hapihub.com*++, the same team behind *++www.mycure.md++*"}