{"id": 397232, "author": "shadowrealmscnft", "title": "Shadowrealms play to earn card game", "url": "https://cardano.ideascale.com/a/dtd/397232-48088", "category": 26440, "amount": 65000, "description": "We all need food and money to survive and Shadowrealms game provides NFT gaming And income around the world with play to earn game", "funded": 1, "upvotes": 28209056, "downvotes": 16356462, "votes_result": 11852594, "votes_cast": 106, "f6_no_assessments": 15, "f6_rating": 3.422222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 348, "q0": "Through the objectives described in the proposal, we can see that one of the great ambitions is to go beyond the usual entertainment and fun of a game, while aiming to provide a source of extra income for players, which contributes and combines with the objectives. and challenge goals.\n\nThe success of a game that has a healthy gameplay environment and still offers an alternative way of earning can bring Cardano notable visibility, it is worth mentioning, however, that care must be taken with this approach, so that the game does not have its entertainment factor muffled. by the mercantile characteristic of the same, which is inserted with the use of NFT's.\n\nHowever, for all the characteristics described in the proposal, it does not seem that this will be the case. Therefore, we have an innovative proposal within what is proposed. The budget requested by the project is relatively high, which leads us to the need for a good professional base behind it; and this doesn't seem to be a problem, as the people involved in the project point to having a high degree of experience in the specific segment of game development, including citing gaming industry giants such as Blizzard.\n\nAdditionally, we also have that the developers involved point to having experience in metaverse development of games like SecondLife, which may even be the great precursor of every 'metaverse style' movement that we see today.\n\nThus, it is possible to see a basis for potential success for this project, contributing to the growth of Cardano's ecosystem, and given all the characteristics involved so far, the amount of capital required seems high, but justifiable.", "q0r": 5, "q1": "Continuing what was mentioned above, the people involved demonstrate a lot of ability to develop and bring the project to life. As they have previous experience in the technology market and especially in the area of ​​games, we also realize that there must be a good know-how regarding the practices and measures that must be adopted to maintain a live ecosystem in the game, fundamental for the success of the game. same. In addition, experience in relation to the operation of Cardano and knowledge of blockchain technology is pointed out, essential for the tradable articles of this card game to achieve success.\n\nOne way to confirm the information mentioned in the project is to access the site juegostudio.com, which seems to be one of the most interesting points of the proposal. There we can find a rich portfolio with examples of the company's areas of activity, and even other game projects that were previously executed by the company. In the 'about us' section in 'overview' we can find the people who work in the company in 'meet the team'. Among the people listed we can find Cartic P, one of the professionals involved in the Shadowrealms proposal.\n\nThe proposal presents a detailed structuring of the steps that must be fulfilled for the development of the game, also indicating what must be invested in marketing, which is one of the most important aspects for the success of a game. It is also important to mention that this investment in marketing will be made from Q2 onwards, when there is already a front-end development of the game, which greatly facilitates its dissemination.\n\nHowever, it should be noted that it is not clear whether the people who will work on the development of the game will also be responsible for its dissemination. It is possible that this happens given their previous experience, but it seems interesting that a marketing team could be dedicated to this function.\n\nThe idea of ​​the players themselves not only being the owners but also having the possibility to build and market their own NFT's is a good differential of the project. Additionally, the gameplay characteristics of a card game seem very compatible with the commercialization of NFT's; a rarer card or a pet of a less common species would therefore have a higher demand and value.", "q1r": 5, "q2": "To measure the adoption of such a game, it is essential that a demo is made available, containing some of the main gameplay features that will be present in the final stage. One of the best ways to follow the progress of the project, in these circumstances, would be to make available to the Cardano community, and also to players in general, a demo of the game. And through this gathering feedback and opinions on which points should be adjusted.\n\nIn addition, direct Cardano contributors could oversee the development steps outlined to verify that a balance is really being struck between using Cardano's tools and building a lively and fun game.\n\nWe noticed that the construction of a demo and the development of different fronts of the game were very detailed in the structuring stages. It is also clear that stages Q1 and Q2 must be audited with special importance, given that these are essential for the game to be successful in its entirety, this is because in these stages the backbone of the game will be built, with the establishment of the gameplay mechanics and game design.\n\nIn addition, it seems crucial that with the development of the game, check that it is not becoming too complex, as there have been other card games in a similar style that had potential, but were forgotten because they became too complex for be played by most people.\n\nIn general, the ideals conveyed here about auditability make sense, it's just the observation that it would be interesting to include some more specific numerical goals, for example, the expected number of players in the initial phase of the game.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 7290, "q0": "The proposal theoretically fits the challenge, but I encountered some problems here. Starting with the game description: it is confusing, we know that it will be a card game, that players will own NFT and at some point will create them in the metaverse, that there would be battles and it would be a game that you can profit from. This is interesting because it would combine two very common interests of the gamer community, the love for games and the possibility of generating income doing what they like. We also know that it would be a poster game, where people would collect cards from creatures, monsters, pets, and so on. But it's a little confusing how these battles would play out, would it be one player against another, or would they be through teams? How long on average would each battle last? The explanation of what we would do in the game, how its phases would be, how the player would evolve, how they would profit and etc is confusing, I couldn't understand exactly how a match would be, for example. The proponent explains that the game is free to start playing but at a certain point you would have to pay to continue evolving, it would be interesting to understand at what point this would happen and where the money paid by players would go. It is also unclear how this game would contribute to the Cardano ecosystem. Would all the NFTs here be minted on our blockchain? To receive the profits generated during the game, would people link their digital wallets? Would the winnings be entirely in game tokens or would there be any payout in Ada? How would players learn about Cardano's technologies, their differentials and advantages? In general, my opinion is that the game can be a good idea, it can fit with what we are looking for in the challenge (funding game projects that are beneficial to the Cardano ecosystem, either through the popularization of our currency, transactions in the our blockchain, NFTs coining in Cardano, player involvement in the ecosystem and etc); however, there was a lack of clarity to understand 1) how the day-to-day of the game would be, we do have a lot of information that says about the characteristics of the game, for example that it is a play-to-win modality, the players would be the owners of all the NFTs and etc, but it is not clear what a game would be like, the evolution of each one in the game and etc 2) to what extent this game would be built based on our blockchain and would benefit Cardano. Therefore, I think the proponent could review these issues and convey their ideas more clearly. \n", "q0r": 3, "q1": "This part of the proposal was also confusing, unfortunately. The proponent explains twice about the script and the use of the budget, I didn't understand if the first explanation would be a more general overview and the second a more detailed one, but anyway, let's evaluate it in parts. In the first explanation of the roadmap, we are told what tasks would happen in the 2022 quarters (the second, third and fourth). It worries me that from what I understand this would not be the total development time of the game as it requires a very high funding of 100k dollars. But going back to the analysis of the script: it is positive how the proponent divides the total time in part and inserts tasks to be performed in them, but the explanation of each one of them is still superficial. He could better detail each of these activities so that we could have a deeper understanding of the whole process. It would also be important to clarify how long each of these tasks would take. Some quarters are better detailed than others, I don't know if because they would be more “hectic” in the development of the project or if the proponent really provides more information about some than about others. Example of what an ideal roadmap would look like for me, in this proposal: in the first quarter, the proposer informs us of 3 tasks. I would like each of them to have a small text detailing how it would be made and how long it would last. For example, in three months we have 3 tasks, would each one last 1 month? When would the minting of the posters begin and when would it be completed? In Q4, the activities are better detailed, with only the notion of time being absent. As far as the budget is concerned, it is explained very superficially, for example 72k would go to design. Would all that work and money go to just one person? With such a high budget, a more detailed explanation would be needed. Why is 72k dollars needed? The design creation process would be divided into which steps? How could we better understand the use of this money in parts? As with the design, the other parts should also have been better explained. Right after the first explanation of the roadmap and budget, the bidder includes a second explanation that talks more about each quarter, the activities performed and the parts of the funding used per hour. This somewhat improves the understanding of the script and budget, but it is still confusing because these things are divided into two parts, I would like everything to be put together in a single explanation, clearer, longer and more detailed. And finally, about the team, only 2 professionals are presented. The game would need a complete team to be made properly, with professionals from various areas such as design, programming, marketing, narration, etc. I would like to know who the other team members would be, or if, in this case, the two permanent professionals would still hire the other people involved (this is not clear). A detailed explanation of the two professionals present is also not attached, I would like to know more about their CVs and how they relate to the Cardano ecosystem. In general, the script and budget explanation is a bit confusing, split, and lacked more detail in some parts, while the staff's explanation leaves a lot to be desired. \n", "q1r": 3, "q2": "The auditability of the proposal is average. At certain points, I also found it confusing. The proponent included Covid awareness in the middle of the success metrics, I didn't understand the direct relationship of this to the game. It sets out what medium- and long-term success would look like, emphasizing that the clearest success scenario would be when players were able to enjoy themselves and generate income from the game. I agree that this would be the ultimate goal, it also informs other things we could look into to see if the game is developing as expected, and the information provided is mostly qualitative. I would like two more things to be done here: for the proponent to include some numerical data, by which we could verify the success of his project more objectively, using statistics in our favor; that there were also clearer ways to measure the consequences of the game for the Cardano ecosystem, such as whether there was an increase in digital wallets, purchase of Ada, investments in pools, NFTs minted on the blockchain, active participation of players in the ecosystem, either by through Catalyst or other ways. In general I do not agree that the bidder provides sufficient and satisfactory information for us to accurately measure whether the game has had considerable positive consequences for Cardano. I suggest that he clarify these issues, taking into account my suggestions and those of other CAs. I also think it would be necessary for the community to track the progress of the game's development, not just the results. This can be done either if the proponent, in communion with his team, gives us feedback on the partial results of the game's development, through reports, for example; or if some members of the Cardano community, preferably who understand and are interested in the gaming universe, would follow the stages and their tasks and bring updates for the rest of us. In general, the auditability exists and it is not bad, but it can still improve a lot. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 10500, "q0": "The proposal fits very well with the objectives of the challenge, by creating a pay to earn game, using one of the game genres that generates a large cash flow, and where the sense of value for rarity has been widespread for a long time, as in the game of pokemon cards, that it had an explosion of new users during this pandemic, which ended up increasing the already high prices of rare cards, and that's because the game nowadays is not even played but used for collecting purposes. cards. This shows that the monetization model presented in the proposal works very well, but it also depends a lot on the value that each player will give to each card, and this will mainly be the result of a quality marketing campaign, and it will also depend on factors such as how the game will be fun, what are the differences between a common and a rare card that allow at the same time to show that the player has something special, but that it is also fair to play against, in a way that does not harm the experience of other players who still do not have this luxury, and this can be done through cosmetic changes, be they in design or animations or both, as is already done in games of the most different styles, but as it will be a pay to earn game, I imagine it will be tremendously difficult to be able to balance it, even because players who spent more money to get a rare card are not only expecting visual changes, but also a way to facilitate their gains in the game. But it is undeniable that the proposal may not only bring many new users to the Cardano ecosystem, as it enters a new market that has been growing very quickly in recent years, and because it is something new and the first games are very simple and focused in large majority in monetary gain, once a new game appears, if there are more opportunities people will drop them because it doesn't have enough depth in its content to attract a group of people really interested in the game and not only in its pay feature to earn, the market still lacks genuinely fun and interesting pay to earn games, synchronizing in-game earnings with adas in cardano's wallet. The SHDR token also grants good freedom to members of the gaming community to establish more democratic and independent governance.", "q0r": 5, "q1": "Unfortunately, the details of the members are lacking. Some claims are made about the group's qualifications, such as: “+10 years art and designer development for games(blizzard Ent.)” or “+11 years game development metaverse(secondlife)”, but at no time is evidence presented of such claims. allegations, or confirmation that such allegations refer to the author of the proposal, and in the presentation of the team it is stated that its members will be, the author of the proposal and a team of third-party game developers, members of the website “Juego Studio”( https://www.juegostudio.com/), which on the one hand is good because it quickly guarantees a considerable team with a good experience in game production, but it also reduces control over the game, and its individuality , apart from what keeps a game alive is the ability of the company that owns the game to continue releasing updates that correct the current problems of the game, and that also generate more content that makes it possible to recover the interest of older players, and to this would require a team dedicated to keeping the game relevant, and preventing players from opting to drop Shadowrealms while another game with a similar proposal appears. In terms of expenses, although USD 100k is a relatively small amount for the production of a game in general, the amount still consists of 20% of the total destined to the challenge, but I believe that the cost is well justified if the objectives of the proposal are met. . As for the details of the project, the dates for the launch of the beta and the game itself are presented, and although there are no specific dates for the production process, a time interval for each stage of production is still presented, which demonstrates a planning to achieve the project objective.", "q1r": 2, "q2": "In terms of monitoring, unfortunately, the performance of the project during the production process is still uncertain, until the creation of the beta, where players will be able to test the game and give their opinions in order to make the game more polished and closer to what the public expects. for the final stage of launching the game. After that, I believe that measuring the performance of the project will be as simple as measuring the degree of success of any game currently, that is, looking at the number of players per day or month, and comparing with the data obtained previously to know if the game is growing or not.", "q2r": 3, "assessor": "z_assessor_928", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1593, "q0": "The play to earn in game industry is now emerging as a phenomenon that attracts a lot of attention from investors. Many projects are built in this space and labeled as play to earn. I still don't feel the attraction of your game compared to other games. Your ideal is to create a play to earn game but I read it as more like pay to play as the player has to buy packages to continue playing, and the earn that the player earns is not obvious. From what source, what makes the latter player willing to buy back items from the former? In addition, an in-game economic model summary would be more appropriate to explain how your in-game cash flows.", "q0r": 3, "q1": "I agree with the game development roadmap that you guys building, as long as on each stage you attract more new players to experience and spend. Regarding the budget, I suggest you clarify each budget for each of your jobs. Because spending $50,000 on game design, the community will think it's too much because they don't know what the work includes and it will be too little if they see how much work you need to do.", "q1r": 4, "q2": "A project that attracts many investors must put transparency first. I think a link to the profile information of each member of your team will clarify this issue. Regarding the milestone for KPI to measure success, a specific number to evaluate what you will achieve in the future.", "q2r": 2, "assessor": "z_assessor_1394", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 1716, "q0": "Proposals have a clear, core solution that makes them high-impact. The proposal wants to bring people around the world together on the same Blockchain flow to play together, earn money together and grow Cardano. Through playing the game, people gain more knowledge about the Cardano blockchain, realize how blockchain technology works. Everyone can play and earn extra income at the same time. The team weighed the risks for its proposal. However, I recommend that you take the necessary solution with the risks when the proposal is implemented. ", "q0r": 4, "q1": "The proposed team has significant experience, knowledge, and background in game art and design development. Passion for Cardano and Blockchain research, along with a team full of expertise and necessary skills create confidence for the success of the proposal. The implementation plan with detailed roadmap is divided into 4 clear quarters in each work done. They mentioned $65,000 for the project as reasonable and there were detailed explanations for each step and time in the project plan.", "q1r": 5, "q2": "The proposal is written in a coherent, easy-to-understand manner, providing a step-by-step plan for each of the key milestones, making it easy to measure project success. From a fun entertaining game, everyone can gain knowledge and develop on the Cardano blockchain and blockchain. Impact on countries around the world to help people have more income grow with Cardano. With a completely new proposal, but from the plantable shows the sustainability of the project's success.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3562, "q0": "From my understanding of the game reward mechanism, I believe that the game would sound captivating enough to persuade gamers to join in, as there are a lot of methods they can do to earn more income, in the forms of playing, trading, making and mining NFTs. \n\nHowever, I would strongly suggest that the proposer include these two sets of information in order to make the game more promising and outstanding.\nInformation that refers to the gameplay mechanism, game lore or settings. Speaking from my experience as a gamer myself, a majority of players would be more interested in exploring those said aspects of a game. Of course, the rewards are just as equally important. That being said, some are in it for a good and fun time rather than the rewards.\nSome mention of figures for the key metrics. For example, if the game guarantees to lure in people from all over the world, what can be the estimated total number? Or given that there are various kinds of income-earning, how much may a player potentially make? Or is there a limitation to the number of NFTs players can create, as the game allows them to? \n        I suppose that it might not be highly possible to come up with those figures. Nevertheless, their existence should further fortify the proposal.\n\nI also notice that while the proposal does address a probable problem, it has not yet provided a satisfactory answer to solely eliminate the problem.\n", "q0r": 2, "q1": "Even though I don’t have much expertise regarding the process of game or application developing, I would say that the timeline and milestones are sufficiently detailed, and my praise to the team for including the promise to strengthen the game further should the game be met with success, proving the dedication to the game in particular and to the Cardano ecosystem in general. The required budget and its breakdown seem justifiable as well, though some content is misplaced in the team members section, and the roles and duties of the team are also presented. The only downside to me is the lack of personal information and expertise of the team members.\n", "q1r": 4, "q2": "As far as auditability is concerned, the team has managed to deliver quite a detailed and ambitious prospect of the milestones that the project can be expected to achieve in 3 different variants of time, all of which consist of some form of content and features available to players to explore and interact. And kudos to the team for taking some effort to mitigate the COVID-19 pandemic as well. More auditability points awarded to them for storing the information of the game on blockchain for audiences to view later. One small thing I’d like to add is that since the team has mentioned that some income is already generated by players, It would be helpful to include a few figures for the community to have a better understanding. Nevertheless, the ultimate success for the project does align with the desired outcome of the challenge setting, while also promoting to aid COVID-19-damaged countries and offering a fun gameplay for all.\n\n", "q2r": 4, "assessor": "z_assessor_1664", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3741, "q0": "Personally, i like the idea of attracting people into the Cardano blockchain with card games. Unfortunately, the Impact of this proposal is presented in a pretty sketchy manner. I voted for 3 points for the following reasons:\nThe presentation way for proposed solution cause confusion on how the card game works, and the aimed potential object. The describe how the proposal will adress the challenge and main challenge/risk part are duplicated.\nKPIs are not clear quantitative but just generally is attracting people in the world.\nThe risks and the solutions have not been shown in the proposal. Only mentioned as: \"The main challenge will be to connect the world with a play to earn and that it's not only a simple Nft game but actually you can earn an income from playing a game\".", "q0r": 3, "q1": "In general, the content is quite enough, but it is a pity that I'm confused because of the presentation of the proposal: it is repetitive and the structure is not clear. The content is presented cluttered in sections.\nThe roadmap is clear but I think it might be easier for the reader to imagine if you add the to-do items in game design (drafting, testing 1st, revising), marketing (select partners, how, where,...) at more specific times (month, week instead of quarter)\nThe budget breakdown is also should more detailed in these 4 parts (Game design, Webpage development, Coding, Marketing)\nAbout team members, based on the information of this proposal, I still do not have complete information about the members' background and experience as well as reference information resources), besides, because this game is related to the blockchain, It could be better if having members with experience in this field to support the project.", "q1r": 3, "q2": "There are Long-term successes, Mid-term successes in the proposal but the writer needs to add quantitative numbers to those successes and the way the community can follow the project to improve the auditability of the project.\nIf this project is funded, the Writer should consider adding specific KPIs with a specific timeline as well as how the community can monitor the project (monthly report on websites, social media, etc.) media,...).", "q2r": 3, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4042, "q0": "The team has come up with quite convincing solutions to the challenges presented by creating a card game that players can play to generate income. NFT games will be very popular because now gamers instead of just being able to deposit money into the game without getting money out, this money-making game will solve that problem. \n        The players will own all assets in-game from NFTs to land. They can generate income through winning and receiving good rewards or make their NFTs by mining resources on their land. They can collect and build their monster cards, pets, and breed them more strength to fight against other opponents. These things will help gamers feel more interesting in learning how to build an army for themselves. \n        I think it’s a good idea that the player can start this game for free so everybody can join without worrying much about fees. This helps many gamers of all financial backgrounds to join or even non-gamers who still want to try the game. They will be able to experience the game first to know the game mechanics and then decide to spend money to buy in-game packages.\n        If the project is successful, people will know how to make money from NFT games more and help them have resources to invest in equipment so they can enjoy game NFTs in the best conditions. In addition, it will increase the number of tokens and ADA traded in the game. This project aligns perfectly with challenges. ", "q0r": 5, "q1": "The team has a detailed road map, clear, with each milestone with the work to do to build the project.\n        As for the budget, they have given specific cost figures for each segment needed to create the game and market it to everyone.\n        It would be great if the team could give more details about the people working on the project and their previous experience. Because current NFT game players often look at the reputation of the game builders then they decide to invest to play.        \n", "q1r": 4, "q2": "This section provided by the team with development stages that help everyone have a clear approach to the game and know how to monetize the game. I find it very interesting that they want to create a place where everyone, even in poor conditions, can access the Cardano blockchain. The team creating a fun gaming community and facilitating income for everyone is a very good idea.\n        My advice is that the team should give the desired target metrics such as the number of people joining the community, the amount of gaming-based tokens and wallets developed, etc.\n", "q2r": 4, "assessor": "z_assessor_1702", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4266, "q0": "As I can see, the proposer has mentioned the main activities of the project and those who are the main audience they intend to approach. The team has also talked about how their proposed solution will address the challenge, however I think they should have showed more certain numbers or amount for other people to see if it’s aligned with the KPI or key metrics of the challenge or not. They have pictured what success looks like but it seemed pretty general and hard to follow up without certain numbers or amount. About the possible challenges or risks, they have thought about them, however, I think they needed to show how they would solve the problems if they encounter them so that they could be more active in every situation. About the way the proposal was presented, the parts of how their solution will address the challenge and what main risks they foresee were repeated. They needed to check more carefully. ", "q0r": 2, "q1": "The proposal was divided into 4 clear stages in which the proposer also talked about each task they need to complete to deliver the project. In addition, they have provided a budget breakdown for each stage. This shows that they have come up with a detailed plan. However, in the part of team members required to complete the project, I didn’t see the line “Q1 22” as it was written in the previous part so I wasn’t sure if they have missed any information in the proposal or not. They needed to check more about the way they write proposal. Besides, they enclosed budget in this part, which, I think, would cause disorder when reading. Last but not least, it would be better if they put more information about team members to show which tasks were taken charge by whom, people will understand easily. As I can see, there were just only members of software engineering, game developing, game creating, they still need to show members of designing and marketing.", "q1r": 3, "q2": "The proposal displayed what they think the success would look like. I still think they needed to conclude more certain numbers such as the amount of game players for other people to easily visualize. Also, I didn’t see the proposer mentioned if this is an entirely new project or it is in a previously funded project before. They should have added this information.", "q2r": 3, "assessor": "z_assessor_1714", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4286, "q0": "The solution described in this proposal is to create a “play to earn” card game where players can make income through collecting, trading in-game NFTs and earning SHDR tokens. The game mechanics are designed to be enjoyable and partly similar to the way blockchain works, and along with free start, this game serves perfectly as a fun and rewarding way for gamers who are seeking a route into cryptocurrency and the NFT market, which is closely aligned with the challenge. However, there are still a few problems that require further consideration. Firstly, this proposal lacks a detailed description of how the game will gain attention when it comes to the public. It was noted by the author that “The main challenge will be to connect the world with a play to earn game…”, however, there is no solution given to it, so this one here is definitely a field for improvement. Secondly, in the present, the specific trading platform and payment method are not provided in the proposal. It is better to know where players can conduct transactions and how they can turn their in-game assets into fiat money in case they need it. With all of the above, my rating for this part is 4.", "q0r": 4, "q1": "In the role of an advisor, I am confident to say that the author really did quite a good work in terms of covering factors that are important to assess the project’s feasibility. The timeline is clear and realistic, with works and detailed budget breakdown for each quarter are sufficiently listed. However, I do not see KPIs of how many people this game aims to attract at each specific time of the process, so it would be better if there is at least an estimation of that index given by the team. In this part, my rating is also 4.", "q1r": 4, "q2": "Auditability is not simple since this is a big project on an international scale. I honestly do not feel secure with the criteria and goals that this team use to track the project’s development and progress, since they are too general and sometimes unclear. There is a part that really confuses me, and it is “Awareness of covid and its impact on the world so with play to earn game we able to help people with income and support”. Although it is a noble gesture to support people suffering from the pandemic by giving them another source of income, the team, however, does not state anywhere in the proposal how to acknowledge people about the covid plague and its global impact. As a result, the rating for this part, in my opinion, is only 3.", "q2r": 3, "assessor": "z_assessor_1716", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5431, "q0": "Impact Assessment: Rating of 3. I do not think this proposal addresses the challenge however I understand what the team is trying to accomplish as a whole.  This game will be impactful as it will give players ownership of the game components. This will be made possible through NFTS and a token specifically made by the game.  This game has the ultimate goal of providing a \"basic income\" for its players. If this could be done, it would be addressing a portion of the challenge. The game is planned to be a card dueling game and it should be noted that some of the game NFTs have already been minted. This kind of game to me lacks an originality and this lessens its impact.  If this game could sustainably and continuously provide a basic income to its players as intended the impact will increase. This is however an extremely challenging feat to achieve", "q0r": 3, "q1": "Given the experience and plan presented I disagree that the proposal will be implemented successfully. The biggest concern for me in regards to this proposals feasibility is in its ability to achieve a true play to earn  economy which gives a return on investment to its players on a sustainable and continuous basis. One project that comes to mind is crypto blades, the problem is everyone wants to earn,  not as many want to pay. In order for a game to truly be -play to earn, there needs to be capital inflows from a source other then the players.  A true play to earn game would be able to provide returns for all who play it and not the standard early investors getting money from people who joined up later.  I am not too sure about ways around this possibly: royalties?. sponsors/advertisements?, stake pools?, I could not find any mention of this or any tokenomics for their coin in their game white paper . I do think that this team is capable and qualified  at building a polished good-looking game with good mechanics and the fact that some NFTs have already been minted and the team has already invested time and thought into the project should count in their favor.  ", "q1r": 2, "q2": "I neither agree  nor disagree that the information provided is sufficient to audit the success of the proposal effectively. The team has released NFTs for their project already and have committed to a beta release of the game in November 2022 and full game launch in January to February 2023. The beta release is the first milestone that the public would be able to measure progress by besides from the discord server which is currently up and running. I feel that there need to be more tangible  and consist ant milestones to measure progress of the game development more regularly", "q2r": 3, "assessor": "z_assessor_1983", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5960, "q0": "The impact session of this proposal is quite confusing. There are many repetitive statements about the game characteristics and little explanation about how it would be in practice. It says it’s going to be a battle game, but then it mentioned breeding and NFT creating, but it doesn’t really explain any of these concepts so we cannot understand their mechanism. It also mentions that the SHDR token will be used for governance and DAO creation, but it doesn’t explain how. At the beginning, it mentions that they are not going to develop everything, but just the tools and the community would build everything. It says that it would be a free to play game, and players would have an income from just playing the game, but it doesn’t really explain anything about the tokenomics and how this would be achievable. As being a game and trying to bring people to Cardano, this proposal is aligned with the challenge, but understanding what are the real plan to execute it is not possible based on what’s available. I’d recommend re-writing the impact section, include more information about how the game is going to be like - and if it’s the case that this is not defined yet, mention it in the proposal - and try to be less repetitive with the statements about the game.", "q0r": 2, "q1": "The roadmap presented has some issues. Q1 is going to be in the past when funding is received, and it looks like funding would be necessary since they plan to mint 500k+ cardpacks (which could each one have more than 1 NFT) and also to pay for backend coding and game development. There are some milestones that are not related to the proposal and also not clear, for example ‘extra funding for Shadowrealms card game’. Some other milestones are confusing (’You'll be able to launch game live In January-February 2023. The digital online game will provide an income through NFT's. And SHDR for playing Shadowrealms’ in Q3/22) or too loose (’growth of the community and cardano blockchain’). The budget is explained, although it doesn’t seem right since it’s just $2k for web development, but it might be the case that the team has access to a low cost dev infrastructure. The background of the team is not clear, roles are just mentioned superficially and two people are mentioned at the end but without a way to verify them and if the information provided is true or not. There seems to be information out of place (Q2-22 The Game starts with finding the right element cards...) and there’s a repetition of information, budget is described twice, and even with different amounts: first they say that coding will cost $8k, and a few lines below, $5k. There is inconsistency in the information provided.", "q1r": 2, "q2": "The auditability section of this proposal is confusing in the same way as the other ones. It has inconsistent information since it provides two different success metrics for long term (12 months). The success metrics also doesn’t seem to be aligned with the roadmap presented in the feasibility section. For example, here it says that the gameplay will be under development after 12 months, but in the roadmap it says that there’s a beta release in November 22. So, this should be in the mid-term success metrics, not in long term. The proposing team also puts information about the game itself under the auditability sections, where is not the right place for it. In the success of the project, it’s said that the game will help ‘poor countries’ like Philippines and countries in Africa to better fight covid. Although, the timing might not match, since currently covid is becoming endemic instead of pandemics, and by the time the game is release in mainnet, according to their roadmap, most probably covid won’t be such a big problem as it is today. Anyhow, if the game is successful in its proposition, it could help anyways with other matters. In general, the auditability section should be re-written to make metrics more clear, also add some KPIs on how to measure the development of the project, and also to match what’s presented in the roadmap in the feasibility section.", "q2r": 2, "assessor": "z_assessor_31", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8447, "q0": "The proposer addresses the idea about playing Shadowrealms games and earn a rewards and NFT's,SHDR token. This project will attract many people around the world who intersted in playing games and people who want to earn a living in this difficult covid situation. The project helps community gain knowledge about Cardano blockchain. I would like to see more detailed explanation how the proposer team works on Cardano blockchain. Moreover, the proposer needs to give more information about the challenges to deliver this project successfully as I think they do not have a thorough study of risks. Also, there are some information which is repetitive and answers in not in the right questions in this project which makes me confused. I think the proposer should improve the presentation of the proposal. ", "q0r": 3, "q1": "I think the proposer gives a detailed one-year plan and timeline for each job. However, I think the proposer really has the problem with presenting this proposal which makes every information confusing. Concerning the team member, they has qualified background and experience in this field; but it is not clearly shows in this proposal. In addition, the proposer gives a quite clear budget required for executing this project. ", "q1r": 3, "q2": "It is not hard to check the development of this project by visiting its website.  Also, the project is broken down into 3 stages which we could based on the 6-month, 12-month and 24-month for checking its main jobs for each period. However, the proposer should gives criteria for easier track of the project. I think it's very intersting to play fun game while learning NFT's with a card game.  It seems that the project is still in the first stage which need more clear presentation of the project from the proposer. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8827, "q0": "This is a good-looking project that has the potential to become very popular.  Card gaming is popular, and successfully implementing some good, high-quality card games on Cardano could greatly improve popularity and adoption.", "q0r": 5, "q1": "It is easy to see the developer has put considerable time and effort into this already.  The card art is excellent, they have a $SHDR token already in circulation, and a growing community.  I would anticipate that given the lead developer's history at Blizzard and collaboration with a game studio listed in the proposal they should be able to successfully complete this project.", "q1r": 5, "q2": "Developer is utilizing a professional game development studio to construct this product.  The timeline provided is in accordance with their ability to complete this project.  From their prior works it looks very likely that they will be able to successfully complete this in the time specified.", "q2r": 5, "assessor": "z_assessor_708", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9725, "q0": "Your game is an NFT card game, through which you set up how you play and earn money through in-game purchases. You emphasize play-to-earn elements to attract players and want them to join because of the financial benefits and NFT rewards you offer. Based on the view that I am a longtime gamer and a gamer who has played through many game genres, I find that: Card games want to attract players who need the art design element of the cards. very beautiful and impressive, must make it the most unique, besides that the properties of the cards must be different and have a combination that complements each other when playing to create a dual power for the card.\nThis will be very attractive and gamers will be addicted to your cards. Unfortunately, the proposal did not mention entertainment and the need to promote it in its game. The proponent is too focused on enticing players to make money through play-to-earn, which easily leads to Fomo (Fear of missing out) and it will backfire with the intention of the project.\nI have tried searching and typing the word “earn”. It appears 58 times and the phrase “play to earn” appears 21 times in this proposal, which is not very good in my experience. Obviously, your Cardano game has not appeared yet, there is excessive Fomo that will affect the Cardano ecosystem and the games developing on it. Be moderate and reduce the frequency if you can emphasize where you need to show it.\nThe risks and challenges in the proposal are poorly described, if possible, please specify the difficulties you will face and how to solve them? If I can explain this question in more detail, I guarantee that your proposal is off to a good and safe start.", "q0r": 3, "q1": "The proposal offers a complete roadmap, the tasks are listed in detail from Q1/22 to Q4/22 with the first number I see being \"Minting of the first 550,000 cardpacks\" in Q1 which is a large number, if please specify how to achieve it? and how many artists does it take to get 550,000 cardpacks or use any technology solutions? large numbers that don't come with a solution that makes your voter skeptical of it.\nThe good thing about the Feasibility section of this proposal is that you've budgeted for each quarter and the breakdown of $65,000 through the month of Q4-22 is very clear. Definitely from my understanding that in Fund8 the project required the total capital needed to make their game.\nWhat I find not so good is, the part about the project development team is very few lines and very vague\n“OUR TEAM:\nRick(sixxstreeter), Game creator.\nCartic P… juegostudio.com Technical help Software engineer, game developer., Technical support & advisor.”\nI could not find any other information about this project team nor the experience needed to be able to complete the proposal. That makes it really difficult to verify their identity and ability to execute the game.", "q1r": 3, "q2": "In the AUDITABILITY section of this project, the proponent outlined short-term and long-term milestones, further describing the tagline “SHAPING REALITY & VALUE - BRINGING THE WORLD TOGETHER.”\nThe proposal also explains the milestones of 12 months, 6-12 months, 12-24 months with this description it is difficult to follow and there is some overlap between the tasks to be completed of the project. Making your ideas neater and logically organized, it will make the community more receptive. Do not hesitate to let us know what you want to show and your difficulty.\nAn important part that I have not seen a proposal for is how to track the progress of the project, how do you manage the project? and how to control progress measurement. I recommend that you list the project process management tools that will be applied to this proposal. In addition, you further explain that the game creates extra income during the covid period for poor countries such as the Philippines, Africa. This may be fine in your opinion but it will hurt some people. I sympathize with people in all poor and developing countries but I cannot agree with your way. They need money for sustainable economic development, not Fomo following the game play-to-earn as in this proposal with 58 words \"earn\". Please improve your suggestions.", "q2r": 2, "assessor": "z_assessor_755", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Developing a future for people all over the world with an play to earn affordable NFT game\nBuilding income through NFT's around the world", "experience": "+12 years as Developer/Entrepreneur.\n+10 years art and designer development for games(blizzard Ent.)\n+11 years game development metaverse( secondlife)\n+3 years as a Cardano Enthusiast/ Blockchain studies and research."}