{"id": 397914, "author": "markv", "title": "The Crypt Game", "url": "https://cardano.ideascale.com/a/dtd/397914-48088", "category": 26440, "amount": 50000, "description": "Using games to improve health & wellness have been overlooked by big gaming studios. Blockchain needs compelling games to increase adoption", "funded": 1, "upvotes": 25278155, "downvotes": 17832414, "votes_result": 7445741, "votes_cast": 89, "f6_no_assessments": 9, "f6_rating": 3.2962962962962967, "videos": [], "media": [], "f6_assessments": [{"id": 7313, "q0": "The idea is very interesting, it is a game in which you would have a kind of virtual pet that would actually be a reflection of the player himself. I think a part of the proposal that sums up the project well is the following: “we can collect user data only by completing daily tasks and challenges that are selected by healthcare professionals. The results of completing tasks are scored and added to the Crypt's health. The more the user engages with the game, the more he becomes aware of his state of health, as the Crypt is essentially a representation of himself from the tasks he has completed.” However, I think the general explanation of how the game would work is still pretty sketchy. What would these phases look like? What tasks, for example, would the player have to complete from one stage to the next? What kind of information would be attached? Would this information be recorded on the Cardano blockchain, so would it be visible to everyone? This worries me a little bit, because if it was information about the players' health, they might not feel comfortable making it public. Another point I would like to comment on is that it is not clear how Cardano's technologies would be used here. Proponents claim that the game was all thought to have been architected on web3, however, it is not explained directly how Cardano's blokchain would be used, if the characters would be CNFTs, if there would be payments in Ada and etc. Of course, they provide a whitepaper, but there are 17 pages, it is a little unfeasible for us to read all the content present there. I've read a few things, but it would be far more appropriate for the proponents to make it very clear which Cardano technologies would be used and how they would be built into the game's dynamics. Therefore, my opinion is that the idea is good and innovative, deserving our attention, in fact this is one of the few proposals in the field of games that have to do with the universe of health; however, more detail is needed both on how it would be built, how its gameplay would be, how the phases would be, what the objectives would be and especially how all this would relate to our blockchain. \n", "q0r": 3, "q1": "The script of this proposal is rather superficial. In three months, we know that prototyping will take place. However, how would this task be carried out? What exactly would happen in month 1, and 2, and 3? Which professionals would be involved here, doing what small tasks to make the prototyping process possible? What would your work routines be like? In the fifth month, the alpha test would take place. Who would test the game? How would feedback be received, and how would potential changes be implemented? Anyway, I think that the entire game development process is explained in a very superficial way, being necessary that the proponents explain in detail what would need to be done to compose each activity, and it would also be better if they determined monthly instead of a division of longer time. The budget is also explained very thinly, for example $10,000 is asked for Art Styling and Asset Creation. How much would go to Art Syling, and how much to asset creation? It's because? What would the working day of those involved in these tasks be like, for how many days a week would they be working on it, and for how many hours a day? Will the Cardano community have access to the drafts of these phases? How would the assets be created, who would need to do small tasks for this to happen, what justifies this price? 25 thousand dollars are requested for the development of game features, however, it would be necessary for the proponents to explain what this phase is exactly, which small tasks added together would result in this development, which features would be being developed, how long would it take on average for each if one were work and how much would be charged per resource... Anyway, the way the use of the financing is passed on, we cannot understand the need for such a high investment, it would be essential for the authors of the proposal to argue better why each part would cost each amount request. And finally, speaking of the team, it's about two people, I liked this part, I think the curriculum of each one was very well detailed and in which areas they work, but I would like linkedin or some kind of Marco's portfolio Valmora was provided. Through these pages, we can verify the information that was said. In summary, I think the only adequate part of the feasibility is the presentation of the duo, the script and budget being very superficial and in need of a lot of improvement. \n", "q1r": 2, "q2": "The proposed ways of auditing progress are quite satisfactory, these are “announcements on a discord server and emails to subscribers” and “regular reports within the catalyst on the progress of the process”. I think these reports should be provided to members of the Cardano community even if there is not the success that was expected, as it is only fair that, if the proposal is funded, we have constant updates on the tasks that were performed and the small goals that were achieved. , at least once a month. Regarding the final scenario, they say that success would be measured if the game prototype was running and being played. This worries me... would the 50 thousand dollars requested be just for building a prototype? So for the final version of the game, would more investment be needed? Talking now about the impact, directly, how can we see if the game was a means of popularizing our blockchain? Would proponents need to devise some way of proving whether Cardano has in fact benefited from this initiative, and if so, how, what changes are notable, how can we see them in practice? They need to do research and point out exactly the consequences of the game for our community, if new active members were added, if the number of transactions on our blockchain increased, if more Adas are being bought and delegated, if new CNFTs were created and traded. ... Anyway, unfortunately I think that about success, everything is still very abstract, it is necessary for the duo of authors to define exact ways in which we could perceive the real impacts of the project on Cardano's blockchain. Therefore, my opinion is that the auditability of the process is excellent, but the final results leave much to be desired, requiring a total reformulation of this specific part. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 3056, "q0": "The problem addressed here is that people need to be made aware of their health status. The people who play the game are assigned tasks and challenges by healthcare professionals. This game could ensure rapid adoption of blockchain in healthcare. People can make more targeted use of services because of their own data that they have collected. This idea will definitely add value because it's something that doesn't exist yet and anyone could use it. This product allows the development of a large database to improve people's health.", "q0r": 5, "q1": "This project clearly defines who the team consists of. The team consists of someone with experience in blockchain projects and someone with 20 years of experience in UK healthcare. There is a not so detailed budget overview. Some amounts seem very low to finish this project. They were able to include the working hours in their proposal so that a clearer picture of the costs was shown. No additional financing plan has been included. The timeframe to launch the project is very tight. Nothing should go wrong during the development of this game or else they won't meet the deadline. There is an extensive white paper that describes the full operation of the game.", "q1r": 3, "q2": "I think this project could be successful in the future. This project has a clear goal and can provide a link between blockchain technology in healthcare. The white paper contains a clear roadmap that describes what the makers want to achieve in the coming years. The white paper also contains a clear description of the long-term objective.", "q2r": 4, "assessor": "z_assessor_1606", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3567, "q0": "For starters, I want to point out that the idea of a game that focuses on players’ health status and self-care by requiring them to take care of their pets sounds interesting and at the same time necessary. And since the game utilizes the Cardano-based blockchain system, it aims to attract blockchain users from the healthcare industry, matching the challenge setting, while making healthcare and wellness products more affordable and available worldwide, which is a noble cause. \nHowever, I believe there are some key elements missing from this proposal.\n1) While the proposal does state the validity of given tasks and what they represent in the game, there seems to be a lack of details regarding core features of the game like gameplay or reward mechanism. For example, what exactly would those tasks be or what sorts of rewards will be granted to players when their pets achieve a certain level of growth?\n2) Even though a considerable joining of users to Cardano is listed as part of the ultimate goal, yet there is no evidence, in the form of KPIs or metrics, to back up this statement. I suggest adding some, for instance, an estimation of an initial user base or what kinds of CNFTs will be utilized in the game.\n3) I notice that the proposal does list a potential challenge to the project, and while that sounds pressing, the proposal has not yet been provided with a suitable solution to eliminate or at least mitigate the problem.", "q0r": 2, "q1": "Provided from the given road map, I would argue that this project is not teeming with useful information in terms of the development process. This section lacks heavily on the specific details of each stage, such as what processes take place at which stage or what components will be ready at which stage. In addition, the timeline seems to be quite vague, not specifying what year or quarters will the project expect to begin taking place. The same pattern repeats in the budget breakdown section, therefore, that makes it difficult for me to evaluate whether the demanded budget is approvable. Nevertheless, the proposal does consist of relevant information of the team members, which are background checks, expertise and affiliated links to verify each.", "q1r": 2, "q2": "In regard to this standard, I’d say this project does hold a certain rate of clarity, as its progress shall be disclosed via Discord, an interactive social media platform with an impressive number of users, and E-mails to all followers, who will also be asked to join the initial test launch. However, I am obligated to point out that in the envisioned success section of the proposal, there is no sight of the benefits that Cardano should expect to reap from, which is necessary for the approval of the funding. This, unfortunately, is a mistake one should not make.", "q2r": 2, "assessor": "z_assessor_1664", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3744, "q0": "The mechanics of the game are described concisely to understand.\nIn addition, it would be great if the author could attach more examples or video to describe the game more understandable.\nThe explanation of the project's connection to the Cardano ecosystem isn't so clear so I find it quite difficult to determine if the proposal truly aligns with the challenge.\nThe part of the risk is shown but there is no explanation about the treatment solution. The writer should add analysis to this issue, it can be measures in progress or plans for the future.", "q0r": 3, "q1": "The part I was quite impressed with was the team members.\nMembers have extensive experience in the blockchain and healthcare sectors. However, since this project is about gaming, if it is possible to describe more about the members of this field, readers can evaluate the feasibility of the project more easily.\nThe roadmap and budget are quite sketchy to assess the feasibility, the writer can add specific time items and a table of contents with more detail. The budget section should also add detailed follow the table of content with criteria such as personnel, assets, other.", "q1r": 4, "q2": "How to do the report and how the community can check and track is covered in the proposal. However, factors that quantify outcomes over time are not included in quantitative measurement. The side writer adds metrics, results, KPIs that measure success according to a detailed roadmap related to the development of the project so that readers can easily follow the progress of the project.", "q2r": 3, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4269, "q0": "The proposer has provided some information of the game called Crypt in the proposal. However, even though the team has mentioned about how their proposed solution will address the challenge, it would be better if they gave out particular amount or numbers so that when people read it, they will know if the solutions are aligned with the key metrics of the challenge or not. I’m also not sure whether or not the social impact which they talked about is eligible enough to address the challenge. About the possible risks, they have foreseen them. They have self-aware that their game might encounter hardship when entering the industry. Being awared is good, but I think they should have provided some ways or solutions to overcome the possible difficulties, that would be better.", "q0r": 2, "q1": "About their plan for the project, they have separated it into 4 phases as I can see, in each phase, they have displayed what is the main thing to do. However, personally I think if they could show what they would do next after releasing, people will see that the team has come up with an overall strategy which is more detailed, showing that the team has thought about the whole journey, not just only the short term goal. The budget also needed to be more clear. That they wrote 10K, 25K, 5K can make it difficult for people to understand what is the currency unit here. The proposer has given information of the team members who had real working experience.", "q1r": 3, "q2": "They have just given the general point of view of how they measure the project’s process. If it could include more certain numbers, it would be clearer for readers to follow their progress. This part was not written so well by the proposer, there were still unclear and missing information, such as what success for the project looks like particularly and if the proposal was a new one or it belonged to a funded project before or not.", "q2r": 2, "assessor": "z_assessor_1714", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4772, "q0": "Overall, I believe the proposal overall meets the challenge, and I in enjoy the challenge. This challenge helps Cardano's goal of boosting the number of gaming-based applications produced on Cardano and speeding the growth and expansion of the developer and app ecosystem. The proposal is well-written and planned, with such a clear aim and DOES that add value to the Carnado ecosystem that corresponds with the problem description. The proposer wishes to create a game that aggregates personal data in order to facilitate data collecting, user involvement, and adherence. They may acquire data from users simply by completing common activities and challenges designed by healthcare professionals using DIDs and Semantic database architecture. Games that make health tracking more enjoyable and straightforward. The measurements left something to be desired, despite the fact that they are in accordance with the challenge set, and several crucial metrics remain unfulfilled, although this is not a major issue. Furthermore, although it may be difficult, I would simply ask if I could see actual figures rather than words when referring to the number of ideas in the KPI and Metrics section. Besides, I suggest the proposer point out some solutions for the risks.", "q0r": 4, "q1": "They have a good sense of the team they need to build based on what they've previously done, and they have a decent concept of how long it will take to complete all of the phases outlined in the roadmap. However, Mark Valmoria's Linkedin profile is gone. The budget might have been better set out because some of the project expenditures are still unclear or appear to be more than necessary to me. As ideas, the team should provide some description of how the project will be done and the entire procedure that will be followed. This demonstrates to voters that you are taking this seriously. In terms of what will be done, for how long, and in what sequence, we have provided a breakdown into months and the primary activities that will be completed during those times, but because this is a very large and complicated project, it is critical that these phases be more comprehensive. For example, I consider how this project would be marketed; it is a really nice product with a lot of promise, but how would it come to the creators' attention? And how would the benefits of using it be presented? How will the prototyping process be carried out?", "q1r": 3, "q2": "The team does not define direct key performance indicators (KPIs) to track project achievement. What we have here is that subscribers will be informed of progress via announcements on a Discord server and emails. They will invite community testers to play the game and submit qualitative feedback. If the initiative is successful, there will be regular reporting on its development inside the catalyst. However, because we don't know what these occurrences are, there is no assurance that they will be tracked. For the most part, the primary measures are not quantitative, but the success criteria are appropriate. To improve the problem, clearly define how the success criteria address the difficulty and how metrics might track progress toward the success criterion. In general, I disagree that this plan is easily auditable based on the information supplied; I see no obvious means to evaluate the process or the results based on what was offered to us", "q2r": 2, "assessor": "z_assessor_1772", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5080, "q0": "I think this is a very unique idea. But it's really hard to do in practice. Because if people have diseases related to internal organs, blood-related diseases, virus-related diseases... what is the screening mechanism to detect disease? Playing games to know everyone's health status I think will give inaccurate results. This recommendation of yours should be narrower to the subject of adjustment, such as playing games to know how to check the status of eyes, brain activity related to voice control, limbs....", "q0r": 4, "q1": "I find that the detailed plan given is quite lacking, not yet detailed. The time given also does not have a detailed target attached, just given briefly. However, the team members required to complete the project are all very talented people with many years of experience in the healthcare field. It can also be what makes people feel more confident that the project is actually doable. However, a more detailed plan needs to be developed.", "q1r": 4, "q2": "In my opinion, I find your proposal not really convincing because the progress of measurement and development of the project given is incomplete. There should be specific numbers to prove. This will make it easier for everyone to track the progress of the development.", "q2r": 3, "assessor": "z_assessor_1844", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6075, "q0": "i love the way this proposal combines a Tamagotchi-like game with health and wellness transferring the psychological attachment of Tamagotchi players to execute healthy activities, brilliant. Where i foresee a problem is the data-collection of users and most especially people in the crypto world take data collection seriously and the proposal failed to talk about this key aspect that is affecting a company like Meta(Formerly Facebook) in various regions across the world.\nI will be rating this 5 star as my raised issues does not affect the impact of this proposal if implemented to success.\n", "q0r": 5, "q1": "The proposal provided a well detailed timeline and cost breakdown even though the cost breakdown can be expanded more to cost/hour or cost/day or cost/month to help better understand what the funding is going exactly for.Verified links to show the capability of the team was provided and i have no complaints at all.\nI am giving 5 star, please try and give a more detailed breakdown of the cost i the comment section.", "q1r": 5, "q2": "There will be reporting of progress on discord or subscribed mailing list. \nregular progress report will be provide to catalyst which is sufficient for auditing the progress of the proposal.The team will also want the community to help test the game.\nI am giving 5 star and i wish the team goodluck.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 8348, "q0": "Love the concept of connecting video games and health. Idea is simple, transfer your real life decisions to your avatar and by collecting data you can then use to ti improve your heath etc. These data is then used in marketplace or with some other services where they can see you personal progress. There is much more information about the proposal on the link for previous Fund. The breakdown of cost and timing could be a little bit more polished. ", "q0r": 4, "q1": "The team behind the project seems to be experienced, there is already a webpage available with some starting points and explanation of how the game will work like. They seem to be well motivated and also they participated in last Fund with also nice concept. The plan has a high ceiling, connecting video games with your personal health and overall well being. In my opinion there is little doubt that project will not continue in the right path.", "q1r": 4, "q2": "The progress will not be easy to measure form the get-go, it will take some time before community rises in numbers and according to usage of the marketplace you can see how many people are involved. But, in the beginning it can be monitored by progress on the webpage and the overall progress of game development before reaching prototype phase of the game. ", "q2r": 3, "assessor": "z_assessor_672", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Gamifying personal data aggregation for easy data collection, user participation & adherence. Games to make health tracking fun and simple", "experience": "Mark Over 20 years Experience in Healthcare. Atala Prism Pioneer, Plutus Pioneer Third Cohort https://www.linkedin.com/in/mark-valmoria-45a021228/\n\nEdmund IBM & Ford Motors, Project Management. Projects include gaming and NFT's. https://www.linkedin.com/in/edmundjeevan/"}