{"id": 398127, "author": "sebcp", "title": "Ye₳stBrothers- SC based game", "url": "https://cardano.ideascale.com/a/dtd/398127-48088", "category": 26440, "amount": 6500, "description": "Gaming on Cardano needs more growth and value, it lacks diversity and doesn't exploit the possibilities of smart contracts yet.", "funded": 1, "upvotes": 22448917, "downvotes": 18319352, "votes_result": 4129565, "votes_cast": 96, "f6_no_assessments": 7, "f6_rating": 2.047619047619048, "videos": [], "media": [], "f6_assessments": [{"id": 3788, "q0": "This proposal gave a general description of the project’s functions. But in my opinion, you should focus more on the benefits that Cardano enthusiasts, who are the target users, will gain from playing this crafting-game which is considered as a great idea to improve the traction in Cardano adopters and gamers. Likewise, you had better explain the extent of rareness of the Beer-NFT's by providing a specific number of this. For example, you can state “this NFT is of great value because we will only supply 10,000,000 in total”. Moreover, upon announcing that you are aiming to provide real utility with your NFT's (this key metric matches with that of the challenge), I advise you to specify this feature, as well as the amount of value that gamers can make in this play-to-earn app. I can’t deny the quality tooling of your application since your team is capable of creating a full 3D-environment for gamers to walk around and manually initiate every step of the brewing process, which is viewed as an enjoyable technology to help users engage on. Concerning the obstacles, you had better identify clearly what problems about coding and deployment of smart contracts you can encounter in the future of project conducting.rather than giving a general announcement like:“Risks more or less depend on our ability to keep up with the latest developments”. If you want to deliver this project successfully, find a practicable solution to them, such as investing more money into the servers to get rid of bugs, etc instead of claiming that you already have two software developers to be in charge of.", "q0r": 4, "q1": "The central point in this section is a detailed work plan with enough timeline for delivering the proposed solution. However, it can be seen obviously that you aren’t able to hand in an explicit milestones and timeframe to achieve them. For instance, you have to estimate as precisely as possible when the Plutus pioneer program will be launched, when smart contracts, technical features, ingredients and beer types will be developed, in which month or in which quarter of the year. These data are a prerequisite for the voters and community to follow the active progress of your project. Similarly, this proposal also provided no detailed cost breakdown. I understand your team has to pay a salary for members and operating fees to other deliverables, but the case is how much it is. If you can’t at least allot necessary fees to each activity, how could the voters mark your proposal as good, right? Another crucial point is the detail of team members. I’m sorry to say the following, but your proposal is one of the worst ones when taking this section into account. Your team has six workers in total, so you have to show the voters who they are (of course including their names), how many years they have dedicate to the relevant field, what they obtained during their career, and even better, you could show the links of their LinkedIn profiles so that the voters can capture enough information of your team and assess their potential.", "q1r": 2, "q2": "With regards to this auditability section, it is readily apparent that no certain measurement tools are provided in this proposal. Technically, how to keep track of the operability of the smart contracts and the 3D-environment? Please find a straightforward answer to this question clearly with a view to helping the community supervise the progression of your deliverables. In the same way, you state that your project goal is full operationality for players, which is also your way of defining success. Yet, you still don’t shed light on this content, for example, I can’t figure out what items this full operationality will contain and how useful they will be for players. For that reason, I strongly believe that this proposal would be better assessed if you can supplement extra information to improve its shortcomings that I suggested.", "q2r": 2, "assessor": "z_assessor_1675", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 3569, "q0": "My initial reaction to this project is excitement, since I’ve literally never stumbled on the idea of owning a 3D brewery inside a cryptocurrency blockchain. So this could both offer players a first time being a brewer and owning a business as well, and from the looks of it, the game tries to resemble every single step of the way. The proposal also includes a possible problem, which seems to be keeping up to date with technology nowadays, and fortunately there comes a viable resolution for that. However, even though the proposal delivers plenty of the functions and features of the game, there seems to be no mention of a main target audience. One could speculate that this aims towards the gaming community, still I’d like a confirmation on the proposer’s part. Another flaw to this proposal that I notice is the missing of core metrics used to approximately measure the initial success of the project.", "q0r": 3, "q1": "This section, in my opinion, is not carefully delivered. For now, it would seem like there is no plan or milestones just yet, only an estimation of a time period, there is neither an exact number for the requested budget nor its breakdown (though we do know what it’s for) and a very brief listings of current team members as there is information regarding background or expertise whatsoever. ", "q1r": 2, "q2": "This is another section that suffers from the lack of relevant information. For instance, even though the team claims that they have had milestones to keep track of the progress, they haven’t specified what exactly those are. Furthermore, there is no utilization of tools that enable the team and the community to monitor more conveniently, such as GitHub, ClickUp or Trello. And I must add that not only is there no mention of the benefits and profits that Cardano can expect to gain from this project whatsoever, apparently the team doesn’t have 100% faith in the potential of their own spiritual child.", "q2r": 2, "assessor": "z_assessor_1664", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3746, "q0": "The outstanding features of the game have been described by the author, but I think it would be better to have specific examples, I am also curious if there are conditions for those who are just starting to play like creaing wallet, buying NFT? or players can start with the ingredients available in the game and buy NFT to improve the quality of their beer only?\nThe way the proposed solution address the challenge is quite general, the way the proposal affect the challenge and specific criterias should be described in more detail.\nSpecific risks and measures have not been identified. The author should further analyze the possible risks related to keeping up with the latest developments concerning coding and deployment of smart contracts as referred.", "q0r": 3, "q1": "The feasibility of the project is quite lacking in information for the community to evaluate.\nThe proposal's plan is estimated to be implemented in 4 months after the Plutus pioneer program is finished, but there is no specific roadmap for these 4 months including which main tasks and deadlines for those tasks.\nThe budget will be paid to two smart contract developers of the project. However, I think it will be more detailed if the information on estimated completion time and unit price per hour is described.\nThe positions in the group and the number of people in each position have been described but need more detailed information about the members such as: name, work experience and attachments (LinkedIn, ...).", "q1r": 2, "q2": "The information about the auditability of the project is quite sketchy so that the community can track the progress of the project.\nThe author should describe in detail some set milestones with completion time and quantity completed in a quantifiable manner. Along with that, tracking tools and ways for the community to follow should also be put in.\nThe success of the project being described is quite short and general, it would be better if the author could add more clear indicators so that the reader can rely on that to judge whether the project has achieved its goals or not.", "q2r": 2, "assessor": "z_assessor_1674", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4499, "q0": "Although the idea of smart contracts CNFT games is good to long-term development of Cardano ecosystem and is defenitely a problem within this challenge, a game that has no players do not add real value to Cardano ecosystem.\nThe main idea of the project is great and a game based on this will outbrake in the near future, it just seems that it's not this project", "q0r": 2, "q1": "References of relevant skills and experience are not provided in this proposal, then capacity of the team to get the job done is not clear.\nthe budget is exposed in a shallow way, there are many others costs that have to be considered to develop a sustainable game as growing community, cost to acquire a new player, development of a sustainable economy and nft designers.\nA verifiable plan to additional funding needs is not provided, as if the only recquirment to the game success is developing smart contracts.\nA reasonable timetable and technical aspects of the challenge are not provided.\nThe main risks of developing a game, that is growing a engaged community, is not considered.", "q1r": 1, "q2": "Although author of the project mentions that are clear milestones, none of them is provided in the project.\nKPIs are not provided at all.\nThe project is not designed with the targeted problems well understood, and the solutions to overlap diversities are not even mentioned", "q2r": 1, "assessor": "z_assessor_1738", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5341, "q0": "With YeastBrothers the team wants to bring utility to NFTs and create a fun game for beer enthusiasts. The proposal does not really address how new gamers will be onboarded onto the blockchain but rather explains the game functionalities. Current challenges are that traditional gamers are unfamiliar with blockchain technology and often perceive NFT games as scam. In addition, the entry barrier for these games can be quite high as players need to invest in sometimes expensive NFTs. The proposal does not indicate how these problems would be addressed and seems to be rather geared for blockchain familiar gamers. \n\nOverall, the game proposed here is very niche-oriented (beer enthusiasts) and does not provide a particular solution of how new gamers could be attracted to the Cardano ecosystem. As this is in principle “just another NFT game” I don’t think this proposal addresses the challenge well.", "q0r": 2, "q1": "Unfortunately, no detailed roadmap and timeline was provided. As no concrete plan was outlined, it is difficult to assess whether this proposal can be implanted successfully. Although the author seems to have experience in this space (creator of a previous CNFT game), the proposal indicates that more developers will be required. The requested funds will be used to pay these developers, but a detailed budget breakdown is missing. Additionally, I strongly assume that the requested funds (6.5k USD) will be not enough to pay 5 employees for 4 months (estimated duration to finish the project). Altogether, I don’t think this proposal can be implemented successfully.", "q1r": 1, "q2": "In the proposal it is stated that clear milestones have been set, but unfortunately, they are not included. It would have been good to indicate those in the proposal and provide details. Without any milestones specified and no clear plan and work packages, it is almost impossible to audit the developmental progress of the project. A Github page is provided but no information is outlined whether code commits can be followed on there. No success metrics or KPIs are given, making it again impossible to assess the success of the proposal. I strongly advise the author to edit the proposal and include more details on roadmap/timeline, deliverables, milestones and KPIs.", "q2r": 1, "assessor": "z_assessor_1939", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5962, "q0": "This proposal aims at creating a virtual brewery and let the players craft their own beers in this virtual world, by using NFT ingredients. Their 3D virtual world will be as close as possible to a real brewery, and they players will be able to manually start all steps of the process. They mention they their tokens will have real utility, but it’s not clear if there’s something else besides crafting virtual beers. This is a game that, for me, would attract only the most enthusiasts beer fans, I don’t think it is so appealing to have a huge base of players, specially recurrent since after some time it would become a bit repetitive, even with different recipes. Therefore, I don’t see it as having a huge impact in the ecosystem. The risks that were mentioned here are related only to the development of the game itself, which they mention will be solved due to their 2 devs that are closely following all the updates related to smart contracts, but the main risk for me is actually attracting and keep players in their community.", "q0r": 2, "q1": "The proposing team doesn’t inform a roadmap or timeline. They only stated that the execution would take 4 months, and they depend on Plutus Pioneers Program which is currently under way. I don’t believe this is a good reasoning because the schedule of Plutus Pioneers is well known, and the timeline could be prepared anyways, but without specifying a start date, for example. Without this, it’s not possible to know how feasible the plan is. The budget is not broken down as well, they just say that it would be used to pay 2 devs, but don’t mention how long each of them would work, what’s the hourly cost they are considering, or basically any other information about the budget. In the team section, they provide the number of members but don’t provide any details about them, or links to check the background. Also, the team members include 5 people, but they are only paying for 2 devs, which doesn’t sum up.", "q1r": 1, "q2": "The proposers mention they have set clear milestones, but they don’t mention what they are. They don’t provide any information about how we could keep track of their progress as well, and what kind of reports they would provide to IOG or to the community. They even say that they won’t they in case they are not successful, which is also not good, they should have a risk management plan or something similar. They didn’t provide information about any previous funded proposals as well. I’d advise the team, in case of re-application, to read Catalyst documentation and guidelines, so they can include all the necessary information into the proposal and have better chances of being funded next Fund.", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8349, "q0": "As much as i love the concept of creating online beer and making NFTs out of that, it lacks a bit more in-depth explanation. Proposal itself seems interesting and could have OK potential, but at this stage it is not 100% clear how it will fulfill it's purpose. How will you collect ingredinets needed to create beer? Will you buy it? Just a structured and better brake-down is all that is needed to make better evaluation.", "q0r": 3, "q1": "At this point I would have to say that it lacks sufficient information to be able to evaluate if this proposal will succeed. There is concept of the beer creating game available, but how will it be further developed? At what timeline? What are milestones? Just to name few uncertainties from my side. In general, concept seems to be interesting and has potential, just needs to be better structured and planned. ", "q1r": 3, "q2": "Not fully clear at this point. There are somethings available, but as mentioned there are no clear timelines. This makes it difficult to audit the progress of the proposal. The budget requested is not fully explained for what it will be used. A detailed brake down would be appreciated and make this proposal much better. ", "q2r": 3, "assessor": "z_assessor_672", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "We aim to develop a smart contract based CNFT game, that revolves around crafting individual CNFT's.", "experience": "We have already created a CNFT-game one year ago, now we aim to take it a step further by including the technology of smart contracts. Our team consists of software developers and designers."}