{"id": 399291, "author": "ditcameroon", "title": "d-BET: Decentralized betting Dapp", "url": "https://cardano.ideascale.com/a/dtd/399291-48088", "category": 26440, "amount": 21000, "description": "Betting businesses in Cameroon trade on promises of getting rich quick, using unlimited tricks to extract the maximum value from customers.", "funded": 1, "upvotes": 47732758, "downvotes": 12483585, "votes_result": 35249173, "votes_cast": 161, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 3822, "q0": "The proposer intends to create a blockchain betting system that exclude the central authority. Betting is one of the oldest game of mankind. The game is simple yet very addictive. On top of that is the potential to scale globally. I agree that if this project succeeds, Cadarno will gain huge exposure. One side note is that betting is still illegal in many parts of the world which deffinitely raises ethical problem, but that's more on the business side rather than technology.\nIn my opinion, the risk of this project could also be the removal of central authority right at the start. This is backed by the fact that the team does not have background in running betting services. Perhaps the team could try running traditionally before stransitioning to the model being run exclusively by users", "q0r": 4, "q1": "This project has a very good starting point being supported by previously funded project. The proposal has a 3-phase plan with action points and deliverables described in detail. The team's profiles are verifiable with team members having background in programming and math. The lack of experience in betting games is also considered by the team which is reflected in budget breakdown. There is a proportion of budget will be spent on working with Game Theory Expert. My only suggestion would be about Marketing & Advertising. Instead of just aiming for local community, the proposer should use social media to attract international user as well.", "q1r": 4, "q2": "Regarding Auditability, the main tool the team will use to communicate with the community is GitHub by weekly commits. I find this method is clear enough for the development phases. When the project moves to implementation, metrics like number of unique users and number of transactions can evaluate both popularity and business performance. These metrics meet the challenge settings and I would say this project is 100% auditable", "q2r": 5, "assessor": "z_assessor_1685", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6084, "q0": "A decentralised betting app will really bring lots of users to cardano if implemented correctly.\nI initially felt this proposal should not be in this challenge but utilising game theory techniques in its implementation will make it debatable so i will assess the proposal based on its merits.\nI am also glad to see that the proposal is aware of their dependence on multiple oracles.One point that wasn't mentioned is if the oracles that will be used to get realtime soccer match data  already exist and integrated with cardano as this can easily be a blocking problem to the proposal is no functional soccer oracle exists.\nConsidering the above i will still give a 5 star as the issue raised doesn't really affect the impact of this proposal if executed correctly.\n", "q0r": 5, "q1": "verifiable links were provided to assure of the capability of the proposal team to execute the proposal to completion and the cost breakdown is well detailed down to cost/hour .Honestly nothing to add in this section as the required information are all provided well.\nI will be giving 5 star.", "q1r": 5, "q2": "Milestones are in 3 phases and can easily be tracked as they are all dependent on each prior execution.\nThe proposal is clear on its objectives and a timeline of 12 months split into 2,3,7 months months of execution respectively.\nI am giving 5 star as the proposal provides every necessary information to audit the progress.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8100, "q0": "The proposal \"d-Bet: Decentralized betting Dapp\" addresses the Gamer on-chained challenge well by proposing the decentralized betting platform. It aims to be the platform that is fair for the players with no middleman and more trustworthy payout to players. They plan to use smart contract for the payout distribution and oracle for feeding outcomes to the smart contract. The proposal should have elaborated more on the risk section about their digital coin relationship to their other funded proposals as it's unclear how they could leverage these digital coins. The proposal can disrupt the betting industry with the solution (focus on soccer bettings first) and could have wide adoption in Africa.", "q0r": 4, "q1": "The team is part of WADA initiative to connect people across Africa to the IT, human and financial resources. The project time period is spanning across 7 months. The detailed budget breakdown looks plausible. They also provided the reference/ links of proposer team. The proposal should have mentioned how they will compensate their interns whether it is on voluntary basis or they will be renumerated for tasks assigned for them. The team has some association with catalyst community and the project is set to be completed succesfully. ", "q1r": 4, "q2": "The project has provided the community with a few ways to monitor this project via GitHub and White Paper. They should  have indicated how the community could view the number of 900 users for the first 3 months or the number of transactions (first 3 months post launch). Would it be shown in their dapp or else? The project has many metrics that can be audited conveniently enough for the community. The proposal has clear description of problem, solution and how the proposal applies the solution to resolve the pain points. Roadmap is very well explained. There are deliverables that faciliates the proposal auditing.    ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Create a decentralized / distributed betting platform that eliminates the middle man and create a more trustworthy user betting experience.", "experience": "Wada Cameroon Hub:\n\n3 senior software architects and developers with 12+ years of experienceNine interns and software developers actively learning Haskell, Plutus and software architectureWada network of resources"}