{"id": 399768, "author": "aidan", "title": "PlayerMint Play-to-Earn Marketplace", "url": "https://cardano.ideascale.com/a/dtd/399768-48088", "category": 26440, "amount": 50000, "description": "Gamers are crypto interested but don’t have a platform that integrates blockchain into the games they are already playing.", "funded": 2, "upvotes": 87077867, "downvotes": 5771989, "votes_result": 81305878, "votes_cast": 419, "f6_no_assessments": 21, "f6_rating": 4.682539682539682, "videos": [], "media": [], "f6_assessments": [{"id": 907, "q0": "The proposal seems well aligned with the objectives of the challenge. Blockchain-based play-to-earn games have enjoyed great success in recent years, but still have many limitations: high barriers to entry, difficulty in managing portfolio transitions, excessive expectations of retail investors and in many cases excessive superficiality that prevents long-term involvement.\nPlayermint solves these problems by creating a play-to-earn blockchain level that integrates with existing video games and rewards players based on their gaming performance (API calculated thanks to Overwolf).\nPlayermint is free (removal of entry barriers) and requires no payment from the user other than a redemption fee (removal of difficulty in managing transitions).\nBy aiming to integrate Fortnite, one of the most played games in the world, as the first game, Playermint could be able to chain a huge pool of players to the Cardan ecosystem.\nSince Playermint integrates a game that has already shown appreciation from the public it will be easier to gain long-term engagement. Initially the cNFTs traded on the marketplace will be user-generated content (UGC), with the launch of Cardano layer 2, Hydra, Playermint will introduce the SDK, which will allow game studios to use the ecosystem to mint and sell game assets maintaining the royalties (std.royality CIP-27).\nThe only suggestion I would like to say concerns the redemption of PMXs. I suggest the team consider that many players will be completely strangers to the cryptocurrency world, as a result they may not know how to buy ADA to redeem PMXs. On Fortnite, players can buy VBUCK using their credit card, a fairly simple operation when compared to opening an account on a centralized exchange, approving their identity, buying ada, then transferring them to a defi wallet. I think that offering the ability to purchase ADA and / or PMX directly from the marketplace via a payment gateway can facilitate access for many players, although it will be necessary to wait for the launch of hydra to have sufficient scalability.", "q0r": 5, "q1": "The playermint team has already successfully participated in two rounds of project catalysts, fund 4 and fund8 and has years of experience in gaming and blockchain, the fronted, backend and server side of Playermint will be realized with the collaboration of MLabs, a team of professional developers.\nA total of $ 44,000 is required for the development, upgrade and maintenance of the frontend, backend and server side of Playermint, but the number of hours and developers required is not specified. The budget requested is however in line with the work to be carried out and with the funds requested for the same purpose by other projects previously. A total of $ 6,000 is required for marketing carried out mainly through the eSports organization Xen Fortnite, which has players with good results and excellent visibility especially in North America. I suggest the team to keep in mind that Fortnite has a very large audience in Europe, you could consider turning to some Fortnite eSports in Europe as well.\nThe delivery time for the first deliverable is set by the end of March and the last by the end of June. From the latest communications from the team it appears that the Frontend is ready and the backend almost complete, the first off-chain API tests have also started, however it is necessary to complete the CTL (cardano transiction library) before starting the on-chain tests and this should impigare about a week, thus falling within the deadlines.\nAmong the possible problems it could face, Playermint considered the possibility that a game studio with which it integrates does not appreciate the service and refuses to integrate with the game, which is why it has decided to work with a compatible crypto studio such as Epic Games, which has effectively given Overwolf permission to license the API to third parties as playermint.\nThe team presents a detailed and actionable implementation plan, through a gradual process of off-chain and on-chain testing and optimization prior to the founding launch, which will serve to refine the back-end and customer support prior to the main launch. Thanks to a targeted and gradual process, the team should be able to solve another common problem of play-to-earn games, (namely the development of sustainable tokenomics. The distribution model is well defined.\nfor the reasons listed above I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.)", "q1r": 4, "q2": "Playermint presents a roadmap with defined miletones, which are sufficient to check the progress of the proposal once reached.\nThe KPIs chosen carefully measure the key metrics of the challenge and the value brought to the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_1232", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 551, "q0": "This proposal addresses the challenge, PlayerMint NFTs marketplace could be an efficient way to bring gamers to interact with Cardano in order to earn from the games they already play for leisure. PlayerMint has been building on Cardano for more than a year, currently it has a small community of gamers and crypto enthusiast, sometimes it organizes tournaments with small prizes and has all the credentials to become a quality project. It will be an easy-to-use platform, perfect for novice non-crypto users who might start getting familiar with the Cardano ecosystem from here, as they will only need a wallet and game account, plus a few ADAs to withdraw the rewards (probably the main obstacle for novices), earned in the form of a Cardano native token, which will be the Play To Earn marketplace currency and which will have some other utilities. The funds requested are in line with the current level of development of PlayerMint and the competence of the team, they would be partly used immediately and partly used in the future, to correct any initial problem and to implement new feautures, an indication of the future-oriented gaze of this project.", "q0r": 5, "q1": "It is very likely that this proposal will be implemented successfully, PlayerMint has already received funding in fund 4 and fund 6 and was among the top 5 nominees for the \"CNFT Awards 2022\", and it is continuing to build to become a quality product, it's now close to the \"final\" step that would activate the possibility for gamers to earn PMX. The timing indicated for the achievement of the objectives are realistic, as also confirmed by MLabs, and currently respected, one week from the end of Q1 they are starting the playtesting phase of tracking the players, given the reasons indicated it would be understandable if there will be a short delay respecting what was planned. The worst case scenario is the adoption of a limited number of games and / or players.", "q1r": 5, "q2": "The points indicated are sufficient to audit the progress and development of the proposal, especially the number of users of the platform who did not previously have a Cardano wallet is very important, to estimate the number of new Cardano users, as well as clicks on the \"how to create a new wallet guide ”, you could compare this number with the wallet number that had a null balance and no transactions until just before registering on PlayerMint.", "q2r": 5, "assessor": "z_assessor_1187", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5796, "q0": "This proposal from PlayerMint clearly addresses the challenge by targeting a massively popular game as their first integration. Even a small percentage of players coming on board from Fortnight will bring a lot of new users to Cardano. NFTs are very popular, and once it's clear to players that Cardano offers best-of-class NFT market places and low transaction fees, it will be wildly popular with gamers. This proposal is a text book example of what this challenge is aiming to achieve with mass adoption of Cardano through gaming, and a Fortnight integration will certainly deliver on that.", "q0r": 5, "q1": "While this proposal is likely to be implemented successfully, I have given it a 4 because there is one huge requirement for this proposal to be a success - namely integration with Fortnight APIs. While it is mentioned that Epic is blockchain-friendly, and Overwolf has the right to offer up integration APIs, it is unclear if a signed deal has been made with either entity. For the proposal to launch in Q1 of 2022, this seems like a large risk in being able to meet the stated goals and timeline. This would have been a 5 with some evidence that such an agreement has been made, as the team is clearly capable of delivering and has a long track record in previous funding rounds.", "q1r": 4, "q2": "The team has provided a detailed list of milestones with dates, and it will be quite auditable whether they are able to hit their milestones on Playtesting, Testnet, and the various levels of Mainnet launch. The KPIs provided are well thought out and will indicate how successful the team is in impact and delivery. While not something to reduce the audibility score, I might note that it would have been nice to see some input metrics in the KPIs as they are all lagging indicators and do not tell the story of what actions the team will take to drive the right results.", "q2r": 5, "assessor": "z_assessor_285", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10012, "q0": "Player Mint is proposing to integrate exisiting global success games into the cardano ecosystem. By tracking the players progress and earning NFT's. \nThe impact of this project would be siginificant as this can be multiplies over various successfull games that have millions of daily gamers. \nTheir target to attract 0.5% as a start is feasible and will still render a large impact. The proposal is a creative idea and well defined around the Gamers on Chain Fund. ", "q0r": 5, "q1": "The team is highly knowledgeable and showcases a deep thorough look at the ongoing statistics of gaming. In addition they have proven that their deliverables are very acheivable based on the target of 0.5% of the gamers audience. \nIn addition they approach of ranking and offering NFT with very minimal transaction or minting fees is a benefit in the ADA space. \nTarget a highly active game such as fortnite will ensure the success of the project. \nLooking at the budget and timeline they have shown a detailed roadmap and step by step milestones and challenges to overcome. In addition they have partnered with important gaming ecosystem Epic and wolf. \nFinally the team member roster is impressive and show a great deal of effort and expertise in this proposal. ", "q1r": 5, "q2": "The overall success of the project is well defined especially the target audience and the number of pull thru from the gamers onto the cardano NFT market place. \nHowever the secondary targets are listed in detail but do not have specific target for these KPI. \nFinally the timeline seems a little short, maybe because the team is very large 12+ ", "q2r": 4, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9616, "q0": "The problem that this proposal raises is clear and directly related to the needs of the challenge, likewise its solution which provides for the establishment of a \"play-to-earn\" protocol, supporting the adoption of the Cardano blockchain in the world of game. The impact of this project is conscious and well explained, as well as its added value for the ecosystem of the game as well as cardano and the community in general. Its KPIs are very consistent with those of the challenge. This solution seems to be well suited to meet future challenges. ", "q0r": 5, "q1": "The members of the team are clearly identifiable, and are the subject of a detailed description, demonstrating their experiences and skills, which are moreover very coherent with the needs that this project seems to require and prove. The video in the appendix is ​​a pkus which makes it possible to define the project more concretely and to visualize it. The fact that the team clarifies its previous proposals founded is an additional indicator of confidence. The budget is clear, well explained, it seems very coherent, as well as the plan and its timeline. The technical details are approached in a really understandable way, which also demonstrates the knowledge of the subject of this team. The risks are addressed with different valid solutions that seem well thought out. \n", "q1r": 5, "q2": "The roadmap is clear with a milestones and a time horizon for achievement. KPIs make sense and make it possible to refer to precise quantitative indices, such as Total number of users, Total volume of NFT sales, Amount of PMX paid out in royalties. They clearly give a date: “the completion of every deliverable listed in the feasibility timeline by the July 2022 due date”: It will also be possible to follow the progress thanks to their website and youtube, even twitter (if I'm not mistaken, the links are given, it would have been good to specify it again perhaps). But the whole of this proposal has overall all the information necessary for the audit to attest to its success.  \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8700, "q0": "Having read this proposal , the proposer wants to launch a platform called play-to-earn protocol that rewards performance in existing games like Fortnite as you play and have fun. \nThe impact is that the chosen game called PlayerMint will integrate with Fortnite (a game with over 350m registered players. PlayerMint is free-to-play and does not require the user to pay anything in order to earn PMX. The impact or benefits are are the onboarding of gamers as they play, users connect their wallets to playmint, profile, etc. \nPlayMint's  main focus is to provide a blockchain that brings crypto to the gamer, making the experiences they are already enjoying more rewarding. \nAddressing the challenge, the gamers on-chained challenge focuses on creating applications to support the adoption of the Cardano blockchain by the 2.5billion games of the world. \nThe main risk mentioned is game studio rejection, but the proposer provided a solution to integrate PlayerMint with games on crypto friendly platforms. This detailed submission warrants 5 star rating in my opinion.", "q0r": 5, "q1": "The timeline is clear showing deliverables for 2022 which are playtesting, testnet, founder launch, main launch, upgrades and maintenance. The first deliverable will be completed by the end of March and last deliverable completed by the end of July 2022. However, due to the developer situation, it is difficult to state exact deployment dates. \nThere is a detailed budget breakdown showing costs of main launch, upgrades, maintenance, etc. \nThe names of the team members are mentioned in the proposal - Grant Scholl, Aidan Rankin-Williams, Josh Small, and others- all with various relevant skills and experiences in NFT development, gaming content creators, etc. All these relevant information will make implementation successful. So my rating is 5.", "q1r": 5, "q2": "Tracking of the progress of work is very detailed in the proposal and I will mention some of them for clarity. Progress will be measured in terms of the total number of users, monthly active users, number of gamers on-chained, total volume of NFT sales, amount of PMX paid in royalties, etc. \nSuccess of this proposal will be determined  when the PlayMint play-to-earn marketplace is completed by the end of July 2022; completed with an effective market plan to encourage a members around PlayerMint and would have on-chained gamers to Cardano. \nThis proposal is a continuation of PlayerMint Fund4 and Fund6 . SDG rating chosen is descent work and economic growth which fits the challenge. My raing is 5 for this laudable project and how well it is written. Good luck to the proposers. ", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8406, "q0": "I think Playermints proposal effectively addresses the challenge of bringing conventional gamers along with their existing assets (eg. Fortnite) into the promising blockchain play to earn ecosystem. Cardano being one of the most economical, efficient and established blockchains would make a perfect home for their continued dvelopement.", "q0r": 4, "q1": "Given the teams experience as noted above. I believe they will be successful with implementing their outlined plan if funded. If I am not mistaking the Player mint team has been working hard towards delivering the outlined goals prior to this proposal. My sons play Fortnite and many other games I believe their entire generation can benefit from Playermint and entities like it.", "q1r": 4, "q2": "Based on the information presented. Auditing this entity should be achievable if funded in Catalyst Fund 8. I trust that the Catalyst community will also have the means of following up with all funded initiatives well into the future so as to ensure proper use of Catalyst funding.", "q2r": 4, "assessor": "z_assessor_676", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8357, "q0": "This challenge is definitely one of most interesting and well explained ones. The concept of earning tokens while playing games that are not originally related to cryptocurrencies is great and has HUGE potential. With what seems to be simple application you can connect your playing time and in-game success with earning tokens that can be used on the related market. Of course success of this depends on game developers and if they want to participate in using this application, but with such a huge number of games and players world wide, with even small percentage it would make this project huge success. ", "q0r": 5, "q1": "As mentioned only problem with success of the project would be if big game companies would not allow the connection of the application with their game. But crypto market is constantly on the rise and it is definitely something that game companies would like to be involved and the market is huge. Besides that, the plan is perfectly explained, there is a lot of material to examine and the team behind the project looks to be experienced and well involved. ", "q1r": 4, "q2": "Absolutely yes. Everything is well explained, KPIs are easy to understand, time tables are well explained also. If this project lives up to its potential it could be one of better investments. Overall one of better challenges.", "q2r": 5, "assessor": "z_assessor_672", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8157, "q0": "Arguably the best project I know of in Cardano's gaming ecosystem specifically for gamers! And of course it's perfectly suited to the challenge. A play protocol for earning performance bonuses in existing games like Fortnite. Tokens earned can be used on the NFT marketplace. The solution to this proposal is that PlayerMint is a play-for-money blockchain layer that integrates with existing video games and will integrate with Fortnite, a game with over 350 million registered players. This will give them all a way to earn Cardano's native assets by connecting their wallets to playermint.com and then authenticating their Epic Games accounts. Even so, PlayerMint is a free game, so it will attract more gamers to this game. Related information can be easily consulted via https://playermint.com/\nThis proposal has the biggest risk that the game studio with the integration project doesn't like the PlayerMint service and decides to refuse the integration with their game. And the proponent has created 2 quality options to solve this problem. The very introduction of many options to deal with risks shows that the proponents are very capable as well as their determination to this project.", "q0r": 5, "q1": "The entire proposal was well thought out and presented. It showcases the long history of PlayerMint as well as its achievements. It is proposed to provide a development roadmap but as pointed out, due to the current situation in Ukraine, some deliveries will be delayed longer than expected. However, the proposal provides several milestones with specific goals. The $50,000 request budget is allocated straight to the point. The project team is quality. The proposal has provided complete information of all 6 members including the experience, name and role of each member in the project, in addition, their information can be easily checked through the Linkedin link make suggestions. provide export. With such an experienced team, although the plan is still a bit clear on time, I think they will complete this project well.", "q1r": 4, "q2": "There are several goals with well-defined KPIs such as number of users, amount of value through game performance, number of players associated with Cardano, number of mentions on social networking sites... .. in general, the figures here are good enough and detailed. Clear, detailed plan and proposed milestones seem very easy to implement (based on team capacity) to achieve the set goals. Based on the above factors and since PlayerMint has been successful in Fund4 and Fund6, I think there is no doubt that this proposal is funded.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8009, "q0": "The fact that players are interested in crypto but don't have a blockchain background is a problem that needs to be solved and it is related to this challenge. The challenge is built and easy to understand, players must learn how to use and play the game, then the ecosystem can develop. About the solution in the introduction the author says that PlayerMint's main focus is on providing a blockchain that brings cryptocurrency to players, making the experience they are enjoying more rewarding. The idea is suitable for the challenge of creating a healthy playground for the community to help the Cardano ecosystem grow. I agree that this proposal networked the effectiveness of the challenge.", "q0r": 5, "q1": "PlayerMint has been successful in Fund4 and Fund6 projects established since 2018 until now. The team also clarified the process of founding, upgrading, and maintaining... so that newcomers can imagine how difficult the group is. Overall, I think the group has created a big playground for the community. The budget to apply for funding to continue to upgrade this game is $ 50,000, detailed by the author, which I think is suitable for the needs of the work. The group consists of 6 members, the author lists in detail what their names are and what jobs they are currently doing, their years of experience are also clearly shown in the group's profile, which makes us understand more about the group's current work. Because of that, it increases the group's ability to trust the community. I think the team can make this project even more successful if funded in this fund 8.", "q1r": 5, "q2": "It is great with the metrics that the author has listed, the information provided is enough to audit the progress and success of the proposal. The author has listed the transparency of the project through the article. They also provide us with key metrics and KPIs that determine the success of the proposal. Projects funded in fund 4 are awarded 4.24 points and projects funded in fund 6 are equivalent to 4.6 points. With experience in fund 4 and fund 6, I firmly believe that if fund 8 proposes more capital, the project will be more successful.", "q2r": 5, "assessor": "z_assessor_649", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6251, "q0": "This would bring more gamers to Cardano, by bringing their games to it. Dev teams are reverse engineering existing games like Star Citizen, to produce projects/products like Star Atlas that is essentially a NFT/blockchain version of Star Citizen. Eventually game studios are just going to have to offer blockchain elements already built in. This project seems to take that direction.", "q0r": 5, "q1": "It is a big project, and that is why I deduced a star. However, their team bios seem to indeed offer the experience needed: it just seems a huge undertaking. Hopefully funding streams offer themselves in the form of game studios contacting them to help with blockchain integration. Cardano/Ada is one of the easiest coins to transfer for gaming due to its low transaction fees. Seems like a good combo to me.", "q1r": 4, "q2": "Website and materials are well developed, as well as having some history to offer. That is one of the many encouraging factors about this project is its history. They have links to their bios, and their website, and they seem to have a good diverse set of skills in their collective team members.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5456, "q0": "I agree that this proposal effectively addresses the challenge of onboarding new gamers into the Cardano ecosystem. The proposal is targeting games which already have tens of millions of active users, such as Fortnite, significantly reducing resistance to the onboarding process. This is a first for the Cardano ecosystem.\n\nThe solution is clearly communicated and elaborates on why they believe this solution is required to onboard a broader section of the gaming community. For instance, leveraging existing platforms such as Epic Games and Overwolf give people who aren't familiar with cryptocurrency and NFTs the ability to more seamlessly transition to the Cardano ecosystem by earning PMX, the native currency of their marketplace.", "q0r": 5, "q1": "The website link provided in the proposal has a detailed description of the team behind the proposal.\n\nTeam has a good amount of individual experience, and is working with MLabs to complete coding on the backend.\n\nFrom the plan perspective, the distribution of funds is clearly explained, though not in terms of the specifics of the deals with Xen Gaming, which is the only area in which I would like to see more transparency. However, all milestones are clearly communicated and all costs seem justified and are easily auditable.\n\nIn terms of mitigating potential risk, the team has communicated the main potential challenge facing their proposal and have outlined a reasonable strategy to deal with this issue should it arise.\n\nAn overall well written proposal with clearly stated goals and a transparent team, hence I feel strongly the proposal will be accepted.", "q1r": 5, "q2": "The plan effectively communicates the current challenges facing onboarding new users to the ecosystem and how their proposal is going to address them. \n\nTimelines given for completion are clearly communicated and seem reasonable given the progress already shown towards completion of their NFT marketplace.  Community has also been given expected timeframes for Beta testing and tentative launch date.\n\nAs the team profile is public all prerequisites for auditability of this project have, in my opinion, been met. Moreover, all milestones are clearly stated and easily measurable. Therefore, I am confident that the information provided in this proposal is sufficient to audit the progress and success of this project.", "q2r": 5, "assessor": "z_assessor_1995", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5345, "q0": "The team has identified a major problem which they are describing clearly. The gaming industry is expanding year by year (with revenues in the billions). However, adoption of blockchain technologies by the gaming industry and the gamers has so far not seen a lot of success, albeit many gamers are interested in blockchain applications. \n\nThe proposal aims to solve this by developing a user-friendly application that enables gamers (of in principle any game) to be rewarded with a Cardano native asset, the PMX token. The team describes how new gamers will be onboarded. This process seems comparatively easy, consequently achieving a low entry barrier into the PlayerMint ecosystem. \nAfter having connected to the respective gaming platform, the user starts earning PMX tokens every epoch. Using their PMX rewards, the players can buy CNFTs on the marketplace and contribute to a thriving ecosystem.\nGiven the low entry barrier, many gamers could potentially be attracted to Cardano, earn rewards, and stay for the CNFTs. Importantly, the proposal puts a particular focus on ‘support’ features of the platform which is crucial for onboarding of new gamers and blockchain beginners. These ‘support’ functions will be decisive to facilitate access to the PlayerMint platform.\nThe team also outlines a major challenge (game studio rejection) and addresses solutions for it. Based on the suggestions, it is clear to me that the team has thought about creative solutions to overcome these.\n\nOverall, this proposal clearly addresses the challenge and highlights how new gamers can be attracted to the Cardano ecosystem, by providing an easy-to-use platform (with good ‘support’ functions), where gamers can be rewarded and spend their rewards on CNFTs.\n", "q0r": 5, "q1": "Although the team is providing detailed descriptions of the individual deliverables, a clear and easy-to-grasp timeline (for the individual sections) is missing. Such an overview would have massively helped understanding the overall time frame and hours required for technical developments. The way the sections are structured and described can be followed easily and enough information is provided to understand the major goals. \n\nThe budget requested for software developments is reasonable, however speaking from experience I am certain that the marketing budget will exceed the requested 3k USD. \n\nThe team has a combined experience of several years in gaming and blockchain, indicating the necessary skills to implement the idea. Other team members with backgrounds in marketing will be important to promote the project and brings users to the platform early on. The close collaboration with MLabs (a known blockchain consultancy in the Cardano community) will most likely ensure the progress of the project due to their immense knowledge and capabilities. Thus, it is very likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "Overall, the KPIs the proposal is suggesting are reasonable, however technical updates or reports should be included so that software developments can be audited as well (e.g. weekly reports or Github commits). I like that the team has put a particular focus on the “unique” wallets and users as many users could in principle have several wallets connected. Since the proposal does not include benchmark numbers, it is not entirely possible to actually measure the progress. \n\nThe team states that success will highly depend on an effective marketing plan, but unfortunately no detailed information is provided on how this should be achieved or assessed. \n\nAltogether, this part of the proposal describes reasonable metrics on how success and progress will be measured but lacks important numbers based on which the success and progress can be accounted for.", "q2r": 3, "assessor": "z_assessor_1939", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4905, "q0": "Upon reading PlayerMint's proposal, I thought there was a very clear and precise way to engage gamers and bring them in to the crypto space. Offering play-to-earn rewards is the quickest and easiest way to attract a gamers attention. Not just play to earn, but the better you do, the more PMX you earn. As a ex-pro gamer I can't think of a more 'hit the nail on the head' solution to engaging with the gaming community.\n\nHowever, there are some issues with how effectively I think the proposal addresses the challenge. The 'claim' type way of paying out PMX means that, to the best of my understanding, any gamer who participates in PlayerMint would already need to own ADA. This seems to somewhat defeat the purpose of the statement set in the challenge \"These gamers are looking for their route into crypto in a fun and rewarding way\". If they already own ADA then PlayerMint doesn't seem to be the 'route' that gamers need but more of a entertaining way of earning crypto. Users of PlayerMint who already on ADA will already be members, to some extent, of the Cardano community. In the proposal video the phrase 'they [gamers] don't need to put any money down'. This doesn't seem to be quite true if ADA needs to be owned by the participant to claim their PMX and in all honesty could turn away gamers from joining the PlayerMint Marketplace.\n\nThere are other parts to the proposal that address the challenge well. Entrepreneurship within the gaming community could definitely engage with the royalties system that PlayerMint employs, from designing esports team based or content creator/streamer based CNFTs.", "q0r": 4, "q1": "The experience of the team when it comes to blockchain seems really solid. This isn't my area of expertise but the combined knowledge gained through years of experience has the team in good stead. \nOn the other hand the experience of the team in the gaming space seems quite small.\nThe size of the team is suitable for the size of the task at hand, especially considering that, based upon the allocation of the budget, a large amount of that work will be completed by a third party.\nThe budget has a major flaw, it seems to be a typo but leaves a large question mark on one of the most important parts of the proposal. The budget is split in to two parts, but the parts have been copy and pasted twice.\nMain Launch and Updates and Maintanance have exactly the same breakdown of costs. Without seeing how £25k of the budget is going to be spent I can't, in all reasonableness, give this part of the assessment more than 3 stars.\nAnother worry is that I can't see evidence of whether or not the implementation has been risk assessed. The play test and Beta will go some way with ironing out issues that arise with interface and general bugs but I don't see a 'big picture' risk assessment. \nThe time frame is solid and I think that their plan has been scaled well, even if the full launch was delayed I think the community would be understanding given some of the circumstances the team faces.", "q1r": 3, "q2": "I think the KPIs and goals set by the PlayerMint team are solid and could definitely be used to measure the progess and success of the proposal. I think some are more important than others (I wouldn't be too focused on the USD value of PMX) and from what I can see one KPI is missing that I think would help measure how much gaming entrepreneurs are engaging with the platform. I would like to see a 'how many CNFTs were added to the market place' metric. The backbone of a lot of success in the modern gaming space is how well an game/idea/platform is adopted by content creators and streamers. Seeing well known gaming personalities creating their own CNFTs would show healthy engagement with one of the most influential communities in gaming. The KPIs identify the problem and if all KPIs were indicating positively then it show that PlayerMint's solution is addressing the problem.", "q2r": 5, "assessor": "z_assessor_1797", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4843, "q0": "This challenge was based on online videos games to allow those with a strategical game play earn cardono ADD when they play to the highest level and competing with others to earn a championship.", "q0r": 5, "q1": "This proposal is a success and well stated defined proposal which is going to help Cardano in all continents of the world because the PlayMint Play-to-Earn is going to be an online game based on shearing building ideas and survival plans. With this we get more kids with an ideological brain to enter the Cardano by making the earn ADD when they succeed some difficult levels.", "q1r": 5, "q2": "The information provided is a successful one but i say is now left with the hard work by the team members because our world today is control by networks of networks that is the internet so this game i say is a great success and a new beginning for this platform.", "q2r": 5, "assessor": "z_assessor_1785", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 3548, "q0": "Gamers are ardemment about improving their pro forme ce in general so when you have a reward system that links better performance to actual earnings you are going to have a growing base of gamers that are interested in linking their wallets to the database and with a game as widespread as Fortnite its guaranteed to expand the Cardano community  and this is the main goal of he project", "q0r": 5, "q1": "This team has already been funded in two previous funds and this project is building on what was already established back then. With the potential of this project and the traction  it will get from the gamers community trying to hop on the nft trend I can see a lot of motivation to follow through with such a project. The team seems knowledgeable and well capable to follow through. As mentioned one of the 6 team members is based in Kiev which is concerning and may lead to a haunt or delay in the implementation of the project.", "q1r": 5, "q2": "By seeing the number of registered wallets and number of active gamers and return gamers it should be fairly simple to keep track of the progress and audit the success of the project.", "q2r": 5, "assessor": "z_assessor_1660", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3333, "q0": "PlayerMint has a creative solution to this challenge that will potentially have a huge impact on the Cardano Ecosytem globally by bringing current gamers into the ADA Blockchain. They want to create a free-to-play platform that offers Play to Earn incentives, NFT Marketplace, and Minting tool using their PMX token. They are working on blockchain education by putting a stong emphasis on a Support Model to help gamers that are new to Cardano by offering tools such as FAQ pages, chat bots, Discord servers, Social Media updates/responses, and email ticketing. ", "q0r": 5, "q1": "I have confidence in the team due to their previous success in Catalyst Fund 4 and 6. The information the team described on their timeline is detailed, but it is just lacking dates. The first deliverable is supposed to be delivered at the end of March which is approaching fast so I question if this goal will be reached. The last deliverable is supposed to happen in July 2022 which seems to be attainable according to team and Devs (MLabs). Even though the timeline dates are lacking the team spoke to being directly affected by the current world events and that being the reason why they are lacking dates. They also padded their timeline just in case to try and account for unforeseen setbacks. I feel that the budget is vague and needs a little bit more breakdown and explanation. The Main Launch budget and the Upgrades and Maintenance budget are the exact same. I would have liked to see some differentiation between the two. One of my favorite parts of this proposal is educating new users, but I don't  see any funds set aside for Education/Customer Service in budget. I think that on boarding that many new users may be overwhelming for the current team. The team has accounted for Dev team (MLabs) and Marketing (xen Fortnite) in their budget.", "q1r": 3, "q2": "I really appreciated the team adding additional content such as video and Google Drive files to help the clarity of the project. I like that the lite paper roadmap spoke to getting PMX on Cardano Dex's in the future.  I had a hard time understanding the road map layout because it goes from Q2 to Q1 to Q4. There are milestones and Key performance indicators to help the auditability of this project. But the lack of dates may make this proposal harder for the community to track after funding. Overall I believe this proposal has a clear solution that addresses the problem statement.", "q2r": 3, "assessor": "z_assessor_1645", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1381, "q0": "The proposal answers the challenge quest in turning gamers interest towards blockchain. PlayerMint will allow gamers to earn PMX tokens which can be used in the CNFT marketplace. It aims to gain initial traction of 0.1% Fortnite players. The proposal specifies the risk that could happen if the studio decides to reject them and provide some backup plans. The PlayerMint has collaborated with MLab and has some esport connection which makes the project viable.", "q0r": 5, "q1": "PlayerMint has specified how $50k will be spent towards working partner: Mlab and Xen esport org but they haven't mentioned internal cost that would incur from the project ie. internal staff cost. The proposal should provide more detailed budget breakdown and include other relevant costs. The proposal provides the link to \"The fund 8 proposal package\" in google drive and the new information won't be available for viewing until 20th March with the project delivery and deployment date are stated by the proposer to be delayed.", "q1r": 3, "q2": "The proposal supplies listed KPIs very well and the information is sufficient to measure project progress. The team defines project success based on achieving the deliverables listed in the feasibility timeline. \nThe PlayerMint sees the play-to-earn marketplace as their potential area for development and has explained its mission of bringing the on-chained gamers to Cardano. The project has received fund in 2 previous rounds which makes the project be accountable for their development. ", "q2r": 5, "assessor": "z_assessor_1351", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1019, "q0": "This is a very interesting and interesting proposal. It will be a gateway to help connect traditional game players to the blockchain gaming world. In particular, this will be a way to increase the number of new users to Cardano. Of the many proposals, I have found few that are as interesting as this one.\nBecause current blockchain games are very monotonous and boring. If you want to develop an attractive game, it takes a lot of time and money. But this proposal took a new approach. Instead of having to create an account for players to start playing, through the application, they can use the wallet to connect and play the game. This is also a way to make the game more decentralized. I can't wait for the finished product of the project.", "q0r": 5, "q1": "They are a young team with a wide range of professional experience. These are the things that are needed to make the project complete and successful as they suggested. In my opinion, they should add a design staff to make the user experience smoother and more beautiful.\nRegarding the implementation plan, they have made a very detailed and complete plan including the time and details of the features. If they could add a specific time period that would be even better.", "q1r": 5, "q2": "Looking at the plan they have outlined and the feature that will roll out in phases, I can see that they are people of good competence and expertise. The key factor that made this proposal a success after being funded.\nWish the team will perfect the product and bring it to millions of players around the world.", "q2r": 5, "assessor": "z_assessor_1253", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1007, "q0": "The proposal aims to be a bridge for passionate Fortnite players  (and other games) to get involved into the Cardano ecosystem with a skill based reward system. By playing the game, you can earn a token, that can be used to purchase NFTs in a marketplace. These NFTs can be from a variety of different games. So by playing one game, you can get a head start to play another game. If the game doesn't suit you, you have the possibility to sell your NFTs on the marketplace and switch to another game. Everything is achieved with only a very little entry hurdle.", "q0r": 5, "q1": "The team is working since a while for the described project and acquired a few partnerships with other projects in the gaming world and also in the Cardano space. ", "q1r": 5, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. The KPIs (number of users, active users, NFT sales, etc.) were well-chosen, and I believe they are good indicators for evaluating success.", "q2r": 5, "assessor": "z_assessor_1252", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 10688, "q0": "This proposal will impact the gaming industry on a big scale. This is something that is not only needed but also a critical element for the blockchain gaming industry as a whole to succeed!", "q0r": 5, "q1": "I have seen this team work hard in the past month and I believe this proposal will be implemented if funded. They have a solid team of 6 that has vast experience in the gaming and blockchain industry. They also work with Esports Orgs, MLabs & Overwolf which is a huge deal for integrating existing games & gamers onto the community to be able to Play-to-Earn on those games. ", "q1r": 5, "q2": "This proposal provides a definitive and clear timeline for the implementation of the marketplace platform. As indicated, this proposal will be implemented to a due date of July 2022. I have seen the laid out plan for the marketplace they're building and if successful, it will drive a large group of gamers onto the Cardano blockchain utilizing its network.", "q2r": 5, "assessor": "z_assessor_98", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "A play-to-earn protocol that rewards performance in existing games like Fortnite. Tokens earned can be spent in an NFT marketplace.", "experience": "Our team has a collective 12 years of experience in gaming and 11 in blockchain. We helped write the Gamers On-Chained Challenge and were successful in Fund4 and Fund6 of Project Catalyst.\n\nWe have partnered with MLabs to build out the products codebase."}