{"id": 405243, "author": "adagotchi", "title": "On-Chain Tilemaps for Game Worlds", "url": "https://cardano.ideascale.com/a/dtd/405243-48088", "category": 26440, "amount": 9500, "description": "On-chain storage doesn't have the capacity to house game worlds. Tile maps would offer a solution for vast worlds created from mapped pixels", "funded": 1, "upvotes": 33036454, "downvotes": 10343940, "votes_result": 22692514, "votes_cast": 101, "f6_no_assessments": 9, "f6_rating": 3.9629629629629637, "videos": [], "media": [], "f6_assessments": [{"id": 120, "q0": "A simple proposal for tooling for pixel art games and top down games. A simple standard will really help to progress other projects in on-chain gaming in the future", "q0r": 5, "q1": "it seems like a very interesting project with a lot of potential. The team seem more than capable of delivering and the budget and timeline seem very reasonable too bring the project too mainnet", "q1r": 5, "q2": "There is a robust system of tracking and presenting deliverables, even though it isn't elaborated on particularly I have used a lot of these systems and I know that combined it will be very simple to audit and verify progress and works completed", "q2r": 5, "assessor": "z_assessor_1053", "no_vca": 22, "ne": 0, "ng": 13, "nfo": 9, "vca_o": 1}, {"id": 584, "q0": "The proposal sees a problem (on-chain storage) and offers a solution, but if that´s a problem why build on top of that? Maybe it would be better to develop directly on 2nd Layer? Anyways, this could work as a great pathway for future game devs to follow in the future. The proposal correctly addresses challenge objectives.", "q0r": 4, "q1": "The team seems qualified for a project like this and provided sufficient information to prove it. Timeline should have a clearer breakdown, in months or weeks, if possible. If not, the game could take years to develop, voters need a clear Timeline for the project, will it take 6 months, a year? more? Budget makes sense according to the required team", "q1r": 3, "q2": "Although mentioned audit places are great (MIRO), what are you reporting? How often? How will the community be able to track the projects work if we don´t have a timeline. At least I would add a completion date, minimum. Next time I would pay more attention to this details, it could greatly improve the proposal!", "q2r": 3, "assessor": "z_assessor_1190", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 1904, "q0": "Having a bunch of tilemaps on chain that can be used as a game development building block by other games is an interesting idea that fits well in this challenge. The proposal however seems to lack some depth in details as to how this would be utilized; for instance, the proposer states that they would like to open a tilemap NFT market, but what does this actually mean? What value would it bring to its holder and how would it be used by them? I would recommend exploring the ideas of how and why it would be useful. I recently ran across a similar project, \"Crypts and Caverns\" on Ethereum that is building in the \"Loot\" ecosystem that I would suggest the author investigate to gain more insight into these questions.", "q0r": 4, "q1": "The scope of this project is pretty small and the budget is not very large; The bios of the folks working on the project don't really show much experience with this kind of development, but this project can be seem as a good \"learning\" type project that could still be delievered successfully, despite the experience of the team.", "q1r": 5, "q2": "The product to be delievered is pretty straightforward; the proposer does not really explain how they will show progress to the community, but if they provide access to their planning tools (miro, trello, github), then this should be sufficient. Would suggest providing a timeframe estimation for when the team hopes to achieve certain milestones, such as finish requirement gathering, vertical slice, etc", "q2r": 4, "assessor": "z_assessor_142", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3596, "q0": "From what I’m given to understand from the project, this project is not as large-scale and ambitious as the others that I’ve previously encountered, however, it is still necessary for developers to have a smoother and more convenient working experience, which is thoroughly described in the proposal. Hence, the target audiences are all applicable and relevant. And by bringing in more game developers and elevating Cardano-based gaming, I believe the project suffices in satisfying the main objective of the Gamers On-Chained challenge. The team also puts forward a problem the project might face during execution, followed by a highly viable solution to mitigate it. All in all, quite a promising start.\n", "q0r": 5, "q1": "Based on the plan and milestones provided in the proposal, I am saying with confidence that this project will likely be met with success, though I could use the extra help of a timeline. The breakdown of the budget is reasonable, with proportional allocations to each part, so the total amount should be acceptable. The information that comes along with each team member of the project sufficiently describes their background and expertise, along with LinkedIn profiles to further verify their capabilities.", "q1r": 5, "q2": "I believe a certain extent of clarity is achieved in terms of this criteria, as evidenced through various tracking tools listed such as Miro, Trello, GitHub and Discord, all of which are highly efficient platforms to communicate, cooperate and keep track of the overall project progress. The envisioned success fits comfortably in the desired outcome of the project and at the same time guarantees to benefit Cardano by drawing in more game developers to the ecosystem", "q2r": 5, "assessor": "z_assessor_1664", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3770, "q0": "Overall I think the project is pretty align with the challenge. The project supports a scalable standard that supports indie game developers allow them to more easily create games on Cardano.\nThe features of the game are also presented quite easy to understand, the risks of getting the tile maps on chain without the use of ipfs are also mentioned and specific solutions are available.\nHowever, I think the impact would be more complete if the author could analyze the impact of the project on the challenge with clearer quantitative KPIs.", "q0r": 4, "q1": "The budget section and the members description are described in detail. The budget is broken down into four reasonably good chunks and includes information about the estimated hours of completion and the amount of each item.\nInformation about project members is attached to profile information via LinkedIn.\nHowever, I think the author should add a few highlights about the members' working experience as well as outstanding achievements so that readers can have enough information to evaluate the project more.\nIn addition, the project implementation plan lacks information on completion time. The author should add the total project completion time as well as the timeline in each item so that the roadmap has enough information for feasibility assessment.", "q1r": 4, "q2": "There are many project tracking and measurement tools used by the author to help the community track project progress: miro, trello, github and the Hardforq cafe discord channel. However, there is no clear quantitative indicator for the amount of work to be completed with a specific time so that the community can compare and make comments on the project progress.\nThe criteria for determining the success of a project are somewhat general. The author should describe more specific quantitative indicators (For example the number of users, ...) with a certain timeline so that the auditability section is complete and easier to evaluate.", "q2r": 3, "assessor": "z_assessor_1674", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3828, "q0": "This proposal is intended to integrate tilemaps in indie games with blockchain, then create an NFT market for it. Since the proposal is quite short, it's hard to get a good view of it. I suggest the proposer to consider adding these information:\n- what benefit would the solution bring in comparison with current system\n- to whom it will benefit and explain how significant is the solution to them\n- How big is the indie game market, presented by networth, number of developers and gamers of the genre\n- provide an example of an NFT tilemap and how it looks like when used in a real game", "q0r": 2, "q1": "There is no clear timeline for the project although the team did provide some action points. Perhaps the team should give an estimation on the length of project and when it'd be expected to deliver. In terms of budget, it'll be spent on mostly labour cost. It's a good thing that team spend effort to work with indie game developers who benefit the most out of this project. This is reflected by $2500 for 60 hours of work with indie game devs. The team members provided linkedin profiles with relatable work experiences such as developer, graphic designer. However, there is no mention of blockchain related experience.", "q1r": 2, "q2": "The team provided some ways to communicate with the community throughout the development of this project such as Trello, Github and Discord channel. But to align the project success with the challenge, I recommend the team to use these following metrics right at the beginning stage of development:\n- feedback from developers\n- number of developers areeing to try out after the project finishes", "q2r": 2, "assessor": "z_assessor_1685", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6107, "q0": "This proposal is one in which it has a potential to start a whole new economy on its own only if implemented well.Honestly, this is an amazing proposal to have tilemaps on the chain to which various developers can use.\nWill this proposal have a huge positive impact to cardano? yes it will and it is a straight 5 star.\nI will also like to kindly suggest some areas to look at during implementation :\nI will not recommend having any tilemap on the chain as it will be a challenging issue at scale, if i was to implement this, i will go an on-chain protocol route so as to just have a protocol that guides, authorise the standard you set for pixel creation.The standard can just sit on the chain which your external tools can just communicate with.I will advise against saving pixels on the chain.\n** I have been developing games as an indie for over 10 years,I also build high TPS telecommunication applications.\nI am giving 5 star.", "q0r": 5, "q1": "The proposer provided a clear timeline .\nThe cost breakdown was provided but it could be further broken down maybe something like :\n$4000 - 30 hours - Plutus/on-chain development\n$30/hr for 4 days/weeks - Plutus/on-chain development ($4000)\nThe proposer provided links but the current team do not have any developers and this means there is a likelihood that the current implementation will completely change when the developers join the team considering it is a highly technical implementation heavy proposal.\nI am giving 4 stars because of slight confidence loss due to the lack of existence of a developer and the impact of the absence at this funds sourcing phase, but i still believe the team are capable of making this proposal feasible because they clearly show they understand the scale of the problem and the Potential risk/challenges section of this proposal.\nI am an indie game developer(\nIOS :   https://apps.apple.com/us/app/id1488600103\nAndroid :  https://play.google.com/store/apps/details?id=com.sourcecard.whotfire).", "q1r": 4, "q2": "This is a development/programming heavy proposal and the proposer suggested sharing trello github and the Hardforq cafe discord links which is used to track projects of such.considering it will be difficult to give a timeline for such a technically complex project, i think as a developer providing trello github and the Hardforq cafe discord links to track progress is a welcome step and sufficient for this initial proposal but will have to have updated timelines when the whole team is setup.\nI will be giving a strange 5 star because i understand the situation surrounding giving definite timelines..", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6117, "q0": "The opensource game space on Cardano is still quite small and a similar solution was already recently released on the Ethereum ledger. The opportunities emerging from procedural generated, out of the box gaming worlds, is a game artists' wet dream. Having a tool like this written with an  open source license and on chain would mean empowerment of a new generation of game designers on a new level. \nMany indie game designer and pixel artists ( to sell their art as game assets directly!)  would flock to Cardano to realise their ideas in a permission-less, sustainable (transaction costs and PoS) and scale-able (Hydra needed!) game-tech stack \n\n The risks are very well assessed and mitigation plans are in place (except for Hydra not launching, which on the other hand is almost impossible to mitigate for). Bonus Kudos for relieving Blockfrost (IPFS) stress with the \"single pixel then scale to sprite\" approach.\n", "q0r": 5, "q1": "Evidence of tiling and mapping skills has been given on few occasions in other communities (AdaCafe and the HardForQ).\nGitHub shows activity around Plutus Pinoeers program and other Cardano related tools. The ADAgotchi website is showing progress already made and the adagotchi's currently minting.\n\nPlan is detailed enough for the amount of requested funds; Overall the budget is quite low (133 USD per hour for a plutus developer), a fact which makes up a small portion of the assessment score, since the team is already founded and the developer seems to be on board with the fixes amount. \nDocumentation is key here and is not further specified in the budget. Breaking the budget down even further would be helpful in providing a more just assessment.\nTesting the solution in an\"in house\" game production (ADAgotchi)  is sensible and a good showcase for future game projects. The \"customer\" focused approach to requirement gathering (\"customer\" here being (indie) game developers) is sound and shows  that there's software development experience within the team.  \n\nAll resources for a successful implementation are roughly described and budgeted in.\nThe technical details (on base protocol level) are not further defined, however also not deemed crucial by myself for the success of this implementation.\n\nThe risks, as mentioned before are well assessed and mitigation plans are in place.\n", "q1r": 5, "q2": "The roadmap is only indirectly described and a timeline is missing. This might be due to the teams setup. An apprentice Plutus developer and the pixel artist having a full time job, most likely make it difficult to estimate a roadmap that can be committed to.\n\n\nMetrics and KPIs to measure success are only rudimentary defined. Working with leading and lagging KPIs would've been helpful here. For example: Leading = numbers of tutorials (one for each, artists and devs) released for using the tool; Lagging = number of repository forks; number of game worlds built...\n\n\nThe solution and problem are well understood and the team is positioned to continue development independent of Catalyst Funding. Seeing as they are already very active within the community this further shows strength and builds trust and is responsible for the relatively high assessment score.\n", "q2r": 4, "assessor": "z_assessor_334", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7253, "q0": "This proposal identifies the problem that game assets occupy a lot of memory and on-chain storage is not an option for them and proposes a solution to create an open source standard for building game worlds with on-chain tilemaps.\nThe proposers argue that this standard for 16x16 pixel tiles would help indie game devs create games more easily on Cardano, it would have applications in the NFT space and later on, if integrated with Hydra, can even allow for users to interact with each other on chain.\nAs a risk, they only identified the fact that it will be difficult to get the tile maps on-chain and that they would have to start with assets smaller than 16x16 initially. I also think it would have been worth thinking about how to draw attention to this project during and after implementation, because all projects carry the risk of failing due to not being visible enough. I think this is especially relevant in the blockchain ecosystem, where success heavily relies on social media visibility and wide adoption. \nUnfortunately, even though I have over 7 years of experience in the IT industry, I do not have the blockchain competency to assess whether the solution here is viable or not, but it sounds like a good idea overall. I am giving it a score of 4, as it probably will effectively address the Gamers On-Chained challenge, if implemented successfully.\n", "q0r": 4, "q1": "The proposers provide a step by step action plan, but it cannot be called a roadmap, because it sets no dates for completing each step. It’s important to set time limits so that voters can form a good idea of when this proposal will be finished and what can be expected along the way.\nThe budget is broken down relatively well and is not a huge ask at 9500 USD, but it is still concerning that we don’t have a clear timeline for the work that is to be done here. The highest estimation is 60 hours for researching and communicating best practices with indie game developers. Assuming an 8 hour work day, does that mean that it would only take 8 work days to complete this proposal? It’s important to know if this is something that can be done in a month or if it might take 3, 6 etc.\nRegarding the team, the proposers have provided a list of 3 people, 2 of which have LinkedIn profiles, but the third, Derrick Oatway, a pixel artist and graphic designer who is mentioned to be founder of Adagotchi.io and currently employed at Atlantic Project Managers, has no link to verify his experience. Furthermore, I cannot find any information about this person on Google at all, nor about this Atlantic Project Managers company.\nI find this concerning, along with the lack of a timeline, so I can neither agree nor disagree this proposal is highly likely to be implemented successfully (score: 3).\n", "q1r": 3, "q2": "In the Auditability section, it’s mentioned that the team would collaborate through Miro, Trello, Github and Discord to identify team member and game developer needs. Unfortunately, this is not what is expected here. We should see information about how the Catalyst community can assess the progress of the proposal, through clearly stated KPI’s. For example, a project github could have been provided (not Dominick Garey’s personal one), along with a clear target of X commits per week or month, after the proposal is funded.\nThen, to assess the success of the proposal, we again should have seen metrics like “X number of developers adopting this standard after 1 / 3 / 6 months, X number of games / NFT’s created with it after a certain amount of time etc”. Even if these would be very rough estimations, they are needed in order for the community to see this proposal sets clearly trackable targets that it wants to achieve, as opposed to just hoping for the best.\nDue to the lack of information that would help make this proposal more auditable, I can only give a score of 2 here. ", "q2r": 2, "assessor": "z_assessor_546", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "An open-source standard for creating worlds with on chain tilemaps. The first tilemap added will be CC0 and usable for all of Cardano.", "experience": "Team members with experience in;\nUsing programs such as Tiled and Aseprite for creating and mapping TilemapsPlutus Pioneer ProgramCommunity hubs and collaborations"}