{"id": 381038, "author": "jrepusseau", "title": "NFT for food value chain resilience", "url": "https://cardano.ideascale.com/a/dtd/381038-48088", "category": 26249, "amount": 5000, "description": "Dans les pays en développement d'Asie, d'Afrique et d'Amérique latine, les petits exploitants ont un besoin urgent d'investissements de 238 milliards de dollars pour mettre en place une agriculture intensive durable*.", "funded": 2, "upvotes": 83208890, "downvotes": 5896872, "votes_result": 77312018, "votes_cast": 170, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of not enough investment in sustainable intensive agriculture for small farmers by a food certification and information system which aligns with the challenge goal of Licensing and Certifications registries.\r\nThe proposal is an excellent example of providing key metrics and goals that more closely align with the challenge.\r\nThe proposal does a good job of articulating the value to Cardano ecosystem and articulating how the solution scales to address future challenges.\r\n", "q0r": 5, "q1": "The proposal articulates the feasibility aspects of evidence of experience (prototype), additional funding plan (staking pool), realistic timetable and plan, resources required, detailed technical explanation of the solution\r\nThe proposal's feasibility could be improved by team composition (skills required), and a challenges and risks section.", "q1r": 4, "q2": "The proposal is an excellent example of metrics/KPIs to measure proposal success\r\nThe proposal includes a roadmap, milestones, time horizon, a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The strategy behind this proposal is really interesting.\r\n\r\nIt fits with the aim of the challenge in two ways. First it targets rural farmers who do not have the bargaining power to achieve good prices for the products. It will allow them to bring their products market with certification that will give them pricing power.\r\n\r\nSecondly it will allow the facilitation of support for rural farmers by governmental organisations because now they will be direct evidence, on the blockchain, to show that they have market support for their product.", "q0r": 5, "q1": "The team has presented a codepen as evidence of their experience. This is functional to an extent. The major concern here is that they have only applied for $5000. This is nowhere near enough to execute on a plan as ambitious as this. It would be great for the team to review how much I think this would cost and present Catalyst with some more realistic numbers.", "q1r": 1, "q2": "The team of set out a number of KPIs and a roadmap that feels realistic. They have defined what success means to them in distributing funds via their platform to the farming community. However as they have only applied for $5000 it is difficult to see whether the plan is realistic and therefore it may be difficult to order it because the plan my fall apart quickly. I suggest that the team reviews the amount of money requested and builds this back into the KPIs and success criteria.", "q2r": 3, "assessor": "z_assessor_466", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal combines different elements needed and currently being developed on Cardano to solve a problem in the real economy: protect small agricultural producers who represent the majority of the whole production in the world. ", "q0r": 5, "q1": "Scalability will be a big challenge, as well as regulator compliance cross state: the NFT certifying the provenence should collect all the data compliant with all the regulation for the countries intended to be involved. A good start could be the european union, which collects 25+ countries under an unique regulation.\r\nNevertheless, the plan is well detailed and as it starts on a small scale, also doable. \r\nThe teams seems overqualified to reach the goals, as it has proven to be capable by showing an effective MVP. ", "q1r": 5, "q2": "The information is complete ad the project is extensively described, from the market segment, to the NFT model to the staking pool planning.\r\nAlso the timeline is itemized quite in detail.\r\nI estimate the budget required is quite low given the huge amount of work to be carried on for scalability, but for the first months it could suffice. ", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal perfectly fits the challenge offering a solution to tackle food security, transparancy from small farmers around the world using NFT's. It will have both local and global impact, benefiting both local farmers and consumers around the globe.", "q0r": 5, "q1": "The team has the expertise needed for the success of this proposal. Having an expert of the cardano ecosystem and Agritech founder is a valuable asset to understand the value added, needs and implementation of this proposal. Moreover, the team understands the need to a UX/web developper to facilitate the onboarding of local farmers to the project. Finally, Farmers from TABA will be able to determine specifically the needs to make sure farmers adopt this project.\r\nthe team has a clear roadmap with easy to follow KPi's permitting an easy process to determine success of the project. They have paid attention not only to the technical aspect of the project but also to the communication, education and support by having a coherent budget.", "q1r": 4, "q2": "Deliverables: the team have clear deliverable such as The number of smallholders that receive starting fund.\r\ntheir roadmap and  timeframe seems reasonable however it is hard to say how reachable their success goal is reachable in that time frame.\r\n", "q2r": 3, "assessor": "z_assessor_761", "no_vca": 13, "ne": 3, "ng": 6, "nfo": 4, "vca_o": 1}], "solution": "Nous construisons un système d'information et de certification alimentaire vérifié avec des NFT détenus par des petits exploitants agricoles qui récompensent les pratiques durables en utilisant ADA.", "experience": "Jules Repusseau - Associé développeur Cardano (Emurgo) Fondateur d'Agritech\nJin Yu - Analyste de données senior - Développeur UX/Web\nAgriculteurs de TABA"}