{"id": 384449, "author": "mavster04", "title": "Community Pharmacy System", "url": "https://cardano.ideascale.com/a/dtd/384449-48088", "category": 26249, "amount": 24000, "description": "Les centres de santé locaux des communautés en développement ne disposent pas de systèmes permettant de gérer, de contrôler et de distribuer des fournitures médicales.", "funded": 2, "upvotes": 93088464, "downvotes": 4476578, "votes_result": 88611886, "votes_cast": 175, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I liked the overall idea, the project proposal, and the overall defined activities and milestones sounded like a rational idea to me, not only for the requested investment value but also for the overall project proposal. Also, the idea and constructs of the project seem well-designed, and I will also be available as a leader and an expert in this area to support the idea and project execution. Even so, as described before, the general assumptions have been considered as well as the notion constructs. I would suggest that for the next phases, there should be additional consideration given to data privacy, data security, and storage, as well as to all the underlying principles and concepts of regulatory compliance, quality assurance in product control, and effective monitoring mechanisms involving not only products logistics and distribution but also data transfers at different levels. Although the team's experience in developing similar solutions may be an excellent sign, it may also be useful to share the team members' experience details and overall experience in similar projects.", "q0r": 5, "q1": "Despite the challenge, this proposal presents a solid understanding of why new criteria will be needed to address the challenge. It is essential that this proposal explains how it aligns with the community's goals. Several improvements can be made and a proposal can have a higher impact level and explain what is the problem to be solved and how this proposal will benefit the community. Moreover, I believe that we need to understand how to scale up the proposal to meet future challenges.", "q1r": 4, "q2": "In the event that the right team is able to develop this interesting application, it could have a considerable amount of success and adoption within the Cardano ecosystem. It is worthwhile to support this proposal because it helps address the challenge, is a great decentralized app idea, and is an effective way to put Cardano to work. As a future consideration, will the project proposed to be part of a natural refinement and growth process through an accelerator program or by bringing in industry experts who can reach valid networks of contacts and form potential future partnerships in pharmaceuticals and life sciences, which are highly demanding legal, and regulatory restricted spaces?", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 18, "ne": 7, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal for a Pharmacy Information System identifies a problem within the challenge which needs to be solved.\r\nThe proposal clearly articulates how it will add value to the Cardano ecosystem, specifically using Atala Scan and Cardano blockchain integration.\r\nThe goals of the proposal align with the outlined challenge settings however the key metrics are more about the coding process than the challenge.\r\nThe proposal is able to scale to address future challenges.\r\nTo improve the proposal: the key metrics could be improved to align with the challenge goals.", "q0r": 4, "q1": "The proposer provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal.\r\nThe proposer identifies the type and number of team members required to implement the proposal.\r\nThe budget is outlined clearly and broken down into identifiable items. \r\nThe budget is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable to complete the work.\r\nThe proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal clearly explains technical aspects like architecture, language and technologies if they are crucial for implementation.\r\nThe proposer has not considered challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: add a challenges/risks section (potential government regulations on Pharmacy systems for instance)", "q1r": 4, "q2": "The proposal includes a roadmap with milestones and a time horizon for achievement.\r\nThe proposal includes metrics/KPIs that define the success of the proposal however success is simply defined as developing the solution instead of having a specific number of users or communities.\r\nThe proposal includes a clear understandable description of the targeted problem.\r\nThe proposal includes a clear understandable solution that addresses the problem.\r\nTo improve the proposal: the key metrics could be improved to align with the challenge goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "Improving the trust and efficiency of health care services, especially in developing countries the aim of this proposal does effectively address the challenge.  This proposal aims to put tools in to the hands of Pharmacists and Medical practitioners without relying on their respective governments or governing bodies.  It is a decentralised approach to improving medical services.  ", "q0r": 5, "q1": "The team have demonstrated competence with two previous web based medical projects and included evidence in the form of links to these past projects.  The current proposal also has a starter page which outlines some of the key benefits of their project.  The coding libraries from previous projects would also be used for this new proposal, so it is building upon an existing base.  ", "q1r": 5, "q2": "The proposal defines a milestone success as having an operational PIS system with a doctor or pharmacist signed up and using the system.  This end goal mile stone is easily accessible.   In terms of interim mile stones perhaps the team could produce an expected sequence of events or time line.  ", "q2r": 4, "assessor": "z_assessor_505", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The proposal clearly identifies a problem within the challenge that can impact nations through health, strengthening this aspect could be crucial for the health system.The proposal could be expanded by providing multidisciplinary information on the usefulness of the proposal. This proposal could add value to the Cardano ecosystem if it is successful since it would develop its implementation in the pharmaceutical world in developing countries.", "q0r": 3, "q1": "The problem is apparently determined by a knowledge in the matter on the part of the proponents in the technological component especially. The experience observed is that of having developed other applications in medical aspects. Proponents are not observed to have direct knowledge of health policy, experience in pharmaceuticals, or experience in distribution of medical products or marketing.The question is: Is the experience in building other applications enough? Or is experience in marketing of pharmaceutical products required? I think the team that comes forward could be strengthened to ensure that they have the necessary skills and experience to develop an application with this content. On the other hand, the budget is adequately described and divided into identifiable elements. I believe that this project requires more research on its need and possibility of impact, since the Harvard Business Review article is not enough. On the other hand, the proposed times to develop the proposal are quite optimistic, being possible. The proposal in its technical aspects, architecture and language is well founded. The proposal must be opened so that it is accompanied by professionals with experience in the pharmaceutical sector and not only in technologies for the pharmaceutical sector.", "q1r": 3, "q2": "auto_awesome\r\nSe muestra la traducción de La propuesta presenta una hoja de ruta con hitos y un horizaonte temporal para el logro. Igualmente cuenta con méticas y realiza una descripción clara y comprensible del problema objetivo.\r\nTraducir La propuesta prsenta una hoja de ruta con hitos y un horizaonte temporal para el logro. Igualmente cuenta con méticas y realiza una descripción clara y comprensible del problema objetivo.\r\n188 / 5.000\r\nResultados de traducción\r\nThe proposal presents a roadmap with milestones and a time horizon for achievement. It also has statistics and makes a clear and understandable description of the objective problem. ", "q2r": 4, "assessor": "z_assessor_778", "no_vca": 13, "ne": 2, "ng": 5, "nfo": 6, "vca_o": 1}], "solution": "Nous allons fournir : (a) un système d'information sur les pharmacies et (b) un système d'inventaire que les fournisseurs publics et privés peuvent utiliser pour une meilleure gestion.", "experience": "Nous développons des solutions de santé depuis 2016, voir ++www.mycure.md++. Nous avons également créé des API complètes pour les soins de santé, ++www.hapihub.com++."}