{"id": 381596, "author": "matthiasksieber", "title": "Loxe Inc. Plutus Internship Program", "url": "https://cardano.ideascale.com/a/dtd/381596-48088", "category": 26248, "amount": 9000, "description": "Quase não existem programas de estágio para estudantes universitários se envolverem com Cardano, aprender Haskell e Plutus.", "funded": 2, "upvotes": 100720510, "downvotes": 3756785, "votes_result": 96963725, "votes_cast": 256, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "I find it a great addition to have prior Plutus graduates mentor possible new Plutus and Haskell devs, this is a very great way to enhance and share education and training for the programming languages. The proposers would be able to close the gap of not enough available spaces to learn the programming languages and they provide an idea how to close this gap. ", "q0r": 5, "q1": "Relevant experience of the proposers matches the description and scope of the proposal. Feasability is highly likely, budget is broken down very thoroughly to see what the team plans on doing with funding, it is also very humble. Roadmap is very realistic and the proposal does a good job of explaining what is going to happen and how this will have a positive impact and also that there is a gap (not enough access to learn these skills) that this team is able to close. I think this is great and very relevant.", "q1r": 5, "q2": "Roadmap is auditable, budget is broken down, risks have been discussed (for instance how to include interns that live in other countries), connections within the community are mentioned (Catalyst school as well as Gimbalabs), overall, this is a very well thought out idea that should receive funding as it (1) names a relevant problem (2) provides a solid solution (3) explains very well and detailed, how the project will achieve it´s goals and has an active team with the relevant skillset to tackle this project.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 22, "ne": 5, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "Students bring fresh enthusiasm and produce much value, particularly in the development space. The same proposers are planning for a web development intern. Combining that with the Haskell internship the cohart of 5- 10 people have the potential  to bring much value to the ecosystem. ", "q0r": 5, "q1": "The proposers are major contributors to the Cardano community. I have to use the same sentences in the other review. But each one of them is well-known people who have proven contribution, therefore, the proposal is likely to be implemented in right earnest. ", "q1r": 5, "q2": "The expenditure of $9000 for training 2 interns is a very reasonable amount however providing a laptop may be reconsidered since most of the students who are passionate about coding will be in possession of a laptop and the movement of the laptop between students is not very recommended. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1, "reply": "NLP is natural language processing not neuro-linguistic programming, which is a therapy style and completely unrelated. I'm not sure why anyone would think neuro-linguistic programming and SVMs and SpaCy would be related"}, {"q0": "The proposal is well placed as it foes not fit into any other challenges. It seeks to bring value to the Ecosystem by onboarding new talent through the form of internships.", "q0r": 5, "q1": "The team is well known and active in the community. It is clear the team has the requisite skills to perform the task. It would be good to see mentioned how the team would find the interns and what a successful internship would look like.", "q1r": 4, "q2": "The proposal has a simple definition of success and so it is auditable purely on the success of completed internships. It would be nice to see some form of measurement that determines how successful a specific internship is.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I think this is a very smart way to train upcoming developers and bring them into the Cardano ecosystem. It is also great that they will be working on real world applications. There's no better experience than that!", "q0r": 5, "q1": "The budget, internship scope, KPIs, roadmap, and information about Loxe Inc. all demonstrate the direction that this project will take. I think the proposal could use more information on the type of projects the interns will be working on, but all of the necessary information is still there to show that this is a successful team.", "q1r": 5, "q2": "Based on the budget, internship scope, KPIs, and roadmap provide all the information necessary to determine the success of this project. ", "q2r": 5, "assessor": "z_assessor_844", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "Fornecer aos novos desenvolvedores Plutus um mentor e uma experiência de trabalho no mundo real.", "experience": "Equipe da Loxe Inc., grupo de desenvolvedores Plutus e AtalaPRISM, participantes do Gimbalabs PPBL veteranos."}