{"id": 381585, "author": "rodes", "title": "ADA 4 Science", "url": "https://cardano.ideascale.com/a/dtd/381585-48088", "category": 26248, "amount": 200000, "description": "A corrupção científica e os financiamentos forçaram nossas políticas e leis públicas a um alto nível de políticas tendenciosas e personalizadas.", "funded": 0, "upvotes": 15586089, "downvotes": 23639594, "votes_result": 8053505, "votes_cast": 96, "f6_no_assessments": 8, "f6_rating": 2.208333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A criação de um lugar que conectaria pesquisadores que desejassem cooperar em estudos e publicações na área de blockchain ajudaria a conectar pesquisadores em todo o mundo, facilitando a replicação de estudos na área, conectando e dando acesso a publicações. Entretanto, em sua solução, ele afirma que os governos confiam na ciência em suas políticas, mas isso normalmente se referiria tanto a trabalhos revisados por pares que estão em revistas nacionais ou internacionais altamente conceituadas, quanto a trabalhos internos do governo. Portanto, duvido que sua solução se encaixe em sua visão de como a ciência pode impactar as decisões governamentais. Também não está claro se a página premiaria os acadêmicos por suas revisões por pares e como funcionaria o processo de avaliação e como este proponente criaria uma identidade digital dos pesquisadores na plataforma para verificar se eles estão aptos a revisar outras pesquisas por pares.", "q0r": 4, "q1": "O proponente quer criar uma equipe após o financiamento - o que significa que, no momento, a viabilidade não é viável, uma vez que não há equipe e o próprio proponente não possui as habilidades necessárias. Sou um pesquisador com mais de 7 anos de experiência e passei por várias rodadas de revisão e publicação de meus próprios trabalhos em periódicos acadêmicos e também sou um revisor acadêmico e acho problemático ser tão casual sobre o processo de revisão por pares de trabalhos científicos reais. Os processos de revisão por pares em periódicos acadêmicos são geralmente cegos, portanto os revisores não conhecem os autores do trabalho. Acho que a chance de corrupção e criação de preconceitos é maior em uma plataforma de rede anônima onde os artigos estão conectados à votação. Eu não acho que a ciência exija \"upvoting\" e acho que isto é exatamente o que causa o viés. Há também o \"researchgate\", que é uma plataforma de pesquisa de acesso aberto que é globalmente acessível e faz mais ou menos o que este proponente está tentando criar. A questão é, por que esta solução seria melhor do que a existente e a outra questão é, se é útil criar um espaço extra para pesquisadores no campo criptográfico, pois isto destacaria mais suas descobertas da pesquisa geral. Eu também gostaria de saber, como os trabalhos neste site de rede seriam publicados? Como ele conectará a página a periódicos acadêmicos - que é onde os pesquisadores publicam trabalhos para serem citados, listados nos mecanismos de busca acadêmicos e assim por diante. Assim, basicamente, ao excluir a pesquisa de alguns campos em um site de rede, como resultado, esta pesquisa será de fato menos visível e conectada, pois provavelmente não será listada nos bancos de dados científicos usuais. Geralmente, o que estou dizendo com todas estas palavras é - o proponente esqueceu de levar em conta a maioria das questões que vão junto com a publicação da pesquisa e deveria colocar mais trabalho para deixar claro, por que um repositório extra / mídia social para pesquisadores neste campo seria necessário e como evitar o viés de pequenos grupos e como garantir que os padrões de qualidade para a ciência não sejam afetados.", "q1r": 3, "q2": "Para criar esta plataforma, o proponente teria que mencionar alguns dos riscos envolvidos ao lidar com a ciência. Apenas declarar que eles querem mudar algo não é viável. Os processos de revisão por pares para pesquisa acadêmica devem exigir um conhecimento específico nesta área e, na área de projetos de pesquisa, os revisores por pares devem ser capazes de detectar problemas de validade interna e externa. Como não há menção de qualquer identidade digital dos membros da comunidade científica, a auditabilidade do projeto em si é difícil. Outras questões relativas à auditabilidade são em relação à alocação orçamentária sendo apenas 30%/40%/30% em três categorias sem dar nenhuma especificação. Isto seria relevante uma vez que o proponente está solicitando o montante total do financiamento deste desafio. Sem uma equipe, a auditabilidade também é difícil, já que o conjunto de habilidades relevantes não pode ser avaliado. Os riscos não foram abordados.", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal lacks an understanding of the problem (there's no such thing as \"objective of UNBIASED Sciences\", as any research in sociology of science has been discussing since a long time ago) and the solution is actually a statement and not a concrete solution. ", "q0r": 2, "q1": "The budget is unreasonable and has no information on how it will be distributed within the project. No experience from the team was given. \r\nTo improve the proposal, I suggest following the guidelines at: https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit ", "q1r": 1, "q2": "Roadmap and deliverables are not clearly presented to the community. And as the proposal needs to be improved as a whole (specially in how the solution impacts the community or Catalyst), it is hard to be audited. ", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal \"ADA4Sci is a platform where scientists can get together and develop a paper from the debate of ideas and perspectives\" is vague and leaves a lot of scope for interpretation. It is difficult to estimate the effectiveness when the aim/end state is vague. ", "q0r": 3, "q1": "The proposer claims to be a research scholar. The proposal does not seem to have any references to past contributions or publication to substantiate his experience. ", "q1r": 2, "q2": "The proposal's budget of 200K is not justified in the proposal. The proposer allots 40% of the budget that is $80K to \"start working on the platform after a brainstorm of ideas\". This to my mind is not justified. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The impact of this project, in terms of creating a space for international information sharing and vetting, is very promising. The solution statement didn't make sense as a solution statement, however, in the context of the project. Beyond the mention of marketing, it's unclear how this proposed site will attract eminent scholars.", "q0r": 4, "q1": "It is not clear to me that anonymous peer review on a social media style site would have less bias than the traditional peer review process. Additionally, social media incentives and ingroup biases could make these problems worse, and it's not clear to me that the proposer has considered these problems. The proposer has a set of credentials but no direct links to their work, nor do they have a team yet, which would be invaluable in assessing feasibility.", "q1r": 3, "q2": "There is not a communication channel or existing team, nor any links to prior work done so far. This makes the proposal difficult to audit now and going forward. The budget in the roadmap does not have clearly itemized or auditable actionable steps. The proposer is asking for the full sum of this challenge fund, which if approved, would mean no other miscellaneous challenges could be accepted. ", "q2r": 3, "assessor": "z_assessor_501", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "\"I have read this proposal carefully, but I still don't understand if the platform the team wants to build is a website or a dapp or a community. If it's a dapp, I think the dapp challenge will be more suitable for this proposal.\r\n\r\nIn addition, the proposer mentions the impact of this proposal as \"\"Most of the impact from this project will be from marketing associated with a successful project hatched by the ADA community. however, it will also be involved by the science generated which is related to blockchain policies, research, and investigations developed within the ADA4Sci platform\"\". This impact is very general and doesn't specify what the problem the proposal really wants to solve.\"", "q0r": 1, "q1": "There is no way to determine the proposer's experience as there is no additional information given. All are just ideas, even the proposer needs to spend 3 months brainstorming ideas and planning for the proposal. This means that currently this proposal is just an idea without a specific plan", "q1r": 1, "q2": "There is limited information about what this plan is concretely going to deliver and therefore would make it almost impossible to know what success measures or any other metrics could be use to track and follow the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 22, "ne": 1, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The problem statement convinces me very much [as a public policy researcher], however, this is not explained in detail. I think this is a great and interesting idea, after all. The solution is clearly showing what the proposer intends to do for solving the problem.\r\nTherefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Proposer profile [with professional experiences as Engineer, MA, MSc, and Ph.D. (Cand.)], as well as his networks, are described as a great benefit for this proposal, however, there is no proof/links for verification. The roadmap is clear, however, the budget breakdown and risk are not provided.\r\nTherefore, based on the given information, I disagree with this proposal's feasibility, I can rate it with a score of 2", "q1r": 2, "q2": "As mentioned, this problem and solution's idea is quite convincing to me. However, the plan did not provide me enough information, especially the following: (1) Profile with reference/proof (documents/links,...) for verifying; (2) Budget structure; (3) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The project is just an idea with no clear view on how to perform it. The investigator doesn't know how to create an \"unbiased science\" and expects to come up with the answer after brainstorming for three months. The science community already has a peer review system to produce reliable knowledge. While the system is not perfect I don't see in this proposal the added value, beside saying it will create 'true unbiased science'", "q0r": 2, "q1": "Science is a vague topic. to goes from engineering sciences to natural and social science. this proposal is just vague with ne clear KPi's or metrics. there is no team in place besides the Principal investigator that  only have expertise in engineering. it is very unlikely this proposal will be successful, due to lack of expertise and knowledge about the challenges ahead and solutions to overcomes these challenges. For instance, how will you compete against the peer review system that already exits and researchers needs in order to obtain funding and recognized among their peers. How will you deal with intelectual property?", "q1r": 1, "q2": "The proposal is just an empty proposition. the funding asked is very big but no clear budget or roadmap or KPI's metrics is in place to provide sufficient information for an audit.", "q2r": 1, "assessor": "z_assessor_761", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Since the challenge opens the way for proposals with different ideas from the other challenges, this proposal fits right for this challenge. ", "q0r": 5, "q1": "I as I read through the proposal, even if the author tried to explain the plan it lacks a detailed explanation.  Having a detailed implementation plan helps proposers identify more about what they want to propose and keeps expectations realistic and in this case, I felt the thought and time spent on this proposal don't show successful implementation potential.", "q1r": 2, "q2": "Having a proposed idea with such a vast timeline has to be well equipped with all the information needed to anticipate the progress of the proposal. But this fails to demonstrate further insights for readers to audit the progress in the futre.", "q2r": 2, "assessor": "z_assessor_762", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "A ciência está se tornando a mais importante fonte de evidência para governos e consultores especializados no desenvolvimento de Políticas Públicas.", "experience": "Minhas experiências pessoais e profissionais, assim como minhas redes de contatos, são de grande benefício para este projeto:\nEngenheiro, MA, MSc e Ph.D. (Cand.)"}