{"id": 382394, "author": "huths0lo", "title": "Real world products", "url": "https://cardano.ideascale.com/a/dtd/382394-48088", "category": 26248, "amount": 100000, "description": "Não há muitos itens tangíveis que possam trazer mais atenção para Cardano.", "funded": 0, "upvotes": 14927288, "downvotes": 24246473, "votes_result": 9319185, "votes_cast": 105, "f6_no_assessments": 7, "f6_rating": 2.142857142857143, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta visa dedicar uma variedade de erva daninha a Cardano. Eu acho que esta é uma grande idéia - entretanto, a equipe proponente deveria fornecer mais informações e, neste caso, eu acho que estas informações deveriam ser sobre como eles estão planejando conectar a variedade de ervas daninhas à missão/visão/ comunidade Cardano. Atualmente, a erva daninha nos EUA tem todos os tipos de nomes e embalagens extravagantes e eu nunca pesquisei de onde vem o nome do meu chocolate \"Kanha\" ou \"Kiva\". Portanto, basicamente o que estou dizendo é que a equipe proponente teria que nos explicar como irá educar ou comercializar sua erva daninha com informações sobre a cadeia de bloqueio.", "q0r": 5, "q1": "Acho que a proposta faz um trabalho pobre de explicar seus objetivos, seus KPIs e suas idéias. Encontrei a página inicial do Budz Cardano através do google e consegui encontrar um roteiro e mais algumas informações sobre o projeto ali. Portanto, teria sido bom se a equipe proponente tivesse conectado seu website como prova de trabalho prévio e para verificar o conjunto de habilidades da equipe por trás desta idéia. Pelo que estou vendo, este projeto está em andamento e há algumas idéias interessantes que conectariam o mercado criptográfico e o mercado de maconha - ambos os mercados estão trazendo muitas pessoas novas, mas esta proposta não entra em criptográfico como pagamento por maconha ou qualquer outra coisa. Acho altamente provável, que a equipe proponente seja capaz de cultivar erva daninha e dar-lhe o nome de Cardano. Também acho isto uma grande idéia. Acho que a proposta é muito ruim em explicar o valor da idéia e deveria nos dar informações sobre a - acho que campanha de marketing - que marcaria esta variedade de erva daninha com o Cardano Blockchain. Por exemplo, o logotipo será ligado ao logotipo Cardano? A empresa fornecerá material educacional ou workshops sobre Cardano através de NFTs ou através de QR Codes em seus produtos de ervas daninhas ou através de seu website? Como afirmei acima, nunca pesquisei os antecedentes do nome da minha erva daninha, portanto a proposta deve fornecer uma estratégia de marketing ou de marca.", "q1r": 4, "q2": "Especialmente com um orçamento elevado como nesta proposta que está pedindo 100.000 dólares em ADA, a equipe proponente deve fornecer mais informações sobre KPIs e passos acionáveis, assim como algumas avaliações de risco e mais informações. Embora pudéssemos rastrear se o cultivo da variedade após 18 meses foi bem sucedido, outras medidas de sucesso não são mencionadas, portanto não está claro, quantas carteiras novas ou novos usuários de Cardano poderiam estar a bordo através desta variedade de Cannabis. Vou dizer novamente - acho que esta é uma grande idéia, mas também acho que a equipe tem que fornecer mais informações sobre seus planos de \"educação\" ou \"informação\" ou \"marketing\" de Cardano através desta variedade de Cannabis.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 20, "ne": 13, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Este é um projeto interessante considerando que é muito bonito, focalizando a indústria de cannabis e criando um produto físico real. Faz muito sentido porque não se encaixaria em outro desafio, mas sim no desafio diverso. Tendo sido um Conselheiro Comunitário com conhecimento suficiente sobre o ecossistema Cardano, eu concordaria com a afirmação do problema de não haver muitos itens tangíveis ligados ao Cardano. Não tenho muita experiência com a indústria de Cannabis, mas depois de procurar rapidamente algumas estatísticas, talvez seja um campo valioso para expandir. Se cerca de 12% das pessoas nos EUA são usuários ativos de Cannabis, seria um (entre muitos) mercados onde o Cardano poderia se espalhar. O sucesso deste projeto parece ser altamente dependente da comercialização da variedade de Cannabis, e é provavelmente por isso que a alocação orçamentária para a comercialização é de aproximadamente 30% do orçamento total da proposta. (Mais sobre o orçamento mais tarde). O que eu realmente gosto com a proposta é que os proponentes apresentem o processo de criação de uma nova variedade de Cannabis passo a passo, de uma forma que seja compreensível para os leitores de todas as experiências. A fim de tornar esta proposta mais clara e tangível em sua execução e descrição, eu teria gostado que ela incluísse mais informações fora do processo de crescimento real. Por exemplo, marketing, networking, etc. Se a proposta cobrisse mais desses aspectos, então ela seria cada vez mais relevante para o ecossistema Cardano por causa do alcance.  Sobretudo, não concordo nem discordo que esta proposta aborde efetivamente o desafio.", "q0r": 3, "q1": "Como foi dito anteriormente, a proposta inclui um plano detalhado passo a passo no processo de criação da tensão, mas não muitas informações sobre o processo de distribuição e comercialização. Se a proposta inclui apenas a criação e refinamento da deformação durante 12-18 meses, então ela é claramente apresentada. 100.000 é uma soma bastante substancial de financiamento (50% do orçamento total do desafio), e considerando que o marketing está incluído nos planos de orçamento, eu gostaria de ter visto uma explicação mais profunda sobre como e quando o projeto planeja comercializar seu produto durante a fase de desenvolvimento. Do meu entendimento da proposta (corrija se eu estiver errado), os $5000 x 6 significam 5000 dólares gastos em marketing durante o período de 6 meses. Esses 6 meses são os últimos (meses 12-18) ou estão além desse escopo? Com esses detalhes no plano de orçamento, aumentaria a transparência e a credibilidade da proposta. Outro aspecto que seria benéfico é incluir uma breve apresentação dos membros da equipe e de quem está trabalhando no projeto (supostamente 2 membros da equipe, de acordo com os comentários). Cardano Budz é um projeto um tanto conhecido da NFT, mas que não fala da experiência das equipes com o cultivo ou o marketing da Cannabis. Uma sugestão seria incluir alguns links para verificar melhor a competência e experiência dos membros da equipe (perfis LinkedIn, Github, projeto NFT etc.) relacionados com a proposta. Devido às razões explicadas acima, discordo que seja altamente provável que esta proposta seja implementada com sucesso.", "q1r": 2, "q2": "A proposta inclui entregas claras durante um período de tempo estimado. Como foi dito em manchetes anteriores, seria altamente benéfico se a proposta também incluísse um plano detalhado de marketing neste. (Assumindo que a proposta leve o marketing em consideração, uma vez que faz parte do plano de orçamento). Se algumas medidas de sucesso (KPIs) fossem adicionadas em conjunto com o roteiro e os marcos (por exemplo, por esta altura estamos objetivando atingir x quantidade de empresas de distribuição parceiras, e x quantidade de anúncios em nossos canais de mídia social), a proposta se tornaria ainda mais forte.  \r\nEu também gostaria de ter uma explicação de onde a comunidade pode acompanhar o desenvolvimento e o progresso do projeto (twitter, instagram, youtube, página dedicada à comunidade?) a fim de aumentar a transparência. Finalmente, uma pequena discussão sobre os riscos e desafios potenciais, desenvolvendo a tensão, apontaria para uma compreensão profunda do processo para a equipe, especialmente se ela fornecesse soluções potenciais para estes desafios (O que aconteceria se eles se deparassem com problemas durante a fase de refinamento, como a equipe pretende resolver acontecimentos inesperados?) Concluindo, discordo que esta proposta me forneça informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 19, "ne": 12, "ng": 5, "nfo": 2, "vca_o": 2}, {"q0": "To a certain extent, it fulfills the Challenge Brief in that it does not fit into other challenge settings... but, I am not sure it is an interesting project for Cardano.  And, in my humble opinion, does not really have to do with Cardano.  And I am a cannabis enthusiast. ", "q0r": 2, "q1": "Given the experience and plan presented, I am not sure at all that the project would be implemented successfully.  There are no substantial details about the 'team' and their qualifications (what does 'IT Expert' really mean?), and asking for 50% of the total budget of the Challenge amount is excessive.  ", "q1r": 2, "q2": "I am not sure what KPIs are here... There is a 'roadmap' for the growing process, but nothing else related to the 'success' of the project in relation to Cardano and its ecosystem. We dont even see the 'mascot' that has received positive attention. Hmmm... I feel like there is a lot more work to do in shaping this idea, and nailing down the relevance to Cardano. Sorry. Just my opinion.  I suggest the team looks at a more specific way to tie it to Cardano, scale back the budget while looking for other sources of backing for getting the growing process going, and create a 'step by step' timeline, aligned with budget (asking for further funding in subsequent funds!), show us more about the cNFT part of the project/ideas, and see where this can go in the future.  ", "q2r": 1, "assessor": "z_assessor_210", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Bringing Cardano to many people in many different fields for Blockchain to come to life is a necessity. But in this proposal the team wants to grow cannabis to introduce Cardano to cannabis buyers. In my opinion this poposal doesn't make too much of an impact for Cardano, cannabis buyers and the community. Because I have yet to see a proposal that outlines any connection between cannabis buyers and Cardano other than their interest in blockchain.", "q0r": 1, "q1": "\"The team behind this proposal does not specify how many people they have on the team and each person's specific experience. So it is difficult to know if they have the ability to implement this proposal or not.\r\nThe team also has no experience with blockchain and Cardano so I don't know how they are going to introduce Cardano to cannabis buyers.\r\nAll funds raised for the proposal are used to grow cannabis without mentioning the money to promote the development of Cardano and Blockchain is unreasonable.\"", "q1r": 1, "q2": "\"This Proposal only deals with growing cannabis and selling it to the market without mentioning the sharing of Cardano and blockchain to cannabis buyers as desired by the project, so it is almost impossible to know the success of the proposal. .\r\nIn addition, We also cannot check the amount of money granted to the proposal to grow cannabis successfully\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about creating the first Blockchain Strain, called \"Cardano Bud\". This is a great idea and convincing in certain dimensions. However, the impact on the Cardano ecosystem as a whole is unclear. Therefore, based on the given information, I disagree with this proposal's impact, I can rate it with a score of 2", "q0r": 2, "q1": "In terms of feasibility, I am not convinced by the proposer profile since it is not clearly described. Besides, the roadmap remains quite abstract, without any KPIs.  The budget structure is clear with explanations of the calculation base for each item. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "For better auditability, the following information should be added:  measurable KPIs/ Metrics. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "What am I reading here? One proposal wants to bring the image of cannabis to the blockchain world. Blockchain is decentralized, anyone can access it anytime, anywhere without any control. Marijuana or synthetic drugs are destroying the young generation and leaving many consequences. I think this proposal will have a very bad impact on the entire community. It may have a positive impact on the community of cannabis addicts, but what the world needs is not the addicts of the future.", "q0r": 1, "q1": "Although the proposer may have a good reputation in the community. But with a sensitive nature and can cause harm to the community as I mentioned. I assess this proposal completely unfeasible", "q1r": 1, "q2": "I highly recommend that we dont need audit\r\nthis proposal. Because it is feasible and may harm\r\nthe community", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Living in the Netherlands I think this a nice idea. But to link Cardano to a new cannabis strain, funded by Cardano could also have negative consequences for the reputation of Cardano and its Community. Some might use it now and then, but the product should represent the core values of Cardano. I think cannabis would not be right product. There are coins specific associated to cannabis I think they might be more interested in/ suitable for this concept", "q0r": 2, "q1": "Technically it is possible to grow a new strain, but given the considerations above I think linking cannabis to Cardano will not help Cardano in its reputation. Therefore implementation will be counterproductive. ", "q1r": 2, "q2": "It is not clear which strains you are planning to use in the beginning to create a new one. In general the idea and the how is clear and monitoring the progress should be possible, but think the idea in essence it not suitable", "q2r": 3, "assessor": "z_assessor_909", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "A equipe do Sindicato Digital, proprietários do Cardano Budz, estão procurando criar a primeira Tensão de Cadeia de Bloqueio, chamada \"Cardano Bud\".", "experience": "Criador do cNFT, ligado à cultura da Cannabis.  Cultivador anterior de canábis.  Especialista em TI."}