{"id": 383207, "author": "chrisr", "title": "WILD NFT", "url": "https://cardano.ideascale.com/a/dtd/383207-48088", "category": 26248, "amount": 58000, "description": "As NFTs que suportam o ambiente natural estão subdesenvolvidas. Existe uma grande oportunidade para as NFTs que ajudam a proteger os ambientes naturais e os animais.", "funded": 0, "upvotes": 16355369, "downvotes": 19596400, "votes_result": 3241031, "votes_cast": 85, "f6_no_assessments": 4, "f6_rating": 3.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A declaração do problema é apresentada de uma forma razoável e clara, e em alinhamento com o resumo do desafio, uma vez que não há um desafio que esteja fortemente focado nas NFTs este fundo. Atualmente, existem numerosos mercados de NFTs, mas não muitos têm enfatizado casos de uso fora do aspecto da arte. Ainda menos decidiram concentrar-se no apoio e bem-estar dos animais e do meio ambiente, tornando (na minha opinião) a direção da proposta atraente e uma contribuição única para o ecossistema Cardano.  Do meu entendimento, a proposta tem o potencial e a intenção de trabalhar tanto em nível local quanto global, convidando tanto organizações, membros da comunidade e investidores varejistas a se envolverem no projeto. Como declarado na proposta, o projeto tem o potencial de ser variado em muitos níveis diferentes, de organizações a indivíduos em todo o mundo. Especialmente quando focado em um tópico que é altamente relevante e tem um amplo espectro, a sustentabilidade. A proposta também inspira um amplo conjunto de casos de uso dentro do mesmo tópico, dentro da mesma plataforma que você poderia escolher para apoiar uma espécie ameaçada de extinção (talvez através de parceria com uma organização) ou apoiar o abrigo animal local em sua cidade natal. A escala da proposta é enorme, o que pode explicar a quantidade substancial de financiamento. Concordo plenamente que esta proposta trata efetivamente do desafio.", "q0r": 5, "q1": "Os 7 membros da equipe principal cobrem uma área impressionante de especialização complementar e experiência na área relacionada à proposta. Tanto da perspectiva de serem membros ativos e contribuintes do ecossistema Cardano, como de terem décadas de experiência no trabalho no campo do desenvolvimento ambiental e dos direitos dos animais. Informações suficientes sobre cada membro da equipe são fornecidas através de seus respectivos perfis no LinkedIn. Tendo já passado pelo processo de criação de uma plataforma funcional (DignifID), está aumentando a confiabilidade e credibilidade da equipe.\r\nComo dito anteriormente, o orçamento é bastante substancial sendo um pouco mais de 20% do orçamento total do desafio, mas faz sentido considerando que o proponente quer lançar um portal web NFT de cunhagem multilíngüe (adição fantástica) E um portal web de mercado multilíngüe dentro do prazo de 3 meses (Mais sobre isso depois). A alocação do orçamento é apresentada de forma clara, e o fato de que sua plataforma previamente criada (DignifID) está ajudando a cobrir os custos do lançamento me leva a acreditar que a equipe planejou mudanças bruscas na alocação do orçamento.\r\n\r\nO plano de projeto de 1 ano é apresentado de forma clara e estruturada, mas eu gostaria de ter visto informações mais detalhadas sobre as diferentes etapas do plano. Adicionar informações sobre onde está atualmente o processo de criação da plataforma e da ferramenta tornaria mais fácil avaliar a viabilidade da proposta. Das informações fornecidas na proposta, presumo que o desenvolvimento esteja em andamento, mas seria bom ver alguns esclarecimentos adicionais incluídos na proposta. Uma adição que beneficiaria muito a proposta é uma repartição mais detalhada das dotações orçamentárias. Por exemplo: Quantas pessoas estarão trabalhando em marketing externo e serviço de comunicação, quantas horas de trabalho por semana? Quantos membros ativos da equipe estarão trabalhando no projeto e por quanto tempo? A alocação do orçamento é bastante clara, mas uma estimativa do escopo do horário de trabalho deve torná-lo ainda mais claro, na minha opinião como Conselheiro Comunitário.\r\n\r\nAlém disso, como é o alcance? A proposta dá uma dica de contratos em andamento com os atores associados através de sua plataforma anterior (DignifID), mas não está claro se eles pretendem usar suas conexões de antes ou se precisam de uma base de conexões completamente nova. As informações fornecidas me levam a acreditar que o principal alcance será através de organizações no início, e depois estar em contato com as pessoas através delas. (O que em si é uma idéia bastante inteligente). Em geral, concordo que esta proposta será implantada com sucesso.", "q1r": 4, "q2": "A proposta inclui um roteiro com marcos incluídos, apresentados de forma clara e compreensível (com 3 meses, 6 meses, 12 meses como prazos). A fim de aumentar a audibilidade, o proponente poderia ter acrescentado alguns KPIs e métricas que ajudariam as pessoas fora da organização a entender melhor se os marcos são alcançados ou não. Por exemplo, quantos usuários o projeto espera hospedar após 6 meses? Quanto da receita do NFT é alocada para a proteção dos animais e do meio ambiente, e qual é o tráfego esperado após 3, 6 e 12 meses de atividade? Está concentrado na expansão global imediatamente ou existe um plano de expansão ou desenvolvimento a partir de algumas áreas/organizações locais?  Acredito que a resposta a estas perguntas convidaria a comunidade a auditar o processo de crescimento de forma mais clara.\r\nA fim de aumentar ainda mais a confiabilidade e credibilidade da equipe e da proposta, eu teria gostado de ver uma lista de riscos e desafios potenciais. Do meu entendimento do espaço NFT, ele está cheio de organizações e artistas que cunham NFTs com temática animal. Como o proponente planeja enfatizar ao máximo seu ponto de venda único (sustentabilidade, meio ambiente e bem-estar animal), a fim de se separar dos 'Macacos entediados' ou 'Animais pedrados'? Há um grande potencial na idéia e valores por trás deste projeto, e eu gostaria de ter visto exemplos de como este projeto enfatizaria os fortes valores centrais por trás do produto. Em geral, concordo que esta proposta me fornece informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 18, "ne": 13, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "For an outsider is difficult to understand the meaning of the following statement \"delivering verifiable wellbeing & sustainability\" and this should be the output of a market place when NFTs are sold/bought (previously minted). The NFT ecosystem has evolved at a fast pace during this year on Cardano blockchain. Why would WILD NFT make a (big) difference comparing with the other mature platforms? Also another question that could arise is: there is a demand for this kind of NFT? \r\nAiming to be globally recognized the project faces an outstanding challenge, and the information provided make it somehow unstable on its path to success.\r\n\r\nThis proposal doesn't fit in the challenge objectives as it looks to fit well in F7 DApps & Integrations Campaign", "q0r": 2, "q1": "The proposer presented the team members and their roles in the team and each one seems to have a vast experience in at least one of the following fields: business, marketing, science and not the least there is already a NFT minting platform.\r\n\r\nChecking the website (nft-maker.io) there is statement about the quantity of minted NFTs and the revenue they produced but with just a few trails in support of this, thus making difficult to evaluate the declared success.\r\n\r\nThe budget is outlined and broken down into identifiable items but some of them are difficult to be evaluated (\"Minting Platform and Market Exchange design with multi-language interface - is not clear what are the components of this stage and if the design stage starts from scratch, and also if the the multi-language feature will be automated (translate service) or the translations are made by humans).\r\n\r\nThe proposal provides a conductible plan for implementation that shows only what is being done but lacks to describe how is done. (see above)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation (risk awareness is an important aspect of any business)", "q1r": 3, "q2": "KPIs/metrics are not defined to define the path of success. There are some statements (\"Users will visit the web portal\" - why? how many? how many will come back/stay after first visit? etc.) that looks more like a desire than something that can be measured.\r\n\r\nReading the proposal the impression is that there is too much hype and overconfidence and less realistic and viable facts to sustain the implementation of the project.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 21, "ne": 4, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal could possibly fit under: Daaps and Integrations, as it would be something that bring value to end users and attract new people to cardano.", "q0r": 3, "q1": "They have a highly experienced team with well rounded experience. They also state they have an NFT tech partner. They also have experience in digital IDs for animals which translates directly into what they're seeking to do.", "q1r": 5, "q2": "They did provide a proper breakdown of their KPIs and their roadmap, but this proposal would benefit from more details on how the funds will be spent we can audit efficiently.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is an interesting use of NFT's to help conservation and animal shelter care. However, the proposal doesn't really explain how it will help conservation. They seem to focus mostly on animal shelter and their well being and less on endangered species.  ", "q0r": 4, "q1": "The team has valuable expertise in NFT and marketing. However, the budget allocated to communication seems very low to educate potential NGO's, animal shelter or conservation organization to adopt the project and create new NFT's. the proposal needs to explain more about who are those  credible auditors to verify and attest wild NFT. The road map presented here lack of clear KPI's. ", "q1r": 4, "q2": "The proposal is interesting with a strong team however more information is needed to audit adequately the proposal.", "q2r": 3, "assessor": "z_assessor_761", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "A WILD NFT é uma plataforma de classe mundial de cunhagem/mercado NFT que proporciona bem-estar e sustentabilidade comprováveis para ambientes naturais e animais.", "experience": "Fundamos dignifid.org, uma organização sem fins lucrativos que fornece identificação digital para apoiar o bem-estar dos animais e do meio ambiente. NFT Maker Pro é nosso parceiro tecnológico."}