{"id": 384245, "author": "ccadminteam", "title": "CC Admin Team Scope Expansion", "url": "https://cardano.ideascale.com/a/dtd/384245-48088", "category": 26248, "amount": 15000, "description": "Sem financiamento contínuo, a equipe administrativa da CC não pode cumprir seu papel de apoio às funções e operações do Círculo Catalisador.", "funded": 2, "upvotes": 71195689, "downvotes": 3205952, "votes_result": 67989737, "votes_cast": 179, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Catalyst Circle admins have proven their usefulness and should probably be remunerated for their work. How much value this creates and how much it advances Cardano is questionable, however. At the same time there are dozens of facilitators and secretaries that keep the Catalyst going, completely voluntarily.", "q0r": 3, "q1": "CC Admin Team is fully capable of making this happen, should they be funded.", "q1r": 4, "q2": "The budget breakdown and deliverables are clearly written. Auditability is easy. The only question mark I have the timing of the roadmap. Here it ends in March 2022 although, if granted funding, the funding only starts in March 2022.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "The Catalyst Community is likely to mature as Catalyst projects' de facto control group for Catalyst projects. Paying the admins will enable scrutiny and professionalize the setup bringing in better accountability. Therefore the proposal addresses the vital challenge. ", "q0r": 5, "q1": "The proposal is by the current team which has established community credentials. Therefore it is apparent that the team will be able to complete the proposal in the best possible manner. ", "q1r": 5, "q2": "The fund requested is very reasonable when compared with the deliverables. The task and scope for each appointment have been clearly laid down. In order to have a sustainable admin team who can contribute professional time to the Community, this is a mandatory requirement. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This is an important aspect of the Catalyst process itself. At the moment, information is hard to find and there is a lot of disorientation. People who work with this full time is needed! ", "q0r": 5, "q1": "There is not much evidence that the proposers have relevant experience and ability to successfully make this plan a success. The main pitfall would be that they fail in the recruitment of competent facilitators or secretaries. This is a low probability event though.\r\n\r\nFeedback. Try to emphasise your ability to execute the plan a bit more rather than merely presenting exactly what you aim to do. This would give 5 stars.  ", "q1r": 4, "q2": "The metrics prsented are very clear and easily tracable given that we have regular townhall meetings and there is a PS channel for Catalyst Circle for progress updates. \r\n\r\nFeedback. Perhaps creating a public Notion page, where weekly updates can easily be found would be desirable, similar to how the projectcatalyst.org team has done it! ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about providing remuneration for the CC Admin Team to support the functions and operations of, and transitions between the Catalyst Circle. This is a great and meaningful idea. The Catalyst Circle plays an important role the Cardano's Governance as a whole. The problem is clearly described, and explained in detail. The solution is clearly defined showing a clear impact on the Cardano ecosystem in long term. Therefore, I strongly agree that this proposal effectively addresses the challenge, and can rate it with a score of 5", "q0r": 5, "q1": "Proof of feasibility from the team profile can be seen. The budget is provided with a clear items structure, and explanations of the calculation base. Risk is clearly defined but without any mitigation. Therefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4", "q1r": 4, "q2": "For better understanding, the team profile should be described more in detail with reference/proof (documents/links,...) for varifying. Based on the given information, I  agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The problem being Catalyst Circle admin team not able to perform it's role  in supporting the functions and operations of the Catalyst Circle without the funding the proposer wants to resolve it by Providing remuneration to \r\nCatalyst Circle admin team to continue functions and operations of Catalyst Circle hence addresses the problem effectively", "q0r": 5, "q1": "The team consist of Catalyst Circle Admin Team they have been working hard to make sure operations of the Catalyst Circle is run smoothly. They have given a clear plan and detailed roadmaps on how the proposal will help the Catalyst Circle Admin Team and the budget given seems justified therefore it is very likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposal consists of a detailed budget distribution and have KPIs which will be helpful to audit. They have provided a clear step by step roadmap with a timeline. All these information will be enough to track the proposal successfully ", "q2r": 5, "assessor": "z_assessor_937", "no_vca": 21, "ne": 3, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "Fornecer remuneração para a equipe administrativa da CC para apoiar as funções e operações do Círculo Catalisador, bem como as transições entre os mesmos.", "experience": "A Equipe de Administração do Círculo Catalisador (CC Admin Team) é composta por membros motivados e ativos da comunidade de diversas origens"}