{"id": 384588, "author": "nftdao", "title": "Near Field Query tap authentication", "url": "https://cardano.ideascale.com/a/dtd/384588-48088", "category": 26248, "amount": 35000, "description": "Os métodos atuais de anti-falsificação são ineficazes e têm lacunas;\nA cadeia de bloqueio precisa de uma integração sem esforço da torneira para melhorar a adoção.", "funded": 0, "upvotes": 19382082, "downvotes": 22003117, "votes_result": 2621035, "votes_cast": 92, "f6_no_assessments": 4, "f6_rating": 3.6666666666666665, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=12515"], "media": [], "f6_assessments": [{"q0": "Counterfeit identification using near field tags id stored in Blockchain can provide a means to check the authenticity of high-value items. There seems to need to develop low-cost sensors/devices to encourage the adoption of this technology on a large scale. ", "q0r": 4, "q1": "The proposer has substantial experience of more than 20 years in the industry. The Github repo of the CTO is sparse. There are significant design and adoption challenges in this project, and a motivated team is required to pull it through. ", "q1r": 4, "q2": "The budget is basically for the pay of the developer at the rate of $20 per hour and for the Glow integration. If the code is developed in an \"open source\"  manner auditable and progress will be difficult to measure.  ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "I believe that the proposal partially addresses the conditions posed by the challenge, since the solution is one of two components -a physical interface to interact with the blockchain- that will be complemented by the sister proposal linked under the Dapps and integrations challenge, which refers to a digital asset management dapp. However, I think that given the current information, it is difficult to assess the impact that this development alone could imply for Cardano.\r\nIn general, if successfully developed, the solution could function as a means to facilitate the integration of physical assets with the blockchain, however I believe that this component should be considered as a decisive aspect for the implementation of the Dapp, and not as a standalone element.", "q0r": 3, "q1": "Given the experience referenced as well as the technical background of the team, I agree that it is likely that this proposal can be successfully implemented.\r\nOn the other hand, milestones are provided for three, six and twelve months, but no detailed plan is presented as to how each of these objectives will be achieved. Given that some of them are very ambitious - including securing a deal with a world-class company and create a new standard for product authentication - I would appreciate more detail to conceptualize the full product journey and thus better understand the competitive advantage that the complete system could have over other existing solutions in the market (such as VeChain). A flowchart on the interactions of the solution with other devices, mockups of the desired look and feel, or even prototypes of what the NFQ tag might look like, could help CA's and voters better understand the vision of what this project is trying to achieve.\r\nTo conclude, should this proposal get funding I recommend following up jointly with the sister proposal under the \"Dapps and Integrations\" challenge, as the former cannot live without the latter. \r\nHowever, if only the Dapp is funded, it could be integrated with other widely established solutions such as those mentioned in this proposal (QR codes, barcodes, etc.).", "q1r": 4, "q2": "It seems to me that auditing the progress of this initiative will be challenging as the intermediate steps of the major milestones need to be much more detailed.\r\nAs mentioned earlier, the project objectives are very broad, but the criteria for measuring success are not sufficiently clear.\r\nI also found it difficult to validate the background and expertise of the Paystars proposed key partner, as I could not find any information online about their previous ventures.\r\nI understand that the funding requested here covers only the most initial aspects of the development, but that is why I consider that the project would benefit from a much more detailed business plan, establishing more detailed goals.", "q2r": 2, "assessor": "z_assessor_883", "no_vca": 18, "ne": 5, "ng": 8, "nfo": 5, "vca_o": 1, "reply": "We decided to split the proposals because of the nature and divide from completely software and the hardware that serves as a foundation. These are two distinct ideas that couldn't be properly represented in one single proposal. In the same regard, if we get one proposal funded and not the other, the development of the system could go on. If we put all our eggs in one very competetive basket, a failure of the proposal would mean no funding at all from Catalyst. Therefore the Misc Challenge is where our hardware proposal was placed to mitigate risks and to better represent that aspect of our system. For the assessor to knock points off because of how they felt about that decision isn't very objective.\nOur aquisition and roadmap are complimented by the detailed plan to provide the steps needed to get to our 12 month goals. We don't have a perfect understanding of how this will work until we get into the devolopment. Therefore, we cannot provide exact specifics without the risk of giving too short ranged of information that is still very malleable and flexible. I agree with the desire to have a mockup of the system and proof of concept videos and such, but we are simply not at that stage of development yet. Our monopoly section should provide understanding of our advantage on the hardware aspect.\nAs this is our first proposal, the roadmap goals of 3 and 6 months are our best understanding of what and when needs completed to accomplish our goal with how it is related to this Catalyst funding. Since this is still in the very early developing stage, the order of development of specific functions has not yet been finalized. To overpromise and underdeliver because another function's development happens first or is drawn out over several months is not very plausible and would be misleading to Catalyst and the community. Our goals are stated along with the expected timeline of development. When this project is funded we can supply a more broken down progress map as our understanding of necessary order will be much better at that time. That being said, at the moment of writing an accurate monthly breakdown is not possible based on our current understanding, planning, and nature of the project. (copy and paste because they are exactly applicable.)"}, {"q0": "Counterfeiting is a huge cost and this presents a simple solution, tap an NFQ tag and be directed to an NFT to prove authenticity. This brings value to the Cardano blockchain in luxury brands using Cardano and minting NFTs to certify their products authenticity. Beyond that, integration with and execution of smart contracts via a simple tap presents huge possibilities in use cases, all executed on the Cardano blockchain.", "q0r": 4, "q1": "Team appears to have necessary expertise, good backing from organisations, and sensible plan to outsource one of the bigger technical risks to a sensible 3rd party.\r\nFunding seems sufficient to obtain an MVP to approach investors with. Continued growth of the project beyond that is at risk without further investment but providing there is a high quality MVP, it seems like finding VC or a pilot company should be easily achievable. \r\nRoadmap appears to be reasonable in time frames, perhaps a bit ambitious to sign a deal with a multibillion dollar company within 12 months unless there are connections not mentioned here but that is beyond the timeframe of this funding to create an MVP\r\n", "q1r": 4, "q2": "No KPIs considered in the proposal, roadmap only provides quarterly targets. It would be good to break these down into monthly targets for easier progress tracking. ", "q2r": 3, "assessor": "z_assessor_902", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "I'd say this proposal is a perfect candidate for the miscellaneous challenge:  electrical engineering, radio communications, cyber security, material science, business development....and still, it would have a big impact in the Cardano ecosystem.", "q0r": 5, "q1": "The proposer seems to have a well thought out plan, and the team include necessary skills for the project completion. They have also identified (and budgeted) the external partners they'd need to collaborate with. \r\nThey also have a plan to finance the continuation of the project beyond Catalyst funding. \r\nA concern for me is the mention of a \"star performer\" that is highly praised in the proposal, and whose skills are supposedly supported by a GitHub profile created a few days ago, and with almost no content. I'm a developer myself, and know it's often not possible to share code, due to copyright restrictions, but including the GitHub profile in this case looks fishy. ", "q1r": 4, "q2": "A somewhat detailed roadmap and timelines are provided. No KPIs are identified, but considering the unique characteristics of the project, I'm not sure if it'd be possible to quantify progress. There are also obvious challenges for the community to track progress beyond whatever updates the team shares. ", "q2r": 3, "assessor": "z_assessor_941", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Uma etiqueta infalível NFQ personalizada para fornecer um meio de toque seguro e verificável em: cadeia de bloqueio, NFTs, contratos inteligentes, e soluções de pagamento.", "experience": "5 anos em empresas elétricas e de software.\nLeitor NFC construído e aplicativo Android para abertura de portas.\nSteve Lupien: Mentor c/ RFID/Blockchain exp."}