{"id": 384832, "author": "andreas.kirchner", "title": "Staking for Children", "url": "https://cardano.ideascale.com/a/dtd/384832-48088", "category": 26248, "amount": 200000, "description": "Queremos que as famílias apostem seu dinheiro.\nAs famílias perdem em média 1000 euros por ano com contas bancárias a juros baixos.\nComo podemos apoiá-las?", "funded": 0, "upvotes": 19102750, "downvotes": 30037257, "votes_result": 10934507, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Seria ótimo ter um brinquedo de confiança para as crianças para ensiná-las a administrar uma conta bancária e a ganhar dinheiro através das tarefas domésticas. Esta proposta introduz um brinquedo para crianças e famílias que pode ser ligado a uma conta bancária e promove a alfabetização financeira. No entanto, como a equipe proponente planeja usar moedas estáveis para sua estaca, a equipe deve incluir como planejam introduzir o Cardano às crianças e famílias em seu programa educacional para torná-lo mais relevante para a comunidade e para os eleitores.", "q0r": 4, "q1": "A equipe tem um website em funcionamento que dá provas de trabalho prévio e tornaria a viabilidade desta proposta muito alta. Entretanto, há algumas partes da proposta, que não são muito claras. A proposta pede todo o fundo deste desafio, o que significaria que nenhuma outra proposta neste desafio receberia qualquer financiamento. A equipe alega que criou um monopólio para \"aprender a ganhar\", o que na verdade é um tema bastante comum em comunidades criptográficas que eu meio que gostaria que uma equipe de proponentes conhecesse. A própria equipe tem apenas um membro com experiência em criptografia e eles mencionam parceiros pedagógicos bem como empresas de brinquedos - mas eles não nos dão nenhuma referência para que procuremos isso. Portanto, se esta proposta é basicamente sobre criptografia e educação, a experiência relevante da equipe não corresponde a um projeto tão grande neste momento. O próprio site mostra um produto muito agradável e interessante, que conecta informações de contas bancárias de moeda fiat em uma ferramenta digital, o que soa muito bem. A equipe proponente deve deixar claro, como ela pretende fornecer opções de pagamento e conectar o staking e a banca com moedas criptográficas através de contas bancárias européias, uma vez que isto ainda não é comum. A coisa mais importante que me falta nesta proposta é \"riscos\". A alfabetização financeira é importante e, se a equipe estiver voltada para as famílias e crianças, a ferramenta mais importante seria deixar-nos saber, como comunidade, que eles estarão incluindo os riscos de pagar com criptografia, bem como investir com criptografia e impostos criptográficos. Eu realmente acho que este projeto seria realmente ótimo se ele utilizasse uma ferramenta onde as crianças pudessem negociar com papel ou qualquer outra forma não real de aprender como gerenciar uma conta com moedas criptográficas e DeFi. No momento, o site parece se concentrar em ensinar às crianças como administrar o dinheiro de fiat e suponho que a equipe gostaria de incluir informações sobre moedas criptográficas e moedas digitais. O que é ótimo, mas a proposta é de certa forma pouco clara e está faltando riscos relevantes que deveriam ser considerados. O roteiro fornecido é muito confuso e inclui rodadas de financiamento adicionais, bem como o financiamento de multidões.", "q1r": 3, "q2": "A auditabilidade não é fácil, pois se trata de um grande projeto com muitas etapas e o roteiro e o orçamento são confusos e incluem financiamento adicional que ainda não está assegurado. A equipe não elaborou sobre os riscos deste projeto, se não for assegurado financiamento suficiente para construir o produto previsto. A equipe não incluiu uma avaliação dos riscos que estão envolvidos para as famílias e obviamente para as crianças ao pagar e investir em criptografia. É difícil fixar os passos da proposta, já que se trata de educação, criar um stakepool, incorporar novas famílias a esta marca, desenvolver e produzir um wearable para que as crianças possam gastar dinheiro com e assim por diante. É também neste momento um projeto em desenvolvimento que se concentra no fiat money - a equipe deve fornecer mais informações sobre como planeja incluir e diferenciar entre fiat money e moedas criptográficas....", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "\"The idea of teaching kids to save money with cryptocurrency and using staking to get interest for the financial future of children in the family is a great one.\r\n\r\nBut when I read this proposal I see that the proposer who is looking for a 200,000ADA fund has exceeded the budget of this challenge. With the impact that the proposal brings is not too much, but it does not seem reasonable to need such a large amount of money\"", "q0r": 2, "q1": "\"I found the proposal to show the relevant experience of team members in a very general way and not specifically how many people the team has, what is the specific experience of each person.\r\n\r\nBesides, the proposer has not shown us a specific plan for what they will use the funds for, how many families and children they aim to help and how much money the children will save. How much is through the application of the proposal.\r\n\r\nPlus, their app is currently connecting with traditional banks. Proposal also hasn't laid out how to integrate Cardano's wallet into the app and how to encourage people to use crypto instead of fiat.\"", "q1r": 1, "q2": "\"Proposal does not have a specific plan for all that the proposer writes in the proposal. We have absolutely no idea what they used that money for and how to use it to achieve what results. Therefore, it is almost impossible to audit\r\n\r\nSo, i think proposer should have a specific plan with a specific target like: amount of money children will save in this platform.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Definitely a unique proposal for the Cardano blockchain. Teaching kids and giving them early adoption of financial education is a privilege as previous generations lack of incentives like this during their childhood. Moreover, the proposal fits into dApps & intergration, I think. The solution given is a good way to also teach children about the innovative prospect of the digital age towards finance and its values.", "q0r": 5, "q1": "I do believe the future of cryptocurrency will be the young pioneers of tech and given opportunities to the youths. The roadmap of the proposal is well delivered, and the website have already given confidence for voters for this proposal to move forward. Though, risks to be addressed, and management are not prepared, but the proposer have presented its detailed business model and sales strategy for this project.", "q1r": 4, "q2": "The proposal is complete and solid enough to understand what the vision is, along with the overview of how the finny app works from the video attached. Budget allocation is well planned and key metrics and milestones for the proposal are clear. Therefore, I think it does add value to the current diverse community of Cardano.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Cardano é PdS. Com moedas estáveis e recompensas de aposta, vamos oferecer um incentivo para economizar dinheiro. Deixemos as famílias com crianças darem os primeiros passos na DeFi.", "experience": "Somos uma empresa de Alfabetização Financeira com 3k usuários\nTemos parceiros pedagógicos para desenvolver uma solução\n1 Co-fundador tem know-how em Crypto"}