{"id": 384886, "author": "pmcl77", "title": "NFT Vetted Calendar", "url": "https://cardano.ideascale.com/a/dtd/384886-48088", "category": 26248, "amount": 29000, "description": "Na enchente de novos projetos NFT, é demorado e difícil decidir em quais projetos NFT são sólidos e valem a pena investir.", "funded": 0, "upvotes": 16653759, "downvotes": 23291178, "votes_result": 6637419, "votes_cast": 89, "f6_no_assessments": 3, "f6_rating": 1.7777777777777777, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is to \"build a solid team that takes on the task of researching hundreds of projects every week\". This is a centralized and many people generally avoided these centralized research reports and in finance, it is always better to DYOR.", "q0r": 3, "q1": "The proposer claim experience in NFT research and web development. References to his research reports would have enabled better assessment of the proposal. ", "q1r": 3, "q2": "It isn't easy to estimate the audutablity of research into NFTs. It is highly subjective and personal, as per my belief. Therefore, I believe it will be difficult to measure the success too. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "\"Creating a place to gather good NFT projects is a great way to help the community avoid scam projects and spend more time on good projects. A great idea.\r\nBut I don't see the proposer offering a specific product to solve this problem. It's all just an idea.\r\nTo be able to create a product that can solve the problem proposed by the proposer. The team should come up with a specific solution and plan to answer questions such as:\r\nWhat are the criteria for NFT projects to be good projects?\r\nHow to find information of NFT projects and aggregate them?\r\nWill the team update information about NFT projects, using bots, AI, or the strength of the community?\"", "q0r": 1, "q1": "\"The relevant experience of the team members proposed by the proposal is NFT research & trading, web development, community engagement. But I don't know if this is one person who has all these experiences or how many. There is no number of members. No information. No link to prove.\r\n\r\nThis is just an idea without a specific plan, roadmap, timeline, so the proposal is almost impossible to succeed.\"", "q1r": 1, "q2": "\"No plans\r\nNo key metrics\r\nNo budget breakdown\r\n\r\nNo information has been provided on what will be produced by when so this is not a project than can be audited.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 3, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The main point of this proposal is to provide a vetted drop calendar and articles, where only research projects that fulfil certain criteria will be included. Because this proposal is not completed [since there is no roadmap, KPIs/metrics, and budget breakdown,...], the solution is still very abstract, not a clear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer's experience is briefly described as NFT research & trading, web development, community engagement, however, there is no proof/external link for verification. Besides, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I disagree that it is highly likely that this proposal will be implemented successfully, and would give it a score of 2.", "q1r": 2, "q2": "This is an incomplete proposal (since there is no roadmap, KPIs/metrics, and budget breakdown,...) where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Forneceremos um calendário e artigos vetados, onde somente serão incluídos projetos pesquisados que preencham determinados critérios.", "experience": "NFT pesquisa e comércio, desenvolvimento web, engajamento comunitário."}