{"id": 385048, "author": "amolagg", "title": "AI in geological analysis", "url": "https://cardano.ideascale.com/a/dtd/385048-48088", "category": 26248, "amount": 8000, "description": "As técnicas atuais de Análise Geológica são invasivas na natureza e muito expensas.", "funded": 0, "upvotes": 16938466, "downvotes": 22524386, "votes_result": 5585920, "votes_cast": 95, "f6_no_assessments": 5, "f6_rating": 1.2, "videos": [], "media": [], "f6_assessments": [{"q0": "Este problema é de fato difícil de ser colocado em qualquer outro desafio que não seja o diverso, devido à sua natureza específica (trocadilho pretendido). A idéia central visa usar algoritmos de aprendizado profundo para expandir as formas de fazer análises geográficas não-invasivas. Seria altamente benéfico para a proposta incluir algumas informações sobre como isto seria relevante para o Ecossistema Cardano diretamente, e como a proposta visa a integração/utilização do Cardano. A proposta é muito brevemente explicada e precisaria de mais informações sobre o produto e o processo real para ser entendida e avaliada. Estes dois pontos-chave mencionados aumentariam a compreensibilidade do projeto e reforçariam a declaração do problema. Em minha experiência como Conselheiro Comunitário para vários fundos, ter uma conexão clara com Cardano junto com uma declaração clara do problema seguida de uma solução compreensível e detalhada é fundamental durante a elaboração de propostas. No momento, devido à falta de informações, é difícil compreender o escopo do projeto (prazos, marcos, custos, etc. Mas), mas chegaremos a isso mais tarde. Com base nestes aspectos mencionados acima, discordo totalmente de que esta proposta aborde efetivamente o desafio.", "q0r": 1, "q1": "A proposta poderia utilizar muito mais informações sobre o processo de desenvolvimento, juntamente com uma descrição sobre como as técnicas de análise geológica serão desenvolvidas e utilizadas, e qual é o seu impacto em contraste com as atualmente utilizadas. Não sou de forma alguma geólogo, mas tenho um pouco de experiência trabalhando como pesquisador, e sugeriria acrescentar mais detalhes na proposta para torná-la mais compreensível e tangível. Tanto para pessoas com conhecimento de domínio em geologia, como também para aquelas sem conhecimento. Também seria benéfico com uma apresentação do núcleo da equipe/proponentes que estarão trabalhando no projeto. Quantos anos de experiência com geologia a equipe tem, é composta de vários membros, o protótipo para análise geológica (mencionado em \"experiência relevante\") é utilizado hoje? Onde podemos saber mais sobre ele? O produto é destinado a ser utilizado com acadêmicos? Mais importante ainda, após responder a todas estas perguntas, eu sugeriria fornecer uma fonte verificável que possa fortalecer ainda mais a competência e a experiência dos membros da equipe. Talvez através do LinkedIn-profiles, universidades parceiras, etc. Finalmente, eu gostaria de ver um plano de orçamento mais detalhado incluído. Quanto dinheiro será usado para o desenvolvimento, materiais, etc. E quantas horas de trabalho são estimadas do início ao fim (talvez por semana)? No total, devido à falta de informações necessárias, discordo totalmente que seja provável que esta proposta seja implementada com sucesso.", "q1r": 1, "q2": "Como mencionado anteriormente, esta proposta se beneficiaria muito com a inclusão de um roteiro com marcos em um período de tempo estimado. Desta forma, ela poderia ser auditada de forma transparente e a comunidade seria capaz de acompanhar o progresso durante o desenvolvimento (de preferência através dos canais de mídia ou do website do projeto). Algumas sugestões de perguntas-chave a serem respondidas: Quantos meses/anos serão necessários para desenvolver o protótipo inicial? Como ele será testado e por quem? Quanto tempo será a fase de teste e como será medido o sucesso (KPIs)? Além disso, o que acontece se algo inesperado der errado durante o desenvolvimento? Como a equipe pretende combater os potenciais desafios durante o processo? Ter um pequeno texto sobre as reflexões da equipe incluídas na proposta sobre estas questões fortalecerá a credibilidade e a perspectiva da equipe, e se estas reflexões forem compartilhadas com a comunidade, fortalecerá a confiança geral e a transparência de todo o projeto. Por causa das razões que acabamos de descrever, discordo totalmente que esta proposta me forneça informações suficientes em sua capacidade de avaliar o progresso na realização de seus objetivos declarados.", "q2r": 1, "assessor": "z_assessor_349", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The proposal is to sponsor research for a noninvasive Geological survey using AI. The proposal will contribute to Geology however its benefit for Cardano looks remote and may not address the challenge except to create goodwill in the Scientist community. ", "q0r": 2, "q1": "The proposer has one year of experience as a Deep Learning Engineer and had been an Interned at Google. This may not be sufficient for the proposed Research. High-end reserch will require academic guidance from a Univercity. ", "q1r": 1, "q2": "The proposal is to fund Research project for an AI-based Geological survey. There is no major plan presented and who will validate the research. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 0, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nThough the problem statement is clear, it does not seem to me like it pertains to Cardano. The solution, while it does address the problem statement, is too vague in my opinion and again it is unclear what the role of Cardano, or blockchain for that matter, would play here. A good proposal should always outline this, in order for non-technical voters to understand why it would be valuable to fund it. Due to this and the lack of any type of KPI or concrete goal, I have to strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposer claims to have 1 year of experience as a Deep Learning Enginner and to have interned at Google, but no references are provided to prove this. Please keep in mind that it is pretty much expected of all proposals now to provide at least a Linkedin profile, or something similar, where the community can see your relevant experience and background.\r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. Please keep in mind that these are all vital parts of a proposal.", "q1r": 1, "q2": "Unfortunately, no roadmap is provided, there are no KPI's and it is basically unclear what this proposal aims to do to better the Cardano ecosystem, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 22, "ne": 4, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about building a Non-Invasive Geological analysis system, highly efficient and accurate through Deep Learning Algorithms. It seems that this proposal is incomplete. The problem statement [current Geological Analysis techniques are invasive in nature and very expansion] is clear but not explained in detail. Conceptually, I think the proposed solution has a certain fit for the challenge. The solution is oriented towards building such a platform having satisfactory and has potential impact if completed. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "It's not easy to evaluate a proposal that is incomplete [limited information of experience, doesn't have any roadmap or KPIs, and of course the risk is not defined]. Therefore, definitely, there are no grounds to agree on the feasibility of this proposal, however, if I had to give one piece of advice, I think: in case it is necessary to complete this proposal in the next Catalysts in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals & target; (2) road map/timeline (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I strongly disagree with this proposal's feasible, and would give it a score of 1.", "q1r": 1, "q2": "For an incomplete proposal like this one, transparency can't be guaranteed. Therefore, I don't have much advice. Based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Thank you for your interest in natural matters. besides i would like to know the real problem you bring up is that we are going to have explicit concrete method in Geology. Do you want a method to protect nature or a clear method to exploit more effectively? When the problem is clear I think we can understand the effective method that AI will bring", "q0r": 2, "q1": "In terms of feasibility, I hope you can elaborate more on your personal profile as well as your team such as whether there is someone responsible for the financial or blockchain aspect. Also I hope you can show us the short and long term project roadmap. And the criteria you need to achieve in the future, I think it is necessary for your project. The nature of this project requires state permission as well as a high level of expertise in geology. Currently, many countries can already use AI for jobs ranging from geological measurement and analysis to real estate. This project will be more feasible if you have specific plans and clear roadmap. From there we can build from high community demand.", "q1r": 2, "q2": "In the roadmap I hope you can describe what value you want here, \r\nvì số tiền bạn chi cho AI là rất tốn kém. you require an investment of up to 8000$ which is quite a large amount.You should explain how you will use this money? For how long and how can people see you using it?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Através de Algoritmos de Aprendizagem Profunda podemos construir um sistema de análise geológica não invasiva, altamente eficiente e preciso.", "experience": "Foi financiado para desenvolver o protótipo de um Sistema Geológico.\nEngenheiro de Aprendizagem Profunda - 1 ano\nInternado no Google."}