{"id": 385136, "author": "udais", "title": "Carbon Footprint Ledger", "url": "https://cardano.ideascale.com/a/dtd/385136-48088", "category": 26248, "amount": 14000, "description": "Como podemos mitigar nossa pegada de carbono usando ADA e evitar a lavagem verde?", "funded": 1, "upvotes": 66550243, "downvotes": 23302303, "votes_result": 43247940, "votes_cast": 423, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement is using Cardano to reduce our carbon footprint and stop greenwashing. The solution suggested using a platform \"My Carbon Zero\" to calculate the lifetime carbon footprint and it also helps to send ADA to trusted projects. This proposal effectively addresses the challenge", "q0r": 5, "q1": "Depending on the information provided on the proposal they do have the required skills and experience in Carbon footprint calculators. The proposal consists of a clear execution plan and The break up of how and where the funds are to be utilized is fair and makes sense. Provided all the above information, there are high chances the plan will be implemented successfully", "q1r": 5, "q2": "The proposal consists of well laid out plan and the fund's allocation is clear. The team has provided information such as Key performance indicators, Definition of success, Roadmap with Milestone, and challenges With this ample information auditors can track the progress of the proposal and success of the proposal.", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 20, "ne": 3, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Impact\r\n* The Carbon Footprint Ledger proposal aligns with the F7: Miscellaneous Challenge, including Metrics & Goals: The challenge is designed to capture interesting and valuable projects related to Cardano that do not currently fit into other challenges. \r\n\r\n* Impact on Cardano: As articulated under the title \"MyCarbonZero Solution & Cardano\" the goal is to onboard an established application to measure carbon footprint and propose verified projects to support to become net zero. With the transparency & traceability of blockchain transactions on Cardano onboarding is increased through trust and reducing \"greenwashing\" so prevalent across our off-chain systems. The long term goal is to integrate \"the MyCarbonZero process with companies that could reach millions of users and have a big impact [on climate change]. This proposal not only impacts off chain issues & solutions, the Cardano blockchain, and the Project Catalyst community, by creating a user-friendly application, it takes impact to a whole new level by addressing climate change. This proposal contributes in a real & meaningful way to fulfilling Cardano's mission of \"Making the World Work Better for ALL.\"\r\n\r\n* Impact on Climate Change: According to the website, MyCarbonZero is creating \"a bridge between investors and small-scale, impactful carbon sequestration projects where 100% of carbon investments go to carbon projects, refusing to take a cut in order to maximize the carbon impact...\" With this proposal another user friendly bridge is being built from Cardano directly to companies and individual who support verified carbon projects. \r\n\r\n* Impact on the UN Sustainability Development Goals (SDGs): As indicated through their use of the SDGs proposal tool https://cardanocataly.st/proposer-tool-sdg/ made by Catalyst Community to assist in mapping impact. \r\n\r\n(6) I most strongly agree that this proposal effectively addresses the challenge and goes above and beyond the challenge by their efforts to impact climate change. \r\n\r\nThank you to this team for taking the time and making the effort to create a clear & understandable proposal.", "q0r": 5, "q1": "Feasibility\r\n* Team, including Skills & Experience: Four experienced members make up the team, including, Yoram, a keystone member of Cardano4Climate. Without his continued support, guidance and bar raising, this thriving community would only be wishful thinking. Scott Poynton's presence at the Catalyst Sustainability Goals Event has shifted my approach to climate change & has prioritized cooperation over perfection. In addition, for those who are familiar with the team members, the proposal provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal.\r\n\r\n* Budget Amount, Breakdown, Timeline & Plan for Additional Funding: The budget may be reasonable to achieve the set goals. The plan for additional funding \"is to generate revenue so we can sustain the growth.\" I am neither an accountant, nor familiar with the time it takes to complete the outlined tasks. I do not have a crystal ball to see into the future whether this proposal will reach each milestone on time as indicated. I am unable to verify whether or not the individual amounts are reasonable, conservative, or insufficient to accomplish the goals of the proposal. What is crystal clear to me is the continuation of steps already taken in the right direction to impacting the environment with the creation of a new business model around climate impact and scaling to include leading companies.\r\n\r\n* Resources both Off-Chain (Applications) & On-Chain (Technical): Project Catalyst, as amazing as it is, currently does not have the bridge to connecting/translating practical & impactful real-life applications to the technology being built on the Cardano blockchain. Nor do the tools exist yet to verify \"tech speech\" for the average person or off-chain community. We are in uncharted territory and the early adopters of world changing technology yet to become mainstream. As a dedicated community, we know from the Cardano roadmap that scalable, decentralized solutions take time & will be done thoroughly, based on research, tested, & implemented at the right time. Rushed solutions based on FOMO (fear of missing out) are bound to work in the short term and fail in the long run-much like we are seeing with climate change. I will look forward to the time we can swiftly onboard down-to-earth communities, by using tools designed to improve processes and user interfaces between virtual technology & practical reality. \r\n\r\n* Challenges & Risks are identified under \"Challenges.\" \r\n\r\nI am unable to rate the technical aspects of this proposal so my rating would be (4) IF I did not think outside the box, challenge the status quo & consider the impact of this proposal outweighing my personal shortcomings in understanding blockchain technologies. Therefore, I am \"borrowing the extra star from the Impact criteria. I feel this proposal is too important to fail due to my life experience.\r\n\r\n(5) is my overall rating for feasibility: It is highly likely that this proposal will be implemented successfully with passionate members of the Project Catalyst & Cardano4Climate community behind this team to help fill in any gaps that may or may not exist. ", "q1r": 5, "q2": "Clarity/Auditability\r\nMy opinion of & support for this proposal is clear. As I am in the process of learning the language of project management and still unsure of the terms KPI, Metrics & what success looks like, I may not have fully captured the requirements for these concepts to rate this as a fully auditable proposal.\r\n\r\n* Roadmap: is included in the proposal and as indicated in my assessment of this proposal for feasibility, through no fault of the proposal team, I do not have the experience nor knowledge to rate their roadmap. It appears to me to be logical & well-though out.\r\n\r\n* Metrics – KPIs: are succinct & listed below the title, \"KPIs & Success factors\"\r\n\r\n* Problem Description: Why? \"Carbon footprint mitigation is often associated with greenwashing as there is no transparency and traceability.\" The challenge? \"How can we mitigate our Carbon footprint using ADA and avoid greenwashing?\"\r\n\r\n* Solution Description: What? \"Calculate your carbon footprint and send ADA to trusted projects to mitigate it\" How? \"The platform enables you to calculate the lifetime carbon footprint and take actions to mitigate it by reducing your Carbon and by supporting trusted projects.\"\r\n\r\n(5) I strongly agree that this proposal provides me with sufficient information within their \"Working Plan\" to assess the progress in attaining its stated goals.\r\n\r\nAt the rate I write assessments, it is quite possible that I will run out of time before the 5pm UTC deadline to \"rate\" all the proposal I want/need to. I can let the pressure of this expectation go because, as a community advisor, a passionate supporter of the experiment called \"Project Catalyst\" and an active member of Cardano4Climate, I know beyond a shadow of a doubt that we are headed in the right direction(s). \r\n\r\n\"Climate Change is a failure of cooperation\"- Scott Poynton. Together, WE will not fail. \r\n\r\nIn the meantime, my hope is that you, the voter, will read this proposal for yourself, connect to the problem & support the solution to this challenge with your voice and voting power.\r\n", "q2r": 5, "assessor": "z_assessor_500", "no_vca": 21, "ne": 8, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The Challenge of reducing the carbon footprint in environment by using ADA,\r\nThe proposer is suggesting to calculate the Carbon Footprint in environment and send ADA to trusted projects,\r\nProposal effectively address the challenge. ", "q0r": 5, "q1": "The proposer has enough Experience Technically , completed some projects with NGOS and has managed projects in Carbon Footprint calculators and plan is correct and proposal can be successfully implemented.", "q1r": 5, "q2": "They have provided road map upto3-6-12 months and has provided details on budget allocation clearly, The proposer has provided sufficient information to track and audit the progress.  ", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 35, "ne": 4, "ng": 18, "nfo": 13, "vca_o": 1}], "solution": "Calcule sua pegada de carbono e envie ADA para projetos confiáveis para mitigá-la", "experience": "Empreendedorismo técnico, projetos relacionados a ONGs, calculadoras Carbonfootrpint, gerenciamento de projetos"}