{"id": 367548, "author": "", "title": "Books for Blocks", "url": "https://cardano.ideascale.com/a/dtd/367548-48088", "category": 26114, "amount": 600, "description": "Find a way to convert independent literature into non-fungible tokens on Cardano MainNet to support the creatives in the community.", "f6_no_assessments": 4, "f6_rating": 1.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal has no connections with the challenge. There is indeed no concrete plan of implementing actions or working in the direction o expanding partnerships. It would be important that the proposer check if this is the right challenge for his/her requests and build a solid proposal that has a concrete challenge shared by the community.", "q0r": 1, "q1": "There is no problem or challenge at all pointed in the proposal. And the solution is pointed to convert books into NFTs, which is something that can be done easily in any of the current platforms. From the way the problem and the solution is articulated in the proposal, there is no indication that the proposer knows about the issues in the challenge \"Partnerships for Global Adoption\". ", "q1r": 1, "q2": "No KPIs and no metrics were given. The requested budget is not related to the implementation of a project, payments, or research costs. ", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does not address the F6: Partnerships for Global Adoption challenge: \"How can Cardano enter in global partnerships with United Nations Development Programme and World Bank Group, to leverage mass adoption?\" \r\nThe proposal solution to \"collaborate with programmers who have the knowledge to convert a scanned document into NFTs on Cardano Mainnet. I write books for blocks\" does not answer the question, \"How can Cardano enter in global partnerships with United Nations Development Programme and World Bank Group, to leverage mass adoption?\" There is no mention of either the United Nations Development Plan or the World Bank Group. There is no indication how the proposal solution will enable Cardano to enter into partnerships with these entities.\r\nTo the proposer: You have a gift for creative writing and expression. From one writer to another, in this setting, writing a proposal is much like writing an essay: it requires structure. For example: The Introduction or thesis statement of an essay is the answer to a question. The question in the challenge is, \"How can Cardano enter in global partnerships with United Nations Development Programme and World Bank Group, to leverage mass adoption?\"\r\n", "q0r": 1, "q1": "This proposal is very unlikely to be implemented successfully. \r\nThe proposal has the beginning of a well intentioned idea: supporting creatives by converting literature to NFTs on Cardano, however, it reads more as a call out for collaboration with a rough idea of a plan. Although the budget of $600 seems insignificant, the proposer has indicated the \"requested funds are to recover the costs of the scanning software.\" It is not prudent for the Catalyst treasury to be spent on a small loan for equipment. There is no ROI (return on intention) by investing in this proposal. The problem with overlooking this, is that there could be viable proposals that miss being funded because the funds they need are allocated elsewhere. \r\nTo the proposer: My suggestion would be to find the information and collaboration you seek at the weekly townhalls, in the after townhall breakout room, and through the many avenues for communication via Telegram and Discord. It would also be helpful to study and reference Catalyst documentation on writing an effective proposal. The new and community formed Catalyst school creates helpful tutorials. The Catalyst community is available to help. You must reach out to them. Charles Hoskinson, on the other hand, is rather busy ;)\r\n", "q1r": 1, "q2": "This proposal does not provide sufficient information to assess progress. There is no auditable plan: (roadmap & timeframe, KPIs & metrics, addressing risks and challenges). The description of the problem does not align with the challenge. \r\nTo the proposer: In the comments, you have indicated that this is your \"second proposal ...\" and you are \"still a bit lost in the process.\" I can relate. You are not the first, nor the last person to become lost in the potential of Catalyst. Over time, and with each iteration in the Catalyst \"experiment in decentralized governance,\" the community and those leading Catalyst and Cardano rise to the challenge and make the way clearer and easier for future proposers. They give us the tools to use for each of us to use on our own or in collaboration with others. I have found that plugging in as I have suggested, will help you find where and how you can contribute your gift of creative writing. It is important that you make the effort first-the resources and help are there.\r\n", "q2r": 1, "assessor": "z_assessor_500", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal dialogues to some extent with the objectives of this challenge. Certainly, disseminating literature through NFT is consistent with the sustainable development of a project, and helps to establish the goals of a unique portion of the population: writers. What seems to me to be a problem is that this proposal sounds a bit individual, because the author says that he would write all the books/pages, and that they would be about a specific theme (self-liberation and the healing of the soul). In this sense, it seems to me that it would be a kind of financing for a project that is more personal than local. I didn't find a direct relationship to how this proposal would contribute to the adoption of blockshain on a local scale, how it would attract different types of people and ideas to our ecosystem. I believe it would be more interesting if, for example, the author suggested that a support network for writers be founded, in which they were taught the advantages and differentials of transforming their works into NFT, than focusing the whole issue on a single author and who writes mostly on a single theme. Therefore, I didn't think the proposal fits satisfactorily to what the challenge seeks, to a dissemination of ecosystem practices for the development of different projects in different locations. ", "q0r": 1, "q1": "Certainly the author is capable of doing what he sets out to do: writing books. About his talent and writing ability we can be sure, since he claimed to have written 27 novels in 1 year. However, he never talks about the professionals who would be needed for the other part of the realization of the idea, that is, the programmers and developers who would convert the literature into NFT. I think it would also be necessary to establish where these books would be accessed (probably on the website that the author attached, which talks more about him), but at the same time, this issue is not clarified. It would be positive if the author also showed his intention to hire designers, in order to build an easy-to-use platform for future. Also, I think it would be necessary to think of a way in which this project would reach the public. By reading an author's comment on the proposal, we know he lives in Mexico City. But the goal of this challenge is also to expand Cardano to other locations, so in addition to the event located in the city he is in, how would this activity be known to people from other locations? Unfortunately, I felt that there was a lack of planning in relation to the various parts of what the team says about this proposal.", "q1r": 2, "q2": "There is a lack of detail regarding how this proposal would happen in practice. What we have here is a brief notion of how the borrowed money would be used: recovering the costs of scanning software + digital scanner. The author did not consider the expenses of the rest of the team, which I mentioned in the item previously evaluated. We are not provided with any temporal notions, we do not know how long the author would write his literature or how the return would happen, what the average number of transactions he intends to carry out in a certain period of time, or even how the community would monitor the development of this project... Unfortunately, the proposal is too abstract, I believe the author described very well what his passion, beliefs and motivations for writing his content were, but he didn't bother to untangle more technical details about how the idea would actually happen.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I like the ingenuity of the idea and am convinced that this proposal is in the wrong Challenge Category. I think that the best category for this proposal is Nft Business Model Challenge Category.", "q0r": 1, "q1": "I think the proposal team lead is very passionate about the idea and of course, bringing books and literatures and other intellectual skills will bring more of the ecosystem.\r\n\r\nHowever, apart from the obvious competence of proposer, there's not much organisation in the proposal. More details is required in respect of analysed steps, plans, Milestone to be achieved and also the budget should have details of how the funds will be effectively utilised. These details would prove to me that this project can be successfully executed.", "q1r": 2, "q2": "The proposals has detailed success metrics or any key performance indicators at all.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Collaborate with programmers who have the knowledge to convert a scanned document into NFTs on Cardano Mainnet. I write books for blocks.", "experience": "I have written 27 novels in 2021 and hold the world record for the most novels written in a year. Now I want to publish them on Mainnet."}