{"id": 369294, "author": "", "title": "Research in Applying Frameworks-AIM", "url": "https://cardano.ideascale.com/a/dtd/369294-48088", "category": 26114, "amount": 8400, "description": "How exactly Cardano can enter into global partnerships must be better understood. Without data decision making is difficult/near impossible.", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Project Catalyst is one big experiment and research is of utmost importance. Data is needed to make decisions. And using that DATA to enter into global partnerships is the obvious next step. The research will also help with creating better tools and guides to produce better proposals and end results.", "q0r": 5, "q1": "Established active community members with relevant experience and a passion for Project Catalyst's success. The budget allocation and plan behind this is more than sensible. ", "q1r": 5, "q2": "Extremely detailed plan in how they want to execute this and the resources that are available to them. They provided a clear roadmap with key dates and milestones. Making it able to track the progress and success of this project. Already having relevant connections in required fields, the team behind this project and the time allocated to complete these tasks, there is some room left to address any incoming challenges or risks.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The creation of a rating system that uses the lens of the SDG to assess a large number of proposals could indeed help to inform the community and provide data for future dialog with IGOs.  The stated deliverables of open research papers and a video would benefit the community and help to further the goals addressed by the challenge. ", "q0r": 5, "q1": "Given the skill set, proven motivation, and clear commitment of the team members, this proposal seems highly likely to be implemented successfully. ", "q1r": 5, "q2": "This proposal offers highly detailed and clear information about their plans and how they would measure success. The only issue holding me back from a five-star rating was the discussion in the metrics section about local hubs, projects having a relationship with the CF, and the countries they are located in. These metrics seemed a bit disconnected from the rest of the proposal's focus on creating a framework based on academic research. It isn't clear to me how these hubs will function, what their goals will be, or how they are connected to the SDG research discussed in the rest of the proposal. ", "q2r": 4, "assessor": "z_assessor_278", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Is key to address high impact partnerships such as UN, in a proper way. By aligning our purpose and ways to the SDGs we can certainly create a higher impact, allowing outsiders to better understand the potential this community and its ways of thinking and creation thru collaboration and a powerful and sustainable system, can do for the world and for the Sustainable Development Goals themselves. Fostering more support and less resistance to Cardano's potential, supporting the goals of this challenge.\r\nResearching the data, providing conclusions and supporting actions via the related project seems to be a  great start and idea.\r\nThe team is composed of known community contributors with highly appreciated contributions, that speak for themselves, validating their skills and capabilities to deliver on their promises.\r\nThe requested budget is moderate and a great ROÍ (return on intention) for this community.", "q0r": 5, "q1": "The plan is clear, detailed and the proposed milestones seems very doable to reach the proposed goals.\r\nThere are some dependencies with the related project that aims to generate the framework for proposals, if it doesn't get funded it could delay some of the expected impact, but still the research on its own will provide enough value to be leveraged on partnerships and derive actions to better adhere to SDGs and the delivered papers will generate traction outside the community and with the UN.", "q1r": 5, "q2": "All the deliverables are specific, the phases provides clear dates so progress can be tracked and the results can be audited by the community out of the data generated and the papers and conclusions derived from it.\r\nI do suggest to add some recurrence on the measures or making the questions/methodology open so the community can continue to measure adherence to SDGs and its impacts. Maybe that is already considered. In the Proposals Framework, but I think this should be something permanent, rather than 1 or 2 phases. Anyhow, it has to start somewhere and later can be continued/improved.", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "As a former social entrepreneur I'm very well acquainted with different social impact initiatives and SDGs are a great way to try and bring people around the same goals. Unifying Cardano development around those same goals is a worthwhile endeavor. Also, as this is a new challenge, research is a good way to start. It is, however, a little bit hard to understand how some planned efforts (e.g. translation of a certain document from French to English) contribute to the overall impact.", "q0r": 4, "q1": "This is a highly capable team that will carry out any project to the highest standards. They are not only known for their previous results but they are very active community members who have an impeccable track record.", "q1r": 5, "q2": "It is easy to measure the stated deliverables: two papers and a video. Nonetheless, it would be interesting to read a bit about the envisioned next steps: how are the research findings going to be utilized? Is the idea to do the ground work with this and then use the know-how with the other proposals from (partly) the same team, such as this one: https://cardano.ideascale.com/a/dtd/367569-48088 ???", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal explains in detail the correlation between problem and solution which also takes into consideration the Challenge parameters itself. Concise and detailed. Value added to the Cardano ecosystem can almost be instantly imagined mentally. Key metrics and goals are articulated well and was given a gradual text passage to it so it is not just stated but explained. Seeing what this proposal intends to achieve and how, it is clearly scalable.", "q0r": 5, "q1": "This proposal provided plentiful evidence of all the team members involved. Again concise and related, guesstimate effort by assessors is nearly 0%. Through the skills mentioned it can be visualized how this team will internally operate to achieve their goals. Budget is also crystal clear on how it will be used based on what this proposal seeks to achieve. Only one aspect that is missing is the challenge and risk identification. If only this proposal address that it would receive a perfect 5 star rating.", "q1r": 4, "q2": "This proposal in all its detail will most likely achieve their intended deliverables. Roadmaps, KPI's, correlation between problem and solution is explained in detail.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This project is about doing research and gathering data to enable a better understanding of how Cardano Projects can enter in partnerships with sustainable development organizations. The problem is clearly stated, a need of a better understanding by government and organization of what can bring Cardano to Sustainable development goals. The proposal includes a thorough description of what research will be done, what deliverables will be produced and how. This proposal meets the challenge criteria, and I think it will have a great impact on the challenge goals.", "q0r": 5, "q1": "The team of 6 members provide evidence of high experience in Project Catalyst, computing science and data skills (it has developed CA-Tool which I personally use). An important part of the proposal is dedicated to identifying and name the problem. This level of precision in the definition of the problem gives confidence in the team actually \r\nThe project structure and goals are well defined, and the method to conduct research are thoroughly detailed. After reading this proposal I'm very confident that the team will deliver the framework.\r\n", "q1r": 5, "q2": "The roadmap and budget are well defined in two phases related to Fund6 (3 months) and Fund7 (4 months). 3 deliverables are promised and are consistent with the project goals. This project is crystal clear about what will be done and when, and it will be easy for the community to monitor its progress.", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Research how specifically UN Sustainable Development Goals & other frameworks applied in Project Catalyst can enhance impact and value.", "experience": "AIM members are the team behind the voter-tool, CA-tool, vCA-Tool. Educators, developers, designers and data experts."}