{"id": 396607, "author": "lpmaho", "title": "MLabs - Cardano-Tx-Lib for web3", "url": "https://cardano.ideascale.com/a/dtd/396607-48088", "category": 26433, "amount": 71000, "description": "The web3.js libraries for Ethereum support transaction creation in the browser, but similar libraries have yet to come to Cardano.", "funded": 2, "upvotes": 125773037, "downvotes": 5940951, "votes_result": 119832086, "votes_cast": 533, "f6_no_assessments": 9, "f6_rating": 4.296296296296297, "videos": [], "media": [], "f6_assessments": [{"id": 3344, "q0": "The problem is well presented in this section showing the great necessity of this project, they also talk about the targeted users and how they can benefit from this project in a short description. However, the description of the solution is not enough for the clearest picture on this project, they need to cover the main functions of the intended libraries and explain any possible differences compared to the previous one on Ethereum.\nTo answer how their proposal addresses the challenge, they explain how this practice will help Cardano and also compare their technology with the existing one on Etherum to help readers grab better their intention and the expected results of this project. The risks are well predicted and they also noted that they are in the addressing process, but it would be convincing if they give a summary of how they can deal with the challenges\n", "q0r": 4, "q1": "In this part, they focus too much on talking about the Cardano-Tx-Lib’s functionality, not offering a detailed timeline indicating each stage and the expected result at a specific period of time during the project implementation.\nThe proposer has succeeded in providing a detailed budget breakdown, clearly explaining how they gonna spend the funding money. It would be better if they put the average amount per hour in case the community want to double-check.\nThey did a great job listing their members as well as the core members with their position, experience, and contact information.\n", "q1r": 4, "q2": "They put on some  KPIs, which are necessary for tracking the progress of the project, but they can mention what tool they gonna use for each indicator to increase the clarity. They identify the success of the project based on the timeline of every three months. As mentioned above, they need to decide what tools they use to measure success for each section and at what point it can be counted as a success", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3598, "q0": "The proposal provided a context of the necessity of executing this project to improve some aspects of the Cardano ecosystem that are not preferable to the developers and users. The proposer suggested browser-based support to enhance users' experience. And this is quite good to convince that this project is, to some extent, in accordance with a part of the challenge expected, finding support structures to attract developers, users to engage in Cardano. The proposer provided details about the functions, and some main features of the product. This product is a series of transaction-building libraries allowing developers to mix and match tools to streamline transaction creation and maintenance for browser-based wallets, to build transactions to meet the requirements of a smart contract while balancing transactions. The proposal mentioned the outcome of this project, but it did not conclude how it contributes to the whole development of the Cardano ecosystem.The proposal pointed out two challenges that this project may face and noted that some solutions for them were found. However, the detail of solutions in terms of the technical aspect was not given. Therefore, it would be better if the proposal added more information about how to solve those issues or mitigate potential risks.\n", "q0r": 3, "q1": "The proposal provided an overview of how the project will be executed. However, it could be improved by adding more details in the timeline outlining all milestones that the project will experience from the beginning to the end.This section of the proposal also included information about the functions that users could receive, which is supposed to be mentioned in the Impact section instead to show how suitable it is to the given challenge. A detailed cost breakdown in time needed for a certain activity was well-written. The proposal proved the high feasibility of this project by showing that this project is handled by MLabs which is one of the leading development firms in Cardano with many experienced developers. The firm also launched several projects with the reference link to their website, so they will have a lot of experience to ensure the success of this project. Another highlight here is that their core team includes many talented developers with profound knowledge and expertise in the field of software development, writing Python/Cython code, blockchain development, which is a big advantage for the firm to operate this project successfully. The link of their staff was also provided for reference. There is just one minor point that could be improved in this proposal is that if it mentions this is their full team needed or they still need to hire a number of staff, then everything would be clearer.\n", "q1r": 4, "q2": "The proposal mentioned how impactful it is to operate this project, which is supposed to include in the Impact section. In fact, it lacked detailed measurable indicators for each period of the project to show how the project proceeds and its status of the operation. It is better to add more figures in the KPI sector to make it clearer and more specific. However, it mentioned some factors to audit, track, and trace the process of executing the project through those mentioned criteria. Besides, this project did a great job in listing specific work results in different courses of time and indicated this is a new project that has not been funded before", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4070, "q0": "The whole idea of the campaign is creating a positive developer experience that helps the developer focus on building successful apps and your proposal has brought a very ambitious idea of building a comparable suite of tools for the ecosystem. You use a good example of Ethereum - a pretty successful ecosystem as a role model to learn from and adjust it to fit it with Cardano, it’s a very safe way to build a good foundation and nothing can really go far wrong with that. I can see that you have a very clear idea and plan of how this proposal is going to turn out. You have had a whole picture of its role and its influence in the ecosystem and it surely will help you a lot with the process of making it happen. I can see that you have your feet on the ground addressing potential challenges but I wonder if you mind to share more details about the solutions of those problems, especially when you have made some early progress? ", "q0r": 4, "q1": "I'm very satisfied with the breakdown of your timeline since it closely aims toward your goal. You have also planned your resources, your dream team to some great details. It feels like like everything’s ready for you on the paper, and once you start doing it, you can just straight get the business going smoothly. If anything, it’s a lot better to have a budget breakdown with every step and you can see if your proposal has the financial balance. However, I want to give the team a big praise for such a detailed description of the team with their skills and experiences. ", "q1r": 4, "q2": "This proposal is very well planned and written. I can see that you did a thorough research and study to come up with a great preparation. Not only you point out what you’re going to do but you also have a vision of your achievement at a certain milestone, it’s a very important aspect to keep the project align with our campaign. With that potential in mind, I think you can certainly get your expected outcomes. However, I really encourage you to give us more numbers of your success/ KPI, such as your final goals of number of wallets supported, the rate of P2P transactions successfully executed or a percentage of off-chain development time that can be reduced and so on. ", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4372, "q0": "The aim of the project is to create a native library similar to the webb3.js library on Ethereum for the Cardano platform. The proposer presented a case study on Ethereum, conducted research, analysis, and compared the two Ethereum and Cardano platforms to demonstrate the feasibility of the project. They also go into depth in analyzing and explaining the operating principles of the library and the core functions of the library in technical terms. I think this is a project with great potential for development, meeting the requirements set by Challenge through the fact that they have fully answered 3 key issues: What is this project and the direction of development. How is its development? What is it built to meet the needs of users on Cardano and how will it bring growth momentum to the Cardano ecosystem. Risks are also mentioned and they seem to have measures in place to reduce them. I completely agree this is a project whose goal is consistent with the key metrics of the challenge. The core idea is great and will thrive if done right. I will give 5 stars for this part.", "q0r": 5, "q1": "I see a project development plan board that includes the main activities that will take place, it would be better if they could add a detailed timeline for this. They seem to be confusing Impact and Feasibility, I think they should get the content in \"Please provide detailed plan and progress the solution-provider\" moves to the \"Please describe how your proposed solution would solve the problem\", which seems to lean more towards how they solve the problem and core functionality of the library. This idea is great but the author needs to do more research on how to present the project. In the budget section, I only see the cost items allocated for library construction without the costs associated with staffing, so please add details on the number of staff involved project participants, the number of hours worked per person, and the distribution of costs among individuals. I also need the author to describe in more detail the budget change, specifically what is the change (personnel, work tools,...)? I think they need to review the budget section, present it in more detail and clarity to increase the auditability and transparency of the project. The plus point of this section is that the proposer has described their staff quite well, I see that the members possess diverse knowledge, considerable work experience, educational background, and competencies. to make sure they can execute this project well. I will give this part 4 stars.", "q1r": 4, "q2": "They presented key metrics and a tool/environment so that the community could measure the progress and development of the project.  I feel like the team is confusing the concepts of what to include in the titles, I hope they study more carefully to improve the writing and presentation of the project, would be a shame if these basic mistakes affect your great ideas. I will give 4 stars for this part.", "q2r": 4, "assessor": "z_assessor_1724", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4436, "q0": "first of all, your idea is an interesting idea to help the Cardano ecosystem grow. It's pretty much in line with the challenges Cardano presents. Transaction-building libraries like web3.js would indeed be a huge improvement in Cardano's transaction workflow. This will be a necessary support for developers and meet user expectations. I really appreciate this idea. Your proposal also raised two challenges that may be encountered while developing this project. And it's great that your team is already in the process of solving it. Your presentation and layout are very clear and detailed. I think there is no reason for me not to rate 5*. It will be better if you present and explain clearly where the problem is being solved.", "q0r": 5, "q1": "the functions provided by the library are clearly stated. If this library is developed, Cardano developers and users will experience a great service, especially in terms of supporting many major wallets. I've looked at your project's detailed budget sheet, it's up to date with project to-dos, timelines, and budgets. However, I think you should be more clear about the roadmap as well as the milestones to make the project more convincing. It is better to divide it into several stages so that it can be easily followed. Regarding your team members, I feel confident in you. A strong team of over 80 developers and three talented and experienced core team members. I appreciate and believe this project will be successful. However, with that said, you should add a more thorough roadmap to your project.", "q1r": 5, "q2": "the audit section that you presented is clear and easy to understand. The KPIs given are extremely reasonable and worth looking forward to. I appreciate the milestones in the path to project success (3 months, 6 months and 12 months). The project also promises to bring other nice features after a year. I am very much looking forward to this success. However, it will be better if you have specific numbers to prove your route. For example \"how much is the estimated off-chain development time reduced?\" or \"how many wallets are supported?\". You can choose a certain time period to estimate specific numbers. This will increase the credibility of the project as well as the confidence that your team will succeed. ", "q2r": 4, "assessor": "z_assessor_1725", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4750, "q0": "The proponent addressed the challenge by attempting to resolve a flaw in the Cardano model's design: the difficulty in constructing transactions and the requirement to integrate into the effect system of the off-chain contract monad. Their approach is to create a library that would provide browser-based support for transactions, making it simple and straightforward for developers to integrate into crucial infrastructure. This proposal's purpose is nicely matched with the challenge, which is to provide a favorable developer experience and attract developers to the ecosystem. The idea demonstrated that the author had carefully considered their solution. They investigated the advantages that Ethereum offers in terms of user experience that Cardano does not, and then devised a thoughtful solution to bridge this gap.\n\nThe proponent had expected obstacles in the development process: dealing with type differences and resolving discrepancies in UTxO management among wallets. These technological concerns were resolved, and the proponent team made some early headway. As a result, I believe the project's delivery is at low risk.", "q0r": 5, "q1": "The proponent provided the goals of the project and an outline of how they would proceed to achieve the goals without a timeline. However, I later discovered in the Auditability part three milestones, which are three, six and twelve months, with reasonable achievements. So I considered that an acceptable plan. For clarity, I recommend that the proponent include the milestones in their delivery plan.\n\nThe budget breakdown is quite comprehensive. It includes major items in the development phase of the project, together with an estimated working time to complete each item. From my understanding, the proponent calculated the final budget based on the total time needed and the wage of $79.95/hour. I performed some wage research and discovered that the indicated pay rate is within the pay range for a Senior Software Engineer in the United States. As a result, I believe the proponent should provide additional evidence of the team's experience in order to make the needed budget more convincing. \n\nThe team is from MLabs, one of the leading development businesses in the Cardano Ecosystem, so they do have credibility. The core team seems well-versed in PureScript and Haskell. They also have multiple contributions to the ecosystem. Overall, I believe the team is capable of delivering the proposal successfully.", "q1r": 4, "q2": "According to the KPIs submitted by the proponent, the success of the proposal is determined by the number of transactions, the amount of off-chain development time saved, and the number of wallets supported. This corresponds to the key metrics of the challenge. \n\nThe project is open-sourced on GitHub, so the development progress as well as potential issues can be monitored by the community. We may also track the fulfillment of the functional elements stated in the proposed plan, as well as the time required to complete each one. This will help manage the budget better since the budget was estimated based on working hours.\n\nThe project's success is divided into three stages. The proponent's short-term goal is to establish functionality in a single wallet. They will then develop more features, integrate them with other wallets, and give documentation and tutorials. This method of first ensuring stability and then expanding seems acceptable to me.", "q2r": 5, "assessor": "z_assessor_1759", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6241, "q0": "This would be a useful addition to a dev's toolkit: providing more options without having to code them, and from a trustworthy dev (MLabs). Transactions being one of the core functions, so this would help the core of many other teams.", "q0r": 5, "q1": "MLabs is what it says: one of the best teams for Cardano development...like their involvement in what they list with Liqwid, SundaeSwap, Ardana, Optim...and then are listed in many other's proposals because of their credibility. So, good to go here.", "q1r": 5, "q2": "Good roadmap, and fairly easy to see where this leads over time. I like the time break down, and the items given seem reasonable and seems to add value at each step. I had assumed by the mention of this being a great tool for developers: that it would be provided open source, but would have liked to have seen more about the nature of if they do, or do not: expect this to be a commercial venture, or community provided (and how). I think either way, and with the info provided: that this would still provide value, so this is why there was no deduction of stars.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9986, "q0": "A large resistance within the cardano ecosystem when the smarts contract first debuted. With more people driving innovation in development more options were generated and were able to overcome or reformulate the Defi processes to work on the cardano set of rules of UTXO. \nMLabs is proposing to further improve this for web3 application by generating a novel transaction platform or source code that can be used by wallets to overcome some challenges. \nThe simplification of transaction will allow a grow in the utlity of Defi as many resisted the transfer of their assets to cardano defi space. \nOverall developpers will benefit from new creative ways to utilize UTXO model and this proposal will deliver a novel approach\n", "q0r": 4, "q1": "MLabs worked on liquid and has been support various wallets are knowledgeable on the UTXO and plutus protocal. They have indentified an area of improvement where an open source developper package will simplify some of the transaction headaches. \nThe plan breakdown is clear and concise. they present the timeline with clear KPIs to acheive and have illustrated it in a linear manner. The budget reflects the number of manhours needed for the project as an estimate and the hourly rate is very conservative 25$. \nTherefore i would imagine this project to be well funded and planned for success. ", "q1r": 4, "q2": "As for many of the developper packages. This project will be shared step by step of github and many wallet developers and users will be able to pull/comment/test on the effective use of this package. \nThe goal and audit section should focus on evaluating the transaction improvement and novel method to building the needed smartcontract transactions. If succesful then the auditors can close this project and mark it a success. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10652, "q0": "This is a very good proposition. The proposal is ongoing and fits perfectly with what the ecosystem needs now and is also evolving, it can scale to address future challenges. The proposed solution is to solve the problem of the proposal, the risks and challenges of the proposal have been given and the solution is quite satisfactory I trust the proposal", "q0r": 4, "q1": "The writer of the proposal on the issue of the roadmap has stated the successful time of the proposal and also detailed for each completed milestone. However, the budget needs to be broken down in detail into the components of the roadmap. more reasonable and if additional funding is needed for implementation the proponent should come up with a verifiable plan for this. As for the proposed team, which has outlined the key team to complete the proposal, I trust the team to ensure a successful launch. Personally, I think the proposal has a lot of potential for development", "q1r": 4, "q2": "The team that wrote this proposal has outlined the KPIs that are relatively clear and consistent with the proposal. About the success of this project, the results have been described, but the time is very long, it is necessary to share details. The small amount of time to complete so that the community can catch the transparent process and this is also a new project that has not been funded. I think it is a good project. I hope the community will pay attention and soon succeed.", "q2r": 4, "assessor": "z_assessor_958", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We are building an SDK for making and balancing transactions for browser-based wallets (Nami) and javascript environments (server, mobile).", "experience": "Several experienced PureScript developers, advanced Haskell / Plutus programmers, and a team of engineers working to build out the Cardano ecosystem."}