{"id": 400273, "author": "jodelchad", "title": "CHAINS NFT DEVELOPMENT", "url": "https://cardano.ideascale.com/a/dtd/400273-48088", "category": 26433, "amount": 40000, "description": "WERE BUILDING A PLATFORM THAT CONNECTS WIRELESSLY TO HEALTH RECORD\nLINKING PEOPLE TO THE FARM\nNEW WIRELESS COLD WALLET (INTERNAL WIRELESS)", "funded": 0, "upvotes": 29527584, "downvotes": 37847956, "votes_result": 8320372, "votes_cast": 315, "f6_no_assessments": 8, "f6_rating": 1.8333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 537, "q0": "Sadly, it is very unclear to understand what the proposer is trying to achieve. I guess it is some kind of cold wallet, to store information about animals in their first years after birth. I’m even unable to understand if the proposer is referring to real animals or nft-animals. There might be an interesting idea behind the proposal, but the proposer makes not effort explaining the idea in detail. This might partly be due to a language barrier, but the ideas are all over the place and not structured in any way, which suggests, that this is not only a language problem. Without understanding the idea, I’m unable to evaluate the impact. As a suggestion for the future: let some else read it first and give you feedback. ", "q0r": 1, "q1": "The proposer at one point references a team “we are a team with graphics Desginers, hardware development sourcing…” but there are no names, or links provided (or not working). The budget is a wild guess.", "q1r": 1, "q2": "It is very hard to understand the proposal and see the problem the proposer is trying to solve. There is no timeline and no way to audit any progress. Aiming at such a high budget the proposer should clearly outline his goals in much more detail.", "q2r": 1, "assessor": "z_assessor_1184", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3438, "q0": "Information related to the project is provided rather limited. Proposal does not have information related to the problem as well as specific information of the solution such as details of features, how this solution works. Moreover, the founder has not yet figured out how this solution will affect the Cardano exchange. Proposer has recognized a risk for this project and has a solution for it, but has not yet released a description for that solution.", "q0r": 3, "q1": "The Feasibility section is pretty sketchy. Regarding the timeplan, although the proposer has provided a link, the proposer should still provide a roadmap for this part so that the voter can more easily understand the project's deadlines. In addition, the team only gives a general expenditure table but does not give a specific expenditure table, for example, instead of just giving the information '$10000 FOR PLATFORM STARTUP', the team can list the expenses costs to be spent on this. Thus the information will be clearer. Similarly, the member information or information about the project's groups is also quite sketchy. Proposer should add specific information of each team member or core members of the team such as education level, work experience.", "q1r": 2, "q2": "The information written does not solve the problems posed in this section. First, the founder has not yet provided tools or KPIs/Key metrics to measure the development of the project. In addition, the proposer did not provide a clear prediction of the success of the project. The whole team can give more specific data to clarify the success of the project more to the voters.", "q2r": 2, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4403, "q0": "This is a project that is still in the conceptual sketching stage, so the information provided is quite sketchy, unclear, and not of the high reference value. I can roughly understand their idea of ​​building a platform like a game where the players acting as breeders create farms and livestock, keep records of the animals. Their animal care jobs will be converted into game missions, which upon completion will receive rewards through the platform. The idea is quite refreshing but the proponent failed to present their proposal addressing the Challenge KPIs? The platform doesn't seem to live up to Cardano's expectations of attracting developers to participate in the Cardano ecosystem. I do not appreciate the feasibility of the project and the value it brings to Cardano. As a record-keeping platform, the risk of information security is huge, I have not seen them mention this risk and how to deal with it in general. With their recommendation, I will give it 2 stars.", "q0r": 2, "q1": "It seems that the proposer is inexperienced in writing a project calling for investment, with too little information for reference and evaluation, which will make it difficult for investors to believe in the feasibility and feasibility. project validation. First I would like them to provide a detailed plan that includes the following information: project build time, key activities, goals/products to be achieved in stages, demo run time, time for the official platform launch. The budget section should clearly state the categories including the main work, tools, and equipment to build the platform, how many people are involved in this project, each person's role, working time, and costs allocated to those categories. Regarding personnel, the author has only a few lines describing them as experienced people related to the project field. However, there is no information or Linkedin to verify the information about the personnel they provide. We cannot know exactly how many members their team has, the level of experience, the area of ​​knowledge of the personnel. The identity of the proponent is not verified, so it is difficult for investors to trust the team's ability to operate the project. I hope they will learn and improve in how to present a project. In this part, I will give 1 star.", "q1r": 1, "q2": "It is very difficult for the community to check the project's audibility viability, the proposer presents information that is quite confusing and confusing, they have not built a specific project development roadmap, there are no milestones, no specific KPIs. Does anyone know exactly when the platform will be finalized, what are the downloads, and how many players they are targeting? The information they give in this section is more of a background introduction than a KPI for measuring project progress and development. I will give 1 star for this part, even though they have no experience in presenting projects, a project full of information, evidence, and documents will attract readers more.", "q2r": 1, "assessor": "z_assessor_1724", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5322, "q0": "The idea is interesting. On an NFT platform, farmers can communicate with one another. The proposer should be more descriptive about the NFT platform and how it contributes to the Cardano ecosystem. I believe there will be some difficulty in introducing the app to farmers, hence I recommend the proposer include this as a risk. I am curious as to how the proposer handled this scenario. As a result, the proposer should provide an instruction on how to connect the app for farmers, as well as an explanation of what a cold wallet is and where it can be used. Furthermore, the challenge is provided but not the solution; I expect the proposer may provide the solution afterwards.", "q0r": 3, "q1": "Unfortunately, the link to the detailed plan has expired, therefore I am unable to view it. I hope the proposer includes a roadmap in this document and breaks down the budget accordingly. For example, how much time will it take the team to develop the platform and put it into action? What scale do they have to be on? Providing simply the budget for each section does not appear to be valid, and it may not earn enough trust to request the budget. Furthermore, the employee quantity should be shown. I recommend that the proposer determine how many people will work on the project and how many profiles and backgrounds will be provided. I only gave two stars because of the lack of planning.", "q1r": 2, "q2": "The measures are practical, and they result in a positive developer experience that allows developers to concentrate on developing successful Dapps. The project may have a favorable impact by reducing the procedure and combining NFT platforms. I recommend that the proposer be more specific about the concept and assist in the creation of a useful app that connects farmers with pure, transparent records.", "q2r": 2, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6253, "q0": "The idea proposed here is full of potential. At first, I was enthused because at the mention of health records...and upon further reading: this seems more for animals, which is fine. Would be of huge use to breeders indeed, and that market can deal in large figures in turns of incomes. Providing a framework for use would be of great use to the dev ecosystem.", "q0r": 4, "q1": "The proposal lacks some focus for the ada asked for. I would also like, for those numbers, more information on the researcher, and/or dev...or team. With animal records, I am surprised that some initial Google research was not given here of progress in the space of placing human medical records on a Sovrin chain (for example), or that Atala PRISM is considered (at least).", "q1r": 2, "q2": "It is quite a bit to ask for, and then some of the cut and pasting of information into this proposal is concerning...for the amount asked. If for initial research, perhaps more information provided about the dev, and then also deliverables to the community even in terms of the research (for example: a document that explains what components are involved to place a record of information onto the Cardano blockchain).", "q2r": 2, "assessor": "z_assessor_363", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6269, "q0": "Starting from the fact that the idea is about development and is within the category of development I can not give it a low score, but it seems to me that it is not raised in a correct way, it is not explained with the necessary clarity of it and does not comment on the link that it has with the development that is what is sought in the challenge.", "q0r": 4, "q1": "The plan leaves much to be desired, almost nothing is explained in the proposal, much less the development is explained in detail. They provide a link to the plan that does not work so since there is no more information about this it is not known what will be done in it. The team members section is very poor and very poorly written.", "q1r": 1, "q2": "The content of the section on how progress will be measured does not explain at all how this will be done and makes a description of the proposal in a very strange way. The success of the proposal somewhat of the same, impossible to understand how it will be the same from what is proposed. In short, please write thoughtful and meaningful proposals.", "q2r": 1, "assessor": "z_assessor_372", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8602, "q0": "This proposal seems to be a mashup of multiple ideas, unfortunately, none of them is clearly described and I can pinpoint exactly what the proposers intend to develop.\n\nThe main focus seems to be around providing medical records as NFTs for farm animals or pets but a game is also mentioned, as well as hardware devices. No specific data is provided about the latter two and information about the medical records is very vague.\n\nGiven all this, it's very hard to judge what the impact of the proposal might be on the Cardano ecosystem.", "q0r": 1, "q1": "?Instead of a timeline or roadmap, the proposers have included a link to a website that doesn’t load. The budget breakdown seems very generic and simplified. Instead of details about the team, the proposal contains only a list of job titles.\n\nWhat the proposal should have contained to be a successful submission:\n- an easy to follow and detailed timeline outlining the implementation plan that the proposers plan to follow to turn their vision into reality\n- a descriptive and realistic budget indicating clearly how the amount requested from the Cardano Treasury will be spent\n- bios and credentials of the team members currently involved with the project, with links to professional profiles (LinkedIn or other proof of previous work and experience)\n- a description of the team members that need to be hired, if any. ", "q1r": 1, "q2": "The auditability section focuses on features that perhaps should have been presented in a different part of the proposal, and doesn't present any of the auditability elements that would have been required. But unfortunately, the features presented here, together with the rest of the details I deduced from the other sections of the proposal, still aren't enough to provide sufficient clarity around the implementation plan.\n\nFor the proposal to receive a high score, a few elements would have been necessary:\n- clearly describe metrics and KPIs to enable easy tracking of the progress on the proposal\n- milestones describing the expected success or progress\n- no ambiguity in the description of the problem it wants to fix\n- an easily comprehensible approach to fixing or improving the problem\n\nIn the event, the proposer of the Chains NFT Development submission decides to resubmit this proposal to a future fund I would highly encourage him to include the element I have suggested here as well as in the feasibility section of this assessment.", "q2r": 1, "assessor": "z_assessor_681", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10375, "q0": "The proposal is basically about building a web platform where  health records of animals(pets) can be kept secured and for research purposes through the blockchain. Notwithstanding, it is a great idea but it has nothing to do with this category. it should have been presented at Dapps and Integration category.", "q0r": 1, "q1": "The proposal is not detailed and the budget is vague, and there is no timeline or roadmap to monitor its implementations. In addition to the fact, the team's competence can not be verified.", "q1r": 2, "q2": "From the information presented, there is no basis or measures to evidently assess the success of the project. The proposal needs to align its solution to the problem statement. There should be some of verifiable metrics to monitor the performance of the project.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "A NEW TOOL, A SECURE COLD WALLET, A NEWLY COMMITED NFT CODE, A PLATFORM AND A CARE GAME CROSSED WITH A MEDIA PLATFORM, CARE IS FROM DAY 1", "experience": "With health records always being hard to access. I have feel records being kept should be stored better. With records easily mixed, misplaced and files needed brought in from outsourcing, I believe records should be kept within the custody of the person of choice."}