{"id": 400916, "author": "nara", "title": "NuNet: Decentralized GPU ML Cloud", "url": "https://cardano.ideascale.com/a/dtd/400916-48088", "category": 26433, "amount": 83000, "description": "Artificial Intelligence (Machine Learning) models need GPU processing power. How to provide such decentralized GPU power to grow Cardano.", "funded": 2, "upvotes": 363906224, "downvotes": 10218808, "votes_result": 353687416, "votes_cast": 2339, "f6_no_assessments": 6, "f6_rating": 4.944444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 1127, "q0": "This proposal meets the developer ecosystem, by enabling a method for ML projects to leverage decentralized computing resources in hte form of GPUs.  This will help to build and enable projects that leverage ML to utilize the infrastructure that is being built.", "q0r": 5, "q1": "The NuNet team is associated with Singularity.Net team and have a high number of highly qualified engineers and developers working on their team.  The phased breakdown of the proposal and the resources discussed to make this proposal come to fruition are clearly defined and give high confidence in being built.", "q1r": 5, "q2": "This proposal has a nicely defined phased approach towards developing this solution as well as a good breakdown for the planned resources that is planned to be used in development.  I think this proposal meets the expectations of being able to be auditable.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"id": 1378, "q0": "Being able to flexibly acquire GPU access is a must for the future of decentralized applications. If we, as Cardano community members, want the best applications to be run as decentralized as possible, this is completely necessary and optimal. Future developers will easily love being able to make calls to GPU resources.", "q0r": 5, "q1": "This plan is highly technical, so it is difficult to judge the complexity of the solution. But they are an experienced team, led by an experienced CEO. Their whole project, Nunet, is about onboarding computational resources to dapps. Thus, I am confident any issues will be overcome. ", "q1r": 5, "q2": "Again, it is highly technical. but yes, it seems as though they hit the key points about what is needed. For instance, in order to get high performance computing, clusters of virtual GPUs are a must! so this is something to keep our eyes on and monitor.  If they achieve this, it could be quite huge in the coming years for apps on cardano. ", "q2r": 5, "assessor": "z_assessor_1347", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 2328, "q0": "This proposal belongs to the synthetic challenge setting and provides value to the Cardano ecosystem. The proposal is well-written and organized, the intent is clear, and the methodology is transparent. This proposal delivers value to Cardano by enabling flexible, decentralized, powerful, faster or cheaper CPU and GPU resources as a compute framework to support the Cardano ecosystem. This will greatly increase the capacity of the growing ecosystem on Cardano as witnessed by the demand of DeepchainAda: Trustless AI Training. NuNet can provide true resiliency and decentralization through the Cardano network both in the realm of CPU computing. I appreciate this idea. ", "q0r": 5, "q1": "The community's ability to tackle an open research challenge should not be underestimated, especially given the early age of the Cardano ecosystem. Nunet will work with PGWAD to define the structure and need to enable access to decentralized GPUs on Cardano for ML. The pilot will be up and running for the Fund7-funded DeepchainAda project: Training Trustless AI as proof of concept.\nPGWAD is a stakepool cardano running on Raspberry Pi. PGWAD is part of the fleet alliance. It is an alliance of independent stake pool operators that use low-power ARM cores to help decentralize Cardano. PGWAD is also part of the xSPO alliance.\nPGWAD stands for Packet GateWay for AI and Decentralization. PGWAD has focused on the DeepchainAda project.\nGiven the challenges and risks presented by the proposed team, we see that they have done a lot of research when making this proposal so I fully believe this project is very feasible. ", "q1r": 5, "q2": "They have done a very good description of each stage with a brief description of what will happen. The team took it a step further by explaining to the community exactly what to expect in the short term. Furthermore, the research team detailed what successful therapies they expected to have, which I consider relevant. Another factor that adds auditability is the open source nature of the platform. This will allow the community to understand the details of how the project is progressing and in what direction.\nThis proposal brings value to Cardano by enabling flexible, decentralized, powerful, faster and cheaper GPU resources as a compute framework to support the Cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_1477", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"id": 4463, "q0": "your proposal is very impressive given the idea of developing the NuNet platform, connecting decentralized GPU hardware providers and enabling secure, secure, decentralized access to GPUs for Cardano. Your presentation also summarized and outlined the computing needs in the Cardano ecosystem. The problem, cause and solution are clearly mentioned. I appreciate what this NuNet platform has to offer. In addition, your proposal explained in detail the two stages of GPU usage of the NuNet platform. Adequate resources are also provided. Moreover, it is great that you have estimated the risks of this project. I believe this is a perfect IMPACT.", "q0r": 5, "q1": "According to  the roadmap you provided, the project will be experimental for 5 months. The information you provide is quite detailed and easy to understand. Regarding the detailed budget, I don't understand why at the beginning of the project you gave the figure 83000 USD, but in this part the total is 62,000 USD. However, according to my calculation, the total cost of the items you mentioned is 74000 USD. I wonder if there is a mistake here or is it because your presentation is misleading me. Your team members are a great fit for the project. It would be better if you introduce some of their salient features and experiences in this section instead of making the viewer have to click on the link. Although there are some questions, but overall I still rate this project as highly feasible.", "q1r": 4, "q2": "overall, your  presentation is relatively complete. You have also provided criteria to measure the project, but it lacks specific numbers so that the monitoring process can be better. The success of this project will greatly benefit the Cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_1725", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5769, "q0": "It seems to me an incredible proposal and on top of that it is exactly what is sought in the challenge. The proposal deals with development as such and in turn will help developers to use virtualized cpus and gpus in a decentralized way. Highest score without a doubt.\n", "q0r": 5, "q1": "It seems like a very solid team with several professionals in the field. In addition, the approach does not seem to have any holes to cover, so in my opinion, with effort and the help of the funds, it will be carried out.\n", "q1r": 5, "q2": "Both the metrics or KPIs allow you to check if the proposal is being developed correctly (as an improvement, the KPIs should be able to be measured with a value, so what you propose there is more of a list of achievements). Success for them is also defined by what I consider everything to be well formulated.\n", "q2r": 5, "assessor": "z_assessor_274", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 10279, "q0": "This is a very good proposal. NuNet platform that connects decentralized GPU hardware providers and enables secure, safe and decentralized access to GPUs for Cardano. This proposal brings value to Cardano by enabling flexible, decentralized, robust, faster or cheaper CPU and GPU resources as a computing framework to support the Cardano ecosystem. This would greatly increase the possibilities of the growing ecosystem on Cardano.", "q0r": 5, "q1": "Your team consists of many members, the information about their experience, skills, knowledge, profile is listed specifically. In particular, they have had certain successes (had a project funded at fund7 and was one of the top 20 voted proposals). In addition, The NuNet team is also supported by SingularityNET human resources on-need basis while rapidly expanding organically after successful token launch on 17.11. With what has been provided, I am sure your team can completely carry out this project.\nThe roadmap and work in each time period are specified. The budget is allocated quite reasonably (clearly defining work, working time). I appreciate you identifying the risks, challenges and ways to address them. This will be a solid foundation that makes project implementation easier.\nI think the success metrics need to be more detailed, for example, how many visitors per month? Also, it would be great to know the cost of ML HPE, is it really cheaper than other competitors?", "q1r": 5, "q2": "The information provided is complete, (with a strong team, a lot of experience, a reasonable roadmap) people can rely on it to evaluate the success of the project.\nThis proposal enables flexible, decentralized, robust, faster or cheaper CPU and GPU resources as a computing framework to support the Cardano ecosystem. I am sure this project will be successful in the future, if so it will have a huge impact on the developers, and more broadly, the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "NuNet platform that connects decentralized GPU hardware providers and enables secure, safe and decentralized access to GPUs for Cardano.", "experience": "Team leader: Dr. V. Kabir Veitas - AI researcher & software architect; co-founder & CEO, NuNet.io\n\nhttps://www.linkedin.com/in/vveitas/"}