{"id": 404202, "author": "quangtran", "title": "Haskell Book Japanese Translation", "url": "https://cardano.ideascale.com/a/dtd/404202-48088", "category": 26433, "amount": 9250, "description": "Cardano's Smart Contract is built on Haskell. But there is no book or document about Haskell for developers in Japan", "funded": 1, "upvotes": 49561493, "downvotes": 14731806, "votes_result": 34829687, "votes_cast": 323, "f6_no_assessments": 9, "f6_rating": 4.259259259259259, "videos": [], "media": [], "f6_assessments": [{"id": 597, "q0": "- The biggest barrier for project developers on the Cardano platform is the technical issue. Especially, Haskell is a difficult programming language for even those who use English as their native language.\n- Japan is a potential market with many technology developers, but technical English is very limited in Japan. This makes blockchain technology enthusiasts especially the Cardano platform inaccessible to project development.\n- Translating a basic book on Haskell into Japanese will motivate the blockchain-loving community in Japan to develop widely. From there, build and develop more projects on the Cardano ecosystem.\n***Suggestions/ advices:\n- Translation of books is just the first basic solution to help the Japanese community have more reference sources. If the proponent can combine more periodic livestreams, community care groups such as telegrams to answer readers' questions or give advice, share more learning experiences, and apply them to readers, the solution will more effective\n- The proposal mentions the amount that will be shared and only shared with developer communities in Japan that the proponent knows, this number is limited. Therefore, if the proponent can publicly share this document for the Japanese community to develop the community, it will help the community to grow stronger.", "q0r": 4, "q1": "- The idea of the project is completely feasible and possible because the original version in English is available. It only takes a team that is good at English and Japanese to be able to do it.\n- The project has a clear and specific work plan with detailed commitment numbers for each month\nThe team has 2 main members with skills and experience suitable for the project\n- Mr. Curtis D'Alves has many years of experience with the Haskell language\n-Ms.Ha has many years of experience in Japanese translation\n***Suggestions/ advices:\n- The translation time of 1 month is relatively short with a lot of work (370 pages of English technical language into Japanese) for 1 translator. If there is a translation team, the proposer should mention it in the team composition to increase the feasibility of the project\n- If the project can name the developers in communities in Japan that the project targets, that would be great. That shows that the project has been carefully prepared and has a clear direction\n- Marketing solutions have not been clearly stated. Proponents can use a number of marketing methods such as building a knowledge-sharing community on social networks, building a video channel that applies the basic knowledge in the book to make examples for readers to understand better...", "q1r": 4, "q2": "- The project has given the committed numbers in each month\n- Provide criteria and target numbers for each criterion to evaluate the success of the project\n***Suggestions/ advices:\n- The numbers that the project gives are great if it can be done. But these numbers can be easily faked, one person can download many copies so if the project can come up with a solution to evaluate the actual number of downloads as well as the number of downloaders are different and are real users, people who want to use the knowledge in the book.", "q2r": 3, "assessor": "z_assessor_1192", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "Thank you very much for taking the time to assess our proposal\n\nFeasibility: \"The translation time of 1 month is relatively short with a lot of work (370 pages of English technical language into Japanese) for 1 translator. If there is a translation team, the proponent should mention it in the team composition to increase the feasibility of the project.\" - We have a team member with 7 years of experience in teaching and translating in Vietnam. If you have ever been involved in translation work, you will know that on average 1 translator can translate 100 pages (300 words/page)/day (in 8 working hours). Therefore, 370 pages translated in 1 month ~13 pages/day is feasible.\n\nAuditability: I agree with you that the number of downloads on google drive can be faked. But it's like youtube views, likes, comments. You can also fake those parameters. But it's not because we're skeptical that we can't measure the success of a proposal by those criteria because it's easy to fake. We still have to use the number of downloads, views, and likes to know if the document or video is successful or not. \nIn addition, we also have other indicators such as: The number of developers participating in the Plutus Pioneer course can be measured by registration forms.\nThe number of proposals submitted on Catalyst can be checked by \"Has someone referred you to become a proposer?\""}, {"id": 765, "q0": "Cardano is built on Haskell and it is an uncommon programming language in most parts of the world. This is a proposal to translate the highly recommended book by Charles Hoskinson and IOHK, “Learn you a Haskell for Great Good”, into Japanese; this effectively addresses the challenge by making the knowledge of Haskell more accessible to a non-english speaking country.\n\nThe project proposer states that Japan is one of the countries with a large number of developers, but has limited access to Blockchain and Smart Contract documentations because English is a huge barrier for them. If the book is successfully translated, I believe this project wins two-fold, it will bring new developers into the ecosystem and achieve diversity in the developer ecosystem.\n", "q0r": 5, "q1": "The book “Learn you a Haskell for Great Good” can be read in English for free at http://learnyouahaskell.com/ and is licensed under a creative commons license. The proposer is not the author but is free to share and adapt the book as long as it is for non-commercial purposes. There are no legal concerns that will arise out of this project.\n\nThe team is asking a sum of USD$9,250 - $25 per page for the 370-pages book.\n\nThe team consists of a dynamic duo: \nA Haskell developer with 5 years of Haskell programming experience. He has an existing 2-year-old YouTube channel that teaches mainly Haskell; and \na Japanese interpreter who has 10 years experience translating and interpreting Japanese with 2 years experience experience evaluating blockchain projects. \n\nIt is reassuring to see that the team already has experience in educating Haskell so there is no doubt this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The book “Learn you a Haskell for Great Good” can be read in English for free at http://learnyouahaskell.com/ and is licensed under a creative commons license. The proposer is not the author but is free to share and adapt the book as long as it is for non-commercial purposes. There are no legal concerns that will arise out of this project.\n\nThe team is asking a sum of USD$9,250 - $25 per page for the 370-pages book.\n\nThe team consists of a dynamic duo: \nA Haskell developer with 5 years of Haskell programming experience. He has an existing 2-year-old YouTube channel that teaches mainly Haskell; and \na Japanese interpreter who has 10 years experience translating and interpreting Japanese with 2 years experience experience evaluating blockchain projects. \n\nIt is reassuring to see that the team already has experience in educating Haskell so there is no doubt this proposal will be implemented successfully.\n\n\nThe information provided is sufficient to audit the progress and the success of the proposal.\nNeither Agree nor Disagree\n\nThe timeline of this project is 3 months. The proposer aims to complete the translation of the book within a month and then disseminate the book to the Japanese developer community in the 2nd and 3rd month. \n\nThe milestones are clearly laid:\nComplete Japanese translation of the book Learn You a Haskell for Great Good\nReached 500 downloads in the first 3 months\n10 developers join the Plutus Pioneer Program\n5 proposals from developers in Japan submitted to Catalyst\n\u2028\u2028The goals to reach 500 downloads is highly likely and the developers joining the Plutus Pioneer Program and submitting proposals to Catalyst will also likely follow, however my biggest concern is the timeframe for translation seemed a bit too optimistic. The team only has 1 translator and the timeline suggests that 12 pages will be translated per day. Considering that this is not an everyday translation but a technical one, I believe more time is needed for the translation - a 2-3 month timeframe is more likely for translating the book.", "q2r": 3, "assessor": "z_assessor_1203", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thank you very much for taking the time to assess our proposal\n\nFeasibility: I did not see the assessor mention any issues of our proposal. The assessor also did not offer any advice that our proposal should improve. Therefore, 4* for Feasibily is not reasonable.\n\n\nAuditability: \"my biggest concern is the timeframe for translation seemed a bit too optimistic. The team only has 1 translator and the timeline suggests that 12 pages will be translated per day. Considering that this is not an everyday translation but a technical one, I believe more time is needed for the translation - a 2-3 month timeframe is more likely for translating the book..\" -  If you have ever been involved in translation work, you will know that on average 1 translator can translate 100 pages (300 words/page)/day (in 8 working hours). Therefore, 370 pages translated in 1 month ~12 pages/day is feasible. "}, {"id": 1459, "q0": "I have been working as a developer for more than 5 years. My English is also not at the level I want it to be. However, I do not think it is a good idea to translate and read technical books in other languages. It is better to be created English language courses for Japanese developers who do not understand the language than reading the text in another language. I have two books in my native language and I have not completely read both because there are translated terms that should not be translated.\nIf the translation will be made, I strongly recommend that technical terms not be translated. This means that most of the book will not be translated. The explanations and algorithms will be translated, which will be great.\nStill, in my opinion, it seems more useful to do Japanese courses about the book, with the teacher being technically literate. These courses can be only the first step to the Cardano ecosystem. After that, more advanced courses can be created", "q0r": 2, "q1": "The translation of the book to be done in one month sounds absolutely achievable. 200 downloads should not be a problem either, since the book will be free, every developer in Japan will want to see it. But how many of these developers will really start dealing with Haskell? And how many of them will enter the Cardano ecosystem? There should be a more detailed study here for developers who want to learn Haskell and enter the Cardano ecosystem. Maybe it would be good to make 10 publications in advance in the respective communities. If the programmers point to the language barrier and the lack of Haskell training as the main problem, then this translation will be extremely necessary.\nIt is very good that the translators are a technical person and a person with 10 years of experience with translations and is part of the Cardano ecosystem. Without a technical person, quality translation will be impossible. If they are approved, I do not think they will have any problems with quality translation. As I said above, I would recommend that the terms remain in English.\nThe budget absolutely corresponds to the work that will be done by a programmer with 5 years of experience and a professional translator.", "q1r": 4, "q2": "The plan is good, but there seems to be no further study and explanation of the numbers.\nWhy exactly in 3 months? How exactly are 500 downloads calculated? 10 people out of 500 downloads are 2% of the people who downloaded the book to join the Plutus Pioneer Program. Why exactly 2%?\nIn my opinion, it would be a good idea to have a marketing plan in place or to introduce people to the Plutus Pioneer Program and Catalyst. Or the book must come with an obligation - to download it you need to register in the Plutus Pioneer Program.\nIt is not entirely clear why these goals were set and how exactly they will be achieved.", "q2r": 2, "assessor": "z_assessor_1367", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thank you very much for taking the time to assess our proposal\n\nImpact: If you are a Japanese who does not know English you will know why we have to translate these books into English. People who only know the language of their country of study actually face a language barrier when accessing books in English. It is possible that a book translated into Japanese cannot represent 100% of the book in English. But 95% of the knowledge in these books is completely understandable without problems (there may be some concepts that are not found in the Japanese language). Therefore, when we translate terms, we explain them in a way that is easy to understand. Example Tuples: Is a list type whose elements can be of different types (a, b). a :: Number. b:: Char.\n\nAuditability: We chose those target numbers based on the communities we interacted with, and those are the target numbers we want to work towards. Why 2%? That is the goal we want to achieve. And that number is achievable\n\"Or the book must come with an obligation - to download it you need to register in the Plutus Pioneer Program.\" - You can only register in the Plutus Pioneer Program when the IOHK form opens. This will limit the number of people who can access this book."}, {"id": 2789, "q0": "The proposal addresses the challenge, and it is an interesting project, since Japanese are not really good at English so the translation of Haskell into Japanese is really needed.\nBesides, HASKELL is not very simple or easy to learn, therefore there is a real need to translate it into Japanese so that more people can understand this language and avoiding this kind of barrier to learn programming, so I think this Haskel Book Japanese translation will be really helpfull for many Japanese.", "q0r": 5, "q1": "Based on PROPOSER's experience, he has over 10 years of experience as a Japanese translator and interpreter. He has 5 years of experience in Haskell programming and also has a\nYoutube channel for Haskell programming tutorials. With +N1 Japanese language skills, fluent in listening, speaking, reading and writing, and over 2 years of experience learning Cardano and evaluating blockchain projects, he is definitely qualified for this job and the feasibility is high.", "q1r": 5, "q2": "It is auditable through checking Japanese translation of the book Learn You a Haskell for Great Good, and see if it reached 500 downloads in the first 3 months. But maybe not easy to audit if 10 developers join the Plutus Pioneer Program or 5 proposals from developers in Japan submitted to Catalyst are related to the book translation. ", "q2r": 3, "assessor": "z_assessor_1579", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thank you very much for taking the time to assess our proposal. \n\nAuditability: The number of developers participating in the Plutus Pioneer course can be measured by registration forms.\r\nThe number of proposals submitted on Catalyst can be checked by \"Has someone referred you to become a proposer?\""}, {"id": 5672, "q0": "This proposal addresses the Developer Ecosystem category by creating a valuable Haskell resource for the Japanese developer community. Haskell knowledge is important for Cardano developers working with Haskell and Plutus, and this book is a good introductory resource. ", "q0r": 5, "q1": "The team listed appears to be an experienced Haskell developer and Japanese interpreter and capable of implementing this proposal. However, the proposer also has a similar proposal for a Vietnamese translation, so it is not clear how the proposer will manage his time between both projects if both of his proposals are funded.  There are no external links provided to verify the information given about the team member Ms.Ha: Japanese interpreter, translator and blockchain project reviewer.\nThe timeline and budget are provided and reasonable, assuming the proposer can manage his time between both this proposal and his other proposal for a Vietnamese translation. ", "q1r": 4, "q2": "The information provided will allow this proposal to be audited by Catalyst management/admins, by reviewing proposer referrals on Catalyst. However; it is not clear how the larger cardano community will be able to verify or audit this proposal, as they may not have access to this information. ", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10163, "q0": "- The proposal shares clearly issue as English is a huge barriers for developers in Japan. \n-Japanese developers need documents about Haskell what are translated to Japanese.\n-The proposal's solution is that they pick up a book Learn You a Haskell for Great Good and translate to Japanese language.\n -The book was written from basic to advance. Moreover, the book is recommanded by IOHK.", "q0r": 5, "q1": "-Its proposal indicates timeline clearly. The proposal gives specific number what the proposal wants to achieve.\n -They have targets to translate 370 pages in one month and share the book to 20 developer community with 500 dowloads in 3 months. \n-The team member, who will do the proposal, have more than 5 years in researching crypto projects, and one of them is an English teacher, he has 7 years experience as translator.", "q1r": 5, "q2": "-The proposal gives specific numbers. They commit completely translate the book in one month. The book will be got 500 download in 3 months. Furthermore, 10 developers will participate Plutus Pioneer Developer Program after 3 months. Afterward, 5 proposals will be submitted to Catalyst. -The specific number of milestone can be easily checked from the proposal's google drive and download views.", "q2r": 5, "assessor": "z_assessor_818", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10191, "q0": "The Japanese Haskell Book will be a useful resource for the Japanese developer community. Japanese developers will easily learn Haskell to write smart contracts without the difficulty of the English language barrier. With the book Haskell, it is possible to contribute to the growth of the Japanese developer community. This is consistent with the problem given by Challenge.", "q0r": 5, "q1": "The plan is clearly stated and easy to understand. The book will be translated and distributed among the Japanese community in about 3 months. This period is suitable for translating, editing, and sharing the book with the Japanese developer community. Then will evaluate the results that the book brings. The KPIs are also set specifically for the second and third months.\nThe budget is mainly translation costs with a unit price of $ 25 per page.\nRegarding the project development team, the book is translated into Japanese by a member who is fluent in Japanese, and technical issues will be supported by a member with experience in Haskell programming.\nBased on the points above, I think the project is feasible, doable.", "q1r": 5, "q2": "The project has a clear implementation roadmap. Progress metrics, KPIs are reported and measurable. 500 downloads in the first 3 months, 10 developers participating in Plutus' pioneer program, 5 proposals from developers in Japan submitted to Catalyst.", "q2r": 4, "assessor": "z_assessor_823", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10289, "q0": "This is a project with potential. It effectively tackles the challenge. Cardano's Smart Contract is built on Haskell. But there is no book or document about Haskell for developers in Japan. This proposal translates the book Learn You a Haskell for Great Good into Japanese and share it with current Developer communities in Japan. That will attract a large number of developers in Japan to access Cardano.", "q0r": 5, "q1": "The team you provided has experience and skills in the following fields: Haskell Developer, apanese interpreter, translator,... However, I couldn't find the team's profile, you can supplement it by adding add their Linkedin, Telegram links.\nThe roadmap and work in each month are listed in detail. Did you mention that you will introduce the book to the developer community in Japan, so how many members are there specifically? The criteria to evaluate the success are very clear, it makes it easy for everyone to monitor and evaluate its success. Allocate the right budget, $25 per page.", "q1r": 4, "q2": "Also, I appreciate how you deal with risks by creating detailed video tutorials on Youtube. I've tried accessing and watching a few of your videos on youtube, it's quite quality, receiving many positive comments from viewers.\nBased on the information provided, CAs can fully assess the success of this project. If this project is successfully implemented, in the future I think you should combine many different books, translated into many different languages. Thank you!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10724, "q0": "Haskell book for beginners that works for non-programmers and experienced hackers alike. Haskell is the main technology that helps us deliver high quality software. There are various criteria to judge software quality, but the most important ones are correctness, performance, and maintainability. Since cardano is also smart contract is built on Haskell, Since Haskell makes everyone to feel programming experience without non-programmers and experienced hackers alike, Since developers of Japan do not have no book or document about Haskell for local developers, The proposer idea is translating books into Japanese  is great idea, As proposer wants to translate Learn You a Haskell for Great Good into Japanese , and share it with current Developer communities in Japan,\n This proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposer team has Haskell developer with more than 5 years of experience,\nthey also have Japanese translator who has more than 10 years of experience, \nFor today's Blockchain platforms, especially Cardano, developers are one of the most important forces helping to develop decentralized applications on Cardano.\nWith providing support and infrastructure to Japanese developers will have access to Blockchain and Smart Contract documents.\nLearn You a Haskell for Great Good is one of the books full of Haskell knowledge from basic to advanced (recommendation from IOHK when you want to start learning Plutus Pioneer Program),\nproposer wants to bring document along with other Haskell documents that we have translated previously to the developer communities interested in blockchain in Japan.\nthey also create detailed video tutorials on Youtube to help developers who have difficulty reading books which is similar to white board, With Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer will provide he number of developers participating in the Plutus Pioneer course can be measured by registration forms,\nTranslation cost given is also reasonable for auditing, The completed project looking like Complete Japanese translation of the book  Learn You a Haskell for Great Good, \nProposer is providing Complete Japanese translation of the book Learn You a Haskell for Great Good, Reaching minimum of 500 downloads in first 3 months, \nmany developers onboarding,\n10 developers join the Plutus Pioneer Program,\n5 proposals from developers in Japan submitted to Catalyst,\nwith above all the details shared by prosper this information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "We will translate the book Learn You a Haskell for Great Good into Japanese and share it with current Developer communities in Japan.", "experience": "Our team has a Haskell developer with 5 years of Haskell experience and a Japanese interpreter with 10 years of experience (Japanese Language Proficiency Test level N1)"}