{"id": 404509, "author": "stanimir.ilic", "title": "NoCode ADA Blockchain as a Service", "url": "https://cardano.ideascale.com/a/dtd/404509-48088", "category": 26433, "amount": 114000, "description": "No easy process of setting up local ADA infrastructure for running complex network tests, creating&deploying smart contracts for beginners.", "funded": 1, "upvotes": 71675594, "downvotes": 19517974, "votes_result": 52157620, "votes_cast": 482, "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 183, "q0": "The proposal has good alignment with the challenge setting. It aims to build a 1 click solution that would let new develops to get started quickly developing and prototyping on Cardano. The challenge setting asks for tools to bring devs to Cardano fast and let them have a pleasant experience and the proposal aims to do that (something similar to Truffle on Ethereum) by 1) creating ad-hoc private networks on Cardano; 2) click to deploy; 3) Generating smart contracts; 4) Deploying smart contracts; 5) Rest APIs; 6) blockchain vizualisation; 7) Education\n\nThe proposal looks a little like a template that could be repeated for any blockchain and I would have liked for a little more research to have gone into what actually is needed, as a lot of the tooling already exists and the challenge making it all talk to each other and running as a 1 service rather than multiple services. Also no mention is given of the existing services that the team would need to include into the solution. For example there isn't actually a deploy of a smart contract on Cardano as it doesn't reside anywhere on the blockchain, but only a an address that is generated from the CborHex of the contract (in contrast to deployment of the contract does atcually happen on Ethereum which this proposal suggest) therefore this looks little like a template proposal. For this reason I give a 4 as it fits the challenge, but lacks on the specifics", "q0r": 4, "q1": "This section describes a generic project plan and lacks specific on the components of Cardano. This suggest that the team has not done material in depth reasearch of the difficulties that they might face during integration of the components. It also lacks market information on what tools are already available and where it would be smooth-sailing and where they should expect more challenge. For example, querying the blockchain data on Cardano is well understood and there is a graphql docker that can be deployed quite easily by anyone and there is also a 3rd party services (blockfrost) that offer this, similar to integrating a wallet is well understood as there are now 5+ wallets available plus a reliable wallet backend released by IOG. However, the topic of how to generate smart contracts is much more difficult as this is more recent release and generating and interacting with the smart contract will be much more of a challenge to streamline.\n\nThe team is made up of capable engineers and scientists with track record on linkedin. They do not however have a connection to Cardano and are coming fresh. The proposal could benefit from more research and specifics on how it would be done on Cardano rather than treating Cardano as a generic blockchain. For this reason a significant portion of the 114k budget would likely be spent on getting up to speed and proof of concept. This doesn't hover take away from being able to deliver, but just makes it more expensive. In summary a capable team, but coming fresh, so at that budget delivery is possible, but there is a risk they face unforeseen delays given the apparent lack of prior knowledge of Cardano", "q1r": 4, "q2": "The project will be judged on if a new dev can get up and running within a short period of time, or can't. This is fairly binary and can be judged by asking an experienced Ethereum developer to have a go. And test each of the promised aims from the Assessment. The proposer gives a comprehensive delivery schedule, although there is some vagueness in what some of the statements mean such as \"backend and frontend are 100% integrated\" this is most likely from the still needed research of the key components of Cardano that will need to be integrated. For this reason I agree, but can not strongly agree which would require a KPI plan for the services to be integrated.", "q2r": 4, "assessor": "z_assessor_1076", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 328, "q0": "The proposal would be within the challenge goal, this is a great idea, and I think that this proposal probably will increase utility & adoption of Cardano blockchain and builted for a great community (developers and consumers). At the same time the statement of how problem is to be solved is explained with a technical elements of the offered services, so I suggest to define use cases and offering, because in the documentation provided there are only component use examples.\nHowever the objective of the proposal is very interesting, but I think it's important to improve details about the proposal services solution for the challenge (eg. Typical services use case for developer, example benefit for service creator and community, …)\nThe proposal clearly articulates the contest, the problem (actual difficulty in view Cardano building application ecosystem) and how it will add value to the Cardano ecosystem and for all of the stakeholders.", "q0r": 4, "q1": "This proposal is well written and clearly demonstrate the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community: The core team consists of 5 people with several years of experience  and with proven professional skill in Linkedin throught given direct link.\nThe proposer team  is well skilled about the whole context of the proposal  (Manager, full stack developer, marketing, research)\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it’s convincing.\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon,\nThe budget is high and the deliverable plan provides POC and MVP to reach small term objective. I suggest to proposer to introduce a cost break down analysis to identify revenues model and improve the strengthen of the proposal feasibility.", "q1r": 5, "q2": "Only simple KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) Also the proposer has not mentioned possible difficulties, but no informations about market competitors.", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3591, "q0": "From my basic comprehension of the proposal, the proposal explicitly explains that the current setback for an import of users on a large scale is the technical terminology, which makes it difficult for not only newcomers but also businesses to smoothly operate on the blockchain and exploit its properties. Therefore, this project aims towards a more user-friendly and intelligible experience while using the Cardano blockchain by creating a BaaS platform, which, in theory, should lessen the amount of work in the development phase and enable developers to focus more on the client-side tasks, and it is also stated that there will be educational materials and tutorials for all levels of users. I become more of a follower of this project when the proposer claims that the ADA-specialized BaaS service will be free of charge to users and only charge some fees if users tap into the cloud resources. With all those said features, I believe the preferred success for the project, which are the faster and easier mastery of Cardano process and the extra adoption of users to the ecosystem as a whole, should comfortably fit the main objective of this challenge. The proposal also introduces three possible challenges in the foreseeable future, and creditably, encloses three viable resolutions to mitigate said challenges", "q0r": 5, "q1": "I must congratulate the team on putting up such a sophisticated and detailed performance for this criteria. Going into details, this is a well thought-out and crafted plan, which includes a specific deadline of completion for each phase of development, what tasks will be assigned in each phase and the respective expected milestones. The proposal also includes some adequately detailed sets of information regarding the project members, namely, past accomplishments of the team, and the background and expertise of each individual demonstrated via respective LinkedIn links so that the community can inspect more carefully", "q1r": 5, "q2": "Even though the desired achievements have been aforementioned in the milestones above, I would suggest that the proposal utilize some tracking tools or platforms, such as ClickUp or Github, for easy access and more convenient progress tracking for the public eye. Nonetheless, one interesting feature that sets this project apart from the others is the divergence of success metrics at two stages of the project. Still, the metrics chosen to measure success in both divisions, which are the desired state of user-friendliness and ease-of-operation and the envisioned great amount of user adoption, are closely related to the initial ones in the challenge setting", "q2r": 5, "assessor": "z_assessor_1664", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3650, "q0": "The proposal is well-written in terms of how this solution solves the problem of the given challenge and how impactful it is to new developers. Realizing the lack of technical knowledge related to blockchain technology, which leads to facing difficulties in comprehending and using the technology. This solution provided the first Cardano Bass web application that offers easy prototyping of Cardano through blockchain as the first step to make Cardano applicable to as many business use-cases is easy prototyping of private Cardano blockchain networks. In fact, it makes the process of building apps on Cardano easy, user-friendly, and streamlined, so that it enables new developers without sufficient skills and knowledge to engage in Cardano. This will gradually lower the entry barrier for people to join and exploit blockchain technology. Besides, It clearly mentioned its components, its functions in a description with a given graph to better illustrate. It is highly evaluated here is that it provided a link to a video showing a demo of how to use this solution to make the building apps process on Cardano easier and more convenient. This will help people better visualize the solution and how feasible and beneficial it is. It also aims for a long-term goal of fostering future ADA blockchain features and services created by the community, so this project seems to be prospective and have a huge impact on the Cardano ecosystem in the future. A detailed explanation and an example taken were given to clarify this goal. Last but not least, it listed three potential challenges that this project may face while executing including the constant upgrade on Cardano, Blockchain complexity, and less user engagement. And how to mitigate these risks were given showing its certainty to operate smoothly.", "q0r": 5, "q1": "A plan with a timeline and a figure is quite clear and detailed to visualize what will happen in the process of delivering this project. The description of each phase and the detail of each small step was given in order. The budget was given in great detail with the illustration of the attached excel sheet. It seems to be transparent to audit all the costs used. This proposal is led by a team with rich experience in similar projects. Its latest project also relates to a service platform that can help make the complex blockchain setup and blockchain usage simple and easy to handle. So that experience would come in handy for them to operate this project successfully. Besides, it described its core team which used to work on several, large-scale projects in Europe. However, it would be more persuasive if the profile, skill, and related experience of outstanding staff were mentioned.", "q1r": 4, "q2": "With the description in the attached figure about goals, features, quantitative, and qualitative metrics, it is quite clear to audit, track, and trace the progress and the development of this project. Besides, it also did a great job in giving criteria to evaluate the success of the project when it is in execution and after its execution. People would find it clear to visualize what the success looks like if the project meets all given metrics. There is just one minor information that it should mention on this part is whether this is a totally new project or it is a part of a project that was funded before.", "q2r": 4, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8074, "q0": "This is one of the vital projects for the future development of blockchain technology. As the proposer mentioned in the proposal, their idea will help to build an ADA-BaaS solution to help fasten the development of the whole ecosystem by a click-to-deploy model. The proposer provided very detailed content about how their service work, including a video clip to visualize how it works very clearly and is easy to do, understand that I believe this can help developers cut a lot of time cost for their development. Moreover, they're not just providing the technical development of their product only, but also make a detailed content about how to acquire customers in the future with 3 main activities that as my experiences in the marketing industry - they will help to spread their service widely to the anyone need to develop their idea on the blockchain network, especially the Cardano network. Furthermore, they're aware clearly of challenges that they will face and have some strategy to mitigate them. That so, I will rate them for 5 in this session because of their detailed content is very to understand and clear. ", "q0r": 5, "q1": "The proposer also writes a very detailed roadmap with 3 phases that I believe well connect to their solution above. The content in the roadmap is clearly explained which part of their solution will be developed and specific outcomes will be made. That detail can help us assess that the budget is reasonable because it was divided into every single phase and state out which position that budget will be invested. The information that the proposer provide in the team session is very helpful to assess the ability of their member to adapt to this project's development requirements. Their members have previously worked on multiple, large-scale research projects in Europe to help create a lot of useful blockchain solution. So I believe that they can make this project success. ", "q1r": 5, "q2": "The proposer provides a clear visualized image of their goals with the roadmap that can help the community to track their progress and key metrics very easily. Each phase even has its own specific metrics to measure. Moreover, they are also clear about their success key metrics into in-project and post-project key metrics that I believe can help us to full audit the performance and progress of their project. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10389, "q0": "The proposal's problem statement is within or in alignment  with the challenge objectives. Any idea that makes use of the blockchain network easier and faster, and ensuring greater adoption of cardano network for wider use cases is welcomed. The proposal seeks to build a web application that ensures that prototyping of private cardano blockchain networks and it has the potential to increase the productivity of developers as they concentrate what is more important and thus creating a great user experience for developer community in the ecosystem.", "q0r": 5, "q1": "The proposal team's profile is clearly explained with specific links to attest to their experience, skills and competence. The Budget estimate was also explained although the budget seems reasonable, it should have included basis of arriving at the figures for completeness and adequacy. The Milestones on implementation of the project were also explicitly explained in details and achievable within the stated time frame. Considering their past experiences and achievements in creating  viable commercial and industrial blockchain solutions, am confident that the project will be effectively implemented", "q1r": 4, "q2": "The proposal has reasonably presented a detailed basis and metrics to monitor and assess its performance. In addition, the well articulated  Milestones can also serve as an effective measure to confirm the project's progress and devlopment, if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Web application enabling easy&user-friendly fast prototyping with ADA, integration with wallets and smart contracts generation & deployment.", "experience": "Since 2016, team has launched many commercial blockchain products enabling individual users and companies pursue their business objectives (e.g. chainrider.io and vladam.ai) with following technologies: Hyperledger, Ethereum, Bitcoin, Dash, NuCypher, IPFS."}