{"id": 405253, "author": "lutvirosyady", "title": "Loyalty Point for Developers", "url": "https://cardano.ideascale.com/a/dtd/405253-48088", "category": 26433, "amount": 100000, "description": "There will be no specific Loyalty Point for developer that based on Blockchain. It's kind of appreciation for every single contribution made", "funded": 0, "upvotes": 30266393, "downvotes": 38899821, "votes_result": 8633428, "votes_cast": 297, "f6_no_assessments": 8, "f6_rating": 2.2083333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 2421, "q0": "The project is very unconvincing, not highly applicable. The issue the project raised is unclear, completely failing to explain the impact the project has on the Cardano community. I am not impressed with this project at all, therefore I disagree.", "q0r": 1, "q1": "Number of years of experience, member information is not presented in the project, project completion time is not mentioned, only the amount of money to be disbursed is required. With what the project offers like that, I think that the information is sketchy, not convincing me. I completely disagree with this project. ", "q1r": 1, "q2": "The finished project will be posted on github, we can check, but the important thing is that the presentation in the project is very unprofessional, very sketchy, then I think the quality of the project will not be good. . I need clear information like what the purpose of the project is, how it will be useful, basic information about the people involved in the project, maybe they are very good, but I have to evaluate the project as unsuccessful. ", "q2r": 1, "assessor": "z_assessor_1488", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3816, "q0": "The problems encountered and the resolution of the problems are very suitable where this proposal wants to make it easier for developers to get reward points such as examples that have been running in this proposal team company. If you look at how the application works, it is like a stackoverflow or knowledge management system in enterprises. And it is also not shown what the impact on the cardano ecosystem will be with this loyalty point.", "q0r": 3, "q1": "This proposal has provided an overview of the exact schedule or timeline and date for its implementation complete with the required budget. Only in the determination of the team, the complete information on the qualifications of each engineer and leader is not given. And in my opinion the operational office is not really needed because now we can easily work online with the pandemic and can use our own equipment. Maybe the office budget can be converted into internet costs only. It also doesn't explain how this application will attract developers to be able to use it and receive loyalty points from it.", "q1r": 3, "q2": "The process for evaluating and auditing the development of this system is good using github. But it's better to add other channels such as Telegram, Discord and invite recommended and targeted developers to use it to evaluate this application so that it matches what they expect about loyalty points.", "q2r": 3, "assessor": "z_assessor_1681", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4710, "q0": "This proposal meets the challenge posed by the project catalyst to increase the number of personnel present in the developer community. A well thought out proposal that takes an innovative approach to support the important onboarding work this team has successfully carried out. As far as I know, according to Incentive theory by Clark Hull, with reward-based then individuals are primarily motivated to take action followed by rewards that are shown through simple loyalty points such as Starbucks points which can be exchanged for drinks that can encourage people. to buy Starbucks again and again, and this also applies to developers (if you find a bug, you can get a badge/achievement/point as described above). Apart from that, I also like the idea beyond loyalty points which is to share solutions, create certain challenges that can attract developers' interest so that the developer community can expand, and training for new developers/technicians so that they can also know about certain programming languages ​​that are relevant. required and also regarding the cardano environment.", "q0r": 4, "q1": "The proposers have not provided any information about their skills and experience. What's more, there are no details about who they are or references on certain pages about the profiles of each member, which shows the lack of credibility of this proposal. The proposal outlines the complete roadmap for the project, but needs details for every phase that is going on. For example, for market penetration, what are you doing?, who are the audiences?, is it enough for two months to penetrate the market with the existing target? and others. In the end, if based on this information (in the proposal) it is still between feasible and not feasible to carry out so it is necessary to add more details and information so that this proposal is doable.", "q1r": 3, "q2": "There is no roadmap with milestones. There are no metrics or KPIs, nor is a description of the success of the project clearly articulated. As no clear plan is provided regarding what the funds would be spent on, it is rather difficult to imaging auditing the progress and success. In conclusion, the idea of a team of teams is intriguing and could be powerful. More specifics regarding metrics, tasks, and objectives would be helpful. in the other hand, there are no risks or challenges mentioned. Yeah, we know that making it to github and accessible is a good idea but not enough and need more key metrics that make sure this program is auditable and run smoothly. It should be better if this proposal using SMART goals for instance, the goal to build the addon is \"S\"pecific, \"M\"easurable, \"A\"chievable, \"R\"easonable and \"T\"imebound as guiding.", "q2r": 2, "assessor": "z_assessor_1750", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7568, "q0": "As an idea this proposal is nice or at least noble. To give a reward or an appreciation for Cardano developers. But the question is why, is the main goal to attract more developers? If yes - would a programmer/developer start developing in Cardano just to get a loyalty points? Not really imho. I think impact is not described well nor what exactly will be built.", "q0r": 1, "q1": "The team is presented but the team's exp is missing (linkedin links would've been better) so it's unclear whether the team is capable to deliver the product - which itself is not clearly described (is it only a contribution counter?)\nAlso reading the proposal I had a feeling the proposer team is not so good in english which I find essential to effectively describe the purpose of this product but also to communicate to the audience.", "q1r": 2, "q2": "This proposal is not clear on the following points : - No clear deliverables - KPI not shown - Risks and challenges are not presented. Proposal's progress can not be easily audited.\nDue to the above I can't agree with this proposal because I doubt the realization of the proposal has a fair chance of success.", "q2r": 1, "assessor": "z_assessor_605", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7746, "q0": "It's a good idea to create Loyalty Points for Cardano Developers, but I think the proposal is still raw because the proposer doesn't explain what can be redeemed for Loyalty Points and other uses. They said that previously they had succeeded in creating point rewards in their office for free wifi inflight, with many merchants joining to redeem points with their goods. I think if the proposer hasn't done any market research in the Cardano developer ecosystem, at least the proposer can elaborate with their last Point Rewards project so that CA / vCA or Voters can understand the idea submitted.", "q0r": 2, "q1": "For this raw proposal, I suggest proposer can learn from Catalyst School or their local community to write a proposal in Catalyst Fund.\n\n- Kudos to proposer to put team names. But since anyone can create any names, we need references or links such as LinkedIn profile or Git Hub pages to confirm that all of the members are having relevant skills and experience to implement this project\n\n- Thank you for put the budget in the proposal. But to confirm what software or subscription you will buy, we need some name of the product. So us (CA / vCA) can make sure your budget is realistic and reasonable.\n\n- Need to update the project timetable, because proposer wrote for March to June 2022. While Fund 8 ends in May 2022. And again for the budget, proposer ask for Annual subscription while the timetable only for 3 months.\n\nIt is a great idea. I hope the proposer can improve his proposal, and resubmit in the next Fund. Goodluck! Godspeed!", "q1r": 1, "q2": "To audit this project, the proposer has set up Github to see the progress. Proposer need to update their roadmap to general time, because proposer wrote to work in March to June 2022 (since Fund 8 tallying on May 2022).\n\nThere is no detail Key Metrics. I suggest proposer can wrote:\n- Number of Cardano Developer applying for Loyalty Points\n- Number of Merchants / dApps applying for this project\n- etc", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8243, "q0": "Proposer presents a problem that there is no specific Loyalty Point for developer and offers a solution in a way that will build an application that will record all the contributions made by the developer and based on these records the developer will be rewarded. It would be good if the proposer has developed and presented to the community how this project would have an impact and how would add value to the Cardano ecosystem. Due to the lack of data, deeper elaboration of ideas and explanations, this proposal is not able to scale to address future challenges. Not having KPIs in the proposal makes it hard to compare KPIs with challenge setting.", "q0r": 3, "q1": "A link from Github has been posted from which we can see the emerging idea. In my opinion, the community also needs information about the team and skills, knowledge that is needed to realize this idea and this proposal lacks it. With the budget presented it is necessary to make and develop a detailed feasible plan from which we can see what the team will do within 3 working months and to be able to assess whether the work is in balance with the required budget (100k $) and time specified by the proposer in proposal (3 months) I would like to see elaborated ideas on possible risks and challenges.", "q1r": 2, "q2": "Proposer states that it will publish all the progress regarding the application on Github. It would be great if KPIs were elaborated in detail together with a roadmap that would correspond to the work that could be seen on the mentioned link. Due to the lack of an elaborated work plan and an elaborated roadmap and also elaborated KPIs community cannot follow progress of this idea.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8252, "q0": "This proposal has a great idea for appreciating the work for Dev and what they have contributed but the implementation details are still very general. There are some points that I am thinking are still need to work out more. First of all, What is the targeted DEV that you would like to give point to or it could be any of the DEV and how can you track their activities if they do not work under 1 project. Will there be an application for any DEV that are interested they can register and get the point? Where will the continuos fund that supports these redeemable rewards as it will be a huge number? From my point of view, this is a great idea but needs to be worked out in more details.", "q0r": 3, "q1": "The proposers provides on Github link but still in TBD, the number of team members is listed but in general words, they can totally gain more trust of voters with their background links like Linked or CV attached. In this case, there is no way that we can track if they have real experiences as stated. The budget is outlined but not in specific details. 5 points have been listed out but the reward for the DEV is not mentioned in the budget, please do correct me if I have a wrong understanding of the budget. There are 4 phases for the roadmap but is only listed very generally. As I can see the Market research is already finished by March 10 but no evidence is shown yet. The challenge risk is mentioned but there is no solution yet. They have good base and only need to detail it more to make it realistic. ", "q1r": 2, "q2": "The auditable is on Github link provided. No key metrics and successful keys are mentioned. This will be very hard to track for its success. My suggestion is that you give a specific number of how many people can this project attract as well as what does success looks like for this proposal. I will wait for your better version of this proposal and will totally support you to make it become real.", "q2r": 2, "assessor": "z_assessor_659", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10394, "q0": "The proposal is an interesting one geared towards creating an incentivization structure within the developers' ecosystem. Surely, this is an idea that create a robust community which engages and motivates developers to contribute to the community. The project's problem statement definitely addresses the challenge settings.", "q0r": 4, "q1": "The team's profile is quite vague. Not much information to verify the authenticity of their experience and competence to deliver this project. In addition, the budget estimate analysis  does not add up as there is a shortfall of usd26,800.00 which was not explained. The Implementation plan of the project is 3 months but it does not concur with the budget which spans a year so there is a disconnect. There is a great deal of work to be done on the project's budget analysis. There is no mention of how the project intends to sustain itself in the long run.", "q1r": 3, "q2": "There is not much information to reasonably attest to the progress and development of the project however, the proposal mentioned that all its activities will be publicly accessible. In addition, there should be  quantifiable metric to assess the success of the project such as number of developers interested in the incentivization scheme and number of badges or reputation points collected as a result of increased activities and engagements by developers within a timeframe. ", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We count all developer activities, from Idea, Problem / Bugs, Solution.\nThere'll appreciation with points and redeemable with no expiration", "experience": "I have build point rewards at my previous company for free wifi inflight.\nThere are so many merchants joined for redeemable items including goods."}