{"id": 414021, "author": "harry.hellyer", "title": "Measuring business impact w Cardano", "url": "https://cardano.ideascale.com/a/dtd/414021-48088", "category": 26605, "amount": 14550, "description": "Current impact value and monetization can be measured with the Edify full value impact tool but it is xlsx based and does not bring any advantage to Cardano or Cardashift.  Yet.", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"id": 5467, "q0": "A wonderful initiative by the Edify team to monetize their tool by making it an online tool, so that it can be used with ease and without much external assistance. The team already has a working tool but is a spreadsheet based and hence its usage is not widely accepted by users and needs a lot of technical expertise to know how to make full use of the tool. The impact this tool has already been delivering is quite huge and the team provides enough use cases to support these claims. The digitalization of this tool to make it publicly available could add more traffic and use instances. If the online tool delivers the same impact as the XLSX version then the aftermath could be enormous. The author also understands the risks involved and has respective mitigation policies in place. This tool eventually could help businesses understand and measure both their commercial income and assets and their cultural performance capabilities and assets, hence meeting the challenge's expectations to a great extent.", "q0r": 5, "q1": "The proposer confidently describes the deliverables we may anticipate, together with the features they come with, and gives the community a clear explanation of the desired business model. However, the proposer still makes specific points about this project alone that all adhere to the expectations one would have given that this proposal is a transition from a spreadsheet tool to an online version. This is because the proposal is titled \"Catalyst Natives X Cardashift: Demonstrating and Monetizing Impact.\" Compact and self-explanatory, the points. The funds requested also looks sensible and rational considering the amount of groundwork and research already done and this would only be utilized to get the architecture and framework finalized. The team would be raising funds for development in the next rounds if its costs exceed the funds raised now. The roles of the team are also very definite and all of them are filled with competent individuals, with almost all roles completely filled, moreover this being the same team that has developed the .xlsx version, there lies very little doubt about the capabilities of the team.", "q1r": 5, "q2": "The KPIs chosen is fair and appropriate to support an exceptional plan and team in place. The main metrics are all in line with what is expected for the challenge and are a direct reflection of the deliverables and action plan that go along with it. The essential measures have been improved in the success criterion and results. I believe the auditing process should be simple and highly productive because the team indicates that it will update the community on its progress and outcomes via Twitter and other social media platforms. The proposal's success should be mostly summarized by the number of organizations participating, the magnitude of the impact made, and the number of businesses that were happy. The operational automated web tool would specify the area of work. Given that the proposal is an online version of an existing tool, it should be simple and uncomplicated to trust the team and assume that they would give all support necessary to monitor their progress and keep them in check.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5535, "q0": "Impact valuation and monetisation is a very critical aspect of this challenge. Currently, the Edify Full value impact tool is available for evaluating impact but it’s has some restrictions or limitations and does not make it convenient to be used. The proposal has identified a problem within it that needs to be solved, hence the problem identified aligns with the challenge. This current available impact tool is of no benefit to Cardano or the cardashift as indicated and therefore means that if there is an edition of the full value dashboard and methodology into an online tool for both on-chain and off-chain use cases, it would be of great value to Cardano as the challenge demands. Running through some of the key metrics and goals, I believe they are in alignment with the challenge setting.\nThe proposal appears to be very scalable considering the fact that the solution will be coded into an online tool to serve as a self-assessment platform. The proposer has provided enough details as to whether the proposal will be sustainable or not. Per what has been provided, I believe in business and environmental wise, the proposal is sustainable. The proposal would also be financially sustainable because the proposer envisions to return to catalyst fund 10 to secure funding.\nConsidering all that have been stated above, I am confident that the proposal is impactful.", "q0r": 5, "q1": "Information provided about the team in the proposal is detailed. Considering the relevant experience described and the work already done, I believe the team is capable of executing the project. The budget is well broken down and understandable and hence it makes auditing the budget easier as it tells how the funds would be used.\nPer the nature of the project, it a huge kind of a project and so therefore the requested amount is reasonable and sensible to execute it. \nThe roadmap presented here is very detailed with clarity in the timeline and even the milestones (it can be seen in the project roadmap link attached). The plan appears to provide means to make it possible for every user to understand the impact tool to be developed so that they can all assess current and future impact of projects. It’s good effort that the proposer has foreseen the risks that may arise during the implementation of the project and has provided measures to mitigate them. \nConsidering all this stated above, I am confident that the project is feasible.", "q1r": 4, "q2": "The roadmap’s milestones and time horizon are very clear to identify and understanding. This clarity makes auditing of the project easier. \nThe metrics/KPIs were wisely chosen and hence I am confident that they are good indicators for measuring success of the project as the chosen outputs indicate the number of organizations participating in the programme, the value of impact derived for the participants and the measure of satisfaction on completion of the programme.\nThere is clarity in the problem described and I believe the proposed solution is effective to address the problem. The proposer has provided an accessible public channel for delivering regular updates to the community that is project updates would be communicated or shared on their Twitter channel @edifycolabs. I will also suggest that the team makes use of the catalyst community channels on Telegram, Discord and the rest of the platforms.\nI am of the assurance that the project is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6411, "q0": "This proposal suggests that there is a current challenge we face in the Cardano ecosystem. That is being able to measure the impact of a business or project on Cardano. There are lots of projects building on-chain right now. But how can the community determine which projects have the most impact? Or which projects have the most utility. In other words, why go through several different websites to receive pieces of information from each? Shouldn't there be a place you can go to measure this impact? This proposal suggests creating a project that can fill this gap. This could have a major impact on the Cardano community because it gives access to more tools that can benefit community members and even potentially developers. This plan is specified towards Cardano and Cardashift which is very unique and will likely bring real-world value to these areas. This can lead to a global impact and could increase the number of users that use Cardano. The team plans on creating a dashboard that will \"measure\" different metrics to help them determine which projects can have the most impact on Cardano. For all these reasons, I give this section of the proposal 5 stars.", "q0r": 5, "q1": "I was impressed with the team experience section of the proposal. It is important to include the identity behind the team members. The proposal includes Linkedin profiles of lots of the members and there is also a great description of all of the skills and experience for each member. This is important because it shows the determination from the team and also implies that it is more likely that the proposal will be implemented successfully. This is mostly due to the concept of accountability. Since the team has provided their identity, the community can hold this team accountable for their proposed ideas. There is also a very specific roadmap that includes a link to a different page that includes the projects plan with specific details on what they plan to include and the timeframe behind it. It is split up into different phases and includes everything the team plans on accomplishing in order to help create their dashboard that will monitor the business impact for projects. There is also a detailed budget breakdown that gives details on exactly where the requested funds will be allocated if funded. This is important because it allows the team to be held accountable for these goals. These specific metrics are important because it provides structure to their proposal and helps determine the likelihood of the team being capable of implementing this proposal successfully. Because of all of this information provided and the detailed plan. I give this section of the proposal 5 stars.", "q1r": 5, "q2": "As stated before, this proposal includes a lot of specific details and information. There is clearly a sufficient amount of information to audit the overall success of this project. It is great to see that the team has provided specific information about their team, roadmap, and budget breakdown. When auditing the potential success of a proposal. There are some ideas that should be considered. The first one is building a community and transparency from the team. When the team behind a project is open with their community and completely transparent with all information. Trust is built and it excites the community members for the project to be released. Especially when it is something that can allow the user to receive utility from it. In this case, they will be able to measure the impact of certain businesses or projects on Cardano. Another principle that is important is the idea of accountability. The team should consider what they plan to do in order to create a community and how they plan to be transparent with them. This will promote further accountability to take place and ultimately lead to the success of this proposal. For these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12333, "q0": "The idea is to convert the existing full value dashboard tool and methodology into an online tool that is used in both on-chain and off-chain use cases, and at mass scale to measure current and future impact. The idea seeks to make an impact in the business environment that operates on existing on-chain to a new frontier of a on-chain and off-chain tool. Furthermore, the proposal will result in an online tool that enables clients of Edify co-Lab to self -audit their impact that will in turn enable coaching and mentoring towards impact and growth. I believe the idea is to come out with solutions to the future of business auditing online thereby contributing to the cardano ecosystem. In the process it will develop existing spreedsheet band tool into an online product. This will then be used to help businesses understand and measure both their commercial income and assets, and cultural capabilities and assets. The proposal addresses the problem which seeks to contribute on the cardano ecosystem.", "q0r": 4, "q1": "The team is an experienced team in the area with several years of experience to show. This shows a capable team who can deliver in achieving their set goals of the project. The budget is very brief given a reasonable budget cost to its implementation. The proposal has provided a roadmap on how the project intends to carryout its activities. This has provided a link to the plan. The project intends to use key milestones in its implementation. I believe if the proposal receives the necessary funding it can be implemented.", "q1r": 4, "q2": "There is clarity of information in addressing the problem. The proposal has provided a detailed roadmap with milestones to carryout its objectives.\nThe project has provided key metrics/ KPI's on how the project will be achieving its goals after it is implemented. Examples are the number of organizations participating in the programme and measure of satisfaction of completion of the programme.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 15397, "q0": "The proposers This proposal seeks to convert a impact measurement tool capturing the full value of the work they do into a more scalable version that can be used by clients. Currently, it is in MS Sheet format, which seem to suggest that they simply have a spreadsheet with various stakeholders and aspects that ought to be considered as impactful. There are not many details about what exactly this is. They hope to convert this into a Web3 version later down the line, to be used by clients of Edify. It aligns well with the challenge question in that it provides a tool for measuring impact but the lack of details about their excel sheet means that it is unclear what the value of this product really is. The challenge with impact is the determination of which stakeholder to analyse but also the ways in which this is measured. With structured data, one can make better estimates of value and hence impact. ", "q0r": 4, "q1": "The team is very experienced in management and business. For example, Harry Hellyer has experience coaching fellows at the University of Cambridge in entrepreneurship and Alan Casey is a member of RSA, the royal society of arts. The third member, Mule, has a run a management company for 15 years and he is the designated product manager for this project. They breakdown salaries of each participant along with hourly cost estimates, all in the range $150/hr. This is roughly equal to consultancy costs of western development consultancies but, in the future, I suggest the team look into cheaper developers from eastern Europe, India or other places, to improve cost efficiency of the funds. ", "q1r": 5, "q2": "They provide three metrics that measure the business outcomes. They include participating orgs, value of impact derived and satisfaction of completion of programme. None of these refer to progress of the development itself. They mention that they will have milestones but these are not detailed at all. However, they do note that there will be Twitter page for updates on the project but without committing to a specific interval for this reporting.  ", "q2r": 2, "assessor": "z_assessor_2447", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Convert our existing Full Value Dashboard tool and methodology into an online tool that is used in both on-chain and off-chain use cases, and used at mass scale to measure current and future Impact.", "experience": "Edify CoLabs has a long track record of working with impact led technology based businesses using a methodology and tool for measuring the full impact value of their operations.  Additionally, we have experience of codifying business processes into technology solutions."}