{"id": 414167, "author": "jamesarthur", "title": "Micro Loan DAO for Sustainable SMEs", "url": "https://cardano.ideascale.com/a/dtd/414167-48088", "category": 26605, "amount": 14250, "description": "Small & Medium Sized Enterprises often lack the financial capital, technology, and knowledge to implement sustainability initiatives, which is a vital issue, as they make up 92% of businesses globally", "f6_no_assessments": 8, "f6_rating": 4.291666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 11753, "q0": "The solution and problem outlined in this proposal are perfectly aligned with the challenge setting. The author's idea is to establish a DAO that supports providing interest-free micro-loans to SMEs, and accompanying the issuance of an impact token that measures the success of SDG on the Cardano blockchain. The direct objective is to help SMEs access capital with minimal barriers to entry, connect SMEs, and facilitate civil society members to invest in potential projects. The indirect goal is to promote the success of SDGs, expand Cardano's influence in public awareness. However, the author states that this proposal is currently limited to the initial stage of impact assessment and development (in the form of SME seminars and Hackathons). If approved by the community, the next development phases of the project will be further proposed in the next Funds. Personally, I consider the information of the proposal and the impacts stated to be direct, logical and clear, fully aligned with the spirit of Cardano. This is exactly what we were looking for in this challenge. I believe that Cardano's blockchain technology will be effectively used to create social value and sustainable development for the SME community, especially in Southeast Asian countries. In Vietnam, the Southeast Asian country where I live, SMEs account for 98% of all operating businesses, which is also the group most vulnerable to the impact of Covid-19 and most likely to go bankrupt. Currently, the difficulty of credit capital is also one of the biggest difficulties facing SMEs. In early 2022, the interest rate for short-term loans to newly granted enterprises is 4.5%/year, for other fields from 7-9%/year; Popular medium and long-term loan interest rates range from 9-11.5%/year (https://www.binhthuan.gov.vn/4/469/52723/614985/ Kinh-te-xa-hoi/he- thong-ngan-hang-tiep-tuc-duy-tri-cac-goi-tin-dung-ho-tro-khach-hang.aspx). Personally, I find out, there are 3 barriers SMEs are facing when accessing loans: first, their collateral is not enough; second, their cash flows and financial statements do not meet the bank's due diligence requirements; third, their business strategic plan is not convincing enough. Therefore, I believe that the proposed DAO mechanism will open up fair, transparent and timely opportunities for SMEs to access capital. The proposed loan process is detailed, logical and reasonable. However, here the author proposes a loan limit of $30000, the disbursement period is 20 days after the enterprise's proposal is accepted for funding. Personally, I think that these numbers should be established after the author has conducted outreach workshops and surveys of SMEs. This will help the amount of funding to be determined and the time to determine the disbursement is reasonable, meeting the actual needs of the business. I also suggest that the disbursement should be divided into 2-3 stages, corresponding to the business's capital use plan and goals. The appraisal of the financial/business capacity of the SMEs applying for funding, in my opinion, is also an important factor that should be built into clear criteria in the DAO. I believe that the capital support only works for relatively healthy businesses, turning business opportunities into revenue and profit. For businesses that are already weak, they may not be able to absorb funding and not use it effectively. Overall, I appreciate the impact of this solution. My score is 5.", "q0r": 5, "q1": "As for the feasibility of the solution, I must give praise to the author. The proposed implementation roadmap is described in detail and clearly with 9 implementation steps. The budget is divided specifically, logically and reasonably for each item. The time frame for implementing the entire proposal is 12 months, broken down by the target time of each specific work item (weekly/monthly). I just ask the author to add some clarifications. For example: the expected number of members of the initial core project team, the expected size of the workshop for the SME, the minimum number of SME that will be approached and surveyed, etc. Also related to the project budget, due to fluctuations in the value of cryptocurrencies during the decline cycle, I suggest that the author add a provision of 10-15% of the total budget. This ensures that work items lasting for 12 months will not be affected much by lack of financial resources. Regarding the skills and experience of the proponent, the links provided are complete, clear, and completely verifiable to the profile and related information. The author is a lecturer at the University of Vienna, also a current PhD Candidate at the University of Vienna who is researching the potential of Blockchain to improve the sustainability and circularity of urban transformation flows. I believe, with the knowledge and ability of the author, this proposal will most likely be implemented successfully. My score is 5 points.", "q1r": 5, "q2": "Regarding the necessary aspects to evaluate auditability, the author has provided a process to measure and describe the success of the proposal with 4 specific objectives to be achieved for each stage: establishment of a stakeholder group industry to improve SME sustainability globally, successfully organized an SME workshop (in Vienna, Austria), successfully launched a Hackathon, and built specific formula of the DAO structure (with tokenomics model, audit process, and impact token integration plan). However, it is a pity that the author lacks specific KPIs to measure success here. For example, at least how many SMEs will participate in the workshop? How many SMEs provide feedback? Number of SMEs willing to participate in the DAO… This allows the community to understand what outcomes should be expected during the implementation of the proposal. Here, only have one number is provided, it is expected that there will be at least 10 groups join hackathons to help improve the design of the DAO structure. However, in my opinion this is not enough to measure the success of the entire project. Overall, I believe this is a good project that will add value to our Cardano ecosystem if approved by the community. I rate 4 points in the auditability of the project, after deducting -1 point for lack of KPIs.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1189, "q0": "The proposal was written by a lecturer at the University of Vienna. This is a proposal on building a decentralized organization (or semi-decentralized through Hackathons) to support SMEs (Small and Medium Sized Enterprises). According to his analysis, SMEs account for 90% of the total number of businesses globally, so if this project is implemented, it will actively support and profoundly affect these businesses; help promote more sustainable development.\nIn the solution analysis that he gave. Because the DAO construction process cannot be completed immediately, it is not possible to immediately build a decentralized solution, but it is necessary to go through Hackathons to find businesses worthy of support.\nI completely agree with this idea.", "q0r": 5, "q1": "He built a working roadmap within 9 months. I agree with most of the work he offers: recruiting and setting up teams, communicating, mentoring SMEs and getting their feedback through seminars, organizing hackathons.. .\nHowever, he does not have any social media channels or official website to post information, helping the community to track the progress of work.\nHis work plan has not been quantified by numbers, detailed KPIs to be able to closely evaluate the progress of work.\nRegarding the budget he proposed is reasonable, the cost items are clear enough but need more details, especially the equipment, the rental price of the event venue...\nHe doesn't have a team at the moment, and will recruit them when funded so I can't give a top score yet.", "q1r": 4, "q2": "Because in his plan he doesn't have clear target numbers for: Number of SME participants, Number of company in each Hackathon that he will organize... Therefore, we can't imagine the level of implementation yet. , and how the project progress will be in terms of time, scale of impact. And does he plan to launch the project multinational or just in Vienna.\nI like the idea of ​​building a DAO in the future and issuing tokens to measure the success of supported SMEs, but the technical explanation is not really clear, so they are quite difficult to understand. How will the user help him?\nAfter all, I like this idea, it could become a typical project on cardano about supporting SMEs. However, it needs to be done in practice for some time before the plans and ideas here can be put into practice.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2386, "q0": "According to the general objectives of the challenge in which the proposal is found, we realized that in fact the objective fits the goals of the same, as well as the success of the proposal has a potential to, in the medium and long term, help to quantify and popularize those investments that have a social impact bias. However, despite the correct belonging of the idea to the challenge in which it finds itself, it seems valid to mention that the general idea of the project does not yet have so much definition. It is true that the purpose of the proposal is clear, to facilitate the loan for small businesses to invest in sustainable actions; but it seems that a more concrete way to build this platform has not yet been formed, even considering that this preliminary stage will be more research-oriented; this argument will be better defended in the feasibility section. Regarding the budget being requested, we have that the amount seems to be consistent with what is planned to be done.", "q0r": 3, "q1": "The ideas present in the feasibility section show us that in fact the point where we want to reach is quite clear, but as mentioned initially, we were not able to have a concrete understanding that the chosen action strategy is the best for the project objective to be achieved. accomplished. It seems that many fronts of action were taken into account, when perhaps it would be more interesting to choose some central points to be developed. For example, we noticed the existence of transactional details already structured, such as the existence of a fractional NFT token and even a future concern with governance tokens; but there seems to be a need for a greater focus on actions that actually aim to convince people of the importance of establishing a valuation for sustainable stocks and how these actions can, in fact, bring a financial return, as well as other more traditional investments. From the characteristics described in the feasibility section, we can see that the main professional involved, James Vandenberg, has excellent technical requirements that converge very well with the project's intentions, in addition to his curriculum being made available. But given the intended scope of action of the project, it would be interesting if other professionals from complementary areas had already been contacted in advance to compose the team, we noticed that many positions are still open for the formation of the team. Given the general objectives initially exposed by the project, we have that the distribution of the initial budget makes sense, there is no excessive allocation of capital; however, there is once again the caveat that an initially leaner and less comprehensive action plan would be interesting.", "q1r": 3, "q2": "Despite the aforementioned reservations, regarding the way of measuring the project results, we perceive the exposition of very clear and direct ideas. We note the existence of evident quantitative parameters that work as a precise tool to understand the scope of this type of fundraising. Counting the number of companies that provided feedback or that show interest in participating in the future DAO is a good indicator to understand if the ideas exposed are being clear enough. Regarding the perception of success of the project, we also see that it is well aligned with what is expected of a project in this challenge, we note a clear concern in creating bases that promote the assistance of actions aimed at profit, but also with a focus on sustainability.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6643, "q0": "Let’s start with the problem statement. SMEs are known to have frequent problems with financing their activities, acquiring necessary capital and the knowledge to carry on their projects. We are being pitched here a DAO for people to collaborate and provide micro loans to small companies that need help implementing sustainable initiatives. So we have a sustainability focused financing DAO. \n\nThe proposal also makes a very good job at detailing accurate sustainability objectives for the DAO, but I'm not sure if all of them are readily implementable given the current state of the technology. Just one example: allowing SMEs to build on-chain credit. I’m not sure that there is a way to reliably build, track and use credit on-chain, especially for an institution, which should be more complex than for an individual. \n\nIn essence this will be a small scale micro-financing experiment hopefully run on-chain. I’m not sure if the blockchain technology is the most appropriate to power this experiment, but given the modest funding requested I would go with four stars when assessing the impact. ", "q0r": 4, "q1": "James, the proposer, is a PhD Candidate at the University Vienna, therefore the project will initially be launched in Austria. He comes up with a very detailed plan, divided in nice steps, but it’s not easy to know how long the project will take since you have to add up all the timelines, days plus months. I estimate somewhere around twelve months, but it’s not very clear. Considering the very modest budget, he makes a very good effort of dividing it in individual captions, all of them relatively small so no major red flags anywhere, as it all seems very reasonable. He is also lightly touching upon the risk section in which he identifies a relevant risk, but I wouldn’t say that the section is super informative, since the risk is that of “developing the DAO” which of course is true, but also being the core value proposition a bit more thought could have went into it.  \n\nGiven that this is a basically a one man show, with a modest budget and a fairly good plan in place, I would err again on the optimism side and go with three stars for the feasibility. ", "q1r": 3, "q2": "James also makes a good case for auditability, and he proposes a multitude of performance indicators to keep track of the project: basically the number of SMEs participating, those offering feedback, teams participating in the hackathon. He also treats in a careful manner how the success of the project would look like, and you can clearly observe the methodical and clear construction of each objective dedicated to sustainability. \n\nIf the entire experiment ends with a nice report that is shared with the community, I think four stars are appropriate for the auditability section. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8828, "q0": "Small & Medium Sized Enterprises are the important enterprises of many countries as they are not just contributing to country's economy , they are even providing employment opportunities to the people , as unemployment is one of the serious issue that the society is facing today, Hence the idea to provide a loan to such Small & Medium Sized Enterprises is a great idea where it will definitely help in growth of society , where through tokenization method many people will be part of cardano eco system in the future , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "As mentioned task doesn't involve much of a risk, where funding is the primary thing needed for completing this project, other than that the proposer still needs team to build where he has only one partner currently, for the sector to work he needs Business Manager  ,Blockchain Developer ,Biodiversity, Ecological Expert  ,Economist \nResearch & Development team.\nThe Research team still needs to find the right people for whom loan can be provided and the person can utilize the loan efficiently, with team still needs to be build ,delay in the project can cause concern to complete the project .", "q1r": 4, "q2": "The audit has clearly mentioned how's the proposer idea of providing micro loans to SME's can cause serious impact on growth and development of country's development,\nThe audit should have introduced other team members who will be joining in the project if the project is funded, because there are many aspects to cover while providing loan so it needs members who know these formalities.\nThe proposal contains detailed timeline structured to complete the project, and it even has well structured budget feasibility , with excellent key indicators provided to measure the participants as success rate of the project ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9915, "q0": "Big companies often have incentives to pay attention to sustainability issues for the reasons like their well known brands and media attention. The publicity acts as a kind of information system to deliver information about the value created by sustainability actions. However this is not a very efficient system and it does not help smaller businesses at all. The proposer has identified this problem clearly.\n\nThis proposal suggests researching the opportunities to provide foreign capital investments to small and medium size companies to pursue sustainable business opportunities. The information on the sustainability side of the equation is captured in impact tokens whereas the monetary investment is repaid over time. If the information about the impact value is the only repayment to investors it is all dependent on the success of the measurement of the impact. This is often the case when there is not a traditional business logic or earning mechanism for the project. The key difference here is that the investor is expected to get the original financial contribution back as long as the project generates financial returns so the capital invested is not dependent on the success of the impact measurement. This decrease in investor risk can be expected to lower the threshold to inject capital to the impact markets and thus to bring more resources as well as people and businesses in. That again advances progress in impact measurement.\n\nDAO structure will add long term resiliency and sustainability for the lending process and especially for assessing the impact. So one way this proposal addresses the challenge of impact measurement, comes from the incentivized DAO community. If the reputation of this group as an impact assessor grows, itself may be a reliable source of impact level information. \n\nFor being able to shape the project suitable to SMEs needs the plan is to integrate them directly to the design process by workshops which, if successful, brings the first wave of customers in right away. \n", "q0r": 4, "q1": "The proposal is not yet about implementing the platform but about researching and mapping the opportunity for it and, importantly, finding the partners and forming the team. I have no doubt about the proposers capabilities to organize all of the required tasks to deliver the plan. How well the real product will play out in the future is a lot dependent on team members recruited for the project. \n\nThe proposal represents quite specific details regarding loan conditions, auditing and so on which means that there is a well thought roadmap toward the completion of the plan. Detailed steps and estimated time maturities are given. The different elements of the budget have been listed and the cost estimates seem reasonable and realistic. If this initial research phase is successful the follow-up funding is necessary for the realization of the final platform. So far the only plan is to apply for funding from Catalyst.\n", "q1r": 5, "q2": "The progress KPIs include several logical qualitative and quantitative metrics regarding the team, research and hackathons which are well auditable. Because the plan is very detailed, it is easy to communicate the progress and achievements. However, due to the research nature of the project, the progress may be back and forth type tinkering and not that easy to just move step by step.\nAfter the project completion we can see if there is a team prepared to build out the required infrastructure, implementable token model, DAO design and SMEs willing to participate since the beginning. \n", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11792, "q0": "I found the Micro Loan DAO for Sustainable SMEs to be a great proposition, which fits perfectly into this 9 fund's Catalyst Native X Cardashift challenge. The proposal is closely linked to the challenge of addressing the questions posed in applying Cardano technology to build new solutions for positive impact pricing and monetization.\nI see the proposal made as an initial solution to financial capital, technology and knowledge for small and medium enterprises in Vienna and around the world to enable them to implement their new initiatives. This is an ambitious project as its goal is to reach small and medium-sized businesses, a market share that currently accounts for 92% of all businesses globally.\nThe unique, out of the box when it comes to building a DAO for everyone to collaborate on providing micro-loans to SMEs that need help implementing sustainability initiatives that lead to collaborative tokens DeFi-compatible dynamics measure the success of SDG. I see this DAO model will open up a lot of opportunities to help small and medium businesses access capital in a timely, easy and quick manner.\nI see not only in Vienna but also in Southeast Asian countries, almost half (48%) of SMEs have to rely on friends and family for loans. Among SMEs that cannot secure enough capital, 40% have cash flow problems, 38% are unable to launch new products or services, and 36% are unable to hire workers effectively. The current situation in Vietnam, according to statistics in 2021, there are about 870 thousand businesses, of which small and medium enterprises account for more than 98%. The role of these enterprises is very important to the national economy. But today, small and medium enterprises still face many difficulties and obstacles in accessing credit capital. This is the reality of the ecosystem that the Cardano community cares about and promotes.\nI completely agree with the author's argument that these solutions will solve most of the challenges' requirements in many different ways, the proposal not only solves the capital problem for medium-sized enterprises small and small in Vienna but also globally scaled up, measure and evaluate is of sustainability impacts related to the SDGs a top priority, providing a market mechanism in which impacts can be coded, digitization, trading, and integration into the DeFi space will be a key feature of the platform, improving the recordability, transparency and accountability of sustainability initiatives that are a mainstay of the platform. Under this project, creating an overarching market mechanism that comprehensively and consistently supports the SDGs is an overarching goal of this initiative.\nI will give the impact of this proposal 5 points because I find it to be a very useful proposition today for small and medium businesses globally.\n", "q0r": 5, "q1": "First of all, I have to say that the overall work of this proposal is very professional and serious by the author, with the investment of information, and the interpretation is extremely reasonable. I highly commend the author for the way the proposal is put to the exploitation, presentation of the content, giving evidences, arguments, and arguments of the issue very closely and persuasively. For me, it is a standard proposal, so the process and plan of the project are also presented by the author very clearly, giving specific timelines, detailed, and reasonable.\nSimilarly, I found the budget section of the project to be presented very clearly and easy to understand. With a grant application budget of $14250, which is 7.1% of the total challenge budget carefully calculated, breaking down costs for each item, I find these expenses absolutely necessary and very reasonable physical.\nThe author also pointed out that the main risk limiting the success of the project is that the development of a DAO and recommendation platform is difficult to use and does not include the aspects that small and medium-sized businesses find most useful or required to implement sustainability oriented projects. The author's solution for this risk I find highly convincing, it will limit a lot of difficulties when implementing the proposal's plan to help the project succeed.\nI find the project's proposer to be fully qualified to implement this proposal. I am very impressed with author James Vandenberg, because at this fund 9, I also evaluated another James proposal at another challenge. In addition to the author's experience, education, and knowledge, I see the seriousness, thoroughness, and professionalism in his work. The author's personal information is publicly available, providing links to LinkedIn and the web of the entity where the author works.\nI give a perfect score of 5 points for the feasibility of the proposal, it completely convinces me.\n", "q1r": 5, "q2": "With the information given by the author, I believe this project can be audited. The community can completely monitor the implementation progress and success of the project from the detailed plan and budget given by the author. Besides, based on the proposed KPI measurement indicators, the community will monitor the project continuously and closely.\nI find with 9 KPIs to measure and track project progress is a very complete and detailed number that is discipline, gender & ethnic diversity of the core team, quality and thoroughness of the first research and design phase, the number of SME participants at the workshop, the number of SMEs providing feedback, the number of SMEs highlighting their willingness participating in the DAO in the future, the number of SMEs expressing their need for sustainability support, the number of teams participating in the Hackathon, the quality of the projects submitted at the Hackathon, and the number of relevant concepts Usable created at Hackathon.\nHowever, I am a bit regretful that the author has not given specific numbers associated with these indicators. If there are more quantitative numbers, it will help the community have a more specific view of the success of the project. In addition, the author also needs to update the project implementation progress every month and report the budget expenditures publicly on his personal page for an easier project audit community. The success of the project was also stated by the author when the project achieved its objectives.\nThis is a completely new project, and has not been funded with previous funds, it is proposed that there is a lack of a demo channel such as youtube or the web so that the community can monitor the progress of the project.\nI will give the audit part of this proposal 4 points, I need more information reporting the progress of the proposal by month when the project goes live on the community channels of the author or of this proposal.\n", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13910, "q0": "This project effectively addresses the challenge  settings and also addresses the challenge mentioned since the problem has to do with small scale enterprises being unable to access finance, technologies, knowledge to implement sustainable initiatives. There is also clarity of problem and solution. In respect to this, micro loans DAO for sustainable SMEs intend curbing this by providing SMEs with finance to run their businesses plus workshops to help owners in capacity building to help acquire the necessary knowledge for running their businesses. This project clearly states the key metrics and goals or objectives such as sustainable objectives and blockchain objectives. The proposal also clearly articulates a plan for the project’s future sustainability and as such has identified one future challenge when implementing this project which is creating a platform that is difficult to use and how to go about solving it thus organizing workshops.", "q0r": 5, "q1": "From the experiences presented thus sustainable development, urban studies with a focus on sustainability, researching blockchain role in sustainability transformations not forgetting  the plan demonstrated above on the timelines and measures that would be put in place to make sure that the apportioned time frame for each task will be followed cautiously. The amount which is $14250 is a realistic amount with apportioned breakdown of money to be spent into initial research and development, workshops for SMEs, implementation, Hackathon and Give always. However the number of team members were not so clear because I only captured James Vandenberg’s name with a lot of experiences. Micro loan DAO for sustainable SMEs also states a well simplified timetable of 9 steps activities with 2,3, a week duration which I believe is reasonable enough. Resources necessary to implement the project were also well stated. This shows that  Micro loan DAO for sustainable SMEs if given grants to commence this budget, it will not only be successful but done on time. ", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and success of this proposal since attention will be given to the number of participants of every workshop (increasing number), the number of SMEs that show interest for the support, number of SMEs that give feedback which are termed as metrics. \nAlso looking at the sustainable development goals, it is stated that their project touches on all 17 goals which is so impressive but would have been great if there was a mention and a merger between the Sustainable development goals and the project to be undertaken. It is worth sponsorship because it’s obvious this project will be successful due to all the experiences and technical know how , this makes measuring of the project’s success, that’s recruiting and forming a sound interdisciplinary team that is dedicated and motivated to improving sustainability world and so on. The roadmaps with milestones and a clear future horizon with a proper description of the targeted problem measure against the outcomes are also well elaborated. ", "q2r": 5, "assessor": "z_assessor_3847", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "A DAO for people to collaboratively provide micro loans to SME's that need help implementing sustainable initiatives, which result in DeFi compatible impact tokens that measure SDG success", "experience": "\nBA in Sustainable Development\nMSc in Urban Studies with a Focus on Sustainability\nCurrent PhD Candidate Researching Blockchain’s Role in Sustainability Transformations\nUrban Sustainability Lecturer at the University of Vienna\n3+ years researching blockchain\n"}