{"id": 416321, "author": "clementg", "title": "Env. impact certification protocol", "url": "https://cardano.ideascale.com/a/dtd/416321-48088", "category": 26605, "amount": 120000, "description": "Current carbon markets address 30% of the needed solutions; industrial carbon-negative projects can’t access certification and monetization of their impact because it is expensive and time consuming.", "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 536, "q0": "This proposal has identified in the problem statement an important need in the current carbon market. Their proposed solution for carbon-negative projects to monetize their impact through carbon markets does address the challenge brief. However, the challenge brief focuses on How much financial value can be derived from impact-oriented projects, and this proposal does not clearly articulate how much financial value will be achieved by funding this proposal. I do believe there is a significant opportunity in the Carbon market industry, but the proposal has not directly made connections to this, or forecasted potential revenue streams. It is unclear how this proposal will financially impact Cardashift or Cardano, as the \"impact\" the proposal focuses on is the climate impact of reducing carbon in the atmosphere, and while this is valuable to society at large, it does not clarify \"How much FINANCIAL value can be derived from impact-oriented projects\", which is the focus of this challenge. There is also discussion of how \"this will facilitate the issuance of impactful and qualitative carbon-credits that can help meaningful project developers monetize their impact.\" but this statement is focusing on the monetization of the users/customers of the completed certification system, and not on the flow of money to riverse.io, Cardashift, or Cardano. ", "q0r": 4, "q1": "The proposer has provided the teams experience and qualifications, (through a website link, which includes a team page with links to the LinkedIn profiles of the company founders) while their past experience was not focused on carbon markets, their existing company Revirse has accomplished 19 Carbon reduction projects which were successfully completed. The team has outlined who will be completing the work on this proposal, and they have sufficient technical knowledge to deliver this proposal. The proposal includes a plan with a timeline and major milestones at 2, 4, 6, and 8 weeks. They have also broken down the budget to include hourly estimates for each task. The plan, budget, and timeline are reasonable and well defined. The only piece missing is technical explanation of the architecture, language and technologies they will be using to implement this proposal. They have not explained what minting services they will use to issue the Certification NFTs. ", "q1r": 4, "q2": "The proposal states \"The milestones are defined and are measurable. We will track each milestone to give visibility on the project.\" and I agree the milestones are defined and measurable, but the team has not explained how they will give visibility or transparent reporting to the Catalyst community. The KPI's can be used for auditing, but only if the auditors have access to them. The teams website has specifically stated on the about page their values which includes the statement \"A lack of consistency and clarity has clouded the perception of the market. We believe full transparency is key to ensuring trust and enabling action.\" So while the team is likely committed to transparency, they have failed to explain how they will be reporting this proposals progress to the cardano, catalyst, and cardashift communities. I would like to see regular monthly progress reports that include all of the metrics included in this proposal, and explain what communication channels will be used to share them. ", "q2r": 3, "assessor": "z_assessor_2108", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4434, "q0": "This proposal is admittedly very hard to assess, because there are a lot of intricate details regarding how the proposer structures the proposed business. This proposal affects the carbon credit market which will be a key market in the future for businesses involved with energy consumption issues resulting from tighter regulation. The proposed concept is interesting and novel, and would be a great use case for Cardano, if the team manages to deliver and their system works as explained.", "q0r": 5, "q1": "The plan presented is written really detailed and shows confidence in taking the challenge. Professional work was done to create the proposal and show the voter and me enough information to understand the topic and the impact it has on the community and businesses. It is also supported not only by this proposal but also by other sources of income as stated in the prposal. The timeline seems realistic. Given that the team presented has the experience that is stated, it shows that this project has a proffessional approach that clearly sets ist goals and will achieve them. \n\nThere is one thing I want to mention about this proposal. With that HUGE budget, I think voters will choose to downvote this proposal. If Proposer requested $120k on $200k Challenge's Fund, and then get funded, there's a little chance to be realized. If this the first time Proposer submitting an idea in Project Catalyst, as far as I know, there was a unwritten rule stating that the budget is not allowed to be larger than 10% of the total Challenge's Fund Size. Because Catalyst want to give an equal chance to community to run their projects.\n\nAlso, Next time the Applicant can detail the requested budget. So that people can understand what the money is used for.", "q1r": 3, "q2": "The Auditability section is too simple because all the data has been explained in another section. Since Proposer not mentioning where We (community) could check their progress I think in the auditability section, Proposer should re-tell that their website will be the only one to track this Proposal progress.", "q2r": 4, "assessor": "z_assessor_2553", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Regarding the requested fund, we understood that it could be open to further discussions down in the process. We don't except to get 100% of the 120k$ and will respect the rule of 10% if it applies to us."}, {"id": 4972, "q0": "The problem described in this proposal is very closely aligned with the challenge. \n\nToday, carbon credits or any impact credential are deeply lacking a unified methodology and a standardized framework. \n\nThe current centralization is a bottleneck for impact measurement and valuation. Decentralization can bring a lot. \n\nThe proposed solution intends to make it faster or even industrialize the assessment, the measure, and the reporting of positive impact. Today this type of project could re-establish trust between the actors, and foster investments in this sector that lack funding a lot (due to the impossibility to trace or valorize the positive impact done).", "q0r": 5, "q1": "First of all, the team is already a project in full development and with several deliverables completed before receiving funding from Catalyst, which indicates a reliable and productive team.\n\nThe information about the team described in the proposal is detailed, the experiences described and the work already performed indicate that the team is fully capable of developing this work. The budget breakdown describes 5 very detailed phases, with great details on how the money will be spent.\n\nHowever, the amount stays very significant and I would've liked to know if some steps are optional or not, to maybe reconsider the budget or split it on several Catalyst funds.\n\nDespite the important requested budget, I believe the requested amount is understandable given the huge work there is to do in the field which is both about research and production.\n", "q1r": 4, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. The roadmap is very well designed, there are milestones that make auditing the proposal easier.\n\nThe deliverables are very well chosen and I believe, each of them, are good indicator for evaluating success, as the chosen outputs would clearly indicate if the project and its standardized framework is scaling or not (onboarding 10 projects, then scaling on a whole field, etc.) ", "q2r": 5, "assessor": "z_assessor_2645", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "The requested amount aims to reflect the reality of the work that need be done. There are indeed some possibilities to cut out part of the job in order to reconsider the budget. We can limit the number of LCA templates, baselines and the number of projects. This will still enable us to build the underlying framework and overall process."}, {"id": 9930, "q0": "Riverse develops methods for different industries and businesses to measure and prove their impact on collective greenhouse gas emissions. Verification of this is made by independent parties. The problem is growing complexity and the need for human expert labor when onboarding new kinds of industrial processes. The idea to resolve this includes a prototype of a protocol which enables businesses to reliably report their impact on decarbonization. This proposal’s scope is specifically in the impact on a few specific aspects of decarbonization. There is a well known collection of standards and tools for Life Cycle Assessment of products, processes and services. Based on these established standards Riverse aims to create an updatable database of baseline environmental impact levels so that each business with suitable LCA processes can verify their own impact against these baselines. Because there is already existing standardized infrastructure in action, a successful delivery of the proposed platform has a potential to scale reasonably well. In my opinion, a very important decentralization element to maintain this baseline database is planned to be done by DAOfying the process at a later date. It introduces reliability and continuity over longer term time horizons. \n\nThe proposal also covers the implementation of tokenization of impact framework. \nImpact credentials in a form of NFTs include metadata to prove impact and provide required evidence to issue carbon credit NFTs. Standardizing the process for peer to peer compatible verification, would make the system even more end-to-end decentralized. NFT metadata infrastructure is an evolving field and may open new opportunities in the future. \n\nThe number of proofs of concepts is mentioned in the challenge set-up. This prototype protocol applies directly only to one limited application domain but if it and the planned 10 projects onboarding is executed successfully it provides a good reference point to continue expanding decentralized automation and standardization of environmental impact measurement. Because being able to find working solutions to measure the impact of different industrial projects is the core business model of Riverse, I expect this endeavor of standardizing the process to be highly impactful and matching the Challenge question pretty much perfectly. Especially speed of measuring impact and validating it are strongly impacted. As this is already a business in action, many operational risks are significantly reduced. I see some uncertainties about how well the protocol eventually scales across different projects and how efficiently the existing solution can be modified to capture new projects and processes. As the proposal states, having straightforward and simple enough KPIs to enable auditing of real processes in the companies is the key challenge here. Another uncertainty factor I find is how much value this cost effective solution adds to companies compared to a more costly but deeper manual verification process. \n\n\n\nIf there are blockchain solutions through the whole supply chain all the way to the consumers, it creates a direct path to incentivize consumers directly. The purchase of the end-product is traceable to the verified impact of the production process. Measures and verifications earlier in the production chain makes it easier to measure and verify at the later stage of the chain. How these synergies play out at scale remain to be seen. \n\nThe proposal fits naturally very well to SDG criterias and they are also mentioned as directive guidelines of Riverse’s business approach on their websites. \n", "q0r": 5, "q1": "Riverse has a track record of creating tens of customized impact measurement systems for businesses from a variety of different fields. I expect them to understand well the gaps and challenges of capturing the key metrics of production and processes. The project timeline, 6 months in total, is divided into 5 well-defined phases. The project budget is clearly divided into subcategories. Estimated hourly workload is specified to the items of impact measuring system, impact certification and carbon credit issuance. In addition to company details and extensive references, the LinkedIn profiles of team members are available. I don't have doubts about their technical capabilities to implement the plan. There is no uncertainty regarding the future funding. This is a proof of concept and it doesn’t require follow-up funding from Catalyst. \n", "q1r": 5, "q2": "The work is not followable in real time from open sources. However, the team is going to provide a report of the measurable and well-defined steps and milestones as the project progresses. KPIs for the completed project are extremely simple and clear. They comprise the number of businesses using the system, impact certificates created and carbon credits issued. \n", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11056, "q0": "\"Using specific methodologies for each carbon-negative technology to certify carbon credits. This is a very time-consuming, labor-intensive, and very expensive method. Your proposal is to create the foundation for carbon credits. a decentralized framework for granting environmental impact credentials, allowing carbon negative projects to monetize their impact through carbon markets or climate dividends. The main challenge was to verify the actual production and how it would be linked to the metadata in both the impact certificate and the carbon credit. to simplifying the verification process into simple KPIs (and little) what can be validated with documents (invoices or legal documents) I find quite appropriate.\n\"\n", "q0r": 4, "q1": "I have read your solution very carefully, I see you have enabled project impact assessment through comparative LCA protocol to make it accessible for any carbon negative industry project , empowering a whole new kind of carbon negative project, needed to actively build tomorrow's world. I find this to be a very innovative and groundbreaking solution as it will facilitate the issuance of quality and impactful carbon credits that can help developers of meaningful projects earn money. money from their impact. I'm not sure what it means to empower a whole new type of carbon negative project? Please clarify this concept. I see that you have developed a very detailed plan with clear milestones and timelines, but the part that provides a detailed breakdown of the project's budget is only in terms of hours of work I think you should calculate. out USD for voters to evaluate and consider the rationality of budget use. The proposal has also provided some information about the people who will work on the project, but I find it not specific about the background and capacity, you can provide the address so we can learn more about the capacity. their force\n", "q1r": 4, "q2": "I find the description of how you will measure your project progress to be very general. You have a detailed plan with specific milestones and timelines, so why not develop criteria to measure project progress according to that plan. Finally, I want you to clarify more how businesses can make money using this platform. I hope you will continue to add and improve the proposal\n", "q2r": 3, "assessor": "z_assessor_3216", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "About \"empower a whole new type of carbon negative project\": it means there are a lot of solution that will need financial support in order to sustain our decarbonization and enhance our carbon capture capacities to reach net-zero by 2050 (as mentioned in Paris agreements). Most of these solutions exist at pre-industrial phase. \nThe business (carbon negative project) will be able to use this platform to certify their environmental impact and emit carbon credits. Therefore selling carbon credits will enable them to access liquidity to finance their development and tackle greenhouse gas emissions.\n\nRegarding  budget, the hourly rate used to calculate is around 100 to 130$/h depending on tasks."}], "solution": "Create the foundations for a decentralized framework to issue environmental impact credentials, enabling carbon-negative projects to monetize their impact through carbon markets or climate dividends.", "experience": "Riverse is a carbon credits certification platform allowing carbon-negative projects access additional fundings. We have 5+ years experience in system eng. and life cycle analysis for project assessment.\nWorking alongside Smart Chain, specialized in Web3 consulting & services."}