{"id": 417108, "author": "sbpabon", "title": "STUDENTS TAKING THE PLUTUS PLB", "url": "https://cardano.ideascale.com/a/dtd/417108-48088", "category": 26605, "amount": 10120, "description": "Hundreds of students wander through the Cardano ecosystem without finding the methodology that provides them with practical development skills.  Over time, the number will increase.", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 1052, "q0": "As an involved member of both the Catalyst and the Cardano community at large, I feel that I cannot keep pace with all the achievements of the Gimbalabs team. I have been watching their work for over a year now, and even though I am familiar with it, by reading their Catalyst proposal I find out that there is a lot I have been missing.\nThe first edition of their PBL (Project-based Learning) program has been a success, leading to a number of successful projects being born out of it, like jpg.store - the leading NFT marketplace on Cardano at the moment. They have now launched the second version of the PBL (Project-based Learning) program on the 18th of June, which includes amongst others the latest updates coming with the Vasil Hardfork (probably at the end of July), as such, it demonstrates that it’s an up-to-date program that students can trust. Thanks to their success, they will also be partnering with the EMURGO Academy to produce a series of workshops and hackathons. As such, the impact that Gimbalabs has already had on the Cardano ecosystem so far is extraordinary and the information provided in this proposal, leads me to trust that they will be continuing their amazing work with their newest version of PBL, the subject of this proposal. As such, I definitely agree that their proposal is a valuable and impactful project for the entire ecosystem.", "q0r": 5, "q1": "Although the activities stretched on the timeline look repetitive, as they are weekly teaching classes conducted by members of Gimbalabs, having them separated on a monthly roadmap helps me paint a better picture of their project. For an even better understanding, the sections for “creation of additional materials” and the “translation of PBL into Japanese” are separated, each with their own version of the timeline, thus leaving no place for any uncertainties.\nI also find their detailed budget very comprehensive, with an introduction of all needed budget necessities and then, for simplicity, the sections of the budget separated on a monthly basis.\n  What I most appreciate, is the fact that, even though they are known members of the Cardano community, they have taken the time for each stage of the proposal, and most importantly, for the team description, to provide us with ample information.\nAs such, considering the fact that the Gimbalabs team are constantly working, and that their newest version of their PBL program is already being implemented and tested, I see no impediment in the implementation of their project.", "q1r": 5, "q2": "I never thought I would ever say this about the auditability section of any proposal, but I have found it quite interesting. The Gimbalabs team have implemented a bounty system for their services, which are being paid from their treasury wallet, that is, of course, public, as it’s on the blockchain. And through these bounties, they and we, the community, can verify the contributions of each member and as such, the progress of their project. I think this is a very good solution, that could be implemented on a larger scale for other community-based projects.\nAnd when reading their vision of success for their project, I must say it was realistic and feasible, nothing that I would consider either hype-inducing or unnecessary. One of the points that has particularly attracted my attention, which is the increase in the number of Japanese students building on Cardano, which would in time lead to the growth and strengthening of the Japanese and further on, the Cardano community at large.\nWith this in mind, I find their solution for auditability very well thought out and easy to verify by the community.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6420, "q0": "The proposal informs the community that there are lots of students who wander through the Cardano community without finding a place with practical development skills. As the blockchain is growing each day. There needs to be more builders and developers in the space. Their solution to this problem is including more students in the Plutus project-based learning platform. This is a place where education will be their main focus. There will be training given to students at Oxford University. This program hopes to increase the number of developers that are familiar with Plutus and help them find opportunities in the Cardano ecosystem. Any proposal that has a focus on Cardano and defi education is extremely important. Cardano is special that is has its own coding languages. Plutus and Haskell. By creating a space that focuses on the education in these specified areas can bring a lot more utility to defi projects building on Cardano. For these reasons, I give this section of the proposal 5 stars.", "q0r": 5, "q1": "It is good when a proposal includes details on the team members. In this case, there is a link provided that takes you to the gimbalabs website. There you can see all of the team members, their experience, and accomplishments. It is important to see that the team has already accomplished such tasks in the Cardano community and helps provide details that supports the claim that this proposal will be implemented successfully. Especially given that their proposed idea is bringing utility to the Cardano ecosystem by educating young developers and builders. The proposal includes a detailed roadmap that gives around a 3-month timeframe. There are sections for each month that includes tutoring and the material for these classes that will be taught. They even plan to implement Japanese for those students to benefit from this project as well. There is a budget breakdown that gives specific details on where the requested funds would be allocated. It appears that the team is very conservative with their approach, and they are not asking a lot for the time and effort they are putting in. This source is based on other proposals requested funds. For all these reasons, I am led to believe that the team will be capable of successfully implementing their plan if funded. Because of this, I give this section of the proposal 5 stars.", "q1r": 5, "q2": "When looking into this proposal, I was quite pleased with the specific details and experience behind the team. It helps lead me to believe that there is enough information to audit the potential success of the proposal. There are some additional steps that may be important to include in this proposal. Or rather, to be considered by the team when viewing this assessment. The first question to be considered, is how will the team manage the students that are interested in this program? Is there already a group that is waiting for the project to be funded? Or will this project still be implemented in the case of not receiving funds? Just some things to consider. It is also important to remember that transparency from the team is extremely important. Given that the team already has students waiting for this program. It will be beneficial to remain open and transparent with them throughout the progress. This builds trust and increases the demand for attendees for this event. It also promotes the idea of accountability. These students or even Cardano community members that are interested in this project, will follow-up with the team regularly. They will help make sure that progression of the project is coming together nicely and will help the team make sure to reach their goals as suggested in the roadmap section of the proposal. This idea of the Plutus project-based learning program can be important to the upcoming generation of builders and developers on Cardano. For all these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11064, "q0": "In fact, a lot of students have not found a methodology in the Cardano ecosystem to give them real development skills. To remedy this situation, your proposal has come up with the Plutus PBL (Project-Based Learning) program that contributes to solving the problem outlined above, starting with students at the University of Oxford. Firstly, we strongly agree with you about identifying the current difficulties for students when they want to learn and develop with the Cardano ecosystem; Secondly, it is very wise for you to choose students at Oxford University because students are the owners in the Cardano ecosystem later, moreover, students at Oxford University are really excellent. You have very precisely identified the possible risks that are the quality of teaching. The way you explain to reduce the possible risk very effectively is to focus on two factors: People (learners, teachers) and technology. I think this is a great proposal, I fully support you", "q0r": 5, "q1": "I completely agree with the proposal's very scientific and logical way of posing the problem. You chose Gimbalabs as the place to implement this proposal because it is a project born in Cardano. Time has proven its outstanding ability to build quality technical, educational and community infrastructure when it comes to learning and growing in the Cardano ecosystem; the use of Plutus PBL (project-based learning) program is a teaching method associated with practice and experience. This is an advanced teaching method to maximize the activeness, initiative and creativity of learners. Students enrolled in the Plutus PBL program are not only theoretically equipped, but more practical, equipped with the practical skills to thrive at Cardano. Your program has a very logical continuation if in the 1st version you provided the methodology, in the 2nd version of Plutus PBL is a curriculum that provides students with the opportunity to Gain hands-on experience with Plutus by working on real projects. I see a very high chance of the proposal's success because it is a training program that meets the needs of learners before the problems posed by practice. You have now made great contributions in the field of cross-chain interoperability and collaboration by providing the practical knowledge that other blockchain engineers and developers require to build on top of that. Cardano. You have developed a specific plan and a detailed budget analysis of the project, which I find very clear and transparent. I have two small suggestions: first, you should increase the number of translations into many languages ​​other than English and Japanese so that students from many countries can access your Plutus PBL program. Secondly, you need to provide more specific information about the background as well as the professional capacity and experience of the members who will participate in the project so that we can more easily evaluate the quality. of the proposal", "q1r": 5, "q2": "You guys have provided information to measure the progress of the project, I see you guys basing on the amount of bonuses assigned and announced for tutoring activities, creating additional materials for workshops and hackaton, translation... These are the specific metrics that best demonstrate actual performance at each stage of the plan. The success of the proposal is described very specifically and explicitly. I support 100% of your suggestions", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12953, "q0": "The proposal is about the Plutus PBL which is a project based learning platform in which they provide the practical development skills to the students .\nThe proposer have provided the links of their works in which they help people to enhance their skills and build the projects in the cardano ecosystem . \nThis proposal clearly adds the value to the cardano \necosystem. Students can work on actual projects as part of the Plutus PBL teaching program to get first-hand experience with Plutus.\nThe key metrices and the goals of the proposal align with the challenges.", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for delivering the project. Team looks very experienced ,\nThe links and the skills have been mentioned in very detailed way in the description which are required for the implementation of the project .\nThe Timeline mentioned in the description very realistic for the implementation of the proposal  and the Budget breakdown is great .\nUpon reviewing the details of the proposal i strongly agree that the proposal is going to be successful.", "q1r": 4, "q2": "The progress of the proposal can be measured by following KPIs,\nNumber of tutoring hours provided in the month  Number of tutoring hours projected in the timeline Budget spent per month.\nThe proposer have provided the clear understandable description of the problem and \nthe proposer have also provided the approach to the solution in very descriptive way in the description .\nThe proposer have provided enough details which is required to review the proposal.", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15356, "q0": "The project is simple about the Plutus (Project-based learning) which will be run by the gimbalab team. The team also highlighted the impact on the beneficiary of the new students as the future workforce and the financial benefits for the future opportunities. The solutions are also divided into four main parts: Onboarding/ Building Background Knowledge (BBK)/ Specialize/Contribute. The Miro board is very much appreciated by the team for the detail and visualized approach from the project management. The main risk is well anticipated from a pedagogy approach with very technical training. The team mentioned the mitigation action with the additional tutoring method.", "q0r": 5, "q1": "The project milestones are very clearly defined on a 4-month project with durations for each session and the tutors required. Moreover, the team also combined the Live session for a more interactive approach. What makes this proposal highly appreciated is the translation into Japanese in partnership with EMURGO Academy (EMURGO is based on Japanese whereas the Cardano Foundation was also found in Japanese for early adopters.) The budget is very transparent and easy to understand and follow by the community. The team is a bit general of Gimbalabs, it would be advised that the team can share who is the lead for this proposal, as we noticed that Gimbalabs is in the developing stage with many projects to be handled at the same time.", "q1r": 4, "q2": "Auditablity is what makes this proposal interesting, the PA was wondering whether this project should have been placed in other challenge settings instead. Now the PA understood the reason, as the success look likes the team states that \"when Cardashift and Gimbalabs forging a mutually satisfying relationship in which the two companies become strategic partners.\" The KPIs/OKRs are split according to the feasibility with the 2 phases: Tutoring and then Translating. The proposal also addressed 2 SDGs which are the new criteria of Catalyst which was introduced in this Fund 9. Although the challenge settings were somewhat pre-defined, this is an encouraging project which will potentially benefit Cardano community in many ways.", "q2r": 5, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Our Plutus PBL (Project-based Learning) program will contribute to solving the problem, starting next month with students at Oxford University.", "experience": "Gimbalabs team. Gimbalabs builds technical, educational, and community infrastructure for people who want to show the world what Cardano can do. We believe that people learn best by doing things. More info: https://gimbalabs.com/team"}