{"id": 418897, "author": "lpanchot", "title": "Dashboard of Impact Tools", "url": "https://cardano.ideascale.com/a/dtd/418897-48088", "category": 26605, "amount": 30000, "description": "There is not a dashboard of tools that exist in the Cardano ecosystem that impact driven projects can use to learn about their options.", "f6_no_assessments": 10, "f6_rating": 4.500000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 1060, "q0": "As a project creator for more than a year, I would find the dashboard the team is planning to develop very helpful. Gathering all the tools and services in one place would not only ease the work for any project developers and creators but could also stir creativity to rise from the community by seeing all the opportunities available.\nI find the categories for the tools’ showcase to cover a wide range of needs. I’m not even sure at the moment, how many tools there are on the Cardano Ecosystem, but I know that a lot of people are building and would benefit from their work being showcased amongst others. As far as I can tell, I haven’t seen a website such as the one proposed in this project, thus it would also be a novel development for the community.\nGiven the information provided and the information I know from within the community, I think that such a dashboard would benefit the community, especially the ones of creators and developers. As such, I will rate it a 5/5.", "q0r": 5, "q1": "This is one of the few proposals in which the team has provided details regarding their other Catalyst projects and has also mentioned how they will manage to find the time to work on both proposals.\nThe plan presented is straightforward and easy to follow. I do not see any missing details or timeframes.\nI find it somewhat weird that the budget has a fixed rate of $60/hour for all development work skills, but I assume that if the team is very compact, they can more easily calculate the amount needed for each member.\nSpeaking of the team, from all the information they have provided - descriptions, LinkedIn profile links - I can assess their competence in completing this proposal.\nAs such, I find the proposal can be successfully implemented in the timeframe provided and with the budget requested.", "q1r": 5, "q2": "The metrics provided to help track of the project’s progress are straightforward - the number of tools verified as useful for impactful projects, the number of projects using the website and the number of interviews/beta tests with impact projects to offer feedback on their tool.\nSince the team has a clear view of their project, they also have a sound vision of what their success might entail. The number of 15 Cardano native tools added at launch and an additional 3 tools per month after launch seem both realistic and proving of their success. They have also considered the projects utilising the website to find the needed tools, with a number of 20, which is also feasible. And lastly, the number of interviews with impact projects, where the number they foresee as successful is 30.\nOverall, I find the entire auditability section very well thought out and drafted. As such, I rate it a 5/5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2423, "q0": "We have that this proposal fulfills the objectives of the challenge in which it finds itself in a very interesting way. Instead of necessarily tokenizing or measuring a specific activity, we have created a tool that will indicate ways for this impact measurement to be carried out in the future by other ideas. Thus, we see that the proposal is, in the end, helping the main objective of this challenge. Taking into account all the projects that can benefit from this tool, we have that budget being requested of $30,000 is consistent. We can thus say that, if this project is successful, it will certainly have a positive impact on Cardano's ecosystem.", "q0r": 5, "q1": "We can say that excellent characteristics were presented in relation to the feasibility of the project. In the detailed action plan, we find activities that gradually evolve, from simpler realizations, starting from the creation of a wireframe, to the construction of the website itself, also taking into account the performance of tests. We also find a clear demonstration of how much capital will be used in each of these steps by looking at the budget breakdown. Although the requested budget of $30,000 is a considerably high amount, we can say that this is justified considering the clear explanation of how it will be spent and also because of the team members. In this context, we find professionals well acquainted with the area of ​​software development. And we also noticed professionals with experience in design and management, showing that the team as a whole has quite complementary knowledge. Additionally, we see that CVs were made available so that their experiences could be proven.", "q1r": 5, "q2": "Regarding the ways chosen to follow the evolution of the project, we found very relevant parameters that describe well whether a considerable scope is being reached. In a complementary way, we also have that numerical goals related to the parameters described above were established. The existence of clear milestones about where you want to go will help a lot in defining whether the project was successful or not.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4390, "q0": "The proposal addresses the challenge posed in the Challenge and identifies the problem to be solved as there is currently no dashboard of tools that exist in the Cardano ecosystem that impact-driven projects can Use to learn about their options. The solution was to create an information dashboard for impact projects so that they could understand the existing tools they could use for their projects. Thus, the team identified the problem to be solved and came up with a plan to solve the problem. In my opinion, this is very necessary because so far there is no page available for projects so projects can refer to it and use it as a source of information to apply additionally. the projects. From there, discover creative ways to generate financial value from making their impact.\nWith the aggregation of tools available in the Cardano ecosystem that can be used by high-impact projects in one dashboard, this proposal adds value to the Cardano ecosystem. In addition, the proposal can also scale and explain the future challenge with the very fast evolution of blockchain platforms - truly valuable digital projects will grow and close. To contribute to a large-scale impact is to create a society and a world with outstanding development. In short, the proposal has a definite impact on the Cardano ecosystem, promising to be able to scale and solve challenges in the future. I strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "The team has experience in the Cardano and Haskell/Plutus blockchain, some members are also computer scientists, programmers, etc… The team also provided a full explanation of the problem and related documents. related to the proposal (MLabs websites,...). However, I don't see the disclosure of all team members' identities via social networking links (Linkedin, Facebook...) - in a team of 4, only 2 people reveal their identities via Linkedin, and the remaining 2 people do not have a social network, which is a hindrance that makes it difficult for the community to look up the members' identities and verify the feasibility of the proposal and affirm more credibility. of the team (who are already reputable and experienced in MLabs). If you want to know all members' information, you must visit the MLabs website. I've come across several other proposals that do the same. Core team size as I understand it to be 4 (listed by name and area of ​​expertise in the proposal), these are key members, and the team may have others not yet mentioned identified in the proposal. My advice to the team is to try to add a social media link (Linked, Facebook, etc...) directly to the proposal to make all the members of the team public. Because thanks to the full complement, the community has a lot of advantages in looking up the members' identities and verifying the feasibility of the proposal.\nThe budget is presented briefly, somewhat sketchy, and not yet stated how to calculate the labor to make up the budget cost. I think the community needs to list more details about the budget to increase the persuasion and feasibility. Because when listing the details of the work related to the budget, it will clearly show the professionalism and meticulous attention to the team's budget balance sheet, through which the community can strengthen more confidence in the ability of the team. examination of the proposal. The fact that the team presents the budget as it is, only people who already know the team well can understand and believe, but I think for everyone from the community (some people are very new - they don't know yet). about the team and this proposal) can understand it easily, we need a more detailed, more understandable presentation. That's my advice on the budget.\nThe plan and how it was done was outlined by the team step by step - this was a roll call of what needed to be done, not a level of detail. Through this, the feasibility of the proposal can be assessed to some extent. It can speak to the enthusiasm of the team's presentation of the proposal.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, with 4 key members who have professionalism and experience, I did not see the team mention other collaborators. This makes me somewhat doubtful that the proposal will be implemented successfully. In my opinion, it is necessary to involve many members, not just a few key members. So can the team share more about who (collaborators or other groups) can build and implement this proposal with the team? Are they members of MLabs? My advice is that the more the team shares publicly, the more trust the community will gain. In addition, as the team shared, some members are also working on another proposal in parallel with this proposal at Fund 9. I would like to ask if this reduces the quality of work on this proposal. shoot it? Although the team mentioned that there are still human resources to perform. Because I'm afraid resources will be scattered when the team works on proposals at the same time. In my opinion, the team can demonstrate to the community that moreover, even though there are currently members implementing another proposal, the human resources are still fully guaranteed for the successful implementation of this proposal. This should be presented in real detail to make the community believe (specify the name of the implementer and related members). It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, DAO, etc… I think it was mainly built by core team members who already have many of the skills I just mentioned. In addition, a large reputable team like MLabs can completely mobilize external support to make the proposal implemented in the best way (possibly with the team's ability - it is not necessary). . But I still support this and give my subjective opinion. That is the basis for me to believe that the team will do a good job when implementing the technical aspect of the proposal implementation.\nThe team stated the potential risk of implementing this proposal: The possibility to find enough tools that have been verified to be useful and safe for impact projects to use - I didn't see that mentioned. solutions to prevent risks. Why didn't the team come up with a specific solution to prevent the risk? Here, I add the risk that: Ada's slippage - will affect the budget of the proposal. We know that the cryptocurrency market is in hibernation (devaluation of digital currencies), so Ada may depreciate when the team receives from the Catalyst fund, then the team will face the problem of a lack of budget to implement the proposal. So my advice would be for the team to take a close look at Ada's slip-in budget to fit the budget requirements in the proposal.\nThese are just my positive comments, the team can review and adjust this proposal. I both agree and disagree on the feasibility of the proposal. I vote 3 stars.", "q1r": 3, "q2": "The roadmap of the proposal was presented in quite a detail by the team with a total duration of about 4 months. This is a reasonable roadmap and milestone for a proposal that takes time to implement. The work steps to be performed in each stage have been stated and in a certain order - containing all the necessary information - albeit briefly. However, I still have advice for the team that the team should attach the milestone roadmap to specific months of the year (eg January, February,...). If so, it will make it easier for the community to evaluate the transparency and auditability of the proposal. As a PA, I have evaluated several proposals and have found that not many teams can do this and this makes it easier for the community to quickly assess the transparency and auditability of the proposal. fast and accurate.\nI don't feel satisfied without the presence of job performance indicators (KPIs) and key metrics. The team needs to look more carefully and specifically to come up with KPIs and key metrics. We all know the role of KPIs and key metrics in auditing. I consider KPIs to play a certain role in demonstrating the transparency and auditability of the proposal. So my advice is to quickly add KPIs and key metrics to the proposal. By doing that, this proposal will have higher transparency and auditability.\nI find the way the team defines \"what the success of this project looks like\" pretty well, it ties into specific numbers of the number of useful tools, the number of projects using the site, and the volume of interviews/beta testing. Thus, the definition of success is well laid out, and it is easy to audit when it comes to specific numbers but also the theory and practical applications. Throughout the proposal, problems and solutions were clearly articulated by the tissue group. We hope the team will consult with me, keeping in mind the addition of KPIs and key metrics. I both agree and disagree with the auditability of the proposal. I vote 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4892, "q0": "The team, who are Haskell and Cardano veterans, proposes to build an informative dashboard to lay out the tools available for use. The dashboard tools as they see it are not existing in the Cardano ecosystem.\n\nThe informative dashboard is to be created similar to the daomastets.xyz.\n\nThe proposal has identified and listed out some 11 tools and more when identified and are applicable. \n\nThe proposal sees that this informative hub will help projects to explore and find innovative ways of creating financial value, increase transparency and traceability on the impact generated by a specific project. The dashboard provides the understanding of what the tools are and available, their uses and how to use them.\n\nThe proposers believe that this will create value from generating the impact by the issues of impact tokens through educating and informing the ecosystem of the tools they can use to increase transparency and traceability. The proposers have concern though that there are not enough useful and secure tools for impact projects.\n\nThis proposal aims to improve tools in catalyst gf supporting human processes. It also looks at creating financial value. These are called for in the challenge priorities and in the campaign.\n\nI therefore strongly agree that this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposal team has 4 members whose qualifications and experience are related to software development. They believe that they will complete the project within 3 months and will release the website in month 4. All in all, they budget 500 hours of work to the project and at 60 USD per hour, a budget value of 30k USD is required.\n\nThe proposal is giving me an impression that the proposers have great confidence in this project and I therefore strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "I have difficulty understanding the tracking of the project's progress and how it shall be measured. It does not state the channel by which the progress report will be made.\n\nAs for the success, the proposers have given clear goals for their achievements.\nBecause of the vague progress reporting， it prompts me to rate a 4 and not higher and therefore I agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2631", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5485, "q0": "There has been a problem with several functionalities being integrated into programs twice, and this trend is continuing. Many projects have created their own unique implementations to support the same crucial functionality and guarantee that consumers will not experience any problems or lags when using it. But as the proposer notes, there isn't a common method used throughout the entire chain. Yes, a consistent, workable, and reliable process would greatly minimize redundancy throughout the chain, and going forward, there will be standardization that can be improved at a single location. However, some software engineers can have their own reservations about integrating various processes and believe their own, unique approach would be more beneficial. A dashboard providing details of all previously successful crucial functionalities might reduce the production time and also increase reusability and encourage collaborations across the chain. But some authors might show hindrance towards adoption functionalities of others and those might not even meet all the current needs of the author, tackling this would be something to worry about.", "q0r": 4, "q1": "There are many things lacking to the untrained eye, especially given the seriousness of the funds the team has sought, which amounts to nearly 30,000, or more than 10% of the total fund. The route map is very brief and lacks clearly defined deliverables and milestones. Despite the fact that the schedule is only 4 months, there are a number of intermediate stage elements that are lacking. The team appears to be promising and talented, but more experience would have given them more knowledge and enhanced their abilities. For an amount this large, a precise breakdown appears to be very, very hazy. As a reader, I would have liked to be given a more detailed explanation of how and where the funds were used. Pay per labor hour certainly seems exaggerated. In general, I advise the proposer to produce a thorough stage-by-stage development plan before applying it in future rounds with some clear deliverables. It would be simpler for the community given the sum of money the team needs to make this plan a reality.", "q1r": 3, "q2": "The proposed measurements are very closely in line with the specifications of the challenge. The most useful indicator for measuring success is undoubtedly the level of notoriety the dashboard generates for itself. Additionally, the degree of user interaction the portal generates through reusable tools, interviews, and comments is a quantifiable bonus. The auditors can follow the development of the proposal using the reliable results from the number of projects that use the website. I believe the proposer could have provided the community with a few more distinctive metrics that set them apart from the other projects that are attempting to offer comparable support to the community, however, given that those involved have previously worked on other proposals this round and have been a part of MLabs. I only agree with the auditability because the end goals of 15 tools, 20 projects, and 30 interviews have a quantified figure next to it which are verifiable.", "q2r": 4, "assessor": "z_assessor_2704", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6430, "q0": "Creating a dashboard of impact tools for the Cardano blockchain can be extremely important right now. Especially given that so many Cardano projects are building right now. There are lots of developers that are building new projects currently. The proposed idea wants to create a dashboard of tools that can benefit both developers and community members. It will give more options to members in the community and will bring together all of these tools so that they can be found in a single dashboard. This is a simple solution, that can have an important impact if carried out successfully. There is a current challenge in the Cardano ecosystem where it is difficult to find the necessary information. There is so much that is being put out every day, but there isn't a single place a user can go to get all the necessary information. I believe that building tools and dApps are some of the most important things being built on Cardano right now. There is a lot of room for building and these impact tools will help accomplish this task. For these reasons, I give this section of the proposal 5 stars.", "q0r": 5, "q1": "It is important to note that in this proposal there is information included on all of the team members. It gives their names, experience, and accomplishments. This is really important to help determine how likely this team will be able to complete their dashboard of Impact Tools for the community. This is because it will hold the team accountable for their proposal and they will likely receive correction from the community if they don't fulfil their promises. Something else to take into consideration is the details included in their roadmap. This proposal highlights working on the Clarity Dao to help them implement their proposed ideas. They have included specific details on what they plan on accomplishing for the span of 4 months. Each month has details of items that will be worked on for each month. They also did a great job at including these specific details for their budget breakdown as well. This is important because it will allow for the community to hold the team accountable for the completion of this proposal and to ensure that the requested funds would be allocated properly. I believe that this proposal will likely be implemented successfully if there is enough demand for these Impact Tools from the community and developers. For these reasons, I give this section 5 out of 5 stars.", "q1r": 5, "q2": "There is a significant amount of information included in this proposal. Something that really supports the likelihood of success for this proposal is the specific timelines included in the roadmap and budget breakdown, and the idea of bringing Impact tools to the ecosystem. The impact tools will be desirous from many users. The most difficult part of this proposal will be making sure that there is a community that is informed of these tools and when completed, they will know where to go to access the platform. It is important to include transparency and accountability when auditing the success of a proposal. The team should be open with the community about this tool that they propose to release to the public. They should also grow a community in order to be held accountable by a group of followers that are excited for this project to come out. I believe that with the implementation of all of these things and with a community that will hold the team accountable to fulfilling their proposed ideas in the roadmap, it will be possible to audit the success of this proposal and see this utility come on-chain. I give this section of the proposal 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9509, "q0": "For lacking definition on what is meant by “impact driven projects” and shortage of quantifiable impacts, I rank this section a 3. I assume “impact driven projects” roughly means humanitarian projects but I can’t see any confirmational context throughout the proposal. The proposal is also missing a sense of tangible magnitude for how big this issue might be and how much benefit this proposal might bring (which will help voters assess their impact-cost ratio). I think both of these issues could be simultaneously addressed by adding some market research and/or data regarding the status quo. Voters will be more receptive to reacting positively if they knew how many of these “impact driven projects” exist (perhaps with some examples), what kind of struggles impact projects generally experience (not just on Cardano), and/or what these projects COULD be enabled to do. This section does explain WHAT this proposal aims to produce/accomplish but there’s missing factors in the information voters are given to comprehensively assess the proposal. ", "q0r": 3, "q1": "For demonstration of obvious capability and providing enough information to understand the gameplan in roadmap/budget portions, I rank this section a 4. I expect there to be a lot of confidence in this core team as a set of long-time Cardano community members, Catalyst participants, Plutus Pioneers, and heads of industry within Cardano. Where this proposal might see some potential weaknesses is in the relationship between the roadmap and the budget. The roadmap successfully does the minimum of what it’s supposed to do, which is show voters what tasks will be done and what overall timeframe it would take to complete. The budget further defines these tasks with a breakdown of the hours allocated to each task and the hourly rate set for labor. Where I would add a little more clarity is by further describing each task to justify why so many hours are allocated to each task. This may not be an issue for a lot of voters but if a voter is trying to understand efficiency of spending against the labor, there isn’t a lot of substance to thoroughly define the nature of the labor. My reaction is still very positive but I want as much detail for voters as possible. ", "q1r": 4, "q2": "While the length of this section here may not seem like much, the content is very dense and concise with perfectly quantifiable metrics that connect directly to potential impacts, so I rank this section a 4. This section doesn’t waste anytime on irrelevant fluff, as they provide a clear set of KPIs that effectively measures platform quality, usage data, and a mechanism for determining if/when adjustments need to be made along the way. I’m also impressed that this section manages to provide quantifiable goals, some of which stretch into a greater timeframe. This is one thing I would like to see more of as it presents voters with a greater sense of expected performance in the defined future of the project. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9936, "q0": "This project is not about creating tools to measure impact but rather helping at finding the right tools to measure and demonstrate impact. Building out a great user experience by an intuitive UI and good searching capabilities has the potential to save a lot of time from emerging impact projects. To preserve trust and reliability the attention needs to be paid to security features of the tools that are presented in the dashboard. This should become easier with the growth of dapp certification standards. DAOfying the system might increase the reliability (objectivity) of the information provided on the dashboard over long term. Also the possibility of evolving it with new functionalities remains. By bringing proper tools more easily available and accessible, the successful implementation of this proposal increases the value that can be derived from impact oriented projects and as such matches well to this funding challenge. The longer term impact of the project may also depend on how well the analyses, documentation and synthesization are utilizable on other similar informational platforms in the ecosystem. \n", "q0r": 5, "q1": "Team members work for MLabs and Clear contracts which are well known contributors in the Cardano ecosystem. Their LinkedIn profiles indicate them to be highly qualified to implement the proposal. Technically the creation of the dashboard seems not very challenging. Finding and understanding the available tools properly as well as designing an attractive user experience are the keys here. \n\nThe four month implementation period has been divided into monthly phases which are creating a wireframe, creating a website, testing and full release. Hourly work load for each phase is estimated and the budget breakdown done accordingly. Cost per hour and implementation time horizon sound both reasonable to me. \n", "q1r": 5, "q2": "The proposal doesn’t point to a source to follow the implementation process but it describes three clear and quantifiable success metrics which they are going to measure. There are also goals set on each of these. \n\nThe first KPI, the number of verified projects on the dashboard measures the successful work at finding and analyzing available tools. \nThe second KPI, the number of projects utilizing the dashboard measures the success at being able to get these tools to the users. \nThe third KPI, the number of interviews and beta tests with real impact projects measures the success at getting the direct user input into the product design. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10385, "q0": "There are many tools used in projects which are being built on Cardano. Many developers find it difficult to find the tools they need. Moreover, there are not many projects that help to synthesize these tools on Cardano. The proposal will create a dashboard that includes synthesize available tools in the Cardano ecosystem. This project is really necessary for the Cardano ecosystem in general and project developers in particular.", "q0r": 5, "q1": "There are 4 people on the team: Ben Hart, Logan Panchot, Justin Schreiner, Kevin Ma. According to their profiles, they are experienced with blockchain, computers and design. Logan Panchot even joined Catalyst from Fund 4. However, I still couldn't find Ben Hart and Kevin Ma's LinkedIn. I think they should attach the LinkedIn of the entire team so that everyone can easily check the information. They will work on the project in 4 months and it will take about 500 hours to complete all the work. They suggested $60 per hour and the total budget was $300000. Initially, the project will list tools in the following categories: investing, recruiting, marketing, fundraising, token gating, DAO analytics, governance and voting, treasury management, categories management, and community management. But in the future, they can fully expand and add more categories to their dashboard.", "q1r": 4, "q2": "To measure the effectiveness of the dashboard, we can base on the following key metrics: number of tools, number of projects using tools, and number of interviews/beta tests. Furthermore, they also set goals. At the launch of their dashboard, there will be 15 Cardano native tools. After that, every month, they add 3 tools to their dashboard. They also aim to have 20 projects using their tool. Finally, they expect that there will be 30 interviews and beta testing. Although they will create a website for their dashboard, the team should also create social media channels to promote their dashboard.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11486, "q0": "The challenge aim to empower the building of a sustainable world using cardano protocols, can only be attained when proposers are provided with accessible tools and educational resources that can propel great impact/financial values. The proposed solution to create an impact tool dashboard that influences proposers and innovation choices on the right tools to use, when integrating cardano technologies into projects is in place. By connecting these impact proposals with the specific integration tools and knowledge, potentially, the community can begin to experience a system beyond ESG focused projects into financially driven impacts within the cardano ecosystem. The proposal is very specific on the goals it has to achieve pertaining to how innovations within this ecosystem can leverage on available tools. I strongly agree with the proposal motive, and I think they can control the entryway to how systems like DAO structural designs, proposal revenue modules, creation and issuing of tokens etc. are used extensively to improve on the value and monetization of ideas within the ecosystem. Although this is a replication of daomasters tools, the difference and variety in tools presented under this project can further enhance a job already been done. This project meets all criteria and effectively addresses the challenge. \n\n", "q0r": 5, "q1": "The project team seems well prepared to implement the proposed idea. With the vast experiences outlined in the proposal from various skills in computer science, business operation/client adoption, as well as the knowledge in Plutus and DAO creation as active members in the cardano communities, positions the team as knowledgeable in the cardano ecosystem. Also, since Ben Hart, the director of operations at Mlabs is an associate in the team known for developing projects, some of which are catalyst funded, I am certain on the success rate of this project. The success of the project has clear measures and timeframes in place to achieve results. The budget amount has directions on what each dollar is spent on during the implementation phase, and is fairly reasonable, as it's most likely spent as salaries over the stipulated time frame. In the proposal, there is a compounded measure for growth such as the number of projects that utilize verified tools, and the verifiable tools in place for proposers to access. The proposal offers a realistic timetable to complete the work. I agree strongly that the management team can ensure a successful implementation of the project. ", "q1r": 5, "q2": "The proposal has the necessary KPI’s to ascertain what project success is and how growth is measured during its implementation phase. It is commendable that the team included a timeframe for all the activities needed for results. The proposal however has no medium through which the community can track the team’s progress. However, I do suggest community meetups on discord and other preferable platforms can be created to improve upon the transparency of the project. I do think that the auditability for this project is great and we have an understanding of what goals will be achieved to impact the community in the end. \n", "q2r": 5, "assessor": "z_assessor_3252", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Create an informative dashboard similar to https://www.daomasters.xyz/ for impact driven projects to be able to understand existing tools they can use for their projects.", "experience": "Our team is a group of Haskell and Cardano veterans currently building no code DAO infrastructure on Cardano. We see the need to have an informative hub that showcases tools that high impact projects can leverage. "}