{"id": 419016, "author": "fanscardano", "title": "Better Cardano Blockchain Insights", "url": "https://cardano.ideascale.com/a/dtd/419016-48088", "category": 26605, "amount": 58000, "description": "There is a need in our ecosystem for a project that offers clear data about the Cardano's blockchain health and growth, benefiting a wide array of people, from investors to dApp developers.", "f6_no_assessments": 10, "f6_rating": 4.1, "videos": [], "media": [], "f6_assessments": [{"id": 1064, "q0": "While I am not a big fan of retro payments, I find the tool built by this team to be very valuable to the entire Cardano ecosystem, and as such, having the team funded and as a consequence, motivated and valued, would ensure the continuation of their work on the project. Their tool not only provides value inside the Cardano ecosystem but is being used by entities outside of it, helping thus spread correct/immutable facts about the Cardano blockchain.\nThe tool is indeed very insightful and covers a lot of aspects of the blockchain that one might not be aware of. And having all the charts in a single place can indeed help potential investors truly understand why Cardano should be their next big investment.\nHaving said all this, their already working tool has proved to be a valuable asset in the ecosystem and its continuous development would ensure its expansion.", "q0r": 5, "q1": "As mentioned, this proposal covers both what has already been worked on the tool, as well as what upgrades will be done in the future. For the previous work, the tool is the proof. For what is to come, the proposers have described in detail in their plan. It will cover the upcoming 6 months of improvements and updates. Not only that, but at the end, the team will also be providing extensive documentation on their calculations, as their commitment to the community and as proof of transparency. \nThe budget of $58000 is also split into the past and future endeavours, where most of the works covered is obviously the one from the past, with a total number of hours of 1104 which considering the complexity of their tool sounds reasonable to me, especially considering the fact that the charging rate per hour is of only $39.\nIn regards to the team description, they have offered ample details about their skills and knowledge. For now, only one of the members has provided his name but considering that the proposal is for an already existing tool, I see absolutely no impediment in the future implementations of improvements, regardless of how many of the team members have provided us with information about their expertise.\nAs such, my conclusion is that the budget seems reasonable considering the quality and popularity of the tool, proving that it is highly sought after in the blockchain space in general, not just on Cardano. The team has proved through their existing work that they are highly capable and will probably keep un improving the tool, and the plan is sufficiently detailed to get an idea of what is yet to come. ", "q1r": 5, "q2": "Considering that the tool has already been developed, the auditability section seems to not be as relevant in the case of this proposal. When compared to the rest of the proposal which is very detailed, this section seems a bit lacking. However, the team has offered some metrics in the second question, where they say they will be monitoring the daily site visits and the usage of their tool when referencing data about the Cardano blockchain. The metrics are on point and offer information regarding both the success and the progress of the project.\nIn conclusion, even though more succinct than the rest of the proposal, the information provided is sufficient to establish that the community can easily verify the progress and success of this project.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 2509, "q0": "The smart contract enabled Blockchains have become quite popular in last 5 years or so. Ethereum was the first blockchain to implement smart contract capabilities to its chain successfully. This resulted in a host of other such chains being launched after Ethereum. Most of these Blockchains use account based model for processing transaction. Cardano on the other hand uses eUTXO model which is derived from Bitcoin's UTXO model. eUTXO model is very different from account based model and the way transactions happen in this model is quite complex. Due to this reason, the data abstracted from Cardano blockchain is complex to understand and hence is not very useful to people who don't have technical skills. \nThe proposal is trying to solve this problem by developing a tool called, Cardano Blockchain Insights to help users understand the blockchain data from Cardano. The website is already live with various kind of data regarding stake pools, staking, and number of transactions etc is provided in a very concise and user friendly way. This proposal concerns about providing 3 main functions to the existing website which includes tools for research/investor analysis, monitor the state of the blockchain, and create educational content for the community. The website is already well recognised and being quoted by popular media outlets like cointelegraph etc to provide data related to Cardano blockchain. \nThis project is already providing very useful information to all the stake holders regarding Cardano. Improving and adding new features and data points to this website will help the users on the Cardanon make more informed decisions. Also creating educational content regarding complex transaction structure of eUTXO model and breaking it down in simple terms will help in educating and attracting more users to the Cardano ecosystem. \nOnly problem here is that the objective of this particular challenge is to leverage Cardano blockchain to build new solutions for positive impact valuation and monetization, with respect to the impact projects. I don't think that this proposal is an impact project as per the definition of this challenge and is more of an enabler by simplifying the analysis of the data. The project has also mentioned this fact in the proposal that as there proposal was not fitted with the objectives of any other challenge hence they have submitted it under this catagory. \nAlthough the proposal may not fit into the objectives of this particular challenge, but it perfectly aligns with the primary objective of Catalyst which is to help in the adoption and growth of Cardano ecosystem. I would also suggest  the project to submit a proposal in the next round to create such a challenge in the subsequent funds to address the need of this kind of proposals. ", "q0r": 4, "q1": "The proposal is spanned over 6 months of period and includes steps to improve accuracy and validity of data by checking data against multiple sources, analyse other data storage/retrieval solutions for better scalability for heaviest queries on Cardano DB Sync and providing documentation, regarding calculation of different metrics, in the form of study material. The proposal also includes adding more parameters and analytical tools to the existing platform. The team consists of two people who have the knowledge and previous experience in the space and have already worked on multiple projects including Cardano Blockchain Insights. Looking at these facts and the existing work done on the project, it looks feasible and can be implementedon on time. \n\nRegarding the request budget, the team is asking for funds of $58000 and the breakup of the budget shows that all the funds are requested for content creation @ $49/hour for 1482 hours. What's odd here is that according the proposal, these 1482 hours include 1104 hours of content already created and which is available on the website. On reading the whole proposal throughly, it is mentioned under the subhead \"[FEASIBILITY] If you are funded, will you return to Catalyst in a later round for further funding?\", that the team is asking these funds to cover most of the expenses already incurred. In my opinion, this will defeat the purpose of the Catalyst funding to improve the ecosystem.", "q1r": 3, "q2": "The progress of the project can be monitored through the new features being developed on the Carsano Blockchain insights website https://datastudio.google.com/reporting/3136c55b-635e-4f46-8e4b-b8ab54f2d460/page/p_wxcw6g0irc......\nThe new content created and uploaded on the website can also be verified to monitor the progress. So the monitoring of the project will be possible easily by following up the regular updates. The success of the project can be measured from the increase in number of users of their platform and use of their platform by many institutions including media outlets to run the news stories. But on the Auditability front the most of the funds requested are for the work which is already done and team is precisely trying to cover most of the expenses already incurred. This will make the Auditability very difficult as the funds will not be used to perform new tasks.\n\nIn the end I will add that aside from some of the concerns and shortcomings in the proposal, it is a good initiative to make Cardano more user friendly. I wish the team all the best for the project.", "q2r": 3, "assessor": "z_assessor_2312", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3894, "q0": "The issue being non availability of project that offers clear data about Cardano blockchain health and growth. Which would help many people from dApp developers to investors.\nThe proposer is trying to solve this issue by creating a tool that offers to help users understand the blockchain by exposing its network effects, serving educational content and providing investor analysis. This will increase efficiency of cardano ecosystem and also help attract new investors. Therefore the proposal does address the challenge", "q0r": 5, "q1": "Based on the details given the proposer has all required skills and experience to carry out this proposal successfully. They have provided a clear plan of implementation divided in monthly bases. However the budget demanded seems bit expensive and I wasn't able to find content which required 1104 hours to create. The proposal has considered all possible risks that would affect implementation. it is somewhat likely this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposer in the proposal has given detailed milestones with a monthly time frame to achieve and the proposer has also mentioned how to measure project's progress all this would be helpful to measure the success of the proposal. The proposal also consists of how success of proposal would look like and also how to measure the success of the proposal this would be helpful to audit the success of the proposal. Hence information provided should be enough to track the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4392, "q0": "The proposal solve the challenge set out in the Challenge, and identify the problem that needs to be solved as a project that provides clear data on the health and growth of the Cardano blockchain, benefiting the community, many people, from investors to dApp developers. In my opinion, this is very necessary because until now, everyone interested in Cardano has not been able to know clearly the existence and development of the Cardano blockchain in the most orderly and convenient way. their. They have to extract information from various sources on the Internet or directly from IOG or Charles Hoskinson, etc... Going beyond simply providing information, this proposal offers a solution that is public tool to help users understand blockchain by demonstrating its network effects, providing investor analysis and serving educational content. So it's much more comprehensive and useful. Implemented on the Cardano blockchain platform, it definitely adds value to the Cardano ecosystem and can scale and solve challenges in the future. If implemented and successfully applied in life, this will be a promising tool contributing to impact on many areas of society (originally affecting investors and Dapps developers).\nI strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 4, "q1": "Through the recommendation, I learned that the team has experience in backend development and data engineering, long-term SPO, full-stack, and data engineering, team members have a computer science background and is also an expert in programming languages, etc... The team has also provided a full explanation of the problem and documents related to the proposal, related to the team mainly through the website link. However, I have not been able to see the specific identity of each member publicly via social networking links (Linkedin, Facebook,... I would like to comment on this: As a team, please quickly add profile information. Information related to the team for the community to easily look up because from there it will be convenient for the community to look up the identity of the members and verify the feasibility of the proposal and further affirm the reputation of the team. group (information should be made public to be worthy of the team's stature and long-standing reputation) If the team lists the members in detail, it would be great. The number of core members in the group has not been stated. here as far as I understand only Mr. Mateusz is the key member, the team may also have other members or other collaborators that have not been identified.\nThrough the detailed budget analysis, I find it reasonable with the goal. However, the list of important tasks to be done seems sketchy, and not focused on the analysis. I have found that if the analysis is more thorough about which items need how much money… the team can strengthen more confidence in the feasibility of the proposal. As a PA, I still want the team to show more clearly the budget required for each small job so that the community can look at it and have more confidence in the feasibility of the proposal. It's perfectly understandable for the team to present the budget as it is - professionals and people who already know the team well (know what the team needs to do) are perfectly understandable, but I think everyone from the community (some people are very new - they don't know anything about the team and this proposal) can understand it easily then we need to have a more detailed, easy-to-understand presentation more. That's my advice on the budget. I have an additional question, if it hasn't been funded by Catalyst in Fund 9, will the team continue to work on this proposal? And what other sources of funding does the team have to be able to implement this proposal (from contacting support from other organizations)? I ask this question because I want to demonstrate the clear feasibility of the budget. Going into the analysis of how to calculate the wages to pay the team's salary according to the above proposal is to calculate the hourly rate - this is consistent with the calculation method of the large corporations in the world today - it brings accuracy and efficiency.\nThe plan and implementation method have been fully outlined by the team step by step, which is quite logical. It is divided into 3 main values ​​(1) Data for investor research/analysis; (2) Monitoring the state of the blockchain; (3) Creating educational content for the community. This is one of the important factors in clearly defining the feasibility of the proposal.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, with at least 1 key member with a lot of experience and professionalism, I am quite skeptical that the proposal will be successfully implemented (if only the team could clarify this - advice) mine shown above). The team that shares that there is no member is also working on another proposal in parallel with this proposal at Fund 9. This can help the team focus 100% of its human resources on implementation, ensuring full for the quality of the successful implementation of this proposal. At this point, the trust of the community may be slightly raised, thereby increasing the feasibility of the proposal. But for this proposal to be implemented successfully, I think it needs the participation of many members, not just a few key members. So can the team share more about who (collaborators or other staff) could work with the team to develop and implement this proposal? My advice is that the more the team shares publicly, the more trust the community will gain. That is favorable to the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, programming languages ​​(Haskell/Plutus), writing Dapps, creating tokens, Total Value Locked, etc… I think it is mainly built by core members. core team - people who already have as many skills as the proposal presents. In addition, such a large prestigious team can completely mobilize external support to propose to be implemented in the best way. I strongly support this. That is the basis for me to believe that the team will do a good job when implementing the technical aspect of the proposal implementation.\nThe team is also quite clear about the risks involved in implementing this proposal: Risk of scalability of Cardano DB Sync's analytics capabilities - with a satisfactory solution to prevent it. In addition, I add a third risk that could make the proposal difficult to implement: Ada slippage - which will affect the budget of the proposal. We know that the digital currency market is at the beginning of hibernation (devaluation of digital currencies), so Ada may depreciate when the team receives from the Catalyst fund, then the team will face the problem of lack of budget to implement the proposal - hindering implementation. So my advice is for the team to take a close look at Ada's slip-in budget to make the budget requirements in the proposal appropriate.\nThese are just my contributions, the team can review and make additional adjustments to this proposal to increase feasibility. I both agree and disagree on the feasibility of the proposal. I vote 3 stars.", "q1r": 3, "q2": "The roadmap of the proposal was presented in quite a detail by the team with a total duration of 6 months. This is a logical roadmap and milestone. The work steps to be performed in each stage are very specific and in a step-by-step sequence - containing all the necessary information. I think it would be better if you try to associate this milestone with a specific month of the year (eg January, February, ... - this is just an example). If the team can do so, it will be much easier for the community to assess the transparency and auditability of the proposal.\nI have a question when I don't see a set of performance indicators (KPIs). Can the team review and present the KPIs? We all know the role of KPI in the audit. This makes it more difficult for the community to evaluate and audit the proposal. I consider KPIs to play a certain role in demonstrating the transparency and auditability of the proposal. So my advice to the team is to quickly add KPIs to the proposal. Then this proposal will have much higher transparency and auditability.\nOn the matter of \"what the success of this project looks like\", the team had a clear criterion to measure success: Track daily website visits by setting a goal of 450 visits/day; Provide a monthly review of how many times Cardano Insights data is referenced in the media. Thus, the definition of success is not only tied to specific numbers but also refers to the theory and practical applications. I am satisfied with this definition of success, it makes sense. Throughout the proposal, the team clearly described the problems and solutions. We hope that the team will consult with me, taking note of the addition of KPIs. I agree with the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5543, "q0": "To successfully build new solutions where positive impact can be valued and monetized would be dependent on whether developers have been well informed or not. If developers are well informed about this provision, I believe it will shapen them when trying to develop solutions because they would consider developing solutions with high positive impact. So therefore, the problem statement identified here is in alignment with the challenge. Every user within the cardano blockchain needs to be aware or better under the complexity of the blockchain and its network effects so that there can be a better understanding within the ecosystem to yield the maximum output. Tools are important in achieving this and if the proposer is envisioned to build such tools and deploy them in the ecosystem, I think this is already a big win for cardano.\nNow, comparing the key metrics of the proposal to that of the challenge, I see a good alignment with the setting. \nCardano blockchain insights bring value to the ecosystem (this value can be measured by the satisfaction of ADA holders, dApp developers etc) and even in the future sense of the neeed arises, I believe the proposal can be used to propagate other Cardano aspects to the ecosystem and even outside the ecosystem.\nThe proposer appears optimistic that the project would be financially sustainable as they are requesting funds to execute it and do not have an intention of returning to catalyst for further funding.\nWith respect to all that have been stated above under this criteria, I am confident that the proposal makes impact.", "q0r": 4, "q1": "Information provided about the team’s relevant experience (links and references) and considering the details provided about each member’s experience and expertise, I am confident that the team is capable of executing the project. The proposal also lows his team members as there is a clear indication of their number, names and other details.\nThe budget presented is not so detailed. It’s clear that an amount of $58,000 is requested for but however there is no further inclusion on how the fund would be used except that there is only a breakdown in hours ( but not how the budget will be used in those hours). This is actually compromising the feasibility of budget. I will suggest that, for future proposals, there should be a thorough breakdown of the budget cost so that there can be a better understanding of it. Though the budget appears unclear, however the amount requested is reasonable and sensible to execute the project considering that some contents have to be created in the site and settling other technical development. The roadmap presented here is concise and so do too the timetable. The plan makes it clear how activities would be carried out within the 6 months of project execution.\nIt’s good effort that the proposer has foreseen the riskthat may arise during the implementation of the project and has provided measures to mitigate it. It’s one risk foreseen though but I think other risks can surface. \nConsidering strengths in some aspects of the feasibility assessment, the project is feasible.", "q1r": 4, "q2": "The roadmap has clear milestones and time horizon for implementation. The milestones are \nclear because it’s easy to know what the team seek to achieve within the space of the six months. For example in month 1, the team seek to improve validity and accuracy of data by checking data against multiple sources of data; this is very clear and so applies for the other months. Clarity in milestones make it easy to determine whether the project goals can be achieved or not. \nThe metrics were wisely chosen and I am confident that they are good indicators of measuring success as the outputs measure the daily site visits and the use of Cardano blockchain insights as referenceable sources. \nThe problem described here is clear and I believe that the proposed solution is effective to address the problem. The proposer has not clearly stated an accessible public space where cardano/catalyst members can evaluate the project’s development, probably the team would communicate development updates on their YouTube channel. I will however advise that the team make use of the catalyst community channels on Telegram, Discord and the other accessible platforms so that there can be a better evaluation of the project. \nI am however confident that the project is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6431, "q0": "Creating tools for the Cardano ecosystem are crucial to further development and growth on the blockchain. With more dapps and defi projects being built on Cardano, we need to make sure that we can keep up to date with all of these changes and ensure that the community has accurate information. The challenge provided in this proposal suggests that there is a clear need for a dapp that would include this information. Specifically creating a dapp that would follow the overall health and growth of the Cardano ecosystem. It would be important for a dapp to be built on Cardano that includes this information. There are many people that are focused on the growth of Cardano. This is fantastic, but we should make sure that we are ready for extensive growth. By creating these dapps we will be ready for this growth and we will have functioning dapps that can track this. Ultimately, these dapps will promote further growth and will likely have a positive impact on the Cardano blockchain. It is also exciting to see that this proposal is under the challenge setting of Catalyst Natives X Cardashift. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q0r": 4, "q1": "The first thing I looked into from this proposal is the functioning dapp Cardano.fans. This is important because it shows that there is already a functioning product. This increases the likelihood of the team being able to carry-out their proposed idea. Something that could be included is more specific information on the team members. It is important when names and possibly LinkedIn profiles are included. This holds the proposer accountable to this proposal and increases the likelihood of the proposal being implemented successfully. The proposal includes a detailed roadmap that plans to take place around 6 months. Each of the months have specific goals the team plans to meet in order to accomplish their Dapp. This is important to note because including specific information is crucial to the potential success of a project. It helps the reader to make a rational discussion when auditing the success of this proposal. There is also a detailed roadmap that provides a layout on exactly where the requested funds would be allocated and how much they will need. I think that this section could include more specific information on how the requested funds will specifically allow them to create their dapp and how it will be worth it in the long run. The team has experience given the fact that they already have a functioning dapp and plan to improve upon it. However, I would still include more information on the team. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q1r": 4, "q2": "There is a good amount of information provided in this proposal. It has been written well and is very concise and straight to the point. However, there can always be more specific information included. This would be the sections talking about the team and their experience and the budget breakdown. Specifics are extremely important when auditing the potential success of a proposal because it allows the proposer/team to be held accountable. Without the aspect of accountability, it is hard to determine how likely the team will successfully implement their project as described in this proposal. There could also be a description that talks about plans to have a community and market/promote this project. The team should consider which groups or communities their project would benefit the most. This will help the team to figure out where they should market their product and the type of groups that would find use out of their dapp. I give this section of the proposal 4 out of 5 stars as I believe it can be very successful. If all suggestions are considered, this proposal will be more likely to be successful.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6702, "q0": "This is an excellent proposal that aims to bring transparency to the Cardano ecosystem vital signs, through an online tool that tracks relevant data regarding the network utilization rates, addresses and general activity levels. The proposers correctly point out that such information is useful to a wide array of stakeholders: users can gain a general understanding of the system, investors can check network health statistics before allocating capital, and developers can use it to identify potential niches for future projects. \n\nThe data users currently have access to is not very user friendly, and can be found in various sources (Mesari, adapools, private APIs, etc.). The proposers have already developed an aggregating tool that brings all this knowledge together and provides a similar format for easy readability and understanding, and there are already examples of that knowledge being utilized in various sources, for instance in a detailed Kraken report on the Cardano ecosystem, or in various media articles as a reference point for network utilization. \n\nConsidering the very broad scope of the challenge and its impact seeking objective, there is a great connection of the proposal with the challenge, and also considering that we have an existing product that seeks funding in order to improve its activities and introduce new features, five stars are definitely the way to go for its impact. ", "q0r": 5, "q1": "The proposal does a fair job at presenting the team, with extensive experience in development and data engineering. Mateusz is a full stack dev, and Andre has experience in data storage. They are also a stake pool operator, and behind the Cardano Fans Stake Pool. I feel the team could have also included a few social media profiles for added confidence in them\n\nThe project timeline would take six months to complete. The first month would be dedicated to improving accuracy and validity of existing data, and the second one on stability, scalability and performance aspects. The last four ones would focus more on documentation of calculation for certain metrics and add new metrics to the dashboards (effective-k, tokens, pools, search volumes, etc.)\n\nThe entire budget asks for around 1.5k hours at an hourly rate of 39 USD. But there’s a catch: around 1.1k hours are for work already done, while around 400 are for future work, so in essence the voters are asked to largely fund past work. While this is definitely not against the guideline, it is rather an unusual request, but let’s put a positive spin on it: the team is very transparent and outspoken about it, and they have already delivered a solid product. Do you like their dashboards, would you like to see the advertised improvements? If yes, absolutely no reason not to fund them, since the project is mostly delivered already and you can judge its quality already. \n\nFor the very good timeline and excellent transparency on the unusual budget request, and the fact that the product is already mostly delivered, definitely five stars!", "q1r": 5, "q2": "The best indicator of the project’s success is if it turns into a prime source of information about the Cardano ecosystem, and the team also sets a very clear target: 450 daily average visits. Since the product is already alive, click the link in the description, add to that counter to reach the 450 figure, and judge for yourself its quality - what better indicator of transparency can it be for a project that is already delivered, except a few features that will be built in the future? \n \nFor a project mostly delivered, nothing short of five stars would be fair to offer here. Great job guys!", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9641, "q0": "The proposal offers an application product that openly and accurately provides the operational status of the Cardano network. If it can do that, it will become a trusted and reputable portal at a better level than Grayscale, Mesari...\nAs such, Cardano Blockchain Insight needs to clearly define the goal of becoming a trusted and in-depth information provider about the Cardano network. It should not aim to be a public education website with unverified and journalistic information. If we are longtime Cardano investors or developers of dApps, Smart contracts..., we only care and visit every day when Cardano Blockchain Insight provides us with important data. Although, they can be confusing for most other readers.", "q0r": 4, "q1": "Cardano investors, dApps developers will be looking forward to the completion of Cardano Blockchain Insights. It will be a centralized portal for reliable and in-depth information on the health of the Cardano network. They are very useful for their property and day-to-day work. For example the number of Plutus scripts, TVL, compiled information from Cardano Database, link for correct lookup with GitHub....\nThe risks of this proposal have been correctly pointed out. The speed of processing increasingly large amounts of data will be the challenge of Cardano Blockchain Insights. It will impact the user experience. I do not find a reasonable solution to address or limit the impact of the risk in this proposal.\nIn addition, for Cardano Blockchain Insights to be more effective. It should have dashboards that compare the key KPIs between the Cardano network and other popular Blockchain platforms like Etherium, Pokadot, etc...", "q1r": 4, "q2": "The implementation plan is clearly described, the tasks are arranged in a logical order by month, and the results are easy to track.\nThe detail budget breakdown is not clear. It's not built around missions. It is only a generalization so it is difficult to audit. However, the scope of this proposal is only in Fund 8 so $58,000 seems reasonable compared to the impact this proposal will have on the Cardano community.", "q2r": 4, "assessor": "z_assessor_3073", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9937, "q0": "The proposal is about creating an intuitive and understandable dashboard of insights about Cardano blockchain. The tool already exists, is well recognized and the work continues. The product and the proposal are great but, in my view, do not fit this challenge.\n\nI can imagine that the tool generates a lot of information and insights about the activities of different products and services that could be used to verifiably measure the amount of impact they are creating. For example the amount and the context of using some tools by different people. But as its current form I can’t see the proposal to address this challenge as it asks for specific ways to turn information about impact into tradable assets. In my opinion this proposal should be in the Dapp, Products and Integrations challenge.", "q0r": 1, "q1": "About 2/3 of the work has already been done successfully. For the rest, the six month implementation period has been divided into monthly intervals. First two month are mainly improving the existing functionalities and fixing usability issues. After that, the plan comprises writing documentation and education as well as introducing new metrics to monitor. It is obvious that all of these things are doable. The proposer has demonstrated having all the technical skills needed. The risks are minimal. The ask for hourly compensation is very reasonable.", "q1r": 5, "q2": "Since most of the work has already been done, open source, widely used and freely visible, auditing this part is straightforward. A Github link is available to the work done. The next steps are clear, independent and can be verified step by step. Quantifiable KPIs consist of the number of visitors on the site and the current target is 450 per day. Media referencing the data on the platform is planned to be tracked.", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14498, "q0": "The problem we face is our ecosystem is in need of a project that provides transparent information on the Cardano blockchain's health and development, helping everyone from investors to dApp creators. The proposer hopes to resolve issue by developing a platform that will explain network effects, provide investment analysis, and provide instructional content to users so they may better comprehend blockchain technology. Although KPIs are referenced in the website goals, the proposal's KPIs are not explicitly defined as such. The general objectives of this proposal demonstrate that improving Cardano Blockchain Insights will increase the value of the Cardano ecosystem. ", "q0r": 5, "q1": "The two-person team has already established the framework and produced a useful educational tool, and their backgrounds match the talents required to carry on and enhance this work. They have a track record of overcoming programming and data engineering hurdles, and they have proactive plans to grow this tool to accommodate the anticipated developments in the ecosystem. The company says it is looking on scaling challenges, although these solutions are not obvious. The budget is brief and not totally clear, but the team has produced a plan on a monthly basis that outlines the necessary resources and has a reasonable timeframe. The 1104 hours are being requested to make up for already-completed hours, and also where did the 378 hours come from?", "q1r": 4, "q2": "The proposal said that they will track daily site visitors by establishing a goal of 450 visits per day and releasing. a monthly assessment of the frequency of Cardano Insights data references that do not include a defined roadmap or timeframe for completion. I believe that either the community doesn't know what to expect from the proposer beforehand or the proposer doesn't disclose enough information to test the proposal's viability. I want to see the KPIs and metrics for the three key values that the project has promised to report on in accordance with the detailed roadmap.", "q2r": 3, "assessor": "z_assessor_4060", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A tool to help users understand the blockchain by exposing its network effects, feeding investor analysis, and serving educational content.", "experience": "Our team is deeply involved in the daily “life” of Cardano, long- time SPO’s with CRFA pool and with strong experience in Backend Development and Data Engineering."}