{"id": 419340, "author": "dposadas", "title": "Tokenized tech indie drama film", "url": "https://cardano.ideascale.com/a/dtd/419340-48088", "category": 26605, "amount": 200000, "description": "Indie film makers have a hard time financing their film projects especially if these are not exactly viewed as commercially viable. The film can be a vehicle to show that Cardano can tokenize assets.", "f6_no_assessments": 7, "f6_rating": 1.4285714285714286, "videos": [], "media": [], "f6_assessments": [{"id": 1066, "q0": "As a fellow filmmaker, I got very intrigued when I came across this proposal. Changing film financing and distribution is obviously one of my main hopes for web3.\nHowever, the lack of details regarding the process of financing, the subject of the film, and the minting and distribution method have been pretty disappointing. \nFrom the rigorous teachings of the film school, I find it hard to believe that this is a film-financing pitch. From my experience, any film producer would like to know more about the subjects I have enumerated above, to better gauge the potential success of the project. As such, I am surprised to see that a person who claims to be a successful screenwriter would leave the entire pitch at this level of detail. And when I read that the proposed solution is to finance this film, because Nokia has also pledged four 5G smartphones and Acer an i7 laptop I found it staggering, since it conveys no information about the project itself. I know there are other film projects, even on Cardano, who are financing their production through NFT minting, so maybe the proposer can take a look at what other teams are building and see what he could potentially add to the space.\nI would really like to see successful film enterprises on Cardano, but I would not give my vote or my trust to projects if they do not take into consideration all aspects of filmmaking, as being amongst the first in a domain and a new space, sets up the standards and the expectations for all the projects to come.", "q0r": 2, "q1": "Two of the three main sections of the feasibility section are not finished. The text says “To follow…”, as such, I will not be giving advice on what is missing, since it hasn’t even been started yet. My only advice is that perhaps for a future fund the proposer will have more time to think about the proposal, add the missing information and perhaps complete the missing sections with the needed details.\nRegarding the team description, the proposer has provided a minimum of information, by writing the names of the screenwriter, directors and actors. However, since this proposal is for a tokenised film funding, the proposer is missing some important key jobs, with specific skills in the blockchain space.\nConsidering the unfinished section of the proposal, I cannot be giving the feasibility section more than a 2.", "q1r": 2, "q2": "The proposer mentions ”We can give monthly updates on our progress” as the only answer to the project’s progress. If this is their answer, then my questions to it becomes where, where will those monthly reports be published?  It is very important to mention, as this part of the proposal that is dealing with auditability is specifically meant as a way for the community to be able to assess the advancement of each and every proposal. If such an option is not given by the proposing team, then the PA will have to decide how many points to deduct for that specific missing aspect. It is also important to mention what kind of metrics the proposer will be using to evaluate the progression of the project.\nIn regards to the success of the project, naming a few famous film festivals is, from my point of view, a good outcome. The presence of both the film and possibly the author could garner a lot of attention from the film industry. \nIn conclusion, the auditability section is only partially answered, but the most important part of the section, the evaluation of the progress has been completely neglected by the proposer, as such, I will rate it a 3. ", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2424, "q0": "We observe that the project presents an interesting idea, since the difficulty of financing for indie films is real. However, we have that one of the main premises of this challenge is the establishment of metrics so that the impact generated on an ecosystem is measured, but here we cannot find such metrics. Furthermore, given this information gap, the budget being requested of $200,000 is very high. We would need better structured concepts for such an amount to be better justified.", "q0r": 1, "q1": "Given that a large budget was requested, it would be interesting to have a very detailed action plan. However, we found a lack of information about this. It seems interesting that a system is created and explained that shows how people would invest in the films and if there would be a return on that investment. In fact, this possible return seems to be one of the ways that would cause greater traction to invest in the films. We also see that the budget breakdown section does not present information that shows us how the $200,000 will be spent. It would be nice if there was a schedule with well-defined milestones, both in terms of what will be accomplished and also in how long. Finally, it also seems important that more CVs of professionals had been made available, so that we could verify that their technical skills are consistent with what the project intends to accomplish.", "q1r": 1, "q2": "We realized that the described success scenario brings points that are consistent with what the project wants to accomplish. However, the metrics used to monitor the evolution of the project are a little scarce. We know that progress will be indicated monthly, but we are not sure which parameters will be used to understand this evolution. A possible parameter would be, for example, how many people were interested in investing in the film or the engagement that the project has caused on social networks.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4596, "q0": "The proposal is \"to use Cardano tokens as a way to token finance an Indie film\".\nThe proposer asks for 200000 usd.\nThe benefit for the Cardano ecosystem is the news coverage of Cardano co-financing a film.\nParts of the proposal are incomplete but a lot of passion from the proposer for the project is on display.\nHowever the proposal does not really align with the motto of this challenge \" How the Cardano technology can be leveraged to build new solutions for a positive impact valuation and monetization\".\nThis challenge is in my opinion more about making 'the tools' to measure and value for instance cultural important projects.", "q0r": 2, "q1": "With the information given it is  not possible to predict the succes of implementation of the proposal.\nThe background and the experience of most of the people who will work on the proposal are not available in the proposal. Budget breakdown is also not available.", "q1r": 1, "q2": "The proposal did not provide any timeline with a roadmap on which the project could be audited on.\nThere is no  budget breakdown.\nThe final date of finishing the project is uncertain.  ", "q2r": 1, "assessor": "z_assessor_2568", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9513, "q0": "There’s a lot of potential in possible solutions for this problem statement as it integrates the Cardano ecosystem with creators that are vectors of cultural influence. Obviously, there isn’t nearly enough substance in this proposal to justify a highly risky $200k ask but I’d like to engage with the concept to see if I can’t help develop this idea a little more. I would be very disappointed if these requested funds were meant to BE the fund for indie films, as opposed to building a solution for funding indie films that produces a more long-term sustainable impact. I may not have any $200k ideas about how this solution can function but I do have a lot of thoughts about economic mechanics on which this platform is built. For example, this funding cannot just be created out of nothing, there has to be an inflow of liquidity from people that are incentivized to provide those funds. First, I’m excited about the idea of indie movies put into NFTs (or NFT keys that enable exclusive access to indie movies) because it creates more adoption potential for the Cardano ecosystem if it means attracting indie film movie lovers. Next, it might increase funding potential if a created token had created demand through utility that expanded to indie film makers, equipment/costume companies, ticket sales, merchandise/memorabilia purchasing and a variety of other related industries that made this kind of platform an all in one place for filmmaking and film viewing/interacting to happen.  I think more blockchain related development for this solution has a far greater chance of impacting the Cardano ecosystem than just the funding of a single film with Catalyst funds for publicity sake. That’s not productive, efficient, or aligned with Catalysts mission to pursue the highest levels of community innovation. ", "q0r": 1, "q1": "Without a roadmap and a clear breakdown of how funds are being efficiently spent for the greatest possible impact to the Cardano ecosystem, I have to rank this section a 1. As this proposal continues to look like an end credits reel and goes on to describe a movie plot, I realize that this proposal was intended to be a request for funding of a single indie film. If we’re evaluating the feasibility of the core team to produce a completed indie film, I think there’s a real shot at confidence (if we were given all the necessary details)  because the proposer has seen success in it before. If we’re evaluating feasibility of this proposal to produce an ROI that reliably impacts the Cardano ecosystem, I’m not seeing any strong links to believe that this would be the outcome. In the event that this proposal attempts another round, I would strongly suggest providing a very specific roadmap and timeline as well as a budget breakdown that proves every dollar is being spent efficiently. If Catalyst voters will respond positively to funding an indie film simply for the hopes of massive public exposure (which also needs to be quantified), they would be substantially more inclined to do so if extreme detail is provided. ", "q1r": 1, "q2": "This is an extremely unorthodox proposal, so the usual expectations that a proposal would provide measurable KPIs for platform usage is not applicable here. I have to rank this section a 1 because there is not enough substance to measure an impact that directly links to the Cardano ecosystem. The problem here is that there is an incompatibility with this proposal trying to evaluate auditibility (which was designed for projects aiming for innovative technical development). This proposal is essentially a grant for advertisement/publicity of the Cardano ecosystem, which is not the purpose of Catalyst funding. I think there are ways to make this proposal happen within the Cardano ecosystem but I do not think that Catalyst is the right place to go for it. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9705, "q0": "The notion of funding an indie movie would be of value, in a tangential way, as it could increase awareness of Cardano as an integrated part of how we live. The idea does not, however, directly address the goal of supporting impact projects as the movie itself has no link to Cardano. Perhaps some content coverage of Cardano in the film could be considered?  A form of exposing the audience to Cardano ( like advertising!) There does not seem to be much reach beyond the film being funded - which would be good for the film maker. The broader idea of Cardano funding worthy artistic endeavours holds merit as it could definitely result in greater public awareness, but there are no reasons provided for why this would be an appropriate recipient of Cardano backing, which is really an issue. ", "q0r": 2, "q1": "There is very little information provided so it is difficult to assess. The links provided describe the plot and characters of the film but do not provide information regarding the feasibility of this film.  There is no information on relevant skills or on any connection to Cardano beyond them serving as a financial backer. There is no breakdown of how money would be spent or of the specific nature of costs. The amount requested is the entire budget for this category which is quite unreasonable, really.", "q1r": 1, "q2": "Apart from promising a monthly report there is no plan for auditability.  The possible mention of Cardano in reviews is the only outcome suggesting a positive result for Cardano. This would depend entirely on the success of the film, which is tenuous. There is no mention of KPIs and this feels like wishful thinking. It is important to be positive and passionate but it is also essential to be credible and have realistic targets and measurable outcomes. This is simply not provided.", "q2r": 1, "assessor": "z_assessor_3085", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9759, "q0": "The proposer has not given enough information in his description of his solution to the challenge, because of this it is unclear whether the challenge brief has been understood. The information about the project is very surface level, there is no information about the project's future sustainability. It is also unclear exactly why Cardano/Catalyst is needed or should be involved, the only benefit stated is possible news articles about the funding of this movie. There is not enough detail provided about this either. There does not seem to be a broad positive impact on the Cardano/Catalyst ecosystem, if there would possibly be, it is not indicated in the proposal. There are no KPI's stated other than a monthly report which is not enough to assess the journey of the project. ", "q0r": 2, "q1": "The proposer gives evidence of his experience as a playwright, authour and screenwriter. He also gives evidence of past successes. The links provided are to script excerpts and pieces of information about the film that have to do with characters, plot, genre and themes. There is not much information or references given about why this project is feasible. There is a clear number of people who will work on the film but there is no detailed budget plan or plan of timelines and milestones given. There is clearly not enough information given, they ask for $200000 but do not break down exactly what this money will be used for. ", "q1r": 1, "q2": "There are no KPI's give except for one mentioning of a monthly report, the positive impact for Cardano/Catalyst is unclear besides for the possible mention of Cardano in possible reports. There is no roadmap for achievements. ", "q2r": 1, "assessor": "z_assessor_3092", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12133, "q0": "The proposal is to solve the problem of finding financing for non-commercial indie films. They propose the use of crypto tokens to tokenize these as assets. An interesting suggestion is to use crypto tokens as assets, but various other aspects must be considered, including filmmaking, not just making crypto as an icon to be an attraction, film synopsis is a powerful force. should be the main weapon, regulation and legality of using crypto assets in the broadcasting country must also be considered, getting actors who are willing to be paid for using it may not be too difficult but for operational activities, it may be an obstacle. The use of crypto assets can be two sides of a coin, it can be an attraction but it can backfire. the appeal because this is something that is a hot issue but if the planning and the main assets don't sell then it will make this film bad.", "q0r": 2, "q1": "Proposer provides details of the film project that will be produced but there is no plan to link the film with crypto assets. The team in making the film is only mentioned by name and role, but the ability and experience in the field is not explained, so there is no description of their capability or not for the job description. The proposed budget is too large because the proposed budget is the overall budget for this challenge. There is no detailed breakdown of the budget allocation. There is no timeline in the filming process. they do not describe the risks in this challenge, even though in the process of this project there will be many obstacles as described previously. This project also does not add value to the cardano ecosystem. The proposser should recreate this proposal more clearly starting from planning, executing, and evaluating and there needs to be a correlation when connecting this industry with blockchain technology that will connect with the cardano ecosystem.", "q1r": 1, "q2": "Disclosure of the problem in the proposal is not clearly explained, the discussion is briefly discussed with the aim of raising funds by bringing crypto assets as an attraction, it is not described whether it is only replacing currency values with crypto currency, how to connect the dot between films and crypto there is also no solution which is presented. The solution to the main problem, namely funding for non-commercial films, was also not solved properly. there is no roadmap that the proposer will do. they wrote down the distribution channel of the film and their goal to get into this film festival is a good thing but the resolution of the problem still needs to be detailed.", "q2r": 1, "assessor": "z_assessor_3362", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "To solve the problem of finding financing for non-commercial indie films, we propose the use of cryptotokens to tokenize these as assets.", "experience": "Dennis Posadas is the Philippines-based author, playwright and screenwriter. His first play Admiral Montojo was performed to a full house off-off-Broadway in NYC last December 2018. He has also won a few minor screenwriting awards."}