{"id": 420216, "author": "gustapug", "title": "Education impact and monetization", "url": "https://cardano.ideascale.com/a/dtd/420216-48088", "category": 26605, "amount": 21273, "description": "Education NGOs in developing countries have difficulties finding investors and donors, despite their effective actions in promoting quality education and social justice for low-income students.", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 2428, "q0": "We note that this is a proposal that is super aligned with the objectives of the challenge, as it seeks ways to accomplish exactly what is proposed, that is, monetization of impact generated through the use of technologies from the blockchain universe. Furthermore, since the project focuses its efforts on increasing the projection of the actions of non-governmental organizations, we realize that its success will be influential in several projects not only in Brazil (where it will initially be implemented), but also in other countries with realities similar. Thus, the possible positive impact in the medium and long term for this proposal is quite evident. And in fact, it would be possible to observe impacts also in the short term, with the success of its implementation in the NGO initially being considered. For all these factors, we can say that the amount being requested for the execution of the project is quite fair, and as we will see below, it is also being well allocated.", "q0r": 5, "q1": "One of the main points that make us believe in the feasibility of the project is its close relationship with reality. Although the ideas demonstrated by the proposal are quite encouraging, we realized that it would not be interesting if all these concepts remained on a very abstract plane. So it is very positive to see that the implementation of the concepts and parameters built will take place in an existing NGO, which enables the rapid adaptation and chances of success of the project. Regarding the professional team behind all this, we find people with an exceptional academic background. We even see that Gustavo Pugliese has a degree from the University of São Paulo, which is one of the most prestigious in Brazil. But, in addition, this team also demonstrates a good practical experience, and we found performances exactly in this professional field. Throughout the proposal, we find the description of very cohesive actions in the timeline, which start from the elaboration of strategies for monetization of impact, through their implementation and reaching the analysis of results. A clear understanding of the products that will be generated by the project was also demonstrated. Regarding the distribution of the budget, we found very correct allocations that encompass not only the research, but also various stages of the project. But as the focus of the project really is on finding ways to monetize the impact of NGOs, it makes sense that the largest allocation of capital is going towards this (approximately 60% of the total). The several positive characteristics mentioned here make us believe that this project has great chances of success, also because its central idea seems really innovative, and providing reliable means of validating results should attract many new investors, especially in times when there is a propagation of so many fake news.", "q1r": 5, "q2": "Regarding the ways chosen to follow the evolution of the project, we found a very detailed explanation of what should be done, as well as the way it will be done. And in this context, we also note the indication of metrics that facilitate this progress, such as the measurement of new investors and the way they got to know the NGOs, which helps to define whether the tangibility of the impact was a preponderant factor in this. Furthermore, the team's description of success is in perfect harmony with the ideals exposed throughout the project, with a description of success scenarios both in the short, medium and long term.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7870, "q0": "The proposal address the dire need of improving the education NGOs. Here, they fixate on magnetizing the investors. To engender a system integrated with blockchain technologies in which we can apply principles of transparency, traceability, tokenomics and, consequently, to be alluring to investors probing for trustful NGOs to invest in. The proposer given a detailed explanation about the implementation of the project. They given step by step process. The Arca offers integral support to the students. To achieve goals they would investigate and the proposer is also aware of various risks involved ans and also has required action plan to overcome them and solutions to mitigate. They presented some challenges like impact valuation and impact monetization, The lack of financial attractiveness of impact project and many other. The Arca is a French Brazilian NGO which gives great support to students like training, academics, mentoring, accomplishment and engagement. ", "q0r": 5, "q1": "The proposal comes with an elaborate plan that explains the key milestones that the team plans to achieve. The proposer mentions a monthly wise goals that are traceable and they conducted some workshops with other NGOs. They share results and strategy adopted and potentially fix,, without having to start from scratch. The team request for total budget breakdown is $21, 272.00 for personnel, project costs and cost for educational program at the NGO. The 2 team members introduce are very clear heavy weights in their respective fields and come into this project with a prior experience and expertise from their previous year of working. The teams has compact plan and do not intend to return for more fund as they believe to complete the project in its entirely in just one go. ", "q1r": 5, "q2": "The proposal comes up with excellent Metrics to quantify its progress and prosperity. The proposer will report progress to project coordinators and NGO directors in the meeting and conduct workshops, tracking of how they reached the NGO and research conducted with investors and partners of the NGO. The success of the project which has short, mid and long term goal and this is a entirely a new proposal.", "q2r": 5, "assessor": "z_assessor_2929", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9049, "q0": "The goal of this proposal is to monetize the impact of a nonprofit organization or NGO working Sao Paulo Brazil in the favelas working to educate impoverished young adults on how to become employable. This proposal has a high impact rating because it meets the goals of the challenge. Specifically, it creates the monetization value for the impact created by an NGO. In doing so it seeks to create a viable investment that also makes a positive impact on solving poverty issues in Brazil. In addition to helping a single NGO, the goal is to take what they learn and develop a process that they can apply to others as well. The success of this project and this team would create a pattern of self-funding for organizations, specifically nonprofits, that create positive impact.", "q0r": 5, "q1": "Based upon the details presented in this proposal, this has earned a score of 5. The plan could provide just a little bit more detail oh, but it is sufficiently detailed to assess this as highly feasible. The budget is well-defined, and fully covers the scope of work planned.  Additionally, this team has the expertise and skill set to accomplish the goals they have set out to do. They have already identified a specific NGO  and have developed a plan working in concert with them. This proposal therefore is very likely to succeed.", "q1r": 5, "q2": "This team has put a good deal of effort into considering their metrics for success and the goal of their project. It is very clear what they are attempting to accomplish. The metrics they have listed line up well with their goal, their timeline and their budget. They plan to report on their weekly progress, as well as their long-term success. They are aware of their reporting to the Catalyst community, and they are very transparent about their process. This proposal deserves high marks and to be fully funded.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 15115, "q0": "The team intends to partner with an NGO from Brazil in order to create a framework that will enable any NGO to better sustain itself financially. Due to the transparency provided by blockchain technology, donors and investors will gain increased confidence in their investment and as a consequence, the funds will more likely be allocated towards organisations that can provide such a level of trust.\nThe organisation the team has chosen as a first prototype is an NGO called Arca, operating in one of Brazil's favelas and who is providing professional training courses to young students and helping them get on a path to employment and a more stable life. The team envisions financing their course for a group of around 30 students and creating a framework implementable by any NGO that will allow them to monetise their efforts in a continuous way.\nGiven the information provided, I find the proposal to have a high impact on the Cardano ecosystem and as such, I will rate it a 5.", "q0r": 5, "q1": "The implementation plan for the project is formulated over a period of 6 months. In the first month, the team together with the NGO will select the experts who will be drafting the framework, and enrolling the students into the training, then in the second month the assessment plan will be prepared and solutions for monetisation are being drafted. The execution of the educational program will last for the upcoming  2 months and in the last 2, the protocol and tokenomics will be defined and the framework will be presented to other NGOs for possible adoption.\nThis sounds to me like the plan has been well thought out, I see no insufficiencies that might cause disruptions, as such, combined with the well-drafted budget for $21272 divided in detail for each task and with the skilled and dedicated team, I find the proposal to be successfully implemented and in conclusion, I rate this section a 5/5.", "q1r": 5, "q2": "The team will be holding bi-weekly meetings to discuss the results of their metrics: the impact research, the adaptability and quality of the tokenomics model, the number of investors and the revenue generated. Some of the metrics will be available on the NGO’s website, but there is no mention of where the others will be noted. Will their meetings be recorded and published online for the entire community to see? This question would have been important to have answered as it provides an open and transparent reporting to the entire community.\nThe success of the project is well defined, though some clearly defined metrics would have been practical in assessing the successful outcome.\nBut considering the details provided throughout the rest of the proposal text, I find these details to not play such an important role in the auditability of the project and as such, I will rate this section a 5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15214, "q0": "One of the main issues with NGOs around the world is that since most of them are not under legal obligations and public scrutiny like listed corporations, even the reputable ones find it hard to prove themselves in the eyes of donors and investors. By introducing blockchain, NGOs can make their transactions public and open for anyone to check. Other interesting features of blockchain are tokenization of impact and incentivization of participation. As it aims for modeling impact valuation and monetization, this proposal is a perfect match in the challenge. It can produce a replicable model for other NGOs to follow, especially those that offer education programs. The potential impact is immense. As a ‘side product’ a course on youth employability is organized. The mere possibility of keeping young adults out of illegal activities is enough to justify the proposal.", "q0r": 5, "q1": "The main proposer is well known in the Catalyst community and the NGO the proposers represent is well established and backed by a variety of sponsors. The plan has some known unknowns and the risks are clearly analyzed. However, the team can be trusted to implement this well-rounded plan that, through iteration and feedback, will come to take its final shape throughout the six-month execution period. They are also open to get more ideas from the Catalyst and Cardashift communities.", "q1r": 4, "q2": "The team will be measuring and reporting on the progress of the research. Bi-weekly meetings with the external main researcher are arranged. Partnering organizations are invited to discuss and improve the selected impact metrics as well as to evaluate the results. Should they be successful, new investors will come in and this, in itself, serves as a measure of success. Another lagging indicator is the impact-based revenue generated.", "q2r": 4, "assessor": "z_assessor_2156", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15272, "q0": "Leveraging Cardano Blockchain to build new solutions for positive impact valuation and monetization is the critical point of this challenge and seeing that the proposal seeks to measure the monetization impact of education NGOs, I would say that the problem aligns with the challenge. Running NGOs require a lot of fans to be able to execute their activities and an opportunity like this from a proposal of this sort would help NGOs leverage the Cardano Blockchain so that their monetary impact can be measured; it would not just be of benefit to the NGOs but also a big win Cardano ecosystem. The metrics and goals align with the challenge setting.\nWith reference to that which has been stated by the proposal they don't intend to return to later catalyst fund Rounds to secure additional funding because they believe that once they are able to secure funds in this round to execute the project they will be able to monetize their impact that will keep the project running so I believe with this approach the proposal is sustainable\nI am confident that the proposal has a very high future scalability and I believe that if this project is executed it has the potential of engaging many NGOs so that they can monetize their impact and hence be financially to run their activities smoothly.\nI am confident that the proposal makes the required impact.", "q0r": 5, "q1": "Given the relevant experience of the team described and considering the fact that the team have been around in previous catalyst fans like to Fund 7and Fund 8 and with key considerations to the links and references attachments, expertise and qualifications I believe that the team possesses the required skills to execute the project. The proposer has got some high level of knowledge about his team members considering the fact that there is a detailed information about every team member, I would say this is encouraging The budget $21,272 provided is well described and broken down into identifiable and understandable items and considering the nature of the project I believe that the budget is very reasonable and sensible to achieve the set goals; this makes assessing the feasibility of the budget easy and I will say this is a good effort by the proposer.\nThe plan provided is detailed and comprehensive with a clear timeline and deliverables. The plan is well prepared.\nThe proposer has outlined the risks or challenges that may arise during the implementation of the project and has also provided measures to mitigate them when they arise, this is a good effort. \nI am confident that the project is feasible.", "q1r": 5, "q2": "As indicated earlier the roadmap provided is detailed and understandable with clear milestones and time horizon for the achievement of the set goals of the project, this is a good effort.\nThe metrics and KPIs were well chosen and I believe they are good indicators for measuring success, however what is missing is that, the proposer was not able to foresee the specific number of people to be measured or realized for each KPIs at the completion of the project. For this reason I will advise the proposer gives specific numbers to each metrics in future proposals so that they can be better appreciated. \nThere is clarity in the problem described and I am confident that the proposed solution is effective to address the problem. I seem not to find anywhere in the proposal that the proposer indicated a public accessible platform to communicate the project’s progress to the community, I will advise that for the sake of future funds, the proposer can make use of the various catalyst channels on Telegram and Discord and other platforms such as Zoom etc so that the community can track the development of the project.", "q2r": 3, "assessor": "z_assessor_2713", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a framework and a service of impact assessment that allows education NGOs to increase their financial sustainability by monetizing their impact measured and tracked on the Cardano Blockchain.", "experience": "The team has a total of 17 years of experience working with educational programs, with academic and professional expertise in the field of philanthropy, youth, and impact assessment of educational programs.\nF7 + F8 funded proposals, PA, vPA, CT, member of the Catalyst Community."}