{"id": 421532, "author": "misionarquitecturaec", "title": "Rescuing Rural Areas Architecture ", "url": "https://cardano.ideascale.com/a/dtd/421532-48088", "category": 26605, "amount": 7500, "description": "Low Architectural living standards  in the andean plateau of Chimborazo,  Ecuador.", "f6_no_assessments": 6, "f6_rating": 3.055555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 2431, "q0": "We have that this project found a way to combine the resolution of local problems with the use of Cardano technologies, and in this context, we also noticed a tokenization of the impact. With this, it is possible to say that the proposal is correctly aligned with the objectives of the challenge. However, we perceive a very wide scope of action of the project and with that we are in doubt if the budget being requested by the project will be enough. This casts doubt on the possible positive impact caused by the project to Cardano's ecosystem. This idea will be further developed below.", "q0r": 3, "q1": "As mentioned before, we perceive a very broad action plan, which aims to impact several areas with this project. We have that this is a very positive characteristic, however, we are in doubt if it will be possible to carry out all this work with the budget of $7,500 being requested. Still in this context, when we look at the budget detailing section, we have that several activities were mentioned, but we could not find how the total amount requested will be divided between each of them, which would be very important. Regarding the professionals involved in the project, we found people from different areas of knowledge, thus forming a very diverse work ecosystem. But it would also be important that CVs were made available so that their experiences could be better verified.", "q1r": 2, "q2": "Regarding the perception of project success, we observed the description of a very correct scenario in relation to all the ideas that were developed. However, we miss more details regarding the metrics used to monitor the evolution of the project. It would be interesting to establish indicators such as the expected average number of users on the platform or the number of projects that were executed because of the site.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5550, "q0": "The problem described here is in alignment with the building of new solutions of the challenge and also the impact value. Architecture is very important as far as building is concerned especially in rural areas where the people might not have access to architects.  From the proposal, the understanding I have is that, a DeFi is to be created so that people, proposals and crypto incentives can be merged before the architectural. However, it would have helped if that need had also been included in the problem statement so it can be easy to determine all what the proposal is concerned with.\nBuilding a DeFi on the cardano blockchain for users of the ecosystem is already a big win for Cardano. \n\nThe proposer’s indication implies that the proposal can be sustained since, there is the possibility of returning to catalyst to  apply for funds to financially sustain the proposal.\n\nThe metrics indicate a great impact for the cardano DeFi system hence the proposal is impactful.", "q0r": 4, "q1": "Information provided about the team’s relevant experience and considering details provided about their qualifications and expertise, I believe they are capable of executing the project. The proposer knows the other team members because adequate information have been provided about them. \nHow the budget is presented is not the best. It’s good that items are easily identifiable with their various cost and not to be presented in an essay like this; it makes it difficult to understand it. However, the amount requested is is reasonable and sensible to execute the project. There is no definite timeline for the project and I think that is unfortunate. The roadmap is however understandable but not detailed.  \nIt’s good effort that the proposer has foreseen the risks and challenges that may arise during the implementation of the project and has put in measures to mitigate them.\nThe project could however be feasible.", "q1r": 4, "q2": "The roadmap’s milestones and time horizon are not clear to see. It’s rather unfortunate that this is the case. A project or plan without clear milestones becomes difficult to track the project’s development. It’s only indicated in the proposed solution description section that the project is designed to have three (3) stages. The metrics/KPIs are not clear to see but they are however still situated in. I believe the KPIs were wisely chosen as they are good indicators for measuring success.\nThe problem described here in the proposal has some level of clarity and the proposed solution, I believe that it’s effective to address the problem. I have seen an indication by the proposer how project development will be shared with Cardano community members. I will recommend that the proposer makes use of the various catalyst channels on Telegram, Discord and other platforms where community members can easily track the project’s progress.\nThere are some uncertainties though, but the project could still be feasible.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6722, "q0": "We start off with a rather weak value proposition, which is to create a DeFi model to build and rescue andean architectural spaces in Chimborazo, Ecuador. As much as I respect and admire architectural heritages around the world, there could have been a better way to frame the project. Going into the details, we see that what is actually proposed is to create a web3 page that “merges people, proposals and cripto incentives and a DeFi model emerges”. Unfortunately that’s not how things really work, and It is unlikely that by creating a webpage a DeFi will emerge all by itself without it being thoughtfully designed from the beginning. What is especially unlikely is also to have a DeFi system specific for such a unique problem. In general, a DeFi  in which value can be created and transferred, has to bring together a melting pot of features that make the system generally accepted by a wider category or people. There also seems to be a very wide scope for the project, since we read about tokens to raise funds, NFT illustrations, 3d modeling, interior decoration products, a lot of things. \n\nMy honest advice to the proposers is to come back with another iteration and initially go through the exercise of finding out what their core competencies are, defining a project that has a much narrower scope: either focus on NFT creation, or simply a token with architectural functionality, or seek to raise funds through already existing platforms instead of recreating one from zero. But these are just examples. \n\nGiven the overall lack of clarity, I can only offer three stars since it’s a very vague proposal. ", "q0r": 3, "q1": "There is a five person team behind this project, most of them with architectural backgrounds, with some software development and legal competencies on the team. A great addition would have been to have a more elaborate bio for each of the members as well as to provide links to their social media profiles and any track record of past projects similar in scope to this one. Without these ingredients it is rather difficult to say whether the team has what it takes to see the project to completion. \n\nThe detailed plan is very confusing and one can’t really make sense out of it, I will quote a few examples for you to understand. The team plans to “raise funds via the creation of a series of services and products”, “construct a low cost gym dumbbells”, “create a variety of cyclical communities”. So the plan of this project is to raise more funds? Gym dumbbells, how do they fit it? What is a cyclical community, perhaps they were referring to recycling, upcycling, or a circular economy? So many questions\n\nThe budget is confusing as well. The money will help “pay salaries for web developers, designers, planners and workers”, and the additional income from the sale of physical items or NFTs will be used as collateral for their KUNA token. So no actual break-down of costs or any other information. \n\nOnly two stars are appropriate here. The team needs to be better detailed, so needs the timeline as well as the budget. No real good news here I’m afraid.", "q1r": 2, "q2": "More confusion. They have “already started building their first house”, and “run out of resources and they need to seek new strategies to help raise funds”. I won’t continue any further because there are no plans here to ensure a transparent project implementation, and sadly the funding philosophy does not really fit well with Cardano’s ethos. Two stars only for the lengthy but confusing section. ", "q2r": 2, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9066, "q0": "This proposal does a good job of meeting the goals of this challenge. If successful it would have a large impact  toward achieving the goal of doing good. The goal of this proposal  is to help fund the mission arquitectura through the creation of a KUNA token.  This organization is seeking to build homes and public buildings in an impoverished part of Ecuador. They also want to enable local residents in the area to earn a living wage  through selling products directly online. The team has already invested their time and finances, the budget they are seeking is relatively low, and their impact potential is very high. In this challenge there are different levels of impact,  there are Deep Impact projects that have a high impact on few people, and there are wide impact projects that have less than impact on lots of people. This is a deep impact project and I believe we should fund it. It does meet the goals of this challenge to bring about a positive impact through web3 financial services. That is why I'm giving it a five.", "q0r": 5, "q1": "This proposal is feasible due to the experience of the team, the detail in the budget and the plan laid out both in the proposal and in the attachment. Based upon the local economy the budget amount is sufficient. There is more detail provided in the attached PDF than in The Proposal itself.  Also, the YouTube video describing this process in the plan provides sufficient detail. The team could have done a better job translating their proposal into English as understanding everything was a little more challenging than in other proposals. But I was able to get enough of an idea of what they are trying to achieve that I believe this is feasible. They have experience both in architecture and digital design. and web 3 development to be able to make this work.  This is in my mind a high-value proposal in that they are asking for a low budget and planning on accomplishing a large impact. The lack of experience in managing a large project may cause some issues, but I believe they will be able to overcome them. ", "q1r": 4, "q2": "For the most part, this proposal is clear. There are some issues with translating into English that make understanding a little difficult. But  the big picture idea came through clearly. The goal is to develop a token that would enable investment into a very impoverished part of Ecuador so that the team could recruit Architects and Builders to create homes for those without good housing. Based on the team's transparency with the YouTube video The PDF document and their desire to recruit investment, I believe this to be auditable. There could have been more detail on how they planned on reporting their progress to the Catalyst Community. They could have offered metrics to track their progress  that were more clear. But overall there is a clear understanding from this team that they need to be educating the community on their progress and it looks like they have a plan to achieve that. I believe this proposal would have a high impact and should be approved. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9532, "q0": "For lack of quantifiable impacts, functional rationale for operation, and giving minimal assessment of the potential risks, I rank this section a 2. Compared to most other Catalyst proposals, this one is a relatively low-risk cost that could help a lot of people in need. However, I do not find that there is enough information to assure me that voters can be confident in delivery of impacts. Voters are more likely to respond positively to more quantified impacts that tells us how many people will be impacted by the proposal and what levels of exposure are added to the Cardano ecosystem as a result. Further urgency can also be pushed with greater quantification of the problem statement to demonstrate a more serious need for the solution. There is a very brief mention of rewards for token holders, which would address my issue with the risk assessment portion that doesn’t talk about the possibility that consumers may not purchase the token in order to fund the housing treasury. Despite the low-cost/risk, there needs to be more rationale applied to various details in this section. ", "q0r": 2, "q1": "For lack of standard details in every portion of this section, I rank this section a 1. For me, the most important section is the information on the core development team. In this case, we only get brief descriptions of each team member’s educational backgroudn, without cited professional experience timelines and provability with LinkedIn profiles. This information is the lens in which voters will understand the proposals capability to see success, even if the roadmap/budget is above average planning. This section does not provide a roadmap because the project is in the fundraising stage but voters will want to know what the funds are going to (in terms of labor, planning, and other action). Since we don’t have information about actionable steps, this also impacts the quality of the budget because voters would not have the capability to evaluate efficiency in spending for labor compensation and other planned expenses. The budget section here indicates that approve funds would be going to paying salaries for people that will produce revenue generating products but it doesn’t indicate how much would come out of that, to give voters a sense of the ROI. This section could be greatly improved with greater detail, rationale, and organization. ", "q1r": 1, "q2": "For content that is less directly relevant to the purpose of this section, I rank this section a 1. This section reiterates reasons for why this proposal is requesting funds and resource/talent that this team has access to in the status quo. However, the point of this section is supposed to be to demonstrate to voters that there is a clear definition/vision of success. This is an opportunity for the proposer to demonstrate that they are meticulously monitoring various areas of the project to measure performance. Voters are more likely to respond positively to KPIs like how many houses this proposal intends to build, how much sales revenues is generated (from NFTs, merch, and other revenue generating resources). I think this section could benefit a lot from studying some of the top upvoted Catalyst proposals to see how they layout their auditibility sections and emulate their KPI/evaluation formats. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9707, "q0": "The sincerity and humility of the proposer is really captivating. The youtube video was so informative and valuable. This project has heart and the people involved are so committed and focused on helping for its own sake - this is an attitude which may serve us all so well. Clearly there has been thought as to how this integrates with the Cardano ethos and how it could be beneficial to the Cardano ecosystem. The idea of cardano initiating change on the ground level and contributing to the upliftment of poor communities is inspiring. The inclusion of education programmes at schools would also spread awareness about Cardano. This proposal would be impactful in a micro way which could expand. There is integrity here, which should be supported.", "q0r": 5, "q1": "The proposal does not break down the budget into specific expenses but does provide information on how any funding will be spent - really to stimulate progress in the development of a cardano token and to promote sales to generate further income. The focus is on architectural regeneration with Cardano as a backup and means of broad support. This is a secondary role but the link is clear and the benefit for the Cardano ecosystem is present. The timeline is not broken down into weeks or months, perhaps because there is still much groundwork to cover before specific goals can be set. There is still feasibility though. Risks are more like barriers to progress as once the project is up and running the real time issues can be addressed directly and specifically. Ther eis not much information on the coin development or on practical implementation, which will need to happen.", "q1r": 4, "q2": "The timeline for completion of set tasks is not set out. The KPIs are melded into broad measures of success, mostly about building new homes and helping where needed. The development of the token Kuna is also included but no specific information is given on who, how or when the token will become a reality. There is clarity regarding what the funding will be used for and auditability will be possible but the proposal is a bit vague regarding the details of this.", "q2r": 3, "assessor": "z_assessor_3085", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "To create A De-Fi Model to build and rescue vernacular - andean architectural spaces, public space and other facilities in rural areas in Chimborazo, EC.", "experience": "This project is in the most early stages but we have already helped start building one house thanks to the member's community.  Public contests and social interest calls are the method to get access to designers, builders and profiles that cant afford the typical cost of building"}