{"id": 422079, "author": "orgonairwater", "title": "Harvesting AirWater for Agriculture", "url": "https://cardano.ideascale.com/a/dtd/422079-48088", "category": 26605, "amount": 11000, "description": "Is becoming more evident the increase in droughts, as a consequence of global warming, directly affecting the agricultural sector, decreasing productivity and generating economic issues.", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 1084, "q0": "I have been a PA since Fund5, and I must say, I still get excited when I come upon a proposal that gets me enthusiastic about what it’s trying to achieve. And this is one of the few proposals that have managed to do just that.\nI’ve known about the technique the team is looking to implement for a couple of years now. Capturing water out of the air with a mesh system is a method that I not only think can be very effective and cheap to install compared to other solutions, but combining a real-life implementation with the Cardano blockchain can prove to be a phenomenal relationship. First of all, because it has the potential to solve an impending crisis of water shortage and drought, and then, because, through the power of blockchain and Cardano, the system can become decentralised and transparent.\nI see this proposal as a perfect fit for the challenge it has been submitted in, but more than that, a perfect fit for the Cardano Ecosystem as a whole, as it has the potential to create a real-world impact.", "q0r": 5, "q1": "The level of detail in each of the sections of the proposal seems to me to prove that the team is not only very skilled and able to complete this project, shown through their extensive knowledge in the field, but also from the care they have taken to share that knowledge in this proposal, for the entire Cardano Community to see.\nThe detailed plan section is describing a timeline of 4 months, during which the team will be constructing the water supply system, developing the measurement prototypes and evaluating the results of water accumulation. Each month consists of several implementation steps, that are detailed and clear. The budget is also very extensive and provides information for every dollar requested, with clear descriptions of what will be built. The team themselves don’t seem to have requested any budget for their efforts, there is a small amount of $1000 for the operations, monitoring and evaluation of the water supply system, though I am not sure if that is set aside for the team. For endeavours such as this one, I would highly recommend setting aside a small budget for the team, as the time needed to implement this project is valuable and in case something doesn’t go according to plan, at least there will be a small backup amount.\nThe proposers have also provided ample descriptions of all team members and included LinkedIn profile links, thus proving that they are the right people to carry out this project.\nTo conclude, I feel that the project is likely to be successfully implemented.", "q1r": 5, "q2": "The proposers have described a series of reports that will be evaluating the results of water accumulations in relation to a series of formulas that will determine the efficiency of the meshes in regard to the environment. \nWhat I would have liked to see in this answer as well, is a clear description of where these results will be published, like a webpage of the project, a GitHub link etc. as to give the Cardano Community the ability to verify this data independently.\nThe description of the project’s potential success looks to me to be not only accurate but also very promising. The issues the team is looking to solve, will not just benefit a small community, but could positively affect regions and people from all over the globe. If the proposal is successful in irrigating a small area where avocados are grown, it could prove to the rest of the world, that simple solutions can be very effective and that blockchain can have a very positive impact as well.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 5651, "q0": "The proposal excited me by its initiative for the environment, especially water scarcity. It aligns with the challenge and can solve the problem of lack of water due to drought. This proposal would like to showcase other applications of blockchain in designing, constructing and operating the water supply system through a decentralized database platform for monitoring environmental parameters (relative humidity, temperature, lighting, CO2, wind). Besides, it will help people understand other applications of blockchain technology, specifically Cardano community, in the real world in controlling nature - water resources. ", "q0r": 5, "q1": "The team is the sum of necessary skills needed for the project, such as environmental consultant, developer, designer, and project management). About the timeline, the proposer outlined the timeline for the whole project to 2 main phase, each phase has been broken down into short months and list down detailed activities in each month. I feel it's appropriate. About the budget, it's good, however, considering about the situation that the operator is a person who not a part of team member, we should have a training section for them and their salary for maintenance of the systems, it may cost but I don't see the budget that proposer use to cover. Overall, the team shows a long-term grasp of the issue.", "q1r": 4, "q2": "The team shows their knowledge of this field well. It would be greater if the proposer provided specific KPIs that impact the community apart from technical information after implementing phase 1 - Design, Construction and Operation of the Water Supply System and Creating the decentralized database platform for monitoring environmental parameters - what would we collect/achieve? I think the more specific KPIs you input, the more understandable information the community can get. Anyway, this project should be considered to be funded because of its good environmental responsibility.", "q2r": 4, "assessor": "z_assessor_2732", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6070, "q0": "Under the impact of climate change, drought is increasing and directly affects the agricultural industry. Orgon-AirWater will install air-water collectors that integrate blockchain technology to create an alternative water source for farmers. The technology is proven and can be applied to arid and semi-arid areas. This water capture system integrates a Cardano-based database platform to track environmental parameters (relative humidity, temperature, light, CO2, wind) and productivity water per catchment system (water level collected per day). The proposer aims to solve the problem of water scarcity while developing new solutions for measurement, analysis, and traceability based on a decentralized platform. I appreciate the impact this will bring if the proposal is implemented successfully.", "q0r": 5, "q1": "Graphic designer, biologist, developer of several programming languages, and civil engineer focusing on water resources management, water supply & drainage are critical members of the proposal. The team's experience is presented well with the links to their Linkedin profiles. The approaches are described clearly and are easy to understand. The target within the proposed scope is the water supply system's design, construction, and operation. The plan toward this goal in 4 months is well outlined. The budget is allocated correspondingly to the three items, including: Design and construction of the Water Supply System, Development of prototypes for measuring environmental parameters and water level, and Operation, monitoring, and evaluation of the Water Supply System. However, in my opinion, this budget should probably include a risk management category, such as ADA slippage. I strongly believe in the feasibility of this project.", "q1r": 5, "q2": "The author team has a clear vision of what they want to report and a clear path to deliver it. The values and data obtained to measure the efficiency of water collection and calculation will represent the transparency of this proposal. I fully understand these metrics are built on a decentralized basis, and therefore, they cannot be faked. In addition, the cost, maintenance & operation of the system, and design challenges also hindered the progress of this project. However, these challenges should not be difficult for the proposed team. This proposal has a reasonable plan, and the indicators to control it are also very clear.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8947, "q0": "Drought is one of the severe threat faced by farmers around the world ,so to come up with a project where the proposer wants to make use of moisture present in the air, and convert it into water for proper planned irrigation is an excellent idea.\nThe proposer wants to make use of natural resource such as bamboo which doesn't harm nature in any aspect , hence with proper utilization of such water , barren land can be converted into proper useful land for agriculture hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Once the projected is completed, how the flow will be regularly checked and maintained the proposal hasn't explained. Mentioned task is not a easy task to achieve since many failed experiments are seen regarding converting air to water.\nOther than that team contains all the required members already where they have engineer, industrial experts, designers , agriculturalist with proper team allotted and dedicated work plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The proposal has mentioned clearly all the experts that will be working towards project , the proposer has even mentioned about the phases of the project.\nThe proposal has even mentioned about how environment aspects differs from place to place ,The proposal has proper timeline and detailed budget breaking ,it also contains excellent key indicators which is \"Overall Collection Efficiency\" hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11100, "q0": "Today, global warming is increasing drought, directly affecting agricultural production, reducing productivity and generating economic problems. This is the main reason for the increasing poverty in some countries around the world. Your proposal: Orgon-AirWater wants to provide an alternative water source for farmers, through the installation of air-water collectors that integrate blockchain technology. I think this is a very valuable and humane proposal in solving the current situation that is a serious lack of water in daily life as well as production in some continents around the world, contributing to improving water quality. productivity in agricultural production, bringing prosperity to the people and at the same time contributing to the realization of the sustainable development goals that countries are trying to accomplish: End hunger, achieve security food, improve nutrition and promote sustainable agriculture. The proposal has given three possible risks, along with that, you have come up with three groups of solutions that will be applied to reduce that risk, which I find quite appropriate.", "q0r": 5, "q1": "Your proposal is innovative because it has been shown that harvesting water from the air can provide small rural communities in arid and semi-arid regions. Water droplets are agglomerated in mesh panels and flow by gravity into a storage facility. The technology is very simple and can be maintained and managed by the user. I strongly agree with your solutions, which are divided into two phases: phase 1: design, construction and operation of the water supply system; stage 2: deploying Cardano's blockchain technology on the water supply system created from phase 1. In phase 1, when building the water production system, you used materials such as reed, bamboo, raschel net (made from recycled materials). These are easy-to-find, cheap materials that reduce product costs and at the same time have the effect of protecting the environment; The creation of the reservoir shows that you are very interested in protecting and improving the efficiency of using the harvested water and especially without using input energy from the outside. Through the description of the implementation solution that challenges the implementation of Cardano's blockchain technology on the water supply system, you have made a very clear goal: to solve the problem of water scarcity, a issues that are happening globally and concern people, create native tokens that link physical agriculture with sustainable social and environmental impact, manage water use in agriculture, develop develop new solutions for measurement, analysis and/or traceability, to produce more food. I find that if it is proposed to implement Blookchai technology on Cardano, its efficiency will be greatly improved and contribute to a closer connection between water providers and consumers. You have developed an implementation plan, in my opinion you should specify when the implementation will start and end for more specificity. The proposal provided a detailed breakdown of the project's budget, and I found the project's cost to be appropriate. The members involved in the project are very capable and experienced. I think the project will definitely be very successful.", "q1r": 5, "q2": "You have provided the necessary information to measure the progress of the project, in my opinion you should control the progress of the project according to the timeline as in the built plan to make it easier to control. For performance reports with values ​​and data obtained to measure the effectiveness of water collection, you should provide an address where voters can track the progress of the project. The success of the project is described very specifically that the air-water receiver can provide water for agriculture and make plantations (reforestation) become self-sufficient, especially in desert environments. desert. It can also provide water for humans. But I really want to know the cost of this project, if the cost is high, it will be difficult for people in disadvantaged areas to access. This is a completely new but very practical project. I fully support the project so that the human values ​​​​of the project are spread, contributing to improving the lives of people in disadvantaged areas. Good luck with your project.\n\"", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Orgon-AirWater wants to provide an alternative source of water for farmers, through the installation of air water collectors integrating blockchain technology.", "experience": "Denise Campoy Mireles: Agricultural advisor\nRoberto Herce: Project Management, Marketing\nSaul López Saucedo: Engineer with a focus on water resources management\nEmilio Gabriel Ramirez Morales: Industrial designer\nRenato Zamudio Malagón: Programmer founder of BOX-S."}