{"id": 422000, "author": "jrepusseau", "title": "Certification and traceability fund", "url": "https://cardano.ideascale.com/a/dtd/422000-48088", "category": 26605, "amount": 3000, "description": "Agri-food supply chains contribute to 26% greenhouse gasses, use 50% habitable land and 70% of water. Supplychain is responsible for 95% is opaque and often switch supplier destroying effort made.", "f6_no_assessments": 7, "f6_rating": 3.9047619047619047, "videos": [], "media": [], "f6_assessments": [{"id": 985, "q0": "#General Thoughts\nThe motivation and cause are very noble.\nFree ledger access to participate in digital & cryptographically secure SCM for underfunded entities is exactly what Cardano was built for.\nHow the product offered for free is not further specified but would be very interesting and important to know for the Cardano Community.  \n\nI tried to access the Discord but the link on the web page redirected to a Discord server template\n\n# Impact\nAs I understood they are building a free to use and opensource SCM dapp, but this proposal only asks for the marketing budget of 3000USD.\nThat is a legit approach however there's no information on the problem they are facing. Is it low reach, on boarding difficulties, tech know how gaps? \nAlso after reading the proposal or on how 1000 USD for a marketing \"expert\" will help them to reach traction and create a \"systematic funding\" for proof of sustainability.\nHow will this systemaitc funding work? How are costs covered & return generated\nFrom the challenge brief:\n“Impact investments are investments made with the intention to generate positive, measurable social and environmental impact alongside a financial return.” \n\n- impact well defined in a very general way\n- the text has some grammar mistakes that make it difficult to understand correctly\n\n> \"Current blockchain solutions are private, expensive and complex to deploy thus they cannot suit smallholders and medium businesses\" \n\nSome examples would be helpful to support the claim and show an understanding of the SCM ledger landscape\n- How can the platform be free if minting and sending tokens currently costs ADA?\n- Who will pay 3rd party certification assessing climate impact of productions?\n- Who covers costs of metadata changes (ledger interaction) along supplychain?\n- Who validates how that product/raw material has not been tampered with?\n\nIf the above questions could be answered the score would be much higher. I'm sorry for not spotting this proposal during insight sharing!", "q0r": 3, "q1": "Overall too little information was given on what the budget will do.\n\n- how will the 2000 USD be used? Why 50 USD for traceability and 50 for certification? To cover ledger interaction? So 100 farmers can each tokenise about 100 products (when ADA sits at 50c)?\n- Who will educate farmers about secure Cardano wallet usage and handling? What about fiat off-ramp?\n- What's the target of the marketing campaign?\n- Having a Roadmap for the overall trajectory of the project would be helpful to assess feasibility  ", "q1r": 2, "q2": "The KPIs are a very good starting point.\nThere are two proposals by the proposer currently also in progress (F7+F8). They are very closely related and have somewhat similar content (but different budgets). The progress reports have been filled but not all  (f7) or very little amounts (f8) have been paid out. Additionally the GitHub has had no activity for the last 2 months. \nIt would be advantageous to have a space for information on all proposals (current and submitted) together; could be a simple spreadsheet and some explanation in a gitbook maybe.\n   \n- it is not specified how the traction of brands is being measured or tracked (is this a specific task for the marketing expert?)\n- how other metrics will be measured is not specified as well\n- since this is a proposal specifically for a marketing budget, there should be focus on how to measure success of the marketing campaign itself\n> \"Brand are engaged with farmers to fund sustainable production using ADA\"\n-- how does this work? will the brands pay for the ledger transactional costs \n- how will SCM traceability reduce water used? and how can that be measured and linked back to the project?", "q2r": 2, "assessor": "z_assessor_2170", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1083, "q0": "I am familiar with this ongoing project since last Fund, it has caught my attention after reading the Fund 8 proposal “Open Certification and Traceability” and I must say, that the development seems to be going well. I find the issue this project is trying to solve, to have the potential to disrupt an unequal system in the Agri-food supply chain, opening up a path for a transparent and equality-based solution. But that is if successfully adopted. Not just by the farmers themselves, but most importantly by producers, brands and eventually, end-consumers. The developed app is well described, and seems to be very complex but, at the same time, easy to operate by users.\nThe team has identified a number of possible risks facing their project but hasn’t defined some solutions on how to mitigate those risks. I have some ideas that I hope might be helpful. For the issue regarding the lower adoption rate due to the tool being too complicated, my advice is to make use of a tester service that can evaluate your app. I know there are several paid online services offering this, like uTest, maybe it could come in handy if the team cannot find enough people to try the app. Or, maybe they could set up a bounty board payable in ADA directly and tweet about it and have community members try it out and offer feedback. I know the Catalyst Swarm is already doing that, I’m sure they would gladly help.\nHaving said all this, I find the proposal to be well written and with a high potential impact on the Cardano ecosystem.", "q0r": 5, "q1": "The plan is fairly easy to implement, the two main tasks for this proposal are workable in parallel, from September to December. The budget is split into two amounts, one amount of $2000 set aside for the farmers from Africa to obtain their certifications and the remaining budget of $1000 will be used to pay a marketing specialist to help the team. From my experience, the amount set aside for marketing looks too low, and I’m unsure if the team can achieve what they planned to. If not sufficient, I would advise the team to maybe submit a proposal in a future fund with a dedicated budget for marketing, after consulting with a marketing specialist.\nThe team seems to be very capable of implementing the proposal, they seem to have the knowledge, and most of all, they have been working on it and have also been previously funded, so I feel safe to say, that, besides the somewhat too low budget, I don’t see any problems in the implementation of the proposal. ", "q1r": 4, "q2": "I find the metrics used for the proposal progress tracking to be suitable for the entire project. The number of farmers who get certification and funded, the number of assets created etc. are the main focus of the proposal, as such, the team has considered these metrics well.\nThe success definition could have benefitted from some metrics, as well. Even if those metrics would have been on the rather lower side, they would have helped us gauge the expectation of the proposing team when regarding their proposal.\nHowever, I don’t consider the answer posted as having any impact on the rating, especially since the first question was very well answered.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1571, "q0": "Simply a great idea. As someone who has been active in the fair trade for years I know how important proper traceability is. Actually this is just what I waited for as an application for blockchain - where its immutable character fits in perfectly. With that in mind, I am of the conviction that this proposal will have a very positive impact on the cardano ecosystem and the challenge. With the scripts already existing, it should be no problem to scale it.", "q0r": 5, "q1": "Despite the further implementation plan being brief, I see no problem in feasibility here, as the pilot basically is already implemented and can be readily found on Github. The proposer is trustworthy and has already done some good work. The technicals are either explained or demonstrated on-hands by what is already there.", "q1r": 5, "q2": "Auditability is provided by the pretty straightforward approach. The code is readily available, and the Github also enables further auditing. The connection made to the SDGs is credible and appreciated.", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 2543, "q0": "The project presented is an innovative supply chain solution built completely on the Cardano ecosystem that aims to promote transparency and sustainability. For starters, the project is a great value added to the ecosystem due to its wide range of uses in real life. The project aligns perfectly with the challenge's guidelines since it drives value from an established and essential business which is agriculture while also creating a new standard in that space by the mean of certification and traceability using metadata in tokens. Such product can have a huge global impact if implemented properly and will add more to the ecosystem overall do the use of ada and ada based stable coins as main source of funding. Furthermore, scaling here won't be a problem since the only limitation is the team's ability to make the product accessible for as much people as possible which is the main purpose of this proposal.", "q0r": 5, "q1": "According to the links provided and the team's experience with Cardano-related projects and their effort to bring in an MVP already. I feel confident to say that the success likelihood is pretty high. For starters, one member of the team is a Haskell developer and an experienced engineer as portrayed in the Github Repos and previous projects. The only problem I see is that the team might need more labor to work more extensively on the projects, especially when it comes to front-end and UI/UX which is crucial for adoption. The team presents a period of 8 months split into two periods each lasting for 4 months where the team will work on marketing and adoption of the project. The budget is fair and it also specifies where every portion of it will go from NGO working with farmers in Africa to Marketing and so on...\nSome risks are mentioned by the team and discussed briefly on how they might be mitigated. I would have appreciated a more extensive analysis in that part to get more insight into the comprehensive challenges the team will face or might face.", "q1r": 4, "q2": "The team already shared their available repos on the project and is transparent from the start. They also provide a very extensive breakdown of where the money goes which makes the auditing part for the community a whole lot easier. The project's progress can be monitored through their Github commits and the number of adopters. Furthermore, some quantifiable metrics were provided by the team like the number of twin assets that mirror real goods, number of farmers funded, number of certifications, and soon. The roadmap seems to be clearly defined and the budgeting is very targetted. Although the task in front of the team is pretty big, the solution seems to be up to it especially since the competitors are way outside of the budget for most farmers which makes their solution not suitable for mass-market adoption. The dates for specific actions in the project are determined but a release date is yet to be specified. \n", "q2r": 4, "assessor": "z_assessor_2317", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4582, "q0": "Supply chain transparency is an oft-cited use case for blockchain technology. While technology can certainly grease the gears of this process, you still need a tremendous amount of cooperation on the ground, and processes that can certify whether the information being sent to the blockchain is itself accurate. From that perspective, I believe this project can be said to address the terms of the challenge. \n\nThe current Impact statement is a bit meandering and hard to parse. I would suggest pulling the tokenomics-related information (the video is good for a sky-level view, but we need a bit more) into a subheading, the information about the Living Roots platform into another, etc. Consider also adding a diagram illustrating the tokenomics and how it might provide monetary incentive and accountability for the supply chain process. Remember that the focus of this proposal is funding for small farms in Africa and marketing, so don't bury the lead. Also, is the idea to form an NGO or partner with one? ", "q0r": 3, "q1": "Living Roots already exists as an open source platform with, at time of assessment, 10 partners. The team currently consists of a developer/project lead and a UI/UX developer, with funding being applied to a marketer. \n\nThe $3,000 budget may be appropriate for the small scale that Living Roots is currently operating on, but I do have some concerns that it may not be enough for the proposers' ambitions to both reward the African farmers and the marketing/certification process. Again, knowing what sustainability NGO the proposers are hoping to work with would help clarify the appropriateness of the budget. Are there additional sources of funding that the proposers are tapping?", "q1r": 3, "q2": "The listed KPIs account for the various users and stakeholders who would utilize the tool or be part of its ecosystem. Ideally, I'd also like to see a KPI that could give us a sense of the sustainability of this project's tokenomic model. ", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9071, "q0": "The goal of this proposal is to refine and market an existing tool to help farmers in Africa to be able to verify and certify the quality of their produce. The tool exists in a MVP format and is auditable on GitHub. The budget request is fairly small as well. This proposal also meets the challenge goals by having a positive impact and finding ways to monetize it. By implementing a traceable food system for farmers and consumers in Africa, this proposal will increase uses of the blockchain as well as provide Financial incentive for Farmers to be able to charge more for their food. This team plans to Market this solution and to work with Farmers to help train them in using it. This proposal will have an impact, but I do have some questions about the overall plan. This is mostly due to some communication issues and a small lack of detail. Otherwise I give this a 4 if there had been more information it would have easily been a five.", "q0r": 4, "q1": "The main reason for seeking funding for this proposal is to refine, market, and train end users on how to use an existing software tool. The budget is clear in this regard, and is so small relative to other proposals, that there are very few feasibility issues here. The team has the experience and desire to accomplish the goal, the timeline is clear though not very detailed, the budget is also clear though not very detailed. This is one of those proposals that can have a very high potential positive impact even though the plan may not be as clear or detailed as preferred. However, investing in this team for the purpose of accomplishing this goal feels really positive and impactful. Due to the lack of detail I am not giving us a full score 5, but I believe it is feasible and so that is why I'm giving it at 4.", "q1r": 4, "q2": " The metrics for auditability have been listed and look good.  They plan to measure the numbers of farmers funded to utilize this tracking tool, the number of certifications, the traction that it gains with the public,  and the number of items tracked.  The proposal is clear enough to be given a score of 4 and the team has a good sense of what their idea of success is.  This part of the proposal could have been improved if the team had listed specific ways that they were going to measure their progress toward completing this goal and how they plan to make that public. Other than that this is a worthy proposal and should be funded. \n", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9711, "q0": "The proposal addresses a gap in the sustainability and environmental impact of food production by focusing on distribution. The solution is both practical and fully fledged in how it would operate. A challenge would be in getting all the parties involves to adopt the system but, as it is free and not too complicated (ideally), this could be successfully mitigated. This project uses Cardano in an effective way and would be of benefit to the community as it would create a broader market for use of and knowledge about Cardano. It also aligns with the Cardano goal of improving how we engage with the world and how we can limit our destructive tendencies. It also allows for transparency for the shoppers, who can know the entire journey of their food. This allows for individuals to make informed choices. There has been a lot of work onthe app and system already which shows that this is a project which is likely to be completed.", "q0r": 5, "q1": "There is a timeline but little information on specific goals or on how money will be distributed. Mention is made of \"smallholder farmers in Africa\" but in which country and region and how will this link to food distribution? And who is the target market and the purchasers. If in rural areas, will people be shopping online? These are important aspects which are not covered adequately and make it difficult to determine the feasibility of this worthy proposal. There is not a detailed implementable plan with regard to rollout but the app etc has been developed and the infirmation regarding Living Roots is both interesting and informative.", "q1r": 3, "q2": "There are goals stated but there is no specific mention of which brands, farmers or even geographical area will be involved in this project. The potential for auditability is present but, given the information provided, difficult to determine at this stage. The Cardano community can, theoretically, monitor progression but there is no information provided on whether there would be report backs etc. There needs to be greater detail in the proposal but the proposal really has merit.", "q2r": 3, "assessor": "z_assessor_3085", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We need radical supplychain transparency to protect effort made with food producer to mitigate carbon footprint. Open traceability and sustainable certification can be saved as Cardano tokens and fund", "experience": "We are currently two on the project:\n\nJules Repusseau , Haskell developer, founder\nEvonne, UX/ UI developer\n\nWe are looking for a marketing profile"}