{"id": 423166, "author": "d.nart.ampta", "title": "クリエイターをピュアに評価するシステム", "url": "https://cardano.ideascale.com/a/dtd/423166-48088", "category": 26605, "amount": 10000, "description": "Non-creators receive much rewards than that for creaters. Centrralized system prohibit formal evaluation for creators. But the indivisual creater can not prevent the product from dupe or plagiarism. ", "f6_no_assessments": 5, "f6_rating": 2.2, "videos": [], "media": [], "f6_assessments": [{"id": 1587, "q0": "Let me start off with that it was difficult to understand what was the main intention of the proposal but i gave my best, but in case I got something wrong I apologize in advance. As far as I see you're lamenting the unfair conditions in the creative industries towards creators, specifically in the fashion industry. You are definetely making a point there. What you are proposing there, to make a fashion show, some DAOs and some smart contracts lacks coherence and further explanation. How is it determined within your concept hiw the creators are rewarded and how can it be guaranteed that they are rewarded fairly? Since you only have the fashion show in your budget I suppose the rest ist just perspective planning. The fashion show however does not really have something to do with the challenge, as it explicitly refers to on-chain projects. so you don't really define how it will affect the cardano ecosystem. As a positive thing however, you have identified an interesting new usecase for on-chain projects regarding thise reward mechanisms for creatives, so I do encourage you to work on that and refine it with a more concrete implementation plan. ", "q0r": 2, "q1": "I think the proposal still needs some planning. There is a budget for oranizing a low budget fashion show, but there is not really a time-bound implementation plan with detailed milestones. Also, we don't really get to know the proposers other than by a few sentences and a linked instagram account. No further credentials or references. While the implementation plan could be more detailed there is still a slight chance that something will be organized, as the proposers clearly seem to have some experience in the fashion industry.", "q1r": 2, "q2": "The overall problem and solution statement are a bit confusing. There are not really any metrics presented other than that some people are going to form an organisation and generate income, but no way to track or audit anything is presented. There are no KPIs and the proposal dies not really fit into the challenge unfortunately.", "q2r": 1, "assessor": "z_assessor_2257", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2449, "q0": "We realize that the proposal aims to provide a way to more fairly reward creators for their inventions. We were able to tie this idea to a real-world problem, as beginning artists don't have much help to protect their creations. In fact, an optimized system to solve this problem would bring the saving of resources and greater efficiency. But from what was described in the proposal, we realize that a very long way needs to be traveled until this impact is better demonstrated. With this, we have that perhaps the proposal does not fit so well in the objectives established by the challenge, also because the actions for this path to be well accomplished were also not very clear. Therefore, we are currently unable to find a justification for the $10,000 budget being requested.", "q0r": 2, "q1": "As mentioned earlier, for the project's impact to be more plausible, we would need a more detailed action plan. However, according to the ideas presented here, we can only get a sense of where we want to go. We understand that the objective is to establish a fair way of remunerating new artists and that for this, a small-scale experiment will be carried out first. But as from this experiment it is expected to obtain the structure that will model smart contracts in the future, it would be interesting to have a more in-depth explanation of how the merits of each creator are distributed. Regarding the professionals involved in the project, we see that they have relevant experience for the work in question, but it would be interesting if, in addition, their CVs were made available so that the experiences could be investigated. Regarding the budget details, we noticed a plausible distribution of expenses, but it would be interesting if a portion was also destined for marketing, so that the concept was, from now on, better understood by the public. In general, we believe that the foundation of this proposal has potential, but the points mentioned could be better addressed to increase the chances of success of the project.", "q1r": 2, "q2": "In the section on the way used to measure the evolution, we find the description of some facts that the project will carry out, but we lack parameters that facilitate the understanding of how these actions will be carried out. In general, we see that the ideas mentioned here convey more a scenario of where the project will act than the way in which these actions will be measured. It would be nice if some indicators were established as an expected amount of positive feedback received. Thus, it would be easier to assess whether the proposal was successful or not.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2553, "q0": "This project can have a global impact on the Cardano ecosystem and would embark new users that would otherwise not be familiar with the Blockchain. On the other hand, this project would be more similar to the \"DAOs <3 Cardano\" challenge.  Since the project is mainly a DAO at aims on removing friction in the fashion and content creators industry.", "q0r": 2, "q1": "From the links provided by the team, they seem to be experts in their field and pretty able to work on it. But, on the blockchain development side, they don't seem to provide enough evidence to witness their ability to take on such a project. Especially since the room for growth in such an industry would make it a necessity to have innovative solutions. The team provides a clear timeframe that is ambitious but understandable especially since the initial activities of the projects won't be tech-intensive.  The risk is also not discussed thoroughly and lacks details.", "q1r": 3, "q2": "On the auitability side, it is very hard to judge how the community will keep track of the project. Especially since the metrics seem to be dependent on events that the community can't audit. Furthermore, the roadmap is quite confusing especially since the heart of the project which is the DAO is not extensively described. Also, some dates are provided but the DAO dates are not discussed. \nAlso, the milestone of the DAO is discussed but again the details are lacking which makes this project hard to judge on its own merit.", "q2r": 2, "assessor": "z_assessor_2317", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4327, "q0": "In this challenge, proposals address the problem that they are trying to solve with, notably, issuing an impact tokens hence \" Demonstrating and monetizing impact\", but this proposal did not proposed any tokenization system or plan for their solution. Also the reward system this proposal proposing, did not explain or demonstrate any tokenization or monetization plan.", "q0r": 1, "q1": "Proposal give solution to the problem by creating a DAO with rewarding system for creators but their plan is just hosting events and fashion show and distributing reward by themselves. No plan was given for creating DAO with smart contract as reward distribution system. ", "q1r": 1, "q2": "The proposal suggest creating DAO with distributed reward system for creators, but the plan  they are proposing is quit different than the solution so its not possible to track the progress of this proposal to its given solution. Also proposal did not gave clear metric or measurement to track its progress when it was asked to, instead it gave possible outcomes.", "q2r": 1, "assessor": "z_assessor_2550", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12999, "q0": "The proposal is about distributing the rewards to the genuine creators ,\nthe rewards will be distributed through the smart contracts which is the best way . By this we can  filter out the non creators who were rewarding.\nBy considering the proposers current DAO system which can be applied to the developing nations . Where they can scout for the best creators and  establishing the reward distribution system . By this they can find the best creators and help them to build the project in Cardano ecosystem . The proposal clearly adds the value to the Cardano \necosystem ,The proposal is able to scale to addresses future challenge .\nThe key metrices and the goals of the proposal align with the outlined challenge settings.", "q0r": 4, "q1": "The proposer have described detailed plan including a timeline and major milestones for implementing the proposal .By conducting the fashion show where the creators will contribute their work , where proposer will determine the contribution of the creators  and rewarding them accordingly.\nThe Timeline of the proposal is described in perfect way and the timeline looks very realistic to complete the work . The budget of the proposal looks a bit high can be reduced  .The proposer have considered the risks and the challenges for the successful implementation. The plan also describes the resources needed to implement the proposal .The relevant skills and the experience needed to implement the proposal have also described in the description .\n", "q1r": 4, "q2": "The proposer have described that how we can track the progress of the proposal where in this fund9 their will be only  30 people .\nTheir will be 20 people who  will create an organization and 10 people who will generate new rewards want to generate rewards.  Their will be distribution on rewards among the contributing creators .\nThe metrices and Kpi's of the proposal will defining the successes of the proposal ,The proposer have described clear understandable description of the targeted problem and also described the solution to that .", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The DAO for the creators by creators can distribute the reward proportional to formal evaluation based on the contribution. The reward distribution system by smart contract is one of the best way.", "experience": "A group with the same aspirations. The first runway show will be held on June 28th this year. Invited about 100 media and influencers. From here, I will participate in the Hyeres International Festival in December and will make my debut in the Paris Collection next year."}