{"id": 381561, "author": "ranket", "title": "Application contest for students", "url": "https://cardano.ideascale.com/a/dtd/381561-48088", "category": 26238, "amount": 5000, "description": "Há um número bastante pequeno de produtos de aplicação que utilizam ADA ou Cardano Native Asset. A nova aplicação com ADA paga é importante.", "funded": 1, "upvotes": 89446813, "downvotes": 12495711, "votes_result": 76951102, "votes_cast": 315, "f6_no_assessments": 4, "f6_rating": 2.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is a bit difficult to pin down, but if I´d interpret it to make it fit the challenge, than it could be sort of like a workshop, since the contest will have a topic where interested students are incentivized to come up with ideas related to Cardano.", "q0r": 4, "q1": "The proposer does not imply enough about his relevant experience for this project, he or she describes the skillset as \"young passion\" but for me as an ADA holder and community member, I would like to know more about the proposing teams experience in setting up a contest and I would like to know more about the metrics of success for the contest. There is no roadmap that contains any information about actionable steps, so I find it not feasable, that this event would lead to a positive contribution. I would recommend the proposer does include how he would tackle risks, like internal corruption of voting between students and how he or she would be able to get 300 people to vote and how he or she would acquire the contestants. I´m not even saying the idea itself is terrible, but there is no content whatsoever that would provide a rationale on what kind of contest the team is planning and how it is planned.", "q1r": 2, "q2": "The auditability can only be done for the contest and the KPIs seem quite random because the proposer does not indicate his or her connection to participants and voters, so while the KPIs would be auditable, we would not be able to attest to accuracy and to success and content of the contest. It would be easier, if the proposer would provide relevant information about (1) where he would have the contest (2) in what position the team is to have access to students and how they would market the event (discord, twitter, telegram, github) (3) for transparency, it would be great if the proposer would set up a github or discord (4) how will the winning project be introduced to the community?", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 8, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "By providing a contest within the Japanese student community you are addressing a good way to engage the Japanese community into Catalyst. What I find odd is why to hold a contest in the student community for dApps if with a prize pool of 4000 if you have a better option to give them the ability to join project Catalyst and let them be the proposers. The proposal fits within the challenge.", "q0r": 3, "q1": "The solution itself is good and certainly meets the objectives within the challenge because it engages the Japanese community within Catalyst. But we have a problem with the details of the plan, the proposer does not provide evidence of relevant information in regards to the proposal. The proposer states that the members have experience but provides no actual evidence to support this. It would also be helpful if there is information about this team since the proposer is solo presenting the proposal but gives a hint of a team behind him. It would also be interesting to explain how the proposal plans to hold this contest. Since no roadmap is presented and we only get a hint that the contest would be held 6months after the funding, this is not sufficient enough to make a good assessment. The budget is explained and seems reasonable.", "q1r": 2, "q2": "For auditability, we don't get the adequate amount of information needed to give a good audit. The proposer describes he has the experience but provides no evidence on this matter. In addition, the plan is defined but is not outlined in any way. By providing a timeline we would get inside on how this proposal would come to fruition. Give a detailed plan on what steps are still needed and what you've done already to make sure this proposal will be successful if funded. The KPIs are applicable to the proposal and give a bit more insight into what the proposer has in mind. Unfortunately, this does not provide me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposition is fascinating, and at the same time a bit confusing. The proposal is to create an application contest for students from Japanese schools. What should the proposer clarify in the title sentence?\r\nBy reflecting more on the solution in the context of the challenge, this project can get a much higher rating.", "q0r": 3, "q1": "First, this proposal is confusing! After reading many times, I still wonder what is the exact result of this hint? Regarding the challenge setting, it is not well defined. It's a good idea but I feel the proposal needs further development to ensure successful implementation\r\nThere are no details regarding the author team. No proposer's name, don't know who participating members are. The Proposal does not adequately represent the knowledge of this development, the expertise of the team, or any information regarding the skills required to do so.", "q1r": 2, "q2": "Key indicators to track project progress are also provided.\r\nSuggested asking for $5000, would be great if the costs involved were made clearer.\r\nBased on the information given, I disagree that this proposal provides us with sufficient information to review its progress. The proposal does not include information about routes, waypoints, or horizon times to achieve the desired result", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The problem is listed but not clearly. The statement is likely what the composer wants to do, not really a trouble.\r\nThe solution is not clear enough. On which way the contest will be operated is not mentioned. How the contest is going to be marketting to more students/ competitors is not strongly convinced, expecting on word-on-mouth is not enough and it is upon to many conditions.", "q0r": 3, "q1": "Team profile is provided and described shortly. The team have skills that suitable for the project implementation.\r\nThe project do not have any demo yet; only the budget.\r\nThe composer should provide the risk – opportunity in parallel so that the project can be seen as a pratical project. Some  references should be included either.", "q1r": 3, "q2": "The idea may be a good intent of the composer for the young/ Japanese students. However, the project need to be more specifily describe to enhance the success rate of the proposal. \r\nThe composer should provide a clearer road map.", "q2r": 3, "assessor": "z_assessor_840", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Às vezes, os produtos de estudantes do círculo universitário são de alta qualidade e interessantes. Acho que o fundo catalisador deveria promover a ADA para eles.", "experience": "Os membros têm experiência para apoiar a proposta do fundo Catalyst. A única coisa necessária para os estudantes japoneses é a paixão jovem!"}