{"id": 381574, "author": "ranket", "title": "PAB promotion in Japan", "url": "https://cardano.ideascale.com/a/dtd/381574-48088", "category": 26238, "amount": 5000, "description": "Plutus, a linguagem fundamental do programa, não é tão popular especialmente no Japão. É apenas um método pequeno para aprender o Plutus e difícil de desenvolver.", "funded": 2, "upvotes": 136531383, "downvotes": 8682773, "votes_result": 127848610, "votes_cast": 335, "f6_no_assessments": 5, "f6_rating": 3.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal does fit the challenge in that is aims to translate relevant documentation for possibly interested DEVS that would be interested to program in Plutus. ", "q0r": 5, "q1": "While this is relevant and helpful, the proposal fails to deliver actionable steps or a breakdown of the budget. From the milestones it seems, that the team would want to translate an overview on how to use PAB and with the help of the community, form a team to then set up a follow up proposal to translate more of the plutus manual. I find it problematic, that the proposer does not give any information about their relevant skillset. It is also not clear, who will be working on this project (the proposer seems to be an individual, the proposal itself uses \"we\"). So I´m at this point not able to assess if it would be likely that the proposer can deliver what they proposed. ", "q1r": 3, "q2": "The proposal is auditable in that we should expect a japanese translation of the PAB in 3 months after funding. It would be easier to assess the amount of work in relation to the budget, if the proposer would have provided some overview on how many pages or how many hours of translation this funding would attribute to. If there is a website (which was not provided in the proposal) the community would be able to audit the process of this proposal.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 5, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "Interpreting into Japanese a guide book (or Website) for Plutus Application Background in Japanese as your problem solution states is in line with this challenge. ", "q0r": 5, "q1": "There is no reference to your abilities to translate the website or explanation of the plutus application background information. However I did run your Japanese proposal information thru a translator and it appears to good, but I'm no translator.  I would hope as you propose for future funds you would say a bit about the team and it's capabilities. The Time line and Budget seem modest however.", "q1r": 4, "q2": "3 Month KPI to translate the PAB information is auditable. Gathering information and a forming a team to move forward is a little more vague. What information are you gathering, what skill sets and how many are needed on the team?", "q2r": 4, "assessor": "z_assessor_320", "no_vca": 28, "ne": 2, "ng": 16, "nfo": 10, "vca_o": 1}, {"q0": "The proposal is about providing an overview of how to use the Plutus Application Backend(PAB) in Japanese. The proposer also speaks about the next steps that can be taken by providing a manual for PAB. This would've been a much better proposal if you skipped the step which the proposal is about now and go straight for a Japanese manual about PAB. the proposal fits within the challenge but could've been better if the focus was elsewhere.", "q0r": 3, "q1": "We get a roadmap that seems very reasonable. To my understanding, the proposer plans to publish a basic guide to what PAB holds in the first 3 months, which seems a rather long time to make a guide. The proposer also talks about publishing these on the homepage but there is no link to a website given nor is there any indication that the proposer plans to make a website within this proposal. the funding requested gives no feedback on where this would be used for. By providing a budget breakdown would give an understanding of where the funding would go.", "q1r": 3, "q2": "The timeline presented gives little information on how the proposer is planning on making this proposal a success. The outlines are present but no details are in the proposal. Will the proposal do the work himself at first or does he need help translating and understanding PAB? The proposal gives the feeling the that proposer does not clearly understand what a good solution is to the problem within the challenge. ", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 20, "ne": 3, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "This proposal seeks to in essence translate and formulate their own understanding of the PAB so it fits the Japanese narrative. Education and adoption of Cardano, is key. Having a PAB reformulated to fit Japan, as the Challenge setting stated is crucial. Not only are Japan early adopters of Cardano, they are consistent supporters of Cardano. Which was recently proven by Cardano being listed in a prominent exchange in Japan called BitPoint. Where Japan is renown for the rigorous regulatory vetting process. These continued support signals, most important regulatory ones, also indicate an easier path for not just mass adoption but a holistic acceptance of the technologies that Cardano can bring. With that said, this proposal effectively addresses at the minimum 2 (two) problems in this Challenge setting.", "q0r": 5, "q1": "As much as impactful this proposal is, proposer does not provide at the very least a detailed description of their experience, let alone a link to further understand the proposer's skill set. There is only a vague description in their relevant experience section. Budget requested in comparison to deliverables are reasonable. Timeline provided to a certain extent makes sense, though it might seem to be a bit drawn out. Perhaps it could be more concise for the amount of work the proposer is trying to do. The implementation plan though is clear and does take you on a journey on their though process. This seems to be associated to the Japanese community, which to be honest is very refreshing. Unfortunately though, the proposer has not considered the risk and challenge they might face during the duration asked. Will $5000 suffice? This question can not be answered for there is no breaking down of it. One can only guesstimate. Not ideal.", "q1r": 3, "q2": "Roadmap and milestones are clear enough, they also have an adjoining action plan. Though the KPI can be understandable if there are no numerical target(s) but for the sake of auditing, all elements should have an effort to be measurable. The problem statement and solution were created as a union and is fleshed out clearly, from a content perspective. On the technical aspect of submitting a killer proposal, this proposal falls short. The proposer should not feel discouraged if it does not go through this funding. Please do contact Yuta-sama (a Cardano Ambassador and Eastern Town Hall member from Japan) on how to formulate a proper proposal. Most confident Yuta-sama has translated various materials from Catalyst School that will help educate on method of making a proper proposal.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 21, "ne": 9, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "There is clarity in the problem, the solution, and the suitability of both to this challenge. In Japan, Plutus is not very popular, the proposal wants to develop this basic program language. By providing a user manual (or website) for the Plutus application platform in Japanese. This will be of interest to Japanese engineers.\r\nOverall, it's a compelling idea, but due to a lack of information, it's impossible to say whether the proposal would make an effective contribution to the Challenge.", "q0r": 3, "q1": "It is very hard to trust this proposal. This proposal is a good idea, however, to evaluate the level of success of the suggestion I scored 2 because 1st: Proposal does not specify the team's experience, all I know is just The name of the proposed person. Monday: There is no clear route to see the development step of the proposal. Third: Do not measure the risk as well as the general KPI data. I recommend clarifying the above issues to the challenge. Good luck\r\nThere are no details regarding the authors' team. Team is one of the factors to evaluate the feasibility of the proposal. Here the proposal only stated a very sketchy experience, without any links to authenticate their experience or capacity.\r\nThe proposal did not provide sufficient information to help audit its progress. ", "q1r": 2, "q2": "Furthermore, there is no detailed budget breakdown of how the funds will be spent. The proposed budget of $5000, but no explanation on how to use the budget\r\nIndicators for determining the success of a proposal have no relevant value and cannot be quantified. Looking at the proposal, I can't see any roadmaps, KPIs, or auditable goals. I want the team to connect KPI milestones and KPI roadmap milestones with a budget, this way you can track performance and spending on a timeline", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 6, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Forneceremos o livro guia (ou Website) para o Background de Aplicação Plutus em japonês. Este livro será de interesse dos Engenheiros Japoneses.", "experience": "Os membros têm promovido fortemente a conexão entre o projeto catalisador e a comunidade japonesa através do Meet up. Seminários e Palestras."}