{"id": 383409, "author": "felixweber", "title": "Eastern Town Hall & Japan", "url": "https://cardano.ideascale.com/a/dtd/383409-48088", "category": 26238, "amount": 3000, "description": "A comunidade japonesa precisa de uma experiência rápida e segura a bordo do Projeto Catalyst.", "funded": 2, "upvotes": 157151542, "downvotes": 5230633, "votes_result": 151920909, "votes_cast": 431, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal refers to an active and ongoing format of meetings that is held with regards to the Eastern hemisphere. It is a great addition to the swarm and townhall meetings and it bridges effectively between existing communities, helping to onboard new members of the Eastern hemisphere as well as connecting people, but without creating an isolated space or exclusion. It very much addresses the key metrics of the challenge in that it provides a community as well as onboarding, education, language related support and translation systems and it connects well between the existing groups of our community.", "q0r": 5, "q1": "This proposal asks for funds to continue the work and time the team dedicates to Eastern Town Hall, so it is very highly likely that with funding, this format will be going on and effectively supporting and developing the community, while bridging between different languages and time zones. Roadmap is clear and the team is actively planning to increase participants. This is a community driven team with lots of experience in Catalyst.", "q1r": 5, "q2": "Auditability is given through scheduled events, discord, recorded meetings as well as github. The proposed funding is very humble.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 26, "ne": 3, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "Onboarding new Users in Japan to the Cardano ecosystem with a Japanese Tailor-made structure will strengthen the ecosystem. This proposal  effectively fits into the challenge brief. Using the same method that has been proven to be effective  - a Bi-weekly  virtual town hall meetings with breakrooms  will create the necessary platform for new users in Japan to be part of the Cardano ecosystem.", "q0r": 4, "q1": "Budget breakdown and resource allocation are also well defined and fair.\r\nThe information about the qualification of the team is defined though no profile link is included to assess their claims. , Given that there is known  information about prior work of eastern town hall  implementation of the proposal is at the moment very likely.\r\n", "q1r": 5, "q2": "There's enough information here to make this project auditable , The road map ,KPI and others information are clearly defined", "q2r": 4, "assessor": "z_assessor_430", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses a problem within the challenge. By providing Eastern Town Hall with breakout rooms for the Japanese community they are given the tools necessary for Japanese people to get involved in the Cardano ecosystem. By providing biweekly support to the community this proposal is able to scale well for future challenges and can be adjusted where needed.", "q0r": 5, "q1": "Since the proposers are very well known within the Cardano community as well in Project Catalyst, I see no problem that this proposal will be successful. From funded proposers to Ambassadors, the proposers have everything necessary to achieve their goals. The plan is well defined and gives all details needed for a good assessment. The only thing I'm worried about is the number of proposers that are native Japanese or speak japanese. So far I can only see one of them being capable of speaking japanese. ", "q1r": 4, "q2": "In the roadmap, the KPI's are clearly defined and the proposers which to have a 20% increase each month in the number of participants. This is a high number to achieve month after month. I feel like there is not enough information given to support these KPI's. How do you plan on engaging 20% more each month to accomplish these goals? Since all breakout rooms are recorded we as the community have the privilege to see these any time we want which makes auditability a breeze. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 22, "ne": 4, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "The Japanese community needs experience to quickly and safely participate in the Catalyst project. The solution was the East City Hall creating a focus on the Japanese Community. I fully trust this solution will solve the problem perfectly. Problem and solution statements are reasonable and within the scope of the challenge.", "q0r": 4, "q1": "The proposal talks a lot about the feasibility, successfully organizing the events of the East City Hall from Fund 5, but there is no leading link, so the feasibility of the project cannot be assessed. The article lists and divides specific jobs to join a team of experienced and famous people in the Catalyst community, but with a sketchy description, without a link, it will be difficult to judge. the proposed price is successful or not. To further increase the probability of success of the proposal, I would like to see a list of potential future risks and challenges.", "q1r": 2, "q2": "There are timelines, but it's tied to data that measures success metrics, not lists of what the team will do. The requested budget is reasonable. This proposal requires a small grant, $3,000 for 3 months, it would be better if you could explain in detail how to use this grant. That will increase testability. There is a final product but no kpis or intermediate milestones in the development of the project. For the above reasons, I cannot agree or disagree with the feasibility of the project", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal seeks to create an Eastern Town Hall which will be the center for safe onboarding experience for Japanese newbies into Project Catalyst. The Eastern Town Hall wants to increase their outreach and include additional countries in their events. The proposal effectively addresses the challenge.", "q0r": 4, "q1": "The team is made up of funded Proposers, Community Advisors, veteran Community Advisors, SPOs, Proposal Mentors and Ambassadors who are capable of implementing the proposal effectively. The plan mentions holding bi-weekly Eastern Town Halls; offer language-based breakout rooms in English, Indonesian, Japanese and Vietnamese; offer workshops and sessions to introduce people into Project Catalyst. All these facts make them capable of successfully implementing the proposal.", "q1r": 4, "q2": "The proposal mentions that all actions and activities are tracked and documented on the Eastern Town Hall github. The road map is stated clearly from February 2022 to April 2022 with details in the proposal. The budget breakdown is comprehensive and all these facts will make successful auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}], "solution": "A Prefeitura do Leste cria um centro de gravidade para a comunidade japonesa. Fornecemos uma estrutura de bordo rápida e segura \"feita sob medida\".", "experience": "A equipe da Prefeitura do Leste é formada por proponentes financiados, conselheiros comunitários, conselheiros comunitários veteranos, SPOs, mentores de propostas e embaixadores."}