{"id": 381288, "author": "hotspringfinder", "title": "Flutter SDK", "url": "https://cardano.ideascale.com/a/dtd/381288-48088", "category": 26251, "amount": 15000, "description": "Flutter é a comunidade de desenvolvedores de aplicativos móveis de crescimento mais rápido, mas atualmente não há suporte da biblioteca Flutter no ecossistema Cardano.", "funded": 2, "upvotes": 73346287, "downvotes": 5667624, "votes_result": 67678663, "votes_cast": 257, "f6_no_assessments": 4, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Como o nome sugere, os proponentes querem construir ferramentas para permitir aplicações fáceis de cardano integradas tanto para dispositivos andróides como ios. O impacto seria grande, pois há necessidade de mais Dapps móveis ou não. O crescimento do cardano depende de tais projetos para convidar mais insentivos econômicos no ecossistema. Se você for uma pessoa não-técnica: Os SDKs (software development kit) são necessários para que os desenvolvedores escrevam aplicações. A proposta sabe absolutamente qual é o problema que está resolvendo e os desafios que virão ao longo do caminho para resolvê-lo. Este projeto trará valor ao ecossistema cardano e a proposta diz claramente como ele vai fazer isso. Infelizmente, não há métricas chave para falar em alinhamento com os desafios. Tendo em mente como seria a equipe, não tenho nenhuma dúvida de que o propsal será capaz de escalar no futuro.  Em comparação com outras propostas, eu diria que esta é um pouco carente em permitir que os apoiadores sigam adiante.", "q0r": 5, "q1": "O proponente provou seu fluxo de trabalho em rodadas anteriores de financiamento e tem um projeto de trabalho e entrega para falar. Isso é uma grande garantia de que o trabalho contínuo, a entrega e a qualidade estarão à altura dos padrões da comunidade cardano. Uma pequena sugestão que tenho é listar de forma resumida algumas das credenciais das pessoas que irão trabalhar no projeto, já que listar o resumo geral da experiência é ótimo, mas não traz mais credibilidade à proposta já que não há nenhuma prova da declaração. Eu pessoalmente acompanharei o progresso deste projeto. Os links dos membros da equipe são um ativo valioso para dar credibilidade a qualquer proposta. O orçamento é delineado, embora não esteja dividido, é implicitamente entendido para onde o dinheiro irá quando se olha a tabela horária. Como um dev, acredito que este é um cronograma realista para realizar o trabalho descrito. A proposta faz um trabalho muito bom descrevendo não apenas o porquê de toda a implementação, o que é importante de uma perspectiva técnica. Todos os recursos necessários para levar o projeto a bom termo e bem descrito e compreendido. Existe quase uma explicação técnica demais para pessoas não-técnicas. Desafios e riscos podem não ser contabilizados, mas tendo em mente a experiência do proponente, eu diria que isso não é uma questão.   ", "q1r": 4, "q2": "Há um repositório de código aberto onde qualquer pessoa pode acompanhar o progresso da proposta, o que é ótimo no que diz respeito à auditabilidade, uma vez que qualquer membro da comunidade pode verificar facilmente o trabalho que está sendo feito. Eu recomendaria um plano de monitoramento mais minucioso em mente. Mais poderia ser solicitado das propostas KPIs como: taxa de addoção, downloads do SDK e outros. Há um roteiro mais ou menos claro a seguir, mas em nenhum lugar para segui-lo, exceto para o github, que pode ser bom o suficiente (o tempo o dirá). Há um problema claro a ser resolvido e os meios para resolvê-lo.  Para propostas futuras, eu recomendaria uma descrição mais não técnica e, para qualquer pessoa interessada, você pode deixar um link para um whitepaper ou algum tipo de documento técnico de projeto.  ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " This software is providing a core SDK for Cardano and will benefit developers from the Google Flutter project environment. These SDKs will save substantial efforts in the future and will provide a rapid onboarding experience. This is the right project for this challenge. ", "q0r": 5, "q1": "The proposer has already developed a functional and usable Flutter SDK that can be used for creating mobile and desktop wallets. The features that are proposed in this fund are imported and with the competence of the proposer and based on his work so far it is very likely that he will be able to complete the work.", "q1r": 5, "q2": "The proposal has a clear list of deliverables and each one of them is important. The code is hosted in open and can be reviewed. The success of the proposal and its impact depends on the adaptation of the SDK. This is an unknown area and can only be measured after the development and proliferation of the Cardano Smart Contract environment. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal looks to complete an open source Flutter SDK project that the community can use to interact with the Cardano blockchain in a mobile environment. To reach mass adoption the community will need to have SDKs in multiple languages and environments so that DApp builds are able to create solutions using the Cardano blockchain. Providing this proposal can be executed well it could have a large impact on opening the door to developers who prefer working with Flutter as a development environment. To give a better impact score it would have been great to see some people already using the SDK or some evidence of the demand for it so that to an advisor it is crystal clear that this proposal will start producing more impact within the ecosystem.", "q0r": 4, "q1": "The proposer adds in their background in the relevant experience section but does not attach a source such as a LinkedIn profile. A video is provided of the SDK and also a link to the open source repository. Both the repository and the video help to provide sufficient evidence that the proposer has the expertise to complete this proposal as has already been demonstrated in the code produced. The tasks and hours are broken down by feature into very reasonable time frames along with a very reasonable budget for completing those tasks. The following tasks for the proposal appear to be more complex by nature to provide all the functionality required however based on the information and evidence provided it appears likely this proposal can be executed as intended.", "q1r": 5, "q2": "The proposer adds a detailed feature roadmap with the hours required and the repository and video also give good clarity on what the proposal is intending to do. No success objectives or KPIs are provided. It would have been great to see some KPIs or evidence of types of projects that are interested in using this SDK as some extra information. The project is already open source so the existing and ongoing implementation can easily be audited.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Open source SDK's are critical to making Cardano development a fully decentralized process with low barriers to entry. This proposal is an extension to the fund 5 backed proposal to build and maintain a Flutter SDK for Cardano wallet.", "q0r": 5, "q1": "The proposer covers their progress made since fund5 in the initial section of the proposal and expands on their plan to develop a production ready Flutter SDK with full Cardano wallet functionality (contracts, staking, native assets). ", "q1r": 5, "q2": "The info provided in the fund 7 goals, SDK demo and pub dev link are sufficient to audit the progress and successful outcomes for this proposal. ", "q2r": 5, "assessor": "z_assessor_804", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Terminar o código aberto Flutter SDK do Fundo 5 para entregar um Cardano pronto para produção na rampa para os desenvolvedores de móveis, web e desktop Flutter.", "experience": "Fundo 5 Financiamento e entrega de projetos\n4 anos Flutter/Dart\n10 anos iOS/Andróide\n25 anos Java do lado do servidor\n6 anos de ferramentas/ geração de códigos"}