{"id": 384854, "author": "reshm", "title": "NFT Based Authentication", "url": "https://cardano.ideascale.com/a/dtd/384854-48088", "category": 26251, "amount": 12500, "description": "O potencial das NFTs para atuar como meio de autenticação semelhante ao OAuth 2.0 Framework ainda não está sendo utilizado.", "funded": 2, "upvotes": 105365590, "downvotes": 7749918, "votes_result": 97615672, "votes_cast": 457, "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta quer usar as propriedades das NFTs para permitir um protocolo padrão da indústria para autorização na cadeia de bloqueio. Um problema importante (segurança) é identificado pelos proponentes e eles planejam resolvê-lo usando os tijolos colocados no ecossistema. Como desenvolvedor, eu adoro isto. Está claramente afirmado como isto beneficiará o ecossistema cardano e seus usuários em particular. Há métricas claras (um dos poucos projetos que as tem) e em sincronia com os cenários de desafio. A proposta será capaz de escalar com desafios futuros, com base em sua ampla experiência.  Há uma necessidade de segurança agora mais do que nunca, e o fato de os autores terem pensado em uma maneira de implementar algo que já foi testado em batalha OAuth.2.0 fala apenas do seu nível de habilidade e imaginação. Não tenho nenhuma preocupação com a proposta, recomendo que votem a favor dela com todos os votos que vocês têm.", "q0r": 5, "q1": "Consegui verificar todas as credenciais listadas nos links e em alguns outros lugares, portanto os proponentes são legítimos e têm o know-how disponível para levar o projeto ao seu sucesso. Há membros da equipe que colaboraram juntos e já foram financiados pela rodada anterior. O orçamento é simples e dividido de forma razoável. Há um plano verificável, fácil de entender e seguir como parte interessada. Um cronograma realista para todas as tarefas que precisam ser feitas e trabalhadas, juntamente com uma explicação para cada uma delas, faz uma boa proposta. O plano para a implementação não é muito técnico para que qualquer pessoa possa entendê-lo, mas não é muito simples para mostrar o seu valor. Os recursos que seriam necessários para a implementação são, em sua maioria, especificações e estão listados na proposta. Os aspectos técnicos estão bem definidos uma vez que os proponentes vão implementar um padrão já existente para autenticação mais ou menos. Haverá desafios, mas os proponentes os mencionaram na proposta e já os pensaram bem. O projeto está em sincronia com o que já foi feito e está pronto para ser construído em cima dele. Eu amo a proposta, boa sorte para vocês e nos vemos na votação!", "q1r": 5, "q2": "Os autores acomodarão qualquer pessoa interessada em seu projeto com um canal de discórdia e com um repositório github de código aberto. Isso permitirá a qualquer membro da comunidade interessada acompanhar o progresso do projeto em sua fase de construção. As métricas e KPIs não estão apenas presentes, mas relevantes, o que infelizmente é mais do que eu posso dizer de muitas outras propostas. O roteiro e os marcos são bastante simples. O cronograma também é definitivo o suficiente. O problema e a solução estão claramente definidos.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the need for open source repo to demonstrate how NFTs can be used as authentication. This will ad value to the Cardano ecosystem by bringing lots of new transactions and use cases to the blockchain. The metrics of this project is aligned with the challenge in the sense of projects making use of the  repository. This project is able to scale well as it is open source and available for all to use.", "q0r": 5, "q1": "The relevant skills and team is provided with links and backgrounds. They are well known and active members in the community. The budget is reasonable and broken down into identifiable items. It will take 3 month to complete the repo, which is achievable. They explain in detail the process of using the NFT as authentication from start to finish. They provided a diagram to visualize the process. Some technical details are also provided, and this idea has already been proven to work and won a Capstones Challenge award. The only risk they touch on is the changes Plutus will still go through and they mitigate this by keeping the repository up to date.", "q1r": 5, "q2": "They provided a roadmap with milestones and KPIs making it easy to measure the progress and performance of this project. They identify the problem of an open source repo needed to bootstrap NFT authentication methods. They solve this by creating the repo and community to contribute to this repo and maintaining the repo as Plutus evolves.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 25, "ne": 2, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "very interesting idea and proposal. Being myself a developer and used IdentityServer based openid connect and oauth2.0 authentications/authorisations, i can vouch for this idea 100%.\r\n\r\nThe idea fits in perfectly and might be ground breaking use case for NFTs. Almost everywhere we see right now google/FB etc based oauth mechanisms in place. These companies just provide their implementation of these standards and perhaps control also all the data in many ways.\r\n\r\nAn open source solution like this could open up a new paradigm to web3 or even at web2 and people can finally start seeing diverse use case for NFTs.\r\n\r\nFull points from my side.", "q0r": 5, "q1": "From experience perspective i fully trust the team, the team has really good experience with Cardano eco system and also have contributed to developer eco system quite extensively.\r\n\r\nThe team details are public and as can be seen have good professional work experience in software engineering. Moreover,\r\nThe team members already has good knowledge on plutus programming (3rd position in cardano hackathon) and are not alien to it.\r\n\r\nThe plan presented has been split well, understandably two. months for Repo/documentation and Plutus SC and PAB implementation, as they will do the most heavy lifting for this implementation.\r\n\r\nAlso the budget outlined is well explained. Developers count and fund requested per developer is well under budget.\r\n\r\nOverall all the criterion are met, hence full stars from my side.\r\n", "q1r": 5, "q2": "I strongly agree that the information provided is sufficient to audit the progress and the success of the proposal.\r\n\r\nThe deliverables are quite clear and since this is a pure implementation oriented proposal, and as a senior developer myself i totally agree that the roadmap is perfectly well outlined. \r\n\r\nThe success metrics are provided for 3-6-12 months and KPIs are well written, so for auditing the success community can always keep the long term vision in mind.\r\n\r\nTherefore, in my opinion community should not have any issue in auditing the progress and success of this proposal.\r\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1, "reply": "Accesss to cloud credits is a common benefit of accelerators and incubators, yet none of the other proposals have this as a talking point. Therefore I disagree with the assessor who states that this proposal does not fit into the challenge."}, {"q0": "This proposal outs forth the idea of creating open sourced software that would help developers in all areas. It is aiming to create a foundational tool for developers.", "q0r": 5, "q1": "The plan could have more detail as well as more of a budget breakdown, but from the info provided it seems they have all the relevant experience to follow through with this proposal.", "q1r": 4, "q2": "Thiis proposal would be improved if it was able to provide more details with the roadmap, milestones, KPIs, and budget. It does provide the required info, but the audit would be limited in scope with the little information provided. More details would give themselves wiggle room when determining the success as well.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "This project is about to make a lookalike OAuth 2.0 authentication in the blockchain network. For future development, this is one of the must-have functions and it will make a strong impact on every network. \r\nThe proposers also provide KPIs that are aligned with this challenge and can help everyone measure the success clearly. ", "q0r": 5, "q1": "The team info is shown in the proposal is outstanding talents that I believe they can make this project work well. This is not a too complex project, and the proposer also provides things that the project will deliver in detail. It's appreciated that all of the content is easy to get. \r\nAbout the budget, the proposer's required budget is sufficient and so much optimized for all tasks. ", "q1r": 5, "q2": "The proposer provides a very detailed roadmap and their KPIs completely help to audit the development progress easily. \r\nThe proposer also helps us acknowledge the problem standing and make a real case about how their solution act. \r\nThe last thing I want the proposer to consider is the risk and obstacles in the development plan, for this type of project, most are about the timing and bug... Detecting those can help them avoid disruption. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "Desenvolver e manter um repositório de código aberto demonstrando como os NFTs podem ser usados para alcançar a autenticação do tipo OAuth 2.0.", "experience": "Engenheiros de Software Sr., Plutus Pioneers, veteranos da Gimbalabs PPBL, CardStarter Hackathon e Plutus Pioneers Capstone Challenge Winners."}