{"id": 383404, "author": "felixweber", "title": "Eastern Town Hall Language Support", "url": "https://cardano.ideascale.com/a/dtd/383404-48088", "category": 26252, "amount": 15000, "description": "東アジアのカルダノコミュニティは、Project Catalystに関する質の高い情報やコンテンツを自国語で必要としています。", "funded": 2, "upvotes": 116913654, "downvotes": 1364103, "votes_result": 115549551, "votes_cast": 443, "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer identifies the problem of the need for information about Project Catalyst in Asian languages. The proposal presents guidance and mentorship in multiple languages as a solution. The proposal presents metrics and goals in line with the challenge. The proposal clearly demonstrates how it will add value to Cardano's ecosystem.", "q0r": 4, "q1": "The proposer presents references from the skills and experiences of its members. Also, identify each member of your team with their respective skills. The budget is very detailed and seems reasonable for the proposed work. A realistic deadline for implementation of the proposal is presented. The proposal presents a conductible plan for implementation. The resources needed to implement the proposal are also described. And the proposer considers the relevant challenges for a successful implementation.", "q1r": 5, "q2": "The proposal presents a roadmap with milestones that allow you to monitor the proposal's success. In addition, it presents KPIs that also allow you to assess the success of the work performed. A clear description of the problem and the proposed solution was presented.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "this proposal is a great idea. for the summary it fits. what is missing from the proposal is how it works and the criteria you set for the translator. author please clarify this problem next time.", "q0r": 4, "q1": "the proposed group gave a detailed description of how you solved the problem I believe with your experience you claim to be able to carry out this proposal. moreover the team showed us what the team proposed the project is being implemented and the future plans of the project. But I have a small addition for you that is to add the link of each group member so that the community can easily access and verify the topic writer. export.", "q1r": 5, "q2": "with the amount of information provided by the team I think the project will succeed and help a lot of new entrants to cardano in the east region. the team also offers a complete and transparent roadmap. The topic of translations is very reasonable. I appreciate your idea.", "q2r": 5, "assessor": "z_assessor_644", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "This is a great collaboration that truly addresses one of the root problems for Cardano adoption. The impact should be very positive. Its biggest beneficiaries are not only crypto newcomers but also crypto users. (from other blockchains)", "q0r": 5, "q1": "The proposers here are OGs in the Cardano community. The budget plan is well explained with a clear time frame. But, it doesn't mention the hiring risk, which will be different depending on each country's community. Another question is whether this position needs a full-time or part-time effort to operate seamlessly. Considering each proposer's track record on this proposal, the risk should be minimal. At least there are a few community members who are willing to join.", "q1r": 4, "q2": "From the audit standpoint, this proposal clearly defined everything in detail. Communities at large will get a huge advantage by having this project online. As a result, Cardano becomes more inclusive and well-known by everyone in the world. ", "q2r": 5, "assessor": "z_assessor_647", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposal aims to establish a functioning and sustainable translation pipeline for translating Cardano materials (documents and videos) into Eastern Asian languages.\r\nThe proposal addresses the objectives in the challenge's success:\r\n    - Increase adoption and community engagement of non-English speakers\r\n    - (Contribute to) Increase amount of resources in a variety of languages\r\nThe proposal not only identifies a problem within the challenge (English language could be the barrier for most of Eastern Asian people when they try to get content about Project Catalyst), but also clearly articulates how it will add value to the Cardano ecosystem. The proposal's success will be a huge contribution to the growth of Cardano ecosystem in Eastern hemisphere region and might be scaled up to the entire world. ", "q0r": 5, "q1": "I strongly agree that the proposal is likely to be successfully implemented because of following points:\r\n- The work of the team has already started. The proposal provide a link website (reference [2]) to show how the result will be.  Moreover, the team is highly engaged fulltime Catalyst Community members, successfully organize and host online events  for Asian communities since Fund 5. These things are strong evidences of the team's experience and relevant skills fulfilling for the successful implementation. Type and number of team members and roles are also provided in details in the proposal. \r\n- The budget is clear and broken down into identifiable items extremely clear understandable, so that the budget is reasonable to achieve the set goals.\r\n- The plan of the proposal is sensible and conductible with roadmap and milestones and timetable outlined clearly.\r\nI recommend the proposers should consider challenge and risk which is relevant to the success of the proposal.", "q1r": 5, "q2": "Roadmap with milestone and time horizon as well as metrics/KPIs are set clearly, make the proposal easy to be tracked. The targeted problem and solution are articulated clear understandable. Additionally, the work's result will be shown directly in the website, easy to see and easy to audit. Therefore, I rate auditability with a score of 5.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal sets out a clear problem that is consistent with the needs of the challenge. Its positive impact on the community is clearly stated and is reflected in its commitment to \"continue to develop and document a streamlined process for the translation of Cardano content into the various regional languages of East Asia\" and also to \"develop localised tutorial content to onboard future translators\". This is also mirrored in the key performance indicators and the different stages of the project implementation. Furthermore, as this proposal is about setting up and testing a translation pipeline, it will be able to meet future challenges, whether \" through Catalyst or other means of funding Eastern Townhall activity.\"", "q0r": 5, "q1": "The experience and skills of the participants are detailed, and allow their authentication, as well as their partners. The website is provided and also references and several links, which is a benefit. The budget is clearly explained and broken down into different stages of implementation, it seems realistic for a concrete implementation, in coherence with the timeline. The technical aspects are addressed, with a good explanation of the contextualisation and the details of the month by month achievement. Unless I am mistaken, the risks are not addressed, but the precision of their collaboration with members of the Catalyst Swarm, Catalyst School, Cardano Foundation, Emurgo to Eastern Town Hall and the fact that they are active members of the ecosystem gives an additional sign of confidence. ", "q1r": 5, "q2": "All information provided is clear and transparent. The KPIs are logical and offer verifiable quantitative indicators of success. There are several ways for the community to follow the progress of the project, including via the Github, as well as on their site. They plan to measure how their work will be disseminated and used in the Cardano ecosystem. And stipulate that: \"Everything we learn and do, we hope will inform the Cardano ecosystem at large.\" Finally, as this service is directly aimed at the development of the ecosystem itself, its seems that this project has community auditability as its source of reflection. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Eastern Town Hallでは、多言語で「オーダーメイド」のオンボーディングガイダンスとメンターシップを提供しており、これらのサービスは報われる必要があります。", "experience": "インドネシア、日本、ベトナムのコミュニティマネージャー資金提供を受けた提案者、コミュニティアドバイザー、提案メンター、カルダノアンバサダー"}