{"id": 383809, "author": "uptodatedevelopers", "title": "STAKE POOL OPERATOR Kinshasa/DRC", "url": "https://cardano.ideascale.com/a/dtd/383809-48088", "category": 26252, "amount": 17000, "description": "IT開発者のコミュニティとしては、DRCでのカルダノネットワークの分散化に貢献する可能性はありません。", "funded": 0, "upvotes": 14734828, "downvotes": 24652659, "votes_result": 9917831, "votes_cast": 104, "f6_no_assessments": 5, "f6_rating": 1.4666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal objective has nothing in common with the challenge objectives. Because there aren't info about a plan to follow is unclear how the proposer will become a SPO.", "q0r": 1, "q1": "There is some info about the team behind this proposal but is unclear if they have the necessary experience to implement this project.\r\nThe requested fund is not sustained with identifiable items that need money to spend on.\r\nThere are no information about how the project will be implemented nor timetable to complete the work.", "q1r": 1, "q2": "There is nothing to assess at this proposal as there are no info about the project to be implemented.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 24, "ne": 1, "ng": 19, "nfo": 4, "vca_o": 1}, {"q0": "Relation to personal qualifications: I am a passionate polyglot and am very fond of languages and projects that try to foster communication across languages so I feel confident in assessing projects of this category. Being some time in the catalyst community I know about important resources that might benefit from translation at least in this part of the community. The proposal identifies a problem that is not really part of the challenge and provides a solution that is left unexplained without any metrics or scalability unexplained. The topic does not match the challenge in any way. Feedback: Try reading the challenge settings properly and submitting your proposal in a challenge that really matches it. Also, formulate a proper proposal that contains all the important information. I am sure WADA can help you with this.", "q0r": 1, "q1": "Appart from the backing by WADA and the serious looks of the website, this proposal unfortunately does not fulfill any of the necessities: The budget set for this proposal does not have any justification or diversified items. Feedback: For future proposals, try to draft an accurate plan on what each item of your proposal will cost and rationable calculations on how you justify those costs. You need to consider that a lot of projects and teams want those funds so you should show them how exactly you are going to use them. No schedule or milestones are provided for the proposal. This indicates the proposer has not properly thought about the different steps of enacting the proposal. Feedback: Create detailed plan on what each aspect of the proposal needs work and time-wise and try to create milestones from it. The proposer has not considered or discussed any possible risks or challenges that might occur for the proposal. Technical details are not explained, hence it is difficult to assess both the actual skills of the proposer and the implementability of the proposal. Feedback: Explain the technical details behind your proposal. This will not just benefit the community in understanding it, but it will also help you to improve your entire proposal. The proposer has not provided a plan for the case if they need additional funds. Feedback: Consider defining an MVP that might even be possible to be made with less funds or explainig where you would get additional funds if needed.", "q1r": 2, "q2": "No Metrics/KPIs are presented and the proposal is not broken down into identifyable items. This makes it very difficult to properly audit the proposal. Feedback: Try breaking down your proposal into identifiable and auditable items. The targeted problem is not described in a clear manner, neither is the proposed solution.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This challenge is about creating adoption amongst more languages and communities around the world. Now, it is possible that a stake pool in DRC would somehow increase awareness and interest in Cardano but this is not made clear or justified in this proposal. \r\n\r\nFeedback. This proposal should clearly explain why exactly the challenge is addressed by creating a stake pool in DRC. For example, it could be that the profits of the pool would be used to fund local events that concern Cardano. ", "q0r": 2, "q1": "The website link provided helps us see that they have a competent team and a very professional website. They have launched several applications and services for customers. Based on this, they seem to have the technical capability to successfully set up a stakepool. \r\n\r\nFeedback. The proposers should indicate awareness regarding the challenges of working in Plutus/Haskell. There is not much of a plan indicated in the proposal either which means this proposal loses one star. ", "q1r": 4, "q2": "The nature of the proposal means that it is quite easy to verify whether or not they have actually implemented it and started to run a stake-pool node. \r\n\r\nFeedback. The costs that are indicated have not really been justified and broken down into components which is something that is asked for. This means the proposal loses 2 stars. ", "q2r": 3, "assessor": "z_assessor_582", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "\"I still don't understand how this proposal can Contribute to the decentralization of the Cardano network by becoming a steak pool operator in Kinshasa / Democratic Republic of Congo(DRC).\r\nThere are no solutions or plans presented in this proposal\"", "q0r": 1, "q1": "\"The team have worked in the design of Mobile, Web and desktop applications; with more than 18 developers. But there is no evidence to prove it.\r\nNo plan\r\nNo roadmap\r\nNo solution\r\nNo feasibility\"", "q1r": 1, "q2": "\"This proposal does not provide sufficient information to be able to properly assess it.\r\nThere is no milestones and no metrics presented. We don't know what to expect from this proposal therefore it is not auditable. \r\n\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 0, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "I strongly disagree this proposal addresses the challenge since it's calling people to become pool operator in Kinshasa, Democratic Republic of Congo (DRC).", "q0r": 1, "q1": "I strongly disagree that this proposal will be implemented successfully because of 3 reasons:\r\n1. It is off challenge.\r\n2. It has not been written completely.\r\n3. It has no plan, team, timeline, resources, budget breakdown.", "q1r": 1, "q2": "This proposal doesn't give me enough information to audit. It has no roadmap, milestone, time horizon, success metrics and KPIs.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "キンシャサ／コンゴ民主共和国（DRC）でステーキプール運営者となり、カルダノネットワークの分散化に貢献する", "experience": "モバイル、ウェブ、デスクトップアプリケーションのデザインを手がけるスタートアップで、18人以上の開発者がいます。"}