{"id": 367240, "author": "", "title": "Grow Latin America, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/367240-48088", "category": 26120, "amount": 500000, "description": "ラテンアメリカでカルダノのエコシステムを成長させるには？\n\nアフリカと同じように、集中的に取り組みます。", "f6_no_assessments": 2, "f6_rating": 4.666666666666666, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=16488"], "media": [], "f6_assessments": [{"q0": "This is alligned directly with Cardano's mission. We need community members from all parts of the world and to do so we need to invest in all parts of the world. This is similar to a previous fund for another country so fits all the same paramaters as that proposal did.", "q0r": 5, "q1": "We did the same thing to fund growth in Africa. Members have learned from that challenge, and we have also come to learn it is necessary for the growth of cardano. We have members from Latin America who understand what the Cardano Latin America ecosystem needs to succeed.", "q1r": 5, "q2": "The key metrics effectively measure progress in addressing the challenge and lay out the different perspectives to review the success and efficacy or the challenge.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "I believe Latin America has much potential for crypto adoption, so a fund with this in mind makes sense and could potentially influence adoption in the region. ", "q0r": 5, "q1": "500K seems like a lot of funds for the first go at the category, but I believe and hope that the Catalyst community will be able to fill the category with quality proposals. ", "q1r": 4, "q2": "Some of the key metrics given will be difficult to measure accurately, but we can assume that proposals in the category will have their own metrics that can be referenced when determining ROI.", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}], "importance": "カルダノのコミュニティは、北米とヨーロッパに大きく拠点を置いています。\n\n他の地域での成長には、コミュニティとしてのサポートとイニシアチブが必要です。", "success": "ラテンアメリカ出身者やラテンアメリカに縁のある人たちが幅広く集まり、チームを結成して、エコシステムを成長させています。"}