{"id": 367228, "author": "", "title": "Mission Driven Challenge", "url": "https://cardano.ideascale.com/a/dtd/367228-48088", "category": 26120, "amount": 500000, "description": "不均衡を是正したいというコミュニティの思いを、どうやって集中させるか。\n\n使命感を持って取り組む具体的な課題です。", "f6_no_assessments": 3, "f6_rating": 2.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "I hope it's safe to assume that \"mission driven challenge\" basically calls for initiatives that are led by teams of social entrepreneurs, correcting the wrongs in our society and leveling the playing field for the less fortunate. If that is the case, yes, we should have something like this.\r\n\r\nI used to be a social entrepreneur pioneer and I know it's damn hard to get anything done if it's purely a social mission. It needs to have a solid business logic, too.", "q0r": 4, "q1": "In the comments section people were asking for examples and it would have been nice from the proposer to answer those comments. Now there is too much room for interpretation. Would examples be World Mobile and Empowa, for instance? Rightly so, one commentator hinted at the fact that some of these issues are so hard to solve that they take a lot of time, a lot of funding and a very smart team. Could Project Catalyst give the initial nudge towards the right direction? Yes. Could it be a long-term funding source? I don't think so.", "q1r": 3, "q2": "Success metrics are missing. It is not enough to state this: \"The number and quality of funded proposals as well as the impact observed.\"", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "I don't feel like this would be a suitable challenge for Fund7. Since what you are stating does not involve anything catalyst-related. Mission-driven would suggest more proposals that fall outside of the Cardano system. It doesn't have a direct link.", "q0r": 2, "q1": "You \"How does success look like?\" is rather vague. It doesn't give a clear point on what the challenge is supposed to accomplish. However, mission-driven challenges would certainly apply to the community in a way that we have indeed all sorts of challenges. But it is just missing a key component to be better associated with Cardano.", "q1r": 3, "q2": "I gave my statement on the success criteria, I'm not really getting what you mean by it. The way you stated it makes it not really understandable. I've seen comments on the proposal the have the same concerns but you haven't addressed the comments. With only 1 metric this will make it hard to assess the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "While I support the idea of a mission-driven challenge within the Catalyst funding rounds, it is unclear that this challenge is critical to achieving Cardano's mission. There are so many ways that the ecosystem needs to grow and adapt to bring people in, (proposer outreach, community onboarding, dAapp development etc...) I think that these should remain the priority focus for now. \r\nThere is also an entire cohort of mission drive stake pools that use the ecosystem to promote their causes and give back to the community. Given that this network is already in place I am wondering if there are other mechanisms through which we could support additional pools and groups rather than through a catalyst challenge. ", "q0r": 3, "q1": "Given that there is already a network of mission driven stake pools it is obvious to me that the Catalyst community has the capacity to address the challenge. However, as mentioned above, I am not sure at this point that this should be the primary focus of a catalyst funding challenge given the many other areas that are competing for priority focus.", "q1r": 4, "q2": "Unfortunately, I do not feel that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge. Firstly, the challenge proposer suggests that success looks like \"Well-written and thoughtful proposals that enable people everywhere possible to improve their lives would arrive in waves\" however, this sort of success is almost impossible to measure. Would there be consistent metrics or key milestones/deliverables that help in determining whether people everywhere are able to improve their lives? More information is needed her to clarify to voters the intention of the challenge. \r\n\r\nSecondly, while I appreciate the challenge proposer's metric of \"the number and quality of funded proposals as well as the impact observed\" it is unclear how this would be determined. How would the quality and impact of such proposals be determined in comparison to all the other proposals across all challenges that are trying to provide quality and impact? \r\n\r\nI am definitely a fan of the challenge in theory but would request more details be fleshed out prior to being launched. ", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "importance": "Project Catalystの短い歴史の中で、私たちは実質的にすべての資金調達カテゴリーでミッションに基づいた提案を見てきました。もっと簡単にできるはずです。", "success": "可能な限り多くの人々の生活を向上させることができるような、考え抜かれた提案が波のように押し寄せてきます。"}