{"id": 368513, "author": "", "title": "Open Source Developer Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/368513-48088", "category": 26120, "amount": 200000, "description": "どうすれば、カルダノのエコシステムを、コミュニティが所有し、誰もが平等にアクセスできるフレームワーク上に構築することができるでしょうか？", "f6_no_assessments": 3, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "Having open source repositories for Cardano community developers to develop apps more easily aligns with the Cardano mission of driving adoption of Cardano. There is significant overlap between this Challenge and the existing Developer Ecosystem which has an unreasonably inflated budget therefore I recommend this Challenge instead.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The Developer Ecosystem challenge has been successful for several funding rounds with plenty of interest however it has hyperinflated its budget to 25% of the Total Fund which chokes out other challenge funding. If this challenge is successful in replacing the Developer Ecosystem challenge then it should raise its funding request but to no more than 10% of the Total fund.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and measurable.  \r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "I strongly agree with this proposal because I too find that often projects built with Community funding, end up the property of whoever built it, and then people have to rebuild the same things over and over, because they dont even find that there is an existing paid solution.  If they do find the paid solution as this proposer says it becomes centralized and therefore vulnerable. all Dapps built on that technology would be vulnerable by an attack on one particular project.\r\n\r\n", "q0r": 5, "q1": "\r\nThis project would address the problem identified, and use existing recognized methodologies to create open source versions of what is developed from the Community Funding. A reasonable budget has been stated", "q1r": 5, "q2": "The auditability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out.\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The mission of keeping the Cardano ecosystem open for developers of all levels is critical to prevent centralization. We don't want to end up another tech giant with a few powerful people controlling the direction of all projects. The decentralized nature of ADA currency can be confused with the development platform behind it. Both are important, but for logistical reasons we need to focus on the developer ecosystem. ", "q0r": 4, "q1": "It is certainly feasible that an expert team can be assembled once the funding is approved, but I would feel better (and rate higher) if some members were already on board. The experience listed in the proposal \"current member has experience with facilitating sessions, writing proposals and has experience working on open source projects as a developer & a product owner\" is a great starting point. I also think this project is feasible because of the strong community Cardano has nurtured through the plutus pioneer program. ", "q1r": 3, "q2": "This proposal list a few criteria for success \"Usage of open source git repositories, Usage of open source docker containers\". Also, mentions of metrics to track open source projects. This is again a great starting point and I would like to see some of these metrics across other platforms. We are so early into the smart contract development on the Cardano ecosystem. It would be alarming to me if the amount of open source projects didn't grow organically. Having a baseline to measure success would have been helpful, but I like this proposal and believe keeping everything open source is critical.", "q2r": 4, "assessor": "z_assessor_68", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "ほとんどのプロジェクトが必要とする中核的な機能があり、コミュニティが所有するオープンソースのソリューションによって誰もが利用できるようになります。", "success": "民間と公共の両方のグループの健全な組み合わせは、開発のための強固で開かれた基盤の上に構築され、貢献しています。"}