{"id": 368940, "author": "", "title": "Raising small ghosts, SPOs and devs", "url": "https://cardano.ideascale.com/a/dtd/368940-48088", "category": 26120, "amount": 100000, "description": "小さなSPOや開発者をCardanoコミュニティで育てるには？", "f6_no_assessments": 1, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Supporting small SPOs and developers aligns with the Cardano mission driving adoption of Cardano. There is no overlap with existing challenges although there are competing challenges in this round. If small SPOs and developers are not economically viable then they will disappear which will change the desired decentralized nature of the Cardano ecosystem.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The community has the technical capability and faster funding models are a common request. The request is small compared to other challenges and it could inspire improvements applicable to the broader community.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and mostly measurable.  The variety of possible solutions to the challenge is broad making key metric selection difficult.\r\nI  agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "小規模なSPOやdevsの持続可能性／実現可能性を通じて、ブロックチェーンにおけるより大きな分散性と回復力を実現する。", "success": "小規模なSPOや開発者は、代表者や資金を得るための選択肢、サービス、ツールが増える + ブロックミントでの流通量が増える。"}