{"id": 369289, "author": "", "title": "Prototype Diversified Voting Method", "url": "https://cardano.ideascale.com/a/dtd/369289-48088", "category": 26120, "amount": 150000, "description": "一つのチャレンジファンドに対して、議決権の分散と柔軟な資金調達のプロトタイプのデモンストレーションを実施できないか？", "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Implementing a demonstration of diversified voting and flexible funding aligns with the Cardano mission driving adoption of Cardano however the challenge brief is more of a proposal than a challenge. The challenge brief is very specific in that it will require a prototype vote using recommendations from the Diversified Voting Influence analysis then provide an analysis of the results. By my understanding, it does not appear that there could be multiple winning proposals under this challenge, at best there might be competing teams for a single contract to do the work. \r\nI neither agree nor disagree that this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 3, "q1": "The catalyst community has the technical capabilities to address the challenge however its not clear to me when and how the community chose to use the recommendations from the Diversified Voting Influence analysis as the desired voting methodology. I suppose voting for this challenge would give it legitimacy however in that case a link to the analysis and recommendations being made would be required for informed decision-making.\r\nI neither agree nor disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 3, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and some are measurable. \r\nI  agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I agree with this proposal because  I think that trying out a different way of voting, parallely with the current way would show if there was an advantage of having other ways of voting and whether that would make a difference in the number of projects accepted and rejected through voting", "q0r": 4, "q1": "The budget for this project is reasonable .", "q1r": 4, "q2": "\r\nThe Verifiability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out.\r\nMetrics include \r\nNo of votes for each proposal using each method of voting\r\nhow did smaller size wallets influence it\r\nDoes the flexible funding capability influence the selection of awarded projects\r\nAre there any detectable security risks with this rebalanced influence\r\nHow does the participation in the prototype vote compare with the current Cardano Catalyst voting?", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 9, "ne": 3, "ng": 2, "nfo": 4, "vca_o": 1}, {"q0": "This proposal looks to experiment with the voting process in order to determine what is the best way to weigh wallets and voting. We want to make sure governance is fair and those with a larger stake have a larger say, but we also don't want smaller voices drowned out.", "q0r": 5, "q1": "The community has the capacity to experiment with voting and different weighted voting mechanisms. We even have another proposed challenge called challenge governance that this could be combined with.", "q1r": 5, "q2": "The criiteria and sugjesteed metrics are sufficient to measure the progress as they cover outcomes, measuring changed outcomes, security risks,  and the effect on participation.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1}], "importance": "Cardano Catalystの投票メカニズムの修正を実施する前に、提案された推奨事項をテストするためのトライアルが必要です。", "success": "投票権を持つウォレットの25％がプロトタイプの投票に参加します。\n\nその結果、選ばれたプロジェクトに重要な違いがあることがわかりました。"}