{"id": 369387, "author": "", "title": "Help Small Countries Adopt Cardano", "url": "https://cardano.ideascale.com/a/dtd/369387-48088", "category": 26120, "amount": 500000, "description": "Cardanoコミュニティは、5つの小さな～10万人の低開発国、独自の課題を抱える国の価値あるユースケースを特定し、研究し、促進することができますか？", "f6_no_assessments": 4, "f6_rating": 3.3333333333333335, "videos": [], "media": [{"url": "https://screencast-o-matic.com/watch/cr6oboVXk9F", "title": "Video"}], "f6_assessments": [{"q0": "Helping small countries adopt Cardano aligns with the Cardano mission driving adoption of Cardano. To achieve this mission it is not critical to have a challenge dedicated to adoption in small countries because there are other existing challenges that overlap with this objective. If this challenge could make the case of having a lower cost per Cardano adoption compared to alternative challenges then it would beneficial. As is, the proposal adds $1 per targeted Cardano adoption with a risky success rate. There is a case that having a country adopt  Cardano as a legal currency, like El Salvador and Bitcoin, would greatly drive adoption rates so this challenge does have a unique value proposition.\r\nI neither agree nor disagree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 3, "q1": "As a decentralized community, Catalyst does not have representatives that could enter into negotiations with countries on its behalf. This would be a role for the Cardano Foundation.\r\nI strongly disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 1, "q2": "The success criteria are relevant to the challenge question however having proposal winners contact decision-makers to prepare and present a pitch and implementation plan has many problematic elements to it.\r\nThe key metrics are relevant to the success criteria but are subjective measurements.\r\nI  neither agree nor disagree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "As I continue to see the importance and focus that Cardano puts on community engagement, this was the first thing that really stood out in this proposal to me \"community must engage its resources\". It sounds simple and intuitive enough, but I think most people would be surprised at the general lack of engagement from the average person. Lots of synergies to explore here!\r\n\r\nGiven the unique approach to the challenge setting that is focusing on creating challenges that address solutions, vs an actual solution, this proposal felt like a good incubator for ideas that will help generate future solutions and also additional challenges. A good feedback loop.", "q0r": 5, "q1": "The focus on small countries with a more nimble decision making process makes sense. Also, the awareness to engage decision makers shows an understanding of how to get things done. Maybe more importantly, the willingness to engage the community and leverage their network is what got this a 5 star.", "q1r": 5, "q2": "Given the unique nature of the Fund7 challenge setting it seems like verifiability may be more \"challenging\" then some other settings. I gave this a 4 star because it seemed like the below key metrics were a bit subjective, more maybe more just going to be difficult to track and measure. \r\n\r\n\"- Value of use-case to country\r\n- Extensibility to other countries\r\n- Degree of engagement with decision-makers\"\r\n\r\nAt the same time, the below KPI show a unique and creative approach that looks at the engagement and follow up with key decision makers as very important.\r\n\r\n\"- Response of decision-makers to pitch, presentation and implementation plan\"\r\n\r\nAlso, based on a decade of B2B high tech sales experience I've seen first hand the importance of \"next steps\", or rather what happens to a project without any next steps, which is no momentum or path to success. So great to see awareness of that here. \r\n", "q2r": 4, "assessor": "z_assessor_503", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I see this as a good way to limit target not solely by geography.   The rationale that small countries are more approachable and face unique problems is valid.  The reality that this type of country is spread around the world lends to decentralization and could influence surrounding countries at a larger scale than a geographicly targeted challenge.\r\n\r\nWhy not 5?  I do see some overlap into Grow Africa, Grow Latin America, etc.", "q0r": 4, "q1": "The Cardano community is world wide.  Perhaps in these very countries or near them.  Getting these individuals interested or aware could prove a challenge.  A simple search of small countries and research on them could lead to teams traveling.  However, native desire would have more pull with its government.  What is the best approach? How would that approach be implemented? ", "q1r": 3, "q2": "This is certainly easy to see if a country gets on boarded into the Cardano network.  But there are many steps between discovery and onboarding.  What are those steps?  How is accountability reported/ measured?", "q2r": 3, "assessor": "z_assessor_521", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposer has identified a niche where Cardano can grow, prove itself and start achieving it's mission, with relative ease. \r\n\r\nHowever the challenge would benefit from providing some indication of the unique challenges of very small countries, and if they are unique, how will they scale globally to achieve Cardanos mission? Can these challenges be solved by a blockchain like Cardano? Where are these small countries, and which are they, do they have adequate internet connection and mobile/desktop penetration?\r\n\r\nThe idea is good but would require more research and background to prove that this is really a challenge that would make a big impact in the long run.", "q0r": 4, "q1": "As the challenge is very vague in what it will achieve, apart from implementing something on Cardano in a small country, it is hard to say if it is feasible. \r\nFrom the proposal it is clear that the aim is to build something like the digital currency of Marshall Islands, or with similar scope.\r\nThat is quite an undertaking, and while the proposer claims it will be easier in a smaller country (it well might), there is no proof in the proposal that this is the case. \r\nOne would probably (my guess) have to be at least a resident of the country in question to be able to find a use case, draft it properly for a political assembly to approve and implement it properly. How many residents of small nations do we have in the community? Is the proposer such a person or knows persons like these who are willing and able to perform this?\r\nAs none of these questions are addressed in the proposal the feasibility is hard to judge, even though the idea sounds good, it is more of a concept at this stage.", "q1r": 3, "q2": "From the proposal:\r\nKey Metrics to measure\r\n- Value of use-case to country\r\n- Extensibility to other countries\r\n- Degree of engagement with decision-makers\r\n- Response of decision-makers to pitch, presentation and implementation plan\r\n- Next steps achieved.\r\n\r\n\r\nThese metrics are not defined enough to measure. \r\n\r\n\"Value of use-case to country\" could mean anything and only really does looks at ideas not implemented solutions.\r\n\r\n\"Extensibility to other countries\" - while it makes sense to measure how to extend a use case globally to achieve Cardanos mission, this needs to be broken down a lot more, probably into sub goals, like technical extensibility, capability extensibility, etc.\r\n\r\n\"Degree of engagement with decision-makers\" - while this would be important for success, it needs to be further refined and broken down. Is an email or a meeting with one politican engagement? Meetings with NGOs, are they decision makers? With expats? What consitutes high engagement vs low? Etc. More work needed to break down the metric to become measureable.\r\n\r\n\"Response of decision-makers to pitch, presentation and implementation plan\" - what is a good response? Is it a legislative proposal, good feedback, having a meeting, etc. ? More breakdown of what to measure is needed.\r\n\r\n\"Next steps achieved\" - again, since the challenge is so vague it is really hard to understand what \"Next steps achieved\" would mean and how to measure it. \r\nIs it awareness among the public of Cardano? Is it a fully implemented digital currency on Cardano? The range here is huge and needs to be further detailed and broken down.", "q2r": 2, "assessor": "z_assessor_533", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "importance": "カルダノはユースケースが少ないことで最も批判されています。IOGチームはすべてのケースを見つけて宣伝することはできません。コミュニティがそのリソースを活用しなければなりません。", "success": "提案者は、特定の国におけるユースケースを特定します。意思決定者を特定し、連絡を取る。ピッチと実行計画の作成と発表"}