{"id": 369564, "author": "", "title": "Overhaul Catalyst", "url": "https://cardano.ideascale.com/a/dtd/369564-48088", "category": 26120, "amount": 100000, "description": "カタリスト・ファンディング・プログラムをスケールアップするためにはどうすればいいのか？", "f6_no_assessments": 1, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Improving the funding process so that it can scale aligns with the Cardano mission of growing the global Cardano community.\r\nThe current funding process has many flaws that are leading to poor untimely decisions on the allocation of resources. \r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The challenge is not detailed enough to determine exactly what is being requested. My best interpretation is that hyperscale adoption means more ada funding more projects more quickly using an automated system of co-investment. Who is the co-investor with the Catalyst fund? The proposer? The community? Stake pools?\r\nI neither agree nor disagree that the Catalyst community has the capacity to address the challenge.\r\n\r\n", "q1r": 3, "q2": "The success criteria is not very descriptive. \r\nThe key metrics are not clearly defined. The amount of ADA being invested by who?\r\nI  neither agree nor disagree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "現在のモデルでは、カルダノの普及を加速するためのスケールアップはできません。", "success": "ハイパースケール採用。"}