{"id": 369714, "author": "", "title": "Climate Change: THE Challenge", "url": "https://cardano.ideascale.com/a/dtd/369714-48088", "category": 26120, "amount": 270000, "description": "気候変動は、今後の人類の最大の課題です。**この邪悪な問題を解決するために、カルダノはどのように貢献するのでしょうか。", "f6_no_assessments": 6, "f6_rating": 4.055555555555555, "videos": ["https://youtu.be/DsPNukTbotA", "https://www.youtube.com/watch?v=mMRxVLBUtHY&start=33959"], "media": [{"url": "https://cardano4climate.com/", "title": "Website"}, {"url": "https://t.me/ClimateChange_THEChallenge", "title": "Telegram"}, {"url": "https://twitter.com/Cardano4Climate", "title": "Twitter"}, {"url": "https://discord.gg/DezvYSv57w", "title": "Discord"}], "f6_assessments": [{"q0": "How Cardano contributes to solving climate change partially aligns with the Cardano mission of contributing to the positive advancement of blockchain as a world-changing technology.\r\nI agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 4, "q1": "The skillsets required to create \"DApps, protocols, new networks and incentives to regenerate local and regional ecosystems and economies\" already exists with the Catalyst community. The fund is of moderate size and the issue is important to a likely sizable portion of the community.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question although the success criteria to regenerate local and regional ecosystems and economies is a specific subset of solutions compared to the challenge question of solving climate change. \r\nThe key metrics are partially relevant to the success criteria. Number of proposals should never be a key metric to any challenge question, unless the challenge was how to attract more proposals. How does one measure \"increased community understanding\"?\r\nI agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This is the biggest challenge any project faces. Cardano's mission is to be sustainable while growing! The challenge is scaled too large.. We will always have climate change. Temperatures will always increase and decrease over time. We can see that in lots of research. However, this is overwhelming and not thought out clearly on how we can use the blockchain to establish sustainability. It is not clear as to how this challange will be solved. Will there be projects that require a net zero carbon footprint? Or is the idea to get projects to a net zero carbon footprint? ", "q0r": 4, "q1": "We need to be clear how the community will help to address and solve this challenge. The implementation of apps is a good idea but how does it help? What criteria does the team have that we  the community can use to approach this? It can be very difficult but very rewarding if we can be assured the community can address this challenge. For now its not very clear.", "q1r": 3, "q2": "The success criteria relies heavily on one's morals and their backing of climate change. If the project can provide use cases on how this can benefit stake holders along with some sort of gain then this can be a global sensation.This project should consider finding away to attract more proposals to this category.", "q2r": 2, "assessor": "z_assessor_400", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "I believe the majority of the people who support Cardano do so not just because it is a peer-reviewed 3rd gen blockchain technology with clear and decisive advantages over those built before it. We do so because we share the same ambitions of the Foundation; to build better systems that will uplift lives, not only of those who have been left behind by legacy systems but also to usher in a new way of sustainably and globally managing our future and our environment. Climate Change is a danger and a challenge that needs to be addressed now and it comes with a little bit of a surprise that we have not yet included this in Catalyst. It is of paramount importance and is at the essence of what Cardano is. It is not just critical to achieve Cardano's mission. Climate Change  is the yardstick that will measure our success for what is the good of building a new system when we continue on our path to destroying the planet. Kudos to those who presented this challenge. I hope it achieves mass acceptance.", "q0r": 5, "q1": "No new company or organisation, or new products and services, or new applications and technology are discussed these days without assessing its impacts on the planet. Cardano and its community are not immune to these discussions and are aware of the importance of addressing this challenge. More than most I would argue. We are aware of the differences between PoS and PoW energy usage. We are aware of SPOs who run carbon-neutral nodes. We are aware of sustainable Bison farming techniques, etc. Because its a common topic in most of our discussions, I am confident voters and proposers have the capacity to address this challenge in a careful and responsible manner and like myself, most would be surprised this challenge is only being considered now. That said, I believe the community will be eager for a Climate Change Challenge in Catalyst.", "q1r": 5, "q2": "The proposers have presented seven key metrics for success which could measure if Cardano is meeting this challenge. And given the on-going activities to beat Climate Change in different jurisdictions and communities already happening around the world, more could be added as corresponding proposals are submitted and new ways to address the issue are presented to the community. From a project oversight standpoint the 17 UN Sustainable Development Goals, which the proposing team presented in its draft, may also act as a checklist to which we can base the success of this challenge. ", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is a very clever challenge in my opinion. Since one of Cardano's goals is to bank the unbanked. It might seem unrelated, but actually, once everyone gets to be banked they are collectively going to use more energy and resources to create value.\r\n\r\nWith this challenge, we have the opportunity to prepare the best solutions ahead of time to make sure we don't overuse resources and use them effectively with new innovations.\r\n\r\nI myself recently saw a video about Heliostat advancements, would be interesting to see if Cardano is capable of creating connections with big scientific companies. ", "q0r": 5, "q1": "Right now I have a feeling we are busy developing and improving our own experiments here and strengthening the low-hanging fruits of creating financial products.\r\nBut then again I would want to empower entrepreneurs to think bigger and prepare to make the future efficient.", "q1r": 3, "q2": "I think that is an irrelevant metric to measure: \"Real solutions with real impact are funded\" way too many perspectives to decide real solutions vs not real.\r\n\r\nI would actually prefer to see arguments about what happens if we don't work on this now to give more insight on what the proposers expect to be solved. Climate Change is a huge topic.\r\nIt does have guiding questions, but they would like to see examples and risks associated with compared to doing something and not doing it.", "q2r": 4, "assessor": "z_assessor_600", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Cardano is all about being a blockchain for real-world impact, and the most important issue right now is the impending climate catastrophe. According to the latest IPCC report, >1.5C heating can no longer be avoided in the near term, and current efforts are not enough to avoid 2C warming, which can have severe consequences for societies. ", "q0r": 4, "q1": "It is a challenging challenge. Creating more economic activity, hence more energy use, is likely to be harmful for the environment. Even an energy-efficient blockchain like Cardano still requires energy. Therefore, to succeed, a proposal in this challenge would have to replace an existing way of doing things with a better, less energy-intensive, way, or facilitate other actions for avoiding the climate catastrophe. Both require not only technical capacities, which I am sure the community has, but reaching out to other businesses and social groups. I am unable to say whether the community has suitable people for that task.", "q1r": 4, "q2": "The proposal has a long list of ideas for what would count as success under \"How did we contribute to solving the issues around Climate Change?\". It would, however, be good to be more precise on how, e.g., community understanding and carbon footprint of projects could be measured (this may be difficult for small projects).", "q2r": 4, "assessor": "z_assessor_603", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The Cardano community and blockchain technologies are missing impactful bridges to the real world.  This could help bridge decentralized finance, smart contracts, and on the ground campaigns that physically combat climate change, which would bring a lot of positive value and press.  It would be nice to have a clearer picture as to how Cardano and its users are impacted by climate change to guide proposals", "q0r": 4, "q1": "The cardano community is one of the most robust intellectual, engineering, collectives on the planet.  They can definitely take this on.", "q1r": 5, "q2": "A great idea, but it's not completely clear which proposal outcomes will be used to meter challenge success.  ", "q2r": 3, "assessor": "z_assessor_626", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "importance": "カルダノにはブロックチェーン、コミュニティ、アプリケーションを構築するための優秀な人材が揃っており、私たちのエコシステムと経済を再生するために必要です。", "success": "DApps、プロトコル、新たなネットワーク、インセンティブの創出により、地域の生態系や経済を再生させる**。"}