{"id": 370086, "author": "", "title": "Developer ecosystem", "url": "https://cardano.ideascale.com/a/dtd/370086-48088", "category": 26120, "amount": 2000000, "description": "どうすれば、開発者が成功するアプリの開発に集中できるような、ポジティブな開発者体験を作ることができるでしょうか？", "f6_no_assessments": 3, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a positive developer experience that helps the developer focus on building successful apps aligns with the Cardano mission of investing in people who are passionate about championing blockchain, supporting those who are creating, pushing boundaries, and solving real-world problems with this powerful nascent technology. There is overlap between this Challenge and the Open Source Developer Ecosystem which has a more reasonable budget.\r\nI agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 4, "q1": "The Developer ecosystem challenge existed in Fund 5. There were 22 proposals successfully funded for $588,202 out of $600,000. In Fund 6, there are 102 proposals (2nd largest of 18 Challenges) in the assessment phase for the $1,005,000 fund. The community may have the capacity and interest in funding this challenge up to the $2M requested.\r\nThis is a very big request that represents a very large percentage of the total challenge fund. Developer happiness is important but does the general community really want to preclude challenge funds for solving global poverty or the like by funding such a large request? Several of the established challenge funds have doubled their requests from Fund 6, which in the case of this challenge fund becomes a particularly large amount. These increasing requests are effectively going to choke out any new challenge fund requests which will stifle innovation and the decentralization that the community was founded upon.\r\nI would like to recommend funding this challenge for $1M like in Fund 6 , as I think this request is too large for the good of the general community, and to allow new Challenge teams to form however that is not an option. \r\nI neither agree nor disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 3, "q2": "The success criteria are relevant to the first half of the challenge question. Only one of the key metrics is relevant to the success criteria and the rest are relevant to the second half of the challenge question. Technically, the success crtieria should include building successful apps in which case everything logically flows.\r\nI agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Given that success for this challenge has a focus on engaging, original proposals, I feel that the lighthearted and fun energy the proposer brings to the table matches the theme perfectly.\r\n\r\nAlso, the idea of self governance is central to this challenge and I believe the simple yet impactful nature will make it easy to adopt and manage.\r\n\r\nFinally, given the list of 10 potential directions this project could take, I believe a unique outcome is likely, fulfilling another theme of the challenge", "q0r": 5, "q1": "The proposer has made this a feasible idea by keeping the ideas high level and engaging which will draw attention and make the challenge \"sticky\" with its audience. \r\n\r\nThe proposer asks some great questions (see below for example) in the KPI section showing they are aware and focused on addressing any challanges and roadblocks that would prevent the project from being a success:\r\n\r\nQuestions asked:\r\nFilling in gaps defined in the exploration stage.\r\nNumber of developers actively building on top of Cardano", "q1r": 5, "q2": "I originally had this as 5 starts but looking into it further I am concerned that asking for 200,000 may be a bit much. In order to make this a 5, I would need to see a detailed breakdown for the budget.\r\n\r\nHowever, good success metrics have been laid out and the flexibility of the direction of this project and given how unique and new it is means I would still give it 4 stars.", "q2r": 4, "assessor": "z_assessor_503", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The description of the challenge is impactful and clearly stated This proposed challenge can have a large impact on Cardano environment as a more positive developer experience can bring new developers to Cardano. If selected, this proposal will attract attention, will probably receiver many proposals and engage voters", "q0r": 5, "q1": "Guiding questions and directions / examples are given to proposers. It gives them an accurate vision to assess if there project fits in the perimeter of the challenge. If selected, this challenge will probably receive good quality proposals and a low number of proposals that would not meet the minimum ideascale standard.", "q1r": 5, "q2": "The key metrics of the challenge are worthy, though difficult to measure precisely. I'm very confident that it will be sufficient ot enable assessment of the challenge impact on developer's environment, and thus of its impact on Cardano's mission.", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "開発者の意欲を高める素晴らしい体験を提供することで、開発者の採用率、生産性、創造性の向上につながります。", "success": "生き生きとしていること。お金を稼ぎ、目標を達成し、相互に助け合い、協力し、成功の感覚を共有しているハッピーなエネルギーに満ちた開発者たち。"}