{"id": 370165, "author": "", "title": "Metadata challenge", "url": "https://cardano.ideascale.com/a/dtd/370165-48088", "category": 26120, "amount": 200000, "description": "トランザクションのメタデータを活用して、実世界の問題を解決するにはどうすればいいのか？", "f6_no_assessments": 1, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Using metadata to solve real world problems is key to meeting the Cardano mission to enable, empower, facilitate and accelerate progress in the blockchain space. \r\nI strongly agree his challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The metadata challenge existed in Fund 5. There were 5 proposals successfully funded for $47,200 out of $50,000. In Fund 6 there are 30 proposals in the assessment phase for the $100K fund therefore the community has the capacity and in the interest in funding this challenge up to the $200K of this challenge.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are fine but are not measured in the key metrics.  \"Potential amount of users\" is not a measurable metric. Community feedback might be an acceptable metric but it should be in the form of a survey question like \"will this prototype solve a real life problem\". You could add to the survey a question like \"how many users do you think this prototype bring onto Cardano\".  While not an ideal metric, at least they are actual measurements.\r\nI neither agree nor disagree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "importance": "トランザクションのメタデータがあれば、Cardanoはイベントや文書の小さな証明を保存するネットワークとして活用できます。", "success": "現実の問題を解決するためにメタデータを利用するプロトタイプが構築される。プロトタイプはあらゆるTHでCatalystコミュニティに発表されます。"}