{"id": 381570, "author": "swong", "title": "Bottom-up land registration(Zambia)", "url": "https://cardano.ideascale.com/a/dtd/381570-48088", "category": 26254, "amount": 42000, "description": "Over one billion of the world's poor lack legally recognized land rights, locking them out of the financial system.", "funded": 1, "upvotes": 34090478, "downvotes": 11304721, "votes_result": 22785757, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=6980"], "media": [], "f6_assessments": [{"q0": "From an impact perspective, this proposal ticks all the boxes. The problem of land ownership in the developing world is important and tricky. Using Cardano's PRISM technology to provide verifiable credentials for land titles would have a huge impact for the landowners themselves, and also ties closely to the broader Cardano mission of becoming the world's financial operating system. The proposal clearly addresses the challenge brief of promoting widespread adoption of Cardano's DID solutions. ", "q0r": 5, "q1": "The proposal does a fantastic job of connecting a big picture goal and huge ambitions with a very achievable and measurable proof of concept. The proposal outlines the process of creating the building blocks needed – wallets for issuers, holders, and verifiers and a means of accessing the DID software. The mention of a paper-based DID solution suggest a good knowledge of the local landscape. It would be helpful for the proposer to have provided more information on their background and qualifications in order to substantiate their ability to deliver on the project. By googling the proposers name I found his LinkedIn profile which suggests he has the necessary management and business skills required. The linked partner (medeem) also appears to have a strong presence in the target market of Zambia.  While the proposer does not appear to have the necessary PRISM programming skills, the need to hire a developer is clearly mentioned, and funds from the requested budget are allocated for that expense. Importantly, the proposal demonstrates a sound understanding of the concepts of DIDs and the need for Trust Registries, which makes it feasible that the proposer could hire and direct a developer to build the envisioned Proof of Concept. The proposal provides the beginnings of revenue model that would support the project once the initial Catalyst funds have been spent. ", "q1r": 5, "q2": "The Roadmap is very clear and spells out step by step how the project will progress. The KPIs are also clear and provide easy to measure numerical goals for the various steps of the project. The budget is divided into a couple of line items that clearly relate to the project plan and goals. The budget amount is very reasonable and the idea of building an initial proof of concept to share with the identified partner seems an excellent first step. The problem is well-described and understandable, and the outlined solution clearly addresses the problem. I wish this project much success! ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The idea partially fits with the goals of the challenge, in my opinion. I think that because the project is based on taking landowners to the digital economy, a discredited identity for each of them. In theory, the proposal would fit with the goals of the challenge, because it would generate new users for Atala Prism, I believe. However, some doubts arose when they finished reading this proposal. The first one is, who is the target audience of this project? At first, the proponent cites as low-income people, who lack land rights. But in the course of the proposal, specifically on the \"demographic\" topic, he points out that the goal is to reach 10,000 landowners. Were they all low-income? Were they all from Zambia? If the public is the needy population, who would be charged the membership fee that is mentioned in \"business model\"? After all, which of the 3 ways would it be approached, traditional microfinance, DeFi or GameFi? What would all the same IDs look like for landowners, how would they know, understand and believe in those offered by Cardano's decentralized identity? How to ensure that these new users would remain in the system? I believe it is confusing as to the advantages that can be seen here, both for the Cardano ecosystem. It's not a confusing idea, I'm confused about this proposal: it's not a confusing idea, a little bit careful of the smallest estimate proposal.", "q0r": 3, "q1": "The team is undoubtedly prepared to execute the project in order to give power and control to landowners. Although there is not much detail in the proposal itself, on the attached website there is a tab written \"about us\", where we can have a more in-depth knowledge about each of the members. We can see their photos, names and respective roles. However, it is not very clear who here has knowledge related to the Cardano ecosystem, who will work directly with Atala Prism? In the proposal itself, in the required skills section, there is the following topic: \"knowledge for the development of Atala Prism\". Does that mean they recognize this gap and would hire someone to perform the service? Unfortunately, without this clarification, it is difficult to trust 100% in the team's ability to carry out the project, because a good part (18k) of the funding would go to the developer of Atala Prism. Regarding the script, the determination of the phases is done in a very broad way, in my opinion. Some phases are more detailed, while others (such as the last one: \"12-24 months: start pilot deployment and phased deployment\") are very untidy. In period 1 they would implement the pilot, but what would happen in each semester? What minor activations would be performed for this deployment? Regarding financing, the money is divided between the salaries of professionals. It would be necessary for them to point out who these people would be, because even if the team is well prepared to deal with this type of project, it is not determined which people among the options present on the site would work here. I also couldn't understand, the 42k would only be enough for 3 months of work by these professionals when in the script they calculate what would happen up to 24 months. Would further funding be requested?", "q1r": 3, "q2": "The proposal is not that auditable, unfortunately. The KPIs provided are quite superficial and sparse, and the roadmap, as I explained, lacks more detail. In this way, we have very basic information on how to analyze both the results and the development of this project. I suggest that the authors rephrase this part of the proposal to include more information that could serve for accurate monitoring of the whole thing. As, from what can be inferred, the project would be developed entirely in Africa, it would be interesting for a local resident to be able to closely monitor the development of things, and bring this monitoring to the rest of the Cardano community. In other words, my final opinion is that the team even makes some content available for future auditability, but not enough to do it with the depth that I consider adequate.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 21, "ne": 13, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": " It sounds like a great idea for the landowners. Everything that gives them their rights and decisions is empowering and necessary.\r\nIt will also ask honest people who want the best for the landowners and less for their own sake, although of course they also have to ask about the project.\r\n", "q0r": 4, "q1": "The proposal may still include how the users are informed and motivated for the project. Do they see an obvious added value and growth potential for their work, and how much time should they invest in this system? It's a very promising project, it will take time to get to the final product, but the submitter is working out all the parts well.", "q1r": 3, "q2": "The roadmap is available and transparent, perhaps the training for the user can also be included here. KPIs are briefly described and can be worked out even better, what have you achieved when you achieve success? How many people do you want to reach with your project?", "q2r": 4, "assessor": "z_assessor_667", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Using VC-based land registrations to on ramp land owners to the digital economy.", "experience": "My team (and partner) have documented over 10,000 land parcels in Zambia. We can quickly onboard the land owners into the SSI world."}