{"id": 381571, "author": "josec", "title": "Students dropping out of college", "url": "https://cardano.ideascale.com/a/dtd/381571-48088", "category": 26254, "amount": 19000, "description": "Only 55% will graduate college. Dropouts place a burden on the government that costs nearly 40B USD to society every year in the US alone.", "funded": 1, "upvotes": 31216261, "downvotes": 11654472, "votes_result": 19561789, "votes_cast": 146, "f6_no_assessments": 5, "f6_rating": 4.200000000000001, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal nails the challenge brief section, Self-governance of Emergent Communities, and having been onboarded into the AtalaPRISM Pioneer Program, this proposal team will be receiving the guidance to stay on point in this challenge.  The initial credentialing for students they propose dovetails perfectly with the challenge guidance to build and maintain reputations via DID.  If successful, their AI could be distributed to almost any education sector, and the DIDs could easily follow students through their chosen mentorships, trade training or higher ed.  The number of DIDs onboarded to Cardano is hard to imagine in the final incarnation of this process, but the proposal team has verified previous experience of onboarding students to programs they have developed, and the numbers are astonishing, in the hundreds of thousands.  Now, to be clear, this fund request is specifically for the process of building out careerpath datasets, testing and delivery of the AI, to be developed in parallel with the front end design and installation of the AI to AtalaPRISM.  The next step would be the MVP rollout of the AI, which is not included in this proposal.   Oddly, the metric of essentially onboarding 1 user (a test case they monitor and study and iterate off of) could actually be considered a huge success for plan of this type, and further funding rounds could take it from there.", "q0r": 5, "q1": "The proposal team looks eminently qualified, with decades of experience across education and mentoring, and numerous successful startup and outreach efforts.  They recognize the importance of a highly qualified developer for the DID integration, and have dedicated over 60% of the proposed budget to success in that area.  As of the writing of this assessment, there has not been an indication they have found their developer yet, however they have been quite active in looking for someone, and being networked with AtalaPRISM is a good indicator that they will find the right fit for the team.  The lack of an advanced development team means they have not been able to supply detailed milestones and technical requirements of the DID integration, so they will need to lean into their mentorship with AtalaPRISM to get caught up.  Their early focus (already underway) on the UI/UX and AI algorithm (combined with the design experience of the team) means they will have a running start with this funding on perhaps what will end up being one of the biggest factors: the eventual onboarding of clients via usability.  This is a project that has earned a chance to participate in the Cardano DID ecosystem.", "q1r": 5, "q2": "The proposal was very clear about its intent for this funding, and the major milestones that would define progress towards its goal of a complete test scenario of mentoring a student.  The proposal team has been very forthcoming during the proposal process and has interacted with the community and reached out to resources to strengthen the proposal, and it is expected they will continue to do so.  The milestones provided could perhaps establish 2-3 natural audits points approximately monthly, but when the development team comes on board there will be another opportunity to add more clarity to the auditing process.  For the expected timeline of 3 months, the auditable events should be sufficient for the community to know the project is on track.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Great and innovative idea by the proposer. The proposal effectively identifies a problem within the challenge which needs to be solved and has provided a concise proposed solution which has the potential of bringing value to the cardano blockchain.", "q0r": 5, "q1": "The proposer together with the team have provided the required information and links necessary to successfully execute the project when funded. The budget is on point and reasonable to achieve set target.", "q1r": 4, "q2": "The proposer has in place a roadmap to guide in project execution. The proposer however has not captured activity timeline, KPI's, launch date to execute and also track the success and progress of the proposal. This i think doesn't make the proposal fully complete.", "q2r": 3, "assessor": "z_assessor_420", "no_vca": 23, "ne": 2, "ng": 10, "nfo": 11, "vca_o": 1}, {"q0": "This project proposal could help reducing dropout rates by provide an AI mentoring as an on-demand service and deliver real-life pathway solutions to reduce dropout rates across countries. However, this project does not address the main challenge effectively and the DID implementation is very limited. It will be better if team can have better problem statement that relate more closely on the main challenge. ", "q0r": 2, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. Furthermore, in this proposal, team requested reasonable budget with detailed breakdown. With the vast experiences and community involvements by team, I am very confident that this project could be delivered successfully. To improve the proposal, team can provide milestones and detailed roadmap for three, six, and twelve months so that it can shows the community about their project planning.", "q1r": 4, "q2": "Team will use cardano mainnet for issuing the verifiable credential that will make it open to public to audit. Problem statement and solution delivered match and address both the challenge effectively. Success criteria are relevant and feasible, making it not only auditable but also realistic. I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "Students who receive good guidance will drop out less at school and this is a very important goal to aim for. Dropping out of school is not always the responsibility of the student and is caused by many environmental factors that the student does not always have control over. Personal and digital guidance can offer a lot of value to the student here. It is very important that everyone has maximum opportunities to obtain a certificate according to his or her own talents. This has a very sustainable impact on society in the long term.", "q0r": 5, "q1": "The project still needs to take shape, a call is being made to a developer, so they already know what expertise they lack in the project team and are actively looking for this. The project is well substantiated with relevant literature and information.", "q1r": 4, "q2": "Under the heading measurability you can find the substantiation of the project again, a little further on I find the timeline and budget allocation.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "After communicating with the proposal team member, I believe their proposed implementation of giving students ownership rights of their educational identity (DID) in their project effectively addresses the challenge. The above proposal details could use some of the project's implementation overview on a high level. This way the Social Lab's team can clearly communicate this integration to the Catalyst  audience. Such a solution will use Atala Prism as an integral component that brings more utility and adoption to the Cardano blockchain. ", "q0r": 4, "q1": "I think the team is highly capable of executing this implementation.  They already have an MVP which speaks to their dedication, experience, and hard work. ", "q1r": 5, "q2": "Given the cost breakdown and the attached deliverables for each respective items, auditing for success or failure can easily be done. ", "q2r": 5, "assessor": "z_assessor_841", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "We will provide an AI mentoring as an on demand service, and deliver real-life pathway solutions to reduce dropout rates across countries.", "experience": "The team holds +50 years of combined experience in startup, development, education, mentoring, and guiding youth to a successful career."}