{"id": 381642, "author": "pace", "title": "PACE: Community credentials 2", "url": "https://cardano.ideascale.com/a/dtd/381642-48088", "category": 26254, "amount": 18200, "description": "There is a lack of bottoms up community focussed credentials that help with both the adoption and education of Atala PRISM", "funded": 2, "upvotes": 158968316, "downvotes": 2019465, "votes_result": 156948851, "votes_cast": 658, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "It can't be underestimated the value and scaling that could be provided by adopting DID and VC in the Catalyst community.  The vast amount of information one encounters when coming upon Project Catalyst in the wild can be overwhelming, and since its inception it has been the people in the community who have made the difference between being bewildered and intimidated or empowered and oriented.  Adding DIDs and VCs to the community creates both an element of curation (which CAs are giving excellent assessments, which proposal mentors help the most proposals get funded, who hosts the most regular swarms, or is most active within the community?) but begins the process of involving the community directly in the tech that underlies so much of the growth that awaits Cardano.  With that involvement comes better understanding, which informs better proposals, better assessments and ultimately better projects running throughout the ecosystem.  The end goals, which include Catalyst community DID wallets and native rewards systems, offer a glimpse of the kinds of systems we would like to see running on Ada all over the world.  They can and should be born here.", "q0r": 5, "q1": "The team assembled for this proposal could not be better situated to take it on:  they are funded developers across two initiatives (PACE and Gimbalabs) and are part of AtalaPRISMs pioneer program, a collaborative effort to collate resources, speed development and reduce waste among active AP developers.  The budget under consideration has reasonable hourly rates and a reasonable number of hours to complete.  However, the roadmap as presented could use more granularity in regards to steps taken to deliver the suggested KPIs (credentials issued/unique IDs) such as how many DIDs are desired for the test group, and what assessments drive the eventual rollout to the community.  The delivery of previous tools is a good indicator that this development-heavy team can execute.", "q1r": 5, "q2": "The team gives comprehensive details regarding auditability, including already existing links to their github and the progress of projects commencing thereon. They also maintain a Notions page tracking weekly developments and have suggested recording their development meetings and presenting them to the public (is this a threat?).  The Opensource nature of the project adds a further level of confidence, as any code forks can be followed as well, measuring their impact on the overall AtalaPRISM DID ecosystem.  Any time spent in the developer ecosystem, or in the Catalyst media channels and you will run across one or more members of the team, and they are friendly and accessible, and very excited about Cardano.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Yes! Hits the nail on the head solving the challenge! Provides huge value-addition to the Catalyst Community and fulfills the promise of Atala PRISM.", "q0r": 5, "q1": "Looking forward to see the PACE / Gimbalabs collaboration - both consisting of amazing individuals who are known as pillars of success in the community.\r\n\r\nThe plan is just amazing! I love the way how the deliverable is not decided by the team but there are use case options that the community can then choose from. Brilliant!", "q1r": 5, "q2": "The proposers have identified important issue(s) and created a clear solution to bring Atala PRISM to benefit the Catalyst community.\r\n\r\nSuperb ways to increase auditability and transparency. Well done!", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 24, "ne": 3, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. With the lack of community credentials the proposal identifies an important problem in the challenge that needs to be adressed. The solution seems beneficial to the Cardano ecosystem and to Project catalyst and the DID specifically. It is explained comprehensibly and matches the Key Metrics of the challenge well. Scalability should be provided considering the makeup of the system planned.", "q0r": 5, "q1": "Gimbalabs are well-known and networked in the community and the plan shows they are up for the challenge. The proposers know the type of partners required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every relevant detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics, KPIs and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 6, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Community project based learning exercises for a bottoms up approach to implementing, learning about and using verifiable credentials", "experience": "PACE team funded from fund 6 Atala PRISM challenge, Gimbalabs community for project based learning and Atala PRISM pioneer contributors"}