{"id": 381645, "author": "pace", "title": "PACE: Skills credentials", "url": "https://cardano.ideascale.com/a/dtd/381645-48088", "category": 26254, "amount": 24500, "description": "There is a lack of verifiable credentials that allow people to verify their skills and showcase them to the Cardano community", "funded": 2, "upvotes": 88653550, "downvotes": 3165549, "votes_result": 85488001, "votes_cast": 335, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=20787"], "media": [], "f6_assessments": [{"q0": "I was aware of the PACE Fund 6 proposal but didn't assess it. However I assessed the Universal Skills Authentication proposal and thought they were a good pair and should collaborate so I'm so glad to read this Fund 7 project that merges the ambitions and expertise of the two teams. And to both focus on ATALA Prism qualifications as the first instance is a polygamy that anyone from Utah would be proud of hence I completely agree that this proposal effectively addresses the challenge. My background in university management (assessing systems and services tenders) provided me an insight to the UniSkillsAuth proposal which I shared in my assessment, given so many Blue Chip, non-blockchain organisations like PeopleSoft have attempted to accomplish what LearnerShape proposed to do with ATALA Prism. And to also partner with Gimbalabs and Atala pioneers almost makes this a project that IOHK should have planned themselves.", "q0r": 5, "q1": "The proposing team consists of two previously funded Catalyst projects who have established their experiences in their relevant fields. They have craftily added evidence of & links to prior work and works-in-progress to show they can execute a plan. This proposal is somewhat grander than their prior efforts and includes additional team members and it is reflected in the way they described how this project will be approached via the listing of the development steps, the milestones and timelines for each aspect of the journey, the hours devoted by each participant and the KPIs to measure progress. The budget is also acceptable and if this becomes the first deployed qualification on ATALA Prism, then it' will be a resounding success bought very cheaply.  Overall it provides great clarity of execution and I agree that this proposal can be impelled successfully.", "q1r": 5, "q2": "I made the assumption that the journey of this project will be tracked on resources currently utilised by their Fund 6 efforts namely, Github, gitbook and a specific Notion site. This will provide traceability of the work as it progresses. Gimbalabs also has an open discord channel where questions on how the project is going can be posted by the CardanoCommunity. But ultimately, when ATALA Prism is finally released, it will be the qualifications of the Atala Prism pioneers proudly added to their personal DIDs which will measure success. Overall, there's a lot in this proposal that meets all the criteria set by a former tender assessor that I can agree this is a very auditable venture. Good luck to you", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The team clearly defines and indicates but also provides a solution to the current problem. This proposition is a continuation of the two proposals that were funded in the Catalyst F6 and will definitely give a positive impact on the Cardano ecosystem. Even with what has been done so far, gives the Cardano ecosystem value and when this part of the project is over, it will be great! The team presented the KPIs clearly and visibly and fully resonates with the challenge. This team is very professional and knows what they are doing. This proposal is able to scale future challenges and the whole team knows the problems very well and offers concrete solutions.", "q0r": 5, "q1": "The team has provided all the necessary information to facilitate insight into Feasibility. There is a link from Discord where anyone can join the community also in the proposal we can find a link to a website that gives us a clear insight into the team and gives us confidence that the team has the skills and experience and that eventually this project will be realized. We can easily see that this is a well-coordinated team of people who show their work transparently. The budget is reasonable to achieve the set goals but it's not broken down into identifiable items. The total hourly rate and hourly wage were written. It would be good to see a little more detailed view of how the funds would be allocated. The team does not require additional funds, so a verifiable plan is not required. The proposal lists the development steps through which we can see a detailed implementable plan. Very professional approach and transparency. Without exaggeration in the proposal we can fully find all the necessary parameters that clearly explains the technical aspects like architecture, language and technologies, all the resources necessary to implement the proposal. And yes, the time frame for the completion and full implementation of the project is clearly presented. In the proposal there is no mention of risks and thus the possibility of risk and how to deal with them if they show up.  ", "q1r": 4, "q2": "As I have already mentioned a couple of times, this is a professional team of people who have prepared well for this proposal. The roadmap with milestones and a time horizon for achievement and KPIs is clearly explained. A link from Gitbook has been set up so that everything is transparent and the community can track the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "PACE has another Fund7 proposal that reads very similar to this one, so it should be understood what the difference is:  Community Credentials is a problem seeking proof of concept verification that could be rolled out synergistically with this proposal, Skills Credentials, which seeks to collaborate with LearnerShape to launch an AI guided PILOT for verifying (VC) a community cohort with a specific skill credential (AtalaPRISM SDK is the low hanging fruit here, but a Plutus credential is a darkhorse candidate...my money is on the SDK).  I'll repeat my impact assessment from the Community Credentials proposal:  this VC/DID proposal has the potential to be a HUGE boost to Cardano adoption as the possibility for this kind of verification becomes an expectation for this kind of verification.  Factor in the downstream effects of creating better proposals (with credentialing of team members), better assessments of risk and benefit and ultimately better projects rolling out in the Cardano ecosystem, and this is a priority project for this community.", "q0r": 5, "q1": "With two funded proposals from Fund6 this project is already off and running.  They have included a decent roadmap and timeline, which, while it could have included a more granular breakdown of the first three months of the project, includes detailed milestones for the Development process itself.  The budget is a 6-month budget and does not give any indication that it expects to pursue more funding for this portion of the project (expect that, with success, a much larger cohort can be adopted for Fund8, effectively beginning the process of onboarding huge swaths of the community in each fund --and the use cases are endless--).", "q1r": 5, "q2": "The team gives comprehensive details regarding auditability, including already existing links to their github and the progress of projects commencing thereon. They also maintain a Notions page tracking weekly developments and have suggested recording their development meetings and presenting them to the public. The Opensource nature of the project adds a further level of confidence, as any code forks can be followed as well, measuring their impact on the overall AtalaPRISM DID ecosystem. Any time spent in the developer ecosystem, or in the Catalyst media channels and you will run across one or more members of the team, and they are friendly and accessible, and very excited about Cardano.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The Atala opens up possibilities to certify a person in a decentralized manner. The Gimbal labs initiative to organize project-based learning and skill development is unique and produces trained developer resources for the Cardano community. This certification initiative will add credibility and encourage the hiring of talented people in a confident manner. ", "q0r": 5, "q1": "The proposers are a strong team of community contributors I am seeing for the last year their initiatives in training and onboarding people in Cardano have been very good. With this background, I believe they will be able to complete the proposed tasks. ", "q1r": 4, "q2": "The fund is for evolving and issuing credentials to people who had contributed to the open-source training material and code. The KPIs are fairly clear and measurable. The success is slightly difficult to measure however the fund requested is very reasonable and has been justified with solid rationale. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}], "solution": "Integrate LearnerShape's skills authentication solution to help the community build reputation using Atala PRISM", "experience": "Two Atala PRISM funded cohort teams, Gimbalabs community for project based learning and Atala PRISM pioneer contributors"}