{"id": 381953, "author": "rodolfo.miranda", "title": "Hyperledger-Prism Interoperability", "url": "https://cardano.ideascale.com/a/dtd/381953-48088", "category": 26254, "amount": 30000, "description": "How can Atala Prism exchange credentials with Hyperledger Indy where most of the credentials reside?", "funded": 2, "upvotes": 119806113, "downvotes": 2515121, "votes_result": 117290992, "votes_cast": 426, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "Wow, what a well-written proposal. This speaks well of the proposer, his vision and his ability to conceptualize the problem and the solution. Speaking about the problem statement - bang! This proposal goes directly for interoperability with Hyperledger Indy in order to open doors for the expansion of the Cardano network in terms of interacting with the Hyperledger Indy ecosystem. This challenge does ask proposers to think how can Atala Prism exchange credentials with Hyperledger Indy (due to its significance in terms of use for credentials) - and the proposer delivers a  solution that will provide an open-source code to give Atala Prism two layers of interoperability with that framework. In terms of impact - great. In terms of implementation vision for the proposal - even better. The plan is detailed, the solution seems spot on, the key metrics of the proposal align with the outlined challenge settings. I've been a CA and vCA since the start of Catalyst and have never skipped contributing my 5 cents in a funding round. This ranks among the best written proposals and its deliverables (the  DIDComm v1 communication layer and the Mapping mechanism to convert Verifiable Credentials both ways) are well defined and will allow the exchange of credentials between Atala Prism with Hyperledger Indy, while remaining flexible for implementers.", "q0r": 5, "q1": "In terms of feasibility, this proposer leaves nothing to the imagination. I mean, skills are there and documented, experience is there and documented, the budget is reasonable and broken down into components, a timeline for delivering the proposed solutions is given. The proposer goes well into detail to clarify the technical aspects of his proposal and does it in a stellar fashion. I especially comment the proposer for going into a risk assessment and making it public. The proposer states that during the developing of this proposal, two concerns/risks (1. can enough time be allocated to the development? and 2. can cope with the technological challenge?) were identified and came up with mitigation plans in case it is needed. Aside from those two risks, I see a third risk - that the proposal might slip under the radar and not be funded. OK, lightness aside - its a five-star proposal. \r\n", "q1r": 5, "q2": "Auditing and clarity. The \"Transparency Twins\". Will they enjoy this proposal? The proposer suggests to use Agile management based on Jira Cloud tools for implementation, plus he states that additionally, a bi-weekly report will be published with project progress, major milestones and risk assessment. Risk for the community - addressed. The team proposes that \"as a commitment to the transparency of the allocated funds, we expect payments based on above deliverables without the need of advance payments.\" Furthermore, intermediate progress will be reported as Sprint Burndown, a KPI metric that shows the progres of each development sprint. Additionally, the development will be managed in a public github repository where periodic commits will be pushed and that allow the community to audit and validate the work. OK, I rest my case. The Transparency Twins love it. \r\n", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identify the problem of Atala Prism adoption and interoperability. They will ad value to the Cardano ecosystem by making Atala Prism interoperable with Hyperledger Indy which in turn will connect Atala and Cardano to an already huge existing working product. The metrics of the proposal is aligned with the challenge in the sense of onboarding more people to build on Atala Prism. This project is able to scale well, because it will be open source.", "q0r": 5, "q1": "The relevant experience is provided via LinkedIn page. The budget is broken down into 2 parts of the project that needs to be finished with reasonable time dedicated to each part. He explains in detail how the product will be interoperable with Hyperledger and even goes into some technical details explaining how different parts of the product will function. He considered risks and provided ways to mitigate them. ", "q1r": 5, "q2": "Th roadmap provided is split into  2 items that needs to  be built. Each one with their own timeslot.  Tracking the progress of this project will be easy as he states he will provide weekly reports. There is no user based KPIs so it will be hard to track the performance of this project. You can ad Github downloads as a KPI, that way people can see if your product  is being used. He identifies the problem of Atala Prism needing adoption and interoperability with existing products and solves this by providing open-source code to give Atala Prism two layers of interoperability with Hyperledger Indy. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 3, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "Hyperledger Indy's importance is outlined in the proposer's problem statement. It is the work of the the Linux Foundation and as such has proven history of quality open development. Bring interoperability between Hyperledger Indy and Atala Prism is the goal and the problem this proposal is looking to solve.\r\n\r\nThe project, if successful, will certainly help Accelerate Decentralized Identity by offering the opportunity to communicate with existing Hyperledger interactivity deployed on Sovrin, a well established service allowing used by companies and government departments.\r\n\r\nThey propose to bring a layer 1 solution by offering communication by porting the existing open source tool Hyperledger Aries into an Atala Prism Agent.\r\n\r\nThey are further offering a Layer 2 solution in the form of two way communication that will map credentials on the two platforms, Atala Prism and Hyperledger Aries.\r\n\r\nAll development will be open source allowing others to build on and further develop the solutions. \r\n\r\n", "q0r": 5, "q1": "The proposer clearly has deep knowledge and the skills required to execute this project. They have indicated that additional developmental resource can be included if required. A more detailed split of the budget would be helpful, it is given as estimate $10k per month and three months of work. The developer knows his costs and as it's a personal project is able to budget the time and cost effectively.\r\n\r\nTechnical details have been provided with reference to the existing technologies that the project plans to connect with. Potential risks have been identified.\r\n", "q1r": 4, "q2": "Github will be used as a repository so interested parties will be able to track and inspect commits through out the development of this project. Further, Jira Cloud tools will be used and an Agile workflow tracked using this tool. Although a the details have not been broken down the use of Sprint Burndowns is a well known development process and able to be easily tracked once the project starts.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_209", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Providing Atala Prism with two interoperability layers  with Hyperledger Aries: DIDComm communication protocol and credential mapping.", "experience": "Strong academics and 25+ years of proven experience in architecting and developing software solutions. Developed sidetree-cardano in Fund 6"}