{"id": 382666, "author": "gabrielaxel", "title": "Edu-to-action DAO squads", "url": "https://cardano.ideascale.com/a/dtd/382666-48088", "category": 26254, "amount": 89700, "description": "Education should be flexible, adaptable to present global needs. However, TradEdu is career-static & skills can quickly become obsolete.", "funded": 1, "upvotes": 36187863, "downvotes": 13990388, "votes_result": 22197475, "votes_cast": 124, "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Education project using accelerate Decentralized Identity is a great way to contribute to change the world. The proposal points out the limitations of traditional education which is still widely used today. And from there, propose changes and improvements, based on the combination of using blockchain technology. It can be said that changing learning methods will change people, changing people means changing the world. Especially with the current situation, there have been many improvements in technology around the world but there have not been many significant changes in education.", "q0r": 5, "q1": "The team consists of people with relevant and reliable experience in their field. The vision is clear and the project is well-planed: The proposal includes detail roadmap and present activities in each phase carefully. There is also risk analysis and risk milligation, this helps the team have a better ability to react to unexpected bad things.", "q1r": 5, "q2": "The proposal include KPIs and Proof-of-concept milestones/deliverables. So their activities will be transpare", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Proposal aims to pilot a DID system of accrediting users capabilities and providing access to squads to develop users abilities around key global issues/threats. Potential impact/vision beyond the Cardano/Atala PRISM ecosystem is pretty impressive and I hope some/all of this can be realised along with providing value within this ecosystem. It does have a ready made trial use case through partner organisation WSS and DAOJob but as mentioned by an IOHK commenter, more detailed on potentially repeatable code patterns or primitives and outputs useable by the rest of the Atala PRISM community would be useful.", "q0r": 4, "q1": "Proposal team appear to be well qualified for this proposal, have a ready to go trial use case for the pilot and appropriate partner organisations on board. Additional support through Canvas will aid developers. \r\n3 month targets within this proposal are achievable and 12 month road map also seems reasonable. Budget seems sufficient to achieve desired outcomes. Proposer has assured that 2nd implementation pilot (DAOJob) is not dependant on successful Catalyst funding which helps de-risk potential pilot programmes. \r\nIt should be noted that desired funding represents just over 20% of the total budget for this campaign.", "q1r": 4, "q2": "KPIs are provided and are appropriate for measuring the success of the pilot. \r\nDeliverables for the 3 month period this proposal covers are also provided although some are not explicitly quantified, e.g \"Most major learning stages assigned VCs\"\r\n", "q2r": 4, "assessor": "z_assessor_902", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is a bit confusing. At first, the proponent starts by contextualizing a problem situation focused on education, which then covers several problems of the current world: \"for example, global inequalities, poverty, polarization, climate change, uncontrolled AI\"... He intends to create a team focused on solving each of these problems, which would be linked together with a greater objective. Theoretically this is great, but in practice, it is somewhat utopian, in my opinion. The rationale here on how all of this would relate to the Cardano blockchain would be that the entire community would be a DAO (World Systems Solutions), and each subgroup would form a smaller DAO. Smart contracts and DIDs would also be used here. This is where the challenge objectives come in. According to the proponent, each user here would have their own DID. This would correspond very well to what we were looking for in the challenge, because it would certainly generate new users. The problem, in my view, is precisely that this project is something extremely broad and complex, I would say quite ambitious, and that would be built from scratch. A high amount (89k) is requested as funding and we have no guarantee that this DAO would be successful, this seems to me to be a case where the proposer promises many things, very different things, where there is a chance of success but because it is somewhat how confusing and demanding a lot of people and activities there are also high chances of not working. Therefore, I believe that the intention is good, but it does not give me much confidence.", "q0r": 2, "q1": "We know who the team leader is (Gabriel Axel Montes, Ph.D). We have a very satisfactory level of information about who he is, what his background is and where he works, however, no matter how complete his curriculum is, no relationship is determined between him and the Cardano ecosystem. It is also unclear who the other team members would be. As I said about impact, it is a very ambitious proposal that requires a large number of people involved and activities to be carried out. Who would be the other professionals working here? It would be necessary for us to know their names, functions and relationship with the Cardano ecosystem. As much as the author claims to have a partnership with the PATHFORM organization, I don't feel much confidence in the team, precisely because I don't know other names besides Gabriel. About the script, the activities to be carried out in the periods of 3, 6 and 12 months are defined. However, it is necessary for us to have more detail and a shorter temporal division, that is, perhaps monthly (even weekly), precisely because, I repeat, it is a complex project that involves a lot. In the way it is presented to us, we can indeed understand the process, but only partially. The more complex the proposal, the more detailed the script should be, in my opinion, and here that is not the case. And about the funding money, it would be positive if the author explained exactly the concept of Implementation (WSS) and Implementation (DAOJob); these are technologies not fully known to all CAs, and having an understanding of them would be crucial to fully understanding how this funding would be used. The rest of the money goes towards the developer and project manager salary; I believe the manager is Gabriel, but what about the developer? I would like this point also to be clarified. Unfortunately, the script is superficial, the explanation of the use of funding is also superficial and we cannot understand (and therefore trust) who are the people involved in the team.", "q1r": 2, "q2": "The proposal is quite auditable. The author dedicates a topic (landmarks/proof-of-concept products) especially focused on expected results, so we have a lot of material to monitor. We know what is expected according to the passage of time, however, how much time are we talking about? He divides these landmarks into \"mountains\". Would each mountain correspond to a quarter? This information is very important to understand what is expected and when. Some risks are also defined, which is always positive, because we know what kind of situation could be faced and with that we could monitor if they were properly circumvented/solved. Finally, the author informs us of specific KPIs, which together with the milestones and proofs of concept may serve as content to be verified (were these objectives achieved?). In other words, the auditability here is very good, what needs to be done is a direct contact between Gabriel and the Cardano community, in order to sporadically pass on such information.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 23, "ne": 9, "ng": 13, "nfo": 1, "vca_o": 1}], "solution": "A customizable education engine that matches action-steps to learning stage, & forms DAO squads of complementary workers for projects.", "experience": "PhD in human cognition and blockchain/AI ethics, worked w/ SingularityNET, created new governance approaches, partners with WSS (attached)."}