{"id": 383348, "author": "jochen.leinberger", "title": "Open Source Identity Wallet", "url": "https://cardano.ideascale.com/a/dtd/383348-48088", "category": 26254, "amount": 47500, "description": "The Cardano Ecosystem is missing an open source wallet which is capable to handle Digital Identities.", "funded": 1, "upvotes": 29852643, "downvotes": 10779773, "votes_result": 19072870, "votes_cast": 176, "f6_no_assessments": 4, "f6_rating": 3.9166666666666665, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=14930"], "media": [], "f6_assessments": [{"q0": "Impact:\r\nThe Problem statement:\r\nThe Open-Source Identity Wallet offers a way to Accelerate Cardano's Decentralized Identity landscape by solving the problem of not having an Open-Source Wallet that can handle Decentralized IDs (DIDs) and Verifiable Credentials. \r\nA clearly defined goal:\r\nThe proposers plan to develop Open-source libraries for components needed to develop identity wallets on the major platforms.  They plan to develop these libraries for Web Browsers via plugins, iOS platform and the Android platform.  The plan is to use the C language for use in Android and iOS as well as Web Assembly virtual machine (WASM).  Implementation of C libraries for use in WASM is of particular interest due to its functionality. WASM stack machines are efficient and fast as they can potentially execute at native seed by taking advantage of platform's common hardware capabilities.  They are safe in that they can be implemented in a sandboxed environment inside existing JavaScript virtual machines.  WASM libraries can enforce the same-origin and permission security policies of the browser when embedded in the web. \r\nWith each implementation covering Client Side, Read/Write Encrypted Data, Agent Layer and a Thin UI layer, this proposal seems poised to create a much-needed solution to one of the eco-system's biggest problems of mass adoption.  Creating a robust backend that will allow a strong UX layer that is safe and easy to use will go a long way towards mass adoption of the Cardano eco-system. \r\nThe project is positioned to create building blocks and Libraries wrapped together under a light UI Layer using Hyperledger Indy Wallet Components as reference and as such, will achieve interoperability.  This interoperability will allow Cardano and Atala PRISM to interact with other eco-systems.  Some key characteristics of Hyperledger Indy include:\r\n1.\tDIDs that are globally unique and resolvable (via a ledger) without requiring any centralized resolution authority.\r\n2.\tPairwise Identifiers that can create secure, 1:1 relationships between any two entities.\r\n3.\tZero Knowledge Proofs that prove some or all of the data in a set of Claims is true without revealing any additional information, including the identity of the Prover.\r\nThe Open-Source Identity Wallet project seems to hit the target.  It is providing a solution to a very critical part of mass adoption by building the framework on which ease-of-use, secure, decentralized ID applications can bring the mainstream to the Cardano eco-system.  I strongly agree that this proposal meets the impact of the challenge. ASSESSMENT SCORE 5\r\n", "q0r": 5, "q1": "Feasibility:\r\nThe core ideas behind the Open-Source Identity Wallet appears to be backed by solid, developed, real-world resources.  \r\nAn Action Plan:\r\nThe project outlines success in a 3-month, 6-month, and 12-month road map.  The 3-Month milestone indicates a Detailed specification and API definition for the Wallet Components, including Wireframes as its deliverable.  It is notable that the API and wireframes for the wallet appears complete and is linked at https://github.com/IAMXID. The development team proves strong credibility by coming to the table with the 3 Month milestone already completed. \r\nThey plan to have the Reference implementation for Web, Android, and iOS ready at the 6-Month milestone.  \r\nThe 12-Month milestone of iOS/Android implementation, Source Code documentation with the Expected Launch date of 1/6/2022 really showcases this team's powerful march toward their ultimate goal. The project references using cross-platform technologies like Flutter.  Flutter is a real-world, robust, Google-based app development platform that delivers results and is well-suited for front-end development with awesome backend tie-ins. \r\nIllustration of the skill required to complete the project:\r\nThe development team consists of:\r\nJochen Leinberger:\r\nSpecialist for lean & user centric digital product development. UX Design & SW Development, Digital Product Development & Digital Product & Software Development at a German Car manufacturer. Former advanced projects at Deutsche Telekom new Products & Innovations Department Bonn (Smart Home, Entertain, Retail Solutions, Payment). Co Author of the book \"Prototyping Interfaces\".\r\n\r\nDennis Mittmann:\r\n20+ years of experience with high traffic web services in high availability environments and scalable real-time data services. Database Architect, Payment-Systems, Statistics\r\n5+ years Tech Lead Database Developer, 8+ years Team Lead Web Developer, Blockchain since 2011\r\nJoseph Frankiewicz\r\nSoftware architect and mobile app developer with ~20 years of development experience, focusing on front-end applications. Co-founder of the Cardano EAGLE pool. Developer of the Pool Peek mobile application, which allows users to view and select Cardano stake pools.\r\nTim Brückmann:\r\nArchitect of the team, MBA (marketing, controlling, economy East Asia), CMO handy.de, Co-Founder and stakepool operator of StakeforFuture.org [AZUL], co-founder and former CEO of wunderwerk eco fashion & wunderwerk e-commerce, 25 years marketing and sales expertise, expert in sustainable lifestyle products, 10 years climbing partner of Jochen CTO, 25 years coop with Tim CEO, PADI Divemaster, winner Bundespreis ECOdesign, winner PETA award.\r\nTim Heidfeld:\r\nhas operational Know-how and strategic expertise from e-Commerce and electronics marketplaces Scout24, Allianz24, moneysupermarket.com, preis24.de, handy.de. Tim has a direct personal connection to the business cases and the telcos based on his operational work. His core competence is business development.\r\nThe Open-Source wallet team consists of a multi-varied team of several highly skilled members each with multiple years of experience in web development, database architecture, payment systems and software development.  \r\nA budget Breakdown:\r\nThe project appears to have made real-world headway with definite solutions to the stated problem and has a budget requirement breakdown that clearly delineates what is needed to move the project to the next level. \r\nWith its highly skilled team of developers and business leaders this project seems capable and positioned to accomplish its task of delivering a truly open-source Identity Wallet.  ASSESSMENT SCORE 5\r\n", "q1r": 5, "q2": "Auditability:\r\nHaving accomplished part of what they set out to achieve is a testament to this team's accomplishment.  \r\nI'm confident this team knows what its doing and can add value to the Cardano eco-system. This project's key performance indicators lie in their code linked on Github.com/IAMXID.  For people/voters not versed in coding, it could be difficult to tell what progress this team is making. I have no doubt that the project will achieve its stated goals however, more tools used, and a better description of the process used to develop the software could serve to give more insight into the progress of the program ultimately leading to the project being easier to follow outside of the development circles.  The project lacks good auditability and falls a bit short on specific key performance indicators that could help to track this project's progress and add to its overall transparency. ASSESSMENT SCORE 3.\r\n", "q2r": 3, "assessor": "z_assessor_479", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of Cardano ecosystem needing an open source wallet that can handle DIDs. They will ad value to the Cardano ecosystem by encouraging the integration of DID functionality in wallets. Paving the way for Dapps that needs DIDs. The metrics of this proposal is aligned with the Challenge in the sense of onboarding more DID use cases and users. The project is able to scale well because it will be an open source library.", "q0r": 5, "q1": "The relevant skills and team has been provided with a link to github page and links to other projects. The budget is broken down into identifiable items. Including the hours and rates per hour would be very informative instead of just one big amount for one task. The timetable of 12 months to complete this seems reasonable.  They explain all the functions this wallet will have and explains all the technical details on how they will build this in great detail. They haven't considered any risks or challenges. Not being aware  or prepared for risks can slow you down when they do surface.", "q1r": 4, "q2": "It is quite easy to track the progress of this project as the roadmap they provided shows different parts of the project being completed as milestones. They also consider this as their KPIs. They should ad more user based KPIs like pull requests or downloads to track the performance of the project post launch. They identify the problem of wallets needed to handle DIDs and they solve this by creating an open source library specifically for creating these kind of wallets.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to fill in a gap in the Atalia PRISM ecosystem by creating an open-source web based, Android and IOS wallet that supports DIDs and VCs. \tIf successful it should aid evolution of mass decentralized identity (DID) adoption specifically with Atalia PRISM.  However one comment pointed out it is nearly identical to https://cardano.ideascale.com/a/dtd/Open-Source-Credential-Wallet/382078-48088.  That proposal proposes a cross-platform wallet but it isn't clear it is Android / IOS so conceivably both projects can be useful additions. \r\n", "q0r": 4, "q1": "The expected launch date is listed as 1.6.2022 but this must be a typo given the 12 month development plan.  I suspect they meant 1.6.2023.  The team look like qualified application developers, yet don't mention the Alalia PRISM pioneer program participation.  The competing proposal listed in the Impact section has more breadth in demonstrating connections to the Atalia PRISM community and documentations.  The budget seems a little high but still within the realm of reason.  ", "q1r": 4, "q2": "The proposal lists milestones at 3, 6 and 12 months, however they are somewhat high-level.  More specifics would help the proposal.  Specific reporting on progress would be helpful.  \r\n", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal effectively responds to the challenge and is addressing a clear need in the ecosystem as DIDs cannot be used without the existence of a wallet to hold the issued Verified Credentials. The field is so broad, and there are so many different use cases, that the team's proposal to build a flexible and general tool that could be adapted by specific projects also makes sense. However, I am a bit confused regarding whether this proposal seeks to build a wallet that would for end-users (as seems to be implied in some sections) or a tool that would be used by other developers of wallets (as is implied in other sections).  As a result of this lack of clarity, I am struggling to identify the target audience for this wallet, and therefore to assess which community would benefit from its creation. Similarly, the proposal would be strengthened by references to other projects in the ecosystem, to give a clearer view of where this proposal would fit in. ", "q0r": 3, "q1": "The detailed experience listed for the team members is impressive, and clearly supports their ability to build the proposed software. While the introduction references experience in the Atala Prism Pioneer program, it is not clear which of the team members participated in the course. As participation in the course is essential in order to access the Atala PRISM SDK, more detail on this point would be useful. Additionally, while the proposal states that Joseph Frankeiewicz is a co-founder of the EAGLE pool and the developer of the Pool Peek app, none of the other team members appears to have experience in the Cardano ecosystem, as detailed in the proposal. Additionally, no links are available to public information about the team. From googling, I was able to find relatively clear evidence substantiating their experience, but next time around it might be helpful to make that info more explicit. Similarly, IAMX is sort-of referenced in the proposal, but not explained. By googling I was able to find the company's website and they appear to be engaged in very interesting work in the Carano ecosystem, and to be partnered with WADA, which is also a strong community within the eocosystem. More detail about IAMX, and particularly whether this wallet is directly related to that company would be very helpful. If the company is not at all related to the wallet project, then I would suggest removing the references to IAMX completely. ", "q1r": 4, "q2": "The proposal provides a roadmap, although the milestones are a bit vague and would benefit from more detail. There aren't any KPI metrics described. A glaring miss in the proposal is any reference to the fact that the Atala PRISM SDK is not yet final or public. It is not clear how they intend to build an Open-Source wallet when the SDK is not yet available to the public. Other proposers in this challenge have highlighted the PRISM SDK as a risk, and documented their plans to address. The team does reference the Hyperledger Indy SDK. While their familiarity with that material is good to know, it is even more confusing that the Hyperledger SDK's is cited while the proposal is completely silent on the PRISM SDK. It would also be very useful to understand why exactly the Indy SDK is a point of reference, and how it compares and contrasts to the approach taken by Cardano. ", "q2r": 2, "assessor": "z_assessor_662", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1, "reply": "As Open Spource Project the KPI is in adoption of the proposed Wallet framework, something hard to measure in KPIs, as it might be in the Time beyond Wallet development.\n\nThe Scope of the project ist to deliver the main Buidling Blocks to develop an Identity Wallet. The Connectors to specific DID Methods as PRISM will be implmented when ready. \n\nBut Elemnts for storage, Key handling & communication etc. can allready be implemented - anyway it's better to start as people are teaming up to develop Identity Projects on Cardano, but are missing an Identity Wallet.\n\nIn my presentation I mentioned as well that IAMX will build a Wallet on top of the Open Source Wallet. But won't brand the open Source Wallet as it is meant to be a Boilerplate Identity Wallet for all Teams looking for a springboard to push the SSI ecosystem on Cardano forward."}], "solution": "Develop an Open Source Wallet which can handle DID's and VC's and provides a reference implementation as a springboard for new Projects.", "experience": "Software development (Frontend & Backend) & UX Design (20+ years). Plutus Pioneer and Atala Prism Pioneer."}