{"id": 384273, "author": "pxpepex", "title": "Verifiable Credentials Tree", "url": "https://cardano.ideascale.com/a/dtd/384273-48088", "category": 26254, "amount": 50000, "description": "The Portuguese fund distribution and assessment is a complicated process and lacks transparency from government and companies.", "funded": 0, "upvotes": 23310698, "downvotes": 7716414, "votes_result": 15594284, "votes_cast": 109, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem described is real, and not specific of the chosen country. It also seems like a good application of DiDs. \r\nGovernment spending in Portugal is just below 50% of GDP, so if just a tiny bit of this spending could be funneled trough the system, the potential target population is very large. Of course, if a functional product is delivered, it should be easy to extend it to other countries. ", "q0r": 5, "q1": "The overall proposer's project seems like a multi-year effort, and it's not immediately clear what part are the funds requested for.  Judging by the activities in the roadmap that are NOT labeled as \"partially funded by Fund 7\", and the deliverables, it seems like the funds are mainly for building a MVP. \r\n\r\nI'd say the whole project's feasibility is very low, due to goverment and financial institutions regulations, that proposers do not seem to identify or have experience in dealing with. However, the goals for this fund should be achievable, as they're using a reasonably common tech stack (i.e. it's feasible to find and hire developers) and ask for an appropiate budget for that. I'd have liked to have seen a better description of the MVP, the kind of fund unlocking mechanisms that would be available, etc. My personal impression is the proposers do not still have a clear idea of this, as it will be defined in the first phase of the project, but this ultimately affects feasibility. \r\n", "q1r": 3, "q2": "There are three deliverables: \r\n* A framework for verifying a credential tree\r\n* A backend for off-chain data: fund distribution and issuers\r\n* A \"frontend [...] which will allow all the users [...] to interact with our solution\".\r\nThe frontend is what would ultimately be the best measure of the progress, but the description is quite vague, will this be just a tool to view the credentials tree? manage off-chain data? allow users to issue credentials? allow unlocking of funds?\r\n\r\nIf the proposal is not successful, for future Catalyst Funds I'd suggest to focus on the parts the funding is requested for, and provide a more detailed description of the functionalities that will actually be delivered.", "q2r": 3, "assessor": "z_assessor_941", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Great proposal. Excellent idea. Especially with your intention to open source the code, a verifiable credential tree/graph has implement in a wide range of top down or waterfall information or value flow context. On that specific point, this should perhaps have been the entire proposal, posted in the \"Open Source Developer Ecosystem\" challenge. As a candidate in the Accelerate Decentralized Identity challenge, the proposal does not speak concretely about how their codebase will perpetuate acceleration. More details about existing connections within the Portuguese government would go a long way convincing the voter that a high ROI (return on intention) for this proposal. IOG and the Cardano foundation have spent years lobbying and negotiating with government and financial entities with mixed results (although increasing successes). What clout does the team possess to cut through the bureaucracies? How does the team plan to set traditional banker fears about crypto at ease? What incentives does the bank have to make switch? I know the english adage of if you build it they will come have proven to be true more times than false, in the niche of legacy bank and governing structures however, this adage quickly loses most if not all mass.", "q0r": 3, "q1": "Given experience and plan presented it is highly likely this proposal will produce a codebase. Given the lack of financial (neither team member have worked at a bank) and governing experience, it seems less likely the product of this proposal will implemented by banks or adopted by Government Departments. As Talkdesk is a not a blockchain company, it's unclear how the team is planning acquire the skills needed to later move the \"legacy part to Cardano smart contracts and side-chains to keep all the information trackable.\" Is this perhaps a different proposal? Will the neccessary skills be developed? Is there a plan to hire smart contract skillspeople? The budget plan to hire 2x Software engineer for six months it seems would only cover the offchain kotlin and mobile apps work.", "q1r": 3, "q2": "the roadmap, public launch date, and budget are all working in concert to provide the community plenty of metrics to audit the progress of the proposal. Adoption and usage metrics however is lacking. It seems like the definition of success usage metrics only come into play in Q3 and Q4, both eras of the projects only partially covered by this proposal with Q4 not being covered at all, another support the suggestion that this should be in the Open Source Developer Ecosystem challenge. ", "q2r": 3, "assessor": "z_assessor_336", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "A working proof of concept (and planned to be open sourced) with the university partner would be a great building block for success for the application of this idea in many similar use cases. \r\nThe planed use case with the Portuguese government, could bring high volume/value of transactions to the Cardano ecosystem when funds are distributed. \r\nProject milestones are sensible but specific KPIs are not given or linked to campaign KPIs.", "q0r": 4, "q1": "Team has relevant technical experience and experience of financial management in large companies, likely to have the connections required to run a successful pilot and propose project to Governmental organisations.\r\nEffort planned and budgeted seem sensible for the planned outcome.  \r\nAdditional staff needed, presumably recruitment is required so possible risk to timescales due to that.", "q1r": 4, "q2": "Milestones and roadmap defined and capture success of the project. Audit may be improved if more granular milestones are added.", "q2r": 4, "assessor": "z_assessor_902", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "Creating a verifiable credential tree for Portuguese government fund distribution to ensure the right to redeem the funds.", "experience": "Lead Software Engineer, Plutus Pioneer, Atala PRISM Pioneer, Emurgo Cardano Architecture and Design Developer Professional"}