{"id": 384375, "author": "heinz.gassner", "title": "DID Application Blueprint", "url": "https://cardano.ideascale.com/a/dtd/384375-48088", "category": 26254, "amount": 25000, "description": "DID projects often jump early into programming solutions, without having sufficiently focused on a rock-solid underlaying architecture", "funded": 2, "upvotes": 89464602, "downvotes": 1829672, "votes_result": 87634930, "votes_cast": 334, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "Yes, the proposal effectively addresses the challenge. I appreciate that, like Cardano, the team is taking a slow, foundation-building approach to accelerate the adoption of DIDs. A common use blueprint that is open to be adapted across a broad range of applications and products could provide an excellent tool for new and experienced developers alike. The proposers have also done this dance before; the proposal is written to clearly identify the scoring criteria and ticks all the boxes. By breaking down the sections into impact, feasibility, and auditability, CAs and voters alike are not left to determine what the expected outcomes will be. This provides extra assurances to me that the impact will be what is written as the team shows they have thought through their issues, the possible challenges, and identified mitigation measures.", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely that this proposal will be implemented successfully. What I value most about this proposal is its integration with several other components of the Cardano Community. The plan is very well laid out with clear expectations and deliverables throughout. By taking the time to position this proposal vis-à-vis the team's fund6 proposal, and the other ongoing work within the Atala Prism space, the team clearly identifies why they are different and how they will fill in a gap within the ecosystem. The roadmap, timeline, and deliverables all seem reasonable and to fit nicely with in the larger DLT-360 project. As a CA, I am grateful for the team including specifics and links to their credentials, since the community can vet them prior to voting. This is something all proposals should do and it bodes well for implementation based on their track record. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The team does an excellent job laying out the current problem, presenting their solution, and articulating what steps, and at what intervals the work will be completed. In addition, the team explicitly states their \"on-demand Miro deep dives\" that can be requested by any community members to get a deeper understanding of the project, progress, and next steps. Personally, this type of openness can give voters confidence that there are opportunities for community input. Moreover, as members of the Catalyst Coordinators cohort that helps funded proposers report and follow up on progress, community members can also feel assured that they will be able to track and engage on the project in an open and transparent manner. Congrats to the team and I look forward to the results. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies a valid problem regarding DID: the fact that ist underlying architecture needs both a more solid foundation and understanding among developers. I think this is a very valid critique that needs to be adressed, which is done so with this proposal in a competent and beneficial manner. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The proposal aims to build a blueprint for DID application, which is perfectly in accordance with the challenge and has a large impact potential. It will definitely speed up and accelerate the DID adaptation and having such a feature for other new projects can increase the overall quality of the future DID projects. ", "q0r": 5, "q1": "The information in the proposal is sufficient to assess, that the team poses the required skill and experience relevant to their goal. The linked in links are provided, and they are previously funded team, which increases their creditability. The roadmap is provided in a very detailed way along with the cost breakdown supporting the total amount, which is reasonable. ", "q1r": 5, "q2": "Even tough the first KPI seems hard to measure, the rest is very well described, along with the problem-solution. The roadmap would require a more detail e.g. terms such as \"basic research\" can cover a lot, and it is estimated for three months. Overall, these are just tiny parts that seems slightly off, but I do not find it enough for a lower score. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 20, "ne": 0, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "The proposal hopes to build a DID blueprint that will aid in interoperability between DID projects. This fits well into the goals of the challenge. ", "q0r": 5, "q1": "The team received funding in fund6 and have a wide range of experience, although not specific to blockchain. They will outsource expertise on DID from IOHK and other experienced groups. Because this is a highly technical subject I find it difficult to estimate their ability to succeed and have given a neutral rating. ", "q1r": 3, "q2": "Road map and KPIs are somewhat subjective but do provide measurable metrics. Funds are not broken down but the amount is modest.", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 23, "ne": 1, "ng": 16, "nfo": 6, "vca_o": 1}], "solution": "With this proposal we want to deep-dive and establish a solid interoperable architecture Blueprint for DApps building upon Atala PRISM DID", "experience": "More than 30 years of industry-leadership experience combined with direct access to specific domain experts"}