{"id": 384629, "author": "nftdao", "title": "DID for the Masses", "url": "https://cardano.ideascale.com/a/dtd/384629-48088", "category": 26254, "amount": 68000, "description": "Atala PRISM DID as a gateway to the Cardano blockchain & ecosystem, requires use cases to enable market penetration besides just government.", "funded": 1, "upvotes": 41533518, "downvotes": 12699369, "votes_result": 28834149, "votes_cast": 178, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "As presented, this proposal adequately addresses the challenge and could potentially have a large impact. However, the proposal could be developed further to explain how they will gain access to the markets and sectors (commissioned work) and what thinking they have already done towards achieving it. The proposers also go on to mention that one of their targets is scholarships and internships but I fail to see how this connects to commissioned work? The use of the NFT-DAO is unique but I am not sure why this component isn't further explained throughout. How would the DIDs be integrated? How would the interoperability with existing systems work? It is clear that the idea behind this proposal is strong and definitely would help accelerate the adoption of digital identities, but in order to get full points more specifics are needed. ", "q0r": 4, "q1": "Yes, given the experience and plan it is likely this proposal will be implemented successfully. It is clear that the team has taken the first steps by creating their DAO and its legal foundation under US Law. The credentials of the team can give voters confidence that they do in fact have the capacity to deliver. Being plutus pioneers, the Beefchain founder, and the other credentials listed definitely inspire confidence. \r\nThe plan and roadmap are well laid out with a nice breakdown of the budget for completing the work. As mentioned above, I still would desire some more information to give full points on this section as well. I appreciate the identification of different sectors for potential use cases but this could likely be further developed. For the risk assessments i would have appreciated more details on what challenges may arise from participant engagement strategy. What are the concerns around interoperability? What have been the preliminary reactions from groups/entities that you have approached to work with? Filling these details out would inspire additional confidence for voters. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. I really appreciate any project that commits to making their material open source and exposing themselves to community scrutiny. This is something we pride ourselves on as a Cardano Community and I am grateful to see it here also. The publishing of reports for the community which outline progress, milestones, and risk assessments can give voters full confidence that they will be able to audit the proposal. Given the transparency presented throughout the proposal and the proof of track record from the team (as visible and active community members) full marks for auditability. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal aims to bring in tens of millions of users.  If successful it would be a great boon to acceptance of Atalia PRISM.  \r\n", "q0r": 5, "q1": "The proposal references a market of $54.5B a year - but it isn't clear what commissions this is referring to.  Success may suffer from the chicken and the egg problem that plagues all DID and VC efforts.  The project promises to add large numbers of new users but doesn't have any marketing component listed.  How these large numbers of new users will be acquired is unclear.  The proposal appropriately recognizes the risk of the Atalia PRISM SDK being incomplete and changeable during development. \r\n", "q1r": 3, "q2": "The proposal adequately describes a path to successful auditability with regards to the application development, but doesn't have KPIs related to adoption. \t", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is well placed in the challenge and aims to accelerate adoption through DIDs, However it is slightly unclear what exact sector they are targeting and where exactly is the entry point into the decentralised  Identity problem and how they plan to achieve this. Therefore I agree but would like to see a clear explanation of the solution.", "q0r": 4, "q1": "The team seams to hold the requisite knowledge and experience to implement the proposal however it would be good to have links to prove this.The funds requested are well broken down but the timeframe is hard to determine as the is no clear outlook other than a simple SSI system in place. It is great to see possible challenge/failure points listed in terms of delay on the Prism SDK.", "q1r": 4, "q2": "It is stated that KPIs will be provided during performance reviews of each sprint but none are listed and so it is impossible to evaluate the audibility of the project. ", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does address the goals of the DID mass adoption challenge. With DIDs used in combination with NFT DOA this could significantly grow adoption.", "q0r": 5, "q1": "This is a strong team that has very relevant experience in the blockchain space. I believe the team has the experience to delivery on the project goals.", "q1r": 5, "q2": "Although detailed project goals with a timeline are provided I am unable to determine clear KPIs for this proposal.", "q2r": 3, "assessor": "z_assessor_977", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}], "solution": "Develop DID to deploy to a ready market of tens of millions who can bring $54B/yr volume to Cardano and can use the benefit DID can offer.", "experience": "3 Atala PRISM Pioneers, Beefchain Founder, NFTDAO Founders, enterprise architecture expertise, startup experience. We know the target market"}