{"id": 384812, "author": "iain.bell", "title": "Medical Industry Credential System", "url": "https://cardano.ideascale.com/a/dtd/384812-48088", "category": 26254, "amount": 25000, "description": "Doctors are required to provide a range of government agency proofs of certification prior to being accepted for employment at any hospital.", "funded": 0, "upvotes": 23589310, "downvotes": 9498471, "votes_result": 14090839, "votes_cast": 141, "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a very well aimed proposal for the challenge. In my opinion if well executed, it can indeed provide increased adoption to AtalaPrism. But there is the added challenge of whether it will be adopted or not by the medical system in Australia. \r\n", "q0r": 5, "q1": "If their credentials are to be believed, their team capabilities should provide more than enough background to develop their proposal. They could've provided more information about their group 'Sphere' and some linkedin credentials. It's hard to assess the feasibility without it. Their idea is great and their vision of how it would be implemented is good but when thinking of how to step from idea to real world steps, it lacks better detailed information of said plan. ", "q1r": 3, "q2": "\r\nTheir problem and solution are clear and very easy to agree with.  Although in my perspective as referenced previously, apart from being well executed, this proposal faces a big challenge in adoption by the Australian medical job application system. I think it is where most of the challenge of this proposal lies. Apart from that they could have added a detailed roadmap or some other form of detailed kpi's, because with the information provided it's hard to comprehend their milestones. \r\n", "q2r": 3, "assessor": "z_assessor_416", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "Solid proposal that certainly addresses the challenge and has identified a problem that is worthy of solving. The match between blockchain technology, DID, and healthcare is strong. The team have identified their audience which is the first part of tackling the issue. This proposal certainly has great potential and applies to a real world use case which if successful would generate great value to the community.  ", "q0r": 5, "q1": "The experience appears sound and based on the content of the proposal suggests that insider knowledge is key to the success or otherwise of the project. I have little doubt that this is a valid proposal but I  was unable to verify the team experience or evidence of Sphere based on this proposal. It would have been very useful to include links to the website or work already done. The plan is still in the introductory stage which is ok and the budget is not substantial so no issues with these parameters.  ", "q1r": 4, "q2": "Overall I found this to be a very good idea but lacking a little information wise to make it a great proposal. I sense that the team have excellent understanding and have identified a very valid concern but was still left with lingering questions. The budget detail could be further improved and a timeline would have been a nice addition.   ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "I think that having DID for medical purposes is one of the strongest pillars where we can start with DID, this is a perfect idea if turned to reality can have a large impact on decentralization in general.\r\n\r\nThe proposal is in accordance with the challenge goal.\r\n\r\nRating given 5. ", "q0r": 5, "q1": "Based on the information stated in the proposal, team is consisting of three members from different areas, but all of them are relevant to the successful implementation. \r\n\r\nExperience and skill is therefore reasonable.\r\n\r\nI am missing some linked in profiles, or possible previous experiences or works, to verify stated information, and also a roadmap. \r\n\r\nRating given 4. ", "q1r": 4, "q2": "The provided key metrics seems suitable for audit, and the budget is divided per worked hours, both of these seems sufficient. \r\n\r\nNevertheless, a roadmap with subtasks is missing. This information would definitely increase the possibility to audit. \r\n\r\nRating given 4. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The impact for the project would be high regard. I agree that Cardano Atala PRISM would address the lack centralised module, and the proposal should include most of the risk factors from current databases and new users who would use the system.", "q0r": 5, "q1": "Apart from three key core platform functionalities. The proposal should have explained where and how the new output of \"relevant credential data and packages these into a DiD\" should be administered. A brief flowchart of this crucial design will be provided. The end-user may wonder if the new PRISM/DID approach would address entirely recent ransomware attacks aimed at government agencies and particularly high-value targets like medical firms. This type of attack typically encrypted the entire database (SQL databases alike) or any API to fence all system users access to the service. ", "q1r": 4, "q2": "Team member skill sets are great for delivering the project. Hourly rate US$35 or ~ AUD $45 for developers is relatively moderate (cheap) compared to the current Australian software labour hired. This rate would be ten years ago. Suppose the team can manage at that rate and delivery as promised. In that case, that is a lot of benefit for PRISM/DID and Cardano ecosystem seeding and expanding into native and legacy system development. Understand that the system is focused on medical areas which highly privacy guarded and concerned. For Cardano and Atala PRISM to benefit from your works, I believe your team should at least provide and share the samples pseudo-code (not actual code) or any straightforward design from your project. The community can also monitor your project progress—best of luck, team.", "q2r": 4, "assessor": "z_assessor_661", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal correctly Identifies a solution to accelerate DID within the healthcare system of Australia. It would be nice to see an exact entry point discussed with regards to adoption of the proposal and DIDs in general.", "q0r": 5, "q1": "The team appears to have the requisite skills however in the future external links to provide proof of such skills would be greatly beneficial. The budget requested is in line with the planned scope of work.", "q1r": 4, "q2": "There are no KPIs listed and the roadmap is very vague which makes determining the success of the proposal difficult and does not allow for clear and concise audibility", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This proposal aims to provide a plat form where Doctors can provide roofs of certification prior to being accepted for employment at any hospital. The solution interfaces with govt systems and retrieves this data to a DiD. This falls within the challenge setting, and will add to the growth of the Cardano network.", "q0r": 4, "q1": "The team members are mentioned with a basic outline of their skills and experience. Next time please provide links to maybe their LinkedIn profiles also. Also mention the skill set that will be needed for this project and if the team does not cover it, what additional people will have to be employed with those skills, and where you could possibly find them. The Budget is laid out and broken down, and seam reasonable. Much insight is given of what the system should be able to do. There is however no specific timeline/road map given with actionable tasks of how the proposal will evolve. ", "q1r": 3, "q2": "Because the proposal does not provide for a road map with milestones, it might be difficult to track the progress of the project. There is also no means provided how the voters and community can track the progress. KPI's are not set out clearly.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Our solution interfaces with govt systems and retrieves this data to a DiD; automatically presenting it in support of user job application.", "experience": "Team of 3 :\n- Surgeon working in Australia\n- Architect/dev 25+ yrs enterprise software. ADA holder since 2019.  \n- Business Developer"}