{"id": 384835, "author": "mavster04", "title": "Health DAO", "url": "https://cardano.ideascale.com/a/dtd/384835-48088", "category": 26254, "amount": 28000, "description": "Healthcare data is the most popular target among hackers. It costs the highest at $408 per record. How Atala PRISM help in this regard?", "funded": 2, "upvotes": 110259046, "downvotes": 2081673, "votes_result": 108177373, "votes_cast": 285, "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Your idea proposal was interesting to read. Thank you for sharing. Also congratulations on the progress so far \r\n\r\nI liked the overall idea, the project proposal, and the overall defined activities and milestones sounded like a rational idea to me, not only for the requested investment value but also for the overall project proposal. Also, the idea and constructs of the project seem well-designed, and I will also be available as an expert in this area to support the idea and project execution. There are several different use cases connected with this idea that might be worth to also consider in more long-term steps: patient outcome contracts, certified medical education programs, health pharmacoeconomics contract management, and clinical trials patients data enrollment processing.\r\n\r\nEven so, as described before, the general assumptions have been considered as well as the notion constructs - also think more details should be shared around blockchain-powered health information exchange interoperability design principles. I also would suggest that for the next phases, there should be additional consideration given to HIE data privacy, Electronic Health Records data security, and storage, as well as to all the underlying principles and concepts of regulatory compliance, quality assurance in product control, and effective monitoring mechanisms. \r\n\r\nListed below are some recommendations for all the proposal teams, as well as a portion of this assessment round.\r\n\r\n Describe the problem with more concrete examples (especially in the challenges and limitations areas from the presented pdf), if possible, and give a brief overview of why it is a problem that must be resolved.\r\n\r\n Imagine how the company will operate in the future so that your users or future partners will have a better understanding of your future execution plan.\r\n\r\n Provide more concrete details so that all readers can understand it even if it is already at a good stage.\r\n\r\n Like me, many future partners and VCs will assume there is a tool for every use case, so it is a solved problem by now. There are a lot of people who do not work in this sector, so they perceive it as a soft challenge. You must explain why there is an opportunity, why the problem exists, have an effective and clear costs breakdown & architecture design (inc. the zk proof cryptographic protocols).", "q0r": 5, "q1": "This proposal will be implemented successfully based on the experience and plans of the proposing team, though I suggest more information be included within the proposal regarding the relevant experience of the proposer in managing initiatives of this nature, as well as a more detailed plan and budget for the task described.", "q1r": 4, "q2": "While reading the proposal, I had another question: How big is the efficiency improvement really and what would future investment rounds look like?\r\n\r\nI suggest a more concrete approach to understanding the problem, not a complex deep one, but one rooted in reality. I would like to hear examples of what is good about the product. Include more details about what the technology does, as well as considerations regarding identity management, consent, smart contracts execution, and any possible governance models for the execution phase.\r\n\r\n• Considerations for the US market, understanding covered entities (CEs) that may use or disclose an individual's protected health information (PHI). The HIPAA Act provides many ways for permitted uses and disclosures of PHI, also known as HIPAA Permitted Uses and Disclosures. Here a dedicated legal team should be involved or specific legal representation from the US. Overall risk management assessment in terms of GDPR and HIPAA as they're fundamentally different in their focus (GDPR aims to protect EU citizens' PII & HIPAA, on the other hand, focuses on U.S.-based organizations that handle PHI). \r\n\r\n• As a future consideration, will the project be proposed to be part of a natural refinement and growth process through an accelerator program or by bringing in industry experts who can reach valid networks of contacts and form potential future partnerships in pharmaceuticals and life sciences? I believe the proposed team already has a very solid technical-development knowledge, just believe the project should have a Product Owner/Business Development/ProductDesign internal expert. ", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal perfectly addresses the challenge and would certainly accelerate the adoption of DIDs via Atala Prism, providing a significant impact for the Cardano ecosystem. The digitization of medical records continues to be a use case that is often pointed to as a prime example of how DIDs can be implemented, and I have been looking forward a project like this one. Medical information is inherently personal and leaks can cause significant emotional and sometimes physical harm. The protection of this personal information is essential to any deployment and this proposal has it all. I am especially impressed with the integration of zero knowledge proofs where information can be confirmed or denied without the actual data ever being shared between the parties, because we must ensure that the individual is protected and remains sovereign over their identity. Another aspect that will enhance the proposal's impact is the interoperability with existing medical systems, which will be necessary for mass adoption. Amazing work. ", "q0r": 5, "q1": "The experience and plan presented give me 100% confidence that this proposal will be implemented successfully. The attached whitepaper is a treasure trove of information and holds the reader's hand as it outlines not only the problem and solution but provides excellent examples and graphics to explain how they will achieve their goals. Voters can feel very confident in the likely success of the proposal given the level of detail provided for each step of the solution's development, and the identified measures to help mitigate potential risks. There are no rocks left unturned and contingencies are built in to allow the proposers to be responsive to the changing legal and regulatory landscape. The team also exemplifies their track record by linking to work completed already, not to mention that the tool they are proposing is already being worked on and in use. The budget also seems very reasonable given the potential this project has to deliver. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal, particularly as the proposal is simply focusing on the integration of Atala Prism into the existing Hippocrades platform. The proposal offers a decent timeline and roadmap with deliverables at each step. Since the final product would be the integration of the Atala Prism did inside their platform it's a yes/no success measure which is easy for the community to measure. Moreover, the short 3 month timeline offers a quick turnaround on the investment but it may continue to pay off for a long time if successful. Another interesting component that helps auditability is the DAO component, as the community who will be using the platform will also participate in its governance and operations, this provides additional avenues for interested community members to join and shape the future of the project. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 13, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The project team is proposing to address the challenge of security risks involved in handling health care data. The sensitivity and risk of health care data being stolen by hackers is increasingly prevalent as healthcare is digitised globally and the value of this data increases. The proposal is to solve this through implementing atala prism DID and Zero knowledge proofs. The funding from Catalyst will allow them to implement DID into their suite of applications called curie. The suite includes a front facing set of applications, DID solution and healthcare API's. \r\n\r\nThe project aligns with this challengy by making use of Atala prism and establishing a DAO as a legal entity, facing growing problems with identity risk globally. The team demonstrates they have the requisite skill sets and have been working in healthcare since 2016 on a plethora of projects. Given the system is agnostic other health providers that already have systems can easily integrate into this one. Countries can instantly set up thier own decentralized Health Information Exchange since both Atala PRISM and Hippocrades are already in place. ", "q0r": 5, "q1": "Given the combination of skills and how established this team is in Healthcare it is highly likely this project will see succeed. They have already built a suite of healthcare applications that are being used by thousands of healthcare providers. Hippocrades will tie these platforms together. \r\n\r\nA relatively fast roll out given the scope, the team have projected to have their platform integrated within 3 months and have requested a reasonable amount of funding in their budget most of which is apportioned to wages and DAO registration. ", "q1r": 5, "q2": "The delivery dates are clearly defined and the community will be able to audit the use of Atala Prism in Hippocrades although it would be nice to see the progress through a public presentation. There is a clear roadmap and success can be measured through the uptake of the project and the legal registration of the DAO.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies and addresses a problem within the proposal but aiming to aid in acceleration of DID adoption within the healthcare sector.", "q0r": 5, "q1": "The proposers appear to have the requisite knowledge and skillsets required however it would be could to see references to specific team members already within the ecosystem. The requested funds are reasonable for the time frame allocated.", "q1r": 4, "q2": "The roadmap and KPIs whilst listed are rather vague and do not have any small clearly defined measurable goals therefore it is difficult to determine audibility.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Our Healthcare APIs can complement the power of Atala PRISM so that more healthcare providers can easily onboard.", "experience": "We are currently working on a Healthcare Infrastructure for Web 3.0 and is intended to be set up as a DAO. Working on health since 2016."}