{"id": 385095, "author": "heikki.ruhanen", "title": "Recruitment utilising Atala PRISM", "url": "https://cardano.ideascale.com/a/dtd/385095-48088", "category": 26254, "amount": 60000, "description": "Obtaining valid certifications for job recruitment is a major obstacle in labor markets of developing countries", "funded": 1, "upvotes": 68616691, "downvotes": 7593158, "votes_result": 61023533, "votes_cast": 134, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seems to be fully aligned with the Challenge as it does propose solutions for using Atala PRISM and Cardano to increase the impact of Cardano's technology and to and open up opportunities for rapid growth of the Cardano network. Even better is the fact that the proposers have been on the ground both in Ethiopia and also (according to their Youtube video) to Sao Paulo and Rio de Janeiro as supplementary target markets. This is a wise choice and addresses one of the concerns that I had while reading the text of the proposal. Full focus on Ethiopia might be an \"all eggs in one basket\" scenario and the fact that Brazil is coming into the picture is a great addition. The proposers have honed in on one of the areas of focus of this challenge: the creation of alternatives to accredited education and career paths and the development and maintaining of reputation as an employee, or future employee. The fact that they are aiming to supply this technology to markets that need them the most is astute - despite initial difficulties they may face. One of the hallmarks of a good proposal is the quality of the problem statement - a decentralized system base that helps to provide valid certifications for job recruitment would indeed represent a major boon for job seekers in in labor markets of developing countries. Although it may seem not relevant, the Fairway team based in Finland brings know-how from a very well run Scandinavian labor market - so the potential for synergies is huge.\r\n\r\n", "q0r": 5, "q1": "To be fair, not every building block is currently in the hands of the proposers, so it is hard but also bold to move forward while the ground is still settling. However, it also means that early opportunities are there for grabbing. Atala PRISM is a rapidly evolving product based on the Cardano blockchain and even IOG is currently involved in its implementation in Ethiopia. The proposers have smartly chosen to partly piggyback on the sole on-the-ground implementation that is currently underway with the Ministry of Education in Ethiopia by - building the next block. How would you do this? Well, for starters, I think the best way to integrate the Atala system would be to go straight to ground zero and follow what is happening. As the proposing company has stated Fairway has been closely following the implementation of Atala PRISM by the Ethiopian Government throughout its whole existence. The team has travlled to the country in Q3 and Q4 2021 to discuss the topic with government officials, including the ministry of science and technology and the job creation commission. The team has already done the ground work and is confident engough that there is a big need for digital identity in the market - hence their conclusion that Fairway's system should be integrated with Atala PRISM - breaking new ground. I would recommend to the proposers to think about whether some components (or tools developed) during the integration could be open-sourced. Why? Fairway could break new ground by becoming a trailblazer in this field - effectively leading the way for other types of integrations. But that is just a thought.. The team has specified a clear budget, proposes to cover  50% of the  Total 120 000$ in development costs. The profile of the required team members is spot on. If the proposal is not accepted for funding this round, I would advise the team to include more information about potential problems in implementation and how the team intends to deal with them if they arise. \r\n", "q1r": 4, "q2": "The team has provided sufficient - and specific (which is equally important) information about the nitty-gritty details for implementation. The project is due to start on Feb 1, 2022 and the proposers have included very clear 3, 6 and 12-month goals. The 3-month goal could not be clearer. \"3-month goal - Users can create Atala PRISM identity through Fairway\". THe launch date is May 1, 2022. The 6-month and 12-month goals are equally precise and can be audited. I would have preferred to see more challenges and risks listed in the proposal and I think that it would have improved the clarity. Why? Because the proposing team has the best insight into potential risks that could derail their project. They've been on the ground, they've talked to the Ethiopian officials and even to IOG representatives. By not including a detailed risk assessment we lose some clarity and ability to foresee possible negative events that could impact the ultimate aim of the proposal. ", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "First off, kudos to the team for all their hard work to date. \r\nThe proposal is a perfect fit in this challenge and if successful would have a resounding impact on the Cardano ecosystem by bringing in many tens to hundreds of thousands of unique users. The problem being tackled, \"Obtaining valid certifications for job recruitment in developing countries\" truly speaks to the essence of Cardano and Catalyst. The authors provide a good background and general overview of the problem they are trying to solve, including how they will leverage the tools within the ecosystem to achieve mutual goals. The proposers' solution \"a Fairway SaaS system to create, record and leverage contracts, credentials, and documents\" is also being developed in a way that maximizes Cardano's decentralized and data-sovereignty vision. The proposers also provide several good examples of what they are hoping to achieve through their system, letting voters and users alike know what to expect. Full marks. Great work. ", "q0r": 5, "q1": "Given the experience and plan presented is is extremely likely the proposal will be implemented successfully. The team provides an extremely well laid out problem and offers an innovative solution to solve it. They have clearly shown their willingness to put in the leg work and get things done. What can give voters a high level of confidence it will be implemented successfully are the many examples of high level engagement and support from key IOG individuals (John O'Connor and Dynal Patel) and Ethiopian Government officials. Another factor that points to likely success is the fact that the team is only requesting half of the expected budget and will match the funding from their own resources. This to me shows their dedication and gives me extra confidence that this is legit. While there are other reasons to list on why I think this project will be successful (team experience and placement), these meet my threshold for full marks. ", "q1r": 5, "q2": "Yes the proposal provides sufficient evidence to audit its progress and success. With a decent roadmap and clear milestones voters have a sense of when and how the work will be completed. I would have liked to see the roadmap spelled out a little more and articulated when and how the Cardano community will be informed of success. Will you be providing progress reports? How will you show that the money you get, if successful, will be spent and reported back to Catalyst? For full marks I would have needed clearer KPIs for some of the milestones. For example, in 12 months the proposers aim to \"have all the employment data of Fairway job seekers in Atala PRISM DID in the initial markets of Ethiopia and others\" but there is no indication of specific steps needed to make this  happen or the desired threshold to claim success. It is an extremely strong proposal and I congratulate the team on their hard work. Good luck. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Proof of anything related to the recruitment process is a no-brainer use case for Atala PRISM.", "q0r": 5, "q1": "Already being developed and tested in Finland and Ethiopia, it is obvious that the team is serious about their service. The plan is fairly simple but the devil is in the details.", "q1r": 4, "q2": "The roadmap, milestones and KPIs are not so clearly shown (partly probably because it's after all a company that is developing this and not everything can be shared publicly). Still, would have expected a little bit more clarity to make this more auditable.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "The proposal identifies the problem job seekers face in developing countries as they attempt to prove their credentials to employers. The proposal provides the beginnings of a solution by suggesting that DIDs might be used to assist job seekers with verifying their skills to potential employers. However, the technology alone does not provide the solution. Rather a governance framework which would describe how the entities will interact with each other and a registry that would establish which issuers should be trusted are the critical pieces of the solution. A discussion of these aspects of the DID technology is completely missing. ", "q0r": 2, "q1": "Although fiver proposers are included, I could only find info about the two founders of the Fairway company. From looking at their company website and LinkedIn profiles, they appear to be established entrepreneurs with solid technical skills. However, it does not seem that anyone on the team has experience with Atala PRISM. The proposal acknowledges the team's search for DID developers. Given the complete lack of experience with the PRISM software and (perhaps) with the general concepts of DIDs, it is not surprising that the proposal does not discuss the creation of the governance framework and trust registry that are key to the success of any DID solution. While I commend their creativity in looking to implement the technology to solve a critical problem, their complete lack of experience and understanding of DIDs gives me great concern about the feasibility of what they are attempting to do. While the proposal begins to describe what they hope to accomplish, they have not provided any details about how they would do it. They also do not mention the risk that PRISM is not yet live on mainnet, nor is access to the SDK public.", "q1r": 1, "q2": "The proposal does not provide any tangible KPIs. The roadmap calls for users to be able to create an identity within three months. However, there is no mention of the fact that PRISM is not yet live on mainnet, that there are no wallets in existence for users, nor any mention of who would pay the necessary transaction fees.  The 6 months goal mentions that data will be stored in Atala PRISM, which does not make any sense from a technical perspective, and is therefore impossible to audit. Similarly, the 12 month goal states that all the employment data of Fairway job seekers would be stored in Atala PRISM DID. This statement is confusing at best (whose DID is referenced?) and at worst represents a complete lack of understanding of the technology. ", "q2r": 1, "assessor": "z_assessor_662", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Utilizing Atala PRISM DID in Fairway SaaS system to create, record and leverage contracts and documents related to employment and job market", "experience": "Fairway (Company behind the submission) is creating the SaaS already in Ethiopia and plans to integrate Atala PRISM DID to Fairway."}