{"id": 385016, "author": "amolagg", "title": "(DEI): Decentralized Exam identity", "url": "https://cardano.ideascale.com/a/dtd/385016-48088", "category": 26254, "amount": 20000, "description": "We currently lack secure and a decentralized identity system which can be operated by every student individually.", "funded": 0, "upvotes": 18216171, "downvotes": 12609040, "votes_result": 5607131, "votes_cast": 100, "f6_no_assessments": 6, "f6_rating": 2.2777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer identifies a clear problem (student identification for exams) however they do not lay out a solution for how it would be addressed with Atala Prism. It is true that examinations are a big part of the education system and a major obstacle for students and administrators alike, but this is likely too limited. Having a DID solution on Cardano would surely be utilized across the entire educational career of the student, where their exams, courses, degrees, credentials are saved and stored. Unfortunately, in this case the focus on examinations may be too narrow. I would encourage the proposer to continue to develop this idea and resubmit in future funding rounds once there is a more tangible solution to the problem identified. ", "q0r": 2, "q1": "Unfortunately, the proposal is more of an idea in its current state and lacks a tangible plan on how it will solve the problem identified. While a \"solution\" using Atala Prism is likely ideal for the situation described, it is not fleshed out enough to give voters confidence that it is in fact feasible. In fact, I am not entirely sure what is actually being proposed as the solution of how it would be implemented. There is also no justification for the budget or a breakdown of how it would be spent. I appreciate that the proposer does provide some of their background but this is not bolstered by any information other than their word. I'd suggest that when/if the proposer resubmits to include more information on their credentials, including linkedin, websites, or previous examples of work. Another way to increase the score next time, could be to consider outlining what work has been done to explore the willingness of governments or academic institutions to move in this direction.  ", "q1r": 2, "q2": "No, the information provided is not sufficient to audit the progress and success of the proposal. As mentioned above, the proposal is more of an idea at this point and is not developed enough. There are no real metrics of KPIs that can be measured against and there is no product or tool being presented that the community can view. When resubmitting, additional information on what, when, and how you plan to build a solution will be necessary. The proposer may benefit from finding a team who is working on a similar solution (student credentials) and try partnering. It is clear the idea is here but there is just some more thinking required before the community can be confident to fund it. ", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 20, "ne": 13, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Implementation of DIDs in the education sector would be a valuable tool in the adoption and expansion of the Cardano ecosystem, while at the same time improving the current system to better service the community.", "q0r": 4, "q1": "The idea could have a lot of potential, and from the brief description of the proposer's experience, it seems like she/he would be able to implement it. However, there are some very important metrics that are still missing in order to have the proposal properly assessed. There is no timeline or roadmap with clearly defined steps, the budget is not detailed at all and from what is written, there is big chance the proposer might need to hire additional people, at least on the marketing side.", "q1r": 2, "q2": "Since the proposal does not include any kind of metrics and a timeline/roadmap in its description, it could not be properly evaluated. It would need to have clearly defined stages in the timeline, that would help the community in assessing its success and progress. How many steps will be implemented and by whom and how fast can we expect each step to be completed. What happens if anything doesn't go according to plan?", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "A solution is provided to the identified problem, but is unclear what is to be solved and looks like the goals of the proposal don't fit in the challenge objectives. For an outsider is somehow difficult to understand how the framework will perform (inputs/outputs).\r\n\r\nIn its current form - it may be somewhat too ambitious to convince a government to utilize such a tool.\r\n\r\nThere are no timeline, KPIs/metrics defined for the proposal thus making it hard to evaluate the success.", "q0r": 2, "q1": "It is unclear if the team is made by one member (the proposer) or additional human resources are necessary. The proposer should add verifiable trails of education/experience necessary to successfully complete the project. The proposal looks more like a concept than a working project.\r\n\r\nThe budget is not clearly outlined and broken down into identifiable items thus making difficult to appreciate if is reasonable or not.\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal. (human resources, devices, stationery etc.)\r\n\r\nBased on the given information, I don't expect a successful implementation", "q1r": 1, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. Possible challenges are not taken into consideration. In conclusion, the progress of this proposal is hard to assess. ", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 23, "ne": 0, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "A Secure Decentralized Identity mechanism is part of this Challenge. It would enhanced your solution statement if you had included interfacing with the the Atala Prism platform because it is part of this challenge statement", "q0r": 4, "q1": "Although you have 2 years experience you have not explained if that experience is appropriate for this effort. A more detailed breakdown of your timeline, KPI, and budget would also improve on this proposal", "q1r": 3, "q2": "For a proposal to be sufficient to audit I would suggest you add a Time Line and dates for completion, details for each step to be accomplished and what would a successful product look like. These would help the CA and Voting communities in forming an opinion about your ability to be audited.", "q2r": 1, "assessor": "z_assessor_320", "no_vca": 24, "ne": 0, "ng": 17, "nfo": 7, "vca_o": 1}, {"q0": "The proposal clearly identifies a problem within the challenge and a novel way to implement a solution. One of the hardest parts os SID is the chicken and egg and gaining user and institutional adoption. It would be great if you could address and speak to a specific entry point/ region within the exam system in future proposals.", "q0r": 4, "q1": "Whilst the idea has huge potential the proposal is rather vague as to how it seeks to tackle the problem. a clearly defined first step and targeted approach would greatly aid in determining the feasibility of this project. Additionally a breakdown in funds is need to establish whether the requested amount is correct. ", "q1r": 2, "q2": "No KPIs are listed and no roadmap is given and therefore it is not possible to audit the success of this project at this stage.", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has the potential for mass scale DID adoption, but it lacks the information required to understand where this project will be first launched.", "q0r": 3, "q1": "The proposer clearly has development experience, but it is not clear on their experience in Blockchain. No other team members are mentioned, so it is hard to judge the experience behind this project.", "q1r": 3, "q2": "Unfortunately, this proposal does not contain clear KPIs, or a timeline. It is very hard to determine the success of the proposal.", "q2r": 2, "assessor": "z_assessor_977", "no_vca": 30, "ne": 0, "ng": 19, "nfo": 11, "vca_o": 1}], "solution": "This identity will be common for every exam and can be accessed through smartphone by each student individually.", "experience": "Full Stack Software Developer- 2 Years\nInterned at Google. \nGot Funded for 2 research projects."}