{"id": 385057, "author": "elementarysoftware", "title": "Visual DID & Credential Builder", "url": "https://cardano.ideascale.com/a/dtd/385057-48088", "category": 26254, "amount": 47000, "description": "Not all users are developers and the lack of intuitive UI tools exclude non-developers from creating and issue credentials to DID owners", "funded": 1, "upvotes": 48092443, "downvotes": 8330935, "votes_result": 39761508, "votes_cast": 150, "f6_no_assessments": 4, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal not only effectively addresses the challenge it launches it to a whole new level. Most people are afraid of blockchain technology because it is too hard to understand, too technical, and too overwhelming. By removing this aspect of blockchain technology while maximizing the user experience is the exact type of actions that will expedite mass adoption. By creating a tool that allows non-developers (lay people) to leverage what the blockchain offers (secure, self-sovereign data) through a web-based application, the proposers could be introducing a major game changing application. The fact that this tool is somewhat generic also increases its impact score because many different groups, sectors, entities will be able to adapt the system for their own needs without having to hire additional developers. This is likely enticing to many businesses and companies that may not have the capacity or desire to do so, rather this tool allows them to participate. Awesome stuff! ", "q0r": 5, "q1": "Yes, given the experience and plan presented the proposal is likely to be successful. I find confidence in the fact that the lead proposer is an Atala Prism pioneer and has direct experience working on the Cardano blockchain. You can tell from the description of the problem and the plan laid out to solve it, that the team has a clear vision and has the ability to deliver. I would have liked to see more explicit credentials provided by the team, such as linkedin accounts, websites, or other ways, for voters. While this doesn't imply that the team doesn't have the credentials, it may be hard for some voters to just accept their word without evidence.", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal, with a roadmap and list of KPIs which are objectively measurable. The proposers make it very clear from the outset that this is a community project and will be open-source and available at many intervals for community engagement and critique. This can inspire extra confidence for voters because there is complete transparency and willingness to learn and adapt. This is a strong indication that the team is serious about what they promise and are willing to seek support to make it better. To me, this is what Catalyst is all about and represents our principles of openness, community, and progress. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Project would utilise and exponent Atala PRISM market share existing in the foreseeable future. Since listed 15 year+ old experience in software Dev and have been on the first course of Atala PRISM pioneer program, several critical areas should be included in your first six months delivery, for example: to work around and address if the end-user lost seed phrases or mnemonic or alternative KYC to support end-users. There are three parties in your entire vision - your team <---> me – a non-coder to use your project to issue DID types <---> end-users, as the project has mentioned, the project's success is laying at the end-user side. Therefore, it should explain how end-user data would be stored, and level of enforced encryption etc. ", "q0r": 4, "q1": "As mentioned in impact: your team <---> me – a non-coder to use your project to issue DID types <---> end-users. The project should have provided and explained most of the risk factors, any tangible and intangible elements that may hold back your project not deliverable per highlighted features in \"Main features of application\".", "q1r": 4, "q2": "I believe the Accelerate Decentralized Identity challenge and Atala PRISM would be a lot of interested parties will get involved in the next 6 and 12 months since everyone wanted to be first. The team promised it was Open-Source at the end, so the Cardano and Atala PRISM community would benefit a lot from the next six months of development. Assume 47k project does not address all proposed elements the community would learn from team or project mistake (if any) and moving on as Atala PRISM is up-and-coming areas to be accelerated.", "q2r": 5, "assessor": "z_assessor_661", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal attacks a critical problem – for DIDs to gain mainstream adoption, users need an easy way to access the technology. If the user interface described in the proposal is built, it would be a huge benefit to the Cardano ecosystem, as it would provide an easy way for people with use-cases to begin building their own prototypes, thus furthering the adoption of the Cardano technology. By creating an open source repository would allow the tool to scale further. It would be interesting to know the business model envisioned by the proposer. Who will pay to use the GUI or will it be made freely accessible to the community? ", "q0r": 5, "q1": "The proposer has had some experience with the Atala PRISM course. The proposal identifies the long wait time for credential issuance as an obstacle to user adoption, and proposes a solution.  However, there is absolutely no information given about the proposer, so it is impossible to assess whether or not she/he has the ability to build the tool described. Before providing 47,000 in funds, I would want to know more about the background, skills, and abilities of the proposer to assess the likelihood that they can complete the project. Creating a good user-interface is very hard, and it would be helpful to know how likely the proposal is to be able to deliver.  I tried googling the proposer's handle, \"Elementary Software,\" but the name is so vague that I couldn't find a clear hit. It would also be useful to know how this tool will interact with a DID wallet. Will it serve as a wallet to hold credentials? Or will it need to be interoperable with a wallet. In the latter case, which wallets are (or, more accurately, will be once they are built) compatible? ", "q1r": 2, "q2": "The KPIs are very specific and would be easy to measure. They are appropriate for measuring the success of the project, and also relate directly to the challenge brief. The roadmap is a bit vague, but conveys a high level plan. The Roadmap acknowledges that PRISM is not yet on the Cardano mainnet and links the publication of this project to that date that PRISM itself moves to mainnet. ", "q2r": 4, "assessor": "z_assessor_662", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal for providing a user friendly GUI and abstracting away the technical requirements of DIDs and Prism accurately identifies a problem and solution within the challenge and is very well aligned. ", "q0r": 5, "q1": "Whilst the team stated seems to hold the necessary experience to inact this task it is impossible to tell as no external links are given. I understand previous projects are not able to be mentioned due to NDAs but it would be good to see linkein or githubs handles for the team members in question. The funds requested seem accurate for 6 months work but once again it is impossible to tell as the number of team members is not mentioned and neither is the breakdown of labour. ", "q1r": 3, "q2": "The KPIs listed are well chosen and the roadmap is defined with the goal of an MVP by June 2022. As the first milestone is 6 months away it would be nice to see some form of monthly progress report to keep track of the project. ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Desktop application enabling non-developers to create and issue (send) credentials to DID contacts with intuitive graphical user interface", "experience": "Atala PRISM pioneer first cohort, developer with 15+ years professional experience with both UI client apps and server apps"}