{"id": 367154, "author": "", "title": "Catalyst Compass", "url": "https://cardano.ideascale.com/a/dtd/367154-48088", "category": 26104, "amount": 50000, "description": "一般の有権者が投票のために良いプロジェクトを選択することは、あまりにも難しい、あるいは不可能であることが明らかになってきています。", "f6_no_assessments": 8, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is an interesting twist on the governance and decision aspect of Catalyst.  The proposal seeks to help build a qualified set of advisors that can apply pre-filtering of the ever-growing number of proposals that will be coming through Catalyst.  This will help with the consumption and simplify the decision making for the general voter.  The only concern is that the process of pruning ideas/proposals to give to others will impart some of the bias of those SMEs/deciders.  This could impart an undesired response in the system and skew the flow of ADA to projects that may or may not have been naturally chosen.  This idea has a lot fo merit, but so much care would be needed to take to ensure that this doesn't become something like described.  If done right though, this could make the whole proposal a great value add to Catalyst", "q0r": 4, "q1": "There is very little noted in this proposal that descirbes the how's and what's will needed to be done to build this system.  On the other hand this proposal consists of many of the current curators of proposals (CA's and vCA's) who have expereience with monitoring, tracking, and pruning the ideas. They definitely have been part of the past Fund proposals and can take that experience to build a system.  More details about how they build the application and the choice selection of everything would help to give an understanding of what funding would do for them.", "q1r": 3, "q2": "As mentioned previously, the big thing is that there is little details about the how's and what's they will do.  Success measures with details and timelines would make the proposal more auditable if they win the funds.  Given the teams experience they appear to have the experience to come up with a good plan forward, but there is little concrete data here.", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement chosen has bee a leading problem that cardano as a community has been trying to solve and have done an awesome job so far, yet the problem still exists, but a rather more channeled guidance to voters from an existing CA's and VCAs would definitely increase the effectiveness.", "q0r": 5, "q1": "Since the team or moderators and others are curated from existing people in CA and VCA circle they have the advantage and experience of previous fund rounds and associated issues, hence they form a good team to attend to resolve the voters delemma.", "q1r": 4, "q2": "The effective implementation/adoption is to be measured by some timeline for implementation in this case it would be number of projects which are summarized/ information broken down as mentioned in proposal to get the voters from non technical background to effectively make informed decisions. ", "q2r": 4, "assessor": "z_assessor_16", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "While this proposal addresses an initiative to try out a new or additional way to assess proposals, there are also things that would not be in favor of distributed decision making. While it is definitely important to develop the way that proposals are assessed and ensure that voters have access to \"good\" proposals, channeling proposals through a non-profit team instead of making all proposals equally accessible to all voters is actively limiting decentralisation. The proposing team does not address the risks that come with pre-selecting proposals for voters - how would they avoid bias and/or corruption? The risk of pre-selecting proposals as a group instead of an open community is not considered in the proposal. It is highly likely that this would be in favor of the selected proposals and it is important that the group addresses this issue and gives a clear statement on measurements that will be taken to avoid these risks. The objectives why it would be good to move away from decentralized structures and transferring them to a small team are imperative but are missing. ", "q0r": 2, "q1": "Relevant experience is limited to being a CA, vCA \"or other\" and the team itself does not provide information about their background with Catalyst or further qualifications. The team itself is numbered as 10-25 - which is again very broad. The plan presented is not broken down in actionable steps or milestones or a financial budget plan. The team gives different information throughout the proposal. The proposers say that they would want to allow everybody to participate as a CA but further down in the proposal they suggest they might limit the number of CAs based on budget decisions. If the number of CAs is limited, decentralization is limited as well and bias is more likely. The proposal itself does not provide all necessary information that is required - if the aim of this team is to present proposals in a better way - this proposal should already be designed very coherently and most importantly with all information that is required. The budget for this proposal is 2/3 of the funding for this challenge without giving any detailed information on how this will be distributed further.", "q1r": 2, "q2": "At the moment with the lack of information provided and the very short time frame of 1-3 months the proposers have set up, auditability is not feasable. The team has not given milestones or actionable steps that they aim to reach in this timeframe. The team is not yet set up, information and experience of the current team is missing, rewards for assessments are not yet broken down. The proposal would be more auditable if the team would provide some relevant numbers: how many CAs will be included in the first trial? How many proposals are going to be presented to the voters? Most important - how does the team itself define success and (!) who will choose the proposals that will be presented to the voters? How will they avoid bias in choosing proposals through an established group in comparison to a whole community and a decentralized assessment phase? How to avoid corruption if a team instead of a community is responsible for picking out proposals to present to the voters? The team does not reflect on the risks of wanting to present some instead of all of the proposals to the voters. What are the key metrics to decide which proposals voters would want to see? For this proposal, it would be important additionally to have access to voters through a questionnaire or any other measurement tool to estimate voters agreement or disagreement with the \"new\" system - otherwise it is speculative that it would be beneficial for voters to have a pre-selected amount of proposals.", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "- There is no doubt that is mandatory to investigate a way to facilitate the voting process, creating a method that allows everyone to evaluate all the projects and compare them, making the voting decision more efficient.\r\n- One point that causes me trouble is the scalability of the process, since you've said and it's seen that we have a growing community with more wallets, voters and proposals, I'm imagining how long you will need to accomplish everything described in the proposal.", "q0r": 3, "q1": "- I do think that it's reasonable to involve people who is already participating in other parts of the process, like CAs and vCAs. However, I'm wondering if it's possible to achieve this. Since we've a growing number of proposals, in the next fund, e.g., it's possible that we have more than this round to evaluate ( > 848 proposals). Therefore, how long are you going to need to read everything, summarize, evaluate in more than 3 aspects, etc.\r\n- Other characteristic that I'm thinking is: it is quite hard, to not say impossible, to evaluate something with impartiality, trying to avoid its own experiences and cultural bias and, in some ways, this is the beauty of this method of voting – having several different people reading and evaluating having its own point of view and experience, thinking that this or that idea would be the solution for a problem we're having in Korea (e.g.).\r\n- A point that should be more detailed is the budget. You said that you'll be profitless, however you've asked $50K budget. Why is that ? I imagine it is for the development of the site, however, if it's this, its way too much.\r\n- During which week of the fund are you going to make all the reviews to the voting?", "q1r": 2, "q2": "- I know that once the reviews enter in the site it's easy to know whether or not you're creating content. However, how are we suppose to know if we are actually enhancing the general voting? How are we going to measure?\r\n- The proposal would benefit if you've added the window in which you would have time to make all the reviews and publish to the voting process part.\r\n- missing a more well developed roadmap.", "q2r": 2, "assessor": "z_assessor_25", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has a good potential to improve the voting process, however it assumes that by being a parallel organization of filtering and interpreting projects for the general public is an unbiased way, which is not true: \r\n(\"only a non-profit organization might be in the position to act with the right mindset coping with these tasks on the one hand and on the other to be able to represent the claim of acting on behalf of the entire Cardano ecosystem - without having to represent any own economic interests\")\r\nThey are not also tackling the real problem, which is \"opaque and confusing jungle of projects like there currently is\". As long as there is a jungle of projects being submitted and accepted, the Catalyst Compass will simply be a layer of filtering, but doesn't solve the original issue.", "q0r": 3, "q1": "The proposers have claimed experience in previous rounds and in the whole process of evaluation. Considering that they understand the Catalyst project very well, they have the street credit needed. ", "q1r": 5, "q2": "The proposers have provided a preliminary website where the project can be audited in the future, but they provided no details about how the requested budget will be applied", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "I agree that the idea is good. Can definetly help many people to refine and filter a large number of ideas, and therefore to increase their decision making. ", "q0r": 5, "q1": "The staff is composed of about 10-25 moderators and even more experts who are taken from the pool of vCA's, CA's and/or others.\r\n\r\nI find this range very strange- 10 to 25? quite large range :) If there would be - 10 stable, and up to 15 part-time/intern/seasonal, it would sound better. \r\n\r\nAlso, it would be nice to provide some background of a core team, because even though the proposal is detailed and clear, there is nothing about the authors.\r\n\r\n\"It is one of our principles that every project participating in the Catalyst voting is analyzed carefully, unbiased and fairly.\"\r\n\r\neven though you are CAs and vCAs, I find this proposal not meeting this point to its full extent. ", "q1r": 2, "q2": "Even though the proposers are CAs or vCAs, key metrics were not stated in the proposal, so it is up to my imagination to fill them:\r\n\r\n1. number of visitors (and other metrics)\r\n2. some feedbacks/surveys\r\n3. increased number of voters (even that we can not distinguish how it was helpful unless these people step up)\r\n\r\n\"It is one of our principles that every project participating in the Catalyst voting is analyzed carefully, unbiased and fairly.\"\r\n\r\neven though you are CAs and vCAs, I find this proposal not meeting this point to its full extent", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Yes, it will definitely improve effectiveness and efficiency. A \"top down / hierarchical\" view and tracking for assessments are always good, even if it can just serve as an initial filter - as a lot of time is consumed just to work through proposal and even decide which to assess and which not.\r\n\r\nContext in the bigger \"picture/architecture\" is always good to roll governance back to a more condensed/\"dashboardy\" view.\r\nI do see that this can work strong with proposal \"Catalyst: Exploratory Data Analysis\" where together they are more than the sum of the individual parts.", "q0r": 5, "q1": "This a definite feasibility improvement, as it would add practical but also more refined governance structure to the existing environment. It would require some process definition in order to clarify clear governance points.\r\n\r\nThe subclasses to be split up in two higher sublclass categories i.e./e.g. Level 1 - more common classes as menitioned economics, etc. Level 2 - more specific to the \"domain\" - as some of that criteria might be more specific to that domain for comparison.", "q1r": 5, "q2": "Needs to have a clear feedback loop back into Project Catalyst .e.g a step/layer between \"submit proposals\" and \"refine\".  This is where more experinced assessors moderates for claissification to ensure consistency in the classification/Sub classification.\r\n\r\nThis would be good during project stage, but also later if Project Catalyst becomes more operational and move from a project type environment to a day-to-day operational type mechanism.\r\n\r\nIt is important to add the element of business continuity that this audit mechanism is an ongoing and good uptime guarantee for this function.", "q2r": 5, "assessor": "z_assessor_633", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Facilitating information gathering before the vote is an essential contribution to the distributed decision, it is a very impactful project for the Distributed Decision Making Challenge. \r\nI'm convinced that having a more detailed independent analysis will help the voter's task but providing a single expert review of a proposal could also affect the diversity of the reviews. I advise the author to elaborate about how this single in-depth analysis can be more helpful for a voting decision than the sum of reviews of lesser skilled people.\r\n", "q0r": 4, "q1": "The proposer's solution can be summarized in creating a website – sister platform for Ideascale, that will include additional subclasses and more in-depth analysis for proposals. The preliminary website gives a good confidence on the feasibility of the project.\r\nThis objective would be reached through a thorough selection of expert Community Advisors whose skills would have been verified. \r\nThe appointing of current CAs as experts for Catalyst Compass is the main challenge of the project. I advise adding to this proposal some details about how this process will be conducted.\r\n", "q1r": 4, "q2": "The proposer indicates a 3 months delivery for the website, but the project lacks of details about the steps of development and challenges.\r\nThe use of the funds (50000$) is not explained by the proposer. He should add details about the money allocation (incentives, and website conception)\r\n", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "膨大な量のオファーの中から事前に選択し、それを選別するという悩みに、すでに誰かが対応していることを想像してみてください。", "experience": "スタッフは約10～25人のモデレーターと、vCAやCAなどの専門家から構成されています。"}