{"id": 368899, "author": "", "title": "Catalyst: Exploratory Data Analysis", "url": "https://cardano.ideascale.com/a/dtd/368899-48088", "category": 26104, "amount": 4000, "description": "Catalystではすでに多くのデータ（投票結果、アドバイザーのスコア...）が生成されていますが、これらはプロセスに価値をもたらすために利用されていません。", "f6_no_assessments": 8, "f6_rating": 4.875, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposals aims to provide a better understanding of how Catalyst works, by aplying Exploratory Data Analysis (EDA). \r\n\r\nAccording to my professional experience it can sometimes be difficut to derive value from EDA without knowing sufficient context of where the data come from (in other cases knowing too much context can be the obstacle :)) \r\n\r\nSince the proposal is driven by Victor, who has deep insight in the Catalyst process (and has contibuted a number of very useful tools and reports), I have no doubt that EDA will in this case have high impact on improving the Catalyst way-of-working - my full support. ", "q0r": 5, "q1": "Victor is Veteran Community Advisor, member of the Catalyst Circle, Catalyst Community Tools co-creator and has a strong Data Science and Math background.\r\n\r\nMoreover, Victor is known within the community to be a trail-blazor when it comes to improving the Catalyst way-of-working. He has contributed quite a number of very useful tools and reports. \r\n\r\nI have no doubt that also this proposal will add lots of benefit. Due to Victor's degree of engagement, skills and reputation, there is a very high likelihood of success. ", "q1r": 5, "q2": "The workpackages, roadmap and costs are suffieciently listed and are based on experience and rational description. \r\n\r\nThe resulting costs are very reasonable and auditing is easy in this case. ", "q2r": 5, "assessor": "z_assessor_101", "no_vca": 26, "ne": 12, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the need for better understanding of the work done during Project Catalyst and will create insights by analyzing the data from past funds.\r\n\r\nData from all funds is available, but not used. A smart tool such as this can guide and improve future proposals, detecting weak points.\r\n\r\nThe proposal is aligned with the Challenge", "q0r": 5, "q1": "The proposer has demonstrated sufficient knowledge for this development, presented public LinkedIn profile as well as several outputs for demonstration. The proposer is an highly educated individual (Doctor of Science) with sufficient skills and experience to deliver.\r\n\r\nThe presented plan is reasonable, both in scope and budget. Budget is consisting of working hours and is moderate in amount. The tasks to be performed are defined with the time estimates.\r\n\r\nBased on the information in the proposal, links and documents, it is very likely that the project will be delivered.", "q1r": 5, "q2": "The proposal has a clear roadmap, steps, budget, time estimate and deliverables.\r\n\r\nThe goal is clear, deliver detailed reports on all 7 funds to guide future improvements of Project Catalyst with clear statistics.\r\n\r\nThe problem to be addressed and solution is clear, using the data from past funds to gain insights and improve future ones.\r\n\r\nThe potential risks and challenges are not particularity addressed. It would be beneficial to see the potential roadblocks and ways to mitigate them, such as wrong time estimates or similar.\r\n\r\n", "q2r": 4, "assessor": "z_assessor_160", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Yes. The author understands the need to explain the relationship between his proposal and the Distributed Decision Making challenge, and he provides an adequate justification. I believe that the need for this explanation comes from the difficulties found in contemporary society for constituencies (and leaders) to understand and capitalize on the value of information products for decision making and on the necessity for data gathering and processing for information production. One would expect that it would not be necessary to explain this in the realm of blockchain technologies and within the \"science-oriented\" Cardano ecosystem, but it is not only necessary to reiterate it but also, to actually execute, as the author is proposing here. The author clearly understands these issues, is competent, motivated, and shows profound engagements with Cardano and Catalyst. In my opinion, the proposal demonstrates that it understands the issue, that the author can deliver on the desired products, and that these products can contribute to improving distributed decision-making for Project Catalyst and for Cardano.", "q0r": 5, "q1": "Yes. In his proposal, the author demonstrates the experience, competence, and interest to execute the project satisfactorily. Besides, the budget is adequately estimated. As a recommendation, I would note that it would be ideal if the steps taken to provide access to the data, the analysis and the documentation of the project would allow for the future automation of the report generation from future Catalyst funds and Voltaire governance. This suggestion clearly exceeds the scope of the proposal, hopefully, well taken, the author can make the most of this recommendation without exceeding his commitments to its execution. Congratulations, I hope that for the improvement of Catalyst and Cardano, this proposal is supported by the community, whether it is funded or not in this round. ", "q1r": 5, "q2": "Yes. I believe that the milestones suggested, the definitions provided, and the competence of the author will be more than sufficient to audit the progress and the success of the proposal. That being said, the evaluation of the proposal would see added benefit from the participation of a knowledgeable auditor in the areas of statistics and/or data analysis.", "q2r": 5, "assessor": "z_assessor_183", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "Data analysis absolutely contributes to decision-making as it shows connections and patterns and it can give important information about the impact of for instance assessments on funding, hence helping CAs to realize the importance of this role. Especially the role of visualization is pivotal for many of us as it not only enhances learning but also helps to understand possible correlation! It would help the community understand the underlying mechanisms of the roles in Catalyst and would give insights on the effects described by Victor - for instance - how many proposals with low assessment scores get funded or other important measurments. ", "q0r": 5, "q1": "Victor described his experience in this field clearly and given that he is (a) a very active and experienced member of Catalyst and (b) trained in data science makes it highly likely that the proposal will be implemented as stated in the proposal. Victor is already committed and has done previous work that included data sets and visuals to look for possible underlying mechanisms across Catalyst - so there is prior work that has been delivered by this proposer making clear that his experience fits the intended outcome for this proposal. It would be of great value for the community to use part of this challenge to allow Victor to take the time to look for the most relevant possible variables to measure and to create visuals that will be easy to understand. Budget is broken down into different parts of documentation and clearly states how the budget will be used. ", "q1r": 5, "q2": "Data sets obviously naturally allow for a very high audatibility :) for this proposal success can be measured in several ways, but completion of 4 reports as stated by the proposer will be the main way to measure success for this proposal. Timeframe and roadmap with actionable tasks are very feasable given the experience of the proposer in the field. Documentation via GitHub and maybe the landing page as proposed would give access to all community members. I know that Victor is also active in supporting CAs on Discord and in Telegram, for instance in the CA Telegram group, so sharing some relevant visuals in this specific Telegram group would additionally educate and support the CAs.\r\n\r\nAs for risks, I don´t see risks with this proposal, but I would recommend looking into types of visual analysis to take into account that not everybody has a statistical background and experience with visual analysis, so reducing the load of data for a specific visual analysis and choosing an intuitive visual representation would be part of how to best use the data-analysis skills to break it down to the most accessible visuals.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "EDA allows for proposers to make better decisions based on data, improve their proposals, and ultimately increase the legitimacy of Project Catalyst. The proposer explains in great detail how this proposal directly addresses the challenge. As the data shown as attachments has been distributed in various channels already, I observed the overall quality of proposals to have improved in this fund compared to the previous one. While it is unclear if there is a direct link, it can be argued that this EDA has a positive impact on the Cardano ecosystem.", "q0r": 5, "q1": "The proposer has done the work already for previous funds and explained in detail how to repeat this work on new data. The budget is understandable and very reasonable.", "q1r": 5, "q2": "The information provided is sufficient to audit the success of the proposal as clear deliverables and milestones are identified.", "q2r": 5, "assessor": "z_assessor_22", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Great idea and very well written proposal. The problem is very well defined (the amount of data not leveraged) as so is the way this is going to be resolved and who would benefit from it (voters, proposers and Cardano community as a whole). It will certainly help the decision making process, adressing the challenge of this campaign.\r\nInteractive dashboards would be great. the github repository could be linked in some page within cardano idea scale website to make it more easy to access. Also, there could be a place for people to suggest which data they'd like to have analyzed and which hypothesis they have upon them (to be validadted in the EDA)\r\nAs far as I undersood (mainly by the attachments), the scope is limited to the numeric data (budget, rate, score, etc). I wonder if its scalable to also include text data analyisis to check if any insight comes from it. how the size from approved proposal differs from the size of not approved? what are the keywords that a good proposal has that wll rated by CA and accepeted by voters? how a technical proposal differs from a more non-technical in terms of rates, number of assessments, voters, etc? Some AI application could also help - I'm not an expert on this field so not sure how feasible it really is.", "q0r": 5, "q1": "As it's possible to see, Victor experience (both with Cardano and data analysis/AI) should be enough.\r\n If this analsyis scales to bigger ones, maybe more resources will be necessary. Also, the plan/schedule is realistic and budget breakdown is clear", "q1r": 5, "q2": "Milestones and deliverables (reports) are clear and well distribuited in time. Maybe a final report after project is fully executed to consolidate all conclusions and check how each fund data analysis compare to each would also be great (maybe na extra conclusion regardng evolution could be drawn out here). Also,  a post audit could be done after some fund rounds after fund 7. With all this data analysis in hand, how voters, proposers and CAs improved their respective activitiy in fund7 onwards? it could be qualitive, with feedbacks, or quantitative, with a more extensive data analaysis (comparing before and after) and what are the lessons learned", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The problem description and solution make sense and are within the scope of the challenge.\r\n\r\nFor the community to have better conditions to make decisions, it is important that there is quality and distribution of information. This proposal is addressing these two aspects. EDA is a tool that brings objectivity and mitigates bias, thus improving the quality of information to be used for decision making.\r\n\r\nGoals and deliverables indicate relevance to the challenge. Due to the nature of this proposal, I understand that establishing indicators van be a challenge,  but I would recommend including metrics/KPIs.  What metrics/KPIs/indicators will be effective in indicating an improvement in the decision-making process? Perhaps the amount of access to reports would be a relevant indicator.", "q0r": 4, "q1": "The proposer has relevant experiences for the development of the proposal, some examples of graphical analysis were created and seem to be enlightening insights from the Catalyst data.\r\n\r\nThere are details about the qualifications of the proposer and sources for verification/confirmation.\r\n\r\nThere is a reasonable and objective timeline. A budget breakdown with realistic workload assignment and sensible hourly rate was presented.\r\n\r\nThere is an objective and well-structured plan and the information presented indicates feasibility.", "q1r": 5, "q2": "There is clarity in the problem, solution and alignment of both with this challenge.\r\nRoadmap, targets and deliverables were presented and are good auditability indicators.\r\nNo metrics/KPIs were included.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The impact of visibility of dashboard is always a huge plus. Sometimes the initial (exploratory) report is an important step to help to see all the \"hidden\" but yet available metadata. \r\nI do see that this can work strong with proposal \"Catalyst Compass\" where together they are more than the sum of the individual parts.\r\nI would though suggest higher funds - especially either if working with/aligning with proposal \"Catalyst Compass\"", "q0r": 5, "q1": "As an engineer, I see the value of a scientific skill as well as a structured approach to see this through successfully. The approach not only gives confidence in success, but also to pinpoint and rectify problems and the to resolve successfully - and not a by chance success.", "q1r": 5, "q2": "It is clear, structured and I can loop this back to timelines and deliverables - i.e. a clear expectation of value for tracking and audit purposes.\r\n\r\nIt would be good to have some mock-up at an earlier stage.", "q2r": 5, "assessor": "z_assessor_633", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "提案者、アドバイザー、投票者のCatalystに関する理解を深めるために、ファンド4～7の探索的データ分析を行う。", "experience": "ベテランのコミュニティ・アドバイザー、第1回カタリスト・サークルのメンバー、コミュニティ・ツールの共同開発者、強力なデータ・サイエンスと数学のバックグランド"}