{"id": 369106, "author": "", "title": "Improve the Quality of CA Reviews", "url": "https://cardano.ideascale.com/a/dtd/369106-48088", "category": 26104, "amount": 1, "description": "Catalystの競争力の高さが、CAのレビューの質に影響を与えている。", "f6_no_assessments": 5, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "As far as I've understood IOG currently has a way to check that VCAs are not rating their own CA assessments and that CAs don't rate their own proposals. How well this works? No idea. So, something along the lines what was proposed here could be implemented but it's better to take that up with Catalyst Circle and then iterate among the CAs the same way as the new incentive model was proposed and developed.", "q0r": 3, "q1": "Phil and everyone else who has been in the CA ranks for a long time have valuable perspective and should be listened to when these decisions are made.", "q1r": 3, "q2": "This \"proposal\" is not looking for funding so it's not a proposal per se. If you wish to show us how this could be done using e.g. Atala Prism there is another challenge dedicated for that.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Proposal is to select VCAs based on Identity and Credentials which was a challenge in competitive nature of Catalyst and impacting the quality of CA reviews.\r\n\r\nThe large volume of proposals is unrealistic to expect voters to fully absorb every proposal. Some voters are therefore resorting to the CA reviews for guidance on which proposals to vote for.", "q0r": 2, "q1": "Proposer is no more than but active participant in Catalyst since Fund0. He is knowledgeable enough to suggest a proposal but to implement would require another.  ", "q1r": 2, "q2": "Proposal lacks key information. The key performance indicators (KPIs), timeline, milestone wasn't included. The ability to audit this proposal needs clearer metrics that can be easily viewed to determine if the proposal is successful.", "q2r": 1, "assessor": "z_assessor_340", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "Creating a selection of VCAs based on credentials and identity is a process that might help bring quality to the whole process. But the proposer did not clarify what are the criteria for issuing this identity or credentials. Moreover, in the way it is presented, it's more a suggestion of how to conduct the process than a project to be implemented, which can also be discussed with the admins in the process. ", "q0r": 3, "q1": "Considering that the proposal is presented more as a statutory improvement than a project that will be implemented, it can be successful once it has enough votes from the community. ", "q1r": 4, "q2": "The proposal lacks a detailed description of the progress, criteria for identity, or the KPIs for the idea. ", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "If this is happening on a significant scale (i.e. people are creating alternative accounts and writing bad-faith CA reviews to damage competitors, and vCAs are giving inadequate reviews in either ignorance or bad faith) then that clearly needs addressing. But I'd like to see evidence on the scale of the problem, to ensure the proposed response isn't disproportionate.\r\n\r\nWouldn't fake CA assessments on any serious scale be easily picked up by Catalyst's existing automated checking processes? (e.g. surely if there's a large number of fake assessments, they would have copy-and-paste content?) Even if not, I would be very wary of rushing to  ID-checking as a solution. Demanding official ID is going to put off quite a lot of people from becoming CAs in the first place (and most of them will be those who are under-represented in Catalyst as it is), so that would actually be contrary to the aims of this challenge. \r\n\r\nAs for vCAs' alleged lack of knowledge – I don't agree with the idea that someone always has to have verified experience in an area in order to evaluate it. In fact, that it seems to actually run counter to the principles of distributed decisionmaking and of this challenge. The challenge talks about inclusive and accessible decision-making processes; but effectively saying \"Are you even qualified to have an opinion?\" is antithetical to that. Verified experience in a field doesn't necessarily help – there are many people who have lots of technical knowledge, but don't have the skills needed to assess a funding proposal. Maybe, if there is a problem with vCAs not understanding proposals, the better way to address that within the terms of this challenge would be to put the onus on proposers to write more accessibly, so that people are not so excluded from decisionmaking by a lack of knowledge? \r\n\r\nAlso, this proposal seems to be conflating the problems of vCAs lacking knowledge, and vCAs actually acting in bad faith. Obviously, addressing the latter *is* in line with the challenge – but again, I don't know that verifying a vCA's experience in a field would help. Someone can be a very skilled and experienced whatever-it-is – but they could still be totally corrupt, and give a biased assessment in order to damage a competitor.\r\n\r\nIn short, an important set of issues, but only some of them actually address this challenge at all; and in my view the proposed solution is not in line with the challenge.\r\n", "q0r": 2, "q1": "It's not exactly a proposal in that sense, so I don't think this is rateable. Obviously Catalyst *could* implement the proposed solution of some kind of ID checks – but as the proposal doesn't specify what particular methods should be used, we can't assess any issues around implementation such as cost, time, etc. ", "q1r": 1, "q2": "Again, I don't think this is intended as a \"proposal\" in that sense, and it gives no formal metrics, so it's impossible to say. But particularly, as it gives no baseline data on the scale of the problem now, we'd have no way of knowing if implementing the proposed solution has solved the problem or not. We also would be unable to audit the views of those who might have been alienated or prevented from taking part in Catalyst due to these measures, because they would have left.", "q2r": 1, "assessor": "z_assessor_540", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I fully agree with the premise of this proposal: that the vCA role has a lot of power by being able to add to the change of rating of a proposal and as a voter have also no doubt that there is a heavy reliance on the proposal rating. I also agree that the vCAs should commit their assessments in their full real name, as it already happened in the previous found, and to double check that a vCA is not reviewing their own proposal or CA rating (as is also done at least partially by IOG).\r\nWhat I disagree about is the requirement of vCAs to hand in documentation of their qualification, since I consider it a road block to inclusivity and arguably only pushes the point of failure to the entity storing this kind of information. In my opinion, putting an (arbitrary) hurdle of entry puts catalyst at risk of becoming elitist and preventing participation of people especially from developing countries, where record of qualification might be more difficult and/or not representative of the abilities of the person.\r\n\r\nThe above is my opinion based on being a vCA during all rounds and as CA during most rounds. Because I think the execution of the proposal would do more harm than good to the decision making in catalyst I rate it a 2.\r\n\r\nI want to strike out though that I applaud the intention and some of the propositions as mentioned above.", "q0r": 2, "q1": "While there is no risk in the target of the proposal being fulfilled: Getting the signal of the voters if they agree with the change of approach towards vCAs, it is not clear if a central entity (IOG or CF) would take over the responsibility to gather the information from the vCAs according to the proposal.\r\nFor that reason I give the proposal an inconclusive rating of 3.\r\nBetter rating could be achieved if there was declared willingness of an empowered custodian to take over the proposed task.", "q1r": 3, "q2": "All the information needed to assess the proposal are given.\r\nIt's made clear that the funding amount is symbolic to allow for a voting process. The changes to be done in case of approval are also well declared.\r\nSince I can't spot any missing pieces I rate the auditability of the proposal at 5.", "q2r": 5, "assessor": "z_assessor_619", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "アイデンティティとクレデンシャルに基づくVCAの選択", "experience": "Fund0からCatalystに参加しています。"}