{"id": 370088, "author": "", "title": "Oversight of Catalyst Circle", "url": "https://cardano.ideascale.com/a/dtd/370088-48088", "category": 26104, "amount": 7440, "description": "カタリスト・サークルには、独立した監督が必要です。\n\nカタリスト・サークルの監視を維持するコミュニティには、持続可能なサポートが必要です。", "f6_no_assessments": 11, "f6_rating": 4.636363636363637, "videos": [], "media": [], "f6_assessments": [{"q0": "This porposal ask for funding of a very decisive and 'official' role within the CATALYST CIRCLE. \r\n\r\nThis role has started out on voluntary (unpaid) basis, but requires now substantial work-effort of about 30 hours a month and needs to be funded (it is all about documenting and maintaining the work of the CATALYST CIRCLE in the correponding GitHub repository).\r\n\r\nAccording to my personal profesional experience, these type of work is absolutely essential for collaborative organizations - therefore my full support.", "q0r": 5, "q1": "The proposer, Stephen Whitenstall, has 30 years experience in organizing academic, community and business projects and is deeply engaged within CATALYST CIRCLE and SWARM. \r\n\r\nMajor elements of the proposal already exist and are heavily used. The proposal is mainly about the ongoing work of documenting and sharing the work of the CATALYST CIRCLE.\r\n\r\nWhat I can judge, usage and adoption are therefore highly secured - therefore my full support.", "q1r": 5, "q2": "The proposer has outlined the costs, roadmap and major elements of the work behind this proposal. All is based on already happening (currently voluntary) activities, which need to be fairly funded now. \r\n\r\nThe applied rates and the asked funding apprears very reasonable to me - therefore also my full support for this part of the proposal.", "q2r": 5, "assessor": "z_assessor_101", "no_vca": 23, "ne": 9, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "Yes. It may not be straightforward to everyone how documentation and more generally, information contribute to decision making, nevertheless, in time it should become clearer to Cardano supporters that documentation and information are fundamental for decision making in technological innovation, software development, and blockchain governance. This project does a very efficient job, founded by actual work done, in demonstrating how documentation for oversight can be achieved. Outside of the scope of the current proposal, I would recommend that the proponent considers how oversight will relate in the future to implementation (i.e.: sanctioning corrupt or inefficient behavior). The reason for this suggestion is that in the long run, oversight without sanctions/control would eventually become useless. Thank you for your proposal and good luck.", "q0r": 5, "q1": "Yes. The proponent provides us with confidence to support the project by having already demonstrated it without the precious economic undersigning. This is an example of innovation through execution and iteration.", "q1r": 5, "q2": "Yes. The proposal provides not only the information necessary to audit it but also the tools (links) to do so. In addition, the proponent has demonstrated availability and responsiveness to the Catalyst community. I highly recommend that if the proposal is funded, the proponent pay great attention to the automation and future decentralization of the oversight tools. It will be highly desirable that in the future, the tools developed here for project oversight can be transferred to other community members, to other projects, to future generations, and to decentralized communities. To achieve this, it seems desirable that the processes of documenting activities, publishing and disseminating will be as automated as possible and independent from individual human skills and dispositions (e.g.: going from automatic note-taking i.e.: 'subtitles generation', to social media posting).", "q2r": 5, "assessor": "z_assessor_183", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The ongoing work outlined in the proposal is to the benefit of the Cardano ecosystem and addresses the challenge effectively.", "q0r": 5, "q1": "The proposer has a track record of delivering value. The plan is detailed with a reasonable and understandable budget. It is highly likely that the proposal will be implemented successfully.", "q1r": 5, "q2": "The roadmap acts as sufficient metrics which can be audited by the community.", "q2r": 5, "assessor": "z_assessor_22", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The problem and solution presented are reasonable and within the scope of the challenge.\r\n\r\nDistributed decision making was one of the reasons that Catalyst Circle was created and is composed of 7 members from different sectors of the community. These members are representatives of large groups and different interests. Maintaining coordination across such a large community and with such broad and diverse interests makes the Catalyst Circle role essential to Cardano's governance. This proposal seeks to document, monitor and communicate information from the Catalyst Circle, so I see huge potential impact for the challenge.\r\n\r\nIt was established that the proposal will maintain documentation, monitoring and communication of information for 6 months, and an estimate of 27 hours per month was established for the fulfillment of these activities. These goals indicate a positive and evident impact on the challenge.\r\n\r\nI believe the inclusion of some goals/KPIs could more clearly demonstrate the potential impact of the proposal.", "q0r": 5, "q1": "The proposer described extensive professional experience in organizing academic, community and business projects and inserted sources for verification/attestation.\r\n\r\nThere is a link to Gitbook where it is possible to check the work already performed voluntarily by the proposer for a few months.\r\n\r\nThe proposal presents a comprehensive and well-structured plan, reasonable timeline There is a reasonable budget breakdown associated with hourly load x hourly rate.\r\n\r\nThe information presented indicates total feasibility conditions for the execution and the fact that the proposer has been developing the work for several weeks on a voluntary basis is an excellent indicator.", "q1r": 5, "q2": "There is clarity on the problem, solution and alignment with the challenge.\r\nThe fact that the development of the project is open source and maintains gitbook helps a lot in the audit process. A roadmap with goals was presented. I recommend adding metrics/KPIs for easy auditing.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The problem and solution description is within the scope of the challenge. The proposal is fully aligned with the challenge and has great potential to improve the documenting, tracking & communicating the activities, discussions and decisions of Catalyst Circle thereby making it more transparent and accessible to all. When this processes are improve , it will impact the community positively.", "q0r": 5, "q1": "The  proposer already actively participates in the Cardano community.  There are details about the experience of the proposer and his skills, signalling the qualification and aptitude  to execute the proposal. The Information Provided shows it is highly likely this proposal will be implemented successful . The Budget items  shows clearly what the money will be use for . There is comprehensive roadmap though no start date , I still score 5", "q1r": 5, "q2": "The proposal is very thorough. The url provided has substantial content. The road map and the budget is straight  forward. I like the weekly breakdown. I believe this is sufficient to audit the progress and success of this proposal. Since there is no definition of a start date , i score 4", "q2r": 4, "assessor": "z_assessor_430", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "It's important for a good decision making process to have a clear documentation and summary of everything, so this project will indeed be beneficial.", "q0r": 5, "q1": "The work ist already being done, so it's  succesful continuation is most likely. The hourly rate is a bit high for a documentation job and could maybe be set lower.", "q1r": 4, "q2": "It's easy to see whether the project is continued. It might be easier to audit if also certain quality criteria are set.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "having an independent oversight for a project is a good idea. It can help with many things, with controlling the content - approve, decline - etc.  Afterward, it can help the community to have filtered and relevant information.\r\n\r\nAlso, there are more proposals which are addressing the previous proposal, rather than the challenge, therefore, it would be nice to have another special :fund: where you can increase the budget for the previous proposals, due to the growth, or changes which increase extra work. \r\n\r\nFrom this perspective, this proposal is NOT addressing the fund challenge, because it is addressing another proposal that addressed the challenge effectively in the previous fund, so this one is addressing it indirectly. Therefore I put a lower score.", "q0r": 3, "q1": "approved. Also a very detailed schedule was provided (even tough there is no way how to control it, it feels real)", "q1r": 5, "q2": "time spent on the git book is stated. I do not find it as sufficient, maybe records on approved/declined/viewed posts would also be nice (if this is automatically traceable, and considered as a standard, then I would put 5)", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Fits the brief, has the potential to improve community confidence and answers positively \"Did we get better at distributed decision making?\"  Helps group decision making be accessible to newcomers.  Ensures the Catalyst process keeps iterating to improve.  ", "q0r": 5, "q1": "The proposer is qualified to bring the project to success, having already demonstrated this ability with existing documentation.  The budget is reasonable, and covers two rounds of funding. ", "q1r": 5, "q2": "The roadmap shows KPIs and the project is easily trackable and verifiable by visiting the GitBook.   ", "q2r": 5, "assessor": "z_assessor_607", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "As can be seen in other fields of catalyst, even though if information is publicly available it is not enough. Making the information accessible and easy to find, what one is looking for is a major factor to transparency. The proposer is already doing this on a voluntary basis at the moment and in my opinion, the provided links to his work are enough evidence of the value he adds.\r\n\r\nI fully agree that this work allows the community to make easier decisions by enabling them to get the information they are looking for.\r\n\r\nI rate this proposals impact at a 5 because I consider the service it will provide as essential to create widespread transparency about the catalyst circle, which is an important factor to all catalyst.", "q0r": 5, "q1": "Since the work that is proposed to be done is already ongoing, I consider it out of question that this proposal will be successfully implemented. Plenty of resources have been given to proof the capabilities of the proposer.\r\n\r\nThe compensation asked at $40/h is fair for the UK area, so the work should also be sustainable from a monetary point of view.\r\n\r\nThe biggest risk to implementation would be that the proposer can not continue his work because of unforeseen reasons.\r\n\r\nSince the mentioned risks are minimal, I give the feasibility of the proposal a rating of 5.", "q1r": 5, "q2": "With the demonstration of current work done, a detailed break down of time consumption of the work and a clear roadmap, there is nothing missing that would make the auditability unclear.\r\n\r\nProgress of the implementation of the documentation of catalyst circle is easily measured by checking availability of most recent activity documentation on the gitbook.\r\n\r\nI see no hurdle in auditability of this proposal and accordingly rate it at 5.", "q2r": 5, "assessor": "z_assessor_619", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Overall, this seems like an excellent, simple solution to the challenge of community participation and communication, as well as developing a community of committed leaders. Outsourcing and funding the administrative element of this role is generally scalable, however, you will likely have to keep adding resources if we want to truly impact the community on a global scale. This is still however, a good starting point. Any voter who understands the challenges and the whole point of the Catalyst Circle should be able to see the value in this and be able to vote effectively on it. In terms of value to the fund, effectively outsourcing the admin and social outreach/marketing, should be good value as specialists (as opposed to volunteers) will be paid to deliver, thus making the whole thing more efficient and slick. ", "q0r": 4, "q1": "Broadly, the proposer appears to know what they are doing and I believe that they will be able to set this up. However, the funding and time commitment (especially for the marketing/social media part) seems insufficient. 4 hours a month (or an hour a week) seems as though it would be the bare minimum. It would cover the \"communication\" part of the proposal but not the \"promotion\" or \"engagement\". If we truly want it to create impact at scale, more hours and more thought will need to go into this part of the proposal. I say this as someone who has been marketing for over 10 years. ", "q1r": 4, "q2": "The milestones and KPI's are clearly well defined. They seem very transparent however, there are no identified risks or challenges. This could be because there aren't any obvious ones but it would be good to see this considered in the proposal - as a qualified project manager (Agile), I would suggest there are always going to be some risks and challenges!   ", "q2r": 4, "assessor": "z_assessor_620", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Auditing and governance are very much alike - hard to motivate when its there and things go right but missed when things go wrong and also it is keeping things within parameters of stability. \r\nif you don't have some form of objective checks, you can operate on a cliff edge and not even realise it.\r\nSo the function is important. Having too many checks can be counterproductive - and it is usually because the processes are not continuously reviewed objectively.\r\nTherefore as the recording/record keeping is very operational and administratively tedious and time consuming - its definitely necessary to manage that cliff edge risk.", "q0r": 5, "q1": "I do see that a next round of funding will help to establish this needed function more.\r\nMaybe I've missed it, but I would like to see more metrics/kpi's and trendlines against Circle's e.g. \"consitutional/guiding principles\" or the four major goals:\r\n1) To facilitate communication between the different functional groups\r\n2) To provide a heads-up when red lines are crossed within a certain group\r\n3) To suggest improvements on plans and processes that shape Project Catalyst\r\n4) To define the election process for Circle V2\r\nMaybe this can even start off to be soft evalaution and be done against member sentiment or a quick town hall or swarm vote/poll.\r\n\r\nAlthough this is limited to fund 6 - I do agree that this is also be included in fund 7", "q1r": 5, "q2": "the momentum is there, the need is there and it seems as if the detail is there - but I do miss more definition on what documentation and tracking is going live. \r\nAlso this roll out to be accompanied by some dashboard/Traffic light tracker with e.g. RAG status against this defined documentation and tracking .", "q2r": 4, "assessor": "z_assessor_633", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "カタリスト・サークルの独立した監督を行う。\n\nカタリスト・サークルの活動を記録し、追跡するアクティブなサイトを提供する。", "experience": "スティーブンは30年にわたり、学術、コミュニティ、ビジネスのプロジェクトを組織してきた経験があります（詳細はこちら）。"}