{"id": 381294, "author": "carnivilla", "title": "Onboarding Untapped Communities", "url": "https://cardano.ideascale.com/a/dtd/381294-48088", "category": 26241, "amount": 50000, "description": "Os jogadores das comunidades do tipo Metaverse carecem de funcionalidade e propriedade com sua propriedade digital e os ativos de seu ambiente.", "funded": 1, "upvotes": 29243871, "downvotes": 20588156, "votes_result": 8655715, "votes_cast": 151, "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=18987"], "media": [], "f6_assessments": [{"q0": "Esta proposta é muito interessante porque não promete criar um jogo em si, mas um ambiente virtual no qual jogadores de diferentes jogos podem interagir e aprender a usar as tecnologias que a cadeia de bloqueio promove de forma mais eficiente e prática, como o NFT, por exemplo, que segundo os autores da proposta será visto como algo básico para o jogador administrar. Creio que é uma idéia muito relevante porque apesar do universo da cadeia de bloqueio já ser uma realidade, esta tecnologia é muito mais conhecida em alguns pontos do que em outros, e é difícil para uma pessoa aprender sozinha que cadeia de bloqueio, moedas criptográficas, NFT, etc. . Mesmo que a pessoa seja do mundo dos jogos, dependendo do contexto em que está inserida, ou seja, se for um país/cidade em que pouco se fala e se sabe sobre o mundo da criptografia, muito provavelmente esta pessoa terá alguma dificuldade para entrar nele. Se tudo correr bem, ou seja, se nossa cadeia de bloqueio se tornar cada vez mais popular e o uso de NFT nos jogos se tornar uma prática generalizada, as pessoas que não têm orientação adequada sobre como lidar com eles certamente serão prejudicadas. Acredito que esta idéia está bem relacionada ao objetivo mais geral do Cardano também, de construir um mundo mais igualitário, mesmo que apenas nesta parte específica dos jogos. Gostei, acho que se for financiada e executada com sucesso, pode trazer novos membros para o ecossistema Cardano, que provavelmente trarão outras pessoas também para a cadeia de bloqueio, e assim por diante, uma rede pode começar a ser criada pouco a pouco, e de maneira a um dia atrair muitas pessoas para Cardano. Acredito que é uma proposta muito interessante e que tem grandes chances de trazer resultados muito positivos.", "q0r": 5, "q1": "A equipe se preocupa em fornecer uma breve descrição de cada membro, na qual conhecemos seus nomes e suas funções, bem como (em alguns casos) quanto tempo a pessoa tem experiência em uma determinada área de especialização. Apesar disso, seria ainda mais interessante se eles fornecessem uma página de rede social para cada um, linkedin é sempre, em minha opinião, a melhor opção, pois podemos ver ali as experiências e conexões passadas de cada membro, para que você possa conhecê-las mais intimamente. No entanto, aqui temos algumas falhas graves. Algo que me preocupa é que, apesar de parecer capaz do projeto, nenhum dos membros da equipe afirma ter envolvimento direto com nossa cadeia de bloqueio. Isto seria importante para garantir que Cardano se beneficiaria diretamente, existem outros lugares onde os jogadores podem cunhar seus nativos digitais, existem várias possibilidades de interagir com a cadeia de bloqueio; é necessário que tenhamos certeza de como a nossa será usada aqui, pois, caso contrário, não é interessante financiar o aprendizado dos usuários que não sabem ao certo se usarão as tecnologias de Cardano. A propósito, não está claro se eles seriam capazes de ensinar o que propõem, qual membro da equipe tem sólidos conhecimentos sobre a cadeia de bloqueio, NFT, etc.? Isto não está explícito na descrição que nos é mostrada, infelizmente precisamos saber se eles estão preparados para o projeto em si, além de suas experiências fora do universo criptográfico. Sobre a divisão financeira, a equipe nos fornece informações sobre como o montante total seria dividido, dando-nos explicações para cada tópico. Isto nos dá uma boa compreensão de como esta parte do projeto se desenvolveria. O roteiro é satisfatório em termos de detalhes, seriam 6 meses, divididos em dois grandes blocos, que sabemos quais atividades aconteceriam em cada parte, para que tenhamos uma visão mais sólida do que está por vir. Entretanto, devido às questões que envolvem a qualificação da equipe para lidar com os problemas do ecossistema Cardano, eu diria que este tópico precisa ser reformulado, para que ele transmita mais confiança e segurança na equipe.", "q1r": 3, "q2": "A equipe nos fornece dados diretos sobre a auditabilidade, há definições de sucesso esperado de acordo com a passagem do tempo. Há dois tópicos, especificando como o projeto seria bem sucedido. Desta forma, podemos monitorar diretamente os resultados possíveis. Também seria possível acompanhar o desenvolvimento do próprio projeto, através das atividades que foram descritas nas fases. Acho que a audibilidade poderia ser feita assim: escolhemos um ou dois membros da comunidade para acompanhar este projeto, entrar em contato com a equipe e coletar os dados. Monitoramento, que pode ser trazido à comunidade através de relatórios. Seria extremamente importante que a própria equipe também nos desse satisfação com o processo, não apenas com os resultados, para que possamos entender como o produto final está sendo construído além do que é obtido no final do processo. Portanto, acredito que sim, a equipe fornece informações importantes para monitorar o projeto, mas gostaria de estabelecer contato direto e constante entre a equipe e o resto da comunidade Cardano, a fim de transmitir mais segurança em geral.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is aimed at an untapped community that would be able to interact with the cardano blockchain seamlessly to bring wide adoption. It would target gamers who are active in marketplaces and provide them with value and a reason to adopt cardano.", "q0r": 5, "q1": "This team has exprience in events, digital creation, and gaming, but it is not clear who will be doing the blockchain/NFT development and what their experience is with such. They have the two partner companies with relevant product experience, but their blockchain development is not clear. This proposal would benefit from providing more details on if that will be outsourced with the budget and who will be doing it.", "q1r": 4, "q2": "This proposal would benefit from breaking down their ideas of success down futher to judge the development vs the initial launch progress. The budget breaks down what the funds are spent on, but could be more comprehensive to improve auditability.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Even the problem can be within the challenge, because at my point, their idea with VR can make something special to Cardano communities and it can make our ecosystem become diverse but I'm not sure it is the direction of the current proposal or not? They should have more words to explain to us how their model will impact this challenge. Or providing some key metrics, goals that they plan to get can also help us know about that. \r\nBecause of lacking a lot of these thing I rate them 1 our of 5, hope that they will have a better proposal in next fund. ", "q0r": 1, "q1": "Seem that the team has great experience to finish their proposal easily. In addition, they also divide their phase into small pieces in their roadmap and explain how their people will solve it in the funding allocation. So, I believe that within this proposal scope, its feasibility is 4 out of 5. \r\nAnother thing they should provide is the risk of their proposal and how they will solve it. The fact is with the info inside this proposal, I cannot estimate which risk they will get because of their experience & they're doing well everything for their project and this proposal is just a small step of their development. ", "q1r": 4, "q2": "But they should give us some key metrics, this will help us clarify what they want to get and how it can help our communities. Technically, I rate the feasibility high because of their ability and project situation but they're lack something for us to audit their work. Providing key metrics, detailed explanations about the solution will help people in our communities assess their purpose better. Even we can track their work on their channels that are shown on their website but better be clear here in the proposal. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I'm not sure what detailed solution and how they will solve their problem in detail. Indeed, that their problem is lying in the scope of this challenge but the info in the proposal is not enough to explain how it will and can't help us on assessing the level of impaction to the challenge. \r\nMoreover, even this project is running but this proposal will have its own goals and the proposer should prove some key metrics that they will track when running in the scope of 10 weeks that they're already mentioned in their funding allocation. ", "q0r": 2, "q1": "As a developer, I can understand a bit with the info they shared in the funding allocation but they should have a more detailed explanation about these technologies, also be better if they have more info on the solution explanation - it will help us assess their step of development better. \r\nBut I think that this team can solve this proposal because their project is running in real life and the team info can show their professional skill that suits their job. \r\n", "q1r": 5, "q2": "Again, lacking detailed explanations about their solution can't help us clarify their goal within the scope of the proposal. \r\nEven they have a detailed roadmap and explain what they will do and use their fund, but I think the proposer should provide some goals, key metrics - it will help communities measure it. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This on-chain game also brings in a virtual reality component which will only continue to be more popular in the future. Using this challenge's funding in this manner is a good way to ensure Cardano is on the cutting edge.", "q0r": 5, "q1": "Yes, the team's experience will lend to its success. Additionally, you can tell from the KPIs, project roadmap, and budget breakdown that the team has approached the planning process thoroughly.", "q1r": 5, "q2": "Yes, the detailed KPIs, roadmap, and budget breakdown are sufficient for auditing the project's progress and success.", "q2r": 5, "assessor": "z_assessor_788", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "VR NFT based game proposal is effectively addressing the gamers on-chained challenge.", "q0r": 5, "q1": "The team has experience building VR apps for events and has presented a complete plan to build out there metaverse platform to create gamified learning and community spaces for Cardano community members. ", "q1r": 5, "q2": "The information in the roadmap, defined success, team and budget sections are very useful audit items.", "q2r": 5, "assessor": "z_assessor_805", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "A bordo de comunidades VR para interação básica da cadeia de bloqueios dentro de ambientes gamificados imersivos.", "experience": "A equipe realizou dois eventos onde os participantes foram ensinados como acessar e interagir com a cadeia de bloqueio em um ambiente NFT do mundo real."}