{"id": 381663, "author": "mr.mietrich", "title": "Sandbox-MMO for language learning", "url": "https://cardano.ideascale.com/a/dtd/381663-48088", "category": 26241, "amount": 33600, "description": "Os jogos são considerados uma perda de tempo/vida. A maioria dos sistemas educacionais são altamente inapropriados, inacessíveis, discriminatórios ou desmotivadores.", "funded": 1, "upvotes": 84580841, "downvotes": 6399856, "votes_result": 78180985, "votes_cast": 278, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=17968", "https://www.youtube.com/watch?v=MGzPAFHAgyc"], "media": [], "f6_assessments": [{"q0": "A idéia se enquadra muito bem nos objetivos do desafio, pois pretende criar um jogo de alto impacto para o ecossistema Cardano. Em sua introdução, os autores dizem coisas muito interessantes, como o fato de o jogo ser disponibilizado em vários idiomas para que possa atingir a metade da população mundial (segundo eles). É ótimo que eles tenham em mente como o conceito de que \"jogos não podem ser úteis\" está desatualizado, e queiram quebrar esse paradigma. E também achei muito positivo como eles conceituam o que MMO e Sandbox seriam, de modo que as pessoas que não estão tão familiarizadas com ele venham a entender plenamente sua proposta. Assim, fica claro que o objetivo é criar um espaço de aprendizado interativo, onde cada língua representaria um mundo e o jogador poderia escolher seu papel. Quanto à forma como o jogo se relacionaria com a cadeia de bloqueio Cardano, a equipe explica que as moedas podem ser trocadas por ADA, alguns caracteres são NFT e os jogadores formariam DAOs diferentes, e outras formas de cunhar as informações de forma descentralizada. Portanto, acredito que esta proposta é de alto valor e atende ao que buscamos no desafio, pois promove uma criação mundial muito interessante não apenas para diversão mas também para aprendizado, e utilizaria várias tecnologias do sistema do ecossistema para trabalhar.", "q0r": 5, "q1": "A equipe parece ser muito capaz, pois já tem projetos financiados na f6 (seria interessante mencionar quais), tem outras propostas no mesmo fundo e anexa um website onde podemos ver um pouco mais sobre seu trabalho e também descrições individuais de cada membro, que incluem um pequeno resumo de quem são e links para suas mídias sociais. Desta forma, é muito certo que eles têm o conhecimento para executar a proposta com sucesso. Eles nos fornecem um roteiro muito detalhado do que precisa ser feito no futuro próximo, e este detalhe é essencial para que possamos compreender plenamente o processo em si, uma vez que o projeto é complexo. É positivo, pois eles explicam o projeto ao longo dos meses, e não apenas fazem um \"quadro geral\" das atividades que seriam desenvolvidas, tornando a especificidade alta e a compreensão muito mais sólida. Sobre a divisão financeira, apesar de ser um montante elevado, é justo. O jogo é certamente um projeto que exigirá várias horas de trabalho dos envolvidos, como detalhado na descrição da proposta, eles trabalharão duro e receberão um salário mensal de US$ 1.200, o que eu acho justo para o trabalho. Esta parte da proposta não é tão detalhada, mas acho que o que foi dito é suficiente para promover um bom entendimento também aqui.", "q1r": 5, "q2": "A equipe nos fornece uma série de KPIs (e algo inaudito em minha opinião, não vi nenhuma outra proposta determinando KPIs de longo prazo até agora), mas eles são relativamente sintetizadores. É possível monitorar o projeto através deles, mas eu gostaria de ter um monitoramento mais próximo, eu diria. Por exemplo, vou citar a língua francesa; seria interessante para a equipe fazer uma ponte entre os participantes de nossa comunidade que não têm essa língua e o próprio jogo, para que eles possam dar opiniões e fazer testes, mesmo antes do jogo ser lançado para o público em geral. Seria ótimo se a equipe fizesse uma visão geral das informações e apresentasse tais resultados em algumas prefeituras (digo no mesmo plural, porque, como disse, é um projeto grande e complexo, portanto, acredito que apenas uma apresentação não seria suficiente). Gostaria que a equipe se aprofundasse ainda mais na auditabilidade para que possamos compreender 100% das informações que já nos fornecem.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "This idea will make a big change to the way billions of people learning language and skills around the world because language and skills are important to everyone in the world that is unlike other game ideas is trying to get players to engage with their gameplay and style only. And with their vision of success and plan to work on Cardano network, I believe that when the team successfully launches it, there will be a lot of people joining and developing. Therefore, it can help to directly increase the gamer into Cardano communities as this challenge set. ", "q0r": 5, "q1": "After looking around on their team info I think they can solve their idea well, they're all talented and skillful in their field. My only considering thing when assessing the feasibility of this proposal is risks on their way. Everything in the proposal is perfect but I think that they should figure out the risk for preventing them. \r\nMoreover, their detailed explanation of work and technology is one of the silver bullets that I believe they will finish their job very well.  ", "q1r": 4, "q2": "They have a good roadmap and key metrics that can help Catalyst tracking when successful funding. And they have a very detailed explanation of how their awarded problems and ways they solve them. With those goals and visions, I think it's enough for auditing their work so far. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "It is incredibly good that there are projects that bring value through playing and learning to the Cardano ecosystem. The problems that the team points out are real and it is great that solutions are being offered. The game through which it is learned and which has been translated into several world languages definitely has an positive impact on the Cardano ecosystem. It is great that KPIs indicated in the proposal match the ones indicated in the challenge and that they are able to scale future challenges and everything is in place.", "q0r": 5, "q1": "This is a team with serious intentions and everything is transparent. There is an account with experience and skills that are necessary to deliver what is explained in the proposal. The website looks good and I could easily found all the necessary information and skills, knowledge that one team should have. The proposal clearly shows the budget needed for the project, but it would be better to have more information on how the team members will distribute the money. It can be seen that the money goes to the salaries of the people working on the project, but it remains unknown what will happen to the $ 4,800 money if they don't find another Plutus programmer. There is a detailed implementable plan and it is very well developed and the amount of money required is reasonable for this amount of work and the realization of the project itself. The team does not mention additional funding, so no additional plan has been developed. The team sets up real timetable to complete the work and the plan they gave describes the resources necessary to implement the proposal everyting is covered. The team in the proposal does not mention the possibility of potential risks so we have no solutions if certain risks arise.\r\n\r\n", "q1r": 4, "q2": "The team made a great roadmap with milestones with dates which gives us confidence that the project will be realized. KPIs are also interesting because they are divided in standard KPIs and long term KPIs which is great because the success of the project can be measured. Yes, yes, the progress and development of the project can be easily monitored by the community.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "There are a lot of people still has strong bias to gaming that waste time and useless, it's one of the big problem within challenge. \r\nAnd this proposal show that they can make a change by their own solution that will make big impact to Cardano ecosystem. \r\nAnd the idea that this proposal make can drive million of people to join. ", "q0r": 5, "q1": "Proposal show the clear roadmap and their budget is reasonable that help the team with minimum requirements to reach their goals. \r\nIt also shows the team with their job in this project very clearly, and they're great skillful people in their field that can make the project succeed. \r\nMoreover, the explaination about the system will develop and game model are very clear to help us assess their work. But I think it's better if they can detail more about their roadmap and tasks of every individual team members. ", "q1r": 4, "q2": "Proposal shows clearly the roadmap and KPIs that just enough for the auditability, but I think they should detail more the KPIs with the numbers. \r\nIt also have a very detail problem and solution of their idea to solve them, especially they describe into case study that can help everyone easy to understand with it. \r\nThat all clearly that can help CA and eveyone can audit the project and help assess it better. ", "q2r": 4, "assessor": "z_assessor_670", "no_vca": 17, "ne": 3, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "I think this project will drive a lot of people to their ecosystem because language and day life skills are always the important and vital things that billions of people need for their life, including work, study, travel... and their way of development the idea can effectively attract and keep users stay with the ecosystem. Indeed, it has a strong impact on Cardano communities when it succeeds too. \r\nI believe that their vision of success will make a big difference to currents centralized projects out there, they're all not designed like a game or even with gamification ideas, that's boring. ", "q0r": 5, "q1": "The roadmap for the development of this proposal is detailed enough to estimate their works, and I think they can do it well with their experiences and skills. But for more clarity about the budget, my advice for the proposer is that should outline the roadmap in more detail because the fund you're asking for is monthly not by group tasks. Moreover, the outsourcing budget also should point to the tasks that will be used.\r\nAfter reading some other proposals of this project I think the proposer should provide some risks and your solution for getting rid of them. This project is huge and complex to go without any risk. ", "q1r": 3, "q2": "I hope that I can see some number in their KPIs, and should add some more key metrics related to the challenge setting that their project can get, for ex: language learners, gamers, social engagement... \r\nIndeed, they have a very detailed content of problem with case study and explanation, then they show how their project to solve those problems very well. It can help Catalyst audit the project well with clear milestones and goals. Hope that this project will succeed to make a big change to this world. ", "q2r": 4, "assessor": "z_assessor_671", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "Jogar para aprender e aprender MMO para compartilhar a experiência de aprendizagem e colaborar em ambientes 3D seguros, ativos, exploráveis e construídos pela comunidade.", "experience": "UX/UI Design, Full-Stack-Dev, Plutus/Atala Pioneer, Sound/Generative Artists, Procedural Modelling, Cultural Scientist, Translator, Game Dev"}