{"id": 382474, "author": "angelferndz", "title": "Simple Play to Earn Game", "url": "https://cardano.ideascale.com/a/dtd/382474-48088", "category": 26241, "amount": 25000, "description": "Não há jogo suficiente para ganhar jogos sendo desenvolvidos em Cardano.", "funded": 0, "upvotes": 15991419, "downvotes": 14595773, "votes_result": 1395646, "votes_cast": 141, "f6_no_assessments": 5, "f6_rating": 2.4666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal problem statement and solution are aligned with the challenge. Also, the key metrics and goals of this proposal are aligned with the outlined challenge settings. However, this proposal did not clearly explain on how will it add value to the Cardano ecosystem. ", "q0r": 2, "q1": "The proposer did not provide evidence of verifiable information on relevant skills and experience needed to implement the project. Please leave a link to your linkedin profile of github repo. The proposer also did not present the required manpower and resources to successfully implement the project. The budget presented is not outlined clearly and broken down into identifiable terms. Therefore, with the budget requested, it is not convincing to achieve the set goals. Furthermore, this proposal does not provides a sensible and conductible plan for implementation. How will the user interact with Cardano? By using what wallet? In addition, the proposer fails to provide a risk management plan. \r\nWhat is your contingency plan if there are challenges along the way that requires additional funding?\r\n", "q1r": 2, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. The proposer also provided key metrics and KPI that define the success of the proposal. However the proposer did not provide any information for the voters to keep track of their progress. Please provide a link to your social media or github link for accountability.", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "The solution is compelling, and would be great if the proposer provide an example or prototype of how the P2E game would be. As what is important for attaining fund, primarily the visualization of the vision and objectives of the project. How is this going to adopt new users into the Cardano ecosystem, what type of marketing approach is used to gain more confidence into the game? What backs the belief of why NFT(s) should not be created. A list of key metrics should help create a scalable solution.", "q0r": 3, "q1": "With 10+ years of software development, it is possible to create the game. Without a thorough visualization of how the game is going to be will create unavoidable risks. A good idea is to have a wide range of team that supports the project through marketing, business vision and scalability of the project. For example, how do we captivate a strong brand for the community to eventually play the game? What is the requirements and in-depth for solution for the future of the system? ", "q1r": 2, "q2": "As stated, an in-dept factors and key points for allocation of budget is essential. All the \"how(s)\" and \"what(s)\" need to be addressed to have a solid game plan. Thus, this will have an easier auditability and to progress for this great idea!", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The idea of browser game that would focus on cooperative mining seems interesting. There could be a nice market for that. It could be simple to play game that could attract people with different background and age groups, which is a good thing. The fact that it would be based on Cardano testnet is interesting. ", "q0r": 4, "q1": "Although the idea seems interesting and has a good potential, there lacks more explanation how the actual steps would look like. The developer has 10+ years of experience and the game probably wouldn't be too complexed so it wouldn't require a bigger team to make it happen. It is a 24 months long project, so it would take some time before the benefits to the community would show.", "q1r": 3, "q2": "At this moment I would have to say that there is lacking explanation how the progress would be monitored. There is a general plan divided in stages by 6months and as the game itself will probably not be too complexed it is ok for start. But would love to see a little bit more elaborated plan.", "q2r": 3, "assessor": "z_assessor_672", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "There are no known games yet in cardano, so within this challenge, a cooperative mining game fits perfectly with the challenge. Gamers will be atracted to de ecosystem of Cardano by playing their games on chain.", "q0r": 5, "q1": "More than 10 years of experience but, how to measure it? How do we know that it is real? We need more information about the team.  The plan is not detailed and the roadmap is very little explained.", "q1r": 1, "q2": "A list is provided for auditing the success but I think that is more reasonable to provide a more measurable list and of course order it in a timeline. I miss KPIs, they are very needed here.", "q2r": 2, "assessor": "z_assessor_830", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Conceptually, this is not a bad proposition, a browser-based cooperative game built using Godot, the game will focus on cooperative mining and simple PvE.\r\nIt will attract gamers especially those who have a hobby of playing simple games.", "q0r": 3, "q1": "It is important to have more detail regarding the number of people involved, estimate hours and allocated budget to the different work packages for project implementation. Since the proposal does not detail how the project can be sustainable over time, it would appear that budget allocation would be necessary in the future, however, there is no mention regarding this in the description.\r\nThere is a lot of factors at play here and a lot of possible outcomes depending on the approach and team behind this. To attract more team members to actively join you, I would suggest you ad more info and evidence regarding your experience. Like past projects you worked on or a profile site. Github page etc. Even a prototype of what the website could potentially look like would give voters and CAs a good glance at your skills. Don't give up on this project. Keep looking for people to help you and join you on this journey. With the right team you can make this project become a reality.", "q1r": 1, "q2": "Definition of success is clear, however, same problem as explained earlier, there needs to be a roadmap/detailed plan (complete with time horizon) in order for this project to be audited successfully.. This will be easier to do with a full team behind this project.\r\nNo clear plan is provided regarding what the funds would be spent on, this has been provided, but it is too sketchy, I think the proponent should provide more information such as estimated working hours, budget allocation for those jobs...\r\nDespite being a great idea there isn't enough information provided to have the capacity to audit the proposals progress and potential success of it.", "q2r": 1, "assessor": "z_assessor_862", "no_vca": 18, "ne": 4, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Criar um jogo cooperativo baseado em navegador construído usando Godot, o jogo seria focado em mineração cooperativa e PvE simples", "experience": "Desenvolvedor de software com mais de 10 anos de experiência."}