{"id": 382030, "author": "bitsoko", "title": "MSM Merchant Fund", "url": "https://cardano.ideascale.com/a/dtd/382030-48088", "category": 26243, "amount": 185000, "description": "Les petites entreprises ne disposent pas de la transparence/des documents financiers nécessaires pour obtenir des fonds auprès des banques traditionnelles pour leur expansion ou leurs opérations.", "funded": 0, "upvotes": 17826962, "downvotes": 23429949, "votes_result": 5602987, "votes_cast": 127, "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"q0": "The measurable goal for this challenge is for 4 new teams to deploy DeFi dapps on Cardano in 2022. This proposal fits into that setting in that they are new to Cardano/Catalyst (according to their profile being created in Nov. 2021) and that their dapp idea is DeFi related. I'm giving 4 stars instead 5 for 2 reasons. 1) In the challenge \"Potential Directions\" section microfinance (how I would categorize this project) is not mentioned. However, I believe it to still be within the scope of \"DeFi.\" 2) The challenge is measuring dapps on mainnet within 3, 6,and 12 months. This project's timeline lists mainnet at 12 months which is cutting it close. ", "q0r": 4, "q1": "The Bitsoko services attached explainer video and presentation deck gives me a high degree of confidence in their ability to complete the project. They already have working infrastructure and at least one onboarded client. Based on that and their Github activity I believe they have the technical capability. They have a defined timeline that is reasonable. The largest problem with this proposal is the budget which in the proposal details is over the maxmum amount laid out in the proposal of $50,000USD. Upon review of the comments section it is stated that they scaled down the scope of the proposal and requested the amount of $50,000 but were unable to make that change in the proposal details. I feel I must give lower star rating because of that. Perhaps they missed the deadline to edit their proposal? I think this is a great proposal and would give a higher rating if the budget request was within the parameters of the challenge in the proposal details.", "q1r": 2, "q2": "This proposal has a clear roadmap with milestones that align with the challenge setting. They have identified a problem in their country/region that impacts the everyday life of a large population of people and have put forth a solution that addresses it. These types of solutions and this way of thinking is how prosperity can come to many people. To audit when they hit their milestones, how many users they have, and how much economic activity is happening on their dapp is measurable.", "q2r": 5, "assessor": "z_assessor_295", "no_vca": 17, "ne": 3, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "This is a great idea with the potential to impact the F7: Seeding Cardano's Grassroots DeFi challenge and answer the question, \"How to encourage new teams to Deploy Defi Solutions on Cardano?\"\r\nThis proposal fails to meet the intention of the challenge \"to sow new teams, who have never received funding from Catalyst so they can have a chance to show their value to the community.\r\nEach new team can request up to 25% of the total $200,000 USD budget, ($50,000 USD) Becoming familiar with and understanding the challenge brief will correct this oversight in future iterations.\r\nA Proposal for $185000/$200000 does not qualify for this challenge. (Over 90% of total)\r\n\r\nWhat this proposal does is:\r\n*The proposal identifies a problem that has the potential to impact the challenge: Onboarding merchants, investors, and users in Ghana to the Cardano blockchain is a \"bridges creation scenario, [where] projects are turning to Cardano to create their DeFi projects.\"\r\n\r\n*Only one of the key metrics and goals of the proposal aligns with the outlined challenge settings: DeFi dapps were launched on Cardano mainnet within 3, 6 and 12 months after funding.\r\n\r\nWhat this proposal does not do (yet): \r\n*The proposal has not articulated how it will add value to the Cardano ecosystem.\r\n*Due to lack of clarity & specific details of implementation, it is unclear how the proposal will be able to scale to address future challenges.\r\n\r\nFurther advice on improving quality and increasing the low rating of this proposal follows in the next 2 sections.\r\n(1) I strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "This is a good first draft of a proposal for an interesting idea. By taking to heart the following critiques and buckling down to work, the next iteration of this proposal will see improved ratings.\r\n\r\n* The proposer does not provide evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal.\r\n\r\nFrom the proposal, the only clear reference to experience is \"we've been developing bitcoin solutions for merchants since 2013 and with smart contracts since 2016 as a team of 3 devs and 2 research/comm\" which in itself is too vague and without evidence of actual accomplishments. From page 3 of the \"Community Advisor Assessment Guide - Fund7\" Doc: https://docs.google.com/document/d/1g-iZhDlKhUBZkui1uv8NVNfJC4oVD3JtR-P6Fue7XPU/edit#, \"it is encouraged that proposers prepare their proposals at a level suitable for most voters.\" If the evidence of experience is to be found in the GitHub repository at https://git.bitsoko.org/bitsoko, the average voter will not be able to deduce experience or lack thereof. Adding specific details & tangible evidence of experience will improve ratings on the next iteration of this proposal.\r\n\r\n* The proposer has not identified the type and number of team members required to implement the proposal. As a community, we have no idea who is behind \"BitsokoKenya.\"\r\n\r\n* The budget is not outlined clearly and broken down into identifiable items.\r\n\r\n\"Grant Fund would be used to fund development of merchant pools and assets, merchant tokenization training, creating fundraising awareness within the community and greater public.  MSM Fund will be solely for already existing businesses who need to tokenize or expand their operations.\" This must be thoughtfully worked out & clearly indicated in future proposals.\r\n\r\n*The budget is much too high, requesting $185000 out of the F7: Seeding Cardano's Grassroots DeFi challenge budget of $200000 and fails the criteria: \"Each new team can request up to 25% of the total $200,000.\"\r\n\r\n*The proposer has not provided a verifiable plan for the additional funding required to implement the proposal: \"After 3 months we expect to have raised funding for...\" \"After 12 months, we will have launched publicly on cardano mainnet to enable merchants from around the country to raise capital and manage funding using smart contracts.\"\r\n\r\n*The proposal does not offer a realistic timetable to complete the work, as the work to be done is unclear what needs to be done when. The \"work\" is not defined clearly enough to verify what the milestones actually are. \r\n\r\n* The proposal does not provide a logical and conductible plan for implementation that shows what is being done and how it will be completed.\r\n\r\nMilestones are simply summaries of 3 month intervals. Specifying the details of activities during these 3 month periods, will increase confidence in the feasibility of this proposal.\r\n\r\n*The plan does not describe the resources necessary to implement the proposal. Connecting to the Catalyst community and becoming more familiar with Cardano in general, will help the proposer find the resources, collaborations, & guidance to turn this idea into a feasible, workable proposal.\r\n\r\n*The proposal does not explain technical aspects like architecture, language and technologies as these are crucial for implementation: Explanations are in generic terms: \"smart contracts deployed on cardano\" (Cardano), \"a liquidity pool, managed by an Automated Market Maker contract, which will hold investor funds on behalf of merchant. Contract will perform functions such as paying for supplies, rent, and more and will receive customer payments from completed orders. Investors will be rewarded per completed (customer order) transaction and will be able to withdraw or add funds on merchant pool at any time after a minimum lock period. Rewards will be proportional to the investors share of the pool.\" It is not clear to the general voter how this will take place, other than just sounding technical.\r\n\r\n*There is no indication that challenges and risks relevant to a successful implementation have been considered other then a reference to \" We have already registered in Ghana and we are in the process of acquiring regulator approval in Nigeria as well and are ready to work with merchants there.\" Evidence of registration in Ghana would add legitimacy to this proposal.\r\n\r\nAddressing the missing elements, including links to relevant work done so far and taking the time to clearly express these will greatly improve the rating of this proposal in a future fund.\r\n\r\n(1) I strongly disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 1, "q2": "Building on the basis of this proposal, following proposal guidelines, connecting to the Project Catalyst community, and incorporating the following critiques will help improve this proposal for Fund 8.\r\n*This proposal has a \"summary\" roadmap. Clarifying and explicitly stating milestones and a time horizon for each achievement would greatly improve this proposal.\r\n*The metrics/KPIs for the success of the proposal are hidden. \"The Micro, Small and Medium Fund will enable upto 50 selected businesses to raise funding and enable investors earn rewards using smart contracts deployed on cardano\" is an intro. KPIs must be spelled out explicitly. \r\n\r\nBy scrolling through various proposals on ideascale, commenting on proposals, asking questions, & participating in workshops hosted by the Catalyst school, the proposer will become familiar with the expectations of a high quality proposal requesting funds from the Cardano community treasury.\r\n* This proposal does not have a clear understandable description of the targeted problem: The Problem statement : \"Small enterprises don't have required financial transparency/records to raise funds from mainstream banking for expansion or operations\" needs further development and an identifiable target market.\r\n*This proposal does not have a clear understandable solution to address the problem as indicated. The solution that should be fleshing out:  \"we enable businesses to manage finances using smart contracts deployed on cardano,\" is encrypted in buzz words and technical sounding jargon. \r\n\r\nA high quality proposal is possible with hard work, due diligence, and commitment to learning from the Project Catalyst Community.\r\n\r\n(1) I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 1, "assessor": "z_assessor_500", "no_vca": 19, "ne": 8, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "I understand this proposal provides a smart contract to connect rewards investors and companies or small businesses that need quick, easy loans. This is a practical good idea when more and more companies or small businesses that are effective but affected by the Covid epidemic want to return to work after the epidemic is under control. When funded, it will help them operate again and bring benefits and rewards to investors. Proposal in accordance with the requirements of challenge", "q0r": 5, "q1": "The proposed team should disclose their identity, expertise and experience in the relevant field. The proposed amount is too large compared to the request and represents 48% of the total amount of the challenge. It is not clear how the money will be used for which items. It is recommended to clearly add details of documents, plans, implementation methods, timelines, and specifications", "q1r": 2, "q2": "I have not yet seen the implementation solution, especially the criteria for selecting the grantee to ensure risk avoidance, the way of funding, and the calculation of bonuses for investors. The roadmap should also be detailed with measurable success metrics. If you add the challenge and advantage of this proposal compared to other similar projects like MicroLending, the ratio of risks encountered then I think readers will appreciate your project", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal concept is effectively addressing the grassroots DeFi challenge for the development of a MSM liquidity pool.", "q0r": 4, "q1": "The team has experience deploying the solution on other chains as evidenced from their GitLab repos. The team also notes in the comments they attempted to reduce the fund request from 185k to 50k, although this did not update in the Ideascale system as their proposal still shows 185k as requested funds. There is a quarterly roadmap but no budget, KPIs or delivery plan sections are included in the proposal.", "q1r": 3, "q2": "The team has included links to their GitLab repos to view deployments on other chains but for the requested fund amount this proposal requires a detailed budget, KPIs and a development approach to implement their solution on Cardano.", "q2r": 3, "assessor": "z_assessor_880", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "nous permettons aux entreprises de gérer leurs finances à l'aide de contrats intelligents déployés sur cardano.", "experience": "nous développons des solutions bitcoin pour les commerçants depuis 2013 et avec des smart contracts depuis 2016 en tant qu'équipe de 3 devs et de 2 chercheurs/comm..."}