{"id": 384443, "author": "ben.mesnik", "title": "Browser tool- How to use DeFi dApps", "url": "https://cardano.ideascale.com/a/dtd/384443-48088", "category": 26243, "amount": 49800, "description": "DeFi est difficile à utiliser et à comprendre. C'est un nouveau paradigme qui nécessite une connaissance du fonctionnement des composants DeFi et les erreurs peuvent être coûteuses.", "funded": 2, "upvotes": 68022355, "downvotes": 5717702, "votes_result": 62304653, "votes_cast": 159, "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Le problème et la solution décrits sont logiques et entrent dans le cadre du défi. Pour qu'une application DeFi soit fonctionnelle et utile, elle a besoin d'une bonne interface utilisateur (UI) et cette proposition cherche à améliorer cette expérience, en apportant un outil qui peut améliorer l'utilisation des applications.\n\nBien que le concept soit prometteur, il n'est pas clair comment cet outil \"copain\" serait intégré dans les dapps. Chaque dapp a sa propre interface et son propre concept, donc un outil \"buddy/wizard\" doit être pensé individuellement pour qu'il soit approprié à chaque dapp.\n\nDes métriques pertinentes ont été incluses, qui permettraient de quantifier les conseils pour les dapps à 3 et 6 mois et qui aident à comprendre l'impact positif sur le défi, mais il n'est pas clair comment ces conseils seront évalués en termes de qualité. Toute dapp financière a besoin de rigueur avec les tips pour les utilisateurs, et s'il est précisé que les tips seront audités, on ne sait pas exactement ce que signifie cet audit. Qui fera l'audit ? Y aura-t-il un partenariat avec les développeurs des dapps ?\n\nJe recommanderais d'inclure plus d'indicateurs/KPIs qui pourraient indiquer l'impact potentiel du défi.", "q0r": 3, "q1": "Le proposant a décrit des expériences qui peuvent être pertinentes pour le développement de cette proposition, mais il n'y a pas de sources ou de liens qui permettent d'évaluer ses qualifications. Je recommande d'ajouter des liens vers Linkedin et des référentiels afin que la communauté puisse vérifier l'expérience/les qualifications du proposant. Participez-vous à Plutus Pioneer ? Quelle cohorte ? Avez-vous terminé le programme ?\n\nLe budget présenté semble raisonnable et réaliste, les taux horaires sont dans les prix de référence du marché, mais la charge de travail présentée est difficile à évaluer car il n'y a pas un grand détail technique concernant le développement de l'extension.\n\nLe montant du budget fixé pour la traduction ne me semble pas solide car il n'y a pas d'estimation des caractères ou des mots à traduire, il n'y a donc aucun moyen d'indiquer si le budget de traduction est approprié ou non.\n\nIl y a un calendrier réaliste pour le développement du projet, cependant il y a peu d'informations sur le fonctionnement de l'extension. Chaque dapp a une interface différente, l'extension doit donc être personnalisée, ce qui crée une grande dépendance du projet vis-à-vis des développeurs de dapps.\n\nJe pense que cette proposition a un concept intéressant qui peut être exploité, mais il faut plus de clarification sur la façon dont les conseils seront intégrés à chaque dapp. La faisabilité du projet dépend de la complexité de l'intégration avec chaque dapp, donc ce point est une grande inconnue.", "q1r": 3, "q2": "Le problème et son lien avec le défi sont clairs, mais la solution doit être plus détaillée, principalement sur la façon dont chaque tutoriel sera personnalisé pour chaque dapp et si cela est faisable.\n\nLes métriques définies sont des indicateurs acceptables pour évaluer la quantité de conseils, mais ce sont des indicateurs de qualité médiocres. Je recommanderais d'inclure des KPIs/métriques qui permettent d'évaluer la performance des astuces. Par exemple, un simple bouton qui permet à l'utilisateur de dire si l'astuce était utile ou non. Comment la sécurité de l'extension sera-t-elle évaluée ? Si un utilisateur perd des fonds à cause d'un conseil inapproprié, comment cela sera-t-il comptabilisé ?\n\nIl existe une feuille de route avec des livrables raisonnables, ce qui favorise l'auditabilité.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposal satisfies none of the \"Key Metrics\" of this challenge. If we apply a strict reading of the challenge, there's not a lot room for ancillary DeFi resources that's not actual DApps. With that being said, quality education is key maintaining \"daily active\" and other ongoing user driven metrics after novelty wears off. In this sense, this proposal effectively addresses the challenge.", "q0r": 4, "q1": "It is clear that Sir Ben has the technical and leader skills to execute. What is not clear is Ben's chops as an education. It would be helpful for the community to know about who is going to being these videos as well more details about proposal thinking around the community curation of tips.", "q1r": 4, "q2": "The metrics are clear and easy to audit. The community should have no problem tracking whether or not there's 100 tips within 3 months or that there are  tips for 10+ projects. What isn't clear again is how the community might go about verifying that tips are audited before addition to the Tip Genius knowledge base. ", "q2r": 4, "assessor": "z_assessor_336", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The idea is great and could improve the usability of Defi d'Apps. However, I am not sure re the alignment to the challenge. The challenge focuses more on new Defi d'Apps than improving user experience and usability, which are important but maybe aligned better with other challenges. In addition, to show impact on Cardano ecosystem at this point you could have add also list of DeFi d'Apps that you can work with and give some specific use case examples. ", "q0r": 3, "q1": "While the proposer seems to have a great background and was part of plutus pioneer program there are no links to support it. The website tipgenius.info is offline and Linkedin profile would have been helpful. Again it will be helpful to have a list of DeFi projects they would like to support, discuss with the project potential partnership and maybe focus on this proposal on a first pilot use case. The roadmap is clear, but having the 3month break down will be recommended to be more clear on deliverables. Great to have a 12 months scope of KPIs and deliverables. The budget is well detailed. Good to have some risks and challenges although could be great to add how to mitigate it as well. ", "q1r": 3, "q2": "KPIs and deliverables are clear and could be audited. Could be good to add some KPIs on how the tips improve the usability of the DeFi app. Also for better audibility, especially in the first 3 month, it could be good to break down KPIs and deliverables on a monthly basis.   ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 23, "ne": 2, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": "The proposer want to launch a video that will pop up on a browser extension that will explain how to use specific Defi dApps when interacting with them. ", "q0r": 3, "q1": "The proposer is the founder of Tip Genius, and a Plutus pioneer developer, and is capable of successfully implementing the project. The plan mentioned that they will educate people on how to interact with the Apps; translate tips to 6 total languages and then release Apps. All these facts will lead to successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clear stating 3 , 6 and 12 months scheduled work with details. The budget is broken down in details to make auditing easy.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 25, "ne": 1, "ng": 14, "nfo": 10, "vca_o": 1}], "solution": "Des conseils vidéo éducatifs intégrés via une extension de navigateur popup qui expliquent comment utiliser des dApps DeFi spécifiques lorsque vous interagissez avec elles.", "experience": "Fondateur de Tip Genius, un coach de jeu vidéo automatisé qui vous donne de courts conseils vidéo en direct pendant que vous jouez.\nPionnier et développeur de Plutus"}