{"id": 384043, "author": "sofi.heessen", "title": "Community Consultancy: Tokenomics", "url": "https://cardano.ideascale.com/a/dtd/384043-48088", "category": 26243, "amount": 3840, "description": "我们社区有一些现有的项目正在寻找新的方法来资助社区工作，但有些项目缺乏资源和专业知识。", "funded": 2, "upvotes": 38339045, "downvotes": 15030737, "votes_result": 23308308, "votes_cast": 199, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal identifies the problem of Defi projects  needing support. They will ad value to the Cardano ecosystem by giving Catalyst projects the support they need to accelerate progress. The metrics of the proposal are aligned with the challenge in the sense of helping Defi projects meet the metrics of the challenge. This proposal is able to scale well as there is an abundance of work out there and Catalyst can do with more proposals that offer the same work as this one.", "q0r": 5, "q1": "The relevant skills is provided in a miro board and a little background story. The proposer is a known Catalyst Veteran, involved in a few Catalyst projects. The budget is reasonable and broken down into  items that are charged at an hourly rate. The timeline to do the work is 3 months. Ending with reports of what has been done and accomplished. So each Fund new work will be started. They explain in great detail the different steps of the process and how each process will execute.   A Miro board has been provided to visualize the process. No risks/challenges have been considered. Not being aware or prepared for future risks will slow you down.", "q1r": 4, "q2": "The roadmap is 3 months and the milestones is the different \"iterations\" that gets completed. There are 3 iterations. The KPIs can be the reports that gets created at the end of each fund.  Refining your proposal in pointing out these Milestones and KPIs that are already there, will make it easy for the voter to identify and track the progress and performance of your project. . The proposer identifies the problem of Defi projects needing  support to grow resilient and strong and solves this by making themselves available to provide support and guidance without the Defi project having to pay him as Catalyst will fund him for this work.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 23, "ne": 7, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "It is clear that Sosha read and has a deep understanding of the challenge. The proposal aligns excellently with the challenge of \"encouraging DeFi projects to seek resilience, safety, research-based economic models and critical thinking\" by offering \"research for open source new financial models.\" While this proposal itself is not vying to be one of the \"4 new teams  or deploying DeFi dapps on Cardano in 2022 \" the challenge is aspiring to catalyze, the proposal hyper focus on research could prove indispensable to a successful launch of the funded cohort. ", "q0r": 5, "q1": "The plan is quite detailed, methodical and with a couple possible paths for achieving the highest impact. Would have love to see more information about Sosha's foray into academia. Experience in professional computer science roles, AI,  and process management and improvement is clear from Sosha's linked profile, specifics about academic research  or architectural planning however is lacking. I have full confidence that the proposal will deliver what it's aiming to deliver.", "q1r": 4, "q2": "The proposal does a great job explaining tangible assets and outputs that will come from this effort. Would love to hear more information about mediums we can expect to see and interact with these assets via. Where will the articles be published? What are the cost associated with those mediums? What's the procedure for engaging this \"Community Consultant\" role. Is it don't call me, I'll call you type situation? Any specific metrics about what number of engagement will be consider a success? Is it just the the two proposals mentioned? Does a team have to go through catalyst to engage with the consultant? I love that \"In the future these decisions could be guided by expert groups formed around these domains.\" Would have to love to see clearer thoughts for now (or for the next month or two) prior to expert groups being formed.", "q2r": 4, "assessor": "z_assessor_336", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I can see that this proposal is about assisting existing projects to help formalize & model their solutions, and sharing these results with the broader community as examples. This is a great and interesting idea. The format and block activities are clearly defined, address the challenge, show the clear impact on the Cardano ecosystem as a whole in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This proposer profile is very clearly described inside the proposal [with personal motivation,  background,...]; this profile shows suitable skills and experiences for implementing this work. This is proof of feasibility from the team profile. The budget is clear and logical. Therefore, based on the given information, I strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links for verification. Especially, as mentioned, this proposer profile is very clearly described inside the proposal [with personal motivation, background,...]; Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "This project is an attempt to fund a consultancy, therefore it is not a DeFi project in the spirit of the brief. ", "q0r": 2, "q1": "It is clear that this proposal is seeking funds to provide consulting services, it is likely that the author will provide services as part of consulting business operations.", "q1r": 4, "q2": "Progress milestones are not included in this proposal, therefore insufficient to audit progress. \r\n\r\nSuccess metrics are ill-defined and not specific, measurable, publically auditable. For instance, \"After 3 months, the report is used by others to accelerate their projects. More people start doing consultancy for the community in a similar manner. Some of these tokenmics models are in the end used to support development. Those same models are used to fund more refinement and development of said models.\" is this 4 months? 2 years? 5 years? How many people will start doing consultant work? how do will we know this report was the cause of \"refinement\" and \"development\" of  \"said\" models? ", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 20, "ne": 1, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "The proposal is impactful in the direction of (1) using tokenomics to achieve resilience and sustainable development/maintenance of projects and (2) researching for new financial models, as presented by the \"F7: Seeding Cardano's Grassroots DeFi\" Challenge. Indeed, several new projects are lacking expertise in terms of defining Tokenomics, and building financial models. This service would be greatly appreciated by new projects trying to achieve resilience/sustainability. ", "q0r": 5, "q1": "The proposer has the right background and is an active community member since long time. He has good knowledge of the Cardano ecosystem, and he consistently helps and guide other projects in achieving sustainability. De facto, he is already providing Community Support in a wider range of activities (not only Tokenomics, but also Open Source / Open Standards, Dandelion, Modeling DApps, etc.). Shortly said he has already succeeded in this and with this proposal he will be continuing the efforts in this direction.", "q1r": 5, "q2": "The proposer aims to regularly publish reports for the community. I find the structure of the report is quite good in terms of auditability: Problem Definition / Possible Solutions / Examples / Next Steps. Auditing the outcome will be as simple as checking the regularity and the content of the reports. ", "q2r": 5, "assessor": "z_assessor_956", "no_vca": 21, "ne": 3, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "协助现有的项目，以帮助正式确定和模拟他们的解决方案。与更广泛的社区分享这些成果作为范例", "experience": "具有系统正规化和模型化的经验。为一些不同的大型项目提供咨询"}