{"id": 380973, "author": "felixweber", "title": "Bridge Builders Mentorship Program", "url": "https://cardano.ideascale.com/a/dtd/380973-48088", "category": 26255, "amount": 60000, "description": "Не хватает профессиональных, управляемых сообществом инициатив, которые помогли бы финансируемым предложениям строить свои проекты на профессиональном уровне", "funded": 2, "upvotes": 101519177, "downvotes": 5006372, "votes_result": 96512805, "votes_cast": 313, "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Good proposal by a committed team already significantly engaged in the community to provide mentorship services attached to the town halls, 1:1 mentoring to specific funded proposals and an suite on online resources over a three month period. ", "q0r": 5, "q1": "This is a relatively simple plan presented by a diverse engaged and experienced group. There is every reason to believe they will be able to deliver the plan as described. ", "q1r": 5, "q2": "Simple plans and as such progress will be easy to audit. Some KPI's have been listed, however it would be good to see some goals attached to these to success can be measured and voters can know what it is they are aiming to deliver.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 32, "ne": 3, "ng": 20, "nfo": 9, "vca_o": 1}, {"q0": "This resource is quite interesting and can hrow and prove beneficial to the growth of bright ideas in the cardano catalyst process.  Although more clarity in how are the ideas vetted as needing support in that regards and what are the results intended to deliver. Would this improve their chances of funding? if so what ratio? In short is hood to provide support but if the project supported ar enot strong enough to get the audience the benefit of this activity makes funding be used in less effective methods of supporting Cardano.", "q0r": 3, "q1": "The experience appears to be quite extensive and had full exposure to the decentralized governance aspect of the projects and Catalyst experience. ", "q1r": 5, "q2": "I think is a great start but more refining as to the goals and key performance indicators that makes funding this solution useful to future funded projects.", "q2r": 3, "assessor": "z_assessor_594", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The team has already been well exposed to the Cardano ecosystem, and the project would help drive the funded projects more definable and deliverable. It would be great to provide additional instruments/tools on how to measure the outcomes of your project.", "q0r": 5, "q1": "As the team is already eating, sleeping Cardano ecosystem now, there is a very high probability the project will be delivered. However, it would be great to list or provide a small alternative or backup plan for who is doing what parts in the project since all four of you are already highly stretched out at the moment. This is an issue with human resources, not willingness for the project/Cardano.", "q1r": 4, "q2": "I wish to micro-scope and provide some more comments, but \"All services, actions and operations will be 100% transparently documented and published.\" then it is on your team shoulder ultimately.", "q2r": 5, "assessor": "z_assessor_661", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The proposal mentioned that they are building a community team of experts to offer quality advise and guidance to funded proposers to move their projects to the next level. It mentioned that funded projects face huge challenges as to how to transform collaborative structures into professional projects; how to sustain funded projects, legal issues, among others. Hence the need for accelerators and mentors. The challenge is on the whole addressed well in this proposal.", "q0r": 5, "q1": "Team is made up of very seasoned Catalyst partners - Allison Fromm, Felix Weber and others - who can successfully implement the proposal. They already mentor community advisors, proposers and individuals who want to join catalyst. The plan presented mentioned details such as Online sessions and workshops to be held, Online sessions for funded proposals and open source content  for study. ", "q1r": 5, "q2": "The roadmap is clear showing February, March, April 2022. The budget has a comprehensive breakdown to make auditing effective. Good proposal recommended.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal to create a mentorship program for funded proposals is directly in line with the catalyst accelerator & mentor challenge.", "q0r": 5, "q1": "Each member of this team brings domain business experience along with time spent in catalyst operations, SPO ops and their team section in general demonstrates a deep understanding of technical dev processes and business models. The services section and roadmap explain clearly how the team plans to create this program. ", "q1r": 5, "q2": "The team behind this has a lot of catalyst domain expertise as well as business and technical skillsets. The proposal plan includes all the info needed to sufficiently audit progress.", "q2r": 5, "assessor": "z_assessor_736", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "* Funded projects need mentorship and guidance in order to become more successful. This intention aligns very well with the challenge setting. The problem statement is clear. The solution is strong to start. The proposal could open a door (in the future) to bring other mentos into the same setting with defined processes, rates, etc. in order to scale beyond F7. ", "q0r": 4, "q1": "* A group of Cardano community established leaders and experts found a 'mentorship program'. We get detailed information about the available skills and expertise which is required to help the funded proposers. The scope of work is planned in (potential) actions and the offered services are described in a comprehensive and clear manner. The proposal offers a realistic and reasonable timeframe of 3 months. The budget is brown down into 10h/month-packages which provide flexibility for the community and the team. From my point of view this is a big plus and justifies the requested budget. The OKRs could be more ambitious. Just counting the numbers does not fit to the rest of this high quality proposal What also remains open how many projects can be supported max. And how to deal with no demand or way too much demand at all. ", "q1r": 4, "q2": "There is an understandable description of the targeted problem.  And there is a clear solution to the addressed problem. Metrics and KPIs are available at an high level and could be elaborated a bit more deeper in order to show (potential) (timely/monetary) benefits for the funded projects.", "q2r": 4, "assessor": "z_assessor_737", "no_vca": 16, "ne": 4, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "Создание команды экспертов сообщества, способных предложить экспертные знания, руководство и наставничество для финансируемых предложений, чтобы перейти на следующий уровень", "experience": "Эксперты в области бизнеса, финансов и управления. Ветераны - члены сообщества с полной занятостью, финансируемые заявители и советники сообщества, члены Catalyst Circle."}