{"id": 381294, "author": "carnivilla", "title": "Onboarding Untapped Communities", "url": "https://cardano.ideascale.com/a/dtd/381294-48088", "category": 26241, "amount": 50000, "description": "Los jugadores de las comunidades tipo Metaverso carecen de funcionalidad y propiedad con su propiedad digital y los activos de su entorno.", "funded": 1, "upvotes": 29243871, "downvotes": 20588156, "votes_result": 8655715, "votes_cast": 151, "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=18987"], "media": [], "f6_assessments": [{"q0": "Esta propuesta es muy interesante porque no promete crear un juego en sí, sino un entorno virtual en el que los jugadores de diferentes juegos puedan interactuar y aprender a utilizar las tecnologías que promueve el blockchain de una manera más eficiente y práctica, como NFT, por ejemplo, que según los autores de la propuesta se verá como algo básico para que el jugador se maneje. Creo que es una idea muy relevante porque a pesar de que el universo blockchain ya es una realidad, esta tecnología es mucho más conocida en algunos puntos que en otros, y es difícil que una persona aprenda sola lo que es blockchain, criptomonedas, NFT, etc. . Incluso si la persona es del mundo del juego, dependiendo del contexto en el que se inserta, es decir, si es un país/ciudad en el que se habla y se conoce poco el mundo de la criptografía, lo más probable es que esta persona tenga alguna dificultad para entrar en él. Si todo va bien, es decir, si nuestra blockchain se hace cada vez más popular y el uso de NFT en los juegos se convierte en una práctica generalizada, las personas que no tengan una orientación adecuada sobre cómo manejarlas se verán ciertamente perjudicadas. Creo que esta idea está bien relacionada con el objetivo más general de Cardano también, construir un mundo más igualitario, aunque sólo sea en esta parte específica de los juegos. Me ha gustado, creo que si se financia y ejecuta con éxito, puede traer nuevos miembros al ecosistema de Cardano, que probablemente traerán a otras personas a la blockchain también, y así sucesivamente, se puede empezar a crear una red poco a poco, y camino de atraer un día a mucha gente a Cardano. Creo que es una propuesta muy interesante y que tiene altas posibilidades de traer resultados muy positivos.", "q0r": 5, "q1": "El equipo se preocupa por ofrecer una breve descripción de cada miembro, en la que conocemos sus nombres y sus funciones, así como (en algunos casos) el tiempo de experiencia de la persona en un área determinada. A pesar de eso, sería aún más interesante si proporcionaran una página de red social para cada uno, linkedin es siempre, en mi opinión, la mejor opción, porque podemos ver allí las experiencias pasadas y las conexiones de cada miembro, por lo que se puede llegar a conocerlos. más íntimamente. Sin embargo, aquí tenemos algunos fallos graves. Algo que me preocupa es que, a pesar de parecer capaz del proyecto, ningún miembro del equipo afirma tener una implicación directa con nuestra blockchain. Esto sería importante para asegurar que Cardano se beneficie directamente, hay otros lugares donde los jugadores pueden acuñar sus nativos digitales, hay varias posibilidades de interactuar con blockchain; es necesario que estemos seguros de cómo se utilizará la nuestra aquí, porque de lo contrario, no es interesante financiar el aprendizaje de los usuarios que no saben a ciencia cierta si van a utilizar las tecnologías de Cardano. Por cierto, no está claro si serían capaces de enseñar lo que proponen, ¿qué miembro del equipo tiene conocimientos sólidos sobre blockchain, NFT, etc? Esto no es explícito en la descripción que se nos muestra, lamentablemente necesitamos saber si están preparados para el proyecto en sí, más allá de sus experiencias fuera del universo criptográfico. Sobre el reparto financiero, el equipo nos proporciona información sobre cómo se repartiría el importe total, dándonos explicaciones sobre cada tema. Esto nos permite comprender bien cómo se desarrollaría esta parte del proyecto. El guión es satisfactorio en cuanto a los detalles, serían 6 meses, divididos en dos grandes bloques, de los que sabemos qué actividades se desarrollarían en cada parte, por lo que tenemos una visión más sólida de lo que está por venir. Sin embargo, debido a las cuestiones que rodean la calificación del equipo para hacer frente a los problemas en el ecosistema de Cardano, yo diría que este tema debe ser reformulado, por lo que transmite más confianza y seguridad en el equipo.", "q1r": 3, "q2": "El equipo nos da datos directos sobre la auditabilidad, hay definiciones de éxito esperadas según el paso del tiempo. Hay dos temas, en los que se especifica cómo sería el éxito del proyecto. De este modo, podemos hacer un seguimiento directo de los posibles resultados. También sería posible seguir el desarrollo del propio proyecto, a través de las actividades que se describieron en las fases. Creo que la audibilidad podría hacerse así: elegimos a uno o dos miembros de la comunidad para que sigan el proyecto, se pongan en contacto con el equipo y recojan los datos. El seguimiento, que puede ser llevado a la comunidad a través de informes. Sería muy importante que el propio equipo también nos diera satisfacción con el proceso, no sólo con los resultados, para que podamos entender cómo se está construyendo el producto final más allá de lo que se obtiene al final del proceso. Por lo tanto, creo que sí, el equipo proporciona información importante para el seguimiento del proyecto, pero me gustaría establecer un contacto directo y constante entre el equipo y el resto de la comunidad de Cardano, para transmitir más seguridad en general.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is aimed at an untapped community that would be able to interact with the cardano blockchain seamlessly to bring wide adoption. It would target gamers who are active in marketplaces and provide them with value and a reason to adopt cardano.", "q0r": 5, "q1": "This team has exprience in events, digital creation, and gaming, but it is not clear who will be doing the blockchain/NFT development and what their experience is with such. They have the two partner companies with relevant product experience, but their blockchain development is not clear. This proposal would benefit from providing more details on if that will be outsourced with the budget and who will be doing it.", "q1r": 4, "q2": "This proposal would benefit from breaking down their ideas of success down futher to judge the development vs the initial launch progress. The budget breaks down what the funds are spent on, but could be more comprehensive to improve auditability.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Even the problem can be within the challenge, because at my point, their idea with VR can make something special to Cardano communities and it can make our ecosystem become diverse but I'm not sure it is the direction of the current proposal or not? They should have more words to explain to us how their model will impact this challenge. Or providing some key metrics, goals that they plan to get can also help us know about that. \r\nBecause of lacking a lot of these thing I rate them 1 our of 5, hope that they will have a better proposal in next fund. ", "q0r": 1, "q1": "Seem that the team has great experience to finish their proposal easily. In addition, they also divide their phase into small pieces in their roadmap and explain how their people will solve it in the funding allocation. So, I believe that within this proposal scope, its feasibility is 4 out of 5. \r\nAnother thing they should provide is the risk of their proposal and how they will solve it. The fact is with the info inside this proposal, I cannot estimate which risk they will get because of their experience & they're doing well everything for their project and this proposal is just a small step of their development. ", "q1r": 4, "q2": "But they should give us some key metrics, this will help us clarify what they want to get and how it can help our communities. Technically, I rate the feasibility high because of their ability and project situation but they're lack something for us to audit their work. Providing key metrics, detailed explanations about the solution will help people in our communities assess their purpose better. Even we can track their work on their channels that are shown on their website but better be clear here in the proposal. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I'm not sure what detailed solution and how they will solve their problem in detail. Indeed, that their problem is lying in the scope of this challenge but the info in the proposal is not enough to explain how it will and can't help us on assessing the level of impaction to the challenge. \r\nMoreover, even this project is running but this proposal will have its own goals and the proposer should prove some key metrics that they will track when running in the scope of 10 weeks that they're already mentioned in their funding allocation. ", "q0r": 2, "q1": "As a developer, I can understand a bit with the info they shared in the funding allocation but they should have a more detailed explanation about these technologies, also be better if they have more info on the solution explanation - it will help us assess their step of development better. \r\nBut I think that this team can solve this proposal because their project is running in real life and the team info can show their professional skill that suits their job. \r\n", "q1r": 5, "q2": "Again, lacking detailed explanations about their solution can't help us clarify their goal within the scope of the proposal. \r\nEven they have a detailed roadmap and explain what they will do and use their fund, but I think the proposer should provide some goals, key metrics - it will help communities measure it. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This on-chain game also brings in a virtual reality component which will only continue to be more popular in the future. Using this challenge's funding in this manner is a good way to ensure Cardano is on the cutting edge.", "q0r": 5, "q1": "Yes, the team's experience will lend to its success. Additionally, you can tell from the KPIs, project roadmap, and budget breakdown that the team has approached the planning process thoroughly.", "q1r": 5, "q2": "Yes, the detailed KPIs, roadmap, and budget breakdown are sufficient for auditing the project's progress and success.", "q2r": 5, "assessor": "z_assessor_788", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "VR NFT based game proposal is effectively addressing the gamers on-chained challenge.", "q0r": 5, "q1": "The team has experience building VR apps for events and has presented a complete plan to build out there metaverse platform to create gamified learning and community spaces for Cardano community members. ", "q1r": 5, "q2": "The information in the roadmap, defined success, team and budget sections are very useful audit items.", "q2r": 5, "assessor": "z_assessor_805", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Incorporación de las comunidades de RV a la interacción básica de la cadena de bloques dentro de entornos inmersivos gamificados.", "experience": "El equipo ha realizado dos eventos en los que se enseñó a los participantes a acceder e interactuar con la blockchain en un entorno de NFT del mundo real."}