{"id": 381523, "author": "bmoore", "title": "ReWILD! : Bison Ranching in AR", "url": "https://cardano.ideascale.com/a/dtd/381523-48088", "category": 26241, "amount": 65000, "description": "Los juegos de ordenador pueden ser una actividad sedentaria con consecuencias fisiológicas y psicológicas potencialmente negativas.", "funded": 1, "upvotes": 27322727, "downvotes": 22558097, "votes_result": 4764630, "votes_cast": 146, "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": [], "media": [], "f6_assessments": [{"q0": "El juego es muy interesante, creo que es la primera propuesta que evalúo en este reto que busca una forma de jugar al aire libre, una especie de pokemon go (este juego fue una fiebre donde vivo) de búfalos, cuyo objetivo es capturar estos animales (que serán NFT) y criarlos. La relación del juego con nuestra blockchain es precisamente que estos búfalos están en formato token, y todo lo que los envuelve es una transacción acuñada en la blockchain de Cardano, por ejemplo: su madurez, ubicación geográfica y sus características, como la temperatura, el peso, etc. Es una idea muy original, bajo mi punto de vista, y que puede funcionar muy bien, creo que es muy atractiva para los interesados en este tipo de juegos, al ser una mezcla de juegos en los que podemos gestionar entornos (por ejemplo, juegos de granja, pero en este caso totalmente centrados en búfalos) y también personajes de caza como los pokemon go. Veo potencial en esta iniciativa, y creo que tener toda su información acuñada en nuestra blockchain beneficiaría mucho al ecosistema de Cardano. Sólo quería entender mejor cómo funcionaría esta cuestión de la realidad aumentada: los jugadores se descargarían la aplicación en sus teléfonos móviles, pero ¿cómo se relacionaría el juego con el entorno? ¿Y cómo sería para alguien con gafas de realidad aumentada? Como se trata de una idea muy fuera de lo común y un tanto compleja, sería positivo que los autores incluyeran en la propuesta un breve vídeo en el que se explicara precisamente cómo funciona el juego en la práctica, de forma sencilla, para que las personas que no son del área de la tecnología también puedan entender bien cómo se desarrollaría este proyecto. Por lo demás, creo que es una idea con mucho potencial y que dialoga directamente con lo que pide el desafío. Por no hablar del hecho de que aún podría ser beneficioso para la salud fisiológica y psicológica de los jugadores, como argumentan los autores, demostrando estas líneas a través de los enlaces que se adjuntan al final de la propuesta, ya que les sacaría de sus habitaciones o lugares habituales.", "q0r": 4, "q1": "El equipo parece ser muy capaz, ya que 1) explican las características técnicas del juego de manera muy profunda 2) mencionan brevemente sus áreas de conocimiento durante el transcurso de la propuesta, así como sus niveles de experiencia 3) adjuntan sus perfiles del linkedin al final de la propuesta, donde podemos conocerlos mejor y ver algunas de sus experiencias pasadas. En cuanto al guión, lamentablemente esta parte de la propuesta es prácticamente inexistente. Los autores nos dan una extensa explicación de lo que sería el juego, qué tecnologías implicaría, cuál es la idea general, pero no explican claramente qué pasos serían necesarios para construirlo todo. Para nosotros era importante tener una definición de las fases que había que seguir para llegar al producto final. Los autores dicen que el desarrollo completo del juego podría llevar años, lo cual es preocupante, no sabemos exactamente cómo el dinero del becario se encargaría de las primeras etapas. En otras palabras, ¿qué porcentaje de este proyecto cubrirían los 65.000 dólares? Es necesario que tengamos una visión sólida del conjunto, invertir en algo incierto es un poco angustioso, me gustaría mucho que los autores hubieran pensado en la trayectoria total y la expusieran aquí para ver hasta qué punto el dinero de esta ronda de financiación podría ayudar a hacer las cosas. Me ha gustado mucho la idea del juego y no me gusta señalar estos fallos, pero es necesario que entendamos el conjunto antes de invertir. Sobre el dinero, más concretamente, la cantidad total se divide en algunas partes, pero cada una de ellas podría haber sido más detallada, en mi percepción. ¿Cómo sería este modelado en 3D? ¿Cómo se construye este tipo de cosas? ¿Y cómo se utilizarían 10k para esto? Dicho esto, creo que el mayor fallo del equipo fue en realidad el tema del guión, que si se resuelve, contribuirá en gran medida a que la propuesta sea más susceptible de ser financiada.", "q1r": 3, "q2": "Este equipo es diferente desde el momento en que sugiere la elaboración de informes mensuales y su entrega al grupo que gestiona este reto del juego. De esta forma, la auditabilidad se hará de forma clara y directa, por lo que creo que no hay mucho que comentar en esta parte de la propuesta. La auditabilidad estará lista una vez que el equipo se comprometa a hacer llegar esta información a la comunidad, por lo que este tema de análisis está siendo abordado en su totalidad.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims to deliver a mobile game for Android/IOS devices. \r\nThe game is centered around real bisons which identity and main trait is recorded live into the blockchain. The users will be able to interact with the 3D model of the bison via a VR device and/or with their smartphone.  \r\nThe game aims to reduce the sedentary aspect of gaming, via introducing necessary movements of the user to enjoy the gaming experience. ", "q0r": 5, "q1": "The team is well experienced and the realization of the NFTs seems totally doable. However some key details are missing to evaluate the real success of the proposal implementation (see section below)", "q1r": 4, "q2": "The information given are complete in terms of budget breakdown, however a detail roadmap is missing, as well as key metrics to be measured along the project development.\r\nMoreover, the tokenomics of the token NCKL is not explained, as well as the utility of the token within the game: only a comparison to already existing games is made (e.g. Axie Infinity).", "q2r": 2, "assessor": "z_assessor_530", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This is a big and fantastic way to develop and spread the NFT games. AR is developing and with this idea, I think it will go widely in the future. Moreover, as the team explains inside the proposal, their product will show how powerful Cardano blockchain be and will inspire other developers. ", "q0r": 5, "q1": "Their required budget is reasonable for what they explain that need to do for the idea. But I think they should provide a more detailed roadmap and some key metrics to help us assess the feasibility. \r\nBut their team and goals, especially their demonstration about their AR product that they put in the proposal I think they know what they are doing. ", "q1r": 4, "q2": "The team has a clear vision for what they want to do and clarifies their work in detail, which is close enough for everyone in Catalyst community to audit their progress. Their explaination about how the game work and technology can help us easily understand how they solve the problem. One more time, they should give us some key metrics to help communities more clearly for what they will aim to. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The problem is within the challenge, and proposal's detail solution can help to solve that problem. \r\nAnd the idea of using AR to connect vitual life and real life can attract and drive a lot of user to the game/ and Cardano communities. .\r\nBut the proposal lack of some below that I think they should provide\r\n- Info to show that it will impact to the Cardano ecosystem \r\n- Key metrics of the project to help community assess that is its direction align with the challenge setting or not and how much it will impact ", "q0r": 3, "q1": "The team have skill and knowledge that need for the development of the project. They're also have clip of their AR product but in other character, it can help us clarify about their ability. \r\nBut lack of roadmap, goal, KPI and key metric in the proposal is making us hard to assess its feasibility and I think that's the basic thing that they should provide for the better assessment. \r\nMoreover, this project is a bit complex and harder than others in technology, marketing activities... so I think that they should provide some risk and how they can control it. ", "q1r": 2, "q2": "Lack of roadmap, milestone and key metrics will make it hard to audit, they should provide these detail. It's also help the communities assess the feasibility the project better. \r\nOne better thing they have is that it have very detail explanation about how the game will work to solve the problem in the proposal. ", "q2r": 2, "assessor": "z_assessor_670", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "One of the famous and attractive projects that mix virtual and physical activities that I know is Pokemon Go. They have had a big community for years and that still developing now. I think the idea of ReWILD, will have better results for not only the game but also the development of Cardano communities. \r\nI just only recommend that proposer should give us some key metrics that would help us to know and track how much this project impact Cardanor ecosystem. ", "q0r": 4, "q1": "I think this project will be successfully deployed by their professional and experienced team. They even have a prototype in the clip that they attach to the proposal, so we can believe that they can make these AR ideas come true. \r\nThey are also clear about which field their budget will use for, or some ways to get rid of their capital risk. \r\nBut I think they should have a detailed roadmap for helping the assessment be more realistic. ", "q1r": 4, "q2": "This proposal has a very detailed explanation about how they help to solve the problem, and the detail is, including in gameplay, in-game materials, and technology. This can help clarifier about their targets. \r\nBut better be more detailed about the roadmap and their key metric that they will focus on as I said before will help everyone to audit the project better. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is a cool spin on the classic NFT game as it makes large use of Augmented Reality to encourage users to play outdoors (similar to Pokemon Go). The team has experience developing mobile apps with AR technologies.", "q0r": 5, "q1": "The team includes sufficient documentation covering their relevant experience (LinkedIn for entire team) and the Light paper covers their plans to implement ReWild! in great detail. ", "q1r": 5, "q2": "The documentation provided is sufficient and the team's experience is verifiable but there is only a budget and roadmap with no KPIs or metrics included. The inclusion of the light paper is my reasoning for 4 stars. ", "q2r": 4, "assessor": "z_assessor_837", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Fomentar un juego más activo fuera del ordenador mediante la tokenización en cadena de los objetos de juego de realidad aumentada.", "experience": "Los miembros del equipo tienen experiencia comercial en el desarrollo de juegos de realidad aumentada y en la comercialización para varios equipos de béisbol de las ligas menores AAA."}