{"id": 382933, "author": "quest.zwerg", "title": "AdaQuest - Concept Phase 2", "url": "https://cardano.ideascale.com/a/dtd/382933-48088", "category": 26241, "amount": 55000, "description": "Para garantizar el desarrollo futuro de nuestro RPG clásico de alta fantasía a largo plazo con modos de juego competitivos, necesitaremos financiación adicional.", "funded": 1, "upvotes": 90849670, "downvotes": 8578570, "votes_result": 82271100, "votes_cast": 497, "f6_no_assessments": 8, "f6_rating": 4.583333333333333, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=6799"], "media": [], "f6_assessments": [{"q0": "The project cleanly fits into this category, and has great potential of becoming widely adopted. The addition of a free tier is a good way to onboard new players, since oftentimes on-chain games like this tend to end up with astronomical costs for newer players, resulting in less new users jumping on board. The budget is reasonable for the impact this game could have on the ecosystem. The game includes play to earn components, NFTs and gamification, which fulfills this challenge's objectives.", "q0r": 5, "q1": "The team already has started phase 1 and delivered on their objectives, which is reassuring. There is a clear path forward, with an alpha version estimated for december 2022. The budget is well rounded on the technical and game design front and is broken down properly. The fact that the team is growing shows that the proposer has long term interest in the project.", "q1r": 5, "q2": "While this proposal is light on KPIs and success metrics that would be auditable, the metrics from the last proposal still holds. There is a clear roadmap over the next year, but while the full project cost is estimated, the funding sources are not clear.", "q2r": 3, "assessor": "z_assessor_318", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "This proposal addresses the challenge. The game is already in production and the team has shown dedication so far. The description of current needs and closest plans is clear and written in really good style. It is understandable even by a non-gaming related person like me. ", "q0r": 5, "q1": "Team showed in this proposal their KPI that were achieved in Phase 1 of the project. As I remember them from Fund 6, I can confirm that they met the expectations. I would be really surprised if it was otherwise now. Clear LinkedIn information about team members, precise roadmap and detailed budget. Therefore I am positive the team can deliver what written. ", "q1r": 5, "q2": "Roadmap and plan is detailed, team provided proof that they know what auditability is - showed clear results of Phase 1. Everything seems okay.", "q2r": 5, "assessor": "z_assessor_324", "no_vca": 20, "ne": 1, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "This proposal effectively address the challenge because it gives a clear solution to the defined problem statement. The budget is well presented and enough detailed for draft version. Having in mind future scalability which is huge and potential very rewarding impact on cardano Ecosystem I strongly agree with this proposal.\r\nPERSONAL COMMENT AS A GAMER:\r\nAlthough playing card games are not my thing, I was drawn to the concept of this game. It ticked few bulbs in my head and made me very curious how will this project evolve in the future.", "q0r": 5, "q1": "For the feasibility I rank this proposal as very likely to be implemented with considerable level of success;\r\nteam is well presented, capable and rapidly growing, detailed plan and schedule is existing, budget is reasonable. Therefore I strongly agree with this proposal.", "q1r": 5, "q2": "Proposal's progress can be easily audited with clear deliverables (roadmap and timings are presented) and good transparency. KPI and metrics are well presented. On the other hand risks and possible challenges are not mentioned inside this proposal and that is the reason I have to \"only agree\" with this proposal.", "q2r": 4, "assessor": "z_assessor_605", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This game was funded and developed since fund 5, and now this proposal is for asking the additional fund to be a part of the next phase. In addition, with the info from their implementation plan and success metric in 3 months, 6 months inside the proposal that align with the challenge given, this game will affect the Cardano development in the next few months. ", "q0r": 5, "q1": "The team provides a detailed implementation plan that not just with only the next steps but also back to their 1st phase and include its results. They did well in the previous fund, but they still provide very detailed info in the roadmap and the game info that showed by FAQ. That info and the results in their 1st stage can prove the feasibility of this proposal. About the budget of this proposal, they clarify that this will use for just the initial part and explain why. \r\nI believe that they will finish all work in this scope of the proposal as they did in the 1st phase, but this budget is insufficient for fully loading the whole roadmap in 2nd phase, and there are more others, how they can solve it? ", "q1r": 5, "q2": "The roadmap for 2nd phase that the team will run is detailed and has a realistic timeline to do. And their goals include key metrics, KPIs are completely clear for auditing their work in the scope of this proposal. \r\nThe team also explains in detail the problem and their solution in this proposal to address it, they all clarify what they want and where they will go to. \r\n", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 23, "ne": 3, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "The AdaQuest Concept Phase2 proposal will help onboard more gamers into Cardano Ecosystem by developing RPG mode and it fits in with this challenge team well.", "q0r": 5, "q1": "The proposer team has delivered on Phase1 and elaborated on achieved milestones. The number on facebook page is still relatively small (at 21 members and set to private) not sure why this number is not synchronized with discord members (>600 members).  Having said that, the team details the budget and roadmaps and the possible future funding needed.", "q1r": 4, "q2": "The project should try to start generating revenues as more hirings take place and it requires more funding (perhaps some funding should also be from outside the Catalyst as the only source) so it opens up more opportunities for this and other proposals in the challenge to bring more users into the ecosystem.", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "Yes, it does. It already has finished as they call it phase 1 and entering phase 2. Foundation of the game seems to be professionally handled. The progress is visible, the game seems interesting and has already healthy number of followers. Feeling is that this project has a high celling. ", "q0r": 5, "q1": "Project already has a good start and  well explained future steps. The team is expending at it is giving good feeling of seriousness and proper organization. There is a lot of material already available that backs up everything promised in phase 1 of the project. It is potentially a big project, with multiple users that would translate to multiple transactions in the future.  I would have to say that everything is pointing to this project being implemented successfully. ", "q1r": 5, "q2": "Yes, there is good explanation of phase 1 and what is needed for phase 2. The overall progress of phase 1 is easy to monitor, it would be expected the same would be for phase 2. ", "q2r": 5, "assessor": "z_assessor_672", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The proposal is seeking additional funding for phase 2 of the game called Dungeon Gameplay, which already the phase 1 has been implemented. Adaquest promotes cardano whilst gamers are on the play. One will need one NFT AdaQuest  hero to really enjoy the game with all the features. ", "q0r": 5, "q1": "With over 15 years to 20 years experience in coding, Art and design, the proposal would be successfully implemented, coupled with the detailed plan listed in the proposal. The plan has been divided into phases which makes it comprehensive and feasible.", "q1r": 5, "q2": "Information on the timelines from 3 months to 12 months makes it easily auditable. Progress of work can be traced effectively. The budget has a good breakdown showing details of what to be done with what cost. This makes it highly auditable. A very good proposal. ", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposer has a long-term project that is divided into many steps to achieve the main goal- create a card and RPG game in the future.", "q0r": 5, "q1": "The proposer has a clear vision of how to achieve the main goal. But it is too wide and burdensome to achieve. All financing of the project is only partly covered by this funding and it is questionable will proposer achieve the ultimate goal and will he develop game fully or only partly. In my opinion, proposer should develop, focus and deliver \"Card game\" first to the end-user.", "q1r": 3, "q2": "The proposal reflects achievable goals, but under question is will the whole project or only part of it will be succesful.", "q2r": 3, "assessor": "z_assessor_835", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "++La fase 2 ofrecerá:++\n\nD-Crawler 3D\nCoop PVP/PVE\nMatchmaking\nSaqueos, NFT Drops (play2earn)\n¡Gana territorio para tu tribu!\n", "experience": "Código: Dirk 20y, Tom 10y, Lutz 7y, Vic 5y, Pav 3y\nArte: Chris 15y, Rob 10y, An 3y\nDiseño G: Alex 5y, Mike 5y\nBiz: Marcin 15y\nLore: Tom 25y"}