{"id": 383932, "author": "alex.pipo", "title": "IRONSKY PlaytoEarn Milestone of ADA", "url": "https://cardano.ideascale.com/a/dtd/383932-48088", "category": 26241, "amount": 31426, "description": "El ecosistema de Cardano tiene pocos juegos NFT, no mantiene la tendencia del Metaverso y perderá su competitividad con otros ecosistemas de criptomonedas.", "funded": 2, "upvotes": 148875069, "downvotes": 5262389, "votes_result": 143612680, "votes_cast": 790, "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal effectively addresses the challenge and targets to introduce PlayToEarn game that will increase Cardano's footprint in metaverse. \r\n\r\nLately there is a huge surge in metaverse projects and this is about time that Cardano ups its game too. Hence this challenge. The proposal has come up with an entertaining gaming idea with good business model and the detailed game phases  are very simple to understand, and has a good story line attached to it.\r\n\r\nThe game mechanics are further well explained that How play to earn will work for this game, and integrating NFT items is just about how any play to earn games are attracting more and more gamers.\r\n\r\n", "q0r": 5, "q1": "The experience of the proposal team is very good and in sync with the implementation domain of the proposed idea. All the team members details are presented (with linked in profiles) and additionally the pictures and details can also be found on the game website.\r\n\r\nThe game website is already updated with latest updates and contact information, and being a senior developer myself I can confirm that team experience is very good to achieve implementation of this proposal.\r\n\r\nThe budget allocation is done hourly basis and this makes it easier to justify the overall budget that is asked for. Each hourly rate is associated with the subdomain of this proposal e.g. art, design, development, animation etc.\r\n\r\nThe plan is very well outlined,  quarterly distribution of feature sets is point wise given. This is very easy to map to where proposer wants to take proposal in 3-6-9 months.\r\n\r\nTherefore, i fully agree that plan and experience presented makes it highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "I like it very much that a separate section on audit-ability is given. Furthermore, this section is divided with where additional catalyst funding resources will be used for.\r\n\r\nThis clarifies a well thought out plan and community can be sure that the budget is well spent. This also gives an opportunity to the community that this project can be tracked well across different stages of this proposal implementation.\r\n\r\nThe risks associate with this proposal are also given in details, which most of the proposals forget or miss out on. This makes community well aware of what can be expected (if something does not happen as per timelines given). The team also has given good section as solution to the risks associated, and furthermore added good section of KPIs, that are giving a good impression on how the success of this proposal will be measured. This is very well written proposal, that covers all the aspects of challenge settings. Therefore, i am very confident that this proposal can be audited easily for both progress and success.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "After a lot of boring card games and turn-based games, this is the first game that I think is different. This game genre is simple-to-play but can be like a whirlpool that players can't escape when start to play with it. Therefore, it will make a migration of players to Cardano ecosystem to play it. \r\nIn addition, the outlined key metrics show that the team is concerned about the challenge given so much and tries to add a lot of value to Cardano ecosystem, not just only with the number of players to play the game but also increase ADA holders by this game. ", "q0r": 5, "q1": "Their budget breakdown is very detailed and reasonable with their development roadmap that is detailed to single parts of the implementation of the game. \r\nThey also have a good explanation about gameplay with environments and game story that will strongly inspire players, and that info can help Cardano community assess their timeline easily. Moreover, they are also aware of some risks that can affect their progress, so I think the info in this proposal is enough to prove that they have the feasibility to finish the project. ", "q1r": 5, "q2": "The team has a very detailed roadmap, with a realistic timeline and a reasonable budget for implementing the project in the scope of this proposal. All of them go with their suggested key metric of success I think it is completely enough for auditability. \r\nGo through the explanation about the problem and the game detail that I believe it can effectively solve that problem, I hope that the successful launching of this game will make a new wind to the blockchain game industry", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "It is amazing beyond my imagination with this project IRONSKY PlaytoEarn Milestone of ADA. I never thought that in the Cardano ecosystem, there is such an attractive Play to Earn game proposal. Surely it will be an attractive game for gamers in the near future, which increases the value of Cardano as well as the entertainment value it brings to the Catalyst community. \r\nIn addition, the author also included the product code of the game in the form of NFT as well as divided the parts of the project quite clearly. \r\nIt is also important that the integration of Metaverse integrated into the last parts of the project will be really attractive. \r\nWhen I visited the website wwww.ironsky.info I was really surprised, it was really interesting and I became interested in this proposal more specifically.", "q0r": 5, "q1": "As a community advisor, I've come across a lot of recommendations from Catalyst but when I came across this IRONSKY recommendation, it made me pause for a longer read. Did something happen?\r\n- A great game scenario with great expansion later as well as the long history of this game.\r\n- Graphics are sharp, attractive to gamers\r\n- The project team has a very clear identity, with in-depth experience in the game industry on Mobile & PC, has had certain successes.\r\n- Mechanisms in the game are clear, from items, NFTs to tokens are mentioned.\r\nPlease perfect the scenario it is the fascinating part that is attracting me.", "q1r": 4, "q2": "The proposal has a very detailed roadmap, it impressed me, the author clearly knows the steps to do in his game project. \r\nIn addition, the risk analysis from the crypto market to the difficulties of the product is clearly stated. As well as upcoming success indicators and KPIs.\r\nThe budget transparency is also very detailed, making it easy for those who vote for this project to choose.\r\nI look forward to using the Test version of the IRONSKY game as well as owning the first special NFTs of the game. Good luck.", "q2r": 5, "assessor": "z_assessor_755", "no_vca": 24, "ne": 3, "ng": 11, "nfo": 10, "vca_o": 1, "reply": ">>Feasibility\nHello guys, thank you for your assessment.\n\n\nAll meet your evaluation criteria, including the criteria of Catalyst and the feasibility of this proposal.\nWe have to give it 5 stars which would be more appropriate for your comment.\nIn addition to NFT of the game's items, we also have Metaverse integrated into the game as described in the roadmap, please read carefully.\nThank you very much."}, {"q0": "This offer is really cool, it attracts many players and investors to Cardano currency. Create an economic model in the game ecosystem in which gamers can gain their stake through game items, points, NFT and Tokens. In addition, in the long term, it is proposed to integrate ADApay into the game, contributing to the creation of real values.", "q0r": 5, "q1": "I think the success of a partial skin project relies on the strength of a team, and you've got a very strong team. You having a team of experienced game developers who have been developing video and mobile games for a long period and have an in-depth understanding of game technology. Your core team has all the necessary skills for game development on Internet platforms, The team works in many countries and has a global vision. That's why it's so easy to get the job done.\r\nI have looked at your work plan it's very detailed. It exactly what needs to be done in a specific time period. I have seen your website, and seen the UI, I am really excited, I hope this project will be implemented successfully.", "q1r": 5, "q2": "The information provided is very complete. The description of the game, the plot, the features in the game is very attractive. Besides, the budget allocation is very specific, it makes it easy for everyone to know how that money will be used.\r\nI think this project will attract a lot of gamers because of its ability to bring real value to the game.\r\nAlso in the future, the proposal mentions the integration of ADAPay and travel platforms into the game, I think you need to clarify this part more. For example: the average price of a trip, what gamers need to do to have a trip, ...\r\nIn short, this is a very good idea, I hope it will be implemented successfully.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 19, "ne": 6, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Queremos crear un juego altamente entretenido de PlaytoEarn centrado en la integración de NFT en el Metaverso para atraer a los jugadores e inversores a Cardano.", "experience": "Más de 15 años de experiencia en el desarrollo de juegos para móviles. Equipo técnico en profundidad& diseñadores de juegos creativos, apasionados por el juego& blockchain."}