{"id": 384537, "author": "pborm", "title": "Firestrike Soccer Game Migration", "url": "https://cardano.ideascale.com/a/dtd/384537-48088", "category": 26241, "amount": 174000, "description": "Las plataformas de venta cobran hasta un 30% de comisión, lo que ahoga los beneficios y el crecimiento de los pequeños estudios independientes", "funded": 1, "upvotes": 29071362, "downvotes": 23407015, "votes_result": 5664347, "votes_cast": 163, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to integrate a Cardano as the in-game currency to an almost completed mobile game as well as add some additional mechanics that are blockchain-related such as rewarding NFTs. From the attached video, my opinion as a gamer is that the art looks pretty cool and I'd definately try it out. I think it would bring new users into the Cardano ecosystem and give them something fun to do with their ADA so it definately fits into the challenge.", "q0r": 5, "q1": "The proposer is asking for funding for 3 additional hires to help finish the game as well as integrate the new features over the course of a year. Their independent studio has been around since 2016 and it looks like they have worked on another game and some work for hire. There isin't too much information about their team on their website, so it would be good to know more about the skills of their team and how long they have been working on the current game.  Do they have someone lined up with the skills required to implement these features?", "q1r": 4, "q2": "The proposer outlines a schedule of what they hope to have accomplished in a year's time. It looks like the main goal set out is to have the game released in that time. They are an existing studio and have an office. Would recommend specifying where the game will be released (what platforms)", "q2r": 4, "assessor": "z_assessor_142", "no_vca": 21, "ne": 1, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "The proposal problem statement is unclear. What and which platform that charges 30% commission? And what commission? Is it for sales from your cards? Furthermore, what value does this game brings for Cardano? Explain in details on how this game will benefit Cardano. The key metrics and goal of this proposal is to deliver the game. How about the user that the proposer aims to bring? How many user that estimated to be using this game? Will it be able to cater future demands?Can it handle millions of players in the future? ", "q0r": 2, "q1": "The proposer provided a website and social media of their company account, but there are no verifiable information on each of the team members. Please provide verifiable information such linkedin profile. Moreover the information on required manpower is not enough. How many UI designer that you need to hire for 60000 usd ? The budget that you are asking is quite high, therefore a detail breakdown of the budget will help the voters understand on why do you require that amount of funding. In addition, the proposer did not provide any risk management plan. What will you do if you encounter a challenge that requires additional funding? Explain what is your contingency plan. The proposer did present a roadmap with realistic timetable to complete the work. ", "q1r": 2, "q2": "This proposal provides a roadmap and time horizon to deliver the game. However there are no mention on how many users that they aim to bring onboard Cardano. Therefore this proposal lacks of the most important key metrics to keep track on. The proposer did provide a social media and website for the voters to keep track of their work progress and also for engagement. ", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Overall, this proposal addresses the challenge posed. Gamers no longer spend time and money on video games in vain. Instead, they can profit in the long run from playing the game. Football is the king sport, I think it will be well received by many gamers.", "q0r": 5, "q1": "The proponent had a very detailed plan, which specifically described the game, how currency was exchanged between players.\r\nWith many years of experience, I believe this project will be successfully implemented.\r\nI have visited the website, I think the website that works with https protocol will be more secure and safe than http.\r\nAccording to the description there is a preliminary playable demo, but I haven't found it yet.", "q1r": 4, "q2": "How to attract users to the game? In other words, how the advertising works.\r\nThere should be more description of the prices of in-game items.\r\nRequires a budget of $60000 to pay for UI designers, $60000 for Game Programmers, $54000 for 2D Animator/Artist. How do I know the exact amount of money spent, specifically how long these people work, what is the price per hour?", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Utiliza Cardano y los NFTs generados para estimular/crear un fuerte mercado en el juego para Firestrike Soccer; ¡un juego de RPG/de fútbol estratégico en 2D!", "experience": "Desarrollando juegos para nosotros y para otros durante los últimos 5 años más o menos, con la gestión principal en el espacio de desarrollo desde 2005."}