{"id": 385169, "author": "belaykkidus", "title": "DeFantasy- Daily Fantasy Football g", "url": "https://cardano.ideascale.com/a/dtd/385169-48088", "category": 26241, "amount": 30000, "description": "Creación de un juego virtual basado en el lugar favorito del mundo. Dirigido específicamente al mercado africano.", "funded": 0, "upvotes": 17077723, "downvotes": 17253802, "votes_result": 176079, "votes_cast": 142, "f6_no_assessments": 13, "f6_rating": 2.051282051282051, "videos": [], "media": [], "f6_assessments": [{"q0": "The gist of the idea presented is to create a fantasy football/soccer game and to integrate cardano as a payment system in order to allow unbanked players (specifically in the African market) to use ADA as payment and to reward prizes in ADA as well. As the game aims to bring something fun and rewarding for people to do with ADA, it is a good fit for the challenge.", "q0r": 5, "q1": "The proposer states that they were the CEO and Co-Founder of another fantasy football game, so they seem to have relevant experience in putting something like this together. It would be good if they attached some links to the previous game so that we could take a look at what they are capable of.", "q1r": 4, "q2": "The attached document outlines a budget but there is a discrepancy in the amount in the attachment and the amount requested in the proposal. The budget outlines costs for various aspects of the business, and it is a bit concerning that the amount allocated to the actual development is very low compared to the rest. The proposer mentions that there would be weekly prizes in ADA but this doesn't appear in the budget. Also, there aren't any project milestones mentioned so it it difficult to determine how long the project will take to complete a MVP, etc.", "q2r": 2, "assessor": "z_assessor_142", "no_vca": 21, "ne": 3, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "Cardano could be benefited from what you propose, but it will be too high of a level to have effective use and create value. It would be perfect to have a benefit-opportunity mapping that gives granular details about the potential of the idea and how it could generate value. Overall the attachment provided concise details and the idea is good.", "q0r": 4, "q1": "Felt the impression that was missing a better overview in terms of the management team and how the proposed team can offer solid conditions for a successful rollout of this project.", "q1r": 3, "q2": "The plan should give us a clear idea of the superiority of the idea's leverage points compared with those offered by other community members. Make sure you see why the target gaming users have a compelling need for the idea's scope. I suggest that this section of the plan be strengthened. To proceed with your project, I highly recommend analyzing why other projects have failed as well as selecting a fantasy gaming project category that matches the unique characteristics and seeks to solve the problems presented. The concept is well thought of proposal, there can be additions that can expand the concept to multiple other gaming platforms. ", "q2r": 3, "assessor": "z_assessor_243", "no_vca": 20, "ne": 5, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "the problem was defined exactly. as a former ceo of fan11, the required experience for this project is available and the explanation is qualitatively appropriate. the experience should be backed up with a linked.in profile or similar. the impact is limited to one continent, which would, however, be pertinent. scalability is conceivable, but not exactly explained.", "q0r": 4, "q1": "the already delivered product fan11 has reached 6 million people according to the website. how many of them are actively participating is not clear. a similar success for this product is understandable, considering how many young people live in africa. a timetable broken down into subsections would better explain the budget needed. this would help to estimate at what point the project could be self-financing or if further funding would be needed.", "q1r": 3, "q2": " delivery dates should be clearly defined. possible risks and their solutions as well. the budget is clearly structured. the word file in the appendix should be completely overwritten in the application so that all necessary information is visible at a glance.", "q2r": 3, "assessor": "z_assessor_260", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "This proposal's problem statement is about unincentivized fantasy football game and also the limited choice of choosing which leagues and teams. It's problem solution is about creating a play to earn cross league football game specifically targeting the African countries. Its goals are aligned with the current challenge which is to onboard gamers to Cardano with its game, however there is no mention on how this proposal is able to scale to address future challenges. How do you plan to attract users beyond Africa? Does this game only cater African citizens or will it be playable by other people in other parts of the world? Write down the future plans for the game so that the voters can get the idea of the direction of this game.  ", "q0r": 3, "q1": "The proposer only provided the names of the team member (Kidus and Hilina) without providing any reference or links to their relevant skills and experience needed to implement the proposal. Please leave a link to your linkedin profile or any verifiable links as evidence that you are able to execute the project. Moreover, the proposer doesnt mention on the type and number of team members required to implement the proposal. Provide a detailed breakdown on the manpower needed to successfully execute the project. The proposer did presented a budget breakdown, however they fail to mention how the fund will be used. The budget breakdown was around 59000 USD and the asking amount was 30000 USD. On which part will the fund be used? Is it on the manpower or resources? How will the rest of the required amount will be funded? Is it by your own money or investors? State down the details for voters to understand it clearly. Furthermore, this proposal does not provide any sensible and conductible plan. How will you generate the ADA prize for the players other than paying for the premium membership?\r\nHow can it be sustainable during the start up?  In addition, the proposer does not provide any technical aspects on how will the game be developed. How will your game interact with Cardano? Have you already developed an API for your game to interact with the Cardano Blockchain? If its already been built, provide a link where the voters can see or test it. Also the proposer fails to present the challenges and risks that they might encounter during the development phase. What will be your plan to navigate around the challenges that you might face? Provide the information so that you will have the voter confidence that you are able to complete the project despite facing challenges.", "q1r": 1, "q2": "The proposer fails to provide a roadmap or timeframe for the project. Please provide a roadmap so the voters will get the idea of how long the development will take to be completed and also what is the milestone along the way. Furthermore, please provide a link or website to your project for auditability. Where can the voters keep track of your work progress?", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 20, "ne": 6, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The core idea is not bad and a game could ad new user to the community. The execution part of it seems to be a bit lacking and it could be written a little bit more on how you exactly plan to achieve it. ", "q0r": 3, "q1": "It would be nice to have some prove of the experience of the proboser like an Linkedin profile. The proposal reads more like a basic concept than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Also there is no roadmap or clear budget.", "q1r": 1, "q2": "There are no clear succes metrics and like mentioned above no project roadmap or clear budget. If this would have been added it would be way easier to asses the proposal. Which only the minimum of information the proposal is hard to asses", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 20, "ne": 0, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "Honestly, this proposal as written is basically an idea - not a well thought through proposal itself. I feel like I have a general idea of what this proposal may look like to implement this idea, but that is not what's presented here.\r\n\r\nI would advise the proposer to draw up a proposal with a detailed roadmap of how to create this fantasy football platform including a MVP frontend design and map out what a hypothetical smart contract may look like that this DApp is built around. Right now unfortunately all I really see here is a good idea, but just an idea nontheless.", "q0r": 2, "q1": "I see no real plan here, just an idea. I find the likelihood of this idea being successful to be very low until a real roadmap is developed and presented, unfortunately.\r\n\r\nThere are many resources within the catalyst community that can help explain what a successful proposal looks like. A good idea is still just an idea until a real action plan is created and executed.", "q1r": 1, "q2": "There is little to no information about what a plan of action may look like because of the lack of a roadmap with milestones. \r\n\r\nI advise to view some previous funding rounds proposals that were successfully funded, and create a similar template to what they have done in order to received catalyst funding. A high level roadmap should not be hard to do, if you have a clear idea of what the end goal roughly looks like. From that high-level roadmap you can then break it down into detailed milestones and create specific KPIs for those milestones.\r\n\r\nThat I think would go a long way to helping this idea get off the ground!", "q2r": 2, "assessor": "z_assessor_577", "no_vca": 18, "ne": 3, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "It is an interesting concept but more information is required as to the game mechanics, how funds are procured to then be rewarded and at which stage of development the game is at.", "q0r": 2, "q1": "More clarity or details are required to assess the experience behind the team or the resources used to develop this game and platform.", "q1r": 2, "q2": "There is no stage by stage plan, kpis or how the funds are distributed against the tasks needed to deliver the solution to this challenge.", "q2r": 1, "assessor": "z_assessor_594", "no_vca": 20, "ne": 0, "ng": 11, "nfo": 9, "vca_o": 1}, {"q0": "\"Creating a blockchain payment gateway for virtual games like soccer is a great idea to be able to create blockchain games that can connect people around the world who can play against each other. .\r\nBut in this proposal, I still have not seen the proposer offer a specific solution or implementation plan to turn this idea into reality.\"", "q0r": 1, "q1": "\"Proposer is the ceo and cofounder of FAN11, Ethiopia's first Fantasy platform. But no information about this company has been released. Therefore, we cannot verify this information is correct or not\r\nBesides, the absence of a specific product description and implementation plan is a problem that reduces the feasibility of the proposal.\"", "q1r": 1, "q2": "\"No roadmap or milestones. \r\nNot defining success.\r\nNeeds dedicated team members that can help with identifying risks and challenges and \r\nbuild a better proposal. If this is something you are passionate about, don't give up.\r\nKeep looking for people with the relevant experience and same passion for these type of games.\r\nThey are out there, you just need to find them.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 20, "ne": 0, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "The idea is great idea for Africa! The problem is clearly pointed out and a solution is offered. This idea would have a positive impact on the Cardano ecosystem if implemented. Unfortunately, it has not been explained in detail how it will add value to the Cardano ecosystem. Because there are no KPIs, it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.", "q0r": 2, "q1": "Unfortunately we do not have any information about the team or the skills needed to carry out this idea. The budget has been presented, but no deeper insights are being offered on what it will be allocated to. The plan is briefly summarized but lacks details of actionable tasks and order of execution, realistic timetable to complete the work, resources required and technical aspects for implementation. It would be good to include the idea of possible risks in the implementation of the project.", "q1r": 1, "q2": "Unfortunately this proposal left out the roadmap with milestones and a time horizon for achievement. The KPIs also have not been elaborated or presented in such a way that the progress of the proposal could be traced in any way.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The idea of football game is interesting but there is lacking enough information of how it would be implemented, what it would be based on (PvP?), etc. Only mention of the football fantasy in my opinion is not enough at this time to make proper evaluation of the project. ", "q0r": 2, "q1": "Besides the information of the person who is behind the project, there is lack of information how would it be implemented. Also, there are no milestones mentioned, and no clear path and plan is presented at the moment. Who would develop the game and on what platform? How would it be played? ", "q1r": 2, "q2": "In my opinion it would be difficult to audit the progress of the project at this time. Besides request for certain amount of support there is no explanation how it would be used/spent. It is mentioned that there would be subscription in the future but I would like to see it explained in more detail.  How potential players would be attracted to the game, how would it be played, what would the rewards be given for and how, etc.", "q2r": 2, "assessor": "z_assessor_672", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Mainpoint of this proposal is about building a cross-league cross country game that will enable people that are unbanked to play [free-to-play]. Because this proposal is not completed, the solution is still very abstract, however, in my opinion, the idea of football NFT game with the mechanism of free-to-play is very worth trying for completing in the future. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The team's profile is briefly described as FAN11 - Ethiopias first Fantasy platform, however, without any proof/link for verification. Therefore, there is no proof of feasibility provided. My advice would be: in case it is necessary to complete this proposal in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "It is not easy to assess a proposal that is incomplete like this where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "Whilst the proposal is correctly placed and does speak to the challenge it lacks any clear direction or path as to how it will bring value to the ecosystem. It would be good to see the problem statement clearly defining a problem that could then be solved ", "q0r": 2, "q1": "Whilst it sounds as if the proposer has good experience in the field there are no links or proof. There is no mention of any other team members and their accompanying skills and so it is impossible to know if the relevant experience is available to the team. It would be good to see a breakdown of the budget request as this is lacking", "q1r": 1, "q2": "There is no clear roadmap or KPIs provided. This is essential to provide in future proposals as there is simply no way to audit this proposal.", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 17, "ne": 0, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Gaming is a sector that can be both popular and lucrative if it is done right. We have seen many fantasy football league have loyal following, especially true for the popular league, EPL fantasy league for instance. With so many adult African does not have a bank account yet, using crypto currency can be a solution to this challenge. I do think another thing to consider is how many African has access to internet, since it will directly affect the gaming experience and mass adoption if it is hard to access internet.", "q0r": 4, "q1": "Since blockchain technology is quite new and can be different then the current fantasy sport requirement. I think it will be best if we can see the team and its experiences regarding the application of this new tech on a familiar games.  ", "q1r": 2, "q2": "It is hard to measure the progress of this proposal due to no timeline and milestones presented. I think a clearer roadmap will greatly improve this proposal. I recommend the proposer to reach and research the catalyst school and branch from there.", "q2r": 1, "assessor": "z_assessor_846", "no_vca": 14, "ne": 0, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Construir un juego transversal de leabue que permita jugar a las personas que no están bancarizadas.", "experience": "Fui director general y cofundador de FAN11, la primera plataforma de fantasía de Etiopía."}