{"id": 381590, "author": "matthiasksieber", "title": "Revenue Share Token Smart Contract", "url": "https://cardano.ideascale.com/a/dtd/381590-48088", "category": 26250, "amount": 10000, "description": "В настоящее время не существует смарт-контрактов с открытым исходным кодом для применения токенов Revenue Share Tokens, которые могли бы использоваться множеством различных платформ.", "funded": 2, "upvotes": 79598756, "downvotes": 3158807, "votes_result": 76439949, "votes_cast": 204, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=17850"], "media": [], "f6_assessments": [{"q0": "Proposal addresses and fits well the challenge, incl the timeline and budget limits. Having a revenue share token smart contract open sourced will support the ecosystem very strongly.", "q0r": 5, "q1": "Very experienced team with a proven track record, both regarding the network within the community and technical skills. The plan (strategy or initial logic/algorithm) proposed in this document is ambitious, but realistic and convincing for a successful implementation.", "q1r": 5, "q2": "Success metrics are presented in the proposal and suitable considering the nature of this project. Since the output is an open source solution, the progress and the success of the proposal is transparent and easily verifiable.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "They seek to build an open source smart contract for revenue sharing for Cardano DApps by issuing and selling RSTs that can raise money from crypto investors. Seems to be a good project. ", "q0r": 4, "q1": "The team of 4 experts in block chain, software development, community advisors, etc who can successfully implement the proposal. The plan looks good mentioning, among others , that they will identify RST holders and distribute rewards on their shares. Proposal is feasible. ", "q1r": 4, "q2": "The road map is clear starting from March 2022 for 12 months with detailed work schedule listed in the proposal. The budget is broken down to details.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 22, "ne": 1, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "Implementing a smart contract for RST which would be open source will have a large impact on the whole community. Since (I believe) that passive income is one of the primary goals of crypto investors, it would attract new dapps devs and therefore new cardano holders with the vision of having a share and thus having a passive income. The proposal is also in accordance with the challenge by both the budget and the goal. ", "q0r": 5, "q1": "The team is well described and more details can be found on their website. Along with the fact, that they are previously funded proposers, there is no room for doubts. The budget, since  it meets 10k according to the challenge seems reasonable, but it would be nice to define the \"part time\" or rather set \"hours\" spend on the project. Also, since the roadmap is set only for two months, it would be fine to see weeks distribution, just to provide a better picture. ", "q1r": 4, "q2": "The problem of non existing RST and basically create open source smart contract based RST is answering the problem-solution assessment part. Regarding KPIs, these can be find under success metrics and I find them suitable for auditing the success and to audit the progress, the open source code is used. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "Reading this proposal is like reading the information that one as a consumer can find about a product on its packaging: it is possible that inside one can find the solution to a problem.  \n\nAlthough the reader comes to understand the central problem that the proposal intends to solve only by reading the whole proposal and not by reading the description of the problem in the \"Problem Satement\" section (high transaction fees in the distribution of revenue to RST holders), in a first reading the proposal seems coherent: in a general way it describes the need to build a Smart Contract to diminish the impact of high transaction fees.\n\nThe reading of the proposal leaves the feeling that there are no cracks that could prevent its implementation: a competent and recognized human resource in the Catalyst ecosystem (Corcino, Sieber) with several proposals in F7, a solution (Smart Contract) to a problem (high transaction fees), a general knowledge of the problem environment (including the identification of two main strategies that could be the key to reach a solution).\n\nThe proposal complies with the time and budget parameters established by the \"Mini/Low-Budget Dapps & Integrations\" campaign to which it belongs.\n\nHowever, one is left with the feeling of having read the proposal's shell and not having had the opportunity to give a taste of its liquid center.  In my opinion, the proposal meets important parameters of the proposal submission as such, but it does not go to a level of depth that really allows to establish whether the proposal will generate a significant impact on the Cardano ecosystem.", "q0r": 3, "q1": "According to the proposal, the implementation formula is very simple: 3 months to build the Smart Contract, 1 month for testing and documentation construction.  However, it is in that simplicity that details are lost that could enrich the voters inquiry and reasoning process.  More details about the Smart Contract building process, the testing process and the documentation building process, as well as more details about the specific tasks to be accomplished by the Plutus developers and the project integration manager, would help to connect many dots.  In other words, the credibility and feasibility of the proposal cannot rest solely on the proponents of the proposal and their credibility, knowledge, experience and active participation in the Catalyst ecosystem.  In my opinion, a little more technical depth of information would be valuable as a decision tool for the voter.   \n\n", "q1r": 3, "q2": "The metrics are sufficiently timely to allow the success or failure of the proposal to be established.  However, as a voter, one question is on my mind: what would prevent the successful implementation of the proposal?", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 19, "ne": 5, "ng": 13, "nfo": 1, "vca_o": 1}], "solution": "Создание смарт-контракта с открытым исходным кодом для разделения доходов для Cardano DApps.", "experience": "Команда Loxe Inc., опытная и победившая в хакатоне группа разработчиков Plutus, участники Gimbalabs PPBL и опытные веб-разработчики"}