{"id": 383213, "author": "travisyatsko", "title": "Mobile App: NFT/Token Gallery", "url": "https://cardano.ideascale.com/a/dtd/383213-48088", "category": 26250, "amount": 7000, "description": "Доступ к изображениям NFT может быть затруднен для рядового потребителя, загрузка файлов с IPFS не так интуитивно понятна для рядового потребителя.", "funded": 2, "upvotes": 20955040, "downvotes": 16432174, "votes_result": 4522866, "votes_cast": 110, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": " Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In programming specific costs in budgets I draw my knowledge from research, and numerical programming capabilities back at my university, not professional experience in the field of software, hence this part of my assesments in this category will be more superficial and more focused on the general budget rationale with the research done and my general programming knowledge in mind. The proposal identifies a problem within blockchain which should be solved.\r\nIt clearly articulates how it will add value to the Cardano ecosystem, and the key metrics and goals of the proposal align with the outlined challenge settings.\r\n The proposal should be able to scale with the growth of the cardano NFT ecosystem, however this will need regular adjustments, updates and hence more budget. The proposal has an overall potential and a reasonable use case, however it only a very shortly formulated idea and could be explained more thoroughly in order to be able to be assessed for it's effectivity properly.", "q0r": 4, "q1": "One of the Co-proposers is according to himself a software developer. According to his github linked, this claim seems reasonable and he might be up to the task.\r\nThe budget only is very coarse-grained and does not give a more detailed rationale for the two positions that are presented there. A budget of 4000$ can suffice to develop an app with low complexity, but not for one with higher complexity, so in order for it to be determined whether the budget is reasonable, a more detailed insight into the fuctionalities and sophistication of its architecture and UX/UI design should be provided. No plan is presented for the case that additional funds will be required.\r\nThe proposer offers a timetable with milestones, that could however be more detailed in order to indicate thath in-depth planning has already been done. Feedback: Put a bit more thought into the details of what you want to do and present it to us in a more clear and step-by step manner. For example the actual app development process should be explained in more detail. In general, technical details are left unexplained, which is a clear requirement for proposals in catalyst, especially in this area, and which would have also provided a more credible picture of the team being up to the task.\r\nIn its current form the proposal can, with a competent developer be implemented, should however have a more sophisticated implementation plan.\r\nChallenges, resources required and all the deeper details are not considered in the proposal. General feedback: Try starting with 1 or 2 proposals next time and make them really sophisticated instead of starting up with seven proposals that are not properly planned. If you are unsure what I mean, take  look at some of the past funded proposal, and how they have a very dedicated and detailed plan, where every factor and every requirement is explained in detail.", "q1r": 3, "q2": "A brief roadmap with milestones and a time horizon for achievement is presented.  Metrics/KPIs that define the success of the proposal are presented. They are however not very detailed so it difficult to audit the proposal for quality (e.G. \"One Month - Finalized architecture and UI/UX using Googles Flutter Framework\" does not indicate what those have to contain and how sophisticated they are).\r\nA clear, understandable description of the targeted problem is provided. The solution is explained comprehensibly and seems at least superficially auditable\r\n Feedback: Try to make your milestones more detailed to enable qualitative auditing.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 16, "ne": 5, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "I agree with the idea of ​​creating a mobile app that imports wallet addresses' and downloads the associated NFTs to store and organize on the user's device. NFTs in blockchain also need to be brought to life through sensory perception. Special features free products for users", "q0r": 5, "q1": "The proponent provides a very detailed plan to build the product over the next 3 months. The proposed amount is broken down by tasks, however there is a $3000 amount for marketing campaigns that should be further detailed. Group identities on social networking sites should be supplemented.", "q1r": 4, "q2": "The proponent has stated that it will issue an MVP that accesses the user's wallet and displays the NFT/Token. Run a micro campaign with the goal of generating 100 downloads on iOS and Android. There will be more similar products with risks and challenges, it will be better when the team adds this information", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The idea proposed would be a very valuable DApp for the Cardano community given the millions of CNFTs already minted on the blockchain since the Alonzo HF. Being able to display cNFTs on your smartphone would make sharing and showing assets easily with others and could potentially attract more non-NFT participants. I envision this tool to be akin to having pool.pm/token at the palm of your hands. Unless I am simply being ignorant of existing tools, I do not believe there is such a phone app currently in the wild for either IOS or Android devices. There is a potential for usage to exceed the numbers laid out on the proposal and for the $7000 requested funding, it certainly falls under the remit of this challenge. I strongly agree that this proposal meets the criteria for both Impact and Alignment. ", "q0r": 5, "q1": "I positively agree to its feasibility but not too strongly, hence I held back the full five-stars. The team's names are published but with no direct links to their bona fides in linkedin.com or other generally accessible sites. Further investigation led to the main proposer Travis' profile (https://www.linkedin.com/in/travisyatsko/) who seems to possess the expertise to lead the team in terms of development, project management & marketing. The other named team members, Jia & Ismael, were more difficult to search as their names are more common. Taken at face value, they seem to possess the skillset to develop such an app, which should be relatively easier to build and deploy than a Plutus-based SC. The app would essentially have a back-end which would navigate the complexities of IPFS and display NFTs on the front-end. The roadmap for the first 6 months is described at a high level with an MVP & a v2.0 planned to be released in that time frame. From six months and unto a year is essentially a measure of the KPIs and adoption of the app when it is presumed the marketing activities will start. There is only a high level breakdown for the $7000 requested, split between engineering and marketing. To improve upon the score, I recommend the proposer provide direct links to each member's experience, qualifications & past developments particularly in IOS and Android. They should also provide a more detailed description of what makes up 'engineering' and 'marketing' as these would provide greater confidence that the costings are realistic.", "q1r": 4, "q2": "There is a GitHub presented which could be the main source to audit its progress and development. There's activity starting from Sept of 2021 which the team can build on and present to the Cardano Community and Catalyst. The proposer is also an SPO (ticker: FYTO) and is currently active and minting blocks. This can be another channel to query the project's activities, should it be voted in. I agree there is sufficient info to make this project auditable but it can be improved if the split expenditure between engineering ($4k) and marketing ($3) drills down to a lower level that would make accounting for the expenditure easier. The proposal describes a KPI of 5000 downloads from both IOS and Android after a year. I believe this number is quite low given the value it presents to the cNFT community. Good luck. ", "q2r": 4, "assessor": "z_assessor_42", "no_vca": 23, "ne": 10, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": " Has the problem needing to be solved been identified and articulated?\n\nThe problem needing to be solved has been identified and articulated namely NFT images can be difficult for the average consumer to access, downloading files from IPFS is not as intuitive for the average consumer\n \nThis proposal falls within the scope of the challenge brief by creating a mobile app that ingest wallet address' and downloads linked NFTs for storing and organizing on the users device\n\nThis proposal shows clearly how it will add value to the Cardano System by making it easier for NFT consumers that are seeking a dedicated solution to view and share their collection\n\nKey metrics and goals of the proposal been not stated clearly  \n\nKey metrics and goals of the proposal are not stated\n\nThe proposal can be scaled to address future challenges because the gallery can be expanded in size or functionality\n\n ", "q0r": 4, "q1": "\nThe proposer has not provided evidence of relevant skills and experience needed to complete the project. No Linkedin or FB profiles are given\n \nThese links arent sufficient \n\n  I have not visited these links and contacted the relevant people\n  \nI have not been able to assess their level of competence \n \n he has not rationally and logically laid out his team structure and breakdown as he has only mentioned two people.\n \n \nbudget hasnt been outlined clearly and broken down into identifiable items. It has only two broad categories.\n \n I cannot ascertain whether budget is reasonable or not.\n \n The proposer has not provided a verifiable plan if additional funding is required to implement the proposal\n\n\nProposal offers a timetable to complete the work which appears to be realistic. Only issue with this is can they reach 5000 users in 1 year?\n \nThe plan does not describe the resources necessary to implement the proposal\n  \nYes the proposal clearly explains  technical aspects like architecture, language and technologies if they are crucial for implementation\n \nNo the proposer hasnt considered challenges and risks relevant to a successful implementation\n", "q1r": 2, "q2": "\n\n\nThere is clearly laid out a roadmap with milestones and a time horizon for achievement.\n  \nThere are no clearly defined Metrics/KPIs that define the success of the proposal. The only KPI is no of users to be at least 5000 by 1 year mark.\nThere a clear understandable description of the targeted problem\n\nThere is a clear understandable solution that addresses the problem\n \nThe proposer has not identified possible hurdles, challenges and difficulties\n \nThe proposer has no plan to deal with these difficulties.\n \n\n\n\n\n\n", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 21, "ne": 2, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "Создайте мобильное приложение, которое будет получать адреса кошельков и загружать связанные НФТ для хранения и организации на устройстве пользователя.", "experience": "Трэвис Яцко: 6+ лет инженер-программист, SPO, TPM\nЦзя Ян: 6+ лет инженер SpaceX\nИсмаэль Муньос: доктор философии, 6+ лет инженер"}