{"id": 385031, "author": "abehazbunjr", "title": "Native Collections (CNFT Pinterest)", "url": "https://cardano.ideascale.com/a/dtd/385031-48088", "category": 26250, "amount": 7500, "description": "Трейдеры и предприятия, использующие CNFT, должны иметь возможность размещать пользовательские комбинации NFT, защищая себя от \"бомбардировки кошельков\".", "funded": 0, "upvotes": 16914849, "downvotes": 22707188, "votes_result": 5792339, "votes_cast": 99, "f6_no_assessments": 5, "f6_rating": 1.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Draft proposal of only 64 words requesting $7500.\r\nThe proposer posted many proposals of which 5 are in the same state of unwithdrawn draft.\r\nSo my assessment of these proposals will be very similar. The proposer should have withdrawn these proposal to save time to the voters and to the community advisors.", "q0r": 1, "q1": "Draft proposal. A link to a GitHub account is given but almost nothing else. We also know that the proposer is a Plutus pioneer.\r\nLike in his 5 other draft proposals, the proposer completed the questionnaire telling the required information was provided while it is not the case.\r\n", "q1r": 1, "q2": "64 words cannot provide enough information for any Catalyst proposal.\r\nIt is written in the proposal that a plan was to be provided by the end of the week on 2021-11-28 but ultimately was not.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nThe problem statement is not clear enough, in my opinion, for the average voter. I have been in the crypto space for 1 year now and I had to google what wallet bombing is. Try to avoid using obscure phrases (especially of technical nature) in the problem statement and in the solution in the future, or at least explain what they mean.\r\nThe solution again confuses me with terms such as \"vanity URL's\" and \"powerful regex search plus \"and\" logic\". Not everyone is a developer unfortunately and most of us struggle with this language. You want your proposal to reach the average ADA holder, not just programmers.\r\nThe idea of a Pinterest for CNFT's does sound interesting, but you should also outline how this would work and how it would be valuable to Cardano. Practical use cases are great for this purpose.\r\nDue to the problems outlined above and the lack of any type of KPI or concrete goal, even though this proposal sounds like it fits in the Dapps & Integrations challenge, I have to strongly disagree that it addresses it effectively.", "q0r": 1, "q1": "The proposer claims to be a Plutus student and the notes on the provided github do reflect this, but there does not seem to be much other activity there, especially in the fast few months. Aside from this, two years of Cardano experience are mentioned - this is too vague in my opinion. Try to detail what exactly you have done in the ecosystem in the future. Lastly, 14 years of experience of web analytics and managing large technical projects are mentioned, but no references are provided to verify this. It's a good idea to try to add at least a Linkedin page to back you up. \r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. As the proposer himself mentioned, the full plan was due at the end of November, but it was not provided yet.\r\n", "q1r": 1, "q2": "There are no KPI's or a roadmap, due to the proposal being unfinished, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 22, "ne": 4, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This proposal addresses the main objectives of the challenge, by proposing simple visualizer that allows for storing custom collections as vanity URLs with a powerful regex search plus \"and\" logic to provide hosting custom combinations of NFTs while protecting user from \"wallet bombing\".  Unfortunately the team does not provide further details on the background problem as well as the proposed solution. This proposal looks like unfinished and therefore should not be funded.\r\n", "q0r": 2, "q1": "The team does mention relevant experience in the proposal but it lacks the evidences to back up the claim. The incomplete proposal makes it hard for community to ensure the continuation and success of this project. The team requested a budget without detail on how the money will be spend or allocated. It is surprising this proposal is pass for assessment given there is no roadmap, budget breakdown, or timeline for the execution of this project in the proposal. My suggestion for the team is to update the proposal with more information and details. ", "q1r": 1, "q2": "There are no clear success metrics or KPI in the proposal. The team does not provide deliverables, roadmap, or detailed plan on how to execute the project and there is no budget breakdown in the proposal. Team does not mention where they will publish the progress of project execution making it impossible to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, goals, KPI, roadmap, detailed execution plan, and budget breakdown. ", "q2r": 1, "assessor": "z_assessor_643", "no_vca": 18, "ne": 1, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about creating a simple visualizer that allows for storing custom collections as vanity URLs with a powerful regex search plus \"and\" logic. It seems that this proposal is incomplete. I agree that CNFT traders and businesses need to be able to host custom combinations of NFTs, however, it should be explained in detail for more convincing. Conceptually, I think this idea has a certain fit for the challenge [if completed]. In case this proposal needs to be completed in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals and target; ( 2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I disagree with this proposal's impact, and would give it 2 points.", "q0r": 2, "q1": "I am convinced by the problem statement, the solution's idea, and the proposer's relevant experience [a full-time Plutus student with two years of Cardano experience and 14 years of web analytics and managing large technical projects], which can prove some proof of feasibility for this idea. However, transforming an idea into reality,  a plan is required [I am not convinced by an empty plan]. In otherwords, I can see some proof of feasibility in the idea, not in the plan. Therefore, definitely, based on the given information, I disagree with this proposal's feasibility and would give it 2 points.", "q1r": 2, "q2": "This proposal is incomplete, auditability can not be guaranteed. Therefore, I don't have much advice, except that: the proposer needs to pay attention to the principle: judgment, information must be correctly associated with evidence and documents. As a result, I strongly disagree with this proposal's auditability and would give it 1 points.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "Thank you for your great idea, but I don't really understand the meaning of this solution. With issues related to wallet bombing I think we have to have security solutions. And how to build community trust. Probably a good idea but I'd love to see what your blueprint looks like and how it will impact the community", "q0r": 2, "q1": "In terms of feasibility, I hope you can elaborate more on your personal profile as well \r\nas your team such as whether there is someone responsible for the financial aspect. \r\nAlso I hope you can show us the short and long term project roadmap. \r\nAnd the criteria you need to achieve in the future, \r\nI think it is necessary for your project", "q1r": 1, "q2": "In the roadmap I hope you can describe what value you want here, \r\nfor the country, the financial market or the people. \r\nBecause you require an investment of up to 7500$ which is quite a large amount.\r\n You should explain how you will use this money? \r\nFor how long and how can people see you using it?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "Создайте простой визуализатор, позволяющий хранить пользовательские коллекции в виде тщеславных URL-адресов с мощным регексивным поиском плюс логика \"и\".", "experience": "Я студент дневного отделения Plutus с двухлетним опытом работы с Cardano и 14-летним опытом веб-аналитики и управления крупными техническими проектами."}