{"id": 383996, "author": "chris42", "title": "Cardano for Global Health Supply", "url": "https://cardano.ideascale.com/a/dtd/383996-48088", "category": 26254, "amount": 50000, "description": "キャンペーン概要にある「ラスト・マイル」問題が、アフリカにおけるHIV、結核などの感染防止のための診断薬の提供を阻む", "funded": 0, "upvotes": 16501536, "downvotes": 18597526, "votes_result": 2095990, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "はい、この提案は課題を効果的に解決するもので、もし資金が得られれば、カルダノコミュニティに大きな影響を与えることになります。Kountableシステムはアフリカの主要6カ国ですでに稼働しているため、この統合は迅速に行われ、すぐにCardanoのエコシステムとそのユーザーに価値を提供することができるだろう。提案者が地域全体で築いた信頼は、導入の障壁を減らし、新しい分野をもたらすことでAtala Prismの到達範囲を広げるでしょう。提案者がこの分野で行ってきた過去の仕事（その成功を含む）と、そのソリューションによって対処されるSDGsを特定していることを評価します。これまでのインパクトやグローバルな課題への配慮は、有権者の共感を呼ぶだろう。", "q0r": 5, "q1": "提示された経験と計画を考慮すると、この提案が成功するかどうかを明確に判断するのは難しい。既存の製品は、提案を行った企業が、農村や発展途上国のコミュニティに必要なリソースを提供するという「ラストマイル」の問題に対処する経験と成功を収めていることを示しています。しかし、提案されているプランは刺激的ではあるものの、さらに発展させ、Atala Prismの統合がどのように行われるかをよりよく説明する必要があります。既存のプログラムにアタラプリズムを統合するために何が必要なのか、それにどれくらいの時間がかかるのかは明らかではありません。残念ながら、この作業の実際のスケジュールも、予算の内訳もありません。5万ドルという金額は、有権者にとって、どのようにしてその金額に達したのか、どのように使用されるのかが示されていない、単なる一括払いの金額ではありません。これらの問題に関する重要な情報が不足していることを考えると、私はこのプロジェクトが成功することに賛成も反対もしません。", "q1r": 3, "q2": "残念ながら、投票者が提案の進捗状況や成功を監査するための実際の情報はありません。アイデアは明らかにあり、会社の実績から提案者が解決できると思われますが、Cardanoコミュニティがその成果を確認・追跡する方法がありません。SDGsの一部としてKPIが提示されていることは評価できますが、Atala Prismの統合がこれらの達成にどのように役立つのかは説明されていません。同社は「ラストワンマイル」の問題で成功していることを明確に示しているため、これらのKPIの多くはこのプロジェクトに固有のものではなく、同社の事業全体に関わるものであると推察されます。また、前述のように、予算が何にどのように使われるのかが示されていないため、有権者はこの手法に不安を感じているようです。点数を上げるためには、提案者は、コミュニティがプロジェクトの進捗状況や成功をどのように知ることができるかを、より明確に説明することをお勧めします。", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This team wants to use distributed network and to match diagnostics supply transactions, local distributors, and capital with Cardano tools to unlock access to help prevent transmission of HIV, TB, and other diseases in Africa. This project and its problem are fit with what the challenge wants to address. And their KPIs can be fit with the challenge.", "q0r": 4, "q1": "The team doesn't have a plan to show what they will do with this proposal. They're a great team that helps a lot of people, especially helped deliver 14M diagnostics to 3 African countries cloud tech, treasury, KYC/AML platform and digitized 3K trades $1.25B in value. \r\nTo me, I have no doubt about their ability to deploy this project.\r\nBy for CA and vCA assess and fund, the team should have a plan to go and a detailed roadmap. That's basic!\r\nThe good thing is that the team attached a video of them, some images, and a website that we can visualize what they're doing and support. .", "q1r": 3, "q2": "The basic thing in a proposal the team should have for helping to audit it is the roadmap with a realistic timeline inspired key metrics/ KPIs - they had their goals very clear but lacked roadmap. \r\nMoreover, we want to know what big picture that your team wants to get with your project/ idea by clarifying that you have a well acknowledge of the problem context and have the solution with detail to solve it. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly explains how UN SDG Goal 3 is addressed via an innovative implementation of the Atala family of technologies. ", "q0r": 5, "q1": "The experience of the proposers appears very appropriate - yet there is no actual plan presented with clear milestones and budget assigned to milestones by which progress can be tracked. We encourage the proposers to resubmit with a comprehensive plan detailing how the proposed work will unfold and how the budget requested will be spent at various stages of the plan.", "q1r": 3, "q2": "The KPI presented are very generic and cannot be measured at this stage of the project because their accomplishment require a long time to determine (e.g under 5 mortality rate, etc). We encourage the proposers to resubmit including shorter term measures of success, or at least mention what they achieved in the long run along the respective KPIs so we get confidence in their estimate. ", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "分散型ネットワークを利用して、診断薬の供給取引、地域の流通業者、資本とカルダノツールをマッチングさせ、アクセスを解除する。", "experience": "クラウド技術、トレジャリー、KYC/AMLプラットフォーム、3,000件の取引をデジタル化することで、アフリカ3カ国に14Mの診断結果を提供。"}