{"id": 384363, "author": "sbpabon", "title": "DII-Smart Contracts interactions", "url": "https://cardano.ideascale.com/a/dtd/384363-48088", "category": 26254, "amount": 3500, "description": "最も重要な社会的プロセスの多くにおいて、ガバナンスフレームワークを絶対的にコントロールする途上国の地方自治体", "funded": 0, "upvotes": 16764683, "downvotes": 11144058, "votes_result": 5620625, "votes_cast": 91, "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"q0": "While good research is a crucial part of any innovation lifecycle, this proposal misses the mark of \"Accelerating Decentralized Identity.\" I can be convince that purported intention of \" formal elaboration of research paper phase\" might narrowly meet one and only one of the four key metrics which the \"Discovery of repeatable patterns in use-cases.\" But I think the key body of work that is suppose to enable discovery is \"use-cases.\" Overall, the challenge is asking for prototypes, deployable assets, most like in the form of on-chain or off-chain code. I could see a strong case if this proposal was just about doing research by people already trained in the required discipline. The lion share of this proposal,  payment for \"Plutus study phase\" in my opinion has a very low return on the intention of \"Accelerating Decentralized Identity\"", "q0r": 1, "q1": "The plan of action is clear. Usefulness to the specific challenge metric of affecting \"the number of issuers, holders, and verifiers\" or \"the sum of realized production pilots or launches in 2022\" aside, if funded there is a good chance Sir Sebastian will take the course an engage in research with his community.", "q1r": 2, "q2": "The proposal proposes some \"facts that can be easily measurable\" but none speak directly to the overall challenge key metrics. It is unclear how \"End of the Plutus course: May 8, 2022, \" for example, indicates a qualitative or quantitive measure of success in the course or furthering the acceleration of decentralized identities.", "q2r": 1, "assessor": "z_assessor_336", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "I believe this proposal should have been entered under miscellaneous. The problem statement is actually that Seb needs sponsorship to get through the Plutus course and in return will write an open-source research paper on the integration of DID with Smart Contract. I do not feel the proposal effectively addresses the challenge. ", "q0r": 1, "q1": "Seb provided a link to his LinkedIn and previous work experience. Considering he completed the Atala pioneers program I believe he will complete the plutus program and the research paper. ", "q1r": 3, "q2": "The budget is small, simple and self-explanatory. I believe it will not be difficult to audit the project.", "q2r": 3, "assessor": "z_assessor_358", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "The problem statement and high-level solution of this proposal is effectively addressing the challenge of acceleration of decentralized identity. However, the project detail does not match the solution as well as the problem statement. The implementation and outcome need to be broadened and extended to capture communities by sharing his knowledge on a blog post or through online webinar. ", "q0r": 2, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. With the vast experiences of Sebastian, I am very confident that he can complete the course and deliver the paper successfully. My only concern is this project has high risk of failure point in case Sebastian is unavailable for completing the course and executing the research (e.g. he got sick). Should this proposal is funded, I suggest Sebastian to have a backup plan for the risk.", "q1r": 4, "q2": "The auditability of this proposal very feasible because the progress and expected outcome is clear and simple: course completion and research paper. However, Sebastian can improve the proposal by providing the information about the designated location or journal for his research paper. Should the proposal is funded, he also can provide monthly report on his study journey and share his knowledge on a blog so the progress can be easily monitored by the community. ", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal somewhat addresses the challenge however it is unclear what impact this project would have for the broader Cardano community. While I value the dedication and passion of the proposer, it appears that the project is more of an education project with personalized results rather than one that would return dividends to the community. The proposer does a good job in highlighting the problem they are looking to solve, however the solution is not very clear. A way that this proposal could be made stronger is to clearly identify and articulate the key points to be promoted. For example, the proposer highlights that \"Descentralized Identity and Smart Contracts in conjunction have the potential of provide that mechanism and to level the playing field for all the participants\" yet there is no substantial evidence to support this claim. Adding in additional details and examples would help strengthen the proposal for voters, as it would avoid them needing to guess or make assumptions on this claim. I would encourage the proposer, if unsuccessful, to explore in more detail why this solution is necessary, and how it would solve the problem.", "q0r": 3, "q1": "Given the experience and plan presented it is likely that this proposal would be implemented successfully. It is clear that the proposer has an interesting idea and wants to explore it, they do a good job highlighting the problem they have identified and present a plan on how to solve it. The plan, timeline, and milestones presented are clear and seemingly manageable based on the experience of the proposer and the work done to date. The fact that the proposer has already acquired a scholarship to take the Plutus/Haskell course offered by IOG is a plus. The milestones are also simple to follow and the deliverables clear, thereby providing voters specifics on what they can expect if the proposal is funded. Finally, the budget seems more than reasonable for the work being requested and given that it so low likely carries very minimal risk for the Cardano community. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The proposer does a good job in explaining how the community can participate to audit their work. By making the research paper open source and peer reviewed, the community will be able to engage with the material and proposer throughout the process. The fact that the proposer will also be taking the IOG course, likely implies that there will be an additional layer of scrutiny, as well as many opportunities for the proposer to ask questions and seek community help. Given the limited budget being provided, the audit process would also be very simple which may give voters confidence in their ability to see how it was spent. The roadmap and KPIs are also very simple and easy understand which also makes the audit process simplified. The reason why I am not giving full marks here is because there is a lack of action once the paper is developed, i would have liked to see how the proposer plans to get the findings from the paper integrated into the broader Cardano community, and how they foresee this paper specifically adding utility and value to the community. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "分散型アイデンティティとスマートコントラクトの相互作用を探ることで、不公正な行為を減らすための重要な貢献が可能になります。", "experience": "Atala Prism Pionnerプログラムの学生。社会起業家として20年（コミュニティとの仕事）。教師。  開発者。CA。"}