{"id": 384629, "author": "nftdao", "title": "DID for the Masses", "url": "https://cardano.ideascale.com/a/dtd/384629-48088", "category": 26254, "amount": 68000, "description": "Atala PRISM DIDは、カルダノブロックチェーン＆エコシステムへのゲートウェイとして、政府だけでなく市場への浸透を可能にするユースケースを必要としています。", "funded": 1, "upvotes": 41533518, "downvotes": 12699369, "votes_result": 28834149, "votes_cast": 178, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案は、課題に適切に対応しており、大きなインパクトを与える可能性があります。しかし、提案書をさらに発展させて、どのようにして市場や分野へのアクセスを得るのか（委託業務）、それを達成するためにどのような思考をすでに行っているのかを説明することができます。また、提案者はターゲットの一つとして奨学金やインターンシップを挙げていますが、これが委託業務とどうつながるのかがわかりません。NFT-DAOの使い方はユニークですが、なぜこの要素が全体的に説明されていないのかがわかりません。DIDはどのように統合されるのか？既存のシステムとの相互運用性はどうなっているのか？この提案の背景にあるアイデアが強力であり、デジタルIDの導入を加速させるのに役立つことは間違いありませんが、満点を得るためには、より具体的な説明が必要です。", "q0r": 4, "q1": "はい、これまでの経験と計画からして、この提案は成功すると思われます。チームは、米国法に基づいてDAOとその法的基盤を構築することで、最初の一歩を踏み出したことは明らかです。チームの信頼性は、有権者に彼らが実際に提供する能力を持っていることを確信させることができます。Plutusの先駆者であること、Beefchainの創設者であること、そしてその他の資格は、間違いなく自信を与えます。\r\n計画とロードマップはよく練られており、作業完了までの予算の内訳も明確です。前述したように、このセクションでも満点を与えるには、もう少し情報が欲しいところです。潜在的なユースケースとして、さまざまな分野を特定したことは評価できますが、これはさらに発展させることができるでしょう。リスク評価については、参加者のエンゲージメント戦略からどのような課題が生じる可能性があるのか、より詳細に説明していただきたいと思いました。相互運用性についての懸念は何か？連携を打診したグループや団体からの事前の反応はどうでしたか？これらの詳細を記入することで、有権者にさらなる自信を与えることができるでしょう。", "q1r": 4, "q2": "提案の進捗状況や成功を監査するのに十分な情報が提供されています。私は、自分たちの素材をオープンソースにして、コミュニティの精査にさらすことにコミットしているプロジェクトをとても評価しています。これは、私たちがカルダノコミュニティとして誇りに思っていることであり、ここでもそれを見ることができて感謝しています。進捗状況、マイルストーン、リスク評価をまとめたレポートをコミュニティに公開することで、投票者は提案を監査することができると確信することができます。提案全体を通して提示された透明性と、（目に見えるアクティブなコミュニティメンバーとしての）チームの実績の証明を考えると、監査可能性については満点です。", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal aims to bring in tens of millions of users.  If successful it would be a great boon to acceptance of Atalia PRISM.  \r\n", "q0r": 5, "q1": "The proposal references a market of $54.5B a year - but it isn't clear what commissions this is referring to.  Success may suffer from the chicken and the egg problem that plagues all DID and VC efforts.  The project promises to add large numbers of new users but doesn't have any marketing component listed.  How these large numbers of new users will be acquired is unclear.  The proposal appropriately recognizes the risk of the Atalia PRISM SDK being incomplete and changeable during development. \r\n", "q1r": 3, "q2": "The proposal adequately describes a path to successful auditability with regards to the application development, but doesn't have KPIs related to adoption. \t", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is well placed in the challenge and aims to accelerate adoption through DIDs, However it is slightly unclear what exact sector they are targeting and where exactly is the entry point into the decentralised  Identity problem and how they plan to achieve this. Therefore I agree but would like to see a clear explanation of the solution.", "q0r": 4, "q1": "The team seams to hold the requisite knowledge and experience to implement the proposal however it would be good to have links to prove this.The funds requested are well broken down but the timeframe is hard to determine as the is no clear outlook other than a simple SSI system in place. It is great to see possible challenge/failure points listed in terms of delay on the Prism SDK.", "q1r": 4, "q2": "It is stated that KPIs will be provided during performance reviews of each sprint but none are listed and so it is impossible to evaluate the audibility of the project. ", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does address the goals of the DID mass adoption challenge. With DIDs used in combination with NFT DOA this could significantly grow adoption.", "q0r": 5, "q1": "This is a strong team that has very relevant experience in the blockchain space. I believe the team has the experience to delivery on the project goals.", "q1r": 5, "q2": "Although detailed project goals with a timeline are provided I am unable to determine clear KPIs for this proposal.", "q2r": 3, "assessor": "z_assessor_977", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}], "solution": "DIDを開発して、年間$54BのボリュームをCardanoにもたらし、DIDが提供する利益を利用できる数千万人のレディマーケットに展開する。", "experience": "3 Atala PRISM パイオニア、Beefchain ファウンダー、NFTDAO ファウンダー、エンタープライズアーキテクチャの専門知識、スタートアップの経験。ターゲット市場を知っている"}