{"id": 385016, "author": "amolagg", "title": "(DEI): Decentralized Exam identity", "url": "https://cardano.ideascale.com/a/dtd/385016-48088", "category": 26254, "amount": 20000, "description": "現在、私たちは、すべての学生が個別に操作できる安全で分散化されたIDシステムを持っていません。", "funded": 0, "upvotes": 18216171, "downvotes": 12609040, "votes_result": 5607131, "votes_cast": 100, "f6_no_assessments": 6, "f6_rating": 2.2777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "提案者は、明確な問題（試験のための学生の識別）を特定していますが、Atala Prismでどのように対処するかの解決策を示していません。試験が教育システムの大きな部分を占め、学生や管理者にとって大きな障害となっているのは事実ですが、これではあまりにも限定的です。Cardano上でDIDソリューションを持つことは、きっと学生の教育キャリア全体に活用され、試験、コース、学位、資格が保存され、保管されるでしょう。残念ながら、今回のケースでは、試験に焦点を当てるのは狭すぎるかもしれません。提案者には、このアイデアを継続して開発し、特定された問題に対するより具体的な解決策が出てきたら、将来の資金調達ラウンドで再提出することをお勧めします。", "q0r": 2, "q1": "残念ながら、この提案は現状ではアイデアに過ぎず、指摘された問題をどのように解決するのか、具体的な計画がありません。Atala Prismを使った「解決策」は、説明されている状況では理想的であると思われますが、それが実際に実現可能であることを有権者に確信させるだけの具体的な説明がありません。実際、何をどうやって解決しようとしているのか、よくわかりません。また、予算の正当性や、どのように使われるかの内訳もありません。提案者が自分の背景を説明してくれているのはありがたいのですが、提案者の言葉以外には何の裏付けもありません。提案者が再提出する際には、リンクトインやウェブサイト、過去の仕事の例など、資格に関する情報をもっと記載することを提案します。また、次回のスコアアップのためには、政府や学術機関がこの方向に進む意思があるかどうかを探るために、どのような作業が行われたかを説明することも考えられます。  ", "q1r": 2, "q2": "いいえ、提供された情報は、提案の進捗状況や成功を監査するのに十分ではありません。前述の通り、この提案は現時点ではアイデアに過ぎず、十分に発展していません。また、コミュニティが見ることのできる製品やツールも提示されていません。再提出の際には、何を、いつ、どのようにしてソリューションを構築するのかについての追加情報が必要となります。提案者は、似たようなソリューション（学生の資格情報）に取り組んでいるチームを見つけて、提携してみるとよいでしょう。アイデアがあることは明らかですが、コミュニティが自信を持って資金を提供できるようにするには、もう少し考えなければなりません。", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 20, "ne": 13, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Implementation of DIDs in the education sector would be a valuable tool in the adoption and expansion of the Cardano ecosystem, while at the same time improving the current system to better service the community.", "q0r": 4, "q1": "The idea could have a lot of potential, and from the brief description of the proposer's experience, it seems like she/he would be able to implement it. However, there are some very important metrics that are still missing in order to have the proposal properly assessed. There is no timeline or roadmap with clearly defined steps, the budget is not detailed at all and from what is written, there is big chance the proposer might need to hire additional people, at least on the marketing side.", "q1r": 2, "q2": "Since the proposal does not include any kind of metrics and a timeline/roadmap in its description, it could not be properly evaluated. It would need to have clearly defined stages in the timeline, that would help the community in assessing its success and progress. How many steps will be implemented and by whom and how fast can we expect each step to be completed. What happens if anything doesn't go according to plan?", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "A solution is provided to the identified problem, but is unclear what is to be solved and looks like the goals of the proposal don't fit in the challenge objectives. For an outsider is somehow difficult to understand how the framework will perform (inputs/outputs).\r\n\r\nIn its current form - it may be somewhat too ambitious to convince a government to utilize such a tool.\r\n\r\nThere are no timeline, KPIs/metrics defined for the proposal thus making it hard to evaluate the success.", "q0r": 2, "q1": "It is unclear if the team is made by one member (the proposer) or additional human resources are necessary. The proposer should add verifiable trails of education/experience necessary to successfully complete the project. The proposal looks more like a concept than a working project.\r\n\r\nThe budget is not clearly outlined and broken down into identifiable items thus making difficult to appreciate if is reasonable or not.\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal. (human resources, devices, stationery etc.)\r\n\r\nBased on the given information, I don't expect a successful implementation", "q1r": 1, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. Possible challenges are not taken into consideration. In conclusion, the progress of this proposal is hard to assess. ", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 23, "ne": 0, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "A Secure Decentralized Identity mechanism is part of this Challenge. It would enhanced your solution statement if you had included interfacing with the the Atala Prism platform because it is part of this challenge statement", "q0r": 4, "q1": "Although you have 2 years experience you have not explained if that experience is appropriate for this effort. A more detailed breakdown of your timeline, KPI, and budget would also improve on this proposal", "q1r": 3, "q2": "For a proposal to be sufficient to audit I would suggest you add a Time Line and dates for completion, details for each step to be accomplished and what would a successful product look like. These would help the CA and Voting communities in forming an opinion about your ability to be audited.", "q2r": 1, "assessor": "z_assessor_320", "no_vca": 24, "ne": 0, "ng": 17, "nfo": 7, "vca_o": 1}, {"q0": "The proposal clearly identifies a problem within the challenge and a novel way to implement a solution. One of the hardest parts os SID is the chicken and egg and gaining user and institutional adoption. It would be great if you could address and speak to a specific entry point/ region within the exam system in future proposals.", "q0r": 4, "q1": "Whilst the idea has huge potential the proposal is rather vague as to how it seeks to tackle the problem. a clearly defined first step and targeted approach would greatly aid in determining the feasibility of this project. Additionally a breakdown in funds is need to establish whether the requested amount is correct. ", "q1r": 2, "q2": "No KPIs are listed and no roadmap is given and therefore it is not possible to audit the success of this project at this stage.", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal has the potential for mass scale DID adoption, but it lacks the information required to understand where this project will be first launched.", "q0r": 3, "q1": "The proposer clearly has development experience, but it is not clear on their experience in Blockchain. No other team members are mentioned, so it is hard to judge the experience behind this project.", "q1r": 3, "q2": "Unfortunately, this proposal does not contain clear KPIs, or a timeline. It is very hard to determine the success of the proposal.", "q2r": 2, "assessor": "z_assessor_977", "no_vca": 30, "ne": 0, "ng": 19, "nfo": 11, "vca_o": 1}], "solution": "このIDはすべての試験で共通となり、各学生はスマートフォンからアクセスできます。", "experience": "フルスタックソフトウェア開発者-2年\nGoogleでインターンを経験。\n2つの研究プロジェクトに資金提供を受けました。"}