{"id": 367569, "author": "", "title": "Add SDG ratings to proposals - AIM", "url": "https://cardano.ideascale.com/a/dtd/367569-48088", "category": 26114, "amount": 7500, "description": "国連機関と提携するということは、カルダノが共通の国際的なフレームワークと目標設定の言語を採用することを意味する。これは現在のところありません。", "f6_no_assessments": 5, "f6_rating": 3.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Providing each proposal with an SDG rating would help provide a common language that would foster the goal articulated in the challenge of connecting Cardano projects with Global NGO and IGO partners. It seems that this proposal would rely on using the SDG framework which a connected challenge plans to develop. I am not certain the impact would be the same if this proposal were approved on its own without using an established framework. ", "q0r": 4, "q1": "There is no doubt that the team of proposers has the relevant skills set, is highly motivated, and hugely committed to the Cardano ecosystem.  The first obstacle to implementation involves (as I understand it) a reliance on the SDG framework developed in a parallel proposal. But the second obstacle to implementation is the plan to integrate SDG information into the Ideascale platform. While the team highlights this as a challenge, I found their proposed solution of relying on support from Catalyst to be a bit lacking. It is not clear how much leverage the Catalyst project would have with the Ideascale creators, or what such changes might cost to implement. I could also imagine pushback from the broader community around the concept that every project proposed in Catalyst needs to be rated through the SDG lens, as there may be different views within the community regarding the relevance of the UN. A bit more detail on these points and convincing explanations around how they will be overcome would be helpful. ", "q1r": 2, "q2": "The proposal provides a very nice roadmap for their process and key metrics. It would be easy to audit whether they have successfully added an SDG rating criteria to Ideascale. However, the metrics around developing hubs and promoting partnerships with global organisations were very vague.  I am not sure how a partner is defined, what a hub would do, or what kind of leads are envisioned. More clarity on these points would improve the proposal. ", "q2r": 4, "assessor": "z_assessor_278", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Yes, we need this for those proposals that are \"SDG relevant\" but we don't need it for all the proposals. If we can show UNDP, World Bank and the like that certain percentage of funded proposals advance SDGs that should be enough. What the \"Partnership with SDG Lab and Seedstars\" would include is still a bit unclear but that deliverable alone could justify the applied funding.", "q0r": 3, "q1": "Getting anything developed in Ideascale is tricky (because Ideascale team needs to do it). Based on the very challenges identified by the team, perhaps this should be combined with one of the many proposals from the same team, the Proposal Framework Tool: https://cardano.ideascale.com/a/dtd/Proposal-Framework-Tool-AIM/369300-48088\r\n\r\nIf that tool focuses only on SDG-relevant proposals and allows the proposers to copy-paste quality content to Ideascale, then the mentioned challenges are no longer a hindrance.", "q1r": 2, "q2": "It is not completely clear who would get this \"European modest salary\" and whether these individuals would actually have time to carry out all the tasks they have envisioned, should this and their other numerous proposals be funded.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a very good proposal. It would definitely align the Cardano community and the work we are doing with the UN SDGs. This proposal, if adopted by the IOHK foundation and Cardano community  will put thesSDGs front and center in any catalyst project and hopefully wider in the Cardano eco system. I would like to place an additional challange with this group, which is what about the other way around? Can use we the Cardano platform and ADA token (or other token or NFT built on Cardano) to enable the SDGs to be met? As i am sure you are aware, the SDGs are the latest in aspirational projects put forward by the UN which is very far from being implemented. Many countries especially in Africa where Cardano has a very big presence are far from attaining even the basic goals. How might Cardano support their attainment? And how can Cardano use their  Grow Africa programme to integrate the SDGs? ", "q0r": 4, "q1": "I think the proposal as written wold be implemented reasonably well. However i have not given 5 stars because i would like to see a bit more research into other platforms and potential partnerships. The SDGlab.Ch was put forward as a partner in this project. And it would work. However what about this platform: https://bcorporation.net/sdg-insights-report-2021 \r\nB Corps have translated the SDGs into a business friendly language and set of goals and aspirations. They have already developed an audit tool to audit companies implementation fo the SDGs into a granular enough level to be highly useful to assess a proposals ability and to what degree it is aligned with the SDGs. See: https://bcorporation.net/welcome-sdg-action-manager Why not use their action manager? I think it would be perfect and would solve your problem of assessment which you highlighted in your challange 4: \r\n\r\nChallenge 4 - measurement and verification\r\n\r\nWhen we talk about impact, measurements and verification are very important but also very challenging. There might not be a simple solution and we will aim to suggest a base that could be developed ongoing.\r\nThere may well be other better assessment tools available?  \r\nThe team looks very skilled and knowledgeable in the crypto space and Cardano in particular. I would suggest that they take on someone who is skilled and experienced in the SDGs and environmental consultancy. This would help i think in the implementation.   Just a final word about the SDGs. They are focused on sustainability which is no longer where we need to be focused. We need to be putting our efforts into regeneration (of eco systems, biodiversity etc). Because of how the UN works we are stuck for the time being with the SDGs, which are out of date. However as this catalyst proposal stream is about aligning with the UN and their work it makes sense to use their frameworks. ", "q1r": 4, "q2": "See above. I think integrating the: https://bcorporation.net/welcome-sdg-action-manager would be a great way forward that i think would give Catalyst projects an easy and very useful way to assess their alignments with the UN's SDGs. You would also in the process be building a bridge to B corps which is another international organisation which would be very useful in itself for further collaborations. \r\nI think the time line laid out gives a clear pathway to implementation for the project and can easily be audited.  ", "q2r": 4, "assessor": "z_assessor_374", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "In the practice, the question the challenge has to answer in general is: how to make the life of organizations like the UN or the World Bank better, in their fight againts the particular interest of the local governments full of corrupt politicians and officials?  Reach an agreement of mutual work is not a problem.  The point Is how us can work in the back of the organizations like the UN, in a  softly and silently way. The point is how us can be a secret weapon in the fight againts the injustice that those organizations wage in the most hostile places.\r\n\r\nCardano would be a silent heroe.  \r\n\r\nAbout the proposal, those guys know what they are doing.  No doubt about that.         ", "q0r": 4, "q1": "The team understand the mechanics of the community and their purpose is in line with the objectives of a better world.  It's awareness about the budget assigned to the challenge in proportion to the budget of its proposal is remarkable. ", "q1r": 5, "q2": "-\tThe proposal provide a roadmap with detailed milestones for the follow-up of the proposal.\r\n\r\n-\tThe proposal present clear metrics/KPIs  that define the success of the proposal or some means of monitoring the proposal.  The community will be able to audit the progress of the proposal.\r\n", "q2r": 5, "assessor": "z_assessor_541", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "For starters, it is a way to go in tackling campaign challenge, having to link funded catalyst projects to SGDs of global international bodies. However this approach is not holistic and may lead to exertion of valuable resources.\r\n\r\n In addition, I will suggest most importantly that Cardano community should have a strategy to engage these bodies for collaboration on how blockchain technology specifically Cardano foundation in conjunction with its strategic partnerships and fashion ways and strategy to help in meeting these goals.", "q0r": 4, "q1": "Given the team's experience and past accomplishments and the mention of other collaborations with stakeholders in the ecosystem is great advantage to ensuring successful execution of the proposal.\r\n\r\nThe strategy to partner with collaborators already on ground to facilitate local hubs is outstanding. This is very important for information gathering and necessary research.", "q1r": 4, "q2": "I totally agree that the key metrics to assess and monitor the progress of the project is effective.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "グローバルな組織のニーズやハブに合わせて、SDGsのパラメータやインパクト評価を取り入れる仕組みを作る。", "experience": "AIM - voter-tool, CA-tool, vCA-toolを開発しているチームです。教育者、開発者、UIやデータの専門家、インパクトのあるベンチャー企業、関連組織とのネットワーク。"}