{"id": 368544, "author": "", "title": "Cardano Powering Planet Improvement", "url": "https://cardano.ideascale.com/a/dtd/368544-48088", "category": 26114, "amount": 15000, "description": "私たちは、**対等なパートナーシップ**を作る必要があります。大量の採用は、世界を改善するのに役立つ、尊敬されている**暗号化資金を提供するNPO/NGO**から行われます。", "f6_no_assessments": 7, "f6_rating": 2.047619047619048, "videos": ["https://youtu.be/CCxU-EnnIUY"], "media": [], "f6_assessments": [{"q0": "I really like the idea of Cardano and Project Catalyst showing example in tackling the most wicked problems in this world. Unfortunately this proposal doesn't show how it would be done.\r\n\r\nI went through the proposal and the social media groups and there's no activity there whatsoever apart from admin posted links. I'm sorry but this sounds like a pie-in-the-sky dreaming, not actual proposal.\r\n\r\nI have extensive experience of participating in and leading non-profit organizations and social movements. Although they might be misled by the UN, at least they are now more unified around the SDGs than ever before. Offering criticism without actual solutions is not very constructive.", "q0r": 1, "q1": "Selling a token for \"planet improvement\" is not a plan. Instead of listing thoughts, please answer WHY, HOW, WHAT, WHEN and finally WHO is the team that is going to make all this happen.", "q1r": 1, "q2": "The feasibility of this proposal is highly questionable. It would be difficult to assess whether the vague goals have been achieved or not.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem to be solved is described in an unclear manner - 'We need to create a partnership of equals, mass adoption will come from a respected crypto-funded NPO/NGO that helps the world improve!' (partners equal in what?; what is to be improved for a better world?). \r\n\r\nAlso it is unclear how the proposed solution addresses the problem and solve it.\r\nThe proposal doesn't fit in the challenge settings (Only one mention about Africa)\r\n\r\nThe proposal looks more like a concept than as a working plan. It is not clear how the proposal would add value to the Cardano ecosystem. (The working plan should have a realistic timetable with achievable milestones defined. Also the proposal should make use of Cardano ecosystem and its benefits)\r\n\r\nThe key metrics and goals of the proposal don't align with the outlined challenge settings. (i.e. how many potential users could be attracted in this project? how many users (from the previous category) will be actively involved in this project? etc.)", "q0r": 2, "q1": "The proposer doesn't provide evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal (as it is). The decentralised autonomous organisation (DAO) has proven its limits, as a concept, one of its biggest constrains being how government regulators would deal with a stateless fund. This could be a thrilling challenge that has to be addressed.\r\n\r\nThe token that will monetize and fuels this concept is minted in a 45B supply (it is enough to achieve the goal of the proposal? There will be any deflationary approach for making this model attractive?). No statement on how this token will keep this model running has been made (how about stakeholders, voting system, profit distribution etc.).\r\n\r\nThe proposer has not considered any challenges and risks relevant to a successful implementation.\r\nIt is unclear what is the measurable outcome (or deliverables) of the first phase of this proposal. (what is target market capitalization?)\r\n\r\nEven the proposal has a timetable is not clear what will be the measurable outcome of each phase (understandable and relevant KPIs/metrics should be defined)", "q1r": 2, "q2": "Unfortunately the proposal lacks in providing necessary and relevant info on how it will succed and how it will add value to the Cardano ecosystem. (the problem and the solution to solve the problem should be described in a clear and understandable manner, to get easily red by any outsider)", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "Proposal is aiming to build a Worldwide Crypto funded NPO/NGO focused on improving the planet & living sustainably by curating & funding innovators & innovations which will drive mass understanding of the industry and thereby facilitating mass adoption & use of cryptocurrencies & blockchain based services doesn't really address any challenges.", "q0r": 3, "q1": "Proposer's experience on Business, Finance, Real Estate, Internet, Corporate & Lifestyle including not-for-profit & waste management isn't enough to implement this proposal. It will be needing a team as the scope targets 'global' audience.", "q1r": 3, "q2": "Showing how an organization build for the benefit of people can be governed by the people who speak ordinary language and talk about properly identified problems to solve. The sustainable development goals of the United Nations do cover the ground necessary but are mere statements of the obvious, if you try to read the detail you will see it has been written by bureaucrats using complicated language that seems to aim to please the reader rather than identify core daily problems to solve.\r\n\r\nRoadmaps and Key Factor Indicators are detailed and budget is reasonable. Auditing the progress might not be difficult. ", "q2r": 3, "assessor": "z_assessor_340", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "This is a well thought through proposal and if Carl Henry global can achieve what they say they can then this would be a real bridge to for instance the UN SDG's. I would appreciate a link to the SDGs and an assessment of which SDGs are likely to be first addressed. As the SDGs also carry with them a framework of goals this would also provide a framework for auditing. The references to the World bank need more detail.  \r\nI am slight skeptical of the iHear moniker as there is much more to creating a sustainable world than housing, ecology, affordable, recycling, and waste. But it's a good start. I am curious why these aspects of sustainability have been chosen and not others? ", "q0r": 4, "q1": "This appears to be an achievable project at least in certain aspects of the proposal. The Carl Henry groups seems to have a track record in both the financial and building sides of housing. As long as they are able to bring sufficient resources to the project i am sure they can make this happen. \r\nI think the road map needs more thinking through as there is such a large number of areas and projects that can be implemented. I would love to see some easy, achievable first steps described in enough detail to give the project more grounding a real achievable outcomes. \r\nIt is not clear what the Carl Henry Trust has achieved if anything. And who the people are in this team apart from Carl Henry. This needs more detail. What experience have they in meeting housing needs and the other as yet undefined aims around ecology and waste. On the plus side going down the route of modular factory built housing is clearly a way to reduce costs and maintain high build standards. This is a real plus for the project. \r\nThere is just so many ways this project could develop that it is hard to see exactly how they would initially proceed. \r\nThe budget is a bit sketchy and needs development.\r\nThe way the project is being financed though the token is not clear. How will the token be sold? What value would it have? Why would anyone buy it? I think tokenisation is the way to go in terms of funding a project like this, but how exactly its going to work is not clear. Are there any similar projects that can be used to illustrate how the token might work and how why anyone would buy it? I know this is a very new field, so maybe this aspect of the project cannot be substantiated, ore more fully laid out.    \r\n ", "q1r": 3, "q2": "At the moment no there is a road map but how and why this will happen as its set out is not clear. The road map has some goals, and they are to do with building the internal structure of the trust. There are no goals laid out for achieving the aims of the trust, so that is not clear and i cannot say one way or the other whether the goals of affordable, eco-friendly  housing can be achieved for instance.  ", "q2r": 2, "assessor": "z_assessor_374", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "This proposal does not address the F6: Partnerships for Global Adoption challenge: \"How can Cardano enter in global partnerships with United Nations Development Programme and World Bank Group, to leverage mass adoption?\" \r\nThe proposal solution to \"Build a Worldwide Crypto funded NPO/NGO focused on improving our planet & living sustainably by curating & funding innovators & innovations\" does not answer the question, \"How can Cardano enter in global partnerships with United Nations Development Programme and World Bank Group, to leverage mass adoption?\" A list of the United Nations Development Plan and the World Bank Group goals has been compiled after research. There is no indication how the proposal solution will enable Cardano to enter into partnerships with these entities.\r\nIn the white paper at https://cardano.ideascale.com/a/idea/368544/42035/download, the mission of i.H.E.A.R. Trust is to help people \"hear\" the message about reducing the waste we create, reusing it in ways that solves real-world problems in a sustainable way and by motivating people to take action.\r\n", "q0r": 1, "q1": "This proposal is very unlikely to be implemented successfully. \r\nThis proposal has too many future plans and not enough actual proof of past intention other than a few YouTube videos created in the last month, multiple Facebook and other social media accounts with very little, if any original material. I have found at least 7 websites saying roughly the same things across them. The amount requested is 50% of the total budget for this challenge setting and the proposal is not in line with the challenge setting. 0ne third of the requested budget is for consultations to launch a token which seems to be the real focus of this proposal.\r\nThe proposer has been busy creating 39 proposals across ideascale, since joining July 23, 2021. 10 of these have made it through to the assessment stage. Each one equally as long and full of lists, links, and pour quality videos. In the token white paper at https://cardano.ideascale.com/a/idea/368544/42035/download there is mention of, but no link to research done since i.H.E.A.R. Trust was incorporated in 2018 nor to the \"open source offsite modular construction designs and other techniques...\" According to the company document at https://find-and-update.company-information.service.gov.uk/company/11488430/filing-history, i.H.E.A.R. Trust has been dormant since incorporation. The I Hear Trust Limited YouTube Channel has collections of the various topics with promotional videos interspersed between videos from other YouTube channels that produce these https://www.youtube.com/channel/UC-l_WkEnzPuUkysm9PixQmg\r\n", "q1r": 1, "q2": "This proposal does not provide sufficient information to assess progress. There is no auditable plan: (roadmap & timeframe, KPIs & metrics, addressing risks and challenges). The description of the problem does not align with the challenge, nor does it show clearly how this proposal will accomplish this conclusion: The Cryptocurrency and Blockchain industry must show it is not just, playing \"money games\", we should show that we are fulfilling a Global leadership role, in things people care about and we can build an international non-profit & non-governmental organisation.\"\r\nIn choosing the Cardano blockchain, the proposer sees \"the international vision of IOG & Cardano perfectly in line with our own ambitions, we believe we will benefit greatly from the way the Cardano Blockchain has been built & developed and how this 3rd generation ecosystem will facilitate interoperability with existing dApps and the new ones to come.\r\nI would think that proposals funded by Cardano through Catalyst would want to show how they align with the vision and mission of Cardano, not the other way around.\r\n", "q2r": 1, "assessor": "z_assessor_500", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "While charitable trusts are a great project, the effectiveness of this proposal is doubtable, as the proposing business has already filed strike-off notices, indicating they are in financial trouble and most likely need funds to pay outstanding debt.", "q0r": 1, "q1": "While the plan is set up in a mostly detailed and correct manner, for several reasons, after some research the company does not seem up to the task. 1) The website and the social media does not match up to the self-acclaimed reputation and claimed size of the company (all media and social media coverage is selfmade, the wensite looks very unprofessional for someone who supposedly has been in the business for 23 years and the website discloses nothing about any staff member while there are apparently about 10 CH companies). Furthermore, taking a look into the UK business registry the company or versions of it was dissolved and re-found several times. The sheer amount of proposals from the proposer make it unlikely that he will be up to the task of finishing all of these. 2) Strike off requests from the company have been suspended or denied, which often means outstanding debt.", "q1r": 1, "q2": "While milestones are set, some of the targets are defined very open. Furthermore, the fact that the company was already dissolved several times in the recent year make ot unlikely that the proposal can be audited. How can you audit a proposer who regularily dissolves his business?", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1, "reply": "Dear vCA,\nOnly a personal opinion given: The assessor has decided they know the capabilities of the proposer based on a quick scan of social media and a misunderstanding about the status of the company, they have made a blanket judgement of all ten proposals based on incorrect judgements. There is no debt because the company has never traded, all assessments are copied and pasted on each of my proposals showing a general bias against all of my proposals.\nUnconstructive assessment: The UK Companies are all in good order, this assessor does not understand UK company law, the companies have not been dissolved even once, Notices were served to dissolve the company one time, when I thought about discontinuing the project but I decided to continue and filed the necessary document to continue the company. This does not indicate a lack of ability to complete the proposal.\nRegards,\nCarl Henry\n"}, {"q0": "This proposal perfectly meets the objectives of the challenge, because it is based on financing several projects, from different aspects such as housing / recycling / ecology, etc., projects which use technologies to the cardano universe, as described in the proposal: \"the power of cryptocurrencies, asset tokenization, blockchain books, smart contracts and decentralized applications.\" In this way, the objective of establishing partnerships with companies, initiatives or initiatives that address global scale problems is fully met. Therefore, when it comes to impact, this proposal is perfect, if what is promised is certainly fulfilled, the benefits both for the community and for the planet.", "q0r": 5, "q1": "iHEAR Trust Limited is a group, as I understand it, is a project development NGO of various branches (branches that I mentioned in the comment above and he also speaks at the beginning of the proposal). The group is led by Carl Henry, who attached to his linkedin profile, which I consider the best way to know who the professional really is, through the report of past experiences, the description of the biography and comments from third parties. In other words, we can know very well who the project leader is, but the same cannot be said in relation to the other members of the NGO, we are not told who they are, what they do, etc. As it is an extremely broad proposal, it would be interesting to have a deeper knowledge about how the NGO works, because even though there are several project fronts, I believe that there would always be a main backing that would guide the NGO's actions. For example: in housing, people who work with architecture, construction, recycling of materials would certainly be involved; in ecology, maybe professionals turned more to biology, agronomy, these areas... But who would manage professionals in relation to the objectives of these NGOs? We have a broad vision of what would happen, and also when it would happen, but as it is a very large project, it would be interesting in my view to provide more details not only about the team in terms of auditability, but also how a community can follow the activities.", "q1r": 3, "q2": "As this project is of huge proportion, a lot of information is released about what would be done and in what order, within each project front (recycling, ecology, etc.). What worries me is, as I mentioned in the previous comment: how can the community track the progress of these activities? It would be beneficial if there were meetings with community members, which took place on a standard frequency, where each surveyed member followed up on the project that was most interesting, for example. Or even that reports are prepared to clarify how the projects are progressing. Another question that confused me is whether these project areas would all happen at the same time, or whether it would be more like \"one ends and another begins\". It would also be nice if we knew who is predetermined at each stage. The impression I had is that the project is very ambitious, I don't know if it would be possible for a single institution and a small team to organize everything satisfactorily, it would be beneficial to focus on one aspect at a time, and while success was ended later as activities expand, but it's just my vision. In relation to expenses, it is mentioned how the financing money would be used, but in a very superficial way - there was a lack of detail here, in my opinion. In general, I found it to be a very interesting proposal, but as I said, because it is very broad and extensive, it might be more interesting to go little by little and be more sure who the people involved in each part would be, as well as how the Cardano community could monitor the NGO's activities.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 1, "nfo": 1, "vca_o": 2}], "solution": "イノベーターやイノベーションを発掘し、資金を提供することで、地球環境の改善と持続可能な生活に焦点を当てた**世界規模の暗号基金付きNPO/NGO**を構築します。", "experience": "私は、金融、不動産、インターネット、企業、非営利団体や廃棄物処理を含むライフスタイルの分野で43年のビジネス経験があります。"}