{"id": 368752, "author": "", "title": "Rapid prototyping ...made easy", "url": "https://cardano.ideascale.com/a/dtd/368752-48088", "category": 26114, "amount": 22500, "description": "メーカーが自分のアイデアを前面に押し出したプラットフォームや、製品が販売された後にどのように使われたかを示すものはありません。", "f6_no_assessments": 2, "f6_rating": 1.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge asks for proposals that provide a framework for global partnerships with the world bank and/or UNDP. From my assessment this proposal is related to the challenge in 3 possible ways, 1) by measuring the project against the SDGs, 2) by searching for a connection with the UN (UNESCO representative and a UNSDG representative), 3) by building a solution that could possibly significantly benefit developing economies. However, my interpretation of the problem (disincentive for makers and explainers to do their work openly), the solution (use of smart contractors to reward rapid prototyping and so boost a the supply of a marketplace (this last is assumed to be the goal)), and the requested funds (resources such as a developer from IOHK) do not directly address the challenge (How can Cardano enter in global partnerships with United Nations Development Programme and World Bank Group, to leverage mass adoption?). The proposal also misses a description of a framework, nor how it will help the establishment of the Local Community Centers. From my experience in working in the non-profit sector, and in particular the 2 mentioned entities, establishing relationships with the UNDP and world bank are slow and bureaucratic. They need to be build on individual relationships high up and based on trust. This takes time and usually the solution is not technical in nature. Lastly, it would have been helpful to understand how investment in this project help scale the impact of a relationship with the UN and WBG. Having said this, I can see how the intellectual property and related incentives structures can be a barrier to innovation, and how smart contracts and NFT play a role in unlocking marketplaces. However this is beyond my expertise, and thus to asses in this proposal. My recommendation to the proposer is to look for challenges in fund 7 related to expanding the NFT space beyond art, or the use of smart contracts in the Cardano ecosystem. Based on this assessment I disagree that this proposal address this challenge.", "q0r": 2, "q1": "From what can be read in the proposal, the proposer has invested considerable time and effort in this project showing believe and dedication, which is laudable. In addition a light timeline is given and short indication of where the funds are needed for (6months sprint) and how they would be spend (developer). Notwithstanding that these do not directly address the challenge, it would have been helpful if additional details about the proposer/team would have been provided (e.g. LinkedIn). In addition, as stated by the proposer, the success of this proposal's investment (6 months sprint) is heavily dependent on requesting additional funds (Fund7). This is a significant risk. It would have been helpful if it was further explained how that risk could be mitigated, for example with intermediate deliverables that could benefit the wider Cardano community. Lastly, as per the proposal, there are a number of other roles that need to be filled for the succes. Yet these are still vacant, increasing the risk of any allocated funds resulting in an unsuccessful completion. Lastly, in my experience as business developer (7y+) and entrepreneur (3y+) it is massively demotivating if people are not willing to dedicate time (volunteer or paid) to your cause. I have found that this is actually a helpful sign that the idea is not strong enough, or it requires further experimenting to sharpen the vision to make it more appealing. Throwing more money at it might not always be the solution. Even if this proposal was part of a more fitting challenge still many important questions and risks remain unanswered. However, based on assessing this proposal against the challenge expressed here, I disagree that this will be successful in implementing a successful solution for this challenge. ", "q1r": 2, "q2": "While I really like the idea of a market place for rapid prototyping, unfortunately it requires some assumptions and reading between the lines to see how a sprint to create smart contract functionality will help unlock a rapid prototyping marketplace. For example from experience in setting up a job marketplace as we speak, there are always 2 sides in a marketplace, and a smart contract functionality could boost the supply side after which the demand side might flow more naturally. However, there is much more needed (e.g. marketing, a seed community, etc.) to get this off the ground. In terms of being able to audit the time & effort spend, there is a high-level time horizon for the project, where the requested funds seem to be largely meant for a 6 week sprint. A further breakdown of the funds would have been helpful, for example to know how many hours/days are expected (and $/h?). In a starting organisation it is so much about the people and investing in them, therefore with such commitment by the proposer it would have been so nice to know a bit more about the entrepreneur. It remains hard for the community to gauge the capacity of the proposer or its team in absence of any further information. Lastly, no mentioning is made of metrics or success KPI's, or any references to the challenge KPI's. More difficult however is that that it is hard to audit how the proposals problem & solution related to the challenge statement. Therefore I disagree this proposal provides me with sufficient information to assess the progress in attaining its stated goals, particularly in light of my failure to see how it relates to the Challenge.", "q2r": 2, "assessor": "z_assessor_321", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The challenge is not easy to understand, especially when the proponents continue on the explanation of the proposal. It seems to exist multiple challenges and proposals, from hiring people to gender equality or climate action. The solution does not seem to be related to the problem statement. Additionally the proposal mentions smart contracts, but doesn't clarify well the connections with Blockchain or the Cardano community.", "q0r": 1, "q1": "As the proposers state, they still don't have the team on board to implement the idea:\r\n\"That is why we are asking for a business developer from Cardano in our proposal to join our team. We are also looking for Solution architect from Wolfram, UNESCO representative and a UNSDG representative.\"", "q1r": 1, "q2": "The proposers are working for 10 year in the project, but provided no clue that it is sustainable/successful or that it will be. \r\nEx.:\"What we can give in return:\r\nThe next industrial revolution.\" (Too audacious).\r\n\"Why do we need funding?\r\nA: We need to hire people to make it happen, apparently I'm the only one that have worked for free for 10 years.\"  (Does not express a successful business)", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "私たちは、ラピッドプロトタイピングのプラットフォームを構築し、メイカーたちにインセンティブを与え、業界に還元するための赤い糸を提供しています。", "experience": "プロジェクトは2012年に開始されました。  \n最初のイテレーションはDrupal 5から7で構築されましたが、2016年にMagento 2との相性の良さを発見し、スマートコントラクトは保留されています。"}