{"id": 369089, "author": "", "title": "Tokenised crypto events (ICWT)", "url": "https://cardano.ideascale.com/a/dtd/369089-48088", "category": 26114, "amount": 4500, "description": "私たちは、暗号に関連するイベントのほとんどは非常にコストがかかり、非常に過大評価されているという結論に達しました。", "f6_no_assessments": 3, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is a great NFT idea. The challenge however asks for proposals that will help with the establishment of global partnerships with the world bank and/or UNDP. The proposal relates to the challenge by providing exposure for these orgs through events. Provided the ICWT events model works in lowering ticket price, it could help grow the reach of these organisations. However, it would have been helpful to understand if the proposer would want to go beyond providing a booth and build a mutually reinforcing real partnership, for example by working on an SDG framework for event organisers. In addition, from experience working in the non-profit sector establishing successful relationships with UNDP and WBG are cumbersome and slow, requiring dedicated attention. Also with their strong EU origin, I'm missing some context how the proposer will bring in the focus on the mass adoption in the developing world. Given the absence of information on key points of the challenge I neither agree nor disagree that this proposal effectively addresses the challenge.\r\n\r\nOn a side note, this proposal would have been a much stronger fit for non-art NFT business models challenge, with the potential to scale novel applications fo NFT (event tickets) I would have rated it much higher in that challenge.", "q0r": 3, "q1": "While I like the idea and I hope they succeed, my technical expertise is not sufficient to evaluate if the suggested timeline and goals building and releasing a token + firing up the economics flywheel. However, based on my experience in software, the time scheduled on their website for building the app seems feasible. Looking at their website also provides some more gravity to the idea and the team, it would have been helpful to see that embedded in the proposal. Furthermore, from my experience running events and work in the startup space more budget than what is requested here to be successful. It would have been helpful to understand where this would come from and how the requested funds fits that bigger picture. Lastly, there is a lot of risk in setting up a new company let alone building momentum to run successful events. Unfortunately there is not much consideration for this here. Lastly, there is no mentioning of how the partnerships with UNDP etc. will be established or maintained. In light of this missing information I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposal frames a clear problem in the events space, and a possible solution for addressing the problem, although it remains a bit of guessing how greater choice in event setup and a dedicated token will lower costs. Having said that, neither the problem statement or solution directly address the challenge.\r\n\r\nOn their website the proposer sets out a clear time line with milestones for the wider company project, but there is no timeline for the focus of this proposal, nor is there a clear breakdown or audibility of the budget. In addition some metrics to evaluate the success of establishing a relationship with international organisations would have been helpful, e.g. speakers provided by partners, people a partner reached. In light of this missing information,  I neither agree nor disagree this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_321", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "It can be assumed that the proposal is effective only if all events in crypto were planned using the ICWT token, which is unrealistic. Although it could even be a good idea to \"control\" overvaluation of events, the proposers do not present a reason why the entire community would embrace the plan - as having costly events is always interesting to who profits from them. Moreover, the tokenization of votes for events could lead to the problem of oligarchies deciding according to their vote power (a problem that we already see in-house) and, therefore, be even less democratic or accessible.", "q0r": 2, "q1": "The proposers did not give robust evidence of experience in the theme, and the budget request is simply too low for such a big enterprise. It is not compatible with what they are planning to implement, which makes it questionable to think if they will succeed. ", "q1r": 3, "q2": "Although the proposal details how the ICWT token would work, it does not give a timeframe, KPIs or roadmap for the project. There is no detailed project plan to be implemented, but a description of the ICWT token.", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the challenge by creating events that can be operated anywhere in the world but uncertain if this will accelerate mass adoption for Cardano's blockchain solutions. Providing a token solution, staking pool offering will not allow people to familiarise in adapting Cardano expect for using what's build on the blockchain.", "q0r": 3, "q1": "More details about the experience the team has in organising events will help in assessing this proposal better. Naming crypto meet-ups, how such event was organised. The experience in contacting speakers, transparency in profit and payment model for helpers and speakers.\r\nMy main concern about the proposal is the reason for creating the ICWT token. Early investors are rewarded because of the deflationary solution suggested in the proposal. Burning tokens reduces the supply and increase the price momentum. I believe the token doesn't play a necessary role, instead. A smart contract that can mint NFT's (tickets) for the events makes more sense. Purchasing tickets for the events should use a predictable value like a pegged USDC token on the Cardano blockchain. Rethinking the token solution and the profit model is a necessity for this proposal. It should focus more on the attendees of the event instead of investors.\r\n", "q1r": 2, "q2": "Proposal explains various phases in helping with organising events but lacks are more detailed progress, the roadmap is very brief. Multiple smaller milestones in each core milestone will show more confidence in the expected deliveries in succeeding.", "q2r": 3, "assessor": "z_assessor_628", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "私たちは、人々がイベントのすべての機能に投票できるプラットフォームを作りたいと思っています。イベントの場所、日程、入場料など。", "experience": "私たちはEUのイベントオーガナイザーとプログラマーのグループで、すでにいくつかのcrypto meet-upを作っています。(COVID以前)"}