{"id": 369582, "author": "", "title": "Research dApp", "url": "https://cardano.ideascale.com/a/dtd/369582-48088", "category": 26114, "amount": 480, "description": "暗号は単なる投機手段と見なされており、研究目的や政策的影響評価のための可能性は示されていません。", "f6_no_assessments": 4, "f6_rating": 2.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Idea is nice but its not clear in the proposal which challenges the world bank faces. As I understood, this is still to be mapped but some initial examples could be given to make it more concrete and tangible. (-2 starts score: degree of impact unclear)\r\n\r\nIt could also have more details on how the engagement with world bank and the universities will be made. \r\nAlso, how the research is going to be developed, based on what? Should it have interview with stakeholders or just literature review? It could also have more details on it. moreover, it could be said here what is expected from these researchers, as a result of the contact and how it will affect final product.\r\n (-1 start score)\r\n\r\nLast, as a suggestion, I'd also add how the field application of the research dapp will be devleoped, with more details. it should be interative, collecting feedback from potential users/stakeholders.", "q0r": 2, "q1": "The proposer seems to have enough background and technical skills to develop the research and the white paper in the first phase but still needs to recruit developers to develop the dApp (-1 start score)\r\n\r\nThe schedule is fair bur could have more details (- 0,5 start score). \r\nTotal Budget is cheap, which is good, but its breakdown is not matching schedule. It estipulates only 8 weeks of work but the project is scheduled to finish on 1st quarter of 2023 (more than 1 year duration). It should be clearer if the intetion is to ask for more funding in next fund rounds, if the idea is become self funded and how, if there'll be funds from 3rd parties or even dont be funded anymore after week 8. Moreover, there are developers to be recruited. Are they going to work for free or get paid? (-1,5 start score)", "q1r": 2, "q2": "No metrics are proposed and only some miltestones can be taken from schedule.\r\n\r\nThere should be more details on how many researchers it is intended to contact to fully assess if this miletones was achieved.\r\n\r\nI'd also include metrics related to the final product (First field application of the research dapp). they should measure its quality, its usage, etc.\r\n\r\nrisks that should be considered: outcomes/conclusions from research aren't clear enough, not enough researchers engaged/difficulties reaching them, low quality on the field application of the research dapp, delay on timeline. All these risks should have a proper manegement plan before project starts.", "q2r": 2, "assessor": "z_assessor_298", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal doesn't really fit the challenge. The challenge is meant for ideas about how can we grow the Cardano foundation and lay relationships with the local population and governments. The proposal sort of fits this but the budget requested is only for research. Your plan and solution don't support each other. I understand what your goal is but it's not well defined and there are flaws in the proposal.", "q0r": 2, "q1": "The proposer gave references to his field of work and provided the necessary links to back up these references. He states that he needs team members to develop this dApp but does not say how many he needs and what skills are required for the development. This makes the proposal feels more like an idea in the early stage rather than a well-developed proposal. The plan stretches out over more than a year but the budget breakdown only talks about 8weeks. The proposer is still a student and in the budget breakdown, you can see he plans on spending 2hours a week which means he does not have a lot of spare time. This does not really support the hourly rate requested for this proposal. ", "q1r": 1, "q2": "For auditability, we only have a roadmap to work with. which in its current state leaves a lot open for interpretation. There are no real milestones defined in the proposal, meaning we don't really get a perception of what a success story means for this proposal. There are gaps in the plan and budget breakdown. Stating that you need to recruit developers but there is no funding for the recruitment. Overall this proposal lacks too much info the make a good audit. ", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has identified a valid problem that is faced by the global adoption of Cardano to the wider community. That said I would like to have seen further articulation of examples and use cases that pertain to research and economic development. At present the proposal is somewhat general in nature and does not convince the reader of the potential impact this proposal might have. ", "q0r": 3, "q1": "Based on the limited information provided in terms of specific experience it is difficult to assess this proposal any higher. The proposer strikes me as someone whom may have great potential to deliver value to the Cardano community and considering the  small scale of the proposal may well be worth the funds requested. ", "q1r": 2, "q2": "This proposal lacks the depth required to sufficiently audit the potential success or otherwise required to meet assessment criteria. A far greater amount of information is required to guide the reader about the planning and implementation of the research undertaken and how it will best be used. I would highly recommend the proposer seek out similar proposers and collaborate further on what appears to be a highly suitable idea. ", "q2r": 2, "assessor": "z_assessor_53", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is unique. Although it does not directly address the direct parameters of this Challenge, it does address the first stigma the general masses feel when they hear crypto, skepticism. And the people of World Bank and UNDP I believe are no different. Having \"one of their own\" publish a white paper on Cardano can potentially be the gateway to deeper inquiries. From that it may lead into opening discussions, which may lead to having a Cardano community hub in Oxford. I hope voters can see this logic and vote on this \"little\" gamble.", "q0r": 3, "q1": "This proposal has provided the credentials needed to conduct a preliminary assessment of this proposers capacity to achieve on their deliverables. Through deeper digging through his blog, it seems the proposer has also expose that he is a hard worker, earnest and will provide a fair review of the Cardano community.", "q1r": 5, "q2": "This proposal has given sufficient data and intertwined rationales that this proposer will be successful in their efforts. Recommend the proposer to start their research from the Catalyst School and branch from there.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "世界銀行などの開発経済学者や政策研究者のニーズに適応した研究用ダップを開発する。", "experience": "開発経済学のコミュニティにコンタクトを持つ、オックスフォード大学の経済学大学院生"}