{"id": 370046, "author": "", "title": "The Roadmap Revisited", "url": "https://cardano.ideascale.com/a/dtd/370046-48088", "category": 26114, "amount": 10000, "description": "CFは、国連や世界銀行とのグローバルなパートナーシップを確立し、30万ドルを投じて130の地域コミュニティセンターを設立し、Catalystと連携しなければなりません。", "f6_no_assessments": 4, "f6_rating": 1.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "There are the beginnings of a lot of interesting and exciting ideas in this proposal. Given the goal of developing partnerships with global organisations achieved through creating hubs around the world, this proposal seems to be suggesting a framework or method for teams to sign up and coordinate around the establishment of those hubs. The proposal references diversity and inclusion and multidisciplinary teams. However, it is not clear how an open call for teams to sign up will lead to the establishment of diverse teams. It is also not clear what these teams are meant to be doing, beyond the very general goal of beginning partnerships. The World Bank and UN are giant organisations and more practical details about exactly how partnerships would be built, with which department and areas, and how Cardano would be involved would be helpful. Perhaps the idea is to empower a variety of teams to come up with those specifics, but if so, that should be clarified, with additional detail provided regarding how the teams will be directed or motivated to accomplish the objective. I also envision issues with scalability, as there is no explanation of how coordination will occur among 130 different teams using the same google docs spreadsheet. I also find the inclusion of the CF roadmap material from a year ago confusing. I don't understand how those activities connect to this proposal.", "q0r": 3, "q1": "The proposers have not provided any information about their skills and experience. The Community Road map video is referenced under Relevant Experience. The video seems to have been chaired by Rick McCracken and his name is listed as the Section Lead for the Roadmap section. Does this mean Rick a proposer? The video and docs also don't seem to have been updated in the past year, while a lot has changed at the Foundation, particularly regarding the composition of the Council. Therefore, I find this documentation not particularly helpful in assessing the challenge. The proposal requests $10,000 which would be divided amongst the teams, but there is no breakdown of how those funds would be used by each team, or how they would be assessed for success. I don't see information about a timeline, beyond referencing 130 countries in 6 months, which does not seem feasible, particularly given a budget of $10,000. The proposers seem to acknowledge this gap. ", "q1r": 1, "q2": "There is no roadmap with milestones. There are no metrics or KPIs, nor is a description of the success of the project clearly articulated.  As no clear plan is provided regarding what the funds would be spent on, it is rather difficult to imaging auditing the progress and success. In conclusion, the idea of a team of teams is intriguing and could be powerful. More specifics regarding metrics, tasks, and objectives would be helpful.  ", "q2r": 1, "assessor": "z_assessor_278", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "Not entirely sure what is being proposed here. I understood this part: \"10+ Teams from various demographics...\" but the continuation was already incomprehensible \"...engage in resource tapping.\"\r\n\r\nDoes it mean that these various groups inside Project Catalyst would try to go about creating proposals to this challenge or what?", "q0r": 2, "q1": "The proposers say that it's an impossible challenge and so seems to be the solution. Impossible to understand.\r\n\r\nI actually went ahead and checked those spreadsheets and videos from one year ago, and that was fun, but it didn't help me understand what is being proposed.", "q1r": 1, "q2": "As it stands, this proposal is incomplete and cannot be implemented.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposal lack all the element of a good proposal, The metrics , timeline and what success would look like. The concept of a road map fit into this challenge, The team should streamline and refine this Proposal, for that i give 2", "q0r": 2, "q1": "I spent about an hour watching the Video session , I believe the ideas in the Video and the Proposal is too broad , it touches on so many aspect of the Cardano ecosystem , if the roadmap and the Proposal can focus only on \"Partnership for Global Adoption\"  that would make the Proposal successful , I also believe  the team have experience is community building, if the refined the roadmap to focus on this challenge , it would become successful , for that I am neutral", "q1r": 3, "q2": "The information provided is not sufficient to audit, The Document provided are not complete , for that I give 2", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does not addresss the challenge very well, because the only solution it has to building partnerships is asking people to join this group and then start networking. It does't propose a solution that is effective and scalable. Uses some buzz words but doesn't state a real proposed plan.", "q0r": 1, "q1": "They do not provide any relevant experience besides referencing a road map video from over one year ago. They do not state any plan other than asking people to join this proposal to network with others. No stated intent for the budget or a timeline to reference.", "q1r": 1, "q2": "There is no information provided in this proposal for us to audit the progress or success of the proposal. They don't state how the budget will be used, no info on their proposed timeline, and no accountability checks for the team. We have no way to audit this proposal.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "組織を超えて完璧に仕事をする多分野のチームが集中するエクストリーム・ダイバーシティ＆インクルージョン。", "experience": "1年前のCommunity Roadmap Videosとdocsをご覧ください。"}