{"id": 414985, "author": "xeeban", "title": "dRep Education Book Club", "url": "https://cardano.ideascale.com/a/dtd/414985-48088", "category": 26601, "amount": 3750, "description": "IOG has recommended some books for dReps to read. It’s hard to get motivated to read books, and often harder to fully comprehend on one’s own. We benefit from a facilitated way to learn the material.", "f6_no_assessments": 10, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1627, "q0": "The proposal is extremely interesting and meets the requirements of the challenge well, as it aims to better prepare the Cardano community for delegation and proper selection of dReps, through education. I confess that when reading the first parts of the proposal, my impression was that the idea was not so directly related to what the challenge seeks, but due to the explanations of the proposer, this relationship became very clear. In this challenge, we are working towards the best establishment of who will have the right to vote for Catalyst projects, the dReps, and it is necessary that this group is extensive, diverse and highly participatory in the Cardano community. It is therefore necessary that we have a solid knowledge of governance, and this can be sought through some books already published, which, according to the proponent, have valuable knowledge about the process of self-governance. So the proposal suggests establishing face-to-face meetings every month, where some people would read and discuss these publications, which talk about different governance topics. The proponent states that it has already established some studies in relation to very important topics such as “Impact Networks, Systems Thinking, Design Thinking and Reinventing Organizations”. As it is understood, this type of knowledge would also be studied in these meetings. The proponent claims that civic duty is awakened through an awareness of a sense of community, study and education, and book selection would increase collective knowledge, people's ability to select others who are appropriate and capable of exercising voting function. What the proposal says about face-to-face meetings is quite positive, because in my view this type of debate is much more established in person. However, the meetings will also be recorded and posted on youtube, so that more and more people can be included in the project. I believe that the only point that I would like to suggest improvement, in the impact of the proposal, is in the way in which the books will be chosen. We know that “books will be crowdsourced from the community for ideas and recommendations, and one book per month will be selected by the book club team”. What would this crowdsourcing process look like, what is it specifically? It would be positive for the proponent to provide a better description of how this process would be carried out, as I believe that the core of the proposal is based very much on what content will be studied. I also think that it would be necessary for us to work towards a great commitment of the group involved with the book club, because we know that nowadays most people have busy work routines, so that reading is always in the background; but it is essential here that the agreements are respected, the readings are carried out periodically and as previously established, and we need strategies to mitigate any obstacles. In general, the proposal is very much in line with the challenge, as it aims to prepare the Cardano community to properly select and promote dReps, so in my view it deserves top marks in terms of impact. It is also very positive how the proponent outlines several possible obstacles and how to mitigate them.", "q0r": 5, "q1": "Regarding the script, in my view the information is not passed on properly. I say this because all we know is that the selection of books would begin in September, and we also have certain dates for when the meetings would take place. However, all the processes that would be behind it are implicit. For example, how would the book of the month be selected? As I mentioned in Impact, it would be necessary for the proponent to better explain what this crowdsourcing process would be, how the Cardano community would be activated and encouraged to participate in this choice. Then where would the meetings be held? How would this location be selected? It is not clear in which country the project would be developed and how individuals would also be attracted to this moment. We have no understanding of the breadth of these meetings, that is, how many people would participate in each and how many hours they would last; we don't know how it would be done to record the content and make it available on youtube; it is not said how the online content would be disseminated to the Cardano community. Finally, details regarding the process; although the proposal is not so complex in terms of organization, it would be very positive if we had such explanations available. Speaking of costs, we know how the $3750 amount would be broken down (in parts such as “Management and coordination of the book club / Marketing and dissemination of books and book club sessions / Miro Council and planning for the book / Facilitating book club sessions”). We know how many hours of work would be delegated to each of these parts and the price of each hour ($50). In general, it is very clear how the money would be used, my only suggestions would be in relation to “other costs”; it would be positive if the proponent had specified what these technology costs would be, what materials would be purchased and especially what the miscellaneous budget would be (perhaps a reserve money, for unplanned situations?). Finally, when it comes to preparing the proponent to successfully carry out this project, complete confidence in Nori is conveyed, because we know a lot of information about him (for example, that he is a very active member of the Cardano community, being “current member of the team of Catalyst Circle, member of the Cardano4Climate core team, ambassador Cardano, PA and funded bidder.” We can also see that he already has experience with similar projects (book club), and that because of his extensive presence in the Cardano ecosystem we are sure that you are capable of taking this project forward safely and seriously. Therefore, the only part of this topic that I think deserves more attention and improvements would be the script explanation, a more detailed schedule would definitely add a lot of value for the feasibility of the proposal.", "q1r": 4, "q2": "Regarding tracking progress, this can be done through metrics provided, such as “how many books read / how many sessions were held / how many people engage in social media channels / how many people show up for book club sessions”. However, this information is only enough for us to have an understanding of the partial results, and not the processes that would be behind it. As I mentioned about the script, several works and activities are part of this project (how to select the book of the month; how to publicize the face-to-face meetings; how to make the Cardano community absorb the debated knowledge, through the videos posted on youtube ; how the debates will be conducted; how the location of the face-to-face meetings will be defined; etc). All these tasks should also be monitored, in my view. In order for this to be done properly, the proponent could prepare a monthly report; could be written, but as he will establish a channel of communication with the community via Youtube, perhaps such summaries could be posted in video form at the end of each month as well. That is, in addition to recording the meeting, the proponent could give a brief summary of the work routine that month, if everything went as planned, if any problems had to be worked around, etc. Speaking now of end results, success is defined as “when community members read, engage and participate in book club conversations and documents and provide access to the discussions for the community” and also when the level of education on governance is higher and better established. My suggestion is that the proponent do an analysis that can result in verifiable data on how this book club positively impacted the Cardano community, that is, how did people have knowledge changed from the project? How have the books contributed to a better understanding of the importance of collective governance, how have these contents changed the view on dReps? I think that an interesting way to understand this scenario would be to do a qualitative research, that is, in addition to knowing how many books were read and how many people participated in the meetings, we hear directly from them what was the impact of the project on their perceptions about the topic and about the dReps project. Overall, I think the proponent has an auditability principle well underway, but it is necessary that 1) more detailed tracking of the roadmap is done to measure progress 2) that book club impacts are understood further from a survey of those involved.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 14, "ne": 11, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1047, "q0": "The role of dReps will be vital to the future of Cardano. Staying up-to-date not just with the events within the community, but also with the theoretical governance side will pave the way to a successful outcome for the entire blockchain and perhaps, even the entire crypto space. Starting off with a group of well-documented individuals will hopefully set the tone for those who’ll follow to strive for greatness. As such, having a book club geared specifically towards improving the knowledge of future dReps and the overall Cardano Community members is an important step towards a high rate of participation and consequently towards raising the collective knowledge of the community.\nAfter reading the proposal, I have actually downloaded the PDF for the first reading session “A Treasury System for Cryptocurrencies: Enabling Better Collaborative Intelligence” and after browsing through it a bit, I am convinced that the idea behind the book club could turn out to be quite successful. I already have some questions - and I don’t mean regarding the mathematical formulas - but regarding the philosophical side of it, and I believe others will do too and will be looking forward to the stated date of each of the months to gather and talk and find answers together. Thus, I will rate the impact section of the proposal with a 5/5.", "q0r": 5, "q1": "Since this is a proposal for a recurring monthly workshop, the detailed plan is very straightforward: The project will last for four months starting in September and ending in December. At the beginning of the month, the community will focus on the selected book and towards the end of the month, they will gather together in an open meeting, facilitated by a host. The host will be guiding the conversation and use Miro boards to synthesise the information from the meetings. As such, I find there is no other information that would have been vital for the project description.\nThe budget is also very comprehensive, it describes all the steps needed for the book club meeting to be prepared, held and marketed to raise awareness and involvement. \nThe proposer has provided ample information about himself. He has provided us not only with a clear description of his skill and involvement in the community, a LinkedIn profile link, and a Twitter handle but most important, he has attached a series of videos of previous Book Club meetings, where we can see exactly how well the meetings were handled.", "q1r": 5, "q2": "For the project’s progress, I find the metrics to be spot on. The plan of the proposal is to read 4 books in total, so the number of books is obviously the first metric to follow. Then, for each book, one session will be held, as such, that is the other metric. The metrics for attendance and social media engagements will also be tracked, but there is obviously no timeframe given, as that will organically develop in time.\nAnd the question on how the success would look like is also clearly written, with reasonable expectations but, at the same time, offering a glimpse of a potentially positive change in the direction of community involvement.\nAs such, I find the information provided sufficient in regards to auditing the proposal and assessing its successful outcome.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 17, "ne": 1, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 1117, "q0": "This proposal aims to engage with and educate the Cardano community through virtual book club meetings dedicated to dRep books/papers initially recommended by IOG. The monthly meetings will also be recorded and posted on a YouTube channel to make them available in perpetuity for dReps, or those wishing to become dReps, who were unable to attend the live meeting generating further impact.\n\nThis is a simple but important project in that it encourages the education of topics pertinent to current and future dReps and creates a format for participation that is inclusive and fosters the sharing of ideas and understanding, thus addressing the objectives of this particular Challenge.\n\nThe proposer has already set up “The Leadership Academy Book Club” and held monthly book club meetings in accordance to his previous proposal that was funded in Fund 6. This is a continuation of that project but with a focus on governance related books and targeting members of the developing dRep community.\n\nEducation of dReps needs to be supported in order for this aspect of governance to be successful. Book clubs are a tried and true way of guaranteeing readership of materials. A virtual book club format for dReps is a great medium to do that as well as create a sense of comradery amongst dReps who will often be supporting dissimilar proposals.", "q0r": 5, "q1": "As this is the continuation of a previously funded project, the presenter has laid out a clear step by step timeline for this proposal and the budget is well delineated with a break down of the time required for each task.\n\nFour books/topics have already been chosen as topics for the next 4 months' virtual book club meetings and the dates have been set. \n\nThis is a one man show. The presenter, Nori Nishigaya, has the experience and is more than qualified to run these book club meetings with over 30 years in software development, and being a member of Catalyst Circle Admin Team, Cardano4Climate, Cardano Ambassador and a PA, amongst other things. He is passionate about making Cardano the best crypto community in the world.", "q1r": 5, "q2": "The timeline for the project has been presented in an explicit manner. The KPIs can be audited by measuring the amount of books/papers read, the amount of virtual book clubs held, the quantity of people attending the virtual book club meetings and the amount of views on Youtube of the uploaded meetings.\n\nThe ultimate success of the proposal is in facilitating a dRep's acquisition of the deep understanding of the foundational knowledge required for unbiased governance. Votes cast for proposals by a dRep's critical thinking based in the core values of the Cardano project will eventually become self evident. Although it might not be auditable in the beginning, eventually educated and competent dReps will receive larger and larger voter delegations.", "q2r": 5, "assessor": "z_assessor_2207", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 2707, "q0": "A small-scale, modest idea, punching well above its weight in terms of potential impact. It focuses on one specific element of the way dReps are being implemented (the fact that they have been given a reading list); spots the potential problem in that anyone who doesn't feel comfortable reading and analysing on their own could feel excluded; and solves it in a neat, low-budget and community minded way, using the tried-and-tested concept of a book club. While I like the fact that this book club is open to the whole community as well as the 150 dReps, this could make the meetings quite large and unwieldy, and make it offputting for people who are not confident in large groups, so I would perhaps like to know more about how the facilitator might approach this if it happens. But I like that sessions are recorded, and will have a Miro people can view afterwards (in fact, this will perhaps enable participation by anyone who is uncomfortable if meetings get too big). The explanation of how the proposal fits the challenge is very through and well-supported, addressing increased diversity and increased delegation via education. Obviously there are ways the proposal could be expanded to increase its impact, or how it could be... not replicated exactly, but versioned in a range of communities so as to reach dReps in different time zones, etc - but as a first step, this proposal is more then enough as it stands. Risks are well mitigated too; although I would like to have seen some mention of what is perhaps the most obvious risk with book clubs - the risk that people turn up not having bothered to read the book, so the discussion can't really focus on the book itself. But this is something the facilitator can come prepared for, and I feel sure that a faclitator of Mr Nishigaya's calibre would do so - i.e it's not a big enough issue for me to mark the proposal down at all. ", "q0r": 5, "q1": "The budget is fair; and it's good to see that the facilitator will be taking a decent amount of time both to prepare, and to process the material after. The timeline is clear and appropriate - it is easy to think of potential expansions and extensions and extras that could be done, but actually I think the simplicity and clarity of the plan is a positive; as is its \"standalone\" quality, not dependent on too many outside factors. The facilitator is not only knowledgeable on the topic, but also experienced as a facilitator, which is an important plus-point. I can't see anything that would negatively impact the feasibility of this proposal.", "q1r": 5, "q2": "The metrics suggested makes sense, are readily measurable, and are appropriate to the small scope of the proposal; and the overall \"what is success\" vision is clear. However, I would have liked to see the inclusion of some kind of qualitative assessment - perhaps a feedback form or an in-meeting poll - to see what people actually think of the meetings - have they enjoyed it, has their knowledge grown, do they feel any more confident in ther role as dReps?; and also, I think some measuring of how many attendees are coming back week on week as opposed to coming for the first time could be both interesting, and potentially useful for future planning.", "q2r": 4, "assessor": "z_assessor_2343", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5577, "q0": "Coming from an academic background myself, I like the idea of forming a book club to disseminate knowledge to the wider community.  It's even more encouraging to know that this proposal has been funded before. \n\nGiven my own desire to become a dRep, I believe this book club addresses the challenge of improvement and onboarding for dReps. Furthermore, I completely agree with the thought put into this club, as incentivizing participation is going to be essential. \n\n", "q0r": 4, "q1": "The group seems to have previous funding and previous experience holding these book readings and discussions. I like the emphasis on visual, collaborative Miro boards as well, since those are helpful. It also seems the team is prepare to document and lead conversations about these readings. \n\nThough there is a plan, it's not made clear who will lead the discussions. It is assumed \"someone\" capable will be able to do so, which is less ideal, but not really a negative either as there are many people that can fit that role. \n\nThe planning is specific and well-paced in my opinion as well, especially if the goal is to read 4 books. I like that there are also discussions in between the major readings.", "q1r": 4, "q2": "The auditing of this proposal is easy to gauge. As the team has implied, they must simply deliver these discussions and recorded materials. What is less measurable is the success of the proposal in engaging the community. \n\nThe team brings up a great point in saying that people will not read without incentive. However, the proposal does not make it clear if any of the funds will go to participating readers in the audience, as is usual for professional development situations like this one. Perhaps it falls somewhere into \"Book Club Management\" as it cannot come from \"Book Club Fascilitating\". In any case, if there was no thought for that type of budget, perhaps the request should be higher. This will ensure the success of the reading/discussion group in my opinion. \n", "q2r": 4, "assessor": "z_assessor_2716", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 5820, "q0": "This challenge is about how to improve the quality and number of dReps in the Cardano ecosystem. This is critical because the role of dReps is a key one in the Catalyst system. dReps are meant to vote on proposals within Project Catalyst and decide which proposals should be funded and in turn will enhance the quality of decision making within each Fund. It is therefore imperative to have proposals that will improve the quality and numbers of the dReps. \nThis proposal effectively addresses that. Spending quality time reading relevant books and consuming the knowledge in them will help achieve this. It will help prepare dReps to better themselves for their role in the Catalyst system and also help onboard more dReps with exceptional quality. ", "q0r": 5, "q1": "The plan outlined is great. The proposal indicates that one month each will be dedicated to each book or paper. After reading there will be in-person meetings to discuss and and get a facilitator who have good knowledge of the topics discussed in the books to lead a teaching session. This is amazing. The proposer indicate the details of the one who will work on the project the experience and skills to be employed to make this project a success. This proposer has worked on a project from a previous fund and I think the capability to deliver is there. There is a link to YouTube channel with examples of the Academy Book Club session and it gives evidence that this proposal will be delivered successfully. I like that the proposer indicates that videos from the sessions will be uploaded on YouTube to reach many others who may not make it for in-person sessions. \nThe fund requested for this project is reasonable and there is a detailed budget for all resources and personnel needed for implementing the idea. The proposer indicates the team is already working on a similar proposal on leadership and will return if funded, to receive funding for the continuation of the project. \nThe milestones are also listed with timelines. I think this project can be executed successfully. \n", "q1r": 5, "q2": "What success looks like for this project is clearly outlined by the proposers. The KPIs are indicated for easy tracking of progress. These are stated in simple terms so they can easily be measured. The budget is also clear and will enhance accountability. \nThis proposal is great.", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 9567, "q0": "“I have read several books on dReps submitted by IOG, but it is difficult to understand. I think I need to discuss the content of the book with others. Arguing about something in the book will help me understand better. Therefore, the group's proposal to organize a reading club for dReps is very positive. Thereby solving the challenge well.”\n\n“Educating dReps about the books recommended by IOG will make people aware of the importance of decentralized governance through delegation.”\n\n“The risks have been outlined and the risk management is appropriate. I am particularly interested in governance risk not being a hot topic. This is the most important factor determining the success of the project. The team came up with a very good risk reduction solution. By bringing the importance of governance to the public discussion, it makes it an interesting topic.”", "q0r": 5, "q1": "“The book club plan is held for 4 months. Read one book a month. The team also provided a detailed budget breakdown. The cost for each job is specified with appropriate spending levels.”\n“Complete and detailed project participant information. Has a lot of experience in the field of technology, community management, and administration. Particularly passionate about discovering best practices for governance and organization for decentralized and self-governing communities.”", "q1r": 5, "q2": "“Measures of the number of books and the number of sessions have been provided. However, indicators of the number of people participating in book club sessions are still open. Perhaps because the project has not been activated yet, the group has not yet published the data. Hopefully, when the proposal is approved, the project will go into operation this index will be added.”\n“The project success metrics given by the team are consistent with the challenge. The successful project will enable more knowledgeable dReps to participate by understanding the importance of decentralized governance. As a result, the number of votes authorized for dReps is higher.”", "q2r": 4, "assessor": "z_assessor_3065", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10134, "q0": "The Proposal Team is working on the idea that the Leadership Academy Book Club will hold monthly book club meetings to discuss books recommended by IOG for dReps and share on youtube regularly to those who are not in the workshop can easily reach. To address the issue of educating advocates and inspiring people to be more involved as a role. is dRep for successful catalyst management The team's solution is practical and effective. But there's one thing I haven't figured out yet. If you are planning to hold meetings to discuss the specific area or location of the dRep educational series, I suggest that the proposed team can provide exactly this.\n\n  With alternatives, the proposed team is providing. I comment that this is moving in the right direction with what the ''F9 improves and introduces DREO'' challenge is all about. At the same time, the research team is considering 3 main risks that the proposal will face. Those are the big holidays, the events that bring book clubs to a halt, the raging pandemics that hinder meetings, and the content issues that don't engage the community. These risks are carefully considered by the proposed team and treatment options for each are presented. Which I think the team is doing very well to overcome the risks of the proposal. This transition is very good, wish the group to operate soon and develop the future of the community.", "q0r": 4, "q1": "The proposed group is providing a roadmap to start activating the partnership in September and September 24 will have the first discussion session and the final meeting time on December 17. This helps the group's roadmap. The proposal has specific timelines attached, but if you wish you could add more goals that the meetings will discuss in order to achieve the group's goals. The team is calling for $3750, and the team is providing clear spending items that match the amount you're asking for. To create discussion meetings, this issue is clearly raised by the proposed team to demonstrate that the team's budget is reasonable.\n\n  With information about the people involved in implementing this idea only you, and Nori Nishigaya's experience statements are fully covered as well as Linkedin, and Twitter for easy access to advisors.  The information you provide is sufficient, but I think you should consider an assistant to help the author reduce the amount of work, and this assistant will also help Nori effectively. Nishigaya in face-to-face meetings. I think you should give it some more thought on this matter, and good luck to you.", "q1r": 4, "q2": "The proposal if successful will create a good education for the community. And create more diversity in dRep because more educated people want to participate, and more people sign up to become dRep because of the motivation to get involved. importance of roles, higher authorization from the community as knowledge of the importance of governance is enhanced and background knowledge is better to inform the community about delegation. is a good impact on the ecosystem, helps to improve management education for the catalytic community, helps people to have useful reference books like videos to share knowledge.\n\n  The proposed measures include 4 main indicators to measure, but the author does not mention at all to publish these indicators to the media. That is reducing the effect. the transparency of the proposal, and whether the author has provided that the proposal is related to ''The 6 Foundation-funded Leadership Academy Book Club'' but is this information accurate? then you need to attach the project affiliate link for easy verification. And you also need a full complement of the Sustainable Development Goals (SDGs), which the proposal is fully aiming for. With your missing information is the reason I rate 3 stars on the transparency of the proposal.", "q2r": 3, "assessor": "z_assessor_3160", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12663, "q0": "- Problem to be solved: IOG has recommended several books for dReps to read. but if you read it alone, it is difficult to be motivated to read and difficult to fully understand the content Proposers make it possible to study the material and benefit from it.\n- Solution to the problem: hold regular book club meetings to read, discuss, and generally raise public awareness and knowledge of the books and articles that IOG introduced as educational preparation for dRep. Every month, the Leadership Academy hosts a book club in-person meeting for dReps and the entire community. The book club will be facilitated by a host who has read and is knowledgeable about the material, who will set up and use a shared Miro board to guide the conversation and take notes about the book. These sessions will also be recorded and uploaded to a YouTube channel where anyone can watch and listen to the session if they are unable to attend in person.\n- Ask for a fund of 3750$\n- engage the reading and discussion community on important topics such as systems and design thinking, and we will continue the same format with dRep governance topics.\n- enhance the general knowledge of the community who are seed advocates for governance and inspire people to become more involved as dRep for successful Catalyst governance.\n- Risk :\n+Time conflicts with major holidays or Celebration events leave good book clubs empty\n+ COVID or other circumstances prevent moderators from holding book club meetings.\n+Governance is not a hot topic and no one will want to read a book about it and then discuss it.", "q0r": 5, "q1": "- regular proponent of book club meetings for the Leadership Academy, a current member of the Catalyst Circle Governing Team, a core member of Cardano4Climate, Cardano Ambassador, PA, and proponent Yes sponsor. has over 30 years of experience in software development, agile methodologies, leadership in managing teams, and founding and running tech startups.\n- There is an example link to the previous meeting of the Leadership Academy Book Club\n- Do not provide information about the required number of members.\n- Have a clear and detailed implementation plan, and actual implementation timetable in 4 months.\n- The budget is divided specifically into each reasonable item, including the budget for everyone 3000, other expenses: Technology cost, Material budget, Contingency budget 750.", "q1r": 4, "q2": "Have a clear roadmap within 4 months, with clear, specific timelines. The indicators selected to measure the success of a suitable project include:+ How many books and articles have been read (0-4)\n+ How many sessions have been held (0-4)\n+ How many people participate in social media channels (0-?)\n+ How many people attend book club sessions (0-?)\n- easy-to-understand description of the goal to be achieved: more diversity in dRep, higher authorization from the community, and better background knowledge.\n-This proposal is a project related to Leadership Academy Book Club funded by Foundation 6. However, it will focus on books related to governance and target dReps and community members who want to increase their knowledge of governance in a supportive and responsible manner.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 13590, "q0": "Books are my greatest teachers. I love reading books every day. It brings me knowledge and joy.\nThe Book Club for dRep is an interesting idea for those interested in self-development and knowledge.\nThis proposal is a tool to help dReps to exchange and learn to develop knowledge and skills in a better way. In particular, in addition to understanding the knowledge, when exchanged with other dRep, it will help the knowledge become sharper and more streamlined, which improves the ability to remember.\nUltimately, this proposal will help dRep equip with a lot of good knowledge and skills to find good and useful proposals for the development of Cardano. At the same time, avoid the waste in funding bad proposals.\nThis proposal can be a place for dReps to learn and exchange experiences to improve working efficiency for the Funds in the future. These are things that the author may not have thought about and have not included in the proposal.\nI hope this comment will be useful to the author.", "q0r": 5, "q1": "When reading about the author's portfolio on Linkedi, I noticed that he is a person with a lot of experience in organizing book clubs and a member who has contributed a lot to Cardano.\nGiven the tasks that need to be done to complete the proposal, I find his capacity sufficient to complete this proposal very easily.\nThe presentation plan is very complete and the ability to predict the risks is very specific and reasonable. That further proves that he is a very experienced and capable person.\nI just wanted to add more content from the reading session in the author's presentation plan. I think the author should focus on books that are more useful for dReps in assessing and assessing the competence of proposal writing teams. Those books will be much more useful. For example Testing Business Ideas\nIt may be an additional idea for the author to make these reading sessions more useful to the dReps in their work.", "q1r": 4, "q2": "The description information about the implementation process, implementation content, description of how to deploy is very complete.\nI just want to add comments in 2 parts: detailed budget and evaluation index\n1. Detailed budget: It is advisable to add more advertising costs to attract more dRep to participate in reading. This will make the reading session organized by the author more valuable and the dReps more opportunities to learn from other individuals.\n2. Evaluation index: It is necessary to add another indicator that the number of participating dReps will be more appropriate. It would be more in line with the Challenge's requirements. Maybe when writing this proposal, the author did not think much about this, this is a suggestion I add.\nThe rest of the information is perfect. I believe that for someone with as much experience as the author, this suggestion will be of great value to new dReps.", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Let's hold regular book club meetings to read, discuss, and generally improve our awareness and knowledge of the books and articles that IOG has recommended as educational preparation for dReps.", "experience": "I have held regular book club meetings for the Leadership Academy on topics such as Impact Networks, Systems Thinking, Design Thinking, and most recently Reinventing Organizations. This series will continue with a focus on dRep books and topics as recommended by IOG."}