{"id": 414969, "author": "nguyenthiha07tp1", "title": "dRep tool for non-English speakers", "url": "https://cardano.ideascale.com/a/dtd/414969-48088", "category": 26601, "amount": 26500, "description": "The busy dReps in non-English communities don't have enough time and language skills to select and vote on the right proposals. This affects the efficiency of voting delegation. ", "f6_no_assessments": 11, "f6_rating": 4.545454545454545, "videos": [], "media": [], "f6_assessments": [{"id": 1625, "q0": "The proposal theoretically aligns with the objectives of the challenge, which are basically aimed at improving the work experience and benefiting dRep's. By translating a summary of the proposals into Japanese and English, those dRep's who have these languages ​​as their mother tongue will certainly have their work much easier. However, I think some important remarks should be made regarding the impact of this proposal. First, regarding the choice of languages. The proponent argues that Japan and Vietnam are countries with a high degree of acceptance of cryptography and especially Cardano, but we do not necessarily know how many dRep's will be elected nor how many will come from these countries, besides the doubt as to whether they would be fluent in English or not. With that, we don't know if we would have many users for this tool. Another point would be the question of not translating the entire proposal, but a summary. The proponent says that the dRep's will be important and very busy people in the community, which will be a fact, for sure, but their main task will still be to analyze and vote on the proposals; so I think the most appropriate thing would be for the proposals to be fully translated, so that the dRep's can do the most careful and in-depth reading possible, so that they judge the validity of the proposal in the safest way possible. I believe that through summaries, the proposal would already be partially changed according to the translator's opinion, and not that this is a bad thing, not that his opinion is less relevant, but in any case it will not be identical to dRep's, most likely. So, in my view, this would influence the final judgment of the activity, which I don't think is a positive factor. That said, I think it would be interesting if we had a translation tool for non-native English dRep's, but I think it would be necessary to do some research regarding which languages ​​were most spoken after the dRep's were elected; then, we focused on working on those that were most common among the group; and ideally, the entire proposal, in my opinion, should be translated, so that no kind of bias is involved in this process. So I think the idea is valid, but some characteristics here should be rethought, with the aim of making the best possible use of the funds.", "q0r": 4, "q1": "The proposal roadmap is very practical and specific. We know well what would happen on each day, and as the project will be parallel to background 10 and will have a pre-defined duration, we can understand temporality very well. As it is a simpler project than the other proposals, it is not necessary to detail the activities or establish phases to be fulfilled. In my opinion, the information given is enough for us to have a good level of understanding about the development process of this project, and it is super positive to know what would happen exactly on each day. With that, the script part is totally satisfactory and adequate. Moving on to expenses, it is also very positive that they explain with such specificity how the money will be used. We know, for example, how much you will be charged for each translated word, for both Japanese and Vietnamese. The problem here, in my view, is that we have no way of predicting how many proposals will be launched in fund 10, nor how many words each will have. They estimate 1000 proposals with 300 words each, but that number can vary greatly, either more or less. The bidder states that if the number of bids launched in the fund exceeds 1000, anything that exceeds this amount will not be translated, but what if it is lower? An amount of funding is set aside for verification and adjustment of expenses, but we do not know exactly how these adjustments would be made; the provision expense part is also a little confusing, what would that be, exactly? In my view, the money requested is very well explained, but there is this doubt regarding how the adaptation of expenses would be made, in relation to the variation of content to be translated, which is not so simple to define. However, the level of detail in this part of the proposal is very good. Finally, analyzing the team involved in the project, a great detail is passed on each team member. We know that they are people with previous experience in the Cardano ecosystem, we also know their names, their professional areas, different projects in which they have previously been involved, who already have some experience with translation (with certificates attached); finally, a lot of specific information about each one is provided. And with that knowledge, a lot of confidence is passed in their preparations to successfully carry out the proposal. Having said that, I think the feasibility of this proposal is very good, it has indeed several positive points, but also some important issues to be worked on and improved, to raise the level of the topic even more.", "q1r": 5, "q2": "Unfortunately, the proponent does not explain how the process of translation/creation of the tool could be monitored, as the suggested follow-up for the partial results relates to the feedback received. I agree that it is important to have a goal here on the number of downloads made, in addition to user satisfaction, which can be perceived through the comments. In fact, this is the most direct and logical way for us to know if the tool was being used as intended, but it does not allow us to understand if its development/production process was done as planned. Could it be that the activities, which are already determined to take place in a certain number of days, were actually carried out? Would each professional involved be respecting the work routine the way it should be? How can we follow up if they had problems, and consequently if they were remedied in the best possible way? I believe that what is lacking here is a certain concern to follow the tasks behind the partial results, not only what was produced and its acceptance, but also how it was produced. With that, I suggest that the proponent develop some way to bring such information to our community members, in a simple and summarized way - it can even be some report written on our communication channels, such as discord and telegram, for example. As an analysis of the partial results, the success scenario would indeed be “increase the participation rate of the Japanese and Vietnamese communities in dRep in the next Fund”; that's our main focus here. But how would this data be verified? How can we be sure that, in addition to an increase in participation, this audience had a good experience, better than it would be if they translated the proposals themselves (or read them in English, if they were fluent)? I think that this analysis of the final scenario lacks a little depth, it says what would need to be audited, but not how this fact would be understood and proved. So, in my view, as in the previous topics, there are hits and misses here, some improvements would be needed to make the auditability more secure. However, what makes the proposal more auditable is the very precise script. More in-depth analyzes would need to be carried out on both sides, both in the auditability of the process and in the analysis of the final results.\n", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 882, "q0": "This proposal aims to enable and empower non english speaking dreps by providing proposal information in their native language. They make the important observation that a diverse set of dreps will require a diverse set of tools. If we're to complete the challenge brief goal of having a diverse set of dreps, we need to set up those dreps for success, or they will ultimately drop out of the system. ", "q0r": 5, "q1": "The team provides a clear roadmap and budget breakdown, indicating that they have carefully considered what they will deliver and how. As someone with project management experience, their objectives seem reasonable, especially given claims about their background and expertise. I would've liked to see more links that could validate their claims of expertise, such as linkedin or github links. ", "q1r": 4, "q2": "The proposal outlines clear KPIs and targets for them. I appreciate that the team outlines both qualitative and quantitative measurements, while keeping clear targets in mind. ", "q2r": 5, "assessor": "z_assessor_2146", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 2788, "q0": "\"The proposed team proposes a solution to satisfy the requirements of the proposal, which is to provide a tool to search for potential projects to serve the dRep community,\n\n    with the number of English proficiency in the two countries that the team set as a target is very small, so the idea of ​​bringing the compiler from English to their native language is great, in addition to the screening toolkit , summarizing each proposal of the committed proposal will have a huge impact on the quality of the election, and the number of proposals omitted without dRep's time to research and vote, will be reduced. I really like the features of the toolkit that the proposal provides especially: Summary of the proposal (100-300 words) this gives the dRep community an overview and selection of quality proposals have the potential in the future that to vote,\n  In addition to the English-speaking community, the group has identified the target audience of the two countries, published data and researched the markets of those two countries, very detailed and meticulous, for each speaker statistics. English and statistics on the number of people accepting and owning cryptocurrencies.\n  however I have a bit of a question with the presentation of the proposal, whether the toolkit, and translations of the proposal will be made available on which platforms are popular and easy to use, and also the approach the proposed dRep community how to promote them the proposed team's tool, since the content of the translations and the toolkit provided has a shelf life only until the election is over, the team needs to focus on the expansion to bring into full play its functions, otherwise when it passes the election, it will only be a reference document, not a condition for the election,\n there are a few risks that have been raised and most of them are minimized,\"", "q0r": 4, "q1": "\"I agree that certain timeframes will not be exact as there is currently no specific schedule for the 10th funding round, so estimates and subject to change are tentative,\n  with the total asking amount for this proposal is 26,500$ I agree because translating PA's reviews will be very difficult by nature, it is estimated that from previous rounds the PA's evaluations can be up to more than 10k and each copy is about 1.5k to 2k words on average, so the translation into Vietnamese and Japanese languages ​​will require a lot of people because the stipulated time is very short, so it requires a group of people. there must be a good combination, and hard work can complete 100% of the work, so the amount of this request is reasonable, but I still have a question that the proposal team will translate by machine (Google translate) or human translation, is it guaranteed to fully interpret the meaning of the sentences in the evaluations?.\n    The team information provided is very complete and with the cooperation of many members from the target countries, I think this proposal will be feasible. \"", "q1r": 5, "q2": "\"During the compilation of the PA's recommendations and assessments, the team should have statements for the middle of this period about what percentage of the work has been done by the team and that it should be publicly available on the boards. the most popular social platforms of the target countries, for example telegram and many others like Facebook, so to make sure that you are still working hard and whether you can complete the workload to hand over the results to dRep, and if you need help aggregating links to the proposal, you can ask the community members who have the time to help.\n  In addition, all the success of this proposal will be seen when the election begins, the document for dRep to refer to as the basis for the election. it will tell the success of this proposal. \"", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 5054, "q0": "This addresses the need for more diverse dReps head on. A major barrier for participation is lack of English proficiency, since proposals are written in English. \n\nThis addresses Japan and Viet Nam where Cardano has a lot of support and a lot of interest. These countries also have a low level of English proficiency. \n\nBy translating the main points of proposals, and indexing them, people in Japan and Viet Nam will have a much easier time participating as dReps. \n\nThe plan calls for this program to be built so that it can be reused for other languages. This really targets the goal of the challenge.", "q0r": 5, "q1": "The group proposing this has presented the perfect credentials for doing this project. They have many years of direct experience in translating these languages. \n\n\nThey have a lot of experience working together, which says that they will likely be able to adapt as things change. The dRep program is new, Cardano is growing. The team will have to adapt, they seem well suited for that. \n\n\nThe team budget is very detailed and seems like fair costs. The footnotes in the project make it clear that the team has done their research.", "q1r": 5, "q2": "The timetable is thorough and easy to read. The processes track very closely with the Catalyst calendar - which is essential for this to work. The team has a lot of experience translating this type of material, so their estimates look very reasonable. \n\nThe markers of success are very clear. The audit process is very objective. ", "q2r": 5, "assessor": "z_assessor_2669", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 5661, "q0": "To make the drep role more inclusive and diverse, one of the biggest challenges would be language barrier. From the information presented, the focus here is to “… create a searchable tool for dRep use and save time. The tool contains the proposal summary’s content and review in 3 languages: English, Japanese, and Vietnamese”. Largely, the scale up  in the growth of the cardano community base across the world could be attributed to the community’s ability in finding solutions to language differences. Therefore, this project could be a springboard to advance the entry of more participants in the drep role across the world, starting with Japan and Vietnam. The main objective of the drep improvement challenge setting include ensuring many Dreps, having a diverse drep, having high delegation participation rate and an appropriate selection of drep doe delegation. In reference to that, I consider the ultimate goal of this project more aligned to the drep improvement challenge setting. The framework of the project allows more participants from diverse background and an increase in participation. For communities to be more receptive to concepts in their native language, this platform could help them embrace and participate in the drep role.\n\n", "q0r": 5, "q1": "The information presented here shows that it is likely the project would be implemented. the proposer presented a team of  7 members with significant work experience in language translation and other work field. In relation to the overall objective of this project, I am experience that these expertise and experience presented would be relevant to the project. The profile also comes with supporting documents that serve as sources to confirm their credentials. My main issue with the information presented for team experience is the lack of specified roles for each team member in the implementation process. However, is clear from the roadmap what the work structure is. With the detailed information presented on the roadmap, we know the appropriate activities to be done towards the overall project implementation. This comes with specified timeframe for the events mentioned. Considering the complex nature of the project, I think the roadmap is well designed to complement the expertise and effort of the team. Already all the appropriate relevant risks are outlined with the appropriate solutions to mitigate them. Again, my first observation about the budget is the absence of a team cost, miscellaneous expenses and any contingency amount. These are items that should be considered by the proposer to enhance the framework of the project. Other than that, I am satisfied with the budget, very detailed with the needed breakdown of the various items. In my view, the amount allocation is consistent with the market prices and fairly moderate. ", "q1r": 4, "q2": "The information on the kPIs for measuring the successs of the project is more clear and elaborate. Base on what’s presented, it is possible to  audit the project, especially considering the extensive information made available on the feasibility of the activities that needs to be performed. We have enough KPIs here, in my view, the only thing that could be better specified is how the Cardano community could have access to such information. As important as providing ways to monitor the project, it is necessary that we know how to carry out this monitoring. We know that the team has a set out plan to use the KPIs to assess, monitor and track the progress and success of the project, however how do the community have access to these information? I entreat the team to consider making the information on these parameters available to the community via the catalyst social media platforms.", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6006, "q0": "I really like the idea of ​​these proposal and they fit perfectly with the \"dRep improvement and onboarding\" challenge. The challenge will fund proposals that build values ​​to enable dRep to operate most effectively. The idea here is to build a tool to synthesize all information from the content of the proposal to the comments of the PA to give an overview of any proposal. And from there dRep can look at this general information and vote. This idea saves a lot of time for dRep, giving dRep more time to call for the community to entrust power voting and optimize voting resources. Therefore I believe the proposal will create great value for Catalyst and the whole Cardano ecosystem.", "q0r": 5, "q1": "I completely agree on the feasibility of the project. Because the proposer has made it very clear in the following aspects:\n-Budget: I think the price of 0.02 - 0.03USD/word is reasonable. Other costs including checking and adjusting costs or contingencies are also detailed.\n-Project members: I highly appreciate the experience of the members. Most of them are translators with more than 5 years of experience in translating languages. And besides, there are members who are native Japanese, so the text correction will be more accurate.\n-The timetable is also reasonably distributed and detailed for each milestone for implementation", "q1r": 5, "q2": "The proposer gave us detailed information about who the team members were, and about their experience (I mean the proponent provided qualifications and certifications that demonstrate Japanese language proficiency). I also completely agree that the proposal can be safely and reliably audited because we already have milestones to measure the project's progress. Besides, KPIs on achievements will be achieved to show the level of success of the project.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 8841, "q0": "For the proposal for to be more effective and more voters are needed, as voting numbers increases suggestions and enhancement provided by voters also increases, where the proposer's team can use these suggestion an d make his project still more effective one.\nAs some voters will find difficult to read the proposal available in English , every time they need to make use of google translators , which hindrance the numbers of voters and even in google translators finding proper technical words is not seen , hence to develop a tool where voters can easily translate to Japanese and Vietnamese, where they can understand proposal and vote is a effective idea. Hence, his proposal effectively addresses the challenge.", "q0r": 5, "q1": "As their are many tools already available for translating from English to Japanese and English to Vietnamese, making use of them and developing a one more tool where the summary and reviews of proposals to be available readily translated is achievable,\nThe proposed team have members who have more than 10 years of experience in translating English, Japanese, and Vietnamese. with such team provided and by making use of already tools available in the market , Hence ,With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clear goal where language barrier should not affect voters for casting their vote, the audit has introduced all the team members of the project with their provided experience in both translating as well as in block chain development .The audit has provided detailed manner of timeline and milestone to complete the project, it even contains budget breaking idea in more efficient manner .The proposed solution has clear key indicators where it can be measured by number of people using this translators to understand the proposal easily , with experienced team provided and minimal risk involved the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 9313, "q0": "In Vietnam and Japan, there are many people who are really good, but they have difficulty in using English, do not use English, do not have enough time and language skills to choose and vote for candidates. suitable proposal. So I think your suggestion is very reasonable. Besides, the Japanese do not use the Latin alphabet, so their English is not as good. I see that your group is mainly Vietnamese, but I still believe in the ability to translate into Japanese because in recent years, many Vietnamese people have come to Japan to live and work. Therefore, the Japanese ability of Vietnamese people is worth trusting. Overall I agree with your suggestions.", "q0r": 5, "q1": "It is proposed to divide the work plan into 5 stages clearly and concisely, logically presented. I find 26500 USD for 3 months of translation work to be reasonable. About members of the group, which is fully updated with information, includes 7 members who are fluent in English-Japanese-Vietnamese. Overall everything is fine.", "q1r": 5, "q2": "You have specific numbers to measure your work progress eg Minimum score of 500 downloads will be considered successful in the testing phase. In your proposal there is a legend for your measurement criteria. However, I have not seen how your progress will be reported. Should have a weekly or monthly reporting plan...", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12567, "q0": "The issue raised by the proponent reflects the current situation, busy dReps in non-English speaking communities do not have enough time and language skills to select and vote on suitable proposals. This affects the efficiency of election assignments. Accordingly, the proposed team came up with a solution to this problem by creating a searchable tool to use dRep and save time. It contains a summary of recommendations and reviews in 3 languages: English, Japanese and Vietnamese. The team plans to implement this exciting tool in Foundation 10 to assist the English, Japanese and Vietnamese dRep communities to test functions, and improve from community feedback to create a workable tool. for these languages ​​and start releasing it to other communities in the upcoming funds. The main goal of the proposal is to attract more dRep from the Japanese and Vietnamese communities, to implement the methods. convenient, efficient, and time-saving access to upcoming fund voting, diversifying voting authorization by making it easy for dRep around the world to maximize their ability to vote in I believe that a proposal like this, will bring great benefits to the community, with this proposal I completely agree and rate it 5*.", "q0r": 5, "q1": "According to the proposal, I see that the project team members each have more than 5 years of experience in their translation and interpretation. The group consists of 7 members who are fluent in English-Japanese-Vietnamese and are responsible for the translation. project implementation phase. Additional interpreters may be hired to manage progress and assess translation quality. Regarding the budget requested by the team of USD 26,500, the team provided a clear and detailed budget breakdown. The proposed team intended to create this searchable tool to support dRep from Fund10, so the rollout roadmap will parallel Fund10's schedule (3 months), the team provided a detailed plan, that includes progress and milestones, this is a plus for this group of proposals, the team presents the details very clearly. so everyone can track the progress of the project. In addition, the proposed team also identified the main risks that could prevent the successful implementation of the project, and the group also proposed reasonable measures. The team has given very clear detailed information to make it easy for the community to track the progress, I completely agree with this proposal, I rate it 5*.\n\n\n\n ", "q1r": 5, "q2": "As mentioned in terms of feasibility, the implementation roadmap will take place in 3 months with important milestones to achieve achievements. Divided into 5 main stages, each stage will be divided into specific work. The success of the proposal will meet the requirements of dReps with the functionality and usage of the tool that saves them time along with the accuracy of the post-proposal summary Fund10. Increase community participation rate in Japan and Vietnam in both voting on the Catalyst Project proposal and accelerating the dRep voting model to improve the quality of proposal selection in the upcoming funding rounds. I completely agree that this proposal provides me with enough information to gauge progress toward goals. I rate this project 5*.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 13588, "q0": "Tools to help dRep read reviews of author PAs should refer to this tool: https://www.lidonation.com/fr/project-catalyst/projects.\nThis is a tool that allows dRep to view all Proposals in Challenges. It is full of indicators of the number of reviews, the average number of reviews and the percentage of the amount requested against the fund.\nIn particular, in the proposal detail page, there are full reviews and very complete evaluation content. This is a very effective support tool for the PAs and Voters that I am using.\nSo, when using this tool I just need to go to the proposal details page to see the reviews of the reviewers of the proposal and the content of the proposal to make a decision on whether to vote for or against. this proposal.\nIf you are not an English user. It's very simple, you just need to use Chrome browser and use Google translate, all will be translated into the language you want.\nI find that the functions you describe in your proposal do not make too much of a difference for users compared to the currently available tool, lidonation.com.\nSo I'm rating it at 3 stars because the proposal hasn't yet outlined the difference in idea how this will create more value for dRep compared to lidonation.com", "q0r": 3, "q1": "Look at information about the qualifications and experience of team members. I see the referral team has a lot of experience in translation. But I regret not seeing the author and the team giving me references from other sources to verify the accuracy of the information about the qualifications and experience of the team members. Although the author and team provided pictures of the certificates, when I looked at it I didn't understand anything and could not determine the credibility of the certificate. I think the PA will have a similar look.\n\nFor example, the author and team members can provide information on reputable sites like linkedin. This is a site that provides very reputable profile information about an individual's work experience.\nTherefore, I can only rate 3 stars because information about the team's experience and capabilities is only provided from one side and lacks from other sources of information for reference. That is a very important basis for me and other PAs to accurately assess your true capacity.\nSorry if I have to rate you so low.", "q1r": 3, "q2": "Information about your evaluation indicators is not complete and detailed to evaluate the effectiveness of the proposal.\nThe example I quote in the author's suggestion:\n\"What does success for this project look like?\nSatisfactory of dReps with the tool functionality and usage that assist them in saving time along with the accuracy of summary of proposal content after Fund10.\n\nIncrease the participation rate of Japanese and Vietnamese communities in both Project Catalyst proposal voting and accelerate the dRep voting model to improve the quality of proposal selection in the coming fund rounds.\"\n---\nThe indicators you give are very general, it is difficult to determine the effectiveness of this proposal for dReps. In my opinion, it is advisable to use indicators like:\n- Number of dRep using your product\n- Number of good proposals funded by dReps using your product\nFinally, transparency in the proposal implementation process is absent. There is no source or channel for me and the community to know the results you and your team have achieved.\nThe author should create a communication channel of the group to update the news about the work done so that the community can follow the results.\nI think the author will need to add a lot of things to make the proposal more complete. Hopefully in Fund10 the author will do better.", "q2r": 3, "assessor": "z_assessor_3702", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "Thank you for taking the time to rate our proposal.\nBut I'll explain a little bit about why I flagged this review.\nWe have provided sufficient qualifications to demonstrate competence, and have included certificates in the proposal. However, PA did not investigate carefully. The Certificate of Japanese Language Proficiency is a qualification that anyone working in Japan knows. PA needs to spend some time learning to know. Regarding Linkedin, we don't provide it because we don't think it's necessary, and it's not required in the Catalyst proposal writing guidelines either. There is no guarantee that the information on Linkedin is accurate, as it is also the information provided by the writer. The most reliable way to prove a person's ability is a degree and experience. So PA, if you want to evaluate the capacity of the development team accurately, you should also learn about the types of qualifications. Therefore, the reason for underestimating the capacity of the project development team is because the PA does not understand the value of the degree, the inability to evaluate the capacity of the development team through the degree is not a convincing reason."}, {"id": 14004, "q0": "I have to say that I’m quite keen on this proposal’s idea. It completely meets my requirement so that I think it is fruitful with this challenge. Any proposals would be financed if they can prove their capacity in contributing diversity value to assist dRept to operate in the most effective way. The brainstorming here is to create a tool that helps in gathering all the information from the content of the proposal to a lot of PA comment, evaluation to show a general one from any of proposals. This would be a frame with variety of data for dRep to conduct a voting poll. Hence, I believe this proposal would create a huge value for Catalyst and for the whole Cardano inhabitant. ", "q0r": 5, "q1": "For most aspects, it took me a long time to consider and decide to give a 100% agreement for the possibility of the project. When looking at each members’ profile, I noticed their diversity of experiences. Most of them are interpreters who have over 5-year experience in the linguistic field.  I think most of the audience, and critics will have the same viewpoints as me when looking at it. Thus, it raise the reliability of the proposal a lot because of the capacity of each member here. On the other hand, based on budget aspects, member’s ability, and the set-up schedule to make my own decision. According to the description of the budget, I think it is quite reasonable and suitable for the proposal’s value back to us. Since, a paper may contain approximately 700 words, it would be about $14-$21 for a full data and be described briefly but simply to understand. Obviously, it is not an expensive offered expenditure. Moreover, the proposal is really well-prepared as there is the back-up plan that also appeared in a very specific frame for us to know which would be incurred and why", "q1r": 5, "q2": "The auditability has been shown quite clearly and easy to imagine about the targeted achievement. Since proposer has provided us a detail data of who their members are, and which their majors experience is, the voters can make a relevant evaluation between the possibility of the proposal and the capacity of the teammates. The expectation of the team proposer toward the proposal’s achievement has been illustrated via those description. By the way, there is a KPI as a useful base for comparing the implied number and the actual as well to see the productivity of the team and the project. The auditability is such a vital aspect in evaluating whether a proposal fits or not, but this proposal has convinced me honestly! ", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "We propose to create a searchable tool for dRep use and save time. It contains the proposal summary’s content and review in 3 languages: English, Japanese, and Vietnamese.", "experience": "Our team includes members with more than 5 years of translating English, Japanese, and Vietnamese. The team has been involved for over 2 years in Cardano blockchain and Project Catalyst, an experienced PA and a funded proposer. "}