{"id": 415035, "author": "nguyenthiha07tp1", "title": "Support dRep Japan and Vietnam", "url": "https://cardano.ideascale.com/a/dtd/415035-48088", "category": 26601, "amount": 14500, "description": "The dReps in the non-native English community like Japan and Vietnam have difficulty reading and understanding meeting documents, announcements, and communications from Catalyst, Cardano.", "f6_no_assessments": 12, "f6_rating": 4.694444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 13694, "q0": "I found the idea vital, it’s about solving the language barrier of the non-native English countries like Vietnamese and Japanese so that they can understand the features of Catalyst and Cardano. According to the proposers, the non-native dReps face difficulties in reading and understanding documents about our Cardano ecosystem therefore I have an opinion and I guess the proposers have too that it would affect the quality as well as the diversification of them in the Cardano dReps community. For the previous statement, the problem totally fits with the 1 question of the challenge which is “diverse and many dRep participants” to make the Cardano more decentralized. In fact, the solution proposed is practical and necessary which is to translate into Japanese and Vietnamese documents, information and announcements then share with the dRep community and attract more new dRep. Because I believe the obstacles in developing our community is the lack of solid understanding of the situation which is partly caused by the language barrier. When we are able to break through the difficulty,  it would make the Vietnamese and Japanese dREep community understand the information of the ecosystem and find it more interesting. Based on that fundamental and under the word of mouth effect there will be more dRep attracted to and our community will be scaled up. Not just so, I believe that gaining more knowledge for dRep would strengthen the community to be a more qualified one and diversify the global dRep. I also highlight that the initiative is extendable to other more languages or in the other word, the scale of this project could be grown. To research deep into the solution itself, the proponents listed about 8 categories of documents needed to be shared as a reference for seminar, on/off meetings in Japan and Vietnam. After being translated, the document will be uploaded via social media as well as community groups there, which I believe will attract a lot more new dRep.  They also have proof by quantitative data referenced from reputable organizations to show the reason they choose Japanese and Vietnamese. I think that having research that makes it clear and proven the argument will be extremely useful for PAs and other related roles to evaluate the impact of the idea. Not just so, the deep research gives them a particular view on the risk they might face. According to the proposers’ opinions, there are 2 risks underlied which are about the deadline for translating and the ADA fluctuation. Having given out the risks, they also have reasonable solutions to solve. This is also a consequence of deep understanding of their own ideas. I just suggest one thing that quality moderation is one thing to consider as it affects the outcome and the dRep’s satisfaction therefore creating a moderators team to audit the translation quality can be a solution. On the other hand punctuation management is inquired due to the high demand of in-time information. I suggest we include a fund for reward and punishment regulation to encourage team members. With the solid argument above, I would give this part the maximum rate.\n", "q0r": 5, "q1": "Regarding the detailed plan, I think the information that is given is extremely rich and explains in an extensive and precise way what would happen during the project development process. One observation I would like to clarify is: “stretching up to Fund 10&11”. According to my knowledge, there will be spare time after being funded from Fund 9 ended and Fund 10 started. Does the proposers mean  they will come back asking for more in Fund 10 & 11 or the timeline of proposal at Fund 9 will exceed to Fund 10 & 11? The other point I want to be clearer is the  general activities of 5 phases, are they overlapped? Anyway, I believe it could help me (and other readers) understand more about the feasibility. Speaking now of the activities explained, in fact this part is perfect, I know that they would be divided into each week and tasks for each week are fully included. Each of them is explained with extreme care, so that we have a full understanding of what would be done and how. The requested budget of 14 500 dollars, in my opinion, is a very fair value for the dimension and complexity of this proposal, I think it will really generate great results for Cardano and deserves this funding. The explanations about the money are extremely satisfactory with pages/words/$, I found it totally satisfying in terms of making us understand how the money will be used. Before speaking to the team members, I just wonder that proposers mentioned hiring additional interpreters (if necessary) but I see none budget for more resources, let’s make it clearer in this point if possible. About the team members themselves, I can see that there are 7 experts in English-Japanese-Vietnamese with at least +5 in translating and language. Some are experts in blockchain and Cardano ecosystem for years. Total confidence in the trio is conveyed, as we know their professional attributions (levels of education and current area), a small curriculum and also links to pages such as linkedin, Facebook, where we can see in practice what they have done so far and we have proof as well as the information provided. years. One point worth mentioning here is the ask for the fund under the name a a project called  Proskills39 which has been funded in Fund 8 and under construction right now. This raises their higher commitment to the whole project they’re working on and I am impressed by that. In summary, the auditability of the project is very high. ", "q1r": 5, "q2": "Progress measurement is impeccable, proponents state ways in which this project will be monitored during its development process, these being the establishment of a set of KPIs: 100 pages translated/m, 500pages/5m; involvement with Marketing to share various of content with the groups of up to 50000 members. They also state that there will be processes to assess project deliverables and also involvement with a Catalyst community consultant review and audit, which is monthly reported and attached a link to where the translations are stored. The successful scenario is described thoroughly through this excerpt “Adding multilingual resources (Japanese, Vietnamese) for the Japanese and Vietnamese dRep community; Attract new dRep to join the dRep program by breaking down the language barrier; Make it easier for dRep to access information from Catalyst, improving voting representation.” With the successful image they have stated, I believe it could gain more benefit for our Cardano ecosystem in general. Besides, I suggest some other ways to measure which are rate, percentage of reach in social media platforms where the work is public. The number of requested documents and the higher demand for translations (Assume that the number of workers does not decrease but the number of tasks increases).\n", "q2r": 4, "assessor": "z_assessor_3750", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 883, "q0": "The team proposes to translate documentation for dreps into japanese and vietnamese. This speaks directly to the challenge brief goal of attracting a large and diverse pool of dreps. As a stakeholder aiming to maximize return on intention, I particularly appreciate the data presented to demonstrate the impact of prioritizing these languages (ie crypto adoption relative to prevalence of english proficiency. It's also great to know that the team already has a captive audience interested in Catalyst, so that the translated documents will actually reach real participants. ", "q0r": 5, "q1": "The scope of work is large (500 pages), but the team claims more than 5 years of experience in translations. As someone without experience in translations, I'm inclined to trust their judgement. The team is also quite large and can share the work. The links provided give credibility to the claims about having an existing audience, although I would've liked to see a few more personal links for the individual team members (eg. linkedin, github). ", "q1r": 4, "q2": "The proposal has a well-defined scope of work, and the team outlines several additional success criteria, making this quite straightforward to audit. I appreciate that the team outlines not only completion goals, but also goals related to sharing. It's critical to actually reach people with the translated documents, and the team demonstrates a focus on this important post-content-creation goal.", "q2r": 5, "assessor": "z_assessor_2146", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2789, "q0": "\"After the proposed team noticed the unpopularity of English and the limitations in accessing related documents of dReps, to overcome these difficulties the team came up with a compiler solution, from English into the mother tongues of two countries Vietnam and Japan, and also to meet part of the challenge required.\n  \nThe proposal states why providing translation services is necessary for the communities of the two target countries, and the statistics provided by the team are adequate, but if at best there should be links for statement of reasons leading to the need for this translation service, which is a statistical link to an organization's English proficiency index. The content in the translations proposed to provide to the dReps community, as stated, is mostly documents closely related to dReps, for example: \"\"DRep Regulations and Guidelines, Notice from dRep Catalyst and dRep Frequently Asked Questions\"\" these documents are essential for the new dReps community, and the proposed team also outlines how to reach the target audience by posting on social media sites. Popular social networking platforms such as Facebook, telegram. The proposal's commitment is to provide free translation support to the dReps community for free until funding rounds 10 and 11, after which the service will be charged as a percentage, this section can be a bit more detailed. it's also good to charge a percentage based on what total to calculate,\n  * this will be very helpful for the new dReps community, as well as breaking down the language barrier, so that the target audience can gain more knowledge and understanding of dReps, the solution in general This is essential for the voting community.\n    At the same time, there are also many risks that have been foreseen from the proposed group and most have effective control measures. \"", "q0r": 4, "q1": "\"I have no opinion on the progress of the proposal provided here, however the team marked as involved in writing another proposal for this funding round, and that proposal also contains translations, and coincidentally that proposal also provided services at the time of round 10, so I am concerned that running so many proposals in parallel will be detrimental to the team, and since the team has not there was a announcement on that issue, and there was no commitment to parallelize the work but ensure the completion on schedule, so that led to my concern.\n  \n   proposed by the team, before commenting on the budget table, I would like to ask one question: will the team translate the documents by machine or manually, this has never been published, in many proposals of the group in this round. however, I agree with the expenses that the proposal has provided it is reasonable and also in line with the common ground, because I understand the translation work if you translate it manually will be very hard.\n   \n   I went to the website of the translation service offered by the proposed group and I tried to search but I only see her displayed in the paid services, and also do not see the members that the group has provided. in this presentation. However, it can be a collaborator, this is not important, as long as the team provides quality translations and ensures on time, the responsibility will be on the team leader, Ms.", "q1r": 4, "q2": "\"hey team leader ha, you did a great job, as you've outlined the success of your pre-funded proposal and provided an expected launch date, it will have a huge impact on that community, that is enough to see that your capacity and responsibility are very good, in addition, you also have a statement for the indicators of translations provided to the community and Catalyst. This ensures absolute transparency,\n    the success of this proposal will provide a great deal of useful material to the voting community, and at the same time encourage community members to participate in the election rounds,\"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 6007, "q0": "I completely agree that the idea of this proposal is perfectly suited to the challenge presented. The idea of this proposal is to translate all dRep documents into Vietnamese and Japanese and share them in groups on telegram, discord or Facebook. Because English is not the native language in both Vietnam and Japan, it creates a language barrier. The translation of all documents is for the purpose of allowing future dReps to view and download these documents, giving them more information to make a decision to vote for which project they are interested in the most", "q0r": 5, "q1": "I completely agree on the feasibility of the project. The information contained in the proposal is fully assessable. Specifically, we take a look at the following aspects: \n-Number of members: 7 people working here will ensure that the project progress is completed on time. \n-Budget: the cost for a translated word is 0.02-0.03 USD/word, which is very reasonable compared to the common level in the labor market in Vietnam. Other expenses such as hedging, marketing and management are also very reasonable and are explained in detail here. \n-Challenges as well as risks have been taken into account and the proponent has prepared plans to limit these risks. All of the above shows that the project will have a high probability of success if it is funded.", "q1r": 5, "q2": "In terms of audits, I completely agree with the statements the proposer has listed for us. For example, the information about each member is searchable, the proposer provides enough evidence to prove the translation expertise of each person. The proposer has also set out milestones to measure the work to be done and use that as a measure of the project's progress. In addition, KPIs are also set out to measure the success of the project. I only have a small suggestion that if I can include the downloads of these documents, it will help the proponent understand to have better marketing options.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 6160, "q0": "The reality of the matter is that dReps in non-English speaking communities like Japan and Vietnam have difficulty reading and understanding meeting documents, announcements and communications from Catalyst, Cardano. From that situation, the Proposal team came up with the idea: Create Japanese and Vietnamese versions of dRep documents, information and announcements and share them with the community to support the existing dRep and attract new dRep. So your idea is in line with the requirements and criteria of the Challenge, which is how to achieve diversity and have many dRep participate. The problem not only solves 1 question of the Challenge, but it also aims to promote harmonious and efficient societies for sustainable development, creating opportunities for equity and justice for all. and building effective institutions, it contributes to expanding and enhancing the participation of developing countries in global governance institutions. Therefore, the Proposal has the ability to scale up in the future to help the world develop sustainably. your idea is to come up with a solution Support the currently participating dRep while also attracting new dRep from the Communityd to ensure that the Challenge requirements are diverse and have lots of dRep. The proposal is made by: Translating and sharing documents about dRep to the Cardano community in Japan and Vietnam. I find that you have chosen a very suitable audience for the current situation, Japan is the place with the largest number of people investing in the Cardano platform and holding ADA, and Vietnam is a developing country. development, there is huge potential for the expansion of the Cardano and dREP communities. Your solution also solved the problem of language barrier for the Cardano community in Japan and Vietnam. Specifically, the work you have done is: Create a mother tongue document to help dRep of the Japanese and Vietnamese communities easily access and better understand dRep in order to increase efficiency and quality. of the dRep program. It is the sharing of dRep documents in Japanese and Vietnamese that has helped increase the number of new dRep from the Japanese and Vietnamese communities. The group's proposal provides an argument with a theoretical and practical basis in line with the Challenge presented. In the process of implementation, you have also foreseen 03 risks that you may encounter: (1) The dRep community requires more and faster time to translate dRep documents than Catalyst documents and (2) Variables big movement of ADA coin. This is very real. And I agree with the solution you give to overcome those risks: (1) Make sure to complete the translation at least 1 week from the time you announce the number and start time to receive the document translation according to the requirements. request from the dRep community. (2) Create a reserve fund for the fluctuation of ADA value, convert ADA to Stablecoin or USD. However, I want you to pay attention to the problem: the difficulty in translating new and difficult specialized terms by providing additional solutions or explaining in a simple and understandable way will reduce the time you have suggested at risk (1).\nI rate: 5 points\n", "q0r": 5, "q1": "You have clearly defined the timeline for implementing the idea of the proposal as about 5 months, extending from fund 10 to fund 11, which is a reasonable time to do the work to achieve the desired goal. That is also the goal that you are aiming for: Attracting more new dRep from the Japanese and Vietnamese community. I am very impressed with the clearly quantified goal: Get 10 more dRep from the Japanese community and 10 dRep from the Vietnamese community to join Catalyst. Impressive numbers if achieved, given Catalyst's ambition to have more than 200 dRep from more than 100 countries. For that number to come true, the team has come up with a specific plan: The completed documents are shared on Facebook and Telegram groups with many Cardano and Catalyst members in Japan and Vietnam. This is the traditional and very effective way in these two countries. But I still want more, for example, to expand to social networking channels like Zalo, Google Sheet ... then the number of interactions will reach a record number. To realize their idea, the proposal team came up with a Fundraising Budget of $14500, which is less than 5% of the Challenge. A number in my opinion is appropriate. That is clearly and transparently shown by the group in the reasonable budget spending plan. And the proposal also has an additional contingency plan of $1000 to prevent risks. The proposed group has an abundant number of members with 7 people. Team members have been assigned specific tasks and the members' experiences match their duties. All are easily authenticated at the identity on social networks such as Facebook, Telegram. If funded, the proposal will return to the Catalyst fund next fun for the opportunity to serve Catalyst and the dRep Community, which shows the great feasibility of the proposal.\nI rate: 5 points\n", "q1r": 5, "q2": "The measure of the success of the proposal is: Every month translates 100 pages, 5 months translates 500 pages. The progress of the proposal is easy to check at the Facebook group (\"Cardano ADA Vietnam Community\":> 5000 members https://www.facebook.com/groups/ada.holder \"Cardano ADA Vietnam\":> 47,000 members https://www.facebook.com/groups/cardanoviet and Telegram, so with the success of the Proposal, it will add multilingual resources (Japanese, Vietnamese) to the dRep community in Japan and Vietnam. Nam. Attract new dRep to the dRep program by breaking language barriers, making it easier for dRep to access information from Catalyst, improving voting. With such results, the Proposal's success is deeply related to Challenge F9: dRep improvements and introduction.This is a brand new proposal so no actual product yet.\nI rate: 5 points\n", "q2r": 5, "assessor": "z_assessor_2787", "no_vca": 9, "ne": 3, "ng": 2, "nfo": 4, "vca_o": 1}, {"id": 7866, "q0": "The proposal at hand address a consequential problem is lack of cognizance about catalyst and cardano. The dRap related documents are shared in the community, seminars and offline and online meetings in Japan and vietnam. They provide catalysts for auspicious cost for prosperous implementation of the dRap project. After the translation it will be shared in the Japanese and vietnamese communities and also provided reasons for translating thereby increasing the effectiveness. The proposer is also aware of various risks involved and also aware of various risks involved and also has required active plan to overcome them. They prioritise translating official documents from catalysts first and notify the member and start receiving documents. ", "q0r": 5, "q1": "The vision that the proposal intends to achieve is very vibrant. They provided implementation schedule for each months and also a marketing plan with its purpose and goals. The price of the translation is below 40% compared to the market price. The total translation fees is 14500 USD and very clear and pratical budget breakdown. The team consist of seven members and the steps and roles of the members are clearly identified. The team put together to make this idea into a reality is very trustworthy. The member carry a lot of experience and skills and they are good at language ability. The team mentions about coming back in the next round based on the satisfaction of the transaction quality of catalysts which shows the passion and future plans for their proposal. ", "q1r": 4, "q2": "The proposal along with its wonderfully laid out game plan, also comes with excellent metrics to measures it's progress report on the number of translations with attached link and they set a translation goals with marketing objectives. As it is a entirely a new proposal the success of the project looks good. They try to attract a new dRap to join the dRap program. I feel the team should have made a dainty bit more effort in explaining. ", "q2r": 4, "assessor": "z_assessor_2929", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8842, "q0": "It is every members right to vote to make the project efficient, where voters can give suggestions and can make the project still more effective one .The language barrier has very much effective in decreasing the number of voters from different languages around the world, Hence to counter such measures the proposer's team wants to create Japanese and Vietnamese versions of dRep documents, information, and announcements and share them with the community to support existing dRep, so the it will not help the current dReps while voting , but also it will attract new dReps to join towards the project. Hence, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "As there are many translators available in the market where people wants Japanese and Vietnamese people to understand the blockchain , using such tools the proposer's team can help in translating the proposal from  English to Japanese or Vietnamese, The biggest challenge here the team could face is time on how fast the team could to translate and produce documents where it would helpful for next proposal , if there is delay every new proposal will be having every new idea , so that readers will find difficulty in learning new terms, Other than that with experienced team provided and with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has clear goal where it wants to add maximum number of voters to the community, and language barrier should not be problem to understand and the projects or casting the vote. The audit has presented each step of proposed solution which includes which are the basic topics the team wants to translate which includes workshop materials, meeting materials, new regulations and latest notifications related to project catalyst.\nThe audit has introduced all the team members who are working with the project and their experience in translation and as well as in block chain development , the audit has detailed budget breaking and timeline of the project , the propsal has also presented well structured KPI's to measure the success rate at each phase, Hence with the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9314, "q0": "I found the team's suggestion to be consistent with the reporting problem. In the current input box trend, countries like Japan and Vietnam are also a developing country, in the field of technology is also a very hot industry in Vietnam today, but English is still limited for students. with programmers as well as really important people interested in Blockchain. It is really necessary to translate dReps related documents into Japanese and Vietnamese for sharing in the community, for seminars or for offline and online meetings in Japan and Vietnam. If this project is implemented, this is really useful knowledge for the community of programmers interested in blockchain in Japan and Vietnam. Your IMPACT section is pretty detailed, explaining why this proposal is needed. You can also show the risk and also show how to minimize the risk, you present it in detail that is easy to see when reading.", "q0r": 5, "q1": "I find the proposal for a brief job blueprint analysis easy to understand, quite practical. A specific, actionable plan. In addition, you can put pictures of some translations to convince people. The information of the members of the project is stable, it is necessary for such a team to work together, the new work progress will be fully guaranteed at all stages of the work. I found the team members to be experienced people in the language translation industry very well, these people are all reliable. However, you should provide more Profile with the access link for verification. I think with realistic planning and detailed team budget, the project will be able to work well in practice.", "q1r": 4, "q2": "You have measured the progress and development of the project in a stable level, the proposed proposals have specific numbers and goals to be achieved. I have an additional contribution that your marketing goals can be marketed on social networking platforms such as facebook, zalo, instagram... to let everyone know the relevant knowledge. to Cardano. The success of the project is also due to the good feedback of translated documents, the number of documents that people want to ask to be translated is increasing, which shows that your team is useful because there is a a project that benefits the community.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9568, "q0": "“Vietnam and Japan are two countries with similar English proficiency indexes and lower than other countries in East Asia. This is a barrier that makes it difficult for people in these two countries to access Cardano's dRep program, even though they are very potential people. Japan has a sizable amount of ADA holdings since Cardano is originally from Japan. Vietnam is considered the country with the highest cryptocurrency acceptance index in the world. So if this proposal is approved, it will solve the challenge well.”\n\n“Translating documents into their mother tongue for people who are very interested in joining dRep but are not fluent in a foreign language is an effective way to help them quickly access the program.”\n\n“The team presented the risk and how to manage it by the proposal. Risks of possible faster translation deadlines and ADA slippage are necessary. However, the team should also be aware of the risk that some in-depth dRep documents can be very confusing. An experienced advisor in this field is required to assist the translation team in a more efficient, understandable way.”", "q0r": 5, "q1": "“The team has proposed a specific plan for 5 months, each month the work is allocated in detail by week. Thereby helping to control the quality and progress of the translations. In addition, the team is also very enthusiastic when launching a plan to periodically post to market to attract more new dRep to join the program.”\n“The budget is allocated in detail for the work to be done in the project. The costs for each job are appropriate.”\n “The team provided detailed information about the project participants. There are Japanese language certificates attached so that they can be easily checked. Everyone has 5-10 years of Japanese translation experience. This is one of those proposals where the information provided is very transparent.”", "q1r": 5, "q2": "“With a detailed plan, it becomes easier to check and track the project progress. The community can track project progress through the team's commitment to the number of documents to be translated and the number of articles to be posted to the community every month.”\n“I believe that removing the language barrier will help the project succeed. I fully support the group's goal: to help more Vietnamese and Japanese people become dRep and to give dReps a place to access information through the native resource that the team has worked so hard to build. However, if you add KPIs, it will be great. I hope that after the project is approved, during the implementation of the project, the team will have statistics and then the KPI will be added.”", "q2r": 5, "assessor": "z_assessor_3065", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12568, "q0": "dReps in non-native English communities like Japan and Vietnam have difficulty reading and understanding meeting materials, announcements, and communications from Catalyst, Cardano. The problem proposed by the group reflects the current situation. The proposal would add value to the Cardano ecosystem by translating the dReps-related documents below into Japanese and Vietnamese for community sharing, conferences, or offline meetings. and online in Japan and Vietnam.\n1. dRep program brochure\n2. dRep Workshop Materials\n3. dRep meeting documents\n4. Minutes of the dRep meeting... This proposal creates a mother tongue document to help the dRep of the Japanese and Vietnamese communities better understand dRep. Contribute to increasing the number of new dRep from the Japanese and Vietnamese communities by sharing dRep documents in Japanese and Vietnamese, breaking down the language barrier. Contribute to dRep diversification by contributing to attracting new dRep. The proposal's key metrics and goals match the stated challenge settings. It can scale to address future challenges.", "q0r": 5, "q1": "The proposed team consists of 7 fluent English-Japanese-Vietnamese members who are responsible for the project implementation phase and will hire additional interpreters (if needed), manage the progress, and evaluate the quality of the translation. , by the information provided by the proponent, it can be seen that a group of competent and long-term experience in translation and interpretation. The team was expected to translate 500 pages of documents, 300 words each, into Japanese and Vietnamese. Then share with the community. Original document content (in English) will be received from Catalyst, Cardano, and document request translation from dRep /SPO which has a high reputation in the community. The total budget is 14500 USD and they have split it into 5 items according to the content of the work. With their plan to translate 500 pages of documents into Japanese and Vietnamese, it is expected to be divided into 5 stages, extending from Fund 10 to Fund 11 and ending when there is enough translation (expected about 5 months). Each period is 1 month and they plan to translate 100 pages per month (500 pages in 5 months). They also planned a monthly implementation schedule, which is the plus point of this project. Along with that, the proponent also pointed out two main risks that could prevent the project from being implemented. First, the deadline for translating documents requested by the dRep community is more and faster than for Catalyst documents. The second is that with the large volatility of ADA, the stable value of ADA can suffer a sharp slide as market volatility can lead to undercapitalization when doing the actual incentive calculation. Both risks on the proponent have found their measure. For this project, I rate 5 *.The proposed team consists of 7 fluent English-Japanese-Vietnamese members who are responsible for the project implementation phase and will hire additional interpreters (if needed), manage the progress, and evaluate the quality of the translation. , by the information provided by the proponent, it can be seen that a group of competent and long-term experience in translation and interpretation. The team was expected to translate 500 pages of documents, 300 words each, into Japanese and Vietnamese. Then share with the community. Original document content (in English) will be received from Catalyst, Cardano, and document request translation from dRep /SPO which has a high reputation in the community. The total budget is 14500 USD and they have split it into 5 items according to the content of the work. With their plan to translate 500 pages of documents into Japanese and Vietnamese, it is expected to be divided into 5 stages, extending from Fund 10 to Fund 11 and ending when there is enough translation (expected about 5 months). Each period is 1 month and they plan to translate 100 pages per month (500 pages in 5 months). They also planned a monthly implementation schedule, which is the plus point of this project. Along with that, the proponent also pointed out two main risks that could prevent the project from being implemented. First, the deadline for translating documents requested by the dRep community is more and faster than for Catalyst documents. The second is that with the large volatility of ADA, the stable value of ADA can suffer a sharp slide as market volatility can lead to undercapitalization when doing the actual incentive calculation. Both risks on the proponent have found their measure. For this project, I rate 5 *.", "q1r": 5, "q2": "As mentioned in terms of feasibility, the project is expected to take about 5 months with important milestones to achieve. The project, when implemented, will add multilingual resources (Japanese, Vietnamese) for the Japanese and Vietnamese dRep communities. Attract new dRep to the dRep program by breaking down the language barrier. Makes it easier for dRep to access information from Catalyst, improving voting capabilities. With the above information, I rate the clarity of this project 5*.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13591, "q0": "First, I found the solution suggested by the author in the proposal to be necessary for dRep from Vietnam and Japan.\nThis proposal will be of great help in dealing with the requirements posed by the Challenge.\nIn my opinion, the author should add an archive of these translations at a website or Google Driver. This will make it possible for dReps from Vietnam and Japan to view documents in sequence. It makes it easier for dRep to read information step-by-step instead of handing them a bunch of documents.\nImagine if you were a dRep and someone threw you a bucket of documents where everything was a mess. You will have to spend a lot of time reading and then putting it in order. That was really bad.\nWhat I want to say to the author is to put the document somewhere where you can organize it in an organized and scientific way so that people new to dReps can easily read and learn.\nIt's my feedback to further refine the author's suggestion. Hope this comment will help the author.", "q0r": 5, "q1": "The author and team members are members with extensive experience in the field of translation. I see this as a very strong team.\nThe author and team had another proposal in the same Challenge, and I evaluated it. That proposal is also an interesting idea. I just wanted to add a comment about the need to add more information about the profile on the Linkedin site so that we as PAs can easily assess the real capacity of our team members.\nBecause you provide us the picture of the certificate in Japanese. We did not understand anything when looking at these papers and how it affects the quality of the capacity assessment of protected areas.\nIt's a small addition that I think the author and team will draw a lot of experience for the Foundation later.\nThe presentation plan is very detailed and complete, no need to add more.\nThat is all. I think 4 stars is appropriate for this item.", "q1r": 4, "q2": "In the proposal on the risk section. I would like to suggest one more risk that the author and the research team need to watch out for.\nThat's the risk of technical jargon. Cardano is a very interesting ecosystem but a lot of technical jargon is confusing. I don't know how long the author and team have been with Cardano, how much time has been spent researching Cardano.\nCardano has a lot of confusing jargon such as eUTXO, state channel, hydra, etc. There will be many more specialized words if you do not participate in the Crypto market, Cardano and study deeply about it, it will be difficult to translate. for others to understand.\nThis is a risk that you should be aware of. This will increase the difficulty and time to translate a document. If you ignore that, it will probably lead to the reader not understanding the document.\nI think this suggestion will help you. In each document, if there are specialized words, additional comments should be added under the document or source for readers to understand more about that specialized word. This, in turn, will help your document reach its full value.\nHope my suggestions will be useful to your team.", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14005, "q0": "With the value back to Cardano community, I think this proposal deserve to receive more votes from our community. I am confident that this proposal will be successful. Even though, English may be the most popular language, it is relative viewpoint not the absolute one as each individual each hobby and talented on languages. They might be not good at English but good at other languages, this is understandable. However, for the viewpoint English maybe the most popular language, so that many document or book with interesting knowledge about blockchain, or programming, etc. are written in English. The high demand on those books to be translated causes some mistake since it is difficult to figure out a 100% similar word to the terms of this field that are mentioned in the books or document. Because of this reason, it proposed to translate all the dRep’s document into Vietnamese as well as Japanese and then deliver them to many Telegram groups, or Facebook (Meta). Therefore, it would be a terrific solution for the barriers that most users who are passion on Cardano inhabitant but not able to use English. Thus, the voters would avoid misleading of any idea in the proposal as translate all document helping them in gain information to make decision or vote for which projects/proposals they feel confident and consider as the top choice. ", "q0r": 5, "q1": "The possibility here, I think it is at a high proportion of gaining success. All the attached data in the proposal can be evaluated by some aspects like the member well-qualified or not, the reasonable or unreasonable budget, and also what challenges are occurred here, etc. This proposal would be an evaluation tool to see how terrific the team members associated with each other. On the other aspects, the range of costs that will be expensed is quite in an acceptable amount as I analyzed above. This amount is approximate to the general price of a translated page in Viet Nam. Moreover, every challenge and risk are also in plan with corresponding solution and approach to limit/reduce those risk as much as possible. Obviously, the proposer team really expect to its proposal and work so hard for it. I appreciate their effort, also. Moreover, the reliability of the proposal is enhanced a lot by the showing information of members in the team. They are experts in linguistic for 5-year experience and above in translating, so that there is no doubt about the quality of the document/books that will be translated by this team. By the way, Ms. Ha Nguyen, the team leader, is not only talented in working as interpreter but also has diversity of experience in evaluating Blockchain so it is certain that the team would be led well as they have a such talented and extensive knowledge.", "q1r": 5, "q2": "There is no doubt about my opinion or any disagreement since I see in this auditability side, the proposer has presented and made a list for us to get access and believe in his/her proposal. For example, he/she provided the checklist of each member’s data for users or any individual of Cardano community to search and investigate whether they did provide the truth. Because it helps the proposer to come up with more better marketing approaches. Furthermore, although there is KPI for the proposal, I just have a little recommendation that the proposal would be more reliable if they can add more specific number like the number of new users, or the accessing time to those translated documents/books. Therefore, it would be more visualized for voters to verify and evaluate the successful possibility of the process. Anyway, I have to give a compliment to the well-preparation of the proposer because of the provided relevant data for each person’s specification and specialized in interpret", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Create Japanese and Vietnamese versions of dRep documents, information, and announcements and share them with the community to support existing dRep and attract new dRep.", "experience": "Our team includes members with more than 5 years of translating English, Japanese, and Vietnamese. The team has been involved for over 2 years in Cardano blockchain and Project Catalyst, an experienced PA and a funded proposer. "}