{"id": 421562, "author": "vct", "title": "dRep Interview Channel", "url": "https://cardano.ideascale.com/a/dtd/421562-48088", "category": 26601, "amount": 16800, "description": "A lot of people don't know about dRep\nVoter doesn't have much information about dRep to delegate their vote\nMany people want to become dRep but don't know how to introduce themselves to the community", "f6_no_assessments": 11, "f6_rating": 4.787878787878788, "videos": [], "media": [], "f6_assessments": [{"id": 889, "q0": "The proposal aims to give a platform for drep interviews. This directly addresses the challenge, as it has the potential to not only help stakeholders make more informed delegation decisions but also increase the number of dreps by promoting awareness. As a stakeholder aiming to get the greatest return on intention per funding allocation, I'm happy to see this idea being pitched by active community members that already have an existing following. This makes the proposal much more impactful, as it allows the proposers to focus on content creation, and not also growing an audience from scratch. ", "q0r": 5, "q1": "The team offers a detailed plan on the content they propose to create. Given their background in the community, they appear well equipped to offer clear and understandable answers to those questions for their audiences. The proposers also include links to facebook groups to validate their claims about the size of the communities they have already established. ", "q1r": 5, "q2": "The proposal offers a clear definition of success, in addition to both qualitative and qualitative KPIs. Although not every measurement includes a target, I appreciate that the proposers give very specific viewership requirements for themselves, namely - \n\n\"Youtube channel has at least 200 subscribers after 6 months. Videos have at least 100 views\n\nThe number of dRep participating in Catalyst increase (at least 20 people will become dRep after join or watch our interviews)\"", "q2r": 4, "assessor": "z_assessor_2146", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4480, "q0": "The goals of this challenge setting are to put safeguards in place against centralization and dysfunction by ensuring a large number of dReps sign up and receive sufficient delegation, and these dReps come from diverse backgrounds - ideally \"more than 100 countries\". This would require dReps who are not currently well known and not yet well-connected to the community to step forward and gain a following by their unique profiles and diverse opinions and backgrounds. A video channel that centers around interviews of dReps does very little in that respect in my opinion. It is quite likely to give a platform to those who are already outspoken and fluent in English, well-connected and experienced, with knowledge about the channel and contacts to its creators. I see the risk of using a \"media circus\" similar to failed political campaigning in legacy governance. This would foster a \"winner takes all\" process and concentration of vote delegation to those bold and eloquent enough to being interviewed on the proposed channel. Outside the community of Vietnam and Eastern Townhall, English-speaking Telegram and Youtube channels, impact is not highly likely, but we need inroads in Africa, South America, the Middle East and the former Soviet Union states if we are to hit the 100 countries dRep number.\nThis concern aside, I think that the proposed program of the interview channel which focuses mainly on the first cohort(s) and existing dReps might encourage watching would-be dReps to step forward and apply. This is of course a possible channel of recruitment, but might not be very cost effective as it reaches a similar viewer base as existing Catalyst media channels who will without doubt take notice as dRep voting goes underway and the public discourse will react accordingly.\nIn summary, this is a decent proposal with moderate impact probability, that I think does a good job of filling a need, but may have been designed with more consideration of how this channel could change its format and marketing approach. The goal could have been how to reach new viewers and have some innovative approach to overcome the halo and stage fright effects surrounding the \"celebrity culture\" of Youtube interviews.", "q0r": 3, "q1": "The two proposers have a strong research and technical/blockchain background, but not a lot of media, video editing and presentation experience and partner up with the VietCore Youtube channel creators. This is a Vietnamese-only channel with moderate reach and production quality, that should be able to do a good job, but most likely not to the same quality standard as IOHK's Cardano360, or previous Catalyst participants from LearnCardano or Kaizen Crypto. \nThe budget and business plan are sound and should result in a good production quality.\nIn summary, I have no doubts that this proposal can be carried out effectively given the information provided, but is unlikely to \"jump off the page\" unless the team partners up with some more experienced, more diverse content creators - the budget should allow this.", "q1r": 4, "q2": "The targeted performance metrics and links to profiles and social media channels are clear and it should be possible for the auditors and community to keep in touch with the team and learn about the progress and success of the proposal. The goals however are in my opinion not ambitious enough given the scope of the targeted challenge setting objectives and percentage of budget requested. 100 views per video as a key metric will not be anywhere near the required viewing to \"move the needle\" on getting to dReps from 100 countries onboarded. Therefore, I think although auditability and clarity are there, more could have been done to set out ambitious but reachable goals and KPIs.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "We really appreciate your assessment for our proposal. But we have a few explanations to share with you\n\n1. Catalyst aims to have a lot of dRep coming from different countries. I agree with you on this. But to become dRep those people need to have basic English ability to be able to read and understand the proposals to evaluate and make voting decisions. Therefore, our English videos are completely accessible to many dRep from many different countries around the world.\n2. Our resources are available and the goal of this proposal is not to help people over 100 participating countries become dRep. We just want to grow the number of dRep who can speak English and Vietnamese. In addition, dReps who do not know Vietnamese can still reach Vietnamese delegators through our videos.\n3. The dReps that we selected to interview are those who have registered to become dRep on Catalyst's system. We will randomly select dRep to interview. Besides, we don't think this proposal can create the negative effects as you say. Because we are also a channel for dReps to share themselves with delegators. And ADA holders also have more information about which dReps to choose from.\n4. The video interviews that we do are very difficult to be \"media circus\" as you mentioned. We only create opportunities for dRep to share and connect with ADA holders. ADA holders can also interact and be in closer contact with dReps. The connection between ADA holder and dRep through video will bring greater efficiency than dRep's information on Catalyst's system.\n5. We do not intend and cannot be a force that can change and manipulate Catalyst's dRep mechanism to increase the centralization of the voting process."}, {"id": 4930, "q0": "As dReps are a new development that has not yet come to fruition, there is a need to create awareness and incentivize information channels that can appeal to the average ADA holder. In this regard, a YouTube channel specifically dedicated to explaining dReps and facilitating interactions between dReps and delegators will increase the effectiveness of this new tool in the Catalyst experiment.", "q0r": 5, "q1": "The team proposes a detailed plan of actions, with even a rough draft of information to be disclosed and an interview plan for potential and future dReps, and comprises individuals with prior YouTube channel experience regarding Cardano and blockchain knowledge with more than 500 subscribers. They are also familiar with Catalyst by means of their role as CAs and vCAs since Fund 7, and are active community managers within their region.", "q1r": 5, "q2": "As per their timeline, the proposers essentially will make a weekly video interview available on the channel during 6 months. As a publicly available material, the publication itself will constitue widely auditable material to track the progress of the initiative. Also, they propose success KPIs in terms of subscribers and regular viewers, which can also be easily audited.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6046, "q0": "The idea here is quite simple but makes a lot of sense. Basically the idea is to build a Youtube channel to interview people who want to become dRep. In this interview, dRep will share their experiences (could be their experience in community management, their experience in project evaluation, their understanding of the blockchain space) to build credibility mandate from the voter to the voter entrusts the vote to the dRep. On the part of voters, through this Youtube channel, they will be able to grasp which dRep they trust, and choose the right dRep to entrust them with. In each video posted on Youtube, the proposer will also translate it into two languages: Vietnamese and English, thereby connecting English-speaking voters with the Vietnamese community and vice versa. Overall this proposal will further strengthen the connection between voter and dRep and also attract more dRep to Catalyst. Therefore, I completely agree that the proposal fits the \"dRep improvement and onboarding\" challenge.", "q0r": 5, "q1": "On the feasibility of the project, I completely agree. The feasibility of the project can be verified through the following aspects:\n- Implementation roadmap: the proposer has provided us with sufficient information about the work that will need to be done. Prepare content for Youtube channel videos and forecast the number of working hours and how long it will take. Very intuitive here.\n- Budget breakdown: $60/hour for the amount of work to be done based on the detailed explanations of the proposer that I consider reasonable\n- Member implementation: I strongly believe in the experience of individuals in the group because looking at the information provided, the proposed team all have at least 2 years of experience in the blockchain space, experience in the role of is the CA (Community Advisor) in Funds 6,7,8 and is also the Administrator for a large Cardano community in Vietnam.", "q1r": 5, "q2": "It's generally quite easy to do an audit of this proposal. We will have a number of videos posted on the Youtube channel. The number of views as well as the number of comments on each video. There is the number of subscribers to the following channel after 6 months of implementation, and another point to measure is the number of dRep participating in Catalyst will increase.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 8931, "q0": "There are lot of people who wants to become dReps and doesn't know what is the actual role of the dReps, this hindrance the number of people voting in project catalyst and also hindrance the cardano ecosystem, as the number of dReps voting rate increases , there will be lot of suggestions added from dReps ,where these suggestions can be utilized by development team and make their project still more effective , Hence to conduct interview of dReps and help other dReps in understanding their role in cardano development eco system is a great idea, by which the eco system can grow still more effectively . Hence, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The task mentioned is not a difficult task to achieve, where setting up a YouTube channel and conducting some basic session and conducting interviews can be achievable, as the proposer has already YouTube channel with 500+ subscribers and has displayed some of his previous work, the mentioned task can be achievable.\nThe proposer should have concentrated still more on marketing strategy on how he could have gained still more audience to make the project more successful , other than that with clear goal to increase the voting rate from dReps and minimal risk involved . With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has mentioned what are the reasons that are acting as barrier from people to participate in voting , and has mentioned on how he's idea of interviewing can increase the dRep's voting percentage, the proposer has provided us the videos of their previous experience which shows that the team has proven experience.\nThe audit has detailed plan, including timeline and key milestones for delivering the proposal ,it also contains decent budget breaking idea, the audit has even introduced other team members of the project and their experience in cardano development project , Hence with given experience and minimal risks involved the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9358, "q0": "With the solutions in the suggestion I found it to be consistent with the reported problem. The video you provided is complete, you also gave the reason to create a Youtube channel to interview dReps. dReps can share what they want to bring to the community and Catalyst through dRep. You divide the challenge into 3 problems and each has a proposal to solve it. I find this suggestion ok because there are enough sections already.", "q0r": 5, "q1": "You have divided specific work into 6 months. You also plan clearly what the content of the video includes. Such clear planning in advance will help you accomplish your goals more easily and quickly. You need to be more specific about your budget. About the members, I see that everyone has good experience in the field of English and is knowledgeable about Cardano. The proposal has all the necessary parts.", "q1r": 5, "q2": "I agree with your AUDITABILITY part. However, the measurement of work progress can be shown in more detail than using google drive or google sheet to be able to update the progress of the project to update everyone to see. You have detailed the number to be achieved clearly, there are specific criteria to show the success of the project. I rate this part as okay.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12585, "q0": "A lot of people don't know about dRep. Voters don't have a lot of information about dRep to delegate their votes. Many people want to become dRep but don't know how to introduce themselves to the community this is a matter of challenge. be solved. It will add value to the Cardano ecosystem by creating a Youtube channel to interview dRep and introduce dRep to the community of ADA holders. With the content of the videos in this youtube channel, the aim is to: Update information about dRep to the community. Interview dReps to share what they want to bring to Catalyst by becoming a dRep for Catalyst. Interview voters to get dReps more information about voter aspirations. This proposal I believe can scale to address future challenges. dReps can share what they want to bring back to the community and Catalyst through dRep. The community can choose dRep to delegate their votes. For the clarity of this proposal, I rate it 5*.\n", "q0r": 5, "q1": "Those who will work on the project include Anh Quang Daniel - English Teacher and Translator in Vietnam: CA fund 7.8 with 7 years of experience as an English teacher and interpreter. Ms. Hannah - Administrator CA community fund 6,7,8.Cardano Community Founder (40,000 followers). Having experience in blockchain financial research and investment since 2017. Together with VietCore Team: A group specializing in project evaluation and information sharing of projects on Cardano and other blockchain platforms. Youtube channel with more than 500 subscribers. The proponent also provided a budget breakdown with a total working time: of 280 hours / 6 months. Cost: 60 $ / hour. Total cost: $16,800, but I think if the proponent could provide a little more information on the budget it would give us a deeper understanding of the budget needed. For example, can the proposer be more specific about the cost, what is that cost used for? But besides that, the proponent provides a detailed plan, including progress and milestones, with a timeline of 6 months. (First month: (working time: 60 hours)\n1 Video Introducing dRep to voters\n1 Video How to become dRep\n2 Video interviews with dRep and the remaining 5 months are all clearly outlined). According to the proponent, the main risks that could prevent a successful project implementation are that dRep is still a very new role in Catalyst. There is very little documentation on dRep. Therefore, there is still not much information about dRep to make video tutorials and share information about dRep. With the feasibility of this project, I feel very good and I rate it 5*.\n\n\n", "q1r": 5, "q2": "I think the clarity of this project is very good, as I said in terms of feasibility the project roadmap is done in 6 months with milestones and timelines to achieve. When implementing the project, will bring success as follows: Youtube channel has at least 200 subscribers after 6 months. The video has at least 100 views. The number of dRep participating in Catalyst increases (at least 20 will become dRep after participating or watching our interviews). dRep can get more authorizations from ADA holders. The proposal provides a clear and understandable description of the targeted problem. I rate the clarity of this project 5*.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 13656, "q0": "Being a dRep is what I really want. For this proposal, they will help dReps get more support from voters which is a great thing. If I wanted to be a dRep, I would likely have to rely heavily on the author and the support team to get them to help spread the word about my abilities to voters.\nI like the idea and this proposal will thoroughly solve the problems posed by the Challenge.", "q0r": 5, "q1": "Information about the experience and skills of the proposed members is very complete. Their experience and skills are well suited to completing this proposal if funded.\nI was impressed with their ability to detail every issue they brought to address the challenge posed. Everything is presented in great detail.", "q1r": 5, "q2": "The information that the author provides makes me quite satisfied. I just feel inadequate in the role of a member with skills in content creation, script writing and video editing. They should add more about this missing member. I think they will outsource the video editing and they should be clear about that plan.\nI found that to be the only problem. I will rate 4 stars for this part.", "q2r": 4, "assessor": "z_assessor_3717", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 14022, "q0": "The idea to create a Youtube channel for conducting interviews among people who yearn to be dRep then recording the answers which will include the experience of the interviewees, how can they evaluate the proposal, their knowledge, etc. seems simple but much meaningful. This would let voters know more about the one they admire with the proposal and maybe can catch the mindset of that dRep and if they feel the matching between their mindset and the proposers/dRep, the voting for that dRep is definitely possible. I think this proposal meets the requirement of the challenge which is offered by “dRep improvement and onboarding”. All the voters can easily access the published videos via Youtube and enjoy the understandable and intriguing content of those videos since they would be translated from English to Vietnamese and vice versa. Moreover, this proposal is also a spirit bridge for voters and dRep and attracts more and more dReps to Catalyst with plentiful novel proposals to contribute to the development of the community.", "q0r": 5, "q1": "As we can easily verify and give the evaluation for this proposal based on those descriptions about the “route”, budget analysis, and the team's members’ profile. First, to verify the reliability of this proposal whether it will succeed or fail, we can take a deep look into the team member’s profile. I think they have a quite diversified experience about blockchain and used to perform the Community Advisor role for at least 1 year. On the other hand, the proposer provided a quite clear plan and in detail for sure about how a video will be produced and forecast the needed time for the final product and public it on Youtube. They also forecast how many hours in total and then come up with the corresponding expenditures as wage from the fund. Perspectively, this is a very visualized description to confirm the feasibility of the project.", "q1r": 5, "q2": "Generally, we can follow the proposal and evaluate whether that achievement can be seen as a success during the process. The proposer will provide a statistical measurement about the total views, reactions, and comments in each published video and gather the total subscribers after a time conducting the proposer. It would be obvious for us to see how much development of our community and also how effective the proposal is based on the number of new registrations dRep in Catalyst.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14795, "q0": "dRep is a new role in Catalyst so it's important to help dReps get access to the voters who delegate to dRep.\nCreating videos to connect dReps with voters is a great way for voters to learn more about the dReps they delegate. dReps also have a better chance of reaching out to voters. In addition, dRep can also share its knowledge, skills and vision to help develop Cardano. Voters can rely on the shares of dReps to better understand the dReps they want to delegate.\nThese shared videos are also made multilingual (English and Vietnamese). This can help Vietnamese-speaking voters also connect with English-speaking dReps. Those dReps who do not speak English well can still reach English-speaking voters.\nThis Proposal can completely help Catalyst increase the number of dRep. Because many people watching the video might want to be dRep. These videos also help dRep get more delegation.\nVoters who don't know about dRep will also know more about dRep through these videos", "q0r": 5, "q1": "Proposal's team has a youtube channel sharing Cardano and Blockchain knowledge (including videos about Catalyst) with over 500 subscribers which is a clear proof of the team's ability to make videos.\nI love that the proposal's team fully lists the contents of the videos that the proposal will make. The dRep interview videos also feature very real and specific questions. The introductory videos about dRep also have specific and important content so that everyone can understand what dRep is, how to become a dRep, how to delegate vote for dRep, benefits of dRep and voter when delegating to dRep what.\nI look forward to watching these videos to get a deeper understanding of dRep.\nThe tasks of the proposal are also clearly listed in the detailed plan along with the execution time for each task.\nI watched a few videos in the team's youtube channel. I have no doubt about the team's ability to complete this proposal", "q1r": 5, "q2": "The proposal implementation process and the results of the proposal are completely measurable through the number of videos made, the number of views, subscribers, likes, comments, .....\nProposal's team has also set out specific goals that these dRep video interviews can achieve. \"At least 200 subscribers after 6 months. Videos have at least 100 views. The number of dRep participate in Catalyst increase (at least 20 people will become dRep after join or watch our interviews)\"\nThe number of voter delegates their vote to dRep on channel is also an important indicator to know the effectiveness of the videos.\nFeedback and ideas from viewers' comments will also help the proposal develop further in the future as well as demonstrate the impact of the proposal to voters.", "q2r": 5, "assessor": "z_assessor_4100", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14802, "q0": "- Knowledge videos are always necessary for the development of the community because when the community has the right knowledge about blockchain, they will take advantage of its advantages. If the community only cares about the price of tokens and coins, they will only care about the immediate benefits without contributing to the development of a blockchain platform. Therefore, knowledge materials and videos are always essential for the development of community knowledge.\n- In Vietnam, there are not many videos related to blockchain knowledge, so this proposal can help increase the number of knowledge videos in Vietnamese. Thereby helping to develop Vietnamese awareness about blockchain and Cardano more.\n- The content of the videos of the proposal contains very important knowledge for those who want to invest and research blockchain as well as Cardano.", "q0r": 5, "q1": "- In the detailed plan section of this proposal, the team showed specifically what the content of the videos will be implemented. The tasks that perform each video are also shown in great detail. The time to perform each task is also fully calculated by the team.\n- 4 videos a month (1 video/week) is workable for the team. The team will have enough time to perform the tasks and market the videos to the community.\n- Because the team has shown the proposal implementation plan in a very detailed way about the time to perform specific tasks. So the budget breakdown of the proposal is also very clear with the cost calculated by the hour.\n- All team members have relevant experience with the tasks in the detailed plan. Mr. Quang Daniel has 7 years of experience in teaching English and translating English. So he can afford to do subtitles or interview dReps. Ms. Hannah is the admin of a community of more than 40,000 members so she can execute marketing tasks effectively. Members of VietCore Team also have a lot of experience in sharing knowledge with the community.", "q1r": 5, "q2": "- The weekly dRep interview videos uploaded to the team's youtube channel are a very easy way to measure the process and results of the proposal.\n- Metrics such as views, comments, shares, likes, and subscribers can be used to measure the impact of videos.\n- The goals of the proposal in terms of subscribers and views are achievable and measurable.\n- Proposal also shows a goal that can directly impact the growth of dRep, which is the number of people who will become dRep after participating in interviews or watching videos of this youtube channel. These metrics are completely measurable.", "q2r": 5, "assessor": "z_assessor_4101", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We will create a Youtube channel to interview dReps. dReps can share what they want to bring to the community and Catalyst through dRep. The community can choose dRep to delegate their vote.", "experience": "A youtube channel about Cardano and blockchain knowledge with more than 500 subscribers\nWe have been CAs and vCAs since fund 7\nAdmin of 2 communities about Cardano\nWe have the experience of sharing a lot of knowledge on the zoom meeting for the Cardano communities in Vietnam"}