{"id": 421554, "author": "vct", "title": "References for dRep", "url": "https://cardano.ideascale.com/a/dtd/421554-48088", "category": 26601, "amount": 15000, "description": "dRep are the people who have a great influence on the community . But many dRep do not have enough knowledge, experience and time to fully assess the proposals in different challenges.", "f6_no_assessments": 9, "f6_rating": 4.703703703703703, "videos": [], "media": [], "f6_assessments": [{"id": 2595, "q0": "Proponents raise the problem that many dReps do not have enough knowledge, experience, and time to fully evaluate proposals in different challenges. The proposed solution is to provide a reference to help those dReps who do not have much experience, knowledge and time can refer to make voting decisions easier and more accurate. this is good for new Dreps it will help raise the bar for influencers, KOLs and community admins who don't have a lot of experience, time and knowledge in the early stages. thereby encouraging newcomers to help them feel more confident when joining the dRep role. Obviously, this meets the goal of the challenge.", "q0r": 5, "q1": "The proponent provided information about the proposer group including Ms. Hannah and Vietcore team. However, with the information the proponent provides, I don't see her providing what their job position is? although I can imagine she will be the project manager, and the Vietcore team of 10 members will do the work of evaluating the proposal. However, according to the roadmap announced by the proponents during the QA review round within 14 days, they will evaluate 1000 proposals. corresponds to an average of 1 person rating 100 projects. a relatively large number. I asked her to provide more clarification on what criteria these assessments will follow? as she paraphrases in the proposal \"our assessments are independent of the proposal's score in the Governance phase\". In the planning section, she laid out a roadmap to conduct a review of the proposals in the governance phase of fund 9 with 500 reviews in the first month. and as mentioned above with fund 10 they will do 1000 reviews in the QA review round. Finally, on the budget, she detailed the cost of 1 review as $10. With this budget, I think it's reasonable. In summary the feasibility of the proposal is good but it will be more complete with the improvements I provide", "q1r": 5, "q2": "The auditability of the proposal is complete, we know what the outcome should be, what the success of the proposal is and we also know where and when to update that result. summarizes the testability of the proposal fully tested by the community.", "q2r": 5, "assessor": "z_assessor_2323", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 4630, "q0": "You make recommendations on references to dReps because they recognize the problem many dRep do not have enough knowledge, experience and time to fully evaluate the proposals in various challenges. The proposal raises the issue in line with the Challenge, which speaks to the current state of dReps. The number of proposals increases so much and rapidly in each fund that dReps do not have enough time, knowledge and experience to evaluate all proposals. Your proposal to create a trove of documents for reference dReps to vote on, which solves two challenge problems: making it easier for many people to become dRep, convincing people to delegate without much time, experience and knowledge. The proposal team has created a database of references that give dReps more information to evaluate recommendations and improve the quality of accurate decision-making at each fund to address Challenge's questions about creating content and tools that make it easier for dRep to perform its tasks. Your archive of documents will be implemented continuously according to catalyst development so the proposal will be able to scale in the future along with the growth of Catalyst. \nThe proposal provides a solution to this problem by creating references to proposals in each fund to help dReps who do not have much experience, knowledge and time can refer to make voting decisions easier and more accurate. This is the logical and appropriate argument that the proposal has made. The proposal also recognizes the risks of doing so that the reference can increase focus if too many dReps use the same reference without making individual reviews. The second risk the proposing team found that the reviews in this reference were subjective because they were based on the reviewer's experience and knowledge. The proposed group also offers a solution to the first risk of making the reference public so that the community can compare with the voting decisions and reasonable evaluation of dRep. The solution that the proposal offers to overcome the second risk is to make recommendations for dReps to use this document only for reference, the evaluation decision of the same must be based on the opinion of the dRep.\nI fully agree with your project, the repository of documents that the proposal creates will help not only the dRep but also the other participants of Catalyst. This has a huge impact on the Catalyst community. My score in this section is 5.\n", "q0r": 5, "q1": "The proposal defines the timeline according to each stage of work and according to catalyst's fund-by-fund schedule. This is a reasonable timeline in which the proposal sets out specific goals in the first month of fund management phase 9, which proposes to evaluate 500 proposals as initial references and then share them with the community of ADA holders. The second goal is made at the fund 1 in 14 days, the proposing team will evaluate and give a score of 1000 proposals then conduct a survey of the dRep on the quality of references for editing and development for the next fund. These developments of the project were shared publicly by the proposed team on the Goolge Sheet. \nThe proposal's funding budget of $15,000 represents 10% of Challenge's. The budget plan of the project is based on the number of completed assessments, I find this spending plan reasonable. The project has not yet come up with a budget plan for example due to the price fluctuations of the ADA or due to current inflation, the amount paid for each assessment will increase. \nThe proposed group consists of 1 known member and 10 members of VietCore Team. If the details of a member's experience are in line with their duties and experience, the task group has not assigned tasks and provided specific information to the remaining members. Hannah's identity can be verified on Telegram. As I know, this is one of the three recommendations of Vietcore Team, you have a Youtube channel with 500 subscribers and a Facebook fanpage page for the ADA community in Vietnam with nearly 50k followers, your proposal will be made at the next fund so you should provide the identity information of at least one or a few successful representatives. team members at the proposals to meet the implementation of the project while supporting the proposing team at catalyst's other proposals. The proposed group has no proof of certification or intellectual property. \nThe proposal lacks a contingency budget plan and no information channel to authenticate the identity of the group of project participants, causing the implementation of the project to be reduced. I give this part 3 points.\n", "q1r": 3, "q2": "The proposal provides indicators that measure the success of the project including the number of dRep participating in Catalyst increases when using the project's documentation. The second successful measurement index that proposes to carry out the survey is that 80% of dRep are satisfied when referencing the document. The process of implementing the project is easily checked on Google Sheet as shown by the number of reviews that the team has made. The proposing team describes the success of the project specifically as follows as follows at least 20 people who will become dRep after using the reference, the second success being described as easier and more accurate voting dReps. These are successes related to challenges. \nThe proposing team does not yet have a test product, this is a completely new project of the proposing team. However, you have a review of some of Cardano's projects on the YouTube channel of the fairly clear and detailed such as Cardax project, Sundaeswap, Liqwid Finance.... This makes the transparency of the proposal more valuable.\nThis is a good proposal for the Catalyst community, encouraging more dReps to participate and making the Cardano network more decentralized in evaluating and deciding on the selection of projects. My rating for this part is 5.\n", "q2r": 5, "assessor": "z_assessor_2576", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5687, "q0": "The novel nature of drep makes it open to so much opportunities to the Cardano ecosystem. This a project that focuses on streamlining the drep initiative, with emphasis on simplifying the proposals to present an accurate view of the potential of each project. This would definitely help serve as assistive tool to aid Dreps have a better perspective of each project so as to make more rational decisions on each project. The existing system, though could significantly in its first deployment phase in fund 9, in my view , this project could complement the existing system. However, I think the project needs a little clarification and restructuring. For instance, what happens when the result from the reference is different from the project score from the governance phase? Again, the proposer doesn’t provide clarity on how to create awareness to the target audience on this project when funded.", "q0r": 4, "q1": "The information provided doesn’t convince me on the feasibility of the projeAn analysis of the project shows a team with a composition of 3 members who have experience not only within the ecosystem but also experts in project evaluation and information sharing in project catalyst. From the external links provided, I could only confirm the details of VietCore Team. For Ms Hannah her link is not accessible. The inaccessibility of Ms Hannah can affect the credibility of the team, if not rectified. ct. Also, a well structured roadmap,  detailing the tasks to be done within a specified timeline, improves and enhances the outlook of the feasibility of the project. Apart from that, I prefer a more detailed budget allocation for the project. I also wish the team gives specific breakdown on how to use funded resources during this period. The team could refine the proposal to reflect the cost of any miscellaneous cost, marketing cost  (to create awareness for the project) and the cost of content creation which are absent here. I support the idea behind this project but I believe the team could redesign the feasibility to reflect the concerns raise here. ", "q1r": 4, "q2": "Aside the absence of specific milestones, the proponent gives enough materials to audit the proposal, including a  detailed roadmap and KPIs, that allows us to track the project’s performance. It worth noting that, though the KPIs are more qualitative, they are simplified to help monitor and track the progress and success of the project. Additionally, the willingness to make available to the community, information on the progress and success of the project indicates the transparency and openness of the team.", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6045, "q0": "I think this idea is necessary to complement the building of a quality dRep community. The idea here is to create a tool that aggregates reviews and scores from 1,000 proposals in Fund10, and dRep will use this data to make a decision to vote for the project they feel is the best. This will help dReps save time when they can skip the project re-evaluation steps, thereby focusing more on calling for a delegation from the community. Help increase the number of dRep and become a dRep becomes easier.", "q0r": 5, "q1": "The possibility of implementing the idea mentioned in the Impact section is high because the proposer has experience in Fund7 and Fund8 as a Community Advisor (CA), and also organizes meetings via Zoom to share knowledge with the Cardano community in Vietnam. In addition, the cost of doing each review is about 10$/post, which I think is suitable for the effort spent to make the review synthesis. price.", "q1r": 5, "q2": "In general, the audit of this proposal is quite easy to do. The proposer will publicly share the google sheet file with the community and besides that, the number of new dRep is verified through surveys. I have a small suggestion to make the proposal more specific is to add more information about the vietcore group, and links to each person's profile page.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 9357, "q0": "Proposing to help the Vietnamese community dRep more in Vietnam. Because I understand that the development of DREP is aimed at encouraging participants to appreciate internet platforms. At the same time help maintain their own reputation. Because users with high reputation characteristics are most likely to accumulate a relatively higher quality of reputation. And achieve commensurate economic rewards. Developing Drep for everyone to understand will help increase the amount of dRep, increase the number of PAs and vPA in Vietnam, and increase the volume and quality of Voter. The proposal highlights the value of contributing to Catalyst in this Fund 9.", "q0r": 5, "q1": "\"With your suggestions, I find your detailed plan reasonable. About the members, the executor is an experienced proponent who also has a lot of followers and who does the VietCore Team include? You should list them clearly. Because this is a project mainly to help Vietnamese people better understand dRep in Vietnamese, and the proposed audience is Vietnamese, has a lot of experience in Catalyst, and is a very active member. Therefore I think the project will perform well.\nIn terms of funding, all expenses are listed in general, not divided into specific hours of work. You should be a little more specific about this part.\"", "q1r": 4, "q2": "Your route simply uses the public link of the google sheet, this is easy to understand, easy to follow. You should always leave the link below. Measuring the success of your project also has a specific number of participants. Besides, the positive evaluation when using Drep references is also the success of your team when providing useful documents. Hope you guys will make this project well in practice.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12584, "q0": "The problem that the proposed challenge needs to be solved is that dReps are big influencers in the community. But many dReps do not have the knowledge, experience, and time to fully evaluate proposals in different challenges. The problem proposed by the proponent is relevant to the problem situation. The team's solution is towards accuracy in the decisions of the authority, dReps does not require too much time, knowledge, and experience. Therefore, almost anyone can become a dReps if they can convince people to authorize it. So the team created a reference to the proposals in each fund to give dReps the ability to call on a community of delegates but without the experience, time, and knowledge. dReps can refer to this document to make correct voting decisions. I completely agree with this suggestion.", "q0r": 5, "q1": "The project implementation team includes the VietCore Team: A group specializing in project evaluation and information sharing of projects on Cardano and other blockchain platforms. Youtube channel with more than 500 subscribers: (10 people) and Ms. Hannah - Community administrator of CA fund 6,7,8. Founder of Cardano Community (40,000 followers). The team has a lot of experience sharing a lot of knowledge about the Zoom meeting for the Cardano community in Vietnam. Regarding the budget, the project proponent is given a specific required budget of 15,000 USD, but about the budget, I find the proposer's proposal is still a bit vague, if the proposer can give details This budget by timeline can be 1 week or 2 weeks and then I will summarize ... About the implementation program is still quite dreamy, I don't know when it takes place and ends? The proponent is also presented with the main risks that may prevent the successful implementation of the specified project. Above, I rate this project quite well but if it can be improved better from my comments, I rate it 4 *.", "q1r": 4, "q2": "According to the word in terms of feasibility, the project implementation roadmap to reach the given success milestone is quite vague, the proponent needs to improve this issue to make the project better. Moreover, I also Could not track your easily when the project is done. When the project is done indicates the success of this proposal: The number of dReps participating in Catalyst will increase thanks to this reference. The goal is that at least 20 people will become dReps after using this reference. The dReps will vote more easily and accurately.", "q2r": 4, "assessor": "z_assessor_3438", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14021, "q0": "I think this proposal is really practical and essential. Since it offers a useful tool for dRep to gather and pre-evaluate whether that project is suitable and meet the requirements that are set up by Fund10, and then come up with the decision whether to choose or eliminate that project base on a specific evaluation scale and figure out which proposals/ projects are similar to the aims of Fund10 among 1000 submitted projects. They also answer in specific about which barriers or risks that may affect the success of the proposal and give solutions that I think that those two ones are really reasonable with the proposer explanation. Therefore, it is obvious to see the positive and potential effect of this proposal. Moreover, if this proposal is successful, it will raise the quality of nearly all the later submitted proposals. Therefore, dRep can pass through those manual evaluating steps and focus on building the quality of a dRep community to become more sustainable.", "q0r": 5, "q1": "I do appreciate the possibility of this proposal since the description of the budgeted plan and the participants in this proposal are reliable and quite specific. The members in this team have such diverse experience in a lot of fields. For example youtuber of a related to Cardano channel with attracting more than 500 subscribers. They also used to join CAs and vCAs since fund7 and also used to have a sharing knowledge workshop via Zoom with the content about Cardano communities in Viet Nam. By the way, there is a little suggestion that if possible, please attach more information about the vietcore with the link to each member’s profile. They also provide the level of the evaluating procedure via Google sheet with a description for each level so that we can know the accepted/rejected proposals are in which level. Then, there are also the KPI and milestones in order to visualize how successful this project is. ", "q1r": 5, "q2": "This is entirely a new proposal, but it is obvious to see how well - preparation it is. Anyway, the auditability of this proposal is quite easy to follow and conduct. The base for successful or failed evaluation is the number of assessed proposals. Therefore, I think it is not difficult or complicated for people on Cardano to follow and believe in its capacity.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 14794, "q0": "dRep is a very new role in Catalyst that will be added to Catalyst in the future. Therefore, there is not much documentation available for dReps at present. It would be difficult for Catalyst to get a lot of dRep without references or people with experience working on dRep documentation.\nReferences like these are a great way to help those who don't have a lot of experience, knowledge, and time to join as a Catalyst dRep. Because, without reviews from experienced people, dRep would have to spend a lot of time and effort doing its job without knowing where to consult.\nThis Proposal can help Catalyst increase the number of dRep because there will be many people who do not have much experience, knowledge and time can still participate in becoming dRep.\nThe dReps are also able to make more accurate voting decisions because they gain additional perspectives from many other people who have made this reference.\nProposal also mentioned possible risks when implementing this proposal such as centralization and 100% copying of dReps. The solutions for these risks are also very reasonable", "q0r": 5, "q1": "Proposal's team has 2 ADA holder communities with a fairly large number of members (more than 50,000 members).\nThe detailed plan of the proposal is also very specific about the number of proposals that will be assessed in each phase.\nMaybe in the fund 10 dRep will be applied to Catalyst. Therefore, the team's evaluation of 500 proposals of fund 9 in the first month to share with the communities and prove the reliability of the reference is a great way to convince dReps to use the resource in the future.\nIn fund 10 proposal's team also do independent evaluation with PAs and vPA is also very reasonable to get independent results. This makes it possible for dRep to both refer to the PA's score for the proposal but still have independent evaluation points. dRep will derive more objective assessments from these sources of information.\nBudget breakdown is really clear with number of assessmets will be made and cost of an assessment\nProposal's team has 11 people doing these reviews, these 11 members are PAs of the funds so the evaluation of proposals will also be faster because they have read the proposals and done the assessments in the PA's round.", "q1r": 5, "q2": "This reference made on google sheets is a very easy way to measure the progress of the proposal. Anyone with the link of the reference can audit the proposal's team's results and progress.\nThe goal of the proposal is to help 20 people who become dRep after accessing this reference can audit by creating a form for dRep when registering dRep (Who referred you to become dRep?)\nThe goal of 80% dRep satisfied with this reference can also be audited by creating surveys for dRep who have used the reference.", "q2r": 5, "assessor": "z_assessor_4100", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14801, "q0": "- Creating video interviews with dReps is a great idea to help dReps reach more ADA holders. This will greatly assist dReps to get more delegation from ADA holders.\n- ADA holders can also easily choose the dReps that are right for them because dReps have the opportunity to share more about their knowledge, experience and vision for Cardano.\n- In the first month, the team also made 2 videos introducing dRep to the community. These videos can help more people know about dRep and join becoming dReps or delegators.\n- The videos in this channel are made in 2 languages, English and Vietnamese. So it can help reach both English and Vietnamese speaking communities. This helps increase the diversity of dRep and reach out to more communities.\n- Those who want to become dRep can gain a lot of knowledge and experience when listening to the sharing of other dRep on this youtube channel\n- ADA holders can interact with dReps by commenting below videos. This is also a great way for dReps to get to know their delegators better.\n- In the future, the team should combine with people who have experience in translating in different languages ​​to be able to make more subtitles for these videos. This will make it possible for many other non-English speaking communities to also participate in dRep", "q0r": 5, "q1": "- The KPI and Plan of the proposal are very reasonable. The 4 points of this reference are very clear so that dReps can take actions to vote or not vote or vote no for the proposal.\n- Evaluating the first 500 proposals to increase the persuasion of dRep and making marketing materials for this document to the community is very reasonable.\n- Since the team members are all experienced in PA and vPA, they can fully evaluate the proposals quickly because they have evaluated the proposals in the Assess round of Catalyst\n- Team members are also experienced in evaluating blockchain projects and projects on Cardano (the team's sharing sessions can be seen through the team's youtube channel). This is a great proof of the team's ability to implement this proposal\n- With the number of 11 members, the team completely has enough resources to implement this proposal.", "q1r": 5, "q2": "- The results and implementation process of this proposal can be easily measured through the number of proposals that the team has scored and evaluated. All this information is public on google sheet.\n- The team has also given the goal that the proposal will achieve after bringing this reference to the dRep: \"at least 20 people will become dRep after using this reference\"\nCreating dRep surveys to measure reference effectiveness is also a great way to measure the effectiveness of a proposal against dReps.", "q2r": 5, "assessor": "z_assessor_4101", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "We make a reference to help dReps who do not have much experience, knowledge and time. They can refer to make voting decisions easier and more accurate", "experience": "A youtube channel about Cardano and blockchain knowledge with more than 500 subscribers\nWe have been CAs and vCAs since fund 7\nAdmin of 2 communities about Cardano\nWe have the experience of sharing a lot of knowledge on the zoom meeting for the Cardano communities in Vietnam"}