{"id": 422147, "author": "pocketkristin", "title": "Create a dReps' Equity Resource Hub", "url": "https://cardano.ideascale.com/a/dtd/422147-48088", "category": 26601, "amount": 25000, "description": "Fairness, particularly in permissionless and diverse communities, doesn’t occur organically. Without proper resources, even the best of dReps may unknowingly disenfranchise its marginalized members. ", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 5353, "q0": "The create a dRep's equity Resource Hub proposal is building Equity Resource Hub to empower dReps & Catalyst members with knowledge about bias & equity and to provide them with tools & resources on cognitive fallacies. This proposal will encourage participants to take the Harvard Implicit Association Test to provide their awareness of their personal level of bias. They will later share and reflect on this unique experience to practice and reinforce the lessons learned. These training resources will be available (at will) for the whole community and encouraged for elected dReps. Upon completion, members will have a verfied CNFT ad DID verified credential. The proposal fits the dRep improvement and Onboarding challenge quite well as it helps to encourage deligation participation rate and the tool might aid dRep to vote without biasness. The team does not explain why the Harvard Implicit Association Test is selected for participants in their program and it is unclear how this test will help to promote the equity and empathy. There is no link provided for the test but this Harvard Implicit Association Test is the way to realize unconscious bias. There is no proof of the test benefit and among many resources in the community, it might be a challenge for ones to take the test and to go through the exercise. However, the team explains the possible ways to sort out the issues in case of low participation. ", "q0r": 4, "q1": "The project contains 4 phases and spread over 6-9 months: Phase 1 the team will lay the curriculum foundation and find content creators. Phase 2. They will develop workbook, workshop and training. Develop bounties with Snapbrillia and post content on their platform. Phase 3: Equity resource hub launched Phase 4: Feedback survey and iterative improvement. The detailed budget breakdown covers the equity/unconscious bias experts however, the role of experts are not included in their detailed plan but the pay rate for these experts are at $200/hour. It leaves me the question as to which phase they are involved with this project in the timeline. The heristic team could be the experts the team mention in the proposal; however, it is not clear which stage they are involved with the project. It would be better for the proposer to specifically mention the heristic team involvement and input those details in the project milestone.", "q1r": 4, "q2": "The success of this proposal is to shed light on the bias so that there will be less harm to traditionally marginalized community members. They will know that they are successful in their mission with % of catalyst voting population is more informed in combating bias. The metrics the team provided are 20% of active users engaged in the equity resource hub, and more people to share their experience and conversation. As the proposal objective should be focusing on dRep improvement and onboarding but the metrics for this project is from the pool of active users (both dReps and non-dReps). The proposer team might need to inform back to the community after launching the dRep equity resource hub, how many participants are joining the hub and how many are active users of the platform for their bias training. Those might be more relevant metrics than the pool of active users as claimed by this proposal. ", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "The assessor’s rationale that “The team does not explain why the Harvard Implicit Association Test is selected for participants in their program and it is unclear how this test will help to promote the equity and empathy,” only addresses their concerns around this specific self-evaluation component of the proposal, not how the larger educational outcomes will be attained via the proposal for large-scale availability of educational resources on a number of topics related to inclusion and bias. Just a small component meant to reveal (often surprisingly) one’s own biases, the Harvard Implicit Association test will be incorporated to a much larger implementation of knowledge and reflection that the assessor may not realize.   \n\nBased on the comment: “The detailed budget breakdown covers the equity/unconscious bias experts however, the role of experts are not included in their detailed plan but the pay rate for these experts are at $200/hour. It leaves me the question as to which phase they are involved with this project in the timeline. The heristic team could be the experts the team mention in the proposal; however, it is not clear which stage they are involved with the project. It would be better for the proposer to specifically mention the heristic team involvement and input those details in the project milestone.” The assessor may not have realized that the expert consultant’s efforts would certainly be in the content creation & review phase of the proposal, as that is when this specific expertise in “equity/unconscious bias training” (as mentioned in the budget breakdown) would be useful. The assessor may be making an assumption that the heristic team would not participate in the entire project, despite co-authoring and writing this proposal, and expects to deliver on it as project managers at every step. \n\nThe assessor may not have understood that communications campaigns described in the risk assessment portion of the proposal would include metrics such as ““how many participants are joining the hub and how many are active users of the platform for their bias training,” delineating adoption of users, both dRep specifically and the larger community. \n"}, {"id": 5692, "q0": "The objective of achieving diversity of Dreps remain far from been achieved as far as I know. However, per my review of this project, I consider this project, a more inclusive and well structured approach towards addressing the challenge of diversity of Dreps. “The goal of the Equity Resource Hub will be to educate members of Catalyst on the topics of bias and equity; and to provide additional tools, activities, and resources to grow one’s knowledge of cognitive fallacies.” In respect of that, the team intends to engage and empower members on inclusiveness, so as to reduce biases by using workshops and virtual learning with the assistance of tools, activities, and resources to grow one’s awareness of cognitive biases. What’s the value addition to the Cardano ecosystem? Obviously, this initiative is aligned with the objective of the dRep improvement challenge setting of ensuring drep diversity. Again, this creates an avenue for knowledge acquisition to any individual new to the catalyst community and to the drep role. However, since the emphasis here is on preventing biases, what’s  the team’s strategy to make the platform  more language friendly, considering the biases to the English language? I suggest the team addresses this to enhance the overall framework of the project. Again, is there a marketing strategy? Well, it is a great attempt by the team to recognize or anticipate possible lack of interest as a risk and therefore outlines a clear marketing strategy to address it. However, aside the acquisition of certificates after each training,\n I prefer the team consider monetary learning incentive to attract more people to the project.", "q0r": 5, "q1": "Certainly, it is likely that this project would be implemented successfully considering the  available information provided on the roadmap, the team and budget of the project. From my analysis of the team experience, I see a comprehensive team composition of diverse people with backgrounds in various field of expertise. Clearly, this is a solid team with expertise and experience that would be relevant to the project. To confirm their transparency and professionalism towards achieving the goals set out for this project, the team supports their profile with all the appropriate links for any verification on their competence and expertise. Again, to complement the team experience, the proponent presents a detailed breakdown of activities to be undertaken along the roadmap to project completion. This comes with specific timeframes that demarcates when each activity would be done. At least per the structure, we know which activity start and which ends. More importantly, the proposer presents a  comprehensive and precise budget breakdown with specific allocation to each individual item. Are these prices accurate and moderate? Per my understanding of the market value of these items, I think the items are consistent with the prevailing market prices.", "q1r": 5, "q2": "As part of confirming their transparency and the accountability to the Cardano community , the proponent has I indicated the team’s readiness to make all report and feedback available to the community via town hall meetings and SWARM. Per the script, the  proposer has made available all relevant information for auditing. The detailed description of what the proposer intend to achieve with this project alongside its roadmap, shows a clear alignment with the overall objective and the KPIs provided. On how to measure the performance of the project, the proposer suggest indicators such as “the number of active users who have engaged with the Equity Resource Hub, whether instances of conversation around equity are on the rise and whether people are open to sharing their experiences”. With these parameters, we see a mixture of both quality and quantitative metrics which provides a clear mechanism  for monitoring and assessing the progress of the project. More especially, the proponents has assigned a 20% milestone to the quantitative KPI, just to simplify the assessment of the performance of the project. My only issue is, how would the proposer get the data on the metrics for measuring the progress and success of the project? ", "q2r": 5, "assessor": "z_assessor_2734", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 10995, "q0": "This proposal identifies the problem very clear and this is a very important project that could support and add value to the Cardano ecosystem. DReps and Catalyst voters definitely need the tools, safety, and support to learn. They need to have resources and also training to be able to function well. They also need an environment to talk about some theme and have some place for discussion. Keymetrics and goals of the proposal align with the challenge and it will be good for the future of Cardano ecosystem.", "q0r": 5, "q1": "Snapbrillia and the team have many experiences and solid to deliver this project. The timetable is realistic and achievable. The plan is well planned and I am confident that the team can deliver. The budget is reasonable and outlined clearly. All the risk has considered and addressed well. This proposal should be supported by the community and must be helpful for dRep and voters to be able to do their part well.", "q1r": 5, "q2": "This proposal has a very clear roadmap, well-thought metrics/KPIs, and also have a clear understandable description of the targeted problem that can be measured against the proposed outcomes. Community could also check the process of this project through snapbrillia social media, channel and community. ", "q2r": 5, "assessor": "z_assessor_3213", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Dear PA, Thank you for the very supportive assessment and for taking the time to review our proposal because you are doing a good thing for the community! As a proposer, we take your input to heart and appreciate all your constructive feedback. We hope to earn your vote! (https://linktr.ee/votesnapbrillia) Please approach us directly as we’d love to get in touch on our Discord (https://discord.com/invite/vJuPXu86vS) to resolve any questions or comments you had about this proposal. Again, I am extremely grateful for your time, effort, and expertise in reading fully through and rating our long proposal. Thank you so much again!"}, {"id": 14982, "q0": "The idea of the proposal is good, to create a hub aimed at educating and raising awareness among members of the Cardano community about prejudice, notions of equality, and thereby preventing some members of specific communities from being marginalized. In theory this would increase the quality of the dReps' work, and would meet the challenge's objectives. But I think there is a lack of detail regarding what would be done in practice, it is said that the dReps would be subjected to a survey that would make it clear that everyone suffers from prejudice and from that work would be done with workshops, virtual training, etc. But we don't know exactly what content is present in the resources, for example in \"we can beg members for the exercises necessary to take control of unconscious programming and create deeper empathy\". What would these exercises look like? I think the idea is in line with the challenge, but it could be explained more deeply.", "q0r": 4, "q1": "The script of the proposal is not bad, but it could improve in some points. Mainly in terms of temporality, the phases have very different durations: the first from 6 to 8 weeks and the second from 3 to 4 months. It would be better if we knew what would happen each month specifically. The budget is explained ok, the parts could be more detailed – for example the amount of 15 thousand dollars requested especially for content creation. It's a high value that should be more clear. Also in “various tools”. What would they be? The team part is the best part of feasibility, we know who the team members are in great detail, and we see that for example Frank Albanese already has experience with the cryptographic world. Despite this it is not clear if anyone already has experience with Cardano itself, with our blockchain this is also important.", "q1r": 4, "q2": "The proposal is auditable, in terms of progress we have good assurance that the Cardano community will have constant updates on what is being done: it is said that online meetings will be held after the town halls at least once a month. We also have partial success metrics, that is, we know what would be debated in those moments. Speaking of ultimate success, we know what is expected: “clarifying prejudice to influence harm reduction for those traditionally marginalized by prejudice”. But how can we be sure that the community has absorbed the project well and is making a correct and effective use of this knowledge? In my view, one more observation was in order, a further research with quantitative and qualitative data to prove the practical effects of this initiative. In general we have clear ways of monitoring the project, although some improvements are interesting.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15180, "q0": "The team wants to design and implement an Equity Resource Hub for dReps to educate and raise awareness regarding unintentional bias when serving a diverse community. By providing tools, workshops and resources for learning, this type of behaviour will possibly be mitigated as much as possible.\nHowever, the way it was designed, the dReps will get to learn hands-on that their decisions are biased or “wrong” by gaining or losing delegators and thus being rendered powerful or powerless in the voting decision.\nHowever, I see how the wheels could be set in motion by creating a place that encourages thinking outside the box, therefore, even though I don’t highly agree with the impact this proposal could have on the ecosystem, I agree that it is well fitted in the challenge and if voted, it could create a positive action throughout the community. As such, I will rate this section a 4.", "q0r": 4, "q1": "The implementation plan is very detailed. It’s split into 4 distinct phases, each lasting a specific number of weeks. The first phase will deal with laying the foundation of the curriculum and will last 6-8 weeks, the second will deal with content creation & platform development and will last 3-4 months. The third will be spent with the product launch and will take about 2-3 weeks and the last is for feedback gathering and that will take 1-2 months. The timeline specified is well drafted, and the team is not in a rush to push their project to completion. The budget of $25000 is not very detailed, unfortunately. I would have liked to see more in regards to content creation and why $15000 is needed for this task and what exactly it will generate.\nHowever, the team working on this project has provided us with details on their skills and attached links to third-party websites to get a second look at their previous works. From what I was able to gather, they look to be up to the task and appreciate the level of information they have provided us with.\nBesides the omission from the budget section, I see no other information missing, as such I will rate this section a 4.", "q1r": 4, "q2": "The team is meticulous in their project’s progress tracking. They plan to measure their completed tasks daily and will communicate with the community through the After Town Halls twice a month and also on their discord server that is open to anyone in the community. This level of transparency is highly appreciated and makes their proposal highly auditable.\nTheir success vision is described in detail and some have clear numbers: 20% of active users have engaged with the Hub is one of those examples. I would have liked to see other metrics having such a level of granularity included, but considering the details provided otherwise throughout the proposal, I don’t see these affecting the audibility of the proposal in any way. In conclusion, I will rate this section a 5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Develop Equity Resource Hub to empower dReps & Catalyst members with knowledge on topics of bias and equity; to provide tools, activities, and resources to grow one’s awareness of cognitive fallacies.", "experience": "DEI and Talent Retention Specialists with a combined 17 years of experience in guiding organizations towards inclusive, healthy cultures. Experts in scaling startup ecosystems within remote & diverse organizations. Supported by a diverse team of AI and Blockchain-funded founders."}