{"id": 423010, "author": "zabelinaarina", "title": "Role interaction studies in Cardano", "url": "https://cardano.ideascale.com/a/dtd/423010-48088", "category": 26601, "amount": 40000, "description": "Voting in the Cardano system needs to be revised, since a significant part of the participants vote randomly, and the largest part of the platform participants do not vote at all.", "f6_no_assessments": 7, "f6_rating": 2.619047619047619, "videos": [], "media": [], "f6_assessments": [{"id": 523, "q0": "A \"full-fledged research work describing how the distribution of the roles of platform participants and the connections between them affect the work of funds\" is a great idea on its face, but I'm having trouble seeing how it improves dRep participation or diversity. If it does, the proposal does not make a strong case. \n\nThe proposal claim that the challenge states that \"Cardano has a big problem with the correctness of the evaluation of proposals.\" This statement is nowhere in the \"F9: dRep improvement and onboarding\" challenge brief. \n\nI believe this proposal was posted to the incorrect challenge and will not have the impact the challenge is intending.  ", "q0r": 1, "q1": "A \"full-fledged research work describing how the distribution of the roles of platform participants and the connections between them affect the work of funds\" is a great idea on its face, but I'm having trouble seeing how it improves dRep participation or diversity. If it does, the proposal does not make a strong case. \n\nThe proposal claim that the challenge states that \"Cardano has a big problem with the correctness of the evaluation of proposals.\" This statement is nowhere in the \"F9: dRep improvement and onboarding\" challenge brief. \n\nI believe this proposal was posted to the incorrect challenge and will not have the impact the challenge is intending.  ", "q1r": 1, "q2": "The proposal does not provide how it plan to measure the work of carrying out the study or how the community can follow along. Will there be field notes? Monthly updates? Anything to show work is being done? What work management tooling will your team use to help tell them if the project need to be abandoned or pivoted? \n\nThe proposal argues that perhaps the success indicator put forward by the challenge might be problem. That may or may not be the case but perhaps in the future focus on what indicators you might track and provide the community that will meet the intent of the challenge--better than the prescribed indicators. \n\nThe community has no way of auditing your proposal if you say the question is wrong but neglect to provide the community with better questions to ask and get the same job done. ", "q2r": 1, "assessor": "z_assessor_2098", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 1094, "q0": "As far as I know, the dRep role hasn’t even been clearly identified and structured. I have not submitted an application for it, as such, I am not part of the conversations and workshops surrounding this subject and I’m only making statements based on what is being publicly announced. Obviously, I have my own doubts regarding it, but, first of all, I’m curious to see how it evolves and if it will actually benefit the Cardano community. Why start this process with the assumption that it will be cheated and taken advantage of and set up rules and conditions based on speculations solely?\nBesides the more general idea behind the proposal, I have some doubts regarding some specific statements. A first example would be: “Based on this, we will build a more balanced model of the Cardano ecosystem, which does not allow to ignore the subjects of voting”. Missing any additional guidance, I’m not sure what is even implied here, is it that every Cardano holder would be forced to vote or is it something else? If that is the case, how can one force the holders to vote and what effect would that even have and how would it fit in the promise of web3?\nAnother example would be: “As stated in the challenge, Cardano has a big problem with the correctness of the evaluation of proposals.” I have read the challenge brief and nowhere is there a statement like this. The closest I could find was “(3) It is difficult for Catalyst users who are not necessarily skilled in technology and English to judge nearly 1,000 proposals.” The word correctness was not used, as such, I find that the statement has been distorted and paints a completely different picture of the state of the Cardano ecosystem. \nAnd the last example that I find unclear is “We need to consider alternative options, such as being able to swap auditors and proposers on a regular basis, giving them commensurate resources.” This statement has not been further developed, as such, I’m unclear on how proposers should be swapped on a regular basis, as that role cannot be taken away from a community member, just like the voter role couldn’t be. Therefore, there can be no rules regarding who can participate in that role or not.\nOverall, I find myself disagreeing with this proposal on too many levels and ideas and consider that at the moment, developing a system that the proposers are describing would be to the detriment of the experiment called Catalyst and to the rest of our free Cardano community.", "q0r": 2, "q1": "As a PA I check not only on what I understand from a proposal but also what voters might understand. For example, if any tools, models or research is being referenced in a proposal that the whole project is based on I think it’s completely necessary to have a short description of what it entails and why it’s important.\nI'm not familiar with the Eliott Jaques model being referenced in this section, and I imagine that some of the voters reading this proposal will not be as well. Therefore, I think it would have been helpful to have at least a couple of sentences explaining what the model is about and why has it been decided that it will be used for this project.\nFurthermore, I am also unclear on what kind of simulations will be made using AnyLogic, as the proposers haven’t provided any description of the tool and its importance. From what I was able to gather from the company’s website, is that this tool can provide “A synthetic population of simulated agents can be used to forecast  the urbanization of an area or study the effectiveness of healthcare policy proposals based on real-world data”. By reading this, I can go back to my statement from the impact section, where I wrote that we are too early and don’t have “real-world data” regarding dReps, but only speculation, as such, this tool cannot be properly utilised at the moment.\nI found the budget to be lacking any metrics describing the number of hours needed for each task and the hourly rate asked. The phases and roles placed in the table have no explanation attached, as such, I found it impossible to find any similar data.\nThe team description is also very short, we have been provided with two names, but without any further explanation of what their roles would be in the project. By looking at the website attached, I was able to gather some more details about the entire team of more than a dozen individuals, but the majority have no LinkedIn profiles attached to their photos, thus I was not able to verify if the pictured persons and their skills are real or not.\nAlthough the team has answered Yes to the question of having submitted other Catalyst proposals in this fund, they have not provided any further details or links about it, as was required in the submission form.\nDue to all these factors, I conclude that the lack of sufficient information keeps me from assessing the successful implementation of the project.", "q1r": 2, "q2": "While some of the statements in the auditability section do have a point, the proposers haven’t answered the simple question about how the progress of this proposal will be measured. They have provided a long paragraph stating that metrics are irrelevant and as such, have not provided any for their project. \nThe purpose of this question is to enable the Cardano Community to independently verify the advancement of the project independently of the proposers, with clearly defined metrics that would be submitted periodically in an open, public space.\nIn regards to the vision of success, “We will consider the balanced and actively growing Cardano Catalyst system as the absolute success of our project” is the entire answer to this question. I disagree with this statement, as the proposers are insinuating that the growth of the Catalyst ecosystem will be determined by the success of this proposal, which cannot be correlated and considering the fact that the ecosystem has been constantly growing for some time, would make it unfair to discredit the efforts done by the community to get where we are.", "q2r": 2, "assessor": "z_assessor_2192", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2601, "q0": "The proponent raised the issue that reflects the current situation of the voting system in Catalyst. According to statistics in the funds before the number of ADA participating in the vote was only about 12%, an extremely low figure. and most of the people who voted were not really serious. there are projects that aren't really good, but since it's suggested by a large community, and that community still votes for it, the project eventually takes away the better projects' chances of getting funding. The Proponents say they will address the issue by conducting a formal study describing how the role distribution of platform participants and their interrelationships affects the fund's work. I don't understand how this research will make it easier to diversify and more dReps to participate or integrate voters. I recommend the proponent analyze this clearly. Furthermore, to address the problem presented by the proposal, Catalyst provided the solution as dRep who will read the proposals, evaluate them, and vote on behalf of the authorized voters. and this challenge aims to improve dRep and introduce. I found no link between the goal of the proposal and the goal of the challenge. so I don't agree this suggestion would be suitable for the challenge.", "q0r": 2, "q1": "The team that proposed to provide details on who would work on the project was \" Pion Medvedeva and her team of YJ ontologists, Danila Medvedev, We will bring in outside experts - both our fellow innovation experts and Cardano enthusiasts.\" and claim to be ontologists and auditors of nonprofit organizations, as well as someone with experience in developing complex role models in game development. According to the proposed team link, Pion Medvedeva and Danila Medvedev are the two co-founders of YourJustice.life. This is a blockchain social network where anyone can create a virtual jurisdiction based on values ​​and enforced by code. With the above experience, I have no doubt they can research as stated. Regarding the plan to include progress and milestones for the proposal, the proponent provides information such as \"create an expanded model of the roles and relationships of Cardano actors\" I do not agree. that the proposer understands the content she is providing. here I hope she will provide information on how she will create this model? What are the steps? example research what are the roles in Catalyst,... will start the research process on September 1, 2022, and the research will end on September 30, 2022, for example. Regarding the proposed budget request amount of $40000, they provide a budget statement for modeling, validation, and implementation ontologist. Honestly looking at this budget statement I don't know what the proponent wanted to express. Finally, the author of the proposal, Ariana, stated \"Some participants have refused to work on the project. If the app has its name and the link cannot be changed, please delete the proposal or move it forward. it's in the archive\" I don't see the author's name in the list of project members. I don't know if she has a different name or removed her name from the project. In summary with incomplete and somewhat contradictory information. I object to the feasibility of this proposal.", "q1r": 1, "q2": "The auditability of the project is not available. I don't have any information on whether the milestones for achievement or any KPIs align with the goal of the challenge. With this proposal, I recommend the proponent redo it with complete information about the milestones to determine that the project is operating on schedule and with the results as promised. adds auditable information on key indicators to measure with quantitative numbers as well as qualitative indicators. in addition, they should provide additional ways in which the project will report its work on a weekly or monthly basis to the community, or to the IOG. in addition, the proponent should also clarify how this proposal will affect dRep. in general, this proposal is not testable.", "q2r": 1, "assessor": "z_assessor_2323", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4498, "q0": "I actually like this proposal a lot, but give it only 4 out of 5 stars as it should have been proposed in another challenge setting. Improving the Catalyst process and voting is not within the scope of onboarding and training the yet-to-be-created dRep role. Therefore, I think that this proposal by non-Cardano web3 enthusiasts at YourJustice.life may very well benefit Catalyst tremendously, but does not do a great job in addressing the challenge setting. It would have been very interesting to see this framed as a Cross Chain collaboration with slightly modified direction and scope, or even under Dapps/Products/Integrations under the \"Many others\" subcategory - in a way Catalyst is a Cardano product and crucial in shaping not just governance but also development through the efficiency of Catalyst voting and choosing the right proposals.\nI agree that this proposal has potential for great impact for Catalyst, but penalize the scoring slightly for asking for almost a quarter of dRep onboarding funds that it does relatively little to address intrinsically. ", "q0r": 4, "q1": "Providing a weblink does not replace the need for team profiles and completing of the form required in my opinion, so establishing a link and proof of connection to YourJustice.life and Ms Medvedeva would have been great in this section. \nThe budget breakdown is a google form link that shows payroll broken down by function, but not by individuals or timeline. Not enough has been done to assure the voter that the proposers are serious about bringing their craft to Cardano, and that this is not simply a single team member quickly filling in the request for funding on behalf of the team without the proper buy-in and commitment. Catalyst has many flaws that this project's proposed research may be able to address and correct, but its strength is in the community role and feedback mechanisms. It would have been favorable for my assessment of the project's feasibility if some connection with the Catalyst community had been undertaken prior to submitting the proposal. It would have further improved the impression of mission readiness had more information been shared about the implementation plan and team.", "q1r": 3, "q2": "The proposers ask poignant but somewhat sarcastic questions about the efficacy of challenge goals, demonstrating a slight misunderstanding of the Auditability category and do not provide relevant KPIs or worthwhile goals by themselves that they could be judged by. \nThe proposer claims connection to a team of people working with YourJustice.life, but does not provide proof of this link and no profile of themselves or how the philosophical research and the game theoretical part that is more relevant to Catalyst are dealt with in terms of team responsibilities, roadmap, timelines and milestones. Therefore, in its current form, the proposal is unlikely to be auditable, but may still produce very interesting and highly valuable findings for our community by bringing in a fresh perspective.", "q2r": 2, "assessor": "z_assessor_2554", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5697, "q0": "The proposer established clearly a real problem which to some extent necessitated the introduction of the Drep role. However, the proposer failed to provide a detailed solution that shows how it addresses the problem. In short, there is a disconnect between the problem and the solution. In my opinion, the proposed solution is a more generic approach  towards addressing the challenges in the voting process. Per the feedback from the catalyst community on the voting process, we all admit that there is consensus on the challenges in the voting process, hence the introduction of the drep role. I appreciate the idea  behind this project; the  focus per the script is to, “… carry out a full-fledged research work describing how the distribution of the roles of platform participants and the connections between them affect the work of funds”. Aside that, the proposer per the script, intends to “build a more balanced model of the Cardano ecosystem, which does not allow to ignore the subjects of voting”. Ultimately by focusing on this, the intended success per the script is to achieve a “…balanced and actively growing Cardano Catalyst system…” . The main questions here are , does this lead to many people being dReps? Does this lead to a high delegation participation rate? Does it lead to appropriate selection of dReps for delegation? Clearly, the proposer's description and success per the script doesn’t lead to achieving any of the above metric set for the success  of the drep improvement challenge setting. Therefore I think the proposer could restructure the project to reflect the objective of the drep improvement challenge setting or consider submitting this project into a different challenge setting.", "q0r": 2, "q1": "The information presented doesn’t suggest that the project would likely be carried out. On the roadmap, the proposers only presents activities to be undertaken toward project completion without any timelines. Based on the roadmap presented, we don’t know the work structure here. Which activity would start first? Would the activities be done in sequence as listed here or randomly or be done simultaneously? Additionally, when does the team expect the project to end? Ideally, a well-defined plan provides a clear work structured, specifying the start and end of a project. The absence of the roadmap makes it difficult to determine whether the project is progressing or stagnant. From the information of the team experience, it difficult to ascertain the extent of experience and expertise possessed by the team. I wish the team had provided a profile link in the absence of a detailed team experience. Considering the outlook of the project, the team should be able to justify why they’re qualified for this project. Apart from that, I think the budget is the only positive side of the feasibility section. A clear allocation is provide to each identifiable item. But I think the budget needs more details on some item budgeted for. However, per the script, the team fails to convince me that they would implement the  project successfully. Therefore I entreat the team to restructure the overall project to address these lapses.", "q1r": 2, "q2": "Taking into account the details given on the auditability of the project’s progress and success, the information provided is insufficient. The objective of the project as cited from the proposal is to\"... ensure a balanced and actively growing Cardano Catalyst system as the absolute success of our project\". From the aforementioned objective, we don't see any clear KPI at the auditability section to determine the progress and success of the project. Therefore in my opinion, the KPIs indicated in the project doesn’t  provide an accurate information in assessing, monitoring and tracking the progress and success of the project. Clearly, we are not given any indication on whether the information on the KPIs would be made available to the community. ", "q2r": 2, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8968, "q0": "In the project catalyst lot of people vote randomly, even if they don't have any knowledge over the subject or any relevant experience related to the proposal, this causes improper vote distribution and could also cause downfall of catalyst future development. Hence to overcome this, the proposer wants to develop a project where he wants to make this voting in more efficient manner , so that he can cover large number of people to who do not vote, and make them vote in cardano development eco system in the future , so by properly simulating all kind of barriers and bringing out best solution so that maximum people can vote. Hence, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "As the mentioned task is not easy to achieve, still with proper mathematical idea it can be achieved, where it need to take maximum inputs on what are the reason dReps are not voting and what are the professional qualification of their dReps who are not voting by simulating these data a proper data will be generated , and then counter solution can be generated to such problem, where cardano eco system can come up with solution to increase the number of voters .\nThe proposer's team has worked with experience in developing complex role models within game development so developing this model can also be achievable to proposer's team. Hence, with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clear goal to make cardano eco system still more efficient by making voting system as organized manner and where it wants to bring permanent solution instead of temporary solution. the audit has clearly introduced all the team members who will be participating in the project, the audit has even provided the experience of proposer's team in developing mathematical model.\nThe proposed system should have prepared timeline of the project where it would be of organized manner to work, the audit even contains decent budget breaking idea, with excellent key indicators provided to measure the success rate of the project, The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 12240, "q0": "The idea aligns well with the objective of the challenge, because it intends to create the model for voting and evaluation of the proposal in the Cardano by conducting research study. The proposer aims to study the distribution roles of platform participant and connect to work of fund. The proposer stated that Cardano has a big problem with the correctness of the evaluation of proposal such as, the competence of auditor/reviewer and fraud with the votes. In addition, the study attempts to mapping and modelling to describe the roles that offered by the system and explore the possibility of fraud. Furthermore, the study also attempts to swap the auditor/reviewer and the proposer on regular basis and give them commensurate resources thus, finds how it is work. The contribution of the study, to find and provide the picture for the community to see better voting option. As a lecturer, I see this is a good proposal that propose to study this matter. Thus, I agree and the proposal address the challenge", "q0r": 5, "q1": "What would need to be done carry out the project has been informed which is from  modelling to implementation. About the understanding and order of the activities themselves, I believe that everything is quite adequate. However, something that I think would be better was if they had included the time each of these research activities would take. Many proposals establish phases, this is because we understand well what would happen but not when it would happen, that is, when each thing would start and end, which is essential for a full understanding of the activities including research study project. About the team: they seem qualified for the project, because they have professionals from different areas and also have experience with developing complex role model, thus, it helps to conduct the research study. However, it would be more appropriate if each member were presented individually. Know who's who and their professional roles. That way there would be a clearer understanding of who they are, increasing the level of confidence in the team. However, given the information provided, I believe the proposal will be implemented successfully", "q1r": 4, "q2": "Speaking about auditability, no information provided instead the proposer give the illustration that matric or KPI not necessary to measure project progress. Proposer also argue, it needs the rules especially with the introduction of the ability to delegate votes beside numerical indicator. This argument is good but does not suit with the criteria that set to evaluate the proposal. I suggest the argument write at the end of the report project as “suggestion finding of the study”. Although, it is research work, it can also be measured to track progress of the project such as by using phase that established in the plan. As you stated in the budget, you have three stages/phase i.e., modelling, validation and implementation (this supposed to state in detail plan, timeline and milestone). That can use as the basis to measure progress report e.g., modelling phase takes 2 months thus, what step should take in modelling phase, once you dertermine the steps that you can use it measure progress research project. it is an example that I give. To conclude, given the information provided, I neither agree nor disagree its sufficient to audit the progress research project", "q2r": 3, "assessor": "z_assessor_3367", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "We propose to carry out a full-fledged research work describing how the distribution of the roles of platform participants and the connections between them affect the work of funds.", "experience": "Our team includes ontologists and auditors of non-profit organizations, as well as a person with experience in developing complex role models within game development."}