{"id": 383418, "author": "didnkallaehawe", "title": "Bees Delivery DAO", "url": "https://cardano.ideascale.com/a/dtd/383418-48088", "category": 26237, "amount": 21000, "description": "今天，发展中国家的大多数交付系统，如CMR，都是集中式的，没有利用当地环境提供的优势。", "funded": 1, "upvotes": 48536154, "downvotes": 12747286, "votes_result": 35788868, "votes_cast": 254, "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "问题陈述很清楚，提议的解决方案也很清楚。至于这个提议是否解决了挑战，这不是很清楚，只是因为提议的范围太大。挑战的目的是提供工具，提供DAO功能或吸引DAO到Cardano。这个建议不是为了构建工具，而是为了完整地构建一个DAO，这是创建一个更大的项目的一部分，基本上是一个去中心化的包裹交付系统。然而，这个项目有几个方面很可能对生态系统中的其他DAO非常有用。纳入DID，创建一个与当地货币挂钩的本地代币，以及创建一个代币化的二氧化碳激励系统，都需要对任何数量的新DAO有用的工具。由于该项目与世界反兴奋剂机构网络合作，我相信通过该项目获得的知识将与生态系统中的其他项目共享，因此符合挑战的精神。鉴于这一理由，在这个DAO应用中所学到的现实世界的经验和工具肯定会产生重大影响。我非常同意这个提案有效地解决了挑战。\r\n", "q0r": 5, "q1": "该团队似乎具有所需的技能，并且是Cardano社区的活跃和明显的成员。为开发者要求的资金数额与项目的雄心勃勃的性质相结合，似乎很低。该计划描述得非常好，预算分配清楚，有现实的时间框架。该提案在技术细节上很短。一些基本形式的白皮书对于研究如何克服一些关键的技术困难会有帮助。也就是说，这个项目对生态系统的价值可能来自于解决技术困难所涉及的创新。提案小组已经有了一个当地的合作伙伴，并且已经考虑了一些商业模式的风险，并在他们的模式中纳入了解决方案。我同意这个提案极有可能被成功实施。\r\n", "q1r": 4, "q2": "路线图似乎经过了深思熟虑，并击中了需要解决的关键点。可审计性部分显示了团队希望实现的里程碑，包括一个更完整的路线图，这很好。这些里程碑是现实的。包括一个关键指标的清单，但没有显示具体的KPI目标，如果能形成一个更量化的成功实施的衡量标准，那就更好了。没有提到具体的机制，社区可以去衡量进展，尽管团队在社区中很活跃，有很多方法可以使进展明显。我同意该提案为我提供了足够的信息来评估实现其既定目标的进展。", "q2r": 4, "assessor": "z_assessor_935", "no_vca": 18, "ne": 10, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This team aims to build a decentralized system for deliveries. From this standpoint this proposal isn't fully aligned with the challenge setting, which is asking to make Cardano the go-to-market blockchain for DAOs. However, the team fairly describes how a successful implementation of this DAO can be used as a role model for other initiatives. Therefore I see this proposal within the challenge. The same is for the impact. The team is able to show a potential positive impact of this proposal on our ecosystem in general.", "q0r": 4, "q1": "Behind this proposal is an experienced team, that has proven their skills in several projects. \r\nWADA has participated in various community events and has shown not only his expertise but also his attitude and willingness to improve the ecosystem around Cardano.\r\nThe presented plan is very detailed and covers topics like market research, technical aspects, and clear deliverables. Also there is a strategy about how to enter the market with this idea (many proposals are missing this aspect). The budget is broken down in detail and from my experience and perspective fair priced. The detailed plan and the experienced team convinced me, that there is a high likelihood for a successful implementation. \r\n", "q1r": 5, "q2": "The team provides metrics and has defined how success look like, so we can audit this proposal. To improve auditability of this proposal, I recommend adding a documentation source, where the community is able to track/observe the progress of this proposal.\r\nThe team has reflected about potential challenges and how to overcome them. Overall, this proposal is not just an idea, this is a ready-to-go project.\r\n", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 23, "ne": 7, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities and governance processes are for democratic and economic empowerment. DAOs are a powerful tool in this respect. I want to bring in my personal knowledge and experience on various governance models into action by assessing proposals in this challenge. Creating a DAO for something that is currently basically only done by big businesses will not only be beneficial for the Cardano ecosystem, but also will help the delivering people to get their fair share of that essential part of infrastructure. It will connect people and give them a huge perspective, such it can be said to have a big impact. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 3, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The proposal holds value as a DAO itself and has the potential to bring great value to the ecosystem if implemented successfully. However the challenge's aim is to develop tooling to make The Cardano ecosystem a desirable place for DAOs to migrate to.", "q0r": 3, "q1": "The Team appears to have the requisite skills to execute the proposal although without external links it is impossible to verify. The funds are well broken down although $ 12000 for 5 developers for 12 months seems low. The timeframe to execution is reasonable. It is great to see risk management mentioned.", "q1r": 4, "q2": "Roadmap and KPIs are provided but are rather vague and could do with some refining with regards to specific metrics that are easily measured.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the context of the challenge. However, it needs to be a little more clear on what kind of infrastructure to the Cardano ecosystem. The proposers describe what could be a product of a DAO, yet it isn't clear what a DAO is and what kind of a DAO it is trying to make. Will the tools they make be general-purpose enough to apply to different areas? Or is it meant to be specific to failing areas lacking delivery services infrastructure? How will other DAOs on Cardano use this, and what governing infrastructures do they plan to put in place? Despite this, the proposal would be great to have on Cardano.", "q0r": 3, "q1": "The team seems experienced enough to coordinate and design software, yet there's nothing to seem to indicate whether there's any experience that fits into the challenge. There's only one part of the picture here, while the other is incomplete.", "q1r": 3, "q2": "The proposal has an understanding of the problem and a possible solution to that problem, though again, the team will have to put more thought into how this will work collectively and for those who participate in this DAO. mile-stones are partially laid out with some being detailed and others vague", "q2r": 3, "assessor": "z_assessor_903", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "建立一个分散的交付系统，利用摩托出租车和城市间巴士，为所有利益相关者创造一个更有效的系统。", "experience": "瓦达喀麦隆中心。3名高级软件架构师和开发人员"}