{"id": 366834, "author": "", "title": "CCC: PRISM RIDE @MOA; 40M Visits/yr", "url": "https://cardano.ideascale.com/a/dtd/366834-48088", "category": 26116, "amount": 150000, "description": "**40M MOA visit/yr to be invited to Atala PRISM. \"Credential Wealth\" unlocks possibilities, currently no experiences offer mass-scale adoption**", "f6_no_assessments": 4, "f6_rating": 1.25, "videos": [], "media": [], "f6_assessments": [{"q0": "As with your \"CCC: Work|Live|Play@MOA\" proposal, it is really unclear what the proposal is intending to do or how it will spend the requested 150,000. Please provide a clear summary of what you are going to deliver and how that contributes", "q0r": 1, "q1": "As there is no clear plan its seems very likely the plan can be successfully delivered. This proposer has submitted 3 other similarly vague proposals to this funding round thus it seem unlikely the community will receives a successful project.", "q1r": 1, "q2": "No information provided, no timeline, no deliverables, no scope. There is nothing about this that would allow progress to be audited. Please present an actual proposal.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 25, "ne": 3, "ng": 12, "nfo": 10, "vca_o": 1, "reply": "Bias and factually untrue. Detailed proposal was provided by Cavu, with a timeline and deliverables."}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem and solution statements are not clear nor is the title. Much more detail is required to assess this proposal however the ride in the video looks amazing! My recommendation is to check out winning proposals at the end of this funding round to see what is required.\r\nThe goal is not clear from the proposal however from a reply in the comment section the goal appears to be \"to gamify downloading, installing and using Atala PRISM on a mass scale\" which would align with the challenge objective.\r\nThe proposal as written is not able to scale to drawing in millions of DID users however the description in the comments section could, especially based upon the annual visit count. Even if it was just a gimmick it would achieve the challenge objectives however the add on Educate and Incubate phases along with other ideas in the comment sections could make a viable proposal.\r\nMy advise is to take the comment response as a starting point and team up with a good proposal writer for the next funding round.\r\nBased upon my experience, I strongly disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 1, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is not reasonable to achieve the goals and is not broken down into identifiable items. The budget appears to be for a concept design in 2 months for $150,000.\r\nNo timetable is provided.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I strongly disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "There is not much information about the project statement or the scope of this proposal. Solution is not clear and tries to deflect to outside source to reflect such information.", "q0r": 2, "q1": "There is no clear information as to the experience besides content shared via links and PDF that can support proof of aunthenticity as originator of those materials.", "q1r": 2, "q2": "The metrics only shows what such high amounts or fund will be used after 2 months of receiving fubding. No further key metrics or detailed plan of execution is present to address auditing of progress. More information needs to be provided by proposer.", "q2r": 1, "assessor": "z_assessor_594", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Unfortunately, the proposal does not provide enough information how it will drive mass adoption of Atala PRISM. After reading all the material provided I have to assume its for the character creation in the game but it's unclear why Prism would be needed for this? How would their identity included in the game link to their broader identity? What happens if someone doesn't want to sign up on the blockchain? What is the benefit of doing it? This should all be better explained throughout the proposal. Voters should be able to tell immediately how this proposal will drive mass adoption but it falls short. ", "q0r": 2, "q1": "It is unclear from the proposal whether it can be implemented successfully. While it appears that there is already a pilot project \"midnight ride\" it is not clear where Prism fits in. The proposal is way too sparse on milestones, deliverables, and measures of success. There is also a logic leap between the ride and the use of Prism, while this may be clear to the proposer, it should be broken down more granularly for voters. \r\nThe proposer also should provide additional information on their skillset and background which makes them a good candidate for funding. How does being a ride developer help get mass adoption of prism? For these reasons I cannot score the proposal higher. Addressing them in future funding rounds may strengthen the likelihood of success. ", "q1r": 1, "q2": "Unfortunately there is not sufficient evidence to audit the progress and success of the proposal. In this instance, I fail to see how voters and the catalyst community could provide any audit functions. The documents included do not provide enough information or success indicators for audit. The proposer should better articulate what success is, how it will be measured, and by when. The open nature of the request at this time makes that impossible, and therefore I couldn't give it more than 1. ", "q2r": 1, "assessor": "z_assessor_66", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "**Your VOTE:**\n\n**• Green-lights DID adoption plan via Cavu ride**\n\n**• Invokes \"ADA Influencers\" (IOG, CF, etc.)**\n\n**• Accelerates dialogue w/MOA**", "experience": "CAVU Designwerks: Preeminent ride developer will provide an exceptional experience while onboarding thousands of Atala PRISM users daily."}