{"id": 367037, "author": "", "title": "Play-to-learn-and-earn DID-Platform", "url": "https://cardano.ideascale.com/a/dtd/367037-48088", "category": 26116, "amount": 33600, "description": "Millions of people are excluded from invaluable learning material and business opportunity due to their location, language or infrastructure", "f6_no_assessments": 6, "f6_rating": 3.222222222222222, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=3450", "https://youtu.be/UrVhchYNu_8/?start=1204"], "media": [], "f6_assessments": [{"q0": "The proposer outlines a vision for a massively multiplayer educational game (akin to Roblox) to educate users on various topics such as learning languages. The way that this addresses the challenge is that the game exclusively utilizes Atala Prism to authenticate users and to prove their expertise in a particular field. A game seems like a good way to onboard users to Atala Prism and  the learning certificates are a good way to add additional value to a user's DID, value that they might want to use in another application in the Cardano ecosystem.", "q0r": 4, "q1": "The scope of this proposal seems to be much too big for the resources specified in the proposal. The team member's bios don't specify if they have ever worked on a project of this scope or if they have experience developing MMOs. There is also a big language component that will require a lot more resources above the budget allocated to the core team. The proposer mentions that they will need to apply for more funds in future proposals.", "q1r": 2, "q2": "The proposer specifies a set of milestones, but it is unlear what state the game will be in at each milestone - i.e. what features does the team hope to have working if they are unable to secure further funding? Would recommend the proposer not using phrases like \"show us the money\" as that might give bad impressions to the reader.", "q2r": 2, "assessor": "z_assessor_142", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1, "reply": "I do not think that the advisor understood our roadmap and the team structure. Roadmap: as we only search funding for the initial four months, we would still be in design phase and obviously have no working platform yet. As stated, the platform will only start testing and actual manifestation after six months and will take at least six to twelve more months to work out. Regarding team structure, the advisor did not understand that we have dedicated people in our core team for the design of game-based learning and for the work on linguistic components, e.g. find common structures in multiple languages to utilize in learning. Additionally, we are gathering founding teams for each language and have deep discussions with those. We have chosen a rich set of starting languages to have a meaningful discussion with those teams, get to common ground and give away lots of the content/language development side to the dedicated founding teams of each language. Therefore, we are reducing the scope of the development process in spreading the necessary parts to different teams."}, {"q0": "This is absolutely a great idea! It's a use case with many use cases. :) You have mentioned some and the community will surely brainstorm more.\r\n\r\nYou could e.g. approach countries that are in dire need of foreign workforce but who require local language proficiency. This way you might get government funding for your efforts: train people to be somewhat fluent in a language and then allow them to be recruited to a certain country via the same platform (via the organizations' zone).\r\n\r\nAs for the partnerships, you need to venture further than the immediate blockchain companies. Map out current actors in the \"play and learn\" market (e.g. Duolingo) and explore partnerships with them.", "q0r": 4, "q1": "Already the current team has a diverse set of skills and it's great that the missing talent is already recognized.\r\n\r\nMy only worry is a lack of an overall budget. How much money will it take to get this off the ground? The answer is not $33,600 but obviously more.\r\n\r\nCurrently you are applying for:\r\n- $33,600 in this proposal\r\n- $60,000 in the other (game engine) proposal\r\n- $XXX,XXX in Fund7\r\n\r\nWill this proposal be funded and realized if the other one doesn't get the necessary funding? And if both of these are funded how much will you need in Fund7? What about after that? How long are you dependent on Project Catalyst funding and what other funding mechanisms will you have?", "q1r": 3, "q2": "Everything is laid out nicely, although there are some minor discrepancies like this:\r\n\r\n\"...we decided to pay $1200 to each of our seven core team members for the initial six months... 7 members * $20*60h * 4 months = $33600\"\r\n\r\nIs it for 4 months or for 6 months?\r\n\r\nI am in software business myself and I know that projects of this magnitude are not 5-digit endeavors. There will be so much development needed that you should probably look for developers in less costly geographical areas such as Vietnam.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable. This solution is massive in terms of scope.\r\nThe goal of an MMO game-based learning environment that issues verified credentials to DIDs aligns with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users however it would take many rounds of funding and significant time to get to that point. This round of funding is for 4 months which by the roadmap has no deliverable other than design guidelines which as a standalone deliverable would not provide any DID usage.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the proposal goals but not the challenge goals and is broken down into identifiable items.\r\nAdditional funding is required to implement the proposal, the proposer has provided a plan on obtaining these funds consisting of potential partners and future Catalyst funding. No commitment from any of these funding sources is given.\r\nThe timetable to complete the work seems optimistic given the scope and is very high level.\r\nThe plan does not describe the resources necessary to implement the proposal instead listing several possible options. The idea of hosting the platform in a decentralized way is awesomely experimental however it significantly increases the feasibility risks. \r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with a timeline however there are no auditable milestones and for the period of funding requested the deliverables are poorly defined.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. As a design phase proposal, the number of DID users projected would be 0 however the proposal should project out from beta release and beyond as to when the community could expect DID users to be recruited assuming future funding. When could the community expect the challenge objectives to be measurably met if this project were funded? \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "A game to play to learn and earn is a great idea, however, I believe this proposal should have been entered under NFT Business models since the core of this business model is build around NFTs and transactions. A can see how requiring people to have Atala Prism DID to enter the game will \"onboard\" more users to DID, however, I see this proposal as a blockchain \"Duolingo\" with a login requirement. I would like the team to expand on the user economics behind the game - please explain how the in-game economics work and how the ecosystem will be funded.", "q0r": 3, "q1": "Although a links to github and various websites was provided, I feel the proposal requires further development to ensure successful implementation. I would like the team to further expand on the type and number of team members required to fully implement the proposal, what are the responsibilities and deliverables of each member. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Lastly, I would like the team to expand on the plan for scaling the game to thousands of users.", "q1r": 3, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) (have 25 partnerships by month 2, create 1,000 pieces of content by month 6, etc - create measurables) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a thorough roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond single line entries and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. \r\n", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 11, "ne": 2, "ng": 4, "nfo": 5, "vca_o": 1, "reply": "Although providing helpful feedback, if the advisor sees the game as a blockchain-based Duolingo, the proposal clearly was not read in detail. Duolingo does static learning (and also has a login requirement), while we want to offer dynamic, immersive, contextualized and interactive learning, furthermore collaborative working and enabling of business opportunities for eveyone engaged. The core of our business model is not around NFTs, but to connect people to teach/learn and provide another layer of certification of aquired skills through VCs on our platform. Additionally, we feel that we clearly stated the responsibilities and deliverables of each team member, and clearly stated that we are aiming to have collaborations with further language professionals and each language's founding team after one to three months."}, {"q0": "The proposal directly addresses the challenge in a fun and ambitious way by using NFTs , teaching and games as an interesting way to promote both crypto and the Cardano eco system as a whole.", "q0r": 5, "q1": "The team has a wealth of experience which is visible through the links provided. The detailed roadmap and in depth explanation of how the game would function incorporating NFTs and tokenomics.It is highly likely that the proposal will be implemented when considering the information provided.", "q1r": 5, "q2": "The proposal provides a detailed road map and break down of how the requested funds will be spent should it be implemented. THis includes an hourly wage structure which gives visibility for voters and ease of audit.", "q2r": 5, "assessor": "z_assessor_542", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does present a system that at its heart will require participants to have a decentralized ID that will have various language credentials attached to it, thus satisfying the intent of the challenge.  However, given the issues I found with the rest of the proposal, I can not say that it addresses the challenge in an effective manner.  See my other assessment notes.", "q0r": 4, "q1": "After examining their GitHub projects, it appears that the proposers do have real programming experience.  But my bigger issue with the proposal is its vast scope.  The proposal offers to create, in full, a large-scale Cardano based software system that combines something like a language learning platform like DuoLingo with a quest based, massively multiplayer online game, while supporting eleven languages up to the A2 level of the CEFR scale (CEFR = Common European Framework of Reference for Languages).  Either one of those top level tasks is a huge project in itself.  The proposal does state that the funds requested are to be augmented by the team via other fund-raising efforts outside the Cardano treasury.  But I have no way to vet or to assess their likelihood of success in that fund-raising.   The proposers may want to consider next time positioning their request as a pilot program or research project, with the stated intent to seek further funding in successive proposals.  That way assessors can estimate the proposals probability of success without that estimate made cloudy by the need for funding outside the proposal.  Normally a relatively small fund request by a proposal makes it easier to accept it, since there is less risk of it displacing other proposals with merit.  But here, weighed against the size of the intended deliverable, it instead reduces my confidence that a usable deliverable will be created. The proposers are obviously energetic and devoted to their projects, so I sincerely hope they come back in F7 with a tightly focused proposal of reasonable scope and get the funds they seek. ", "q1r": 2, "q2": "The proposal does include a timeline for the creation of certain elements of the deliverable.  However, it would be helpful if the proposers had included specific milestones with numeric targets and associated dates for performance metrics.  For example: the number of monthly active users they intend to have on-board and by when, etc.  Unfortunately, as stated in my previous assessment note, the fact that the proposal is dependent on the team's funding success outside this proposal, it is very difficult to gauge the auditability of this project.  I look forward to seeing a proposal from them in F7 that does not have this dependency.", "q2r": 3, "assessor": "z_assessor_551", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "A Game-based learning platform where local cultural hubs are formed. This connects people to collaboratively learn, teach and work together.", "experience": "Interface/UX Design, Full-Stack-Dev, Front-End-Dev, Plutus Pioneer, CS, Sound/Generative Artists, Procedural Modeling, Cultural Scientist"}