{"id": 367559, "author": "", "title": "Aegis Esports DID Platform", "url": "https://cardano.ideascale.com/a/dtd/367559-48088", "category": 26116, "amount": 50000, "description": "The Esports industry struggles with stagnating amateur and professional scenes and inefficient talent & knowledge discovery and preservation", "f6_no_assessments": 2, "f6_rating": 2.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should be more closely aligned with the challenge and the solution description is a little unfocused throughout the proposal but reasonable. The solution reads like a collection of ideas instead of a focused product, with new ideas being added the more the proposal is read. I recommend picking a central feature to focus on and list other ideas as future possible enhancements. Putting it another way, define your MVP and pitch that.\r\nThe goal of a platform that uses DIDs to integrate with multiple esports titles aligns with the challenge objective.\r\nConceptually, the proposal is able to scale to drawing in millions of DID users however it has no funding in the budget for a hosting service which would be required to make this proposal viable on any large scale.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. The proposer classifies himself as a junior developer.\r\nThe team of has not been sufficiently identified in terms of skills and number required to implement the proposal. The proposer should team up with more experienced developers to increase feasibility of proposal.\r\nThe budget is not reasonable to achieve the goals and is not broken down into identifiable items. There is no budget included for a hosting solution for this proposal. The $5K request for a staking pool is not directly applicable to the proposal and should be removed.\r\nThe timetable to complete the work should be clearly defined to show what is being done and when.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I like the idea of having a platform for a type of social collaboration for a particular passion, in my opinion, the proposal may use the Atala Prism DID to onboard members but it is a far cry to solving the challenge question of mass adoption of Atala Prism DID for a greater adoption of the ecosystem in a global sense.", "q0r": 2, "q1": "I agree that much thinking has gone to achieve proof of concept and Milestones mentioned, there is need for detailed broader collaborations and partnerships. I think that this project should executed in phases( 6 - 12 months) due to its long-term overview", "q1r": 1, "q2": "The information is not enough to assess the key performance indicators of the proposal for instance, what is no. of members expected to onboarded on the platform within a reasonable timeframe.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "A decentralized DID management platform with social functionality that provides\n\nmeaningful economic incentives for educational content.", "experience": "I'm a junior developer, future Atala Prism Pioneer, enthusiast, and competitor in CSGO, with IT career skills to help run staking pools."}