{"id": 368080, "author": "", "title": "DIDs for public services in the US", "url": "https://cardano.ideascale.com/a/dtd/368080-48088", "category": 26116, "amount": 100000, "description": "Trying to make local government interactions frictionless using DIDs and DIDs documents.\n\nDecentralize public data access and ownership.", "f6_no_assessments": 3, "f6_rating": 2.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, this would probably make local governments less bureaucratic and probably flow seamlessly. ", "q0r": 5, "q1": "Since this is new, I would like to see a lot of education and outreach first. Knowing how local governments function, they would need convincing and maybe do one local government at a time. I would love to see in your proposal how you would get them to agree. Maybe ask for funding  for educating and getting the local governments on board first?", "q1r": 3, "q2": "The proposer has measurable and quantifiable ways to measure the success of the project", "q2r": 5, "assessor": "z_assessor_271", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge and the solution is very vague with many hypothetical applications instead of a single specific application.\r\nThe goal of allowing government to manage and issue all types of transactions with DIDs aligns with the challenge objective however it is not specific enough to be useful. Choose a specific set of related transactions and propose a solution for that set.\r\nThe solution is not able to scale to drawing in millions of DID users since it is not defined.\r\nMy recommendation is to review winning proposals in this funding round to understand what is expected in a proposal or to team up with someone with proposal experience.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. \r\nThe team has not been sufficiently identified in terms of skills and number required to implement the proposal. The proposer admits to having no experience working with government which will be required to determine a use case. At a minimum the team needs to include someone who can develop a relationship with local government and define the requirements.\r\nThe budget is lump sum and is not broken down into identifiable items.\r\nTher is not timetable.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nA development team of one also poses a risk from unforeseen circumstances.\r\nBased upon my experience, I strongly disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal's intentions align with the challenge, in as much as finding ways to onboard Gov't agencies would bring massive adoption.\r\nWhat is missing here is any description of how the use of DIDs on Cardano would benefit the Gov't agency, or why anyone in the US would need a new ID.", "q0r": 4, "q1": "The Proposer tells us they have no experience working with Government Agencies, and they have not brought in Team members that have this experience.\r\nThe plan is a very high level aspirational statement which does not get into detail about implementation, or admit to risks that have been considered and mitigated.\r\nThe section that speaks about markets that will be disrupted fails to provide insights about how these markets would be disrupted and in what timelines. Disrupting a $70b/yr market is not a trivial thing, and would happen in increments over long arcs of time.\r\n\r\nThere is no team introduced, other than the proposer. There is a github link, and we find a new repository for decentralizedgov, which has no content developed yet.\r\nThis project would be well served by joining forces with team members that have experience in Gov't contracting and software development.   \r\n", "q1r": 1, "q2": "There are 3 bullet points provided which are suggested to be metrics of success. The first is suggesting that a Framework (data architecture) would be built. The proposer has not provided any clarity about how this framework would be mapped out or defined, given the current data sets for any of the suggested Gov't transaction types that require ID.\r\n\r\nSuccess Metrics should tie back into the proposed work, and solidify trust that the proposal is thinking deeply and has the knowledge sets required to accomplish the project in some measurable way.\r\n\r\nNo Budgetary breakdown is shown, and there will be no way to determine how much funding should be released over the course of development.\r\n\r\nThis proposal would have a greater chance at success if there were a solid team with deep experience in Gov't software and contracting work.", "q2r": 1, "assessor": "z_assessor_593", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "I would like to be able to build software that allows government to manage and issue all types of transactions with DIDs.", "experience": "I have a background in data architecture and full stack web development.I have finished the Plutus pioneer program lectures and I enjoyed it"}