{"id": 368039, "author": "", "title": "Dyana holistic health DID", "url": "https://cardano.ideascale.com/a/dtd/368039-48088", "category": 26116, "amount": 35500, "description": "Personal Health data needs to be more integrated, precise and fun in order to develop prevention, lower disease and the associated costs.", "f6_no_assessments": 3, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge and the solution is not clearly defined.\r\nThe goal of a mobile health wallet based on Atala Prism may align with the challenge objective but it is difficult to determine what exactly is being proposed. \r\nThe proposal does not make the case for the solution being able to scale to drawing in millions of DID users. \r\nThis might be a viable idea however the proposal is not complete. My best understanding is that the concept is that the user would have a mobile app which would show an interactive human body that can connect to medical services for a crypto fee. What happens then? Does the human body image update with the organs impacted by a diagnosis? Does the image take data from personal monitoring devices? How does this information interact with a DID?\r\nMy recommendation is to review winning proposals to see what is expected or to team up with an experienced proposal writer\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is not assessable without better defined goals and is not broken down into identifiable items.\r\nThe timetable appears overly optimistic in terms of adoption rates without a clearly defined go-to-market plan and the work needs to show what is being done and when.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal provides a roadmap and a defined timeline but few auditable milestones.\r\nThe proposal include projected metrics that might correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. The basis for the projected metrics should be explained.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "A platform that pursues holistic health is a good idea, however, the proposal fails to demonstrate how it will build tech and marketure to increase user adoption for Atala Prism - thus I feel the proposal did not address the challenge. I would like the team to expand on the integration with Singularity Net and Cardano.", "q0r": 2, "q1": "Although the team provided a link to LindedIn and other websites, I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to provide a deeper explanation about the architecture and language for the implementation of the back end of the product and how this will connect to the Cardano blockchain. ", "q1r": 2, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This idea is very interesting and different, because it intends to make an unusual use for a DApp, that of health; through this DApp, the user could register their data, track information about organs and diseases, and pay for some exams and health-related things through digital coins. In my view, this proposal fits more harmoniously into the \"DApp & Integrations\" challenge than the Atala Prism challenge; I didn't really understand what would be the relationship of this DApp with Atala Prism, if this bridge were more clarified, it would be beneficial. Another point that I thought could be improved is when the authors say that this project would dialogue with other Catalyst projects that were about health, it would be positive to understand how this relationship would take place and some examples of projects that could be connected here. Regarding the benefits of Dyana holistic health DID, there is no doubt as they are many and important, what really worries me is the connection of this with the Atala Prism ID.", "q0r": 3, "q1": "The project team is very well presented, we know the names, training areas, interests and social profiles (such as twitter, linkedin and even websites) of the team members, which generates a strong security and reliability in their work. They are professionals from different areas, all important for the functioning of the DApp, complementing each other. What I would like to note is: it would be great if we were given some examples of projects/products created by the team or even individually by its constituents. Regarding the roadmap, we do not have information about the actions that need to be taken to carry out the project, and the monetary division is present but lacking in detail.", "q1r": 5, "q2": "The weak point of this proposal is, unfortunately, its aubitability. The team spends a lot of time describing the DApp, both the benefits part and the innovative design it intends to have, but we don't know what small actions would compose the phases that, together, would result in the development of the project. We know what success looks like, which is good for the community to have metrics and keep track of things, but it was critical that the step-by-step be listed and also related to some time frame. The financial division is present, but a little shallow, for example: \"Communication: 3000\". What would that be? Marketing? And if so, how would it be done, through which vehicle, for example? In the \"others\" part, it would also be interesting to understand what possible extra expenses we would find here. As I mentioned in \"impact\", the main problem I found here was to understand the relationship of this idea with Atala Prism, how, exactly, these two technologies would relate to each other. Resolving such doubts, I believe that the observation about the practice of this proposal would be more tangible.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "The Dyana holistic health identity, a mobile health wallet with interactive 3D visualizations, based on Atala Prism.", "experience": "Over 20 years of experience within the wellness industry, including 10 years running a digital studio and app based products."}