{"id": 368054, "author": "", "title": "⭐Self-Sovereign DID Badge Passports", "url": "https://cardano.ideascale.com/a/dtd/368054-48088", "category": 26116, "amount": 50000, "description": "Today's factory-based education model is flawed. Its average-size-fits-all model ignores kids' differences & fails to recognise strengths.", "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": ["https://www.youtube.com/watch?v=wujsi9XCv4w"], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable. The vaccine passport example was unnecessary and runs the risk of alienating a segment of the voters. \r\nThe goal of providing students verified certificates for STEM programs using DIDs as an onramp to the Cardano ecosystem aligns with the challenge objective.\r\nThe solution makes the case to scale to drawing in millions of DID users which would require future funding. There is a go-to-market plan and an existing partner for a pilot with a well defined secondary rollout. The proposal does not specify the number of passports issued in the pilot however it does provide the 30K number by the end of 2022 if funded in the future. The only future funding plan mentioned is from future Catalyst funding which is a risk. \r\nUnfortunately there is no mention of the code being open source so that the community could retain value even if future funding did not occur.\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals and is not broken down into identifiable items (# of days effort).\r\nAdditional funding is required to develop the product to the point that the challenge objectives would be met, the proposer has not provided a plan on obtaining these funds other than submitting additional Catalyst funding requests.\r\nThe timetable is realistic to complete the work compared to other similar proposals and shows what is being done and when.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 4, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline. The milestones should be more definitively  worded.\r\nThe proposal includes projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user however they are beyond the scope of this funding. The proposal should indicate how many passports are expected by the end of the funding period.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I work at a college, and involved with international students and scholars, and am amazed in our century the amount of paperwork that is needed to be carried around. If a student is having to transfer from bus to bus, plane to plane, and taxi to taxi: it is easy to loose credentials.\r\n\r\nThe proposers seem to address these concerns well, and is driven by Leo's personal experiences. Many aspects of this proposal seems to directly address the needs of Atala PRISM and would encourage its mass scale adoption. The price tag of the proposal is a bit high, but I think the chance of success is great.", "q0r": 5, "q1": "Good team qualifications, and details given about what they can help insure about bringing the development outlined in this proposal to a success. Working with innovation hubs, maker spaces, and finding a new paradigm of handling issues through blockchain technology can be an element that can help with success technologically, but also with the mass-scale and marketability aspect of having credentials on the blockchain.", "q1r": 4, "q2": "Good and simple milestones are provided with easy to understand metrics. It is easy to see the plan just within this proposal, and the goals seem realistic to meet. Links to the outside credentials would seem to heighten the confidence to have success in that they have the technical skills, and real life experience to succeed in meeting their milestones set.  \r\n\r\nThe partners of this project also seems to fit within the community of Cardano and its missions involving African nations, and then also what seems to be pilot cases in Australia with their first client. These possible successes seem outlined well, seem realistically obtained, and seems well structured and strategized for success.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal matches the challenge requirements very well, and it looks like this project could be huge win for the students, the proposers and the Cardano eco-system. \r\nThe team are already in discussion with the right stake-holders regarding a pilot program.", "q0r": 5, "q1": "The team is a good mix of tech and tech-ed members with advisors from the education space.\r\n", "q1r": 5, "q2": "Quarterly milestones provided, but ideally this would be broken down into smaller time frames that can be better monitored and reported on.", "q2r": 4, "assessor": "z_assessor_434", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "This challenge asks how we can improve high scale adoption of the new ATALA Prism SDK for issuing DIDs. This proposal aims to enable that by putting verified school credentials for children in Australia on the blockchain. The problem statement clearly articulates that the current education system is designed for a factory-like world which made sense in the past but no longer makes sense in a world with the internet. The solution statement clearly articulates that empowering students to take control of their education (and thus their credentials) and thus be more competitive in an increasingly globalized world.\r\n\r\nThis proposal, if successful, will have very significant impact on the Cardano ecosystem through second order effects. I think the first order effects of onboarding children in an Australian state will be quite small but if successful this will be an incredible template for rolling out this technology across the rest of Australia and then hopefully the rest of the developed world. \r\n\r\nThe milestones and deliverables are very clearly laid out and are capped off with a numeric goal of 30k passports issued by the end of 2022.\r\n\r\nScalability for proposals like this is hard to assess because of the significant partnership component required with legacy organizations. However, I believe the software will be very scalable especially since it will be powered by Cardano.\r\n\r\nI give this proposal a rating of 5 for Impact.", "q0r": 5, "q1": "I'm a firm believer that building solutions to solve your own problems positively and significantly alters the odds of success in your favor. One of the proposers suffered the drawbacks of factory-like-education in Japan and thus I believe he will be highly motivated to build this solution especially if the Cardano community rallies around him. \r\n\r\nThe team as a whole is well credentialed and experienced. They have experience in the technology industry building software and managing projects. They have provided links to their LinkedIn which further establishes their credibility. I would like to see links to the Github profiles of the software-oriented team members. \r\n\r\nThe project is well laid out with quarterly milestones all the way to the end of 2022. The ordering of the milestones is well thought through starting with a rapid prototype to demos followed by a pilot program then a larger roll out. \r\n\r\nThe funding requests are very reasonable considering the amount of effort that will be needed for this project. \r\n\r\nI give this proposal a score of 5 for feasibility because of the amount of up front effort that has gone into planning. However, I would like to see a Risk and Challenges section in future proposals by this team. ", "q1r": 5, "q2": "I believe it will be easy to audit this proposal if funded. I believe auditing will be easy because of the highly structured milestone breakdown. Each quarter there's a milestone which is easily verifiable like \"has a rapid prototype/PoC been produced?\" or \"have digital certificates of attendance been issued?\". These milestones are easy to verify.\r\n\r\nThe numeric metrics of this proposal also add another easy point to audit. For example, the community will be able to ask \"were 30k passports issued by the end of 2022?\" and \"are 10 Tech Schools using W3C Verifiable Credentials for Badges?\".\r\n\r\nHowever, some of the milestones and success criteria are not easy to audit. For example, how will \"Collaborate with Atala PRISM team (PRISM pioneer program?) on the technical implementation of PRISM after a successful PoC in Australia\" be audited by the community? Would 1 minute of collaboration satisfy this? It would be better if milestones/tasks like this were more outcome than process oriented. \r\n\r\nThe high level problem statement and solution statement are also easy to audit. I give this proposal a score of 4 for auditability because it's overall very auditable but a few of the milestones/tasks/deliverables are vague.", "q2r": 4, "assessor": "z_assessor_531", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal shows the importance of KSA identification, the global inequities and a path towards DID implementation and adoption. Capturing and rewarding the targeted age-group drives interest, adoption and usage of Cardano's technologies through first-hand interaction. Additional exposure to DIDs and Cardano comes through exploration and acceptance of the KSA badges from guardians, governments and employers.", "q0r": 5, "q1": "The team has experience in the field of education and technology and is working with field-relevant partners. The budget appears within reason for the scope of the proposal. Topics not addressed are student wallets (passports) and the accessibility to badges and certificates (NFTs)..", "q1r": 3, "q2": "Unable to define a clear audit path. Milestones seem realistic and attainable. Note, the Q1 2022 milestone is dependent upon coordination with Atala Prism. No apparent risks have been defined within the provided materials.", "q2r": 3, "assessor": "z_assessor_591", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Closing the skills gap and empowering youth by giving them agency over personalized learning paths with portable Verifiable Credentials.", "experience": "We are a passionate team with non-traditional educational backgrounds on a mission to empower youth via DID and verifiable credentials"}