{"id": 368367, "author": "", "title": "Proof of identity for mediators", "url": "https://cardano.ideascale.com/a/dtd/368367-48088", "category": 26116, "amount": 20000, "description": "It is not feasible for parties to verify identity and credentials of mediators that are supposed to provide aid in solving a dispute.", "f6_no_assessments": 2, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to bring mediators and verify their identity via Atala PRISM. It is a niche project that should be successful as it focuses on a very small segment of people that can benefit from digital identification (DID).", "q0r": 4, "q1": "This team is well skilled, that composed of engineers with high technical experience. The plan to onboard mediators will be successful if the onboarding can be facilitated easily with the least friction for users.", "q1r": 4, "q2": "Milestones are clearly laid out and the proposal can be easily audited. The budget is very reasonable and may need to be increased a bit to provide for the 3 developers noted in the proposal, along with any expenses required for onboarding.", "q2r": 4, "assessor": "z_assessor_340", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This clearly links with the other win-win proposals and is also a generally relevant topic that needs to be addressed for Cardano to succeed. ", "q0r": 5, "q1": "The team is composed of professionals with experience in the technical side as well as the community side in that there are active members of the Cardano community in the team. It's only weakness is that it doesn't have a direct tie to universities which may have been helpful. ", "q1r": 5, "q2": "There are clearly outlined numbers in terms of university on-boarding as well as the release of backend programs. It would be good if the project team clarified if this will be open-sourced or if it will be under some licensing. ", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Mediators verify their identity via Atala PRISM.", "experience": "A team of a dozen developers, Plutus pioneers, legal experts, dispute resolution specialists."}