{"id": 368554, "author": "", "title": "Education verification with DID", "url": "https://cardano.ideascale.com/a/dtd/368554-48088", "category": 26116, "amount": 70000, "description": "Fresh grads find it hard to share & track physical edu certificates.\n\nEmployers find it is too costly to verify one's edu certificates.", "f6_no_assessments": 3, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge and the solution should be better defined.\r\nThe goal of using DIDs for educational verifiable certificates aligns with the challenge objective.\r\nConceptually, the proposal is able to scale to drawing in millions of DID users however the proposal is not very detailed. My recommendation is to look at some of the other educational certification proposals that score higher for ideas on how to improve the proposal or possibly partner with them\r\nBased upon my experience, I neither agree nor disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 3, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is possibly reasonable to achieve the goals however it is not broken down into identifiable items. How big is the team?\r\nThe timetable is possibly realistic to complete the work but does not show what is being done and when. Again how big is the team?\r\nThe plan only lists \"tools\" to describe the resources necessary to implement the proposal.\r\nThe proposal identifies some challenges to a successful implementation.\r\nBased upon my experience, I disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.\r\nThe proposal includes projected metrics that correspond to the challenge objective including the number of DID users projected to be onboarded at specific time intervals. The recruitment cost per DID user after 6 months would be $70,000 / 316 users = $221.52 per user which is extremely high but would drop over time. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The idea is very relevant and meets the challenge's objectives well, because it adds value to the Atala Prism ID through a faster and more technological verification system for educational data. The idea here is to carry out a completely digital verification, with the objective of making the action cheaper and faster for both contracting companies and future candidates, thus being a great initiative. However, it would be positive if the author explained better how this system would relate to Atala Prism, whether it would be a new face added to the ID, or a separate DApp that would integrate with it... This question got a little confusing for me, and if it were clarified, we could determine with more certainty whether the proposal really fits the objectives of the challenge.", "q0r": 4, "q1": "Regarding the author's ability to carry out this proposal, we have positive and negative points to analyze. It is positive how the author is well organized, attaching a presentation on Miro (a tool widely used in Design), where he graphically shows everything he says about his proposal, considering information both as the tool's technology and the question what would need to be done, how long it would take and what area the action would fall into (eg design, tech or product). The question is, would he do it all himself? It is not clear whether the author intends to hire other professionals to develop the project as well, which would be ideal, in my opinion, or not. We can see through the description of the proposal that he understands a lot about the technique that involves the project, however, we do not know if he is a developer (probably not), so it would be necessary for him to make clear the intention to hire one and also specify what type of developer would, after all a large part of the funding would go to that person. Regarding the roadmap and financial division, we have some information, but not so much, more details would be needed.", "q1r": 3, "q2": "Here we have some actions that would be done in an interval of 3 and 6 months. The detail is reasonable, but it could be better. For example, in the first phase they intend to involve 3 users from universities and 5 from companies; but how would they be selected and with what argument? I think it would be important for there to be immediate feedback to the community, in order to monitor the progress of the project, there is no definition of established success metrics. In addition, the monetary division is very superficial, in the marketing part, for example, it would be important to know how this idea would be disseminated to the public, both for independent users and companies and universities. In general, it seems to me that the author put a lot of effort into explaining about the proposal (both in the Catalyst description and in Miro), but did not explain in detail how it would be put into practice, the people involved, the money financed and the success metrics.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "This proposal effectively addresses the challenge. I appreciate that the proposer has clearly articulated the current challenge facing recent grads and offers the digitization of educational credentials as a solution using Atala PRISM. The proposer also has a good understanding of the potential disruption that this tool could provide in contrast to the status quo. \r\n", "q0r": 5, "q1": "Given the experience and plan presented it is somewhat likely that this proposal will be implemented successfully. I do not discount that the proposers have the capacity to deliver this project based on what is provided. Why I am not giving this proposal full marks is because I think the plan could be fleshed out a bit more. While I am sold on the idea for the proposal, it is unclear that the demand for such a service is coming from the location which has been identified. It leaves me wondering if the proposers have engaged potential universities already, if so, what level of buy-in was there, and have they clearly indicated their support? Is the location chosen on proximity to the proposers? \r\nI do think that the indicators, budget, and timeline seem reasonable, but again I think that there is an assumption that buy-in will be strong from the Malaysian universities, governments, and other state apparatuses that are part of ID issuance and information sharing between entities. More details here would increase the score. ", "q1r": 4, "q2": "In general, I agree that the information provided is sufficient to audit the progress and success of the proposal. The proposers identify their key milestones, deliverables, and other products. Given that these include tangible products, such as the minimum viable project (MVP) and the onboarding of universities, employers, and students, the Catalyst community can easily track whether the project is meeting its goals. \r\n\r\nMy biggest critique in this category is for the budget. Given that there is not a distinct breakdown beyond high level categories, voters must trust that the team can deliver and that the amount requested is necessary. For example, the proposers include Development=60,480 and Research & Development=3,000 but there is no indication of how these are different. Moreover, what does \"development\" entail that \"research and development\" doesn't? While I am not saying this is necessarily suspect, it doesn't provide enough granularity for the community to know how the money is being spent. To get a higher score I would encourage the proposers to explore such avenues. ", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}], "solution": "We believe that implementing Atala PRISM DID among uni/colleges, helps fresh grads and future employers to verify education certificates.", "experience": "2+ years working with credit rating agency with some research done on this topic. A UX designer/researcher with 10+ years working experience"}