{"id": 368660, "author": "", "title": "MySmartWill: evolution for tomorrow", "url": "https://cardano.ideascale.com/a/dtd/368660-48088", "category": 26116, "amount": 65000, "description": "Digital individuals don't have a way to formalize and keep his wills in a secure, confidential, certified and unchangeable manner", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge but the solution is clear and reasonable.\r\nThe goal of using DIDs to transfer NFTs at specific events aligns with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users. Being open source the code could be used for other purposes which could accelerate any potential scaling however my sense is that this is not a viral Dapp.\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposers have not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. Although the proposer team description and solution description suggests sufficient skills.\r\nThe team of has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals and but should be broken down into identifiable items specifically the amount of project management overhead in the budget.\r\nThe timetable is realistic to complete the work and shows what is being done and when.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation. The pilot features are not overly complex.\r\nBased upon my experience, I strongly agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 5, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Billions have been lost due to not having a mechanism in place that can handle a transfer to another wallet based on the conditions talked about in MySmartWill. I am concerned about the amount of money asked as it is a good percentage of the overall challenge. If this proposal is not of a success, then this would take away a good percentage of funds away from the challenge.\r\n\r\nThis is a difficult issue to solve, yet, I do believe greatly in its importance. This is a needed mechanism, and a solution for it needs to start formulation now. Perhaps, even if this proposal is not a total success: if it provides its research to others then perhaps this would be a proposal to approve. I am concerned about the lack of open source mentions in relation to this.\r\n\r\nIf some of this proposal could change in some key ways: I think it of great importance to Cardano, blockchain, and to prevent lost currency. With some development: this would be a great proposal and addresses a great concern. There must be a way to handle cybercurrency becoming lost due to the untimely death of its holder.", "q0r": 4, "q1": "I may be missing the proposal's credentials, but this proposal needs some external links to the qualifications of the developers of this proposal. This is what has me the most concerned in that the amount of money is great, but unless better credentials are provided I would be concerned about the ROI and chances of success of this proposal.\r\n\r\nOne of the main unknowns is the knowledge of the legal aspect and experience of the team which seems to be centered around management consulting. Although, this team may have these skills: they are not mentioned in the proposal.", "q1r": 2, "q2": "I have thought about this issue quite a bit, and this proposal does basically cover some good milestones toward success, as well as information that involves smart contracts and wills. Providing a proof-of-concept shouldn't be too difficult with this project, but the potential risks, legalities, and liability that could occur if a client were to loose their coins to their beneficiaries earlier than expected due to bugs.\r\n\r\nUsing an agile philosophy of letting the user's experience and provide feedback is difficult when the factors are death and life crucial factors. This element of the proposal needs legal counsel in addition to just having a smart contract and all of its needed components to execute properly.\r\nAs far as the smart contract aspect: the proposal seems to have thought this through, and perhaps for a proof-of-concept: this is plenty and the legal expert advice which could be costly: could be avoided.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I believe that this proposal effectively addresses the challenge. I perfectly agree with the fact that digital identity is an important topic to address and this project has all the qualities to be able to deal with it correctly and in total safety. The use case associated with a will and to register one's will is interesting. This project could efficiently support the development of the Cardano ecosystem as a whole. Furthermore, the proposal is inherent to the challenge. Nothing to recommend. I recommend voting for this initiative that will develop the cardano did (Atala prism) the cardano ecosystem is now completely ready for this adoption.", "q0r": 5, "q1": "The team has 20 years in consulting on financial services and innovation technology projects. So, therefore, I feel they are very qualified for this project. Furthermore, the plan presented seems well conceived in all its phases, in this context we are obviously talking about a high-level scheduling. The functioning of the pilot prototype that will be developed is well described. Moreover, it is well described even for newbies, not knowing the world of ATALA PRISM and the DAPPs well but being more qualified on NFT, I was able to understand the project very well simply by reading it. The objectives are also clear and well specified following a project timeline", "q1r": 5, "q2": "The information provided is more than sufficient, the stages of the pilot are well specified, the estimates are, in my opinion, feasible, the funds requested are legitimate for me given the effort and genuineness of the proposal. The team is well formed, there are both blockchain specialists and management specialists, the sum of all these aspects could guarantee the success of the project. I hope that the project can be born and grow as it could give Cardano new opportunities", "q2r": 5, "assessor": "z_assessor_481", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a Dapp that allow users (ATALA Prism) to record a digital will, transform it in NFTs and transfer to beneficiaries at specific events", "experience": "Proposers are SPO and they have 20+ years of experience in management consulting firm on financial services and innovation tech. projects"}