{"id": 368734, "author": "", "title": "Import passport data to AtalaPrism", "url": "https://cardano.ideascale.com/a/dtd/368734-48088", "category": 26116, "amount": 100000, "description": "A valid government ID in AtalaPrism is required to use municipal or financial services. This can only be issued by a local government office", "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable.\r\nThe goal of integrating German government IDs with Atala Prism DID aligns with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users but it would require a marketing plan which has not been budgeted.\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of one developer has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the proposal goals but not the challenge goals and is not broken down into identifiable items. The budget is for 1 year which has a deliverable of a working prototype however a public beta version could be up to 6 months later which is not funded. The proposer has not provided a plan on obtaining these additional funds.\r\nThe timetable is realistic to complete the work and shows what is being done and when.\r\nThe plan does not describe the resources necessary to implement the proposal instead referring to \"possible hardware and software\".\r\nThe proposal identifies risks and challenges to a successful implementation. The proposal identifies \"your government needs to accept AtalaPrism as a valid storage for this ID\" as a risk. This risk has a very high impact and is potentially difficult to overcome. Having a government partner showing interest in the proposal would be useful. A development team of one also poses a risk from unforeseen circumstances.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with some auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. As a prototype, the number of DID users projected would be 0 however the proposal should project out to a timeline in which the community could expect DID users to be recruited assuming future funding. When could the community expect the challenge objectives to be measurably met if this project were funded? \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The idea in theory is good, but I am concerned about whether this is legalized or not. You see, I'm not sure that an electronic reader could replace the work of a federal government. These things happen that way for a reason, and I believe this proposal goes beyond the limits that technology can draw to simplify and improve things in the world. I believe that at some point the identity of people needs to be confirmed, and this can only be done through a personal contact, that is, it depends on the country, but in mine we go to public service departments, personally. I thought it would be important for the author to find out about this legal part and inform us in the description of their proposal, because despite being a very useful tool and would add value to the Atala Prism ID, we need to know first if it is 100% possible to do it .", "q0r": 2, "q1": "Regarding the author, there is no doubt that he has all the technical knowledge and experience to successfully develop the tool. We are provided with your name, training area, published articles and research, linkedin... In other words, we have enough information to know you and trust your work. However, one thing I've been noticing especially about this challenge is: in many proposals, the authors intend to work alone. Is it really possible that such a complex project can be done by an isolated person? I'm not the most technically capable person to determine this, but in my view it would be necessary at least someone who could bridge this technology with Atala Prism ID users. That is, someone who could publicize the project, do some marketing. And also a designer, probably to make the use of this technology more ergonomic for end users. Regarding the roadmap and financial breakdown, we have information that allows us to form an overview of what is to come, but not a detail capable of producing a deeper understanding.", "q1r": 4, "q2": "We are told what would happen over 3, 6, and 12 months, in enough detail so that we can get the general picture. But what I want to say about more detail is that some of these actions could be better explained, for example: \"reading German electronic passport\". Would it be the first nationality that technology would contemplate? And as time went on, would you adopt the others, at once, or first the European ones, perhaps, since they are closer? In the \"ePassReader optimized UI\" part, the author shows concern about creating a good interface for users, but does not specify whether he would do it himself or hire a designer. About the financial division, I found some problems. For example, when he talks about possible hardware and software, it would be a good idea to establish which ones might be needed. On the part of possible fees, the same thing. And another, what would happen to those 20% if they didn't need hardware, software and fees? The author also does not establish success metrics, so that the community can follow the project well. For these reasons, I believe the auditability needs to be revised.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "This proposal effectively addresses the challenge. I would go even further and say this is the exact type of proposal this challenge was designed for. As laid out, the proposer provides an innovative way to facilitate the mass adoption of Atala PRISM without requiring government's themselves to go through the problem of issuing the passports via the blockchain at source (from a government database) but rather using existing systems (e-passports). If succesful, this could be a game change for the integration of any NFC-enabled ID to be easily ported into Prism.  ", "q0r": 5, "q1": "Based on the proposer's given experience and the plan presented, it is highly likely that this proposal will be implemented successfully. I really appreciate the clear articulation of the proposer's milestones and deliverables. I also value that the proposer shared their CV and publication record, which adds significant confidence that they have the ability to deliver. \r\nThe plan as presented is comprehensive and provides an excellent path forward that voters will be able to see, it also shows that the proposer has put effort into thinking through each of the components. \r\nThe reason why I am giving this a 4/5 and not a perfect score is that I think there is an assumption gap that governments (that are issuing the original IDs) will be willing to allow citizens to \"port over\" their government-issued IDs to essentially a third party app. To get a perfect score on this category I would have liked to see a description of how the proposer plans to engage national governments to get their buy-in. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The proposer has clearly articulated key milestones and deliverables that can be measured against, voters will easily be able to track progress and know whether targets are being met or not. The development of a working prototype is also exciting and if successful can have the power to facilitate the rapid adoption of Atala PRISM. \r\nWhile the budget could be broken down in a slightly better manner to show more tangible expenditures, it seems reasonable to me given the potential for return such a tool could bring. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}], "solution": "Import your passport data to your AtalaPrism account and create a valid government ID by reading your ePassport with your smartphone via NFC", "experience": "IT Consultant with 10y experience and researcher in social software area. Published papers in journals and conferences. Plutus Pioneer."}