{"id": 369236, "author": "", "title": "Generic certification solution", "url": "https://cardano.ideascale.com/a/dtd/369236-48088", "category": 26116, "amount": 49920, "description": "Thousands of small businesses and organizations are certifying skills and knowledge in the analog world. How can we onboard them to Cardano?", "f6_no_assessments": 5, "f6_rating": 3.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem and solution statements are clear and reasonable.\r\nThe goal of hosting a Software as a Service certification service using DIDs aligns with the challenge objective.\r\nThe proposal is unlikely to able to scale to drawing in millions of DID users since it has no existing interested partners and no marketing plan to attract partners. The proposed hardware platform, presumably a cloud service, should be defined to indicate scalability from a technical perspective.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of one developer has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals and is broken down into identifiable items.\r\nThe timetable is realistic to complete the work but should better explain what is being done and how.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal should identify risks and challenges to a successful implementation. Specifically the lack of existing interested partners and a marketing plan to obtain them is a major risk to meeting the challenge objectives. A development team of one also poses a risk from unforeseen circumstances.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with a defined timeline but it does not have auditable milestones.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals up to the 2 year hosting period defined and the recruitment cost per DID user. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"q0": "I believe this is a really effective proposal that will have a great impact on driving participation. Organizations to track compliance and measure KPI's accurately, while utilizing a decentralized ID/Certification protocol that will be able to set themselves apart from competitors.", "q0r": 5, "q1": "It looks like there is a clear plan of execution and I believe we have a community of helping hands that can participate and get this proposal going. ", "q1r": 4, "q2": "I am failing to see or justify the need for even the resources that is being requested. Given that this is an open-source platform with many people that could participate, I would assume the capital you are asking for could be utilized more efficiently. ", "q2r": 3, "assessor": "z_assessor_355", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Building the software for a generic approach would be great, but we also need someone to push it out there for real world use. Otherwise it would just sit there.\r\nIf you teamed up with a marketer/sales person then could have given 5 stars.", "q0r": 4, "q1": "To build the software I think they would be ok, but as a one person team it becomes difficult to also sell your software into the real world to get adoption.\r\n", "q1r": 4, "q2": "Quarterly milestones were provided. \r\nWould be great to have 2-week iterations to measure against. Although this is hard before a project even kicks off.", "q2r": 4, "assessor": "z_assessor_434", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal has thoroughly looked at what the frictions are towards Atala PRISM DID adoption from companies in the real world and how one would best gap those. If successful, this solution would likely make cardano the no-brainer solution for the large market of professional certifications (ranging from education to buildings, productsm tools etc. \r\n\r\nCA Background so voters can have a stronger view on the provided assessment: Finance and ML academic background and currently senior associate at an early stage B2B Venture Capital fund", "q0r": 5, "q1": "The proposer not only brings a wealth of relevant experience, but is also very open having shared recent projects to back it up. The budget has a detailed breakdown. Given the size of the project, the estimated costs are +$80k. This puts it in the uncomfortable spot of being not attractive enough for a software developer, but too complex for a community. As a result the proposer will take on the full job and pay c.$30k out of pocket.\r\n\r\nGiven the potential impact, and quality of the proposer I would even have suggested to grant the full $80k. The main concern I have is that working alone on such a big project, which is expected to take ~12m motivation might drop along the way. I would have loved to see a team working on this, indirectly creating some more accountability and providing support through the ups and downs", "q1r": 4, "q2": "The proposer has broken down a quarterly timeline with certain milestones. However given the complexity and ~12m timeframe of the project it is difficult to quantify progress. On the other hand, given the opensource nature the work is still transparent  ", "q2r": 4, "assessor": "z_assessor_576", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is excellent and effectively addresses the challenge. The proposer has clearly thought about their problem statement and offers an innovative solution that could be adopted by any group or organization. In addition to being well thought out, the proposer clearly identifies the need for a community solution to a fairly wicked problem, globally. While the proposer notes that everything is certified in the developed countries already, it is likely that this solution would be for new companies, as well as those already well situated. Providing a solution that works in both the developed/developing contexts will have an even greater impact and positive effect for the community at large. If successful, I feel very confident that this would return huge dividends for the Cardano Community. ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. The proposers lays out a very clear argument for why this is a problem, and breaks down the solution into smaller tangible pieces that articulate to voters the steps necessary to reach the end goal: \"open-source software where everybody can issue and claim certificates\". In addition, the fact that the proposer outlines that this is an open source project, the community will have ample opportunities to test out the product, adapt it, upgrade it, and so on. This intention to return the final product to the community also can give faith to the community that this project will be implemented successfully. The proposer is encouraging this dialogue, which is a necessary step in building voter confidence. \r\nI must also note that at first when I read the budget I thought it was a bit high but completely reasonable, given the potential for disruption such a system could have. The fact that the proposer then cuts that budget in half and will incur half the costs themself is a true testament to their commitment. This also implies that the proposer is willing to take the risk that this project will be a success and is willing to back it up with his own money. A first of all the proposals I've reviewed. ", "q1r": 5, "q2": "The information provided is certainly sufficient to audit the progress and success of the proposal. The proposer has clearly thought about the necessary components that would need to align in order to complete this project. The metrics to measure and success criteria are explicit and can easily be evaluated by the community. \r\nAs mentioned in the response above, there is an additional layer of auditability which can be applied to this project through the proposer making it open source. This condition will allow a diverse mix of Cardano developers and users to engage with the developed software and to adapt it to their needs. This, at least to me, will result in the project being evergreen and iterative throughout it's lifetime. The ability to continually adapt and improve is a foundational feature of the Cardano ecosystem and I really appreciate integrating this feature into catalyst projects. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "A generic whitelabel open source certification software allows companies to explore the possibilities of certifications on Cardano.", "experience": "Björn Sandmann: 8+ years of full stack development with the .net Stack. Focused on traditional business problems and SaaS solutions on Azure"}