{"id": 369821, "author": "", "title": "Biometric<->DID Binding Credential", "url": "https://cardano.ideascale.com/a/dtd/369821-48088", "category": 26116, "amount": 75000, "description": "Verifiers must be convinced of a subject's. Identity, based on what they hold, know, and who they are. The \"who\" is often missing.", "f6_no_assessments": 4, "f6_rating": 3.4999999999999996, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable.\r\nThe goal of large scale biometric identity service tied to a DID aligns with the challenge objective.\r\nWhether the proposal is able to scale to drawing in millions of DID users depends upon the scalability of the IRespond application which is not defined in the proposal or on the website link provided.\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. The experience information provided has no names associated to it. It is also not clear from the proposal and the website provided what relationship, if any, the proposer has with IRespond.\r\nThe team has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals but should be broken down into identifiable items. For instance the $30K for \"mostly staffing\" should detail the staffing.\r\nThe timetable is realistic to complete the work and shows what is being done and when.\r\nThe plan describes the resources necessary to implement the proposal but should be more detailed.\r\nThe proposal does not identify risks and challenges to a successful implementation. Privacy risks are likely to be a perceived risk by many voters and should be addressed in detail.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Adding a biometric layer to DID addresses the challenge 1) If existing customers with Biometrics can be converted to DID it would instantly add users to Atala Prism 2) Extending the biometrics-DID combo to passports and visas, or healthcare, as mentioned in the proposal, would add additional functionality and attract more users.I would like to team to add quantifiable metrics to the proposal, how many users do the team expect to add to the ecosystem and what is the planned timeline.", "q0r": 4, "q1": "Although a link to a website was provided, I feel the proposal requires further development to ensure successful implementation. I would like the team to further expand on the type and number of team members required to fully implement the proposal, what are the responsibilities and deliverables of each member. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". Lastly, I would like the team to expand on the plan for scaling and future funding.", "q1r": 3, "q2": "The proposal has a minimal roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) (have 200 users by month 4 for the pilot, have 500 users by month 5, etc - create measurables) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a thorough roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond single line entries and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The project if fully realized has the potential to increase use of tala PRISM DID in the pilot areas and potentially expanding to India and southeast Asia.  ", "q0r": 4, "q1": "The team are experienced in the area of biometrics. The budget is at a very high level.  Budgets and plans at a more detailed level would help make this proposal more compelling.", "q1r": 3, "q2": "The plan includes milestones for a pilot deployment and launch.  Risks and challenges are not delineated. ", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "The linking of DID and biometric information seems inevitable. The proposers appear to have the resources and existing infrastructure to give them a leg up in this endeavor. ", "q0r": 5, "q1": "According to the proposal the team has strong connections to a biometric service provider as well as blockchain projects, I think their chances of implementing the proposal successfully are relatively high. There may still be uncertainties as to the final architecture of ATALA prism and the projects integration with it,  so a less ambitious \"phase 0\" proposal might be better received by the community. Future catalyst rounds would be available to further fund the project. ", "q1r": 3, "q2": "The requested funds are significant and include 5-year licensing (i assume of the iRespond platform). Budget categories are fairly broad and include costs that seem very far down the road and dependent on the success of initial stages.", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Biometrics help one prove their identity. An Identity Binding Credential will link an individual's DID and their biometric template.", "experience": "\\>2 yrs w/biometric service provider iRespond 6+ yrs Iris identification SSI VCs\n\n\\>3 yrs blockchain projects\n\n\\> 25 yrs software product mgmt"}