{"id": 369878, "author": "", "title": "Optimizing student agency with DIDs", "url": "https://cardano.ideascale.com/a/dtd/369878-48088", "category": 26116, "amount": 50000, "description": "Inequity in educational policies widens opportunity and resource gaps which systematically hinders student performance.", "f6_no_assessments": 4, "f6_rating": 3.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should be more closely aligned with the challenge but the solution description is more clear. The Cardano ecosystem value proposition, within the scope of the challenge, is either 400-900 students or 2000-3000 students (depending upon interpretation of the first bullet in the 12 month roadmap) having DIDs in 12 months which would be a recruitment cost of $16.67 - $125 per DID user which is very high compared to other proposals.\r\nThe goals of the proposal, which is mainly a marketing campaign, only marginally align with the challenge objective, in that Atala Prism is only minor add on to a campaign that primarily focuses on the Plasia platform and the campaign will not result in mass-scale adoption of DID usage.\r\nThe proposal is not able to scale to drawing in millions of DID users with the funding requested.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is not reasonable to achieve the challenge goals of mass-scale adoption of DID since the cost per DID user recruited is too high however it is reasonable to achieve the proposal goals. The budget should be broken down into identifiable items.\r\nThe timetable is realistic to complete the work but lacks details on what is being done and how in several instances.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with some auditable milestones and a defined timeline.\r\nThe proposal should more clearly include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user however these projected metrics can be calculated from the information provided.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposed idea aims to be an Atala Prism based student DID service which tracks students effort and how much a student worked / which interests and strengths and weaknesses each student has. This will create a competitiveness and aims to enhance students efforts. However in my eyes it will create immense stress to work \"more hours\" or \"eliminate all weaknesses\" as everyone would know all weaknesses. I see a huge problem for students which are not able to fulfill the working plan as everything will be transparent and saved on the blockchain. In the way how it is proposed it will be a complete loss of privacy enhancing a competitive environment which is, scientifically proven, not enhancing real productivity and creativity. Thus it may result in bigger adoption of Atala Prism (because it uses Atala Prism), but this won't be for long in a world where mental health and stress is a growing concern. \r\n\r\nI suggest to overthink the concept once again and get some teachers, professors, didactic professionals in the team besides business peoples to know what is asked in the field. ", "q0r": 2, "q1": "More and more institutions and universities care about the mental health of their students and creating an environment without privacy within a system that supports long working hours and achievements on paper over health and creativity is not going to have a long lasting impact as creative minds and students at universities will disapprove this surveillance enhancing concept in a world where freedom is a primary goal. ", "q1r": 2, "q2": "The proposal describes in detail which milestones are to be reached at different timepoints. Therefore an auditing is easily possible. ", "q2r": 5, "assessor": "z_assessor_465", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "It is unclear how this proposal addresses the challenge of mass-scale adoption given that few details are given about the \"Data locker\" referred to in the solution statement. Information provided about the Plasia token is also lacking.", "q0r": 2, "q1": "Some budget items seem excessive given the lack of reference information. For example 25k for web development. A lot of the budget is devoted to marketing - but what is being marketed is unclear and lacks substance. Because of this uncertainty it is unlikely that there will be a successful implementation.", "q1r": 2, "q2": "I have been unable to track down Plasia and no web links are provided.\r\nThe Learnerscape GitHub repository ( https://github.com/LearnerShape?tab=overview&from=2020-12-01&to=2020-12-31 ) has only 1 contribution from 2020 which is not indicative of active development.\r\nA lack of detail about the proposed \"consent-based authorization\" and an emphasis on data collection raises concerns about data privacy. \r\nNo key performance indicators are given to measure how the marketing effort would drive mass adoption.", "q2r": 2, "assessor": "z_assessor_597", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is an excellent entry in this challenge and could certainly facilitate the mass adoption of Atala PRISM in the future. This innovative use of blockchain to develop a tokenized way that encourages children to attend school and thereby get paid for it is really exciting, not to mention using the data collected of the students to sell to interested employers and recruiters adds an additional layer of utility. The targeted learning options and mentor support throughout all aspects of their education is unique as well, backed by the safety of all documentation and credentials being protected on Cardano, it's hard to see how this project wouldn't have an impact. \r\nThe addition of the AI component also increases the potential impact of this proposal. The interplay between two cutting edge technologies in the educational space and the promise it brings is definitely worth voting. ", "q0r": 5, "q1": "I completely believe that given the experience and plan presented here that it is highly likely this proposal will be implemented successfully. The level of detail and thought throughout this proposal exemplifies the preparedness and background of the proposers. The roadmap as presented is clear with each stage building on the next. \r\nI resonate with the proposers when they say their \"absolute focus of the first year is to help users understand what DIDs are, why they are important and how to use them safely.\" Given the steep learning curve with new technology, I think this is reasonable and necessary. \r\nThe speaking engagements already lined up also provide confidence to voters that this project is ready to go, which also means that voters may be able to see results more quickly than other projects; something some voters may prefer. \r\nThe milestones and deployment plan are clear and easy to follow. The budget seems reasonable and there is a good breakdown. For the price tag, if this project can deliver, it'd be a steal. ", "q1r": 5, "q2": "All the information provided in this proposal is sufficient to be audited for progress and success. The team provides a suite of objectives, milestones, and deliverables in the proposal. Each is well thought out and articulates what voters can expect for the money being spent. \r\nGiven that there are several prototypes and videos being developed, the community will be able to decide whether the project is a success or not. \r\nMy only critique here and why I am giving 4/5 is because I would have liked to see the proposers bring in the Catalyst community a bit more in explaining how they plan to give back if funded, beyond simple \"exposure\".  Once developed would the tools then be shared with the community? Will the data agreement focused on consent-based authorization that is written be offered for guidance for others doing similar work? Great work overall. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "Data locker with DID & AI that tracks/connects mastery hours, academic info, & career interests which provide insight to career exploration.", "experience": "7Y collective experience: business management, sales, marketing, brand awareness, strategic consulting, human capital, Robotics, Design, Art"}