{"id": 366736, "author": "", "title": "Visual DAO Framework", "url": "https://cardano.ideascale.com/a/dtd/366736-48088", "category": 26094, "amount": 72350, "description": "DAOのシミュレーション＆ビジュアライゼーションにはアクセスできません。", "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=37072"], "media": [], "f6_assessments": [{"q0": "This proposal is to build a visual framework to help understand DAO. Unfortunately it really seems hard to understand what they are really building. I have a PhD in Engineering and IT, which focused on Machine learning in autonomous systems including graph theory. I don't understand what they are trying to achieve. Maybe its just me, but this doesn't bode well given the point of this is to make understanding a DAO easy for everyone.\r\n\r\nIts not clear the graph they are trying to produce will be a both a sufficient condition for a DAO to be Viable. \r\n\r\nPerhaps they should first focus on a smaller project which  produces a working paper of what they are doing and explains to all target users what it delivers.\r\n", "q0r": 3, "q1": "The team has some good experience, but given the proposal it to create something that makes it easy to understand DAO's, the lack of a proposal that's easy to understand is an issue.\r\nHow does the budget line up with the deliverables under the time line? It seems like a lot of what will be delivered and how it will be delivered is still to be decided, thus its hard to give this a high probability of success.", "q1r": 3, "q2": "The project has a list of deliverables and timelines which will be possible to audit. This is made harder though as the budget is not linked to these. \r\nThe proposers have set the deliverables under the heading of success. However success should be the outcomes the delivered framework enables. How are they going to measure these. What goals are they attaching to them?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 23, "ne": 7, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "Interesting proposal as this tool aims to bring developers to Cardano ecosystem and to give the ability to test different components of/or the entire DAO app that might be created by the developers using the framework and this is articulated well in the presentation. Mentioning the \"non-coders\" as target audience as additional to the \"coders\", could be a plus, but I don't think the impact will be broader, as a framework will help more the people familial with coding or at least to have the necessary technical skills to understand what they are doing.\r\n\r\nThe proposal presents, in a clear manner, how the members of the community will be attracted to take part into the project, and all work done by the development team will be publicly available through various channels ", "q0r": 4, "q1": "The team, as it is presented, is not yet complete and this could be an issue, if is not addressed in a reasonable time period.\r\nThe developers, that already are part of the team, have the experience emphasized and sustained with evidence from a well known social network.\r\nThe proposer knows the type and number of team members required to implement the proposal, but, being a DAO project, a member with knowledge about financial services, could be a plus for the team.\r\n\r\nThe budget is outlined clearly and broken down into identifiable items, and is reasonable for achieving the set goals. The component for \"Development Lead\" is more than 30% of the entire requested fund, and seems to set a high threshold for a position, even it has high responsibility, is not necessarily required to preform tasks on a daily basis. Presenting the task performed for each member of the team will make it clear how funds are spend for this unit.\r\n\r\nThe plan describes the resources necessary to implement the proposal and explains technical aspects to a high level (architecture, technologies, programing languages etc.)\r\n\r\nThe proposer doesn't provide info regarding any risks relevant to a successful implementation. Is hard to believe that any project can be implemented flawless without any constrains, and is better to be aware of them (or most of) before the project starts.\r\n\r\nThe proposal offers a realistic timetable to complete the work and some KPIs to measure the outcome.\r\n\r\n\"Registration will be first come first serve for interested parties that submit short descriptions of why they would like to join and what they plan to contribute.\" -  this statement seems to be somehow restrictive for the people interested. A wider audience can be healthy for the project development.", "q1r": 3, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon. Metrics are provided to measure the success of the project.\r\n\r\nThe proposer has not mentioned possible risks and how to deal with them.\r\n\r\nThe quality of the proposal suggests that the proposal is aware of the challenges, but for outsiders is somehow difficult to understand the made statement, as is required a level of technical knowledge.", "q2r": 4, "assessor": "z_assessor_309", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The challenge asks us how we can make the developer experience positive. This proposal seeks to improve the developer experience in Cardano by creating a unique new visualization tool for a new class of infrastructure appearing in the web3 world, DAOs. The proposal correctly states (I think) that DAO visualization/simulation isn't currently possible (though I haven't done an exhaustive survey web3 so I'm not 100% this is correct). Creating this unique new infrastructure will certainly improve the developer experience in the ecosystem.\r\n\r\nOn top of just improving the developer experience, this tool will also improve the experience of non developers in navigating the complex world of web3. This tool will simplify complex topologies and make it easier for participants in the cardano ecosystem to understand what's going on and therefore how to positively interact with entities (people, DAOs, projects, etc) within the ecosystem.\r\n\r\nThe roadmap is well defined with community conferences and working groups and the project aims to have an alpha version ready within 4 months. This is very reasonable. I like that the proposal aims to have an alpha completed before asking for more funding.\r\n\r\nThe deliverables of this project are well outlined and easily confirmable. Many of the success criteria have numeric metrics like \"Held four (4) community events and distributed all prizes and participation rewards\". \r\n\r\nThere's an open question of scalability but that's not possible to know ahead of time since phase 1 of this proposal is research based. I have full confidence (being a former engineer myself) that the team will be able to find a scalable software solution during the R&D phase and that future scalability challenges can be addressed when they arise. \r\n\r\nBecause of these reasons I give this proposal a rating of 5 for impact. ", "q0r": 5, "q1": "It's extremely difficult to assess the likelihood of success for projects/ideas that are so research heavy. This proposal is cutting edge innovation and being on the edge means there's less prior work to be inspired by. \r\n\r\nThe team has lots of experience in the world of software and has provided links to LinkedIn profiles. Their profiles indicate they have decades of cumulative experience in the technology industry. This is a strong positive signal.\r\n\r\nThe proposal claims that \"We are still looking for a mathematics & foundations consultant\". It's great that they're specifically calling out this need but at the same time there's a risk that they don't find the folks they need for the foundations team. This is a big risk.\r\n\r\nThe execution plan seems well laid out starting with understanding the problem space before diving into engineering. The execution plan is also spread across several funds which emphasizes the iterative nature of the teams approach to this problem. These are very positive signals. \r\n\r\nI would personally like to see a \"Risk and Challenges\" section outlining how the execution of this proposal might ultimately fail. \r\n\r\nIt's not precisely clear if the requested budget is just for the 3 month milestones or for the 3 and 6 month milestones. More clarity on this would be nice.\r\n\r\nOverall I think it's hard to effectively determine whether this project will succeed or fail because of how much upfront research needs to be done. It's a very technical problem at the cutting edge. There are reasons to believe that this will succeed but I don't personally see enough to tilt me towards a positive feasibility rating. Because of this I rate this 3 for feasibility.", "q1r": 3, "q2": "I think this proposal is structured for a high degree of auditability. I especially like numeric deliverables such as \"Visually represent the three (3) test cases adhering to consensus architectural constraints\" and Held four (4) community events and distributed all prizes and participation rewards\". These will be easy to measure as a community. \r\n\r\nI think many of the other deliverables are also easy to test. For example, framework documentation, reaching consensus on primitives and launching a PoC/Alpha are all easy to confirm.\r\n\r\nOn top of all that, all of the metrics/goals/desired outcomes closely relate to the problem at hand and will clearly demonstrate whether further funding should be awarded in Fund7/8. \r\n\r\nBecause of these reasons I give this proposal a 5 for auditability.", "q2r": 5, "assessor": "z_assessor_531", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is a fantastic approach to dealing with the challenge on getting participation in a DAO, which many non-technically inclined people might be not inclined to use to to no easy to use interface.", "q0r": 5, "q1": "The team has enough experience that I see it being likely they can deliver within the time frame specified in the roadmap. ", "q1r": 4, "q2": "They are looking to implement two phases, and plan to deliver the roadmap in 12 months. The proposal is quantifiable and therefore it will be easy to measure success of this proposal.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "コードに忠実なビジュアルを自動的に生成する標準とフレームワークを構築し、誰もがDAOの機能をプレイしたりシミュレーションしたりできるようにする。POC\\[1]", "experience": "チーム体験\n\n20年以上のデータ/MLエンジニアリングの経験。フルスタック開発。テストマネジメントプロジェクトマネジメント認定"}