{"id": 366904, "author": "", "title": "Layer 2 Advanced Architecture", "url": "https://cardano.ideascale.com/a/dtd/366904-48088", "category": 26094, "amount": 200000, "description": "Cardanoは、大量の不規則で複雑なデータを高速で処理する最先端のレイヤ2データソリューションを必要としています。", "f6_no_assessments": 4, "f6_rating": 1.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "There is no detail in how this project would successfully manage 90% of financial data and workloads off the system. Please provide and actual plan on how you would deliver this.", "q0r": 1, "q1": "There is not plan, timeline or technical details. There is no budget breakdown. Please provide these and explain how you have or will pay for the experience to deliver.", "q1r": 1, "q2": "As no detail has been provided on what will be delivered when, it is not possible to audit the successful delivery of this proposal.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 28, "ne": 3, "ng": 17, "nfo": 8, "vca_o": 1, "reply": "detailed in proposal"}, {"q0": "The proposal is misplaced and it should be in the \"Scale-UP Cardano's DeFi Ecosystem\" since the main idea of the proposal is to scale through a layer 2 solution which resembles what this project aims for more closely than the \"developer ecosystem\" given the description of the challenge and the description of the proposal.\r\nThe problem statement \" that will handle large volumes of, and high rates of, \" is missing some words, you might want to add in to better explain the problem you're trying to solve.", "q0r": 2, "q1": "To give some context I'm a developer with a degree in economics. \r\nI don't believe the proposal will be implemented successfully. Here's why:\r\nTo paraphrase what Marvin Bertin said in the comments: If this solution aims to build on top of the Cardano Hydra layer, it would be a good idea for the proposal to wait until it's release otherwise it would be a pointless effort. Keep in mind that that's a complex piece of machinery and I suggest you put your clear plan on how will this GPU card be maintained and developed on.\r\nMeaningful questions in the comments weren't answered with the same level of respect or details given.\r\nThere is no clear connection or explanation between the given solution and the statements about \"ADA to spend like money\" and \"leverage your crypto as an asset for a FIAT loan\" which should be explained in a proposal.\r\nAlthough I read through the content of the linked documents and watched your linked video several times, I do not see how the Gordian Knot document is supporting or relating in any way to your proposal, so I'd suggest making a clearer point in any new proposals you make to help the community grasp your idea.\r\nAfter reading through \"Secure decentralized peer‑to‑peer training of deep neural networks based on distributed ledger technology\" I fail to see how will incentivizing peers to provide data to train a neural network, be beneficial for cardano? I don't understand what exact data is to be provided and to what end? I suggest reading through your proposal through the eyes of a stranger to your proposal and try and describe the proposal in more detail.\r\nMost of the \"summary of the notes given to the proposal by community advisors\" given in fund5 is ignored here.\r\nQuestions about the team for this project asked in fund5 also lacking here.", "q1r": 2, "q2": "I don't believe there are any key points mentioning any kind of possible audit checkpoints or variations of enabling progress tracking.\r\nEven though I'm not convinced you need the aforementioned GPU for the sake of argument: you buy one which is priced at 149 000$ per unit (which by the time Hydra gets released might be more due to lack of chips and inflation rates) and you're left with 51000$ which should be enough for: (1) \"hiring\" the IOHK to do the \"software mods\". I haven't seen any proof that an offer was extended to you by the IOHK for the sum of 51000$ or less for the job you describe. (2) having a team to work with you for the aforementioned goals of the proposal.\r\nNo mention of any kind of funds distribution.\r\nI have a hard time believing in this proposal.\r\n", "q2r": 1, "assessor": "z_assessor_536", "no_vca": 9, "ne": 4, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "The same proposal was in the same category last round."}, {"q0": "The proposal somewhat addresses the challenge in respect of technical developments than need to occur in the backend on IOHK to scale. But The project is trying to make the process fully decentralized, meaning they would hold less centralization in achieving this objective and putting it to the stake pool operators hands. Sidechain could hinder that aspect of decentralization by having direct ties to its proceeding and upkeeping.", "q0r": 3, "q1": "The plan appears to be straightforward and interesting in approach and the experience in the matter is evident. This could be achieved by stakepool operators with more education in the system infrastructure upgrades and perhaps achieved in a decentralized manner as opposed to IOHK doing something about it.", "q1r": 3, "q2": "There is a lavk of clarity as to the roadmap or stage by stage process how the proposer intending to achieve its plan as well as a lack kf breakdown of the funds to highlight how the progress is audited throughtout its development stages.", "q2r": 2, "assessor": "z_assessor_594", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "ships after Hydra and is staked until then"}, {"q0": "I think this proposal could help with bringing more adoption and proposals from entrepreneurs, but considering this is reliant on Hydra it wont bring adoption in the next to funding rounds.", "q0r": 3, "q1": "It seems the proposer has the knowledge and experience to implement their plan, but they do not give enough details on their plan as to how and when. They show supporting material on GPUs, the Cardano whiteboard, and a few others, but that directly supports the planning of this proposal.", "q1r": 3, "q2": "This proposal shows supporting material on GPUs, the Cardano whiteboard, and a few others, but that directly supports the planning of this proposal or how they will measure success. It is nice to see you are in contact with IOG and planning on hiring their devs, but theres not enough information at hand to hold the proposers accountable and measure their progress.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1, "reply": "material attached"}], "solution": "コミュニティやチャリティに貢献する非営利団体としての分散型AIシステム。", "experience": "Cardano Wise'rdです。Ben Goertzel氏にはシステムのトレーニングを、IOHK氏にはソフトウェアの改造をお願いしています。"}