{"id": 367051, "author": "", "title": "CardanoSharp - UnrealEngine SDK", "url": "https://cardano.ideascale.com/a/dtd/367051-48088", "category": 26094, "amount": 10180, "description": "UnrealEngineゲームエンジンを使用するゲーム開発者は、ゲーム内でトークンやNFTをサポートするための簡単な統合ソリューションを持っていません。", "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This could be a great idea, unfortunately there are not details in the plan.", "q0r": 3, "q1": "The proposer has the skills having delivered (and being in charge of a ) related proposal this will build on. No real plan or timeline has been proposed. If we look back at the original proposal funded in round three there was a clear budget and timeline breakdown (https://cardano.ideascale.com/a/dtd/CardanoSharp-NET-Library/333629-48088), this has none of that.", "q1r": 4, "q2": "As there is no clearly defined timetable for delivery of the idea, how can we audit its progress. What metrics are you using to monitor success. I assume number of games using it, number of tokens minted etc. These should be both measured but also have goals set for them prior to funding.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 13, "ne": 3, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "As an experienced GameDeveloper (C# Programming) and after reading this proposal (and checking the Discord and Github links, more on the next review section) i can say this really addresses the goal of this challenge. The problem solution is clear, In engine integration for Tokens and NFTs management for UnrealEngine, if it is well executed (wich I think the team is capable of) the positive impact on Cardano becomes self-evident. As a logical consequence, this improves the productivity of current developers and attracts new ones (myself included). I rate it 4 stars (it would have been 5 if they had mentioned the security approaches to apply). A proposal to consider.", "q0r": 4, "q1": "Although there is no roadmap, nor development phases (perhaps it is because they have other proposals in this Fund6 and they are directly / indirectly connected with the mother proposal that is the SDK, that is this one, it becomes difficult to plan the times). What really gives the vote of confidence is that the team is the winner of Fund3 (creator and maintainer) with its \"CardanoSharp .NET Cryptographic and Serialization Library\". The developers are very attentive to their Discord community, answering technical questions promptly and carefully. Their team work can be monitored. Although I would have liked to have more information (those already mentioned, their ramifications and the approach to security measures), they seem to have taken everything into account. The price is reasonable", "q1r": 4, "q2": "Similar to what i explained in the previous review section and due to the evaluation dynamics taking into account what was presented in the proposal, although there is no roadmap, nor development phases (perhaps it is because they have other proposals in this Fund6 and they are directly / indirectly connected with the mother proposal that is the SDK, that is this one, it becomes difficult to plan the times) what really gives the vote of confidence is that the team is the winner of Fund3 (creator and maintainer) with its \"CardanoSharp .NET Cryptographic and Serialization Library\". The developers are very attentive to their Discord community, answering technical questions promptly and carefully. Their team work can be monitored via Github / Discord (where they currently publish progress). It would have been good if they were clearer with the composition of the team (after the time invested, it can only be deduced that the team will be the same as Fund3). Taking everything into account, my score is a 4 (although at first glance it seems to deserve a 3 in this section).", "q2r": 4, "assessor": "z_assessor_277", "no_vca": 10, "ne": 3, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "Unreal engine is a gaming engine used in a large number of games. It was introduced in 1998 and has a large user base. Cardano plugin for Unreal will enable utilization of Cardano NFTS for Game earning and collectables. These can be further traded in the Cardno markets. The gaming market is huge and the plugin will unleash the power of Cardano Native token NFTS into the Unreal engine based games.  ", "q0r": 5, "q1": "The proposers have created a serialization library and have the proven credentials to carry out the task proposed. The team has five contributors in the Cardano-wallet library and after going through the git hub I feel the quality of the development is very good. ", "q1r": 5, "q2": "The scope is clear with almost one success parameter . A Cardano Network plugin for unreal engines. The team has proposed 10.5K USD which can be seen as a payment for one dev for 3 months. Therefore the parameters are clear and thus the project is clearly auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "インエンジンのネイティブな体験を構築します。開発者は、ファンドやトークンの作成、管理、配布を可能にするプラグインを使用します。", "experience": "Fund3プロポーザルの作成者兼管理者。CardanoSharp .NET暗号化・シリアル化ライブラリ。UE4の生成ツールのビルダー"}