{"id": 367448, "author": "", "title": "Gravatar for ADA Wallets", "url": "https://cardano.ideascale.com/a/dtd/367448-48088", "category": 26094, "amount": 87700, "description": "ハッシュ化された公開鍵ベースのウォレットアドレスは、人間が読むことができず、パーソナライズもできません。", "f6_no_assessments": 2, "f6_rating": 5.0, "videos": ["https://youtu.be/QoHxrFBM0fY"], "media": [], "f6_assessments": [{"q0": "This could be a great way to be able to send funds in a more human readable format. \r\n\r\nMy biggest concern with this idea is fraud related to changing a single pixel which a machine can see, but a human cannot. This could lead to someone being tricked into  sending funds to the wrong address. See the huge amount of research in adversarial machine learning in computer vision where for example tiny changes can make the computer see a 60mph  sign rather than a stop sign with obviously terrible consequences for autonomous vehicles.", "q0r": 5, "q1": "This is a well set out plan with milestones from a strong team. I would expect them to be able to deliver as planned.", "q1r": 5, "q2": "The team has set out a clear path to delivery, with timelines, and metrics for success with attached goals. This project is well defined to allow progress and success to be measured.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The long hash-like wallet addresses are difficult for people to comprehend and use. It also has security issues like changing of few numbers that can be used for spoofing the address while making transactions. Gravitar based QR Coded wallet addresses can provide a user-friendly experiance while using Wallets. ", "q0r": 5, "q1": "The proposal is backed by five persons with combined developer experience of more than 20 years. The members are also active contributors in the Cardano community who understand the requirement in full. Therefore implementation will be carried out in the best possible manner. ", "q1r": 5, "q2": "The project has been divided into three phases with KPI for each phase. The project's output is verifiable, and the progress can be monitored roughly for inspecting the commits. Therefore it will be fairly easy to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "トランザクションに使用できるウォレットに関連付けられた、パーソナライズ可能なアバター。簡単で安全に使用できるAPIを提供する。", "experience": "ソフトウェアエンジニアとPlutusのパイオニアからなる経験豊富なチーム。"}