{"id": 367403, "author": "", "title": "Mobile App Template For Blockchain", "url": "https://cardano.ideascale.com/a/dtd/367403-48088", "category": 26094, "amount": 180000, "description": "多くの素晴らしいプロジェクトが、ネイティブのモバイルクライアントではアクセスできません。iOS/iPadやアンドロイドのフロントエンド・クライアントを作成して、他のプロジェクトで使用してもらうのです。", "f6_no_assessments": 5, "f6_rating": 3.0666666666666664, "videos": [], "media": [], "f6_assessments": [{"q0": "This seems like a good idea, however the proposers are asking for a very significant amount of money in 180,000, and have not really set out the clear path the successful development of the product.", "q0r": 4, "q1": "This is a lofty goal with a large funding request. However there is scant detail on how the funds will be spent (other than it is for 3 salaries for 12 months). What languages will the application be built in. How will developers integrate with it etc. When asking for 180,000, I'd like to see more evidence of capability that a statement that we have done it in the past. Linked-in profiles maybe?", "q1r": 2, "q2": "The proposal seem very generic in terms of the roadmap. What specifically is being delivered for this project and how do we measure it. For the size of funding requested, I think success should be higher than just working with one project as I'd expect a single project to be able to produce a mobile interface for significantly less. To work this needs to produce a scalable solution that easily plugs in many projects.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The availability of mobile apps template suitable for dApps will have a very positive impact on the growth of the Ecosystem. This will also result in the rapid development of aApps and very little load on the smart contract developers. Mobile has a very high penetration than the internet and the availability of mobile apps will have a great impact on proliferation. ", "q0r": 5, "q1": "The Github account referenced has 46 repositories reasonably activity in the last four years. The composition of the development team and the team's experience are not clear in the proposal to enable better evaluation.  Reference to the developed apps claimed to have been developed would have given a better picture of the team's capability. ", "q1r": 3, "q2": "The proposal is for funding 3 front end developers (to be hired) for one year at the rate of 60K $ for a front end dev per year. The scale of work involved in building the project is not very clear. However, the scope of the project is divided into 4 stages with the the final step is in consonance with at least one sDapp. The collaboration is not yet identified. With the provided details it is difficult to assess that the project will be auditable. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I asked myself: why I am so unsure of the above question? - As the problem, the proposal is going to respond to is really important. \r\nI concluded that this proposal - might have missed the title of the campaign: Developer ecosystem. \r\nI believe that it might be a great answer to one or two other topics in round 6 - not exactly this one.\r\nTaking into consideration this metric: - Number of developers actively building on top of Cardano. I agree that this proposal improves the market adoption but not directly the number of programmers involved in Cardano.\r\nOn the other hand, I would agree that the proposal is in line with another metric: - What are enterprise dev managers looking for to be able to build out enterprise projects - either internal or commercial?\r\nSo, in all, I neither agree nor disagree", "q0r": 3, "q1": "While reading the proposal, I have noticed that the word 'we' is used several times. I went to GitHub and to the website of the proposer and was not able to find an answer.\r\nIt would be great to find out who stands behind. Also, the website does not bring any information about realized projects or satisfied clients (it is possible that I missed something).\r\nWhat concerns the plan I would say that might be much more fruitful to have it not only concentrated on milestones but rather on BAU tasks scratched over the timeline. \r\nI would be very interested in the team-building plan as I suppose that can be a real challenge these days.\r\nI have to admit that the required $180,000 has not been explained or broken down into identifiable items.\r\nSummarizing: Given the experience and plan presented it is highly likely this proposal will be implemented successfully - I would disagree.", "q1r": 2, "q2": "There are only three milestones during the first six months, which months are crucial for the proposal. There are no given clear metrics defined. \r\nHaving clear metrics and short runs between milestones would allow to quickly diagnose the possible obstacle or failure and undertake the correct action.\r\nIn conclusion - the information provided is sufficient to audit the progress and the success of the proposal - I disagree with this statement.\r\n", "q2r": 2, "assessor": "z_assessor_527", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to develop a template for native iOS and Android apps to communicate with the Cardano blockchain.\r\nThis proposal is in between the dev ecosystem and dApps and integrations campaigns.\r\nThe idea is good and would drive utility both for developers and the Cardano developer ecosystem. To make sure this framework is usable the team aims to first implement an actual dapp that will be live to end users. This is a good thing. As a Solutions architect, I've seen a lot money spent on cool tools and cool architectures wasted, because they were not really good solutions in the real world. \r\nHowever it is a long time line the team has proposed and a long time until the proposal will give effects to the community.\r\nThe team aims to build the template in React Native which limits the use cases of the apps built on the template, and thus the usefulness of the  template. (I'm s Solution architect who have had to do these trade-offs before.)", "q0r": 4, "q1": "The team has a plan to create the apps and the open source template for iOS and Android. But it is not very detailed.\r\nThey have not provided a breakdown of costs, and they are requesting quite a lot of money.\r\nThe Github repository shows that at least one of the team members is an experienced frontend developer, with some Solidity skills.\r\nBut no experience from Kotlin or Swift (Android and iOS languages respectively), and it is not clear if anyone is a Plutus Pioneer, so they might not be very familiar with the quirks of Plutus.\r\nThey mention that they will hire 3 remote mobile developers, but not any Haskell developers.\r\n\r\nThe team does not discuss any risks in their proposal. \r\nSince they are inexperienced with Plutus, but aim to create a scaffold to be used for a long time, I would consider it a risk that the template is not up to standard, if they do not bring in an experienced Haskell programmer.\r\nOther risks such as that there will be low adoption of the template or the app is not disucssed or mitigated in the proposal.\r\n\r\nThe team has given themselves a long time to fulfill the proposal. During this time other templates might be developed.\r\n\r\nIt is not clear how the maintenance of the app template would work.", "q1r": 3, "q2": "While the idea is good and might have impact on adoption and ease of developing mobile dapps, there is not much detail on dates and deliverables  to the wider community.\r\nThe team will want to hire 3 developers and start building a scaffold and has a quite aggressive plan to have this done with basics such as authentication, navigation, etc. after 3 months. \r\nThere is no reporting back to the community added here but I guess that can be amended.\r\nAfter 6 months they plan to launch an MVP and by 12 months have a full product, documentation and a public component library. \r\n\r\nThis is a very high level implementation plan, but there is no break down of costs. There are only a few measurable deliverables and they are quite far away in time. Preferably there would be at least monthly reporting back to the community and sharing of experience. \r\nSince the team plans to hire developers, what is the contigency plan if they do not deliver? How will the project make sure the treasury's money is put to good use?\r\n", "q2r": 2, "assessor": "z_assessor_533", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The goal of the project is of the highest importance to help the adoption of real applications on the blockchain.  The proposers also plan to work with other Cardano projects, and have identified an initial partner who would adopt their framework.", "q0r": 5, "q1": "Budget and its use for hiring staff is clearly described, and the proposer seems capable based on their GitHub activity and business, although evidence of significant past deliverables could be provided.\r\n\r\nWhat I am missing is a bit more comprehensive outline of the proposed application framework, in particular, its level of abstraction. Will it be just a simple interface to Cardano? Will it run the offchain components of Plutus apps, connecting to their endpoints and allowing to style the interface? The latter could turn out to a challenge on iOS due to the restricted nature of the platform, but, on the other hand, having to rewrite the offchain component of a dApp in another language could easily introduce serious errors (including lost funds due to \"type unsafety\" when the CBOR in a transaction doesn't match what the validator expects).", "q1r": 3, "q2": "Milestones to judge success are provided, however, they are somewhat abstract. As the level of abstraction of the proposed application framework is not described (see previous part), it would in principle be possible to \"go where the fence is the lowest\" for the final deliverable.\r\n\r\nHowever, there are plans to partner with other projects with an initial partner identified. This will allow to judge some success in delivering a useful final product.\r\n\r\n", "q2r": 3, "assessor": "z_assessor_603", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Cardanoの既存のdapp開発者と提携し、リッチなネイティブiOS/androidモバイル・クライアント・アクセスを統合することで、アクセス性を向上させます。", "experience": "この2年間で、ゼロから構築した2つのクロスプラットフォーム・アプリケーションの出荷に成功しました。"}