{"id": 367709, "author": "", "title": "GameChanger: The onboarding wallet", "url": "https://cardano.ideascale.com/a/dtd/367709-48088", "category": 26094, "amount": 47400, "description": "インフラの壁、貧弱なドキュメント、コスト、継承、ユーザーインターフェースの複雑さが、新規参入者の受け入れを妨げている。", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=12075"], "media": [], "f6_assessments": [{"q0": "This is a proposal to fund additional work and marketing on the gamechanger wallet. It would be nice to have some numbers for the current success of this wallet so voters can judge the impact of the proposed additions. Its not 100% clear what outcomes the extra work will actually deliver. What does support feed back loops that are in talks and frequently requested features mean? What are these things you are asking for funding to build?", "q0r": 3, "q1": "The proposers have already developed a wallet so it is likely the funds requested will be used to extend that functionality is some way. However exactly what is going to be delivered has been left quite vague thus it is hard to say the plan will be successfully implemented. \r\nWhat are the feedback loops you are working on? What are the requested features you wish to build. What does smart contract support mean in the form of a gamified wallet?", "q1r": 3, "q2": "As the deliverables under this plan are vague, it is hard to audit the progress. How many Dapps will you have integrated with? How will the user base have grown. How many transactions will have been enables by the feature expansion?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is aiming to (further) build a so-called onboarding wallet that is easy to use and does not require many devs skills anymore. Improving access via no-code connection will help our developer ecosystem to grow and therefore will directly have a positive impact on Cardano. With the clear presented solution this proposal directly addresses this challenge.\r\n", "q0r": 5, "q1": "The team is well-known in the Catalyst community. They have presented this project in the after town hall and gimbalabs playground and were able to get valuable feedback from the community. Also they have relevant experience in creating the desired outcome. The budget for this project is laid out in a very clear and understandable way. The requested amount is reasonable and fairly priced from my perspective. The presented plan shows many technical details and the deliverable is clear. With the given information I am convinced that this proposal will be implemented successfully. \r\n", "q1r": 5, "q2": "The team has presented a clear definition on how success of this proposal will look like. The deliverables are clear and the metrics makes sense. They have published a final date of delivery. The website includes a test net, where the community can already see what parts of the wallet are in progress. Something like a GitHub repository would further increase auditability. However, they provide sufficient documentation so that the community can easily audit the progress and success of this project.", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is not a simple wallet for users, this can be very useful also for developers as they are saying in the propsal and in some of the comments so is perfect for the challenge.", "q0r": 5, "q1": "They already have part of the development done and is very clear what they are doing and what is still to do. So I have no doubts that they are implementing the proposal successfully.", "q1r": 5, "q2": "It is very clear how the success will look like, but I would apreciate some KPIs for providing them 5 stars.", "q2r": 4, "assessor": "z_assessor_498", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "Wallets are always a good option to add in the developer ecosystem. They are useful and they have a lot to do in blockchain, as this is a improvement of a wallet in development it addresses the challenge", "q0r": 5, "q1": "They already have started with the development and some dApp teams have ask them for using their wallet in their apps. They have a clear idea of implementing the propsal succesfully", "q1r": 5, "q2": "Clear roadmap and a way to follow the success. Only would be nice to add preformance indicators", "q2r": 4, "assessor": "z_assessor_547", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}], "solution": "新興国向けに作らなければなりません。ウォレットのゲーミフィケーション、PWAの使用、ほとんどコードを使わないdappの接続、学生やジュニアの開発者をまず重視する。", "experience": "私たちは**GameChanger**を作りました。これは非常に人間的でゲーム化された財布で、新参者、学生、ビルダーにコミットし、新興国で作られたものです。"}