{"id": 367801, "author": "", "title": "Cardano meditation network", "url": "https://cardano.ideascale.com/a/dtd/367801-48088", "category": 26094, "amount": 11980, "description": "共感と明晰さを身につけるためには、瞑想の実践にコミュニティが関与する必要があり、それがより多くの価値をもたらすことになります。", "f6_no_assessments": 3, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "It appears this is a proposal for Catalyst to fund live and then pre-recorded meditation sessions for Cardano developers from a meditation company. NFT's will be minted to link it a bit more closely to blockchain. I guess this could help to create a positive developer experience. I am not paying for perks is really the point of this challenge, but I guess if the community wants to pay for it, then so be it.", "q0r": 3, "q1": "The proposers have experience delivering meditation services combined with blockchain, so there is no reason to think they couldn't deliver on this. ", "q1r": 5, "q2": "Relatively simple to audit, were the sessions delivered and attended. I guess you could also survey participants to see if the enjoyed them, or measure how many people continued going.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Does address the challenge where the project is focused on the developers in the ecosystem. But not a lot of value to the entire ecosystem itself. ", "q0r": 3, "q1": "Based on past experience and the team descriptions I beleive the team would be able to implement this project successfully. ", "q1r": 4, "q2": "This proposal does show the ability to audit with the roadmap defined in the definition of success area of proposal. ", "q2r": 4, "assessor": "z_assessor_263", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposer team refers to a need in the problem statement instead of defining and explaining the underlying problem they want to solve. Also they don't describe in detail how they will improve the developer ecosystem. Of course, personal development (meditation) is helpful for aspect of one's life (from my own experience), but here the idea remains very abstract. Based on the given information a rate impact of the proposal with 2 stars. ", "q0r": 2, "q1": "\r\nThe team wants to host mediation session on Zoom. However, It is easy the host a zoom meeting or start a Discord Server, but where do the people/participants come from? To go-to-market strategy remains very vague. I would like to see more about specific topics and methods they want to present, also some references (did they host a meeting before? Is there a recording or some samples?). It is possible that the team is very skilled in meditation, but we need more information about it to assess feasibility and expect a successful implementation. The budget is broken down in details, but it is not clear what project and community management do mean. What specific tasks are included? Are they necessary? To further improve this proposal, I recommend to add all these information.\r\n", "q1r": 2, "q2": "Again, the team present a number of how many people they want to engage. However, it remains unclear where they are coming from. In the town hall live meeting in zoom are still around 150 people (mostly the same), so how do they want to get 5000 after one year for a topic that has its relevance but it is for most not the reason why they engage in Cardano/Catalyst. Where do they announce the meetings? Are they recorded? Many unanswered questions. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "デジタルと現実の生活におけるカルダノ瞑想ネットワークは、開発者の特定のニーズに対応するために設計されたプログラムから始まります。", "experience": "ウェルネス業界で20年以上の経験を持ち、うち10年はデジタルスタジオとアプリベースの製品を運営しています。"}