{"id": 367933, "author": "", "title": "NFT API window", "url": "https://cardano.ideascale.com/a/dtd/367933-48088", "category": 26094, "amount": 5000, "description": "ウォレットのアドレスしか知らない相手とどうやってコミュニケーションをとるのか？\n\nひとつのアイデアは、NFTでメモを送ることです。もし、NFTがチャットウィンドウだったらどうでしょう！？", "f6_no_assessments": 6, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Cool idea, though there is not plan to actually implement it. Obviously the big issue is the that chat is not private, anyone will be able to view the NFT. Also it wouldn't have to be an NFT. Couldn't the message be posted as metadata onto the blockchain?", "q0r": 4, "q1": "Unfortunately this is an idea, but there is no implementation plan, thus we cannot expect it to be implemented successfully.", "q1r": 1, "q2": "As there is no timeline or deliverables, we cannot audit progress or success.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This idea is a great possible usecase and a creative way to implement metadata. \r\nBasically it renders chat messages to NFTs and sends it from wallet to wallet as a chat service. \r\nJust like the structured remarks section of a bank account. It could have been a better fit for the metadata challenge, but it fits developer ecosystem as well. \r\n", "q0r": 5, "q1": "It is great that the proposer knows what can be done (sort of), but it is advisable to provide some more information on relevant experience and if there is not adequate experience, to compose a team which possesses such experience. \r\nThere is no information present that explains how the proposer would implement this system to various wallet types. The requested budget of 5000 USD seems a bit lean. A budget breakdown would help understand why this would be enough to develop this. \r\n", "q1r": 2, "q2": "The idea is great, but there is hardly anything to go by to properly assess this. \r\nThe plan needs more detail in terms of implementation and technical data. \r\nThe requested fund needs a breakdown to justify the amount. \r\nThere's no roadmap as to how and when it would be developed. \r\nAnd most importantly, a risk assessment because you will have to deal with serious security issues involving scammers in a direct chat service. \r\nAddress all these and you've got yourself a bad ass proposal.  ", "q2r": 1, "assessor": "z_assessor_113", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The use of NFT as a access control mechanism for data services is an idea being explored in many developer circles. The proposal aims to develop an MVP to demonstrate the use of NFT for a chat. This has the potential to evolve it into a system with wide use. ", "q0r": 5, "q1": "The proposer claims no technical expertise and the process of using NFT authenticated service has involved security implications which are being processed as a CIP. Therefore there is a high risk in following a ad-hoc approach for the development of the projects which interact with Wallets. ", "q1r": 2, "q2": "The development steps and the number of developers involved In the project are not clearly documented. The proposer believes that this feature can be implemented in less than 6K however a clear documentation of the methodology will provide sufficient material to access the proposal in correct earnest. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "You started with a badass solution to a problem in the proposal. You had me hooked from the start. But with all my enthusiasm it quickly went downhill. To start the problem and solution don't really fit the developer ecosystem that well. This would've been better submitted in the metadata challenge. So either you accidentally submitted it to the wrong challenge or you didn't understand the challenge that well. If this would've been submitted in the correct challenge it would've received a 5 from me. Now I sadly can't agree that the proposal fits the challenge.", "q0r": 2, "q1": "As I stated above you started perfectly with a genuine solution to the problem. Looking further at the proposal I can find anything that states this proposal will go further than the proposal state. You are clearly an NFT enthusiast but lack the experience to pull this off as far as we know since no reference to experience is given. The fund that is requested is also not explained for what they are needed. A budget breakdown would greatly help this proposal. ", "q1r": 1, "q2": "The most fundamental aspect for auditability is a roadmap and since this is missing its sort of hard to assess the proposal. I would also like to see more details about how you plan to implement the proposal. To clear out any miscommunication about the budget a budget breakdown would be needed. I have summed up a lot that needs work but if you do all this, I'm sure that you can pull it off.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the problem that you are not able to communicate with someone that you only have the wallet address of. Using NFT for this case seem like a reasonable idea however the proposer misses to explain the underlaying problem in detail. Also the solution is more like an idea instead of an ready-to-implement concept. The proposer has convincingly stated why this proposal fits into this challenge but the impact overall remains vague.", "q0r": 3, "q1": "There is now reference or link to a profile of the proposer. Also it is not clear that he has the ability to develop the proposed solution. There is no workable plan, no technical details and no framework of the proposed solution. Also there is no budget explanation, so we are not able to judge if the budget is sufficient to implement to NFT API window. This proposal needs further refinement in order to get a good score for feasibility. With the given information I can not see, if the implementation will happen as promised.", "q1r": 2, "q2": "As already state, this proposal is in a state of ideation rather than a real concept. To further improve this proposal I recommend adding metrics, define the success (number of users for example) in order for the community to be able to audit it properly. Relevant information for auditing is missing here.", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is an extremely novel idea, utilizing a Cardano NFT as a way to send messages. We do however need a bit more detail. \r\n\r\nDoes a user mint the NFT themselves, then send it to the person they wish to communicate with? Can they mint multiple tokens and create a group chat with many participants sending many-to-many messages?", "q0r": 4, "q1": "i think this proposal was proposed by a non-developer, and it may be better if this was in the challenge setting category because the idea is amazing and novel, but it seems the proposer doesn't have a real roadmap of how to get there, and needs to refine their ideas a little more into something concrete.\r\n\r\nIf this was proposed in \"Challenge setting\" around using NFTs as a way to pass messages between wallets for any Cardano users to access, I'm sure many voters would love this proposal, myself included.", "q1r": 2, "q2": "I think this proposal has amazing potential but it needs a little bit more refinement and is sure to be a big success not just in terms of this proposal but for the Cardano ecosystem as a whole, this could be a standard in secure messaging using NFTs and blockchain.\r\n\r\nPlease give some thought to what a potential roadmap would be, and then create some milestones for the roadmap with KPIs for each milestone.\r\n\r\ni.e. 3 months - Finished R&D for design specifications, 6 months - complete frontend/backend MVP as per design, 12 months - Complete smart contract to handle message passing and NFT creation.\r\n\r\nSomething to that effect, but tailored to exactly what you're trying to accomplish with this proposal.", "q2r": 2, "assessor": "z_assessor_577", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "NFTを介して、あらゆるデータサービスのAPIを提供するNFTです。チャットでは、ウォレットの閲覧者とオーナーとのコミュニケーションを可能にする。", "experience": "私はNFTの愛好家ですが、素晴らしいカルダノのソリューションを実装している人たちとも話をしたことがあります。私は何ができるかを知っています（ある意味で）。"}