{"id": 368426, "author": "", "title": "Delegator Dividend Reward System", "url": "https://cardano.ideascale.com/a/dtd/368426-48088", "category": 26094, "amount": 50000, "description": "オペレーターは、販売収益をデリゲーターに分配するためのシンプルでスケーラブルな方法を必要としています。", "f6_no_assessments": 3, "f6_rating": 2.8888888888888893, "videos": [], "media": [], "f6_assessments": [{"q0": "Great idea and something like this needs to be done. Currently we have various SPO's offering kickbacks of their 340 ADA payment to incentives delegators, however this is all done on trust. A smart contract is the solution. \r\nThis could also be extended allow guaranteed donations to charities, which again many SPO's offer but delegators must take on trust.", "q0r": 5, "q1": "The developers have a a clear idea and experience. The proposal is lacking in timelines and milestones. Without knowing what will be delivered when, it is harder to give this a highly successful implementation score. ", "q1r": 3, "q2": "Unfortunately the idea is here but there are not hard deliverables that can be audited. Is addition success metrics and goals could include things like number of SPO's using them, the amount stake through them etc.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal attests to fix the challenge of considering how to better integrate the economic incentives between network participants, specifically Developers, SPO's, and Delegators. There are a number of ways that the current Cardano infrastructure can be leveraged to build layered economic incentives to benefit network participants. By focusing on mutually beneficial incentives, we can produce versions of traditional business functions in more elegant and decentralized ways. This issue will become larger as the Cardano ecosystem continues to grow.", "q0r": 4, "q1": "There is a large budget for design, architecture, project management, testing, deployment & operator onboarding. There is little mention of the current team or how the proposal would be implemented.", "q1r": 3, "q2": "While the desire to optimize delegators away from larger centralized pools is a great goal, the ability to audit the success of this proposal is extremely difficult. The key metrics required to measure success are not easily to obtain.", "q2r": 2, "assessor": "z_assessor_449", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The problem statement describes a need instead of defining a problem. The team offers a solution for stake pool operators of sharing revenues of the pool with delegators in a transparent way (via smart contracts/NFTs). The linkage between the proposal and the challenge is vague, even though I am aware that there is no proposer challenge to address improvements for SPOs. But in regard to the fairness of other proposals that fit quite well into this challenge as they a addressing devs directly, a higher rating is not possible. ", "q0r": 3, "q1": "The solution might be worth being implemented. Unfortunately, the proposer doesn't offer references or links to proof his ability to implement such a solution. Also the information provided, is not very detailed. He explains the scheme of the idea, but the technical details are vague and don't help to assess the full scope of this proposal. The roadmap is not very detailed as well. In summary, with further refinement this idea can be a valuable project, but with the given information a higher rating is not possible again.", "q1r": 2, "q2": "The milestones are not set only a final time of delivery. There is no documentation source provided to allow the community to track the progress of this project. Success of this proposal is not defined as well. In order the get a better score next time, I recommend to include the mentioned aspects. With the given information auditability of the progress is not possible. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "売上に応じた報酬、つまり「Dividend」をデリゲーターに展開するための可変オプションをオペレーターに提供するスマートコントラクトの開発。", "experience": "このプロジェクトの開発者には、経験豊富なStakepool OperatorとPlutus Pioneerがいます。"}