{"id": 368582, "author": "", "title": "ETH-Cardano NFT Bridge [NFT-MAKER|", "url": "https://cardano.ideascale.com/a/dtd/368582-48088", "category": 26094, "amount": 50000, "description": "NFTはほとんどが1つのチェーン上に存在するため、新規ユーザーの導入は非常に難しく、特に他のチェーンですでにNFTを所有している場合は大変です。", "f6_no_assessments": 3, "f6_rating": 3.2222222222222228, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great idea. Interoperability between chains for NFT projects obviously will expand the market for NFT's.  The proposers have submitted basically an identical proposal to use Neo and IOTA. Which is more important?\r\n\r\nWhilst the authors claim their current product is the most popular system for minted NFT's on Cardano, it would be good to have some numbers here so voters can see the impact any proposal to improve they system will have.\r\nGiven they are asking the community for 50,000 to implement this, why are they only adding it to their paid app and not the free version? How many NFT's has their paid app minted compared to the free version? ", "q0r": 5, "q1": "The proposers have a current product which has been running since 2017 thus there is not reason to doubt they would be able to add this functionality. It would be good to have more of a budget breakdown as to why is 50,000 the right amount of funding to achieve this? How much work is actually involved? ", "q1r": 5, "q2": "Whilst delivery off the functionality within the proposed 4 months is relatively easy to audit, there are not milestones within that period to audit progress.\r\nMore importantly success of the proposal really relies on the impact this will have. They are only proposing to add this functionality to their paid app rather than the free version. This is a significant amount of community money to produce functionality that will then be behind a paywall. For the community to see value in this we need to be able to gauge the impact. The proposers should provide some information on how many NFT's are currently minted under the Pro-version and how they expect this functionality increase to impact hat going forward.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 10, "ne": 4, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "IOHK is developing the ERC20 converter with all due care of security. The integration of this tool with a proprietary site is not likely to improve the developer experience. NFT-MAKER is for non-developers. ", "q0r": 1, "q1": "The bridge between ETH and Cardano through ERC20 convertor is a much awaited tool to be released by IOG . The proposer is claiming that the same will be remade in much shorter time frame is difficult to explain. The proposal does not include any explanation on how it will be done, ", "q1r": 3, "q2": "The proposal just gives a square budget with no breakdown and implementation details. It also does not include details regarding the open-source nature of the software built using the community fund. The progress is difficult to audit in these settings. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposer wants to build a bridge between its platform and Ethereum, but little information is shared.\r\nE.g., a more detailed description of the problem is missing. What exactly makes onboarding difficult? Furthermore, a more precise reference to the Challenge should be made. How will the developer ecosystem be improved? Will the development be made available to others?\r\nIf it is only about the development of the own platform, the challenge NFT Business Models would be the better challenge. Unfortunately, this is not clarified in the proposal.\r\n", "q0r": 3, "q1": "The proposer has already successfully designed an NFT platform and impressively demonstrated his skills. Unfortunately, only superficial information is presented overall. E.g. technical details would be very helpful to understand how promising this proposal really is. \r\nThe same goes for the budget. How many hours of work are included? This aspect is also important to evaluate the appropriateness of the budget. The underlying information does not allow for a better evaluation.\r\n", "q1r": 3, "q2": "The timeline and the goal are clear. However, no metrics are provided to measure the success of this project. For example: How many NFTs later use this bridge by a certain date. Also, no documentation source is provided through which the community could track the progress of the project. If these aspects are integrated, a better review of the proposal would be possible.", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "NFTのためのCardanoとEthereumのブリッジを構築し、それをNFT-MAKER PRO APIに統合したいと考えています。", "experience": "私たちのチームは、Cardanoで最も使用されているNFT作成ツールであるNFT-MAKERとNFT-MAKER PROを開発しています。2017年からCardanoスペースで。"}