{"id": 368538, "author": "", "title": "StorJ for NFT storage [NFT-MAKER]", "url": "https://cardano.ideascale.com/a/dtd/368538-48088", "category": 26094, "amount": 30000, "description": "現在、カルダノのほぼすべてのNFTは、IPFSネットワークに完全に依存しているため、代替手段が必要です。", "f6_no_assessments": 5, "f6_rating": 3.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal to expand a current NFT minting product to be able to use StorJ for permanent storage rather than relying only on IFPS which has issues with permanence for files that are not popular. Expanding options for users here is a great idea. The proposers have submitted basically an identical proposal to use Arweave. Which is more important?\r\n\r\nWhilst the authors claim their current product is the most popular system for minted NFT's on Cardano, it would be good to have some numbers here so voters can see the impact any proposal to improve they system will have.\r\nGiven they are asking the community for 30,000 to implement this, why are they only adding it to their paid app and not the free version? How many NFT's has their paid app minted compared to the free version?", "q0r": 4, "q1": "The proposers have a current product which has been running since 2017 thus there is not reason to doubt they would be able to add this functionality. It would be good to have more of a budget breakdown as to why is 30,000 the right amount of funding to achieve this? How much work is actually involved?", "q1r": 5, "q2": "Whilst delivery off the functionality within the proposed 3 months is relatively easy to audit, there are not milestones within that period to audit progress. \r\nMore importantly success of the proposal really relies on the impact this will have. They are only proposing to add this functionality to their paid app rather than the free version. This is a significant amount of community money to produce functionality that will then be behind a paywall. For the community to see value in this we need to be able to gauge the impact. The proposers should provide some information on how many NFT's are currently minted under the Pro-version and how they expect this functionality increase to impact hat going forward. ", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 14, "ne": 7, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal fits very well with the challenge space of \" dapps and integration\" and brings the value by providing alternative storage solution, decoupling the NFT minting from IPFS. In general it is a very good idea to have multiple options when it comes to storage solution for any application, let alone be NFT maker where over the years transactions will grow rapidly. \r\n\r\nIn my opinion having an alternative such as StorJ will provide better functionalities for certain user/businesses, especially who are unwilling to use IPFS and want some other decentralized cloud based solution.  \r\n\r\nHowever, imo it would have been nice, if the proposer could outline the benefits (per say) of using StorJ over IPFS, also i believe that since proposer is proposing such a proposal, a detailed outline on their groundwork (e.g. answering questions such as why IPFS only dependency could be bad in future?)  would make the proposal 5 star from my side, hence deducting one star :) ", "q0r": 4, "q1": "As a senior developer myself my feeling is that this task should be doable and given that they already have a team with working product this proposal can be implemented successfully. \r\n\r\nHowever, I am not sure about the budget being asked for, a nice detailed explanation/justification on why such budget is asked would make the proposal stronger.  e.g. are you planning to use Storj Client Library, if yes then which language you will choose, does there exist already a library that simply you have to invoke in your code base ? \r\nWill this be a developemnt effort from scratch or you will have to adapt the existing code base for this proposals implementation ?", "q1r": 3, "q2": "In my opinion the information provided here is sufficient to audit the progress as team has working product and for storJ integration, most likely they will just utilize library provided from StorJ, this should not be a huge effort in terms of complexity of the task.\r\n\r\nHowever, i am cutting one point because the proposal can be improved by enlightening community on how community will be able to track the progress once the proposal is funded. e.g. If you are following a 2 week sprint model, how your milestones will look like ? in 3 months the integration should finish, then may be have some sort of roadmap based on 3 milestones, 1 per month ? Further splitting into 2 sprints per month ? \r\n\r\nI think for such a proposal, it should not be a big effort to outline such details in the proposal. Over all i like the idea and since team has working product I am agreeing with this, however,, would love to have more detailed information in the proposal, and it would then make this proposal rock solid.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 9, "ne": 6, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": " StorJ is an evolving and an alternate storage solution being developed by Storj Labs. There is no need for any modification in the existing infrastructure for using StorJ in making Cardano NFT. But NFT-Maker does not have any interface for utilizing StorJ. The proposal is to create one such interface. This will provide people using the NFT-Maker site for minting NFTs. However, it is unclear how the general Cardnao Developer ecosystem will improve with this addition in the NFT-Maker site. ", "q0r": 3, "q1": "The proposal does not include details of the development team. However, they are successfully operating a NFT minting site on a commercial basis therefore they are very likely to be capable of adding this feature to enable additional storage methods. ", "q1r": 5, "q2": "The interface for Storj is simple and has similar characteristics as that of ipfs. Therefore the amount of work involved in creating that in a closed source site is not explicitly provided. The code is likely to remain proprietory. Therefore the cost and output is not auditable ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "In the idea it is planned to integrate a different storage system than IPFS for the data associated with CNFTs. Here it is planned to integrate this into the NFT-MAKER platform. \r\nThe idea sounds promising for people who want to mint their NFT using StorJ instead of IPFS. However, for developers familiar with the CLI, this is already possible. The proposed idea is to make it easier for developers to use StorJ as a filesystem. However, this option will be only provided when using the NFT-MAKER tool (or their API) developed by the proposers. However this does not fit most of the developers which want to develop custom NFT projects. The developer experience could (in my eyes) be better enhanced by open-source software or scripts that allows the proposed functions instead of paid services that can't cover all NFT-projects needs. \r\nIn my eyes the project would fit perfectly in a \"artist ecosystem\" challenge!", "q0r": 3, "q1": "As NFT-MAKER already exists, it is clear that this feature will be implemented. Probably even without the funding. ", "q1r": 5, "q2": "As the proposed tool will become available on the proposers website, it will be easy to follow the progress. A small negative point is, that no justification of the funds is given. Why are 30.000 needed? How to justify where the funds go when this project is funded?", "q2r": 4, "assessor": "z_assessor_465", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This is a very simple and clear proposal that aims to simplify the storage of NFTs for developers by integrating StorJ into the underlying NFT platform. Thus, this proposal is within the scope of the Challenge. It would be even better if the proposer provides more details about the relevance of this solution and sets the context in comparison to other solutions. Nevertheless, it is a proposal with 'good' impact on Cardano.", "q0r": 5, "q1": "The team behind the proposal has already successfully applied for funding in Catalyst. The team is definitely capable of developing and delivering the proposed solution. The implementation plan is simple, however it would be desirable to see more technical details and a clearer roadmap to better understand the entirety of the project. Also a detailed explanation of the budget would help to better evaluate the amount requested.", "q1r": 5, "q2": "A clear solution combined with a clear schedule make it easy to track the execution of the project. Additionally, a Github repository is available to document the progress of the project. The linked profile already shows a lot of excellent activities. For an improvement I recommend to add additional metrics, e.g. how many users are expected, so that we can evaluate the impact (problem solving) even better. In general, this proposal is good to audit.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "NFT-MAKER PROにStorJを搭載することで、NFT作成者がデータの代替ストレージとしてStorJを容易に選択できるようになります。", "experience": "私たちのチームは、Cardanoで最も使用されているNFT作成ツールであるNFT-MAKERとNFT-MAKER PROを開発しています。2017年からCardanoスペースで。"}