{"id": 368548, "author": "", "title": "Arweave as NFT storage [NFT-MAKER]", "url": "https://cardano.ideascale.com/a/dtd/368548-48088", "category": 26094, "amount": 30000, "description": "現在、カルダノのほぼすべてのNFTは、IPFSネットワークに完全に依存しているため、代替手段が必要です。", "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal to expand a current NFT minting product to be able to use Arweave for permanent storage rather than relying only on IFPS which has issues with permanence for files that are not popular. Expanding options for users here is a great idea. The proposers have submitted basically an identical proposal to use Storj. Which is more important?\r\n\r\nWhilst the authors claim their current product is the most popular system for minted NFT's on Cardano, it would be good to have some numbers here so voters can see the impact any proposal to improve they system will have. Given they are asking the community for 30,000 to implement this, why are they only adding it to their paid app and not the free version? How many NFT's has their paid app minted compared to the free version?", "q0r": 4, "q1": "The proposers have a current product which has been running since 2017 thus there is not reason to doubt they would be able to add this functionality. It would be good to have more of a budget breakdown as to why is 30,000 the right amount of funding to achieve this? How much work is actually involved?", "q1r": 5, "q2": "Whilst delivery off the functionality within the proposed 3 months is relatively easy to audit, there are not milestones within that period to audit progress.\r\nMore importantly success of the proposal really relies on the impact this will have. They are only proposing to add this functionality to their paid app rather than the free version. This is a significant amount of community money to produce functionality that will then be behind a paywall. For the community to see value in this we need to be able to gauge the impact. The proposers should provide some information on how many NFT's are currently minted under the Pro-version and how they expect this functionality increase to impact hat going forward. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This proposal meets a key need to develop a \"lively\" developer ecosystem by building on NFT Maker's current success and implementing this new API layer (while solving a core need). This opens a path for new developers to be integrated to the project, or even if this project doesn't expand their team, it allows for other NFT projects both from an API level and web app level to use this work in future NFT releases. This provides a short term opportunity and long term community benefit for the developer ecosystem. In the future I think a deeper clarity on if this will be integrated within an existing team or in a deeper collaboration with newly graduated Pioneers / devs would be beneficial. While this also might seem on the fringe of the developer ecosystem challenge vs the NFT challenge, as a developer myself I see that there would be a great benefit by showing the continual integration of API's into proven products.  Despite these slight communication improvement opportunities I would rate this 5 overall. ", "q0r": 5, "q1": "Patrick and the NFT Maker team has not only been deeply integrated into the community, but they have produced a product that has gone through multiple iterations with NFT Maker.io and NFT-MAKER PRO. \r\nThis application was actually used by a popular NFT project SpaceBudz - (Metadata with ArweaveID example can be seen on chain - https://cardanoscan.io/transaction/c8671bf7fe1cd75c8a387822b84c8e4f5fe61043c60618dc9ad68d6ebcd12c7f?tab=metadata)\r\n\r\nThis shows a prototype in production has been built, there is knowledge on how to integrate this into their current minting process, and there is a clear next step to the feature and API being built out and delivered within the timeframe. ", "q1r": 5, "q2": "While the success of this proposal is clearly defined and easily measured in the sense that the API and web app feature is either successfully delivered or it isn't - my concern is related to the transparency of the progress along the way. I would like to see more detail of what the team is prioritizing on their backlog / bandwidth of members to show progress on this API while accounting for roadblocks that may come up in the mentioned 3 month window. Since the progression would require someone (or many) requesting updates, which can also cause more work on the team's part, I would rate this a 4. ", "q2r": 4, "assessor": "z_assessor_258", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "Arweave is a permanent strorage in decentralised manner with payment of fee upfront. This storage can be used for storage of NFT media and its link is included in NFT metadata. NFT-MAKER- PRO is a commercial solution for enabling non-developers to mint NFT on payment bases. The proposal is by the NFT-MAKER to add this additional storage mechanism as an option to their property site. This is likely to have very minimal Impact on the Cardano Developer eco system.", "q0r": 3, "q1": "The development effort is just an additional storage option to the existing NFT-MAKER API. There is no major technical hurdle or technical problem to solve. It is a simple integration process. The developers who have created the site are very likely to be capable of including this feature. ", "q1r": 5, "q2": "The proposers are requesting 30K USD for adding a feature to a commercial site used by non-developers without releasing the code or even part of the code as open-source. The modalities for arriving at an expenditure of 30K USD are also not provided. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Tobias proposes a new storage solution for NFTs, which he wants to integrate into his platform and make available to other users via API. I ask myself the question, is the development only for the own platform or will this be made available to developers in general, or only via API to own users? Depending on the question, this would mean that the wrong challenge has been chosen (NFT business models or Dapp Integration). This challenge is about to improve the developer ecosystem. Unfortunately, the question is not answered correctly. Therefore only three stars.", "q0r": 3, "q1": "Tobias is already a proposal winner and has contributed quite a bit to the use of NFT on Cardano. Therefore I see him basically in the position to implement this proposal. Unfortunately, not many details are presented to the community. My recommendation: Explain the alternative more clearly and especially go into the reasons and advantages of choosing Arweave for this scenario. Furthermore, the budget is also not explained in more detail, so I can't say if it is appropriate. Overall, this proposal is certainly a good intiative, but more information needs to be provided for a better EVALUATION.", "q1r": 3, "q2": "A defined time frame and delivery are described. Unfortunately, there is no information on how the community can track the progress of the project. A source for documentation (like Github) would be helpful. Therefore only 3 stars as well.", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "NFT-MAKER PROにarweaveを統合することで、NFT開発者がデータストレージの代替ソリューションとしてarweaveを容易に選択できるようになります。", "experience": "私たちのチームは、Cardanoで最も使用されているNFT作成ツールであるNFT-MAKERとNFT-MAKER PROを開発しています。2017年からCardanoスペースで。"}