{"id": 368785, "author": "", "title": "Cardano Developer Academy", "url": "https://cardano.ideascale.com/a/dtd/368785-48088", "category": 26094, "amount": 18000, "description": "Cardanoのエコシステムは、より多くのdAppsを開発し、その可能性を最大限に発揮するために、より多くの熟練したスマートコントラクト開発者を必要としています。", "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers aims to deliver a course to train 1000 smart contract developers at an average cost of $18 per developer (to catalyst, plus the costs to the developers themselves). Obviously if this could be achieved it would be an amazing outcome.", "q0r": 5, "q1": "The proposer has online course creating skills as demonstrated by previous work. No information has been provided on the success of that previous endeavour. How many people did it train? \r\n\r\nIt is not clear if the proposer has skills in Plutus, which would seem to be required to create a course on it.\r\nWhilst the proposer names a number of 1000 developers trained, there doesn't seem to be any plan on how this would be achieved. ", "q1r": 3, "q2": "The plan is has deliverables in terms of shipping courses and some milestones before that which can be tracked. It lacks detail on what the course would actually be, which is important to really measure what has been delivered? How many hours, how much content? \r\nMore importantly, success is no delivery of content. Success is trained dev's which can implement projects. A number of 1000 dev's is postulated, though no timeline is given for this. What are the goals in specific time windows for dev's completing the courses?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "There are a number of training-related proposals however in these initial times the more the number of options available the better. This proposal has a viable sustenance model. It also proposed sharp specific skill courses which are better than all-encompassing courses. It is addressing a void area in a sustainable manner and will improve the availability of trained manpower. ", "q0r": 5, "q1": "The proposer has built a Learning Management System for Terraform https://skillmix.io/ .  However, the site is far from complete in Terraform and needs major improvements. Therfore It becomes difficult to estimate the quality of the training material that will be created for Cardano Smart Contract training. ", "q1r": 3, "q2": "The proposal will provide some 50,000 hours of lab time and aims to train 1000 developers(on a subscription basis) it will be simple to audit the progress of implementation of the proposal. However, the success of the project and the quality of the content is likely to be subjective like all related training projects.  ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal wants to onboard/coach developers to become smart contract developers for Cardano. Since this challenge is asking for improving the developer ecosystem, this proposal perfectly fits into this challenge. As there are already some initiatives in Cardano and also funded projects in Catalyst with the same goal, I miss a statement on how this proposal will add additional value. Therefore I rate Impact with 4 stars.", "q0r": 4, "q1": "Unfortunately the proposers missed to provide some references and experiences of being capable of creating this solution. If you want to host high-class teachings about smart contract development you should know about what you are talking. The proposed solution makes it clear what to expect in general from this proposal. The budget is broken down in detail. The proposer states that some parts of the academy are already created, but we can not access it. With the given information I neither agree or disagree that this proposal has a high likelihood to be implement successfully.", "q1r": 3, "q2": "A detailed go-to-market strategy is missing. The roadmap should contain more details. From my experience it is one thing, creating an online course, but it is a different story to run it successfully. Also there is no way to access the material that is already created. Also no KPIs are presented. How many developers does the proposer wants to onboard? There some important parts for auditability missing, which the proposer should include the next time. It is not clear how success of this proposal is defined.", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Moonarは、Cardanoの開発者向けアカデミーです。素晴らしいコースコンテンツ、コードエディタ、Plutus開発コンテナを組み合わせています。", "experience": "私は https://skillmix.io の設立者であり運営者です。LMSのフロントエンド、バックエンド、ラボサービスの全てを書きました。また、コンテンツディレクターでもあります。"}