{"id": 369187, "author": "", "title": "Multiverse - dApp Rollback Handler", "url": "https://cardano.ideascale.com/a/dtd/369187-48088", "category": 26094, "amount": 100000, "description": "ロールバックは、ユーザー側に不必要なストレスを与え、UXを低下させ、開発者がdAppsのすべてのエッジケースに対応することを困難にします。", "f6_no_assessments": 3, "f6_rating": 3.8888888888888893, "videos": [], "media": [], "f6_assessments": [{"q0": "Sounds like a really interesting problem to develop solutions of from an experienced team. Unfortunealty there is not really any plan on what would actually be delivered. What has been described here is the problem, but not the solution. The linked document is the same.", "q0r": 4, "q1": "Whilst the team are highly experienced and they may have some great ideas on what hey intend to produce, they are not detailed in this proposal. There are no timelines, deliverables and breakdown of what the budget of 100,000 is paying for. Thus is is not possible to say the solution will be successfully implemented. \r\nThe community is being asked to give 100,000 to the team to solve this problem. ", "q1r": 2, "q2": "As there are no deliverables or timelines, it is not possible to give this project, as interesting as it may be, a high score here. What can we audit when we have not actually been promised anything? Please provide a list of deliverables with associated timelines and metrics with goals to measure success.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "It definitely does address the challenge. I really appreciate how this proposal delves into the user experience. And it creates a solution to something most users may not even understand is a possibility to occur.", "q0r": 5, "q1": "The view into the multivers really provides this metrics. The creators appear to understand the challenges being presented and have a clear plan of how to implement a solution to those challenges.", "q1r": 5, "q2": "Definitely enough provided to assess the success of the project. However, it seems this is more long term project so success may not be effectively measured for some time. BUT it seems worth the investment", "q2r": 5, "assessor": "z_assessor_388", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "DcSpark is proposing a rollback handler, that will help nodes to participate in different parts of the chain. The so-called Multiverse is an innovative and new way to read the state of a blockchain which will open new possibilities for nodes/devs. Therefore, from my standpoint I see it as an important part of the development of Cardano. This proposal effectively addresses the challenge and positively impact Cardano.", "q0r": 5, "q1": "The team is well-known in the Cardano ecosystem and has a proven record of delivering high quality solutions. The team provides a very detailed data-structure of the proposed solution which shows in-deep how it will work. The further improve the proposal the team could more details about the roadmap and the spending of the budget. However, even without this detailed information I am convinced that this team will deliver this solution and will spent the funding responsible as they have done in previous projects. Therefore, I am convinced that this proposal will be implemented successfully.", "q1r": 5, "q2": "\r\nDcSpark has a published many projects on Github so far. Unfortunately in this proposal is no statement about it, which would be important about transparency and auditability for the community. Also the definition of success is not clearly defined (number of user). Also no timeframe is mentioned. By providing these aspects to the community, this proposal could be improved. Based on the given information I can only give 3 stars for auditability, since we have no information about how to audit the progress of the proposal. \r\n", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "The Multiverseは、ブロックチェーンの状態を読み取るための新しいアプローチです。これは、ノードがチェーンの様々なブランチに参加できるようにするものです", "experience": "私たちのチームは、過去数年間にわたってカルダノのエコシステムを構築してきた、よく知られた元Emurgoや元IOHKの社員で構成されています"}