{"id": 369243, "author": "", "title": "Blockfrost Unity games assets", "url": "https://cardano.ideascale.com/a/dtd/369243-48088", "category": 26094, "amount": 37000, "description": "ゲームエンジンであるUnityには、カルダノブロックチェーンと連動するためのアセットがありません。", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"q0": "A great idea that could bring significant game related activity to the Cardano blockchain. ", "q0r": 5, "q1": "Whilst the proposers have good experience, and may in their minds have a clear idea of what will be delivered, it has not been well defined in the proposal. They state two months of dev work, but don't give a delivery timeline. The budget of 37,000 is to cover 2 months work of dev time, but how many dev's is that? The \"Dart SDK for Blockfrost API\" proposal by the same team is 80hrs and two months for $9400.?", "q1r": 4, "q2": "The proposal lacks a clear outline of what will be delivered and when making it hard to audit. Though 2 moths dev work is stated, that has not been committed to as 2 months for delivery. No KPI's have ben set. How many games do they aim to have these assets implemented in over say 6 months?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "I've seen proposals in the Fund 7 challenge setting that want to dedicate an entire challenge to building and integrating games on the Cardano blockchain. So there's definitely a demand for something like this. Ofcourse, to realise that, there need to be the tools available. So given that this would open up Cardano to a huge market, there's a big potential. ", "q0r": 5, "q1": "The proposers are proposing to create a tool on Unity engine through Blockforst. Since they've created Blockfrost and it is their own product, the chances of success are very real. This is a well known development company in our ecosystem. ", "q1r": 5, "q2": "There is no development roadmap, but I don't know if that would apply for the creation of just one tool. The plan is explained well and the website links provide insight in who this company is and what they've created in the past. However, some more details about the budget calculation wouldv' been nice. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Knowing that there are over 3billion gamers in the world creating assets like this would open a huge market to interact with the Cardano ecosystem. Given the fact that there are other proposals that involve gaming and a Fund7 challenge to dedicate a portion of the Catalyst treasure to gaming, there are huge capabilities to this. This proposal fits the challenge settings perfectly.\r\n", "q0r": 5, "q1": "Blockfrost has already established itself within the ecosystem. Given the fact that they plan to expand this by building assets for the Unity Engine to connect to the ecosystem, it is highly likely that this proposal will be successfully implemented. The team certainly has the relevant experience to pull this off. Although the website provides more than enough information about the team and all the assets the proposal itself is missing some fundamentals. There is no roadmap given or budget breakdown. A roadmap would've provided some insight on how the team plans to get this proposal to work. For budget, the team states that this is a budget for 2 months but some more clarification on this would've been helpful for the assessment.\r\n", "q1r": 4, "q2": "As stated above no roadmap of budget breakdown was given which makes it hard to assess the proposal on auditability. Even though the plan is simple and well explained a roadmap could've given us some criteria to look for when things might go south. The information needed for assessing the team is all provided with references on the website. ", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "These team is the creator of the Blockfrost API and with this proposal they are seeking for funding to improve access to Cardano for Unity developers, which is used by many developers. This tool will simplify interaction with Cardano for devs, so this proposal has a positive impact on the Cardano developer ecosystem and thus effectively addresses the challenge. To give a better ranking, I would like to see a more specific statement on why this tool is relevant for Cardano (instead of just saying many devs are using it) to better understand the scope of this project.", "q0r": 4, "q1": "The team has delivered already many helpful tools for the Cardano ecosystem and are well-known in the Catalyst community. The deliverable of this proposal is clear and understandable, however more technical details and a more specific roadmap would help to understand what aspects are implemented at which date. The budget is not described in detail (just mentioned that is according to their hourly rate). If the team would add how many hours they are going to spend on this project it would be easier to say if the requested amount is reasonable. With the given information I expect this project to be implemented successfully. ", "q1r": 4, "q2": "The team has not presented a date for delivery, no detailed roadmap and has not defined how success will look like (how many user after a certain period of time for example). Also there is no Github repository or a similar documentation. Even though I expect a successful implementation I am not able to audit the progress and success of this proposal. TO further improve this proposal and to show transparency to the community I recommend to add these information. With the given aspects I have to disagree that this proposal can be audited properly. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This challenge asks how we can make the developer experience in Cardano positive and this proposal aims to address the challenge by increasing the scope of the cardano developer ecosystem to include Unity (the game engine). \r\n\r\nThe problem statement accurately reflects a problem with the ecosystem (that a Unity lacks assets for Cardano) and the solution statement clearly describes how to solve the problem. The solution statement calls out the usage of a GameObject which is a technical component of the Unity engine.\r\n\r\nThis proposal mentions two deliverables which are nicely aligned with the challenge. These deliverables will be easy to verify. However, this proposal doesn't mention any metrics like \"assets will be used 100 times by the end of 2021\". There aren't any goals regarding the usage the product that's going to be built. \r\n\r\nThe project is well suited to scaling since these assets will be released through traditional means for the Unity engine which is already extremely well adopted.\r\n\r\nI give the proposal a rating of 4 for impact because it lacks numeric metrics and doesn't seem to have a plan for adoption of the product that will be released.\r\n", "q0r": 4, "q1": "I believe the single most salient point regarding the feasibility of this project is the fact that FiveBinaries has delivered major projects like Blockfrost and many SDKs for Blockfrost. \r\n\r\nThat being said, this proposal is missing details for the budget. What is the hourly rate? How many hours will the developers work on this? How many developers will work on this? \r\n\r\nAlso, the proposal lacks information regarding the prior experience with Unity. Will the developers be learning Unity from scratch or do they have prior experience with the game engine? \r\n\r\nWhat is the technical plan for building out this library? Will they PoC first or will the first release be a full supported version 1?\r\n\r\nI rate this a 4 for feasibility because the team is highly experienced but the proposal lacks details regarding execution.", "q1r": 4, "q2": "Community members can simply check out Unity to see if Cardano related assets have been released.\r\n\r\nThat being said, the metrics of this proposal are completely lacking. How much adoption do they want? What other numbers will they track regarding the launch of this tool?\r\n\r\nThe proposal also lacks an execution plan and a detailed budget. \r\n\r\nI score this 3 for auditability because of the lack of details on execution, implementation, budget, and metrics. ", "q2r": 3, "assessor": "z_assessor_531", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This will surely be a great addition to the ecosystem because games and NFTs are just getting to be a hot topic and will be an everyday thing for developers 5 years from now (or at least that's what I think as a dev). I like the idea and the impact it will have on the community.", "q0r": 5, "q1": "I've carefully looked through most of the GitHub repositories and I like what I see. You have already shown as you mentioned that you are not only trustworthy, but you can get the job done as well. I like the timeframe you have put yourselves in considering the work you need to do.\r\nIt's a simple yet powerful idea to enable game developers to enter the Cardano ecosystem without even knowing it, just by drag and drop action.\r\nThe time breakdown, as well as the budget breakdown, seem reasonable considering the work.\r\nFor your next proposal, I'm sure it will be a great benefit if you link some of your linked-in profiles or GitHub profiles, to prove you are legit. This is a suggestion that might seem not that important to you right now, but as you make more and more proposals I believe this will be a supporting factor for your funding.", "q1r": 5, "q2": "Although there is a GitHub repository that any dev can follow and see what's happening it will be helpful to have a small report or update for non-dev people that want to follow your progress. Some milestones would be nice in such cases. \r\nOverall a great proposal backed by reliable engineers. Good luck!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Unity has an amazing largo community of developers. There is no doubt that adding ready to use functionalities will attract developers to use Cardano blockchain as part of their games. Definitively this proposal is aligned to increase developer adoption, productivity, and creativity.", "q0r": 5, "q1": "The team has a proven track record of delivering product that are highly appreciated by the community. This proposal fit in their expertise. And since the delivery is clearly defined in the proposal, the feasibility of the project is guaranteed.", "q1r": 5, "q2": "The budget is reasonable and was calculated based on the duration and hourly rate od development. Having a clear deliverable product and a specified time frame of development make the proposal transparent and traceable by de community.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Unity（ゲームエンジン）のGameObjectsアセットを作成し、Unity開発者がBlockfrost.ioを使ってCardanoと簡単にやり取りできるようにします。", "experience": "私たちはBlockfrostのクリエーターであり、開発者にとって参入障壁の低いサービスやツールを作っています。"}