{"id": 369283, "author": "", "title": "gimbalabs - Dandelion Daemon(s)", "url": "https://cardano.ideascale.com/a/dtd/369283-48088", "category": 26094, "amount": 41600, "description": "APIサービスの分散型ネットワークであるDandelionをさらに発展させるためには、ノードの調整ソフトウェアを開発する必要があります。", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Greta project to continue implementation of a research project funded in round 5 to develop a micro-services ecosystem on Cardano.", "q0r": 5, "q1": "Proposer has great experience and is working with the community.  Nice to see a project broken into multiple stages coming back for approved funding at each stage. Detailed proposal presented and thus high expectation of successful delivery.", "q1r": 5, "q2": "This proposal has a well set out plan which will make auditing of delivery easy. It would be nice to seem some KPI's on usage post development and goals set for them.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Roberto has been doing a great job developing architecture and helping different projects to become a reality, I think it totally goes with the challenge.", "q0r": 5, "q1": "Yes, Roberto and gimbalabs are doing a great job in the community, and I think it can be sucessfully developed.", "q1r": 5, "q2": "It is not so clear to me the KPIs and metrics given to analyze the success of this proposal.", "q2r": 3, "assessor": "z_assessor_274", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Roberto's architecture is helping many projects to develop, I think it fits perfectly with the proposal.", "q0r": 5, "q1": "The plan is simple and concise, well written and I believe it can be successful.", "q1r": 5, "q2": "I think the proposal is very clear, but I don't see KPIs or objective metrics to analyze the impact.", "q2r": 4, "assessor": "z_assessor_432", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The presented solution looks reasonable however, to improve this proposal and better understand why this solution is needed, the proposer could reflect more about the underlaying problem. It is clear that API services are needed, but it doesn't get clear, why this is the best solution that we should vote on. There is a positive impact on Cardano and this proposal is within the challenge setting, but with the given information I can 'only' give 4 stars for impact.", "q0r": 4, "q1": "The team leader is well-known in Catalyst and has already proven his ability to implement useful applications. The plan for the implementation is feasible. The presented technical details help to understand how the solution will operate. The budget is broken down in detail and from my perspective and experienced fairly priced. As this project is built upon a funded Fund 5 proposal (which is already under development) I strongly agree, that this proposal will be implemented successfully. ", "q1r": 5, "q2": "As this proposal doesn't really define a clear problem, it becomes a bit difficult the measure the success. However, this proposer provides us with a clear roadmap and clear deliverables so that we know what to expect as an outcome. The application will be released under Apache 2.0 license. Furthermore, there is a Gitlab-Account where the community can access more information about the progress of the project. Also Gimbalabs has weekly public meetings where we can get in touch with the team. Therefore, I agree that this project is very well auditable. ", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "オンチェーンのTxメタデータを利用してネットワークを調整するサービスのエコシステムを開発し、その手数料をCardanoのトレジャリーに還元する。", "experience": "15年以上の経験を持つDevOpsの提唱者。元Emurgo社のDevOpsリーダー。Gimbalabsの共同設立者。Dandelionの設立者兼運営者。"}