{"id": 370265, "author": "", "title": "Bridge between Catalyst and Kaggle", "url": "https://cardano.ideascale.com/a/dtd/370265-48088", "category": 26094, "amount": 15000, "description": "AIに関する専門知識は、触媒のコミュニティにも、コミュニティ全体にも不足しています。", "f6_no_assessments": 4, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal to manage three competitions on Kaggle for $5000 each. However the competitions themselves need to be funded so without requesting that funding, what will this proposal do?", "q0r": 2, "q1": "This is a proposal to manage competitions on Kaggle, but there are no competitions to manage. Thus what does funding this proposal in isolation achieve? Its like providing marketing services for a business, when there is no business.", "q1r": 1, "q2": "as this is a proposal to manage a 3 competitions which do no yet exists, there is not anything to audit, there is no project.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Kaggle is a lively platform for AI developers with extensive code a data sharing. However the problem statement feels to be more of assumption than fact based. It would be good if the proposer could back up their problem statement with some further information which would build on this assumption. As noted in the proposal Kaggle has significant activity levels and developer experience that Cardano could piggy back on.", "q0r": 5, "q1": "Unfortunately the link provided to cardanonocode.com but their is evidence of activity from this organisation elsewhere (https://www.linkedin.com/company/ferdon/ or https://adapulse.io/wada-builds-the-initiative-no-code-for-creative-africa/). It is likely that this proposal will be able to be completed. ", "q1r": 5, "q2": "It is not clear what the proposer plans to do. Are they hosting a Kaggle competition based on Cardano? It would be great if this was more explicit in the text. \r\n\r\nThere are some very clear KPIs and goals set. ", "q2r": 2, "assessor": "z_assessor_466", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal uses funds deliberately to foster competition and engagement amongst AI experts, which would be a fresh addition to the Cardano ecosystem and can only help synergistically with other parallel endeavors. ", "q0r": 5, "q1": "The team appears to have a strong track record and a clear framework including use of an MVP to get the AI developers into the ecosystem.", "q1r": 4, "q2": "The benchmarks listed don't clearly connect to this particular proposal and appear adopted from a separate proposal made by the same dev team. Would be nice to lay out successes/benchmarks in the 5k challenges.", "q2r": 3, "assessor": "z_assessor_517", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Turning a ML model into a smart contract is a very unique approach to add to the \"No-code\" movement, which seems to be gaining momentum. This might be very relevant as this movement grows.", "q0r": 4, "q1": "The team has been active in the no-code space and appears to be well positioned to integrate Cardano into this ever growing ecosystem. This team can leverage the teams past successes and turn them into Cardano's success as well.", "q1r": 4, "q2": "Success criteria is clearly laid out in plain terms, and is quantifiable enough for catalyst to properly evaluate 12 months from now. Only thing is is the proposal lacks specifics on the \"Colabs\" and what exactly that looks like, if successfully implemented on Cardano.", "q2r": 4, "assessor": "z_assessor_577", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "CatalystとKaggleの間にヒューマンブリッジを構築する。", "experience": "フェルドンは、3人のAI経験者を含む20人の情熱的なメンバーで構成されています。"}