{"id": 383517, "author": "swhitenstall", "title": "Community Governance Oversight", "url": "https://cardano.ideascale.com/a/dtd/383517-48088", "category": 26253, "amount": 19100, "description": "Без надзора мы рискуем оказаться в застое, и нам не хватает подотчетности в нашем управлении.", "funded": 2, "upvotes": 106897295, "downvotes": 1457504, "votes_result": 105439791, "votes_cast": 301, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "A great idea with a big perspective. We need a governance oversight to establish a framework and be specifically focused on auditing. Yet, the tools used for it- are detective - finding a deviation after it occurred. We would need a more dynamic tool since we are living in a dynamic online world.\r\n\r\nYet a good idea.\r\n\r\nRating given 4.", "q0r": 4, "q1": "The experience and the team stated are sufficient and reasonable to deliver and implement the proposal. \r\n\r\nRating given 5.", "q1r": 5, "q2": "Metrics stated such as surveys or zoom meetings are easy to be audited.\r\n\r\nThe progress can be also audited e.g. by meeting subtasks such as recruiting new people. \r\n\r\nThe roadmap seems reasonable.\r\n\r\nPoints 1 and 2 \r\nThe Oversight group will be formed\r\nThe Audit Circle will be formed.\r\n\r\nrequires more detail. Unless it just \"will be formed\".\r\n\r\nRating given 4.\r\n", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This proposal focuses on surveys, reports & facilitating retrospectives to improve our governance processes. This is a great and interesting idea, especially in the context of the phase of Governance. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, fits the challenge, shows a clear impact on the Cardano ecosystem as a whole in the short term and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team consists of very active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. Besides, some members of this team got proposals funded in the prior fund [F5, F6]. This is proof of feasibility from the team profile. The budget is clear and logical. Risk is clearly defined with mitigation, and further analysis. Therefore, based on the given information, I strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The proposal seeks to do a survey, report and facilitate retrospectives to improve their governance processes. They aim at providing community  oversight of improvements to Catalyst governance by collecting feedback and providing tracking, documentation and analysis of any proposed changes. The challenge is effectively addressed.", "q0r": 4, "q1": "The team has 7 experts with diverse skills in and status as Catalyst veterans from the communities, SPOCRA, Funded proposers, professional auditors, support from IOG staff. The specifics for measuring success outlined include 6 surveys to be completed, 3 retrospectives and produce 3 reports. ", "q1r": 4, "q2": "The road map is clear from February 2022 to April 2022 with details in the proposal; The budget is well broken down to details for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "As a Cardano community member, I really appreciate that the team of the right experience members is willing to put the spent time and heart into this proposal to address the current governance issues and come up with the solution to tackle those. I believe there is a small risk regarding the representative in the proposed governance bodies. For instance, community members and Cardano crypto holders who wish to participate in such governance bodies that are non-speak English and, yes, the current body, for example, a Catalyst Circle\r\nV2 has not included anyone from the non-English community, so I hope that your team should reconsider or add on some parameters to fill this missing element.\r\n", "q0r": 4, "q1": "Precise set of outcomes, timelines and reachable elements have been listed, and I believe the team would deliver in over the course of 3 months.", "q1r": 5, "q2": "The team has highlighted the parameters to be included and how they will deliver those. The entire process is uploaded and available for the public to access online to view and monitor the proposal progress and outcomes.", "q2r": 5, "assessor": "z_assessor_726", "no_vca": 17, "ne": 5, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This latest iteration in the eventual self-governance of Project Catalyst is an auditability measure for the very process of self-governance.  By producing surveys from 1)Catalyst Circle, 2)Technical Council, and 3)Challenge teams (internal surveys), as well as surveys from the Catalyst Community regarding 1)Challenge Settings, 2)Problem Sensing, and 3)governance parameters (external surveys), and by hosting workshops, this Oversight group will facilitate improvements to the governance process, and provide documentation and tracking of these activities to the community.  Rather than changing things, and seeing what breaks, this kind of oversight allows for safe, consistent, iterative moves along a predictable timeline towards total self-governance for the Catalyst fund, and the eventual automatic governance of Cardano.  This iterative process protects Cardano from:  central authority capture, unfair representation of key groups, unaccountable governance, blindside adversarial capture, lack of transparency and clarity.  Meanwhile it enables: formal security mechanisms, formal emergency mechanisms, and engaged, agile governance. ", "q0r": 5, "q1": "This Oversight team is already well established from the community with the tools necessary to execute this plan, from the github and gitbook repositories to Town Hall, slack and telegram formats.  The roadmap and budget is easily understood and broke down over 3 months, approximately 100 man-hours, and 13 deliverables (including a Fund8 proposal to continue their work post-spring 2022).  Recognizing that Catalyst will likely continue to grow exponentially, they include future funding proposals as a way to address these changes in scope for govenance.", "q1r": 5, "q2": "They will be using tools that are already providing transparency and clarity for the community's oversight of Catalyst Circle.  The 13 deliverables, spread among surveys, retrospectives and reports provide an easily monitored timeline of productivity and effectiveness, with natural audit points that keep time with events already regularly occurring within the community, such as Town Halls.  The team itself has regularly been held accountable to the community, as funded proposers, elected Catalyst Circle representatives and toolmakers and mentors.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Проводить исследования, составлять отчеты и содействовать проведению ретроспектив для улучшения процессов управления.", "experience": "Мы - ветераны программы Catalyst, представляющие различные сообщества: SPOCRA, финансируемые инициаторы, профессиональные аудиторы при поддержке сотрудников IOG."}