{"id": 384807, "author": "twomin", "title": "2MIN REVIEW Integrated Platform", "url": "https://cardano.ideascale.com/a/dtd/384807-48088", "category": 26253, "amount": 12298, "description": "Избирателям нужна интегрированная платформа для доступа к содержимому Catalyst, которое фильтруется и анализируется 2Min Review.", "funded": 2, "upvotes": 75794600, "downvotes": 3637313, "votes_result": 72157287, "votes_cast": 161, "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "in the challenge - increase and grow auditability - I do not see how a review of a proposal will increase the auditing. As far as I understand audit - its aim is to provide a reality on something. If we want to audit a proposal, we want to find out how is proposal progressing and whether it is meeting its goal. 2 MIN review will boost voters but I do not see how it will \"check\" whether a proposal is progressing as planned.\r\n\r\nRating given 1.", "q0r": 1, "q1": "I agree that based on their experience and and a team described in a detail, it is very likely that they would deliver. \r\n\r\nAlso, the plan seems reasonable.\r\n\r\nRating given 4.", "q1r": 4, "q2": "key metrics are provided in a detail, which would be sufficient for auditing of progress and the final outcome. \r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1, "reply": "Our platform will help busy Cardano voters worldwide reach the Catalyst's proposal information in a convenient way, thereby, increasing the quality of voting at each Catalyst fund. As a result, this affects voting performance."}, {"q0": "The proponent clearly understands what needs to be done for the proposal. The remaining problems are identified and solutions are being proposed accordingly. Build an integrated platform and mobile app to access filtered Catalyst content, analyzed by 2min Review. The given problem statement is defined and involves most aspects of the challenge. If the proposal is successfully implemented, it will make it easier and less time consuming for voters to vote on Catalyst projects.", "q0r": 4, "q1": "The team involved in creating the incubator is indeed very strong, we can tell who each member is from the description of the proposal and on the attached website where we are told their area of expertise, experience and position. Their current position has nothing to do with the group. Group of 6 people with their experience and abilities listed clearly.\r\nFrom what can be read in the proposal, the proposal has invested considerable time and effort in this project demonstrating trust and dedication. I fully believe that given the experience and options presented here, it is very likely that this proposal will be successfully implemented.\r\nThe proponent detailed the potential challenges and risks and established a number of measures to avoid them.", "q1r": 4, "q2": "I like the level of detail mentioned in this proposal, it gives me reassurance that the people behind the proposal know what they are doing.\r\nClear and targeted KPIs. As shown, the proposal is easy to test, as it shows the roadmap along with the development plan, detailed step-by-step explanations, milestones, and products, progress, and timelines. Several ways the community can successfully quantify recommendations such as data and KPIs\r\n    The budget has been thoughtfully planned from the smallest cost, demonstrating the honesty and transparency of the proponent.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 4, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about building an integrated platform and mobile application for accessing Catalyst's contents which are filtered, analyzed by 2Min Review. The problem is clear [Voters need an integrated platform for accessing Catalyst's contents which are filtered, analyzed by 2Min Review], suitable to the given challenge. The solution is clearly defined, fits the challenge. By building this kind of app for accessing filtered and analyzed Catalyst's contents may make a certain impact on the Cardano ecosystem in short term and long term.\r\nTherefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4.", "q0r": 4, "q1": "Team profile, roadmap, metrics, budget, and especially risk are clearly described and explained in detail. Besides, this team got a proposal funded from F6. All of those prove feasibility. However, the risk is defined but very abstract [Occurring risks ? and Potential risks ?] and there is no mitigation/risk management.\r\nBased on the given information, I agree that it is highly likely that this proposal will be implemented successfully, and I can rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a lot of information which is clearly explained, with reference/proof (documents/links,...) for verifying. My advice is: (1) for better understanding, your measurable KPIs should be integrated into the roadmap; this would help the community track it easier; (2) risk mitigation/ management should be provided.\r\nBased on the given information, I agree with this proposal's auditability, and I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 5, "nfo": 7, "vca_o": 1}, {"q0": "The proposal has highlighted the most crucial parts of the Cardano Ecosystem voting process and how to help voters select suitable proposals to vote. That is the time-wasting and the accessibility to the proposal brief info and comments from CA during the voting period. Should address the negative impact on what your application will be displays intend or non-intentionally the portion of the information that may convey voters to different directions, which could be a negative impact.", "q0r": 4, "q1": "Feasibility is entirely doable, however, if the voter opens the installed apps and how the data would be extracted from Project Catalyst on time and to displace on the smartphone-like user interface. So, the critical question here is that you need to work in conjunction with Project Catalyst Team to extract the data on time right after the VCAs completed their comments tasks so that you need to address them before you move to the development.", "q1r": 5, "q2": "In terms of audibility, your team and proposal have listed that can be audited nicely and efficiently. However, as mentioned in the feasibility part, the integrity of the data that your team extracts from Project Catalyst may have a certain degree of influence. Therefore, the coding and algorithms of your application should be available for the public to view and validate.", "q2r": 4, "assessor": "z_assessor_726", "no_vca": 15, "ne": 5, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "This proposal does not provide a clear means of addressing the challenge brief, specifically a means of improving auditability of funded proposals.  The problem it does set out is definitely present:  voters (especially non-english speaking) have a monumental task before them to effectively parse the volumes of information related to proposals and challenge settings in order to conscientiously cast their votes.  This is a proposal to solve this by rolling out a pre-existing funded proposal -2minReview- to a wider audience.  The original Fund6 proposal that was approved by voters seemed to be more targeted at a developing Vietnamese crypto community that had barriers to entry to be community advisors, assessors of catalyst proposals, and this tool was an attempt to overcome language barriers and communicate essential information to these potential voters and CAs.  The proposers indeed claim to have assessed around 2000 proposals from the last 3 funds, and to have helped 100s of vietnamese as well, so this may be evidence the tool was effective, however no support of these claims was included.  It is difficult to measure possible impact from further implementation and integration of this tool to a larger Catalyst audience, and it is also to difficult to tell from this proposal whether the target is to quickly inform voters, empower community advisors, or both.  Lastly, the lack of links to previous work made it difficult to assess their standards for \"filtering and analyzing\" catalyst proposals with this tool (the original proposal can be found here: https://cardano.ideascale.com/a/dtd/2Min-Review/370212-48088).", "q0r": 2, "q1": "This proposal includes multiple budget and roadmap breakdowns from various angles, and it was very clear they have an actionable plan to roll out a mobile application and website for their 2minReview tool.  The roadmaps are focused on rolling out the program on the web, followed by iOS and then Android, and they demonstrate a clear workflow for weekly stages over the course over 5-7 months.  The roadmap also includes several milestones presumably already reached through November and December of 2021.  The team's linked profiles include many relevant skills, heavy to the development side, and it is worth noting that the team has nearly doubled from its Fund6 proposal.  The budget at first glance appears a little light, but they also appear to be leveraging existing assets as SPO operators; if so I expect the resources requested to be adequate.  The team appears to be cognizant of the risks related to the Ideascale API, and importing the relevant data into the tool, and have provided a mitigation strategy for that possible landmine.", "q1r": 4, "q2": "The tasks are clearly organized and with natural audit points at weekly and monthly intervals.  They also include trackable KPIs that they will be collecting themselves and providing the auditors, things like registrations and user satisfaction.  It would be very helpful to have metrics for number of assessments made by CAs with the help of this tool, if that is something it is seeking to assist with.  There also does not appear to be any means of providing community transparency for the audit, such as a public gitbook or record of commits, or even a consistent media channel.  For voters outside of the proposers immediate community, this project and the previous one are a bit of a black box, that would benefit from an increased level of auditabilty and accountability.", "q2r": 3, "assessor": "z_assessor_811", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Our platform will help busy Cardano voters worldwide reach the Catalyst's proposal information in a convenient way, thereby, increasing the quality of voting at each Catalyst fund. As a result, this affects voting performance."}], "solution": "Создание интегрированной платформы и мобильного приложения для доступа к содержимому Catalyst, которое фильтруется, анализируется 2Min Review", "experience": "Команда 2Min Review и ADAboys LAB состоит из членов с опытом разработки приложений, развития сообщества, CA, vCA."}