{"id": 381055, "author": "mlabs", "title": "MLabs DTF (Dao-Traded-Fund)", "url": "https://cardano.ideascale.com/a/dtd/381055-48088", "category": 26233, "amount": 70400, "description": "As soluções atuais de DeFi em bloco são de alto risco, e alguns investidores preferem uma estratégia de investimento menos volátil.", "funded": 2, "upvotes": 153644976, "downvotes": 9582829, "votes_result": 144062147, "votes_cast": 787, "f6_no_assessments": 13, "f6_rating": 4.487179487179487, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta atende a uma demanda potencialmente muito grande de investimento passivo quando os ativos digitais se tornam mais mainstreamed. Para colocar o impacto em perspectiva, sugiro acrescentar referências quantitativas como o tamanho atual do mercado de investimento passivo nos EUA de aproximadamente US$ 50 trilhões ou 50% do total da capitalização do mercado acionário dos EUA. Ter uma solução passiva e mais fácil para pessoas que de outra forma não teriam tempo, interesse ou experiência para escolherem elas mesmas as fichas/moedas para ganhar exposição em ativos digitais é certamente útil para apoiar a adoção do ecossistema DeFi e Cardano.\r\nGostaria de observar para a declaração do problema que um único veículo de investimento passivo não tem necessariamente menos volatilidade do que a volatilidade média do mercado de moedas criptográficas mais amplo. Um mercado menos volátil é o resultado de ter um setor de investimento passivo em larga escala e capital institucional/longo prazo (por exemplo, o investimento passivo representa 50% do total do mercado de ações dos EUA). Além disso, ainda não existe um índice definido para o mercado criptográfico (semelhante ao S&P 500 ou ao Nasdaq do mercado acionário), portanto, eu esperaria ver mais detalhes de como as estratégias de alocação e equilíbrio de ativos, bem como o perfil de risco/retorno alvo, serão projetados para os iDTFs. Meu profissional está na gestão de ativos e investimento de capital, e eu ficaria mais do que feliz em contribuir com mais pensamentos para a equipe se o projeto for implementado.", "q0r": 4, "q1": "A MLabs tem claramente uma experiência significativa no ecossistema, estando por trás de alguns dos maiores projetos sobre Cardano. Seria ainda mais útil para a comunidade avaliar a proposta se o MLabs pudesse especificar e destacar a experiência relevante da pessoa responsável por este projeto. O orçamento e o cronograma sugeridos estão devidamente divididos em blocos detalhados de trabalho.  Na frente da viabilidade técnica, a proposta explica algumas tecnologias e funcionalidades centrais para implementação. Na frente financeira/operacional, eu sugeriria ao proponente que também incluísse mais clareza, por exemplo, qual algoritmo será usado para seleção do universo de ativos e ponderação de ativos; se ele será otimizado para um mínimo de erro de rastreamento ou menor relação risco-retorno; quem decidirá as estratégias de investimento e como selecionar tal pessoa. Além disso, ter um plano de alto nível para depois da etapa de MVP também seria útil para a comunidade avaliar o projeto.", "q1r": 4, "q2": "O projeto é auditável com base nas funcionalidades centrais do iDFT. Mas eu gostaria de ver algumas métricas para definir o sucesso do MVP ao lançar, por exemplo, o ativo alvo sob gestão, ou a volatilidade contra o mercado mais amplo. Como mencionei na seção Impacto, acredito que uma estratégia passiva não é necessariamente menos volátil do que o mercado mais amplo, portanto, a declaração do problema pode precisar de alguma revisão. Uma opção a ser considerada é uma estratégia passiva para permitir uma ampla exposição em moedas criptográficas, ao mesmo tempo em que economiza tempo e esforço de devida diligência para os investidores.", "q2r": 4, "assessor": "z_assessor_684", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "A proposta sugere a implementação de um fundo comercial DAO que permite que as pessoas adquiram uma cesta de diferentes fichas de projeto focalizadas em áreas específicas. Os ETFs são um veículo de investimento popular no atual cenário financeiro que permite às pessoas investir nos segmentos mais amplos do mercado e ajudar a tirar o esforço de fazer escolhas individuais. A introdução deste tipo de produto em Cardano com um ecossistema DeFi em rápido crescimento poderia proporcionar um grande impacto para permitir que uma nova gama de investidores participem de uma forma simples usando um fundo negociado DAO que eles possam preferir. O proponente detalha algumas razões-chave que esta abordagem pode ter algumas vantagens que fornecem evidências de que esta é uma solução válida para resolver um problema. Especificamente, eles listam diversificação, custos mais baixos e retornos a longo prazo. O único feedback a dar aqui é que outro benefício chave que esta solução oferece aos consumidores finais é a economia de tempo. Em vez de ter que encontrar todos os DEXs como o exemplo que eles deram e depois comprá-los individualmente, o investidor pode simplesmente usar o fundo negociado DAO em um período de tempo muito mais rápido. Para alguns investidores isto seria vital se eles quiserem entrar e sair mais facilmente do mercado ou de mercados específicos como o Cardano DeFi ou Cardano DEXs. Em geral, é claro que há uma grande demanda potencial para esta solução e, portanto, poderia ter um grande impacto no ecossistema.", "q0r": 5, "q1": "A equipe por trás da proposta é a MLabs, que trabalhou com a IOG para ajudar a executar partes do protocolo Cardano. Além disso, eles também estão trabalhando com muitas das equipes da DeFi no ecossistema e ajudando-os a executar suas próprias soluções. A equipe de proposta fornece um link para seu repositório Github onde você pode ver uma longa lista de contribuições para os projetos Haskell e o ecossistema Cardano especificamente. As partes-chave da proposta são discriminadas em um orçamento com o número de horas necessárias para cada uma que produz o total do orçamento final, onde o custo por hora é de US$ 80. A equipe tem uma grande quantidade de evidências de sua experiência e com um orçamento e escopo razoáveis este projeto parece altamente viável de ser executado com um alto padrão.", "q1r": 5, "q2": "A equipe de proposta delineou um conjunto de características junto com o orçamento para quanto tempo levará para ser concluído. Um conjunto de pontos de critérios de sucesso são adicionados que se assemelham a pontos de conclusão de marcos. Os KPIs sobre o produto final não são adicionados. A equipe de proposta forneceu seu repositório Github mostrando muito código fonte aberto. A equipe não deixou claro se esta proposta seria de código aberto e estaria disponível para a comunidade. Teria sido bom ter KPIs mais específicos relevantes para o tipo de fundos que eles pensam que serão produzidos e um plano de código aberto para dar uma classificação completa a esta proposta.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Olá ada eleitores! Este desafio é \"Boosting Cardano's DeFi\" e esta proposta está alinhada com o desafio pelo seguinte motivo. Defitivamente ainda está inerentemente associada a alto risco, o que pode ser um impedimento para os usuários de bordo. Esta proposta visa mitigar alguns dos riscos da Defi, criando ETF's onde você poderá ganhar exposição a múltiplos ativos em vez de colocar todos os seus \"ovos\" em uma cesta. Isto pode ser útil porque muitas pessoas querem o lado positivo que esta nova tecnologia traz com a capacidade de mitigar o máximo de risco possível. Na nova tecnologia também vem com uma série de projetos potencialmente não funcionando a longo prazo, portanto, ao obter exposição a múltiplos projetos na Defi, você pode realmente tirar vantagem do lado positivo sem se alavancar demais em um único projeto. Eu vi a popularidade crescer neste conceito de \"Etfs criptográficos\" entre outras cadeias, então sabemos que se isto for feito corretamente, poderá inflamar uma grande quantidade de adoção e ajudar a impulsionar a Defi em Cardano!", "q0r": 5, "q1": "MLABS é a organização por trás desta proposta, então devemos começar lá quando avaliarmos se eles têm a capacidade de executar! Ainda é cedo quando se trata de desafiar no cardano, porém, depois de ler suas credenciais no plano apresentado, devo dizer que é altamente provável que eles sejam capazes de executar. Isto porque a MLABS é experiente no desenvolvimento da Defi e é uma equipe bem conhecida entre a comunidade de cardano e catalisadores. Eles são parceiros da iog plutos e empregam mais de 65 dispositivos para ajudar a construir a potencial futura marca Defi dapps como sundae swap (um dex) e financiamento líquido (uma plataforma de empréstimo defi) e muitos outros. Isto nos mostra que eles são bem respeitados e competentes. Também podemos ver sua capacidade de executar as etapas iniciais desta proposta quando damos uma olhada em seu plano de implementação. Por exemplo, eles nos dão estimativas claras e transparentes de como utilizarão os fundos, quanto tempo a implementação levará e a quantidade de recursos humanos de que precisarão para começar.", "q1r": 5, "q2": "Ao avaliar se esta proposta pode ser auditada, o que me chamou a atenção foi que eles nos deram estimativas claras sobre o tempo que esta proposta levará para ser implementada. Isto nos dá uma linha morta como eleitores para acompanhar o progresso da proposta. Eu também encorajaria os eleitores a olhar para a seção de métricas-chave quando se trata de auditar o progresso da proposta. Eles reconheceram que a Defi on Cardano está adiantada, portanto é difícil compilar medidas como usuários ativos diários ou valor total bloqueado e eu realmente aprecio isso, uma vez que a Defi on Cardano ainda está na infância e não temos os dados para avaliar essas métricas-chave. No entanto, eles dão uma promessa competitiva de fornecer essas métricas-chave à medida que o espaço evolui e os dados são mais transparentes. Por exemplo, com a tvl eles dizem \"teremos a capacidade de expandir para lidar com o que quer que a carga venha a ser\", o que significa que a carga da tvl pode ser tratada não importa a quantidade. Isto significa que podemos auditar a precisão disto, vendo se a Dapp Terminada está manuseando com segurança os influxos de capital ou se não está. pensamentos finais aos eleitores ada - Se há uma coisa que é importante para a Defi nesta fase nas opiniões de muitas pessoas é a segurança, então eu respeito que eles tenham plantado uma bandeira no chão quando se trata de ser capaz de lidar com qualquer quantidade de fundos que venham para o produto final desta proposta. Como Michael diz que o dinheiro mais forte sempre atrairá riqueza. Portanto, para mim isso significa que uma maneira segura de investir em Etfs criptográficos é muito importante para colocar o desafio no cardano neste momento. A Mlabs escreveu uma bela proposta para lançar seu mvp (o dapp desta proposta) e prometeu na referência que eu disse sobre o manuseio da tvl para torná-la segura, não importando a carga de capital.", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Proposal addresses the problem of users seeking alternatives to volatile markets. This project will ad value to the Cardano ecosystem by attracting new users to Defi on Cardano and connecting to other Defi projects. The key metrics are perfectly aligned with the Challenge as they are identical. This project is able to scale as it will be open source and has a governance system.", "q0r": 5, "q1": "Relevant skills and team is provided via github page. They have been actively working and contributing to many Defi projects in the Cardano ecosystem. The budget seems reasonable and is broken down into identifiable items that shows how many hours are allocated to each item and a total of 880 hours to complete the whole project seems doable. They explain in great detail what they want to build and what the core functions are, but they don't go into the technical details on how they will build this. Providing the reader with the technical details will show them your building process and boost confidence in your abilities. There are considered risks throughout the proposal, it would have been nice to view them all in one place, but at least they are there. They will address the risk of resources lost due to bugs, by submitting their work to the certification process at IOG.", "q1r": 4, "q2": "They provided a roadmap with milestones of different parts of project that gets completed. The milestones can be used as KPIs, but it would help to have user based KPIs and transaction KPIs. The more KPIs you provide the easier for the community to track the performance of your project. They address the problem of volatility in Defi markets being unattractive to some users. They solve this by offering stable alternatives to new and experienced users.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 25, "ne": 6, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "An outstanding idea for pooling investors into a decentralized trading fund focused on Cardano Native Assets.  This is likely to be a popular Dapp if successful since it provides an easier way to gain exposure to a complex marketplace. The plan includes development of automated processes for the vault, distribution of fees/discounts, and governance.", "q0r": 5, "q1": "MLabs is one of the stronger development teams in the Cardano ecosystem with experience with Haskell, Plutus, and Rust developers.  The project plan is broken down into 9 features and funding for changes. A minimum viable product is described for the core functions and deposit options. They have outlined a plan for MVP in 8 months and launch in 12 months.  They acknowledge that the scale of the launch is dependent on the pace of assets available to invest in over the next year. ", "q1r": 5, "q2": "MLABs provides an answer for each of the 12 requested metrics, though most of the answers are either TBD or vague.  Nevertheless, the core goal to facilitate the utilization of dapps on Cardano seems trackable. More importantly, the clarity of the project plan will provide a base upon which progress can be measured.", "q2r": 4, "assessor": "z_assessor_145", "no_vca": 24, "ne": 3, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralisation can be for economic empowerment. However, it is important that DeFi projects have good accessability and also enable to bank the unbanked instead of just beeing an elitist project. I have done some personal research on both DeFi and microlending especially with a focus on Global and social justice and hope to bring in a valuable perspective on accessability for poorer people with my reviews in this challenge.  As someone who has already traded with ETFs, i also know how the fundamentals of them work and am able to assess whether this project makes sense. This proposal offers a good solution to some points of this challenge, like accessability to DeFi. A tokenized asset has the potential to offer DeFi accessibility even to people that don't have a lot of money. This will clearly add value to the Cardano ecosystem if it is done in a comprehensive manner and will support native tokens and DEXs.\r\nThe proposal has formulated metrics that align with the metrics of the challenge.\r\n In the way the project is planned, it should be perfectly able to scale with the growing cardano ecosystem. Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q0r": 5, "q1": "The proposers are very transparent about their background and seem competent and up to the task. They provide proof that they know coding and the different layers of Cardano. It is highly likely they are up to the challenge. The proposer has a realistic idea about the number of people and work hours that are required for such a task. The buget is well-defined, fine-grained and rationable. The different parts of the budget are realistic and clearly show where the money goes. While the hourly rate is a bit high it is comprehensible that a company has a bit higher costs to carry than single people that don't have any of the business costs. The proposers have set out a plan for the case that the project will take longer time and have higher costs. The timetable is realistic for a project of this scope. The plan of implementation is shown and seems realistic. Technical aspects are only explained superficially and could be more detailed to get a more in-depth view of what is going to be done. Challenges and risks to the project that might occur are not really discussed.  Feedback: Since you already considered my feedback ahead of the assessment phase, I have no further feedback.", "q1r": 5, "q2": " A detailed roadmap with milestones and a time horizon is presented. The targeted problem and the solution are explaind clearly and comprehensible. Hence, overall this proposal is audible.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 10, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This project will help to improve the development environment of DeFi, it will help to mitigate some of the risks associated with cryptocurrency investing as the proposer said in their solution brief. \r\nMoreover, the proposer also lists some important points that this project will impact to the Defi, therefore, impact the Cardano ecosystem. \r\nThe proposer also outlined very detail the project's success will be and described very detail the key metric they choose for this project, and all of them shows that met with the challenge settings. ", "q0r": 5, "q1": "The proposer explained clearly about their solution with samples and feature explanation, that can help anyone to assess their tasks in the \"What success look like\" part, that very details in months.\r\nMoreover, they have a page of budget breakdown that is very clear by work-hour, as if you have experience in dev, it's all reasonable and realistic. \r\nTherefore, I rate 5 for the feasibility. No more comment on it, they're made all perfect and I believe that they will do it right. ", "q1r": 5, "q2": "This proposal is driven by a very experienced team, they're IOG partners with over 65 Haskell developers working on some of the ecosystem's biggest projects - including SundaeSwap, Liqwid... \r\nMore than that, they made this proposal so perfect and clear that will help our community simple to audit the project on single tasks.\r\nThe proposer didn't have a part to show their relevant risks and how they face them, but in the detail of the proposal, I can see some challenges that they also have the plan for that. So I think this proposal is 100% auditable. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 15, "ne": 5, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Mlabs' proposal seeking to create pools of assets that help to mitigate some of the risks associated with cryptocurrency investing. Proposal mentioned importance of such funds like Ardana, CardsStarter, Player Mint etc. - for diversification, lower costs and Strong long term returns. Thus the challenge is effectively addressed.", "q0r": 4, "q1": "MLabs is IOG partner, has over 65 Haskell developers that developed Sundae Swap, Liqwid, etc. The proposal can be successfully implemented. The detailed plan mentioned multi-asset vault structure, tracker, re-balancing functionality, multi-asset dep functionality, The detailed plan will make implementation successful", "q1r": 4, "q2": "The road map structured into 1st , 3rd, 5th, 8th months and the expected launch date of 4th quarter 2022 will make auditing effective. The budget has a detailed breakdown to make auditing easier and effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The ability to create this kind of infrastructure for ETF-like investments is important and would represent an impactful addition to Cardano DeFi. One can argue about the usefulness of curated baskets and rebalancing that the average investor is unlikely to understand. However, it seems to be a worthwhile return on investment and good value for ADA holders.", "q0r": 4, "q1": "MLabs's track record and association with IOG make it highly likely that the project will be a success. This is a very impressive team and one of the largest pools of Plutus talent.", "q1r": 5, "q2": "The amount of detail presented both in the proposal and whitepaper is impressive. The technical detail and cost breakdown are not matched by sufficient performance metrics and it would be difficult to assess before completion if the project is succeeding or failing.", "q2r": 3, "assessor": "z_assessor_692", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposal is feasible when creating valuable asset groups and minimizing the risk of high price fluctuations, suitable for investors who do not want large fluctuations. The project is open to everyone and suitable for the challenge. The proponent should add some similar and more prominent utilities than an ETF (for example, if I own a DTF, can I vote for separate projects in the fund? ", "q0r": 4, "q1": "Proposers that mention MLabs as an IOG partner should still add the identities, expertise of the participating members and should include detailed documentation on how/demo/specs/features/ will be apply. The proponent has provided a monthly and quarterly timeline that will perform some functions with an hourly cost, the estimated cost of 160h*80$ should provide more information or predict risk issues.", "q1r": 3, "q2": "The proponent provides a roadmap for the implementation of the functions, but has not yet seen the additional KPIs needed to measure. It is necessary to add the risks, difficulties and challenges of the project, especially the unknown resource portion, how many people and teams are involved.", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal as implemented will not deploy an open financial solution within six months, as indicated in the proposal. Additionally, may increase exposure to security risks given that defi projects associated with indexed assets are maintained separately and outside of the scope of this financial solution. Finally, the proposal as funded wouldn't negate the introduction of venture capital, and may actually make it an easier point of entry into Cardano defi solutions. \r\n\r\nWith that said, basket funds offers users more familiar vehicles that may offer a healthier balance for certain risk and investor profiles. ", "q0r": 4, "q1": "It's clear that the organization is already active in the Cardano space, and very aware and hands on with defi projects that have the potential to form a part of the basket(s). The fact that 60+ developers are already on the books means DD&I can ramp up very quickly. The main variable may be allowing the team time to assess the early evolution of defi projects that have the potential to be indexed over the course of 2022. ", "q1r": 5, "q2": "Good, high-level breakdown of quarterly project timelines and deliverables. ", "q2r": 5, "assessor": "z_assessor_716", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal alligns with the challege goals. Specifically it attempts to solve the problem of decentralized ETFs. This proposal also make it clear that the product will be very attractive for new comers to the ecosystem that want to minimize risks. Furthermore, the proposal includes many metrics like the type of tokens to be made into DTFs and so on. ", "q0r": 4, "q1": "The proposer presented a link to their GitHub account which seems to be very active and includes many Cardano-related projects. The projects are also segmented into steps and categories and into hours needed for each category. They also provide a realistic timetable that leads to an MVP and then to further added features.", "q1r": 5, "q2": "The project presents a clear roadmap with different incremented goals. A lot of milestones are also given divided into categories and monthly goals. Finally, the team seems to understand the problem at hand and has a clear idea about how to solve it.", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The creation of a DAO ETF would significantly boost the early Cardano DeFi space with the ability for members to efficiently diversify their risk.", "q0r": 5, "q1": "The MLabs team are Plutus partners and have worked with IOG + multiple Cardano DeFi protocol's during their v1 development. The present a coherent timeline, budget and implementation plan in this proposal. The combination of their team, past project work and plan to implement this solution are all pointing to high chances of a successful proposal implementation. ", "q1r": 5, "q2": "This is one of the most complete/structured proposals in this challenge by one of the strongest Plutus development shops currently building in the Cardano DeFi ecosystem. ", "q2r": 5, "assessor": "z_assessor_769", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "MLabs DTF - ETFs criam pools de ativos que ajudam a mitigar alguns dos riscos associados ao investimento em moedas criptográficas.", "experience": "A MLabs é um parceiro IOG. Temos mais de 65 desenvolvedores Haskell trabalhando em alguns dos maiores projetos do ecossistema - SundaeSwap, Liqwid, etc."}