{"id": 381817, "author": "ayobamimacaulay", "title": "P2P Currency Exchange with DEFI", "url": "https://cardano.ideascale.com/a/dtd/381817-48088", "category": 26233, "amount": 30000, "description": "Os imigrantes perdem muito dinheiro convertendo a moeda mal servida para o USD e depois convertendo para a moeda de que necessitam (NGN - USD - CAD)", "funded": 1, "upvotes": 80017273, "downvotes": 10494889, "votes_result": 69522384, "votes_cast": 619, "f6_no_assessments": 3, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "As the world has still a strong demand for fiat currency, finding a way to bridge fiat to fiat undergoing  through a stable coin swap to accelerate the transfer and reduce the transaction cost, is definitely needed and this proposal by offering this for sure is offering a way to leverage Cardano DeFi", "q0r": 5, "q1": "As stated in the proposal brief, Reyts is fully registered with Fintrac and has its compliance documentation created by legal advisors with decades of experience in the space. \r\nThe plan is clear and well outlined.\r\nThere are some missing details such as the algorithm that regulates the stable coin: it would be easier to use Djed directly. ", "q1r": 4, "q2": "The budget and the timeline are well defined, taking in account a beta test phase and a buffer time to build the proprietary stable coin", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1, "reply": "Thank very much for reviewing our proposal.\nWith DJED there is a requirement for a standing amount of fiat to back any available stable coins.\n\nTo stay within regulatory guidelines in the countries we are seeking to service and to provide an overall performance and audit boost, our stable coin and its underlying fiat backing exist only to facilitate the movement of fiat and cant be held for use in other applications.\n\nOur investment / governance tokens will however satisfy those needs and, specifically for the investment token, provide an added layer of liquidity in order to provide more choice for users and investors alike.\n\nThank you once again!\n"}, {"q0": "This project will make a DEX that helps users exchange the currency they have for the currency they need in a P2P fashion and solve the problem of losing money when converting underserviced currency to fiat then converting to the currency they need. This problem is within the challenge and this project will help users a lot in saving the losing money. \r\nThe proposer also describes how this project will impact the Cardano ecosystem by driving more adoption of their product. \r\nLastly, the proposer provides KPIs and their definitions of success are aligned with the challenge settings. ", "q0r": 5, "q1": "The proposer share a very detailed implementation plan that includes the market problem and solution, product with detailed features... that can help us assess their roadmap easier. \r\nThe roadmap the proposer share in the proposal is summarying enough for their job in months, but each working package is detailed clearly in the budget breakdown. And all reasonable! \r\nIn addition, looking at their team in the attached website link I think they can make this project. But they should provide some related risk that can affect their plan and prepare for them. ", "q1r": 4, "q2": "There is a roadmap with realistic timeline that I mentioned in the previous comment. The proposer also provides KPIs and key metrics that help us know what they want to lead to for their project. Therefore, the proposer provides enough info for auditing the project in the future. \r\nThe proposer also describes very detail how their system will work in case studies, it helps a lot in addressing how their idea will solve the standing problem. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 14, "ne": 4, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "Thank you very much for the time you spent on this proposal. It is greatly appreciated.\n\nThe key risk involved in this project is compliance in terms of merging traditional banking infrastructure with block chain.\n\nThis risk has been mitigated by hiring a top compliance team in Canada.\n\nsee here:\nhttps://www.theamlshop.ca/our-team-1\n\nthanks once again"}, {"q0": "The proposal clearly outlines the plan for development of a stable coin and DEX that addresses the issues within their community. The idea is well within the challenge theme and solved a real-world problem.", "q0r": 5, "q1": "The team has a general idea of what they want to achieve but seems like there is a lack in understanding in the development of their project. A Cardano or even blockchain-versed teammate would have been helpful in clearly outlining the implementation plan.", "q1r": 4, "q2": "The idea itself is simple to understand, and they have provided a roadmap to track its implementation. However, the team has not addressed how they will tackle the direct risks and challenges that threaten the implementation of such projects.", "q2r": 3, "assessor": "z_assessor_812", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1, "reply": "Thank you very much for reviewing our proposal.\n\nThe main risk lies in compliance when dealing with AML/ATF regulations. Our compliance team ( https://www.theamlshop.ca/our-team-1 ) is one of the best in Canada and we have our documentations, methodologies and controls currently being peer reviewed by independent experts in order to finalize our approach without jeopardizing ease of use for all parties.\n\nThank you once again. "}], "solution": "Uma moeda fiat DEX estável que permite aos usuários trocar a moeda que possuem pela moeda que necessitam, de uma forma P2P", "experience": "Nossa equipe construiu uma solução de troca de p2p sem correntes de bloqueio (Pré-Lançamento) e está procurando impulsionar a solução, construindo sobre Cardano"}