{"id": 381939, "author": "tomwedler", "title": "Carbon as DeFi Asset | BlockCarbon", "url": "https://cardano.ideascale.com/a/dtd/381939-48088", "category": 26233, "amount": 30000, "description": "As iniciativas de compensação de carbono proliferam, mas carecem de um padrão coerente, confundem os consumidores e retêm a comoditização como um bem investido.", "funded": 2, "upvotes": 149786701, "downvotes": 13951975, "votes_result": 135834726, "votes_cast": 829, "f6_no_assessments": 6, "f6_rating": 4.5555555555555545, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=22904"], "media": [], "f6_assessments": [{"q0": "Olá Ada Voters ! Quando perguntado se este desafio é o desafio certo para esta proposta, devo dar 5 de 5 a esta proposta! O desafio é o de impulsionar a Defi em Cardono e esta proposta irá impulsionar a Defi em Cardona pelas seguintes razões. A primeira razão é que os créditos de carbono em cadeia e a tokenização do mercado de carbono tem se tornado cada vez mais requisitado. Isto se deve a uma falta de transparência nos mercados tradicionais de carbono e a muitos investidores especulando que os créditos de carbono que são emitidos para empresas de energia renovável e comprados por empresas que omitem o carbono se tornarão cada vez mais escassos e valiosos ao longo do tempo. Especialmente com os mandatos governamentais e a popularização do aumento do preço dos créditos de carbono para tornar o carbono mais caro para as empresas que omitem a compra de carbono. As inundações de capital chegarão às primeiras propostas que podem colocar com sucesso os créditos de carbono e o mercado de carbono em cadeia. Vemos isto até como Mark Cubin afirma neste artigo https://www.yahoo.com/now/mark-cuban-buys-50-000-165355744.html?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAHUAOD2t7vn1ELZPZrhEdD2N2xuKp5LEybeqNLo7tmaZxGqdH6RmxCBRDoNVwnOm9w9uIC89fYk9B4nZ7gnmpVOVzkPDxsZ5wm7Qm96J1iq4P9SeSliB1xIoNlu2q-wcL3VJYDTT_cuXvEMYj-FZnkD3U9FMqfE7kh2xISeW7j7N ele colocará 50k a cada 10 dias em um dapp polígono que leva \"Verra vcu's 2008 vintage e acima\" (créditos de carbono certificados) e permite que você os compre através do protocolo tucano. Vimos como Cardano é pintado como uma cadeia de bloqueio muito verde, portanto, quanto mais cedo começarmos a implementar os mercados de carbono da cadeia, mais cedo veremos um impulso na defi em Cardano.", "q0r": 5, "q1": "Quando perguntados se o plano pode ser executado, precisamos ver se o plano é exequível. Quando perguntado se precisamos olhar 1. quem está por trás do plano e 2. o que é o plano. Também precisamos perguntar 3. quais são os riscos fora do controle das equipes. Estou contente de ver uma riqueza de experiências diversas por trás da equipe e encorajo os eleitores da ada a olhar para a experiência das equipes, então copiarei e colarei a biografia de cada membro da equipe no final da parte de viabilidade desta revisão. Para mim, a experiência da equipe fala por si mesma nesta proposta com antecedentes em Plutos, meio ambiente, finanças, gerenciamento de risco e marketing, bem como criptografia. Não há muitos buracos na equipe que eu possa ver para o que esta proposta indicou que ela precisará para executar com os 30k que eles estão solicitando. Além da competência demonstrada pelos membros da equipe, o plano em si começa pequeno, mas oferece linhas de tempo e métricas ambiciosas. Acredito que estas métricas são ambiciosas porque Cardano defi até o momento não tem muitos dados, já que o defi em Cardano ainda não foi visto em escala para não mencionar o defi incluindo os mercados de carbono. Acho que o plano está bem definido e eles têm dado muitos itens acionáveis que demonstram como esta proposta será implementada e escalonada ao longo do tempo. Portanto, acho que a proposta atende aos padrões de viabilidade se contarmos com o vento de cauda do defi em Cardano e com os mercados de créditos de carbono em cadeia crescendo em popularidade, bem como com a experiência das equipes. Minha única outra preocupação era sobre os riscos relativos ao mercado de criptografia mais amplo e à regulamentação, porém gostaria de creditar a equipe por identificar tais riscos na proposta, uma vez que não se trata de saber que a equipe levou em conta esses riscos fora de seu controle e indicou maneiras de mitigar esses riscos através de suas conexões e parcerias futuras tanto no mercado de carbono quanto nos espaços criptográficos. Aqui estão as equipes bios como prometido.....\r\n\r\nThomas Wedler\r\nComerciante e empresário experiente de derivados de energia. Ex Shell, Vattenfall, Masefield comerciante sênior. Tom vem construindo e implantando programas de automatização do mercado e de derivados de energia desde 2014. 15 anos de experiência em organizações multinacionais trabalhando em conjunto com órgãos da indústria e palestrante em conferências e workshops sobre o mercado de energia. Envolvido em negociações criptográficas desde 2014 e DeFi/oracles desde 2018.\r\nhttps://www.linkedin.com/in/thomas-wedler-18960/\r\nJunho Akra\r\nEspecialista do mercado financeiro e acadêmico com vasta experiência em gestão de risco, derivativos e commodities. Experiência para várias funções de risco em fundo AUM de 2 bilhões de dólares. Titular de Mestrado em Investimento com distinção e premiado Prêmio Draper. Ex-alunos certificados em Finanças Quantitativas (CQF) de Londres. Experiente editor de vídeo, criador de conteúdo com 50.000 seguidores combinados nas mídias sociais, colecionador e criador de NFT e praticante de AI python certificado.\r\nhttps://www.linkedin.com/in/june-a-a3a0b4174\r\nStefan Herde\r\nExperiente CEO do mercado de energia, consultor, especialista em energias renováveis e eficiência energética e ex-presidente de um bilhão de dólares da US Inc. Total de mais de 30 anos de experiência no setor de energia.\r\nhttps://www.linkedin.com/in/stefan-herde-33058539/\r\nLloyd Duhon\r\nLloyd é proprietário/operador da Fazenda Living Greens Urban Farm e um veterano de 25 anos de TI, com experiência em nível de CTO. Cardano Plutus Pioneer 2nd Cohort. Experiente na liderança de equipes de desenvolvimento e trabalhando em estreita colaboração com a Florida Gulf Coast University. Tom, June e Stefan conheceram Lloyd através das etapas de Ideação e Refinamento do ProjectCatalyst e planejam colaborar com seu projeto de agricultura urbana compartilhando recursos de desenvolvimento.\r\nhttps://www.linkedin.com/in/lloyd-duhon/", "q1r": 5, "q2": "Quando perguntados se a proposta pode ser auditada e se a equipe pode ser responsabilizada, vamos ver se eles nos deram as principais métricas e prazos para a implementação. Com relação a isto, parece que cada passo de seu plano foi dado tanto uma linha de tempo quanto métricas chave que escalam com o decorrer do mês. Por exemplo, veja abaixo uma métrica o Número de projetos reais integrados a esta proposta é indicado aqui \"Número de projetos reais (múltiplos de toneladas métricas de carbono) embarcados: um após 2 meses, três após 3 meses, seis após 4 meses, 15 após 6 meses\". isto nos dá em tempo real uma maneira de responsabilizar a equipe por estas métricas. Acrescentarei feed back para a equipe da seguinte forma. Uma coisa que eu gosto de ver é como você vai realizar algumas dessas métricas e porque elas são importantes para que os eleitores ada vejam manifesto... por exemplo, quando se trata da presença nas mídias sociais, você indica \"seguidores da mídia social do projeto BlockCarbon através dos canais de mídia social\": 1000 após 2 meses, 2000 após 3 meses, 5000 após 6 meses\" e de um ponto de vista de auditoria isto é ótimo, mas sinto que os seguidores da mídia social não é uma das melhores métricas para se filmar, pois estes números podem ser manipulados através de bots ou comprados, então eu acho que o significado e a qualidade dos seguidores que você está filtrando seria uma métrica melhor para rastrear e filmar para então a mera quantidade. Espero que este feed back possa fornecer algum valor para a equipe, pois eu realmente gostaria de ver esta proposta ter sucesso, como já afirmei. Posso ver como pode ser impactante para a Defi em Cardano uma proposta do mercado de carbono! Tudo de bom para os eleitores da ada e obrigado por considerar esta proposta e revisão!", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "Proposal identifies the problem of onboarding existing financial operations into Defi on Cardano. The project will ad value to the  Cardano ecosystem by driving new users from existing financial markets to Cardano. Key metrics are inline with the challenge setting's as it focuses on growth and collaboration. The proposal is able to scale quite well as it will be open source.", "q0r": 5, "q1": "Relevant skills and team has been provided. I can't find any proof of Lloyd's Plutus skills. I couldn't find his profile on github. This might steer away some voters. It is important to prove the team's skills in order to gain trust from the community. The budget is reasonable and broken down into identifiable items. Some of the work they will do voluntarily. The time to complete the project seems reasonable, they will need additional funding after the 6 month period to build a marketplace. They explain in great detail how they will approach, educate and integrate with the existing Carbon financial markets. One part I would like to see more detail on is the educational content that they will create. Will it include token creation education etc. More detail on the content of that package would help the voter understand what the packaged product looks like. The  technical aspects of the  content created has not been explained as mentioned. They went into great detail describing potential risks and how they will mitigate them.", "q1r": 3, "q2": "They provided a clear roadmap with milestones and lots of KPIs that are measurable. Tracking the performance and progress of this project will be easy as there are a lot of user based KPIs. They address the problem of current Carbon offset initiatives that create more confusion than actual value to the user and to the  earth. They solve this by brining these initiatives to Defi in an open source way so the community can get creative and build new alternative ways to create more value for these initiatives.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1, "reply": "Dear Assessor, you wrote in your assessment of our proposal Carbon as a DeFi | BlockCarbon that you \"can't find any proof of Lloyd's Plutus skills\". This resulted in a relatively low score of 3 stars. We found this a bit harsh and wanted to reach out to you. As we cannot possibly document all skills and work experience of every team member, we hoped that assessors would either take our word for it, or research themselves. For your reference, Plutus pioneers 2nd Cohort will have their class photo in January, as it was delayed on the IOHK side. Lloyd did write an article to help others in the program here:  https://www.publish0x.com/plutus-pioneer-trail/trailblazing-plutus-on-cardano-xvyweyp\nLooking forward to your feedback. Thank you from the BlockCarbon Team\n"}, {"q0": "The proposal is very ambitious and could, if successful, have a huge positive impact on Cardano. Creation of a good on-chain carbon marketplace with defi capabilities would bring the world's attention to Cardano and establish it as a leader in sustainability and green blockchains. The proposal clearly falls within the DeFi spectrum, but falls just short of HOW exactly DeFi would be used to generate yield for carbon hodlers/generators. The proposal clearly builds up to it, though, and DeFi seems like a natural fit with the project, even if the exact mechanism is yet to be determined.", "q0r": 4, "q1": "The project is very ambitious, and it seems unlikely that the team as is could reach the goals mentioned. However, they have a clear and targeted vision, and mention using volunteers as a resource for their project. The plan is laid out clearly both for the duration of the project but also for the future steps. The team has good credentials on the carbon-credits side, but lacks on the technical blockchain side. This concern is addressed in the risks and challenges, however, and isn't cause for concern for now.", "q1r": 4, "q2": "Basically everything in the project is auditable and measurable, so success can be monitored easily. The milestones for this proposal are laid out clearly and can be verified, and the success metrics are measurable and verifiable.  The proposal identifies main risks and challenges, indicating that they know what they would need to work on next to keep their project afloat.", "q2r": 5, "assessor": "z_assessor_318", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your feedback. We agree with your remarks on Impact and Feasibility. DeFi on Cardano is quite new and instead of promising high yielding features or building a huge team before the first initial successful pilots, we had to paint the roadmap in relatively broad strokes. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon Team"}, {"q0": "Your solution; Open Source library to enable pricing and exchange of Carbon as tokens and derivatives utilizing Plutus. Is exactly what this Challenge is all about. I Strongly Agree", "q0r": 5, "q1": "Your teams experience in Energy Derivatives, Financial Markets, Renewable Energy and Plutus Pioneer program makes for an excellent and Very Strong experience level. \r\nYour Budget breakdown and timeline is good and your willingness to donate time at zero cost all indicate the path to a successful project.  I Strongly Agree", "q1r": 5, "q2": "Your project's Roadmap, KPI's and Performance Metrics are sufficient to audit your progress and success.", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 26, "ne": 1, "ng": 13, "nfo": 12, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. Thank you from the BlockCarbon"}, {"q0": "The beauty of this proposal is the new knowlege gained just by reading it. It addresses the challenge from a unique perspective. Emmisions can be lowered with the use of blockchain and this proposal lays out a solid foundation for it to happen. ", "q0r": 5, "q1": "The team behind this proposal is very solid. They aren't anonymous and they have the credentials to see the project through. It's difficult to fault them and that is a good thing. Incentivising green practices is always a win and this win will require a lot of work. ", "q1r": 4, "q2": "Yes. With a detailed list of Performance indicators, it's easy to follow this project's trajectory. The details provided show that a lot of thought and consultation has gone into the planning of this proposal.", "q2r": 4, "assessor": "z_assessor_700", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \nThank you from the BlockCarbon Team"}, {"q0": "The proposal does an outstanding job of identifying inefficiencies and problems under the current carbon market constructs, and explaining why defi solutions will help. ", "q0r": 5, "q1": "The team's experience seems relevant. Although it's not clear what specific regulatory market jurisdictions they have expertise in; nor is it clear how far networking skills may lead to market participants committing. ", "q1r": 4, "q2": "The deliverables are clear, and associated project timelines are clear. ", "q2r": 4, "assessor": "z_assessor_716", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1, "reply": "Dear Assessor, thank you very much for your kind feedback. We are strongly committed to making the project a success and will commit whatever personal sacrifices necessary. We want to add well-researched features and capabilities instead of unsustainable, publicity-grabbing stunts like yet another green token or tracking app simply replicating off-chain schemes with their current flaws. \n\nYou mentioned that it wasn't clear from the proposal what specific regulatory market jurisdictions we have expertise in. We have worked under Kyoto Protocol Clean Development Mechanism, which was a United Nations framework that linked global projects with Emissions Trading Schemes (we worked with parties in Malaysia, Thailand, Pakistan, Canada and the European Union). Today, most Voluntary Offset Schemes including those certified by Verified Carbon Standard (ex-Verra) are global and often criticised for their flaws and \"greenwashing\". Instead of national legislation, there is a strong case for auditability outside national or corporate interests to be made, something that has begun promisingly by some universities. We can make this a success with support from people like you.\nThank you from the BlockCarbon Team"}], "solution": "BlockCarbon - Fundação e biblioteca Open Source para permitir a fixação de preços e troca de Carbono como fichas e derivativos utilizando Plutus.", "experience": "Especialistas do Mercado de Energia e da DeFi em parceria com Plutus Pioneer e CEO de Energia. Experiente em contratos de carbono e derivados de Kyoto/Paris."}