{"id": 383214, "author": "tobrien", "title": "Climate Finance For Small Farmers", "url": "https://cardano.ideascale.com/a/dtd/383214-48088", "category": 26233, "amount": 12000, "description": "A modernização da agricultura exige que os pequenos agricultores assumam riscos de subsistência sem redes de segurança.", "funded": 1, "upvotes": 38124024, "downvotes": 31684484, "votes_result": 6439540, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta enfrenta efetivamente o desafio, que é o de aumentar o espaço da DeFi Cardano, fornecendo a solução para uma cadeia de fornecimento muito importante e eficiente. Trabalhei durante vários anos na cadeia de abastecimento da Agri, desde agricultores a multinacionais e pude apreciar a importância de tal proposta e o impacto que ela poderia causar nas pessoas, na natureza e fornecendo soluções também para a Cardano. A proposta identifica um problema que tem o potencial de impactar o desafio, mas ainda requer alguma pesquisa/papel branco para ser feito. A proposta tem o potencial de agregar grande valor ao ecossistema Cardano, mas além de mencionar o tamanho do mercado, teria sido bom acrescentar mais algumas informações sobre regras e processos financeiros e como eles se relacionam com o mecanismo DeFi.\r\nVárias métricas e objetivos-chave da proposta estão alinhados com os cenários de desafio delineados. Embora os desafios sugiram alguns KPIs específicos que não são mencionados. Embora ainda seja cedo, poderia ter sido bom acrescentar algumas estimativas, tais como quantos agricultores o aplicativo incluirá um em cada etapa. Acrescentar mais algumas sobre o piloto proposto (agricultores, cadeias de fornecimento, preços, colheitas, desafios-chave) teria sido muito útil.", "q0r": 4, "q1": "A equipe é altamente experiente e a proposta fornece informações suficientes para confirmá-la. A equipe também está ativa no ecossistema Cardano e catalisador por vários anos. Poderia ser bom fornecer mais informações sobre o projeto local e a liderança da equipe em Gana. O orçamento é delineado claramente e dividido em itens identificáveis e é razoável para atingir as metas estabelecidas. Sendo eu mesmo um empreendedor, posso estimar que o custo é muito moderado para os objetivos e que mais fundos serão necessários. É ótimo que o proponente tenha como objetivo levantar fundos dos investidores, mas será no final do ano e provavelmente serão necessários mais recursos no processo (ou seja, desenvolvimento, liquidez). Poderia ter sido bom se relacionar com isso na proposta e fornecer mais informações. A proposta oferece um cronograma realista para completar o trabalho.\r\nAs cadeias de abastecimento agrícola são complexas e há muitos desafios que serão importantes de mencionar e estar atento. Como os objetivos do trader, a logística ou as necessidades do ciclo de fluxo de caixa. Mais uma vez, poderia ter sido útil ter mais informações sobre o projeto piloto para avaliar a viabilidade.  ", "q1r": 4, "q2": "A proposta tem um roteiro claro, etapas, orçamento, estimativa de tempo e resultados. O problema a ser abordado e a solução é muito complexa e enquanto as informações são apresentadas em boa ordem, mais detalhes são necessários e serão fornecidos com o whitepaper dentro de alguns meses. Os riscos e desafios potenciais não são particularmente abordados como mencionado na seção de viabilidade. A expansão da métrica/KPI para medir o sucesso seria benéfica, como o número esperado de agricultores e suas melhorias econômicas. Entretanto, o progresso pode ser auditado com base em marcos a serem alcançados dentro de 3-6-12 meses, e acredito que esses marcos fornecerão grandes informações para a comunidade relacionadas a um desafio importante e escalável enquanto o orçamento for muito razoável - por isso dei a taxa completa aqui.", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Olá eleitores Ada ! Estou tão entusiasmada com esta proposta e com meu papel de revisá-la, pois pude ver como o impacto desta proposta e sua conexão com o desafio pode ser perdido na tradução. A forma como esta proposta está alinhada com o desafio é a seguinte! 1. Esta proposta vai ajudar na única coisa que falta a muitos defi dapps e que é uma conexão com o mundo real e bens/indústrias no mundo real! 2. Cardano defi ainda é jovem, então precisaremos apoiar muitas experiências quando se trata de suavizar as bordas da Defi em Cardano. Esta proposta será compartilhada com o catalisador com quaisquer lições e dados relevantes para melhorar as defi daps que estão por vir. Especialmente no Casamento entre a Defi e a agricultura! 3. O problema que esta proposta visa resolver ao criar um livro branco, um protótipo funcional e uma prova de conceito para seu produto final já indicou 2 jogadores em potencial para usar seu Dapp e estes jogadores estarão a bordo do Cardano impulsionando o Defi nativamente. O primeiro \"jogador\" será os agricultores que têm margens apertadas que podem se beneficiar desta proposta através do cultivo de culturas orgânicas e potencialmente por estarem conectados aos compradores para mitigar os riscos de suas margens apertadas e o segundo são os investidores que podem lucrar com a entrada de capital na indústria agrícola/defi. Precisamos dar um passo atrás nesta parte da revisão e perguntar a nós mesmos o que irá realmente impulsionar a Defi em Cardano? Um dos motivos é que, se olharmos para onde a agricultura está indo, podemos ver que o espaço de dados defi e climáticos será o destino. Isto porque a agricultura é uma indústria cíclica que tem ineficiências de dados que levam a muitos rendimentos na cintura. Há também muitos agricultores pobres conectados que têm culturas que podem ser de alta qualidade, mas o fato de essas culturas não serem compradas leva a muito desperdício. A cadeia de blocos pode resolver estas duas falhas que nosso sistema legado tem. A cadeia de bloqueio faz isso primeiro fornecendo um mercado para os agricultores venderem e comprarem dados e segundo um mercado que pode conectar os agricultores aos compradores em suas fronteiras locais e nacionais e até mesmo em todo o mundo. Acho que o impacto desta proposta será mais benéfico como prova de conceito para fazer a bola rolar na solução destas questões que o mundo agrícola está enfrentando.", "q0r": 5, "q1": "Não creio que tenhamos nenhuma preocupação com a implementação deste plano, pois o financiamento é de 12k e isso não é uma quantia enorme em todo o nosso orçamento, mas o \"ROI\" ou retorno sobre a intenção, como explicado na seção anterior, é bem superior ao de 12k. A razão pela qual estou confiante na implementação das propostas é 1. porque a equipe é altamente experiente e 2. o plano que ela própria não é ambiciosa, pois visa criar um livro branco e estabeleceu exatamente que financiamento, tempo isso levará. Ele também se escalou em um protótipo e prova de conceito de uma maneira muito viável, incluindo um breve resumo de cada etapa que demonstra onde esta prova de conceito florescerá primeiro (gana). Acredito que quando se trata de propostas o \"jockey on the horse\" é a parte mais importante e é por isso que eu convidaria os titulares da Ada a ver as credenciais das equipes abaixo\r\n Jonathan KOH (Diretor)\r\n\r\nJonathan tem mais de 30 anos de experiência no fornecimento de soluções na área de comércio. Jonathan tem experiência prática em mais de 40 programas de comércio digital/alfândega/facilitação do comércio em todo o mundo. Ele é um especialista em plataformas comerciais comumente chamadas de \"janela única\", que é um dos principais instrumentos de facilitação comercial defendidos no Acordo de Facilitação Comercial da Organização Mundial do Comércio (OMC), que está em vigor e ratificado por mais de 170 países. Jonathan atuou como Diretor de Projetos para os muitos projetos de implementação de facilitação comercial, incluindo Quênia, Qatar e Omã. Ele esteve fortemente envolvido em consultoria, servindo como consultor líder do Governo da RAE de Hong Kong para seu sistema de Comércio Eletrônico de próxima geração. Ele foi o consultor líder do Governo da Grécia e ajudou a desenvolver sua Estratégia Nacional de Facilitação do Comércio e seu Roteiro. Ele também liderou estudos de assistência técnica/viabilidade em muitos países. Ele serviu como um recurso especializado para a Comunidade Econômica ASEAN e ajudou a desenvolver os Indicadores de Facilitação do Comércio Sem Costura da ASEAN.\r\n\r\nJonathan também serviu como um recurso especializado para várias organizações internacionais em questões de facilitação do comércio e políticas. Ele foi bolsista visitante do Fundo Monetário Internacional, atuou como membro do Comitê Consultivo Internacional da Rede de Especialistas das Nações Unidas para o Comércio sem Papel na Ásia e no Pacífico (UNNeXT).\r\n\r\nTimothy O'Brien (Diretor)\r\n\r\nTim tem 20 anos de experiência construindo aplicações de missão crítica enquanto trabalha para a Raytheon, Citi Group, Deutsche Bank, Bank of Tokyo, Danske Bank, Philips Health, Cerner Health, Norwegian Air Continental Airlines e, mais recentemente, Google. Tim trabalha com a tecnologia Cardano desde 2019 e é membro do programa Atala PRISM Pioneers. Recentemente, o foco principal de Tim é tornar o poder da cadeia de bloqueio disponível a todos. A Tim tem 6 anos de desenvolvimento de cadeias de blocos e dirige uma empresa de desenvolvimento de cadeias de blocos com mais de 15 empregadores. A Tim é membro da Singularity University.\r\n\r\n \r\n\r\nCraig Young (Conselheiro )\r\n\r\nCraig é conhecido internacionalmente como um especialista em pagamentos internacionais. Como o antigo CTO da SWIFT e o atual CTO da Associação Diem, Craig tem trabalhado incansavelmente para tornar os pagamentos internacionais uma realidade. Craig aperfeiçoou um profundo conhecimento técnico, dando-me uma perspectiva única ao progredir para posições de liderança sênior. Atuei em cargos de VP e Csuite em instituições globais de telecomunicações e serviços financeiros, incluindo SWIFT e Verizon, executando operações de tecnologia, desenvolvimento de produtos, engenharia e segurança cibernética.\r\n\r\nGerhard Eschelbeck (Conselheiro)\r\n\r\nAmplamente considerado um dos maiores especialistas em segurança de redes e sistemas, Gerhard foi convidado a apresentar sua pesquisa em segurança da informação ao Congresso dos EUA, e é também um palestrante freqüente nas principais conferências da indústria.\r\n\r\nEle foi nomeado um dos 25 CTO mais influentes da InfoWorld em 2003, 2004, e recebeu esta honra uma terceira vez em 2006. Gerhard é um colaborador freqüente do consenso dos 20 melhores especialistas do SANS identificando as vulnerabilidades de segurança mais críticas. Gerhard é também um autor altamente considerado e talvez mais conhecido por publicar as \"Leis das Vulnerabilidades\". Ele é um dos inventores do Common Vulnerability Scoring System (CVSS) e detém numerosas patentes no campo da segurança gerenciada de redes.", "q1r": 5, "q2": "Esta proposta é definitivamente \"amigável à auditoria\", pois eles estabeleceram linhas de tempo para cada parcela de financiamento da seguinte forma. Um whitepaper em 2 meses e um protótipo de trabalho em 3 meses a seguir, sendo a prova do conceito um rendimento perpétuo de 6 - 12 meses. Isto nos permite responsabilizar a equipe por cada processo da proposta.", "q2r": 5, "assessor": "z_assessor_766", "no_vca": 16, "ne": 11, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The proposal matches the challenge in that it would create a dApp to support investing in smaller farms with the goal to help the farmers change to a more climate friendly farming.", "q0r": 5, "q1": "I will say here, that the majority of the text of this proposal is about the proposing team and their experience and background. This is certainly great but the idea in itself is very complex and would have benefitted from more content and actionable steps of the project itself and the prior work the team has done. It seems that the team focusses on Africa with this project as this is where they are already working on similar projects. It would have been interesting if the team will be expanding this tool, if the tool will be used exclusively in Africa or if it would be a good tool to adopt to other countries. It would have been great to provide the rationale with a comparison of (government) subsidaries in other countries and the impact that these funds had on emissions when smaller farmers changed to more sustainable farming - it would have been easier to understand the impact, that this proposal might create.", "q1r": 4, "q2": "While it is a great idea, due to the lack of actionable steps, this proposal is difficult to audit and transparency is not as high as in other projects. One of the three references provided in the proposal does not work, the budget is broken down too broadly as is the roadmap. ", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 22, "ne": 1, "ng": 18, "nfo": 3, "vca_o": 1, "reply": "Why is writing a whitepaper about a project hard to audit?\nThe product of this proposal are whitepapers. "}, {"q0": "The proposal as-is lacks detail to make a good opinion of what its impact would be. The general idea seems good, but the proposal remains vague on the details enough that it's hard to picture what the mission is, how will revenue be generated, why would investors invest in the project, etc... In addition, the project reminds me of Kiva, a cardano-powered lending platform that is already well established and has been mentioned by Charles Hoskinsons himself on multiple occasions. There is no mention of how this platform is different or better than other lending platforms, and how it would attract users and investors.", "q0r": 2, "q1": "The team is small, but with the right people, it could be possible to achieve this in the proposed timeframe. However, the proposal is light on the details as far as planning go, with only some very high-level targets exposed. ", "q1r": 3, "q2": "The proposal doesn't lay out success metrics, and the milestones are very high-level. Risks and challenges aren't adressed, and the roadmap is vague.", "q2r": 2, "assessor": "z_assessor_318", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n\n "}, {"q0": "The problem is not so much tied to this challenge, but the solution and the success metrics in this proposal fit the challenge setting. \r\nHowever, there has no content in this proposal shows that it will bring any value to the Cardano ecosystem and so on the detailed plan. \r\n", "q0r": 3, "q1": "This proposal only overviews about benefits and features for users only.   \r\nIt lacks all the basic info for assessing the feasibility. Include: \r\n- Detailed implementation plan for knowing what will do. For developing this system, it should add more info about: coding, function, technology support below... \r\n- Detailed roadmap: this proposal doesn't have it. All info that relates to the timeline is their success metrics with a short brief without explanation. \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. ", "q1r": 2, "q2": "The proposal doesn't have a roadmap with detail and realistic timeline. So we can audit this project. \r\nThe key metrics are clear but there is no detail for clearing about them\r\nThe proposal has detailed explanation of the problem and how the solution can address it. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1, "reply": "I think reviewers   need to consider more carefully how you approach gradingf projects whose goal is to write a \nwhitepaper and/or buld a research pilot. These kinds of projects are extremely valuable as they can be \ndone on low budgets as proof of concepts  to prove the value of moving on to a larger project. \nWhat does a proposer who proposes writing a white paper have to do for auditability? \nHow to address risks since documenting a failed outcome might be as important as document a successfull outcome.\nWhat is a success metric for writing a whitepaper on a pilot? \nWhy is the milestone \"veru high risk\" pilots are supposed to fail sometimes and the lessons learned are very valuable.\nIf someone whats to research-  on a low budget  -someting like micro-lending how much should they say about the outcome \nif its research we arn't sure of the outcome. \n"}], "solution": "escrever um whitepaper com protótipo de trabalho que delineia uma maneira lucrativa de distribuir o risco de modernizar os métodos das fazendas de pequenos proprietários.", "experience": "https://www.cardanonocode.com/leadership.html"}