{"id": 383666, "author": "orfeusnetwork", "title": "Cardano-based Travel Network", "url": "https://cardano.ideascale.com/a/dtd/383666-48088", "category": 26233, "amount": 80000, "description": "As comissões tornam os serviços de viagem mais caros, e a falta de garantias de proteção contra vírus leva a uma queda drástica nas viagens mundiais.", "funded": 0, "upvotes": 18001621, "downvotes": 23987765, "votes_result": 5986144, "votes_cast": 310, "f6_no_assessments": 4, "f6_rating": 2.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Olá Ada Voters ! Esta proposta é parte do desafio de Impulsionar a Defi em Cardano! Acredito que a idéia e a plena implementação desta proposta irá sem dúvida impulsionar a Defi on Cardano pelas seguintes razões. A Defi está atualmente em sua infância, como eu gosto de dizer, e a ligação entre a Defi e as indústrias e bens do mundo real ainda está bastante subdesenvolvida. Vemos muitos projetos na Defi sem nenhum caso de uso no mundo real ou sem nenhum respaldo de ativos subjacentes no mundo real que têm limites de mercado às vezes em bilhões de dólares. A razão pela qual esta proposta é importante para a Defi em cardano é porque ela cria múltiplos casos de uso do Defi apoiados por um caso de uso do mundo real e contratos que poderiam ser vistos como ativos. Estes casos de uso estão em torno da indústria de viagens. Poder-se-ia argumentar que um princípio central do Defi também é o de oportunidades de mercado livre. Nesta proposta, vemos como a plataforma que a cbtn (rede de viagens baseada em cardano) pretende criar proporcionaria liquidez para comprar e vender contratos de viagem. Imagine se você comprasse uma viagem ao Havaí em março de 2022, ou seja, para dezembro de 2022. Isto poderia permitir que você vendesse sua viagem em novembro de 2022 com um prêmio se você pudesse comprar o contrato com um desconto antecipado antes do pico da temporada de reservas. Este exemplo usa o Havaí e não tenho certeza de que esta plataforma esteja voltada para viagens no Havaí, mas use-a apenas como um exemplo do potencial de defi arbitragem com estes contratos de viagem no centro deste exemplo.  Além disso, esta proposta é rica com o impacto que um mercado de viagens em cadeia poderia criar! O exemplo que dei é uma das muitas coisas que pude ver que esta proposta poderia fazer no Boosting Defi on Cardano, então em termos de impacto é um 5 de 5 para mim!", "q0r": 5, "q1": "Assim, ao investigar os dois membros da equipe Videlina Gandeva & Pavlina Deleva, descobri que a presença social no twitter não era muito grande e ambos começaram um twitter ao mesmo tempo em setembro de 2021 se eu tiver as alças corretas https://twitter.com/VGandeva & https://twitter.com/DelevaPavlina. Descobri que a Pavalina tem sua ligação em bio-preenchimento e que ela se conecta com tripxv. Sua biografia é \"Administrador das plataformas TripXv e ClubXchain da próxima geração\".\r\nМember da equipe de marketing da empresa Technologies and innovations corporation PLC\r\nEditor chefe adjunto da mídia online cluborfei.com\r\nMembro do Women E-Leadership Institute (WELI)\" Acho essa conexão importante para a pesquisa, pois tripxv é o centro de seu plano em termos da implementação da referida proposta. Pelo que posso dizer se isto é verdade, se ela está conectada como administradora a Tripxv, então esta proposta deveria ser recompensada com credibilidade e isso ajudaria a qualificar a proposta para ser mais viável. O outro lado da moeda é que eu gostaria que eles dessem um pouco mais de detalhes sobre sua equipe e sua relação com Tripxy na proposta que eles mesmos estão pedindo uma quantia pesada em comparação com todo o fundo deste desafio. Quase 20% de todo o fundo é solicitado. Também acho importante ver como eles planejam usar esses 80 k e na proposta eles deram poucos detalhes sobre onde/como esses 80 k seriam gastos. Gostaria de oferecer esta crítica construtiva como feedback para que a equipe possa mostrar como e onde os fundos serão gastos. Acho que isto abalou um pouco minha confiança quanto à viabilidade da proposta e é por isso que devo dar a esta parcela uma pontuação de três. Acho que a idéia e o \"pitch\" é grande, mas devido ao montante solicitado eu esperaria ver uma maior conexão com \"como isto será implementado aspectos da proposta\".", "q1r": 3, "q2": "Para esta parte da revisão, gostamos de analisar tanto a forma como os fundos serão gastos quanto os cronogramas/métricas-chave na proposta, como se refere a se a proposta pode ser auditada. A linha de tempo não é muito transparente, pois não temos uma data de conclusão da plataforma passo a passo. Isto não pode ser auditado, uma vez que as etapas do plano até a conclusão não estão claramente articuladas. As principais métricas, no entanto, nos oferecem coisas a curto prazo que podemos auditar como mencionado na proposta, como melhoria, desenvolvimento e marketing. Podemos ser capazes de medir essas coisas para que eu possa recompensar isso em minha pontuação. Também temos uma medida chave de \"100 000 locais turísticos e 1 milhão de turistas registrados na rede no primeiro ano\" que podemos auditar após um ano. Acho que se olharmos se podemos auditar a implementação dos fundos faltará transparência como mencionado anteriormente, então será difícil dar a pontuação da auditoria acima de 2 porque o montante solicitado é muito grande e poder auditar os fundos será uma imo super importante para o futuro de como o catalisador concede subsídios. Meu feedback para a equipe é para acrescentar mais transparência sobre a forma como esses fundos serão utilizados e os prazos de implementação, assim como as credenciais de suas equipes e o relacionamento com os parceiros declarados. Eu também recomendaria uma seção sobre quais outros recursos humanos você precisará adquirir que não tenha ou não tenha para implementar a proposta. Recursos humanos, como os que são de natureza e coisas desse tipo, pois isso realmente ajudaria a dar mais substância à sua proposta. Meu último feed back é talvez dar objetivos de curto prazo que possamos auditar como 1 mês em, 3 meses em, 6 meses em ect... Eu realmente desejo a esta equipe a melhor das sortes e estarei observando-os, pois acho que esta idéia é muito legal e ajudaria desafiadoramente a impulsionar a Defi em Cardano se implementada com sucesso.  ", "q2r": 2, "assessor": "z_assessor_766", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2, "reply": "Hello, thanks for the evaluation and recommendations. Attaching additional information about the team leader Videlina Gandeva – Wikipedia: https://bg.wikipedia.org/wiki/%D0%92%D0%B8%D0%B4%D0%B5%D0%BB%D0%B8%D0%BD%D0%B0_%D0%93%D0%B0%D0%BD%D0%B4%D0%B5%D0%B2%D0%B0 \nFacebook - https://www.facebook.com/tic.plovdiv . \nWe will be happy to take a look at our White Paper, on the basis of which we have described the Catalyst project - budget and roadmap https://orfeusnet.eu/wp-content/uploads/2021/12/000_WhitePaper_ORFEUS-Network_EN_07.12.2021.pdf "}, {"q0": "In the Covid-stricken world it's commendable that you still try to run a travel business. Perhaps there was something \"lost in translation\" but for me it was quite difficult to understand the model you are proposing.", "q0r": 2, "q1": "Usually a video is made to illustrate/explain/simplify/summarize a complex written proposal. This time, I'm sorry to say, it just created more confusion. The model you are proposing might be really good. It just needs some polishing and the language needs to be checked by a native English speaker. Also, if you're focusing on India as the source of clients, it would make sense to have a Catalyst member from India to join your team. I hope you re-submit the proposal in Fund8.", "q1r": 1, "q2": "\"100 000 tourist sites and 1 million tourists registered in the network in the first year\"... really?\r\n\r\nIt seems you already have these tripxv and clubxchain domains. How many tourists are now coming through those? How would the numbers suddenly jump up if you enabled ADA payments? This is not very convincing.", "q2r": 1, "assessor": "z_assessor_289", "no_vca": 26, "ne": 0, "ng": 16, "nfo": 10, "vca_o": 1, "reply": "Thanks for the evaluation and recommendations. In fact, we offer combining the idea of Booking and Facebook by creating a Cardano Network of two travel platforms, one financial and one app. The difference from all reservation systems so far is the built-in community and the ability to prevent irregularities related to hygiene in the sites through the presence of files. Regarding Indian partners, our team has been working with the Indian community in Bulgaria for many years. We are members and founders of the Bulgarian-Indian Technology Forum \"Mahatma Gandhi\" / www.bit-forum.org /. We will follow your recommendation and add a member of the Indian Catalyst to our team. We agree that the video was made quite quickly. For the needs of marketing we plan to attract professionals. Perhaps the White Paper Orfeus Network, which we are currently working on, will provide more clarity. We attach a link to it and we hope you look at it - https://orfeusnet.eu/wp-content/uploads/2021/12/000_WhitePaper_ORFEUS-Network_EN_07.12.2021.pdf .\nRegarding the figures of registered sites and tourists, digital nomads and student communities are our main target group for community formation. We will distribute the mobile application through our partners in India and China, mainly student communities and universities. In our opinion, they are the most powerful community tool for raising interest in our network and we will be able to start it the fastest. The funds for marketing and specialist in the field are our most crucial. We also intend to implement AI in preparation for the Meta Reality and we believe that with the concept of community in TripXv we are approaching the transition of tourism to a new level - travel at any time, even while at home.\n"}, {"q0": "Interesting idea, yet it feels like a booking.com or a similar website on a blockchain. \r\n\r\nIf that is correct, it might be difficult to attract new people from these used procedures.\r\n\r\nNevertheless, it is in accordance with the challenge goal and if they manage to deliver that many users as they plan to, it will definitely impact the Cardano blockchain and defi space.\r\n\r\nThe only thing to be solved - 1% of their income is put to the community fund - \r\n\r\na. 1% might not be a good solution, someone who has 1 000 000 ada and someone with 1 000 ada - a huge difference. \r\n\r\nb. there is no description of what this fund will do.\r\n\r\nAlso, what is the relation of two websites tripXv and ClubXchain and the proposer? Is it already a running service, looking for additional funding? Cooperation companies? Or a possible example where you aim?\r\n\r\nRating given 3.", "q0r": 3, "q1": "There is not much information about the team except a brief description - this would require more detail and possibly be linked in profiles, some examples of previous projects (for dev)\r\n\r\nThe video attached does not feel on a professional level, thus it is decreasing the creditability of the proposers. \r\n\r\nvisited websites from video, seems to be working. \r\n\r\nRating given 4.", "q1r": 3, "q2": "The key metrics are provided with a roadmap.\r\n\r\nWhat I am missing and I consider crucial is a budget distribution. What it will be used for and in what allocation? \r\n\r\nRating given 3.", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1, "reply": "Hi, thanks for the recommendations. We offer combining Booking and Facebook by creating a Cardano network of 2 travel platforms, one financial and one application. The difference from all reservation systems so far is the built-in community and the ability to prevent irregularities related to hygiene in the sites through the presence of files. The video is not professional, we agree. We have a good idea, tourism is a comprehensive economy and would help the development of Cardano. We basically need financial assets for marketing and influencers. I am attaching additional information about the team leader Videlina Gandeva - https://bg.wikipedia.org/wiki/%D0%92%D0%B8%D0%B4%D0%B5%D0%BB%D0%B8%D0%BD%D0%B0_%D0%93%D0%B0%D0%BD%D0%B4%D0%B5%D0%B2%D0%B0 "}, {"q0": "Topically the idea has some interesting possibilities. I see the challenge as a broad based marketing issue which they may have some idea about overcoming. The key challenge here is what actually is the basis of the zero commission and how can it be obtained when you don't explicitly own the assets used to eliminate that cost. ", "q0r": 2, "q1": "the proposer seems to understand the challenge of what appears to be only a part of the problem of self booking functionality. It seems challenging to get the community to part with 1% of their monthly income to participate in the program. ", "q1r": 2, "q2": "The information provided is limited in its detail which makes it hard to assess the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_691", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "We will be happy to take a look at our White Paper, on the basis of which we have described the Catalyst project - budget and roadmap https://orfeusnet.eu/wp-content/uploads/2021/12/000_WhitePaper_ORFEUS-Network_EN_07.12.2021.pdf \n"}], "solution": "Cardano De-Fi Blockchain marketplace sem comissões e rede global de sites turísticos seguros com arquivos eletrônicos.", "experience": "Nossa equipe inclui especialistas na economia da plataforma, especialistas na indústria do turismo, desenvolvedores de software blockchain e comerciantes de crypto."}