{"id": 381663, "author": "mr.mietrich", "title": "Sandbox-MMO for language learning", "url": "https://cardano.ideascale.com/a/dtd/381663-48088", "category": 26241, "amount": 33600, "description": "游戏被认为是对时间/生命的浪费。大多数教育系统非常不合适，无法进入，具有歧视性或缺乏激励性。", "funded": 1, "upvotes": 84580841, "downvotes": 6399856, "votes_result": 78180985, "votes_cast": 278, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=17968", "https://www.youtube.com/watch?v=MGzPAFHAgyc"], "media": [], "f6_assessments": [{"q0": "这个想法与挑战赛的目标非常吻合，因为它打算为Cardano生态系统创造一个高影响力的游戏。在他们的介绍中，作者说了一些非常有趣的事情，比如游戏有几种语言版本，这样就可以接触到世界上一半的人口（据他们说）。他们牢记 \"游戏不可能是有用的 \"这一概念是如何过时的，并希望打破这一模式，这一点很好。我还发现，他们对MMO和沙盒的概念化非常积极，使那些不熟悉的人能够充分理解他们的建议。因此，很明显，他们的目标是创造一个互动的学习空间，每一种语言都代表一个世界，玩家可以选择自己的角色。关于游戏与区块链Cardano的关系，该团队解释说，硬币可以交换ADA，一些角色是NFT，玩家将形成不同的DAO，以及其他方式，信息将以去中心化的方式被铸造。因此，我相信如此，这个提议具有很高的价值，符合我们在挑战中所寻求的，因为它促进了一个非常有趣的世界创造，不仅是为了好玩，也是为了学习，它将使用生态系统系统的各种技术来工作。", "q0r": 5, "q1": "该团队似乎非常有能力，因为它已经有在F6中得到资助的项目（如果能提到哪些项目就更好了），它在同一基金中还有其他提案，它还附上了一个网站，我们可以看到更多关于他们工作的信息，还有每个成员的个人描述，其中包括他们是谁的简短摘要和他们的社交媒体链接。这样一来，就可以非常确定他们有成功执行提案的知识。他们为我们提供了一个非常详细的路线图，说明在不久的将来需要做什么，这个细节对于我们充分了解这个过程本身至关重要，因为这个项目很复杂。这是积极的，因为他们在几个月的时间里对项目进行了解释，而不仅仅是对将要开展的活动做了一个 \"大的说明\"，这使得具体性很高，理解也更加牢固。关于财务部门，尽管金额很高，但很公平。这个游戏肯定是一个需要参与的人工作几个小时的项目，正如提案描述中所详述的那样，他们将努力工作，并将获得1200美元的月薪，我认为这对这项工作是公平的。提案的这一部分并不那么详细，但我认为所讲的内容足以促进人们在这里也有一个很好的理解。", "q1r": 5, "q2": "团队为我们提供了一些关键绩效指标（在我看来，这也是闻所未闻的事情，到目前为止，我还没有看到其他提案确定长期的关键绩效指标），但它们是相对综合的。通过它们可以监测项目，但我想说的是，我想有一个更密切的监测。例如，我将引用法语；如果团队能在我们社区中缺乏这种语言的参与者和游戏本身之间架起一座桥梁，这样他们就能提出意见并进行测试，甚至在游戏向公众发布之前，这将是很有趣的。如果团队对信息做一个总体概述，并在一些市政厅展示这样的结果，那将是非常好的（我说的是同一个复数，因为正如我所说的，这是一个大型的复杂项目，所以我相信仅仅一个展示是不够的）。我希望这个团队能够更深入地研究可审计性，以便我们能够100%地理解他们已经提供给我们的信息。", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "This idea will make a big change to the way billions of people learning language and skills around the world because language and skills are important to everyone in the world that is unlike other game ideas is trying to get players to engage with their gameplay and style only. And with their vision of success and plan to work on Cardano network, I believe that when the team successfully launches it, there will be a lot of people joining and developing. Therefore, it can help to directly increase the gamer into Cardano communities as this challenge set. ", "q0r": 5, "q1": "After looking around on their team info I think they can solve their idea well, they're all talented and skillful in their field. My only considering thing when assessing the feasibility of this proposal is risks on their way. Everything in the proposal is perfect but I think that they should figure out the risk for preventing them. \r\nMoreover, their detailed explanation of work and technology is one of the silver bullets that I believe they will finish their job very well.  ", "q1r": 4, "q2": "They have a good roadmap and key metrics that can help Catalyst tracking when successful funding. And they have a very detailed explanation of how their awarded problems and ways they solve them. With those goals and visions, I think it's enough for auditing their work so far. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "It is incredibly good that there are projects that bring value through playing and learning to the Cardano ecosystem. The problems that the team points out are real and it is great that solutions are being offered. The game through which it is learned and which has been translated into several world languages definitely has an positive impact on the Cardano ecosystem. It is great that KPIs indicated in the proposal match the ones indicated in the challenge and that they are able to scale future challenges and everything is in place.", "q0r": 5, "q1": "This is a team with serious intentions and everything is transparent. There is an account with experience and skills that are necessary to deliver what is explained in the proposal. The website looks good and I could easily found all the necessary information and skills, knowledge that one team should have. The proposal clearly shows the budget needed for the project, but it would be better to have more information on how the team members will distribute the money. It can be seen that the money goes to the salaries of the people working on the project, but it remains unknown what will happen to the $ 4,800 money if they don't find another Plutus programmer. There is a detailed implementable plan and it is very well developed and the amount of money required is reasonable for this amount of work and the realization of the project itself. The team does not mention additional funding, so no additional plan has been developed. The team sets up real timetable to complete the work and the plan they gave describes the resources necessary to implement the proposal everyting is covered. The team in the proposal does not mention the possibility of potential risks so we have no solutions if certain risks arise.\r\n\r\n", "q1r": 4, "q2": "The team made a great roadmap with milestones with dates which gives us confidence that the project will be realized. KPIs are also interesting because they are divided in standard KPIs and long term KPIs which is great because the success of the project can be measured. Yes, yes, the progress and development of the project can be easily monitored by the community.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "There are a lot of people still has strong bias to gaming that waste time and useless, it's one of the big problem within challenge. \r\nAnd this proposal show that they can make a change by their own solution that will make big impact to Cardano ecosystem. \r\nAnd the idea that this proposal make can drive million of people to join. ", "q0r": 5, "q1": "Proposal show the clear roadmap and their budget is reasonable that help the team with minimum requirements to reach their goals. \r\nIt also shows the team with their job in this project very clearly, and they're great skillful people in their field that can make the project succeed. \r\nMoreover, the explaination about the system will develop and game model are very clear to help us assess their work. But I think it's better if they can detail more about their roadmap and tasks of every individual team members. ", "q1r": 4, "q2": "Proposal shows clearly the roadmap and KPIs that just enough for the auditability, but I think they should detail more the KPIs with the numbers. \r\nIt also have a very detail problem and solution of their idea to solve them, especially they describe into case study that can help everyone easy to understand with it. \r\nThat all clearly that can help CA and eveyone can audit the project and help assess it better. ", "q2r": 4, "assessor": "z_assessor_670", "no_vca": 17, "ne": 3, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "I think this project will drive a lot of people to their ecosystem because language and day life skills are always the important and vital things that billions of people need for their life, including work, study, travel... and their way of development the idea can effectively attract and keep users stay with the ecosystem. Indeed, it has a strong impact on Cardano communities when it succeeds too. \r\nI believe that their vision of success will make a big difference to currents centralized projects out there, they're all not designed like a game or even with gamification ideas, that's boring. ", "q0r": 5, "q1": "The roadmap for the development of this proposal is detailed enough to estimate their works, and I think they can do it well with their experiences and skills. But for more clarity about the budget, my advice for the proposer is that should outline the roadmap in more detail because the fund you're asking for is monthly not by group tasks. Moreover, the outsourcing budget also should point to the tasks that will be used.\r\nAfter reading some other proposals of this project I think the proposer should provide some risks and your solution for getting rid of them. This project is huge and complex to go without any risk. ", "q1r": 3, "q2": "I hope that I can see some number in their KPIs, and should add some more key metrics related to the challenge setting that their project can get, for ex: language learners, gamers, social engagement... \r\nIndeed, they have a very detailed content of problem with case study and explanation, then they show how their project to solve those problems very well. It can help Catalyst audit the project well with clear milestones and goals. Hope that this project will succeed to make a big change to this world. ", "q2r": 4, "assessor": "z_assessor_671", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "在安全、活跃、可探索和社区构建的3D环境中，玩到学到的MMO，分享学习经验和合作。", "experience": "用户体验/用户界面设计，全栈式开发，Plutus/Atala先锋，声音/生成艺术家，程序化建模，文化科学家，翻译，游戏开发"}