{"id": 381617, "author": "henno", "title": "Open Source for the environment", "url": "https://cardano.ideascale.com/a/dtd/381617-48088", "category": 26251, "amount": 4380, "description": "La naturaleza es una externalidad de nuestro sistema económico.\nCuanto más rápido podamos quitarle todo a la naturaleza, más rentables seremos.", "funded": 0, "upvotes": 19070348, "downvotes": 27883141, "votes_result": 8812793, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=13945"], "media": [], "f6_assessments": [{"q0": "El proyecto propone una nueva moneda que se correlaciona con la naturaleza a través de un componente de medición adicional que varía en función de la forma en que se produce un producto y de si ese proceso es destructivo para el medio ambiente o no.  El impacto depende de la adopción de este proyecto, por lo que el impacto es muy difícil de medir por sí mismo. Este proyecto seguramente ayudará al ecosistema de desarrolladores de Cardano con un ejemplo de una Dapp construida. La propuesta dice cómo va a aportar valor, pero no especifica el ecosistema de cardano. Este proyecto tendría un mejor encaje en el reto de DApps & Integraciones. Si la propuesta puede escalar con interés depende totalmente del autor, pero teniendo en cuenta la experiencia declarada, no veo ningún problema en dar la bienvenida a los desafíos y el crecimiento potencial.  ", "q0r": 4, "q1": "El impacto de este proyecto depende de su adopción. Sobre todo de que los proveedores de productos sean honestos al describir el proceso que utilizan. Este hecho es para mí un gran defecto del proyecto. Está claro que el proponente ha puesto mucho empeño en él, pero también creo que es un enfoque demasiado idealista para que funcione en la práctica, basándose en los vídeos colgados en el canal de youtube, en los que se afirma que la relación entre lo que hay que pagar por un producto dependería indirectamente de que un proveedor respondiera honestamente sobre el origen del agua utilizada para cultivar el producto, los furtilizantes utilizados (destructivos para el medio ambiente o no) y una serie de preguntas específicas para cada tipo de producto. Veo dos cuestiones prácticas principales que no se mencionan en ninguna parte: 1. ¿Cómo se garantiza que los proveedores responderán con sinceridad a preguntas que pueden ser perjudiciales para su negocio? 2. Quién decide las preguntas que se hacen para un producto concreto. Por estas dos razones principales, no creo que este producto sea viable. Si el proponente no tiene previsto reunir un equipo para futuras propuestas que se basen en ésta y la apoyen, va a ser muy difícil hacer realidad esta idea. El presupuesto está desglosado para identificar las partidas, pero realmente creo que sería necesaria más financiación para despejar los objetivos planteados. Hablo como un desarrollador que ha hecho un trabajo independiente similar a la propuesta. No se ofrece ningún calendario en la propuesta, por lo que diría que es un punto crítico de mejora de esta propuesta. Hay una amplia descripción del objetivo final en mente, lo cual es genial, pero no encontré en la propuesta los pasos concretos para llegar a él ni el calendario de todo el plan.  Los aspectos técnicos no estaban lo suficientemente detallados como para que los entendiera, aunque vi varios vídeos publicados en el canal de los proponentes. Un libro blanco de algún tipo habría sido una gran manera de educar a la gente de la aplicación real de la idea. La propuesta sólo dice que la tokenómica para este proyecto es compleja sin más explicaciones. Mi sugerencia sería pensar en los riesgos relevantes para una implementación exitosa como: ¿necesito un equipo? ¿tengo los pasos concretos, la hoja de ruta y el calendario para completar las tareas?", "q1r": 2, "q2": "El proponente no mencionó ningún KPI o una forma de seguir el progreso de la propuesta, por lo que mi sugerencia sería centrarse en ejemplos prácticos claros y KPIs específicos para que la comunidad de cardano pueda ayudar y entender toda la idea del proyecto.  Como se ha mencionado, no hay una hoja de ruta ni hitos de los que hablar. Me costó encontrar una descripción clara de la pregunta \"¿cómo voy a implementar el proyecto?\". La solución parece genial, pero no entendí el plan para la implementación real y los incentivos comerciales.", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is a novel and a Nobel attempt to create an open-source system that will enable value creation by following nature-preserving options in any walk of life. However, its direct impact on the open-source echo system is debatable. This proposal may have limited direct impact directly but may act as a catalyst to force the open-source community to delve more in this exciting area. ", "q0r": 5, "q1": "The proposer is developing a model to monetize nature preservation measures, this is a much-needed revolutionary concept and needs to be taken up. The proposer has been following the idea in a passionate manner and created a centralized website that is able to demonstrate the idea. This is a novel and complicated mechanism and needs substantial oracle support in a decentralized setting. The deliverables of the proposal are not explicit and may not create an immediately usable system. ", "q1r": 4, "q2": "The proposal has listed 7 features that he aims to develop in this fund these are clear software features and will be released in open-source. The project can be audited based on the quality and the number of deliverables successfully created. There is a need for creating more documentation on how the tokens can be made valuable and how they will be pegged to fiat. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Your statement, \"The quicker we can take everything from nature, the more profitable we will be.\". The above information would be easy to confuse the reader about your project's working progress intention if not read through your entire project. It should be clearer where and how the community will access your results output and the availability channel. ", "q0r": 4, "q1": "With 20 years plus in database development back and front and website design and implementor. I am not quite sure why your crucial performance and course breakdown only create a small website functionality, draw some pictures on objects and research, research, and a small questionnaire to be developed for $4380. I believe you would deliver better with your skill-set in database and web services. As the proposer stated, it is a proof of concept. I think in the next three months, with the key performance indicator, the proposer would be able to deliver the promised PKIs.", "q1r": 4, "q2": "The proposer should have highlighted clearly whether the community will benefit from your project available in Cardano ecosystem open-source packages or your project using available open-source resources for your project. Once the progress is evident and nailed down agenda, the committee has a more transparent view to audit your project progress. This also helps the current Fund 7 Challenge team easier to make a report for the next three months if your project is being funded.", "q2r": 3, "assessor": "z_assessor_726", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "En la vida. En la vida, todo está conectado.\n¿Conectar el entorno con las transacciones es difícil?\n¿Se puede hacer esto en Cardano?", "experience": "Ingeniero Industrial, 20+ años de desarrollo (Base de datos, servicios web, front end y back end)\nAños en comercio electrónico y negocios"}