{"id": 382591, "author": "nvhieu", "title": "Localize Yoroi for Vietnam market", "url": "https://cardano.ideascale.com/a/dtd/382591-48088", "category": 26251, "amount": 3000, "description": "Yoroi no ha sido localizado para el idioma vietnamita. lo que lleva a muchos errores y a un uso difícil para el vietnamita", "funded": 2, "upvotes": 85188219, "downvotes": 11151566, "votes_result": 74036653, "votes_cast": 358, "f6_no_assessments": 2, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This project does't seem to sit well in the developer ecosystem and will be better suited for the \"Multilingual resources\" challenge. Other than that, this project is a great idea to spread the crypto opportunities environment in the Vietnam market. Keeping in mind the price to impact, this project is a no brainer for me and needs to be voted in and implemented. The impact would affect only one market, but it's important to be inclusive in that respect. The proposal identifies a simple to solve problem and has all the necessary skilsl and team to work on it for 3 months. There is a clear added value for the cardano ecosystem, welcoming the viatnamese crypto nerds.  If the need arises the team can work on partial translations as the yoroi project grows.  The proposal add something missing to the ecosystem: the translations for a specific language. ", "q0r": 5, "q1": "The proposers of the project have the necessary experience and projects worked on and done so there's no doubt they will be able to deliver on the proposed solution. Futher than that, the have linked their profiles, which brings credability and reliability to the projects success. There's a great deffinition of success specifing the plan for the 2 months of work that need to be done and the 1 year support for getting the kinks out. The proposers have shown a clear the type and number or team members necessary to bring the project to it's fruition. There is an outlined budget, I'm only wandering if they aren't asking for too little. But other than that, the budget's great! There's a realistic timetable to finish the translations. A sensible plan is presented that is concrete enough for the purpose of translations. All the resources necessary to implement the proposal are listed.  The proposers have considered risks in this proposal like supporting the translation effort for about a year. ", "q1r": 5, "q2": "There wasn't any mention of how would a community member be able to track the progress of the translations, which is a bummer, but I wouldn't consider it a deal breaker. In this particular project, there's no big need for KPIs since it's a one time thing. There's not as big a need for KPIs in this specific project, but maybe it would be cool to know how many people use the Viatnamese translations on Yoroi. A prety straightforward roadmap concerning the translations that should be more than enough for this proposal.    Kudos for takingg up the very important task of bringing the Yoroi and the cardano ecosystem to people that don't understand english. I feel this makes cardano a very inclusive environment, and I'm happy to be a part of it. Good Luck! ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 19, "ne": 6, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This project is simple but necessary for increasing the adoption in Vietnam, it will provide a translated file Yoroi developers need to localize Yoroi into the Vietnamese language. Vietnam is a country that has more than 2.000 Cardano adoptors and it can develop further is removing some barriers, one of which is language. This means that this project will impact the Cardano ecosystem after this project finish. ", "q0r": 5, "q1": "This is a simple project so the info in the proposal is enough for knowing how this team does it. Their plan is detailed in the roadmap with outlines of work to do. Moreover, this team translated for many projects in Hewlett Packard and other's academies as they said. So I think we can believe in their ability. \r\nThe budget they required is reasonable and fits with the plan. ", "q1r": 5, "q2": "The proposer provides a detailed roadmap and includes success in each period. So, it can help to audit the development progress easily. \r\nThe proposer also helps us acknowledge the problem standing and point out how their solution can address it. \r\nThe last thing I want the proposer to consider is the risk and obstacles in the plan. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 22, "ne": 2, "ng": 13, "nfo": 7, "vca_o": 1}], "solution": "Traduce todo el texto en Yoroi al vietnamita y proporciona un archivo que los desarrolladores de Yoroi necesitan para localizar Yoroi al idioma vietnamita.", "experience": "Tien y yo somos SPOs y hemos estado trabajando en la localización y traducción de muchos proyectos en Hewlett Packard y otras academias"}