{"id": 385056, "author": "titan", "title": "Transaction Editor & wallet", "url": "https://cardano.ideascale.com/a/dtd/385056-48088", "category": 26251, "amount": 16400, "description": "El CLI de cardano es demasiado engorroso para utilizarlo en transacciones grandes y complejas", "funded": 2, "upvotes": 142629562, "downvotes": 9374330, "votes_result": 133255232, "votes_cast": 664, "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "¡Wow ... simplemente waw! El proponente quiere introducir un editor de transacciones que es más utilizable para reemplazar el cardano CLI (interfaz de línea de comandos). Como desarrollador yo mismo puedo relacionarme con el problema descrito en la propuesta y verificar que cumple con la configuración del desafío. Está claramente articulado cómo esto traerá valor y provocará alegría en los desarrolladores en el ecosistema de cardano, ¡yo incluido! Las métricas clave son relevantes y está claro que el proponente ha pensado mucho en la propuesta en sí y en la herramienta en sí. Seguramente habrá desafíos, pero no tengo ninguna duda de que, teniendo en cuenta la experiencia de los autores y la gestión del tiempo, los desafíos se resolverán sin problemas. No falta absolutamente nada en esta propuesta, lo cual es raro. Este proyecto añadirá algo que falta en el ecosistema: una forma fácil de trabajar con transacciones sin tener que sufrir. No hay ninguna preocupación por mi parte. Este proyecto tendrá un gran impacto en la comunidad si se financia y animo a la gente a que vote a favor, ¡como haré yo totalmente!", "q0r": 5, "q1": "Hay tantas credenciales y habilidades enumeradas que me llevó un tiempo leerlas y verificarlas todas. El tipo es un doctor en física teórica que desarrolla simulaciones para sistemas de electrones correlacionados (mike drop). Hay un plan de ejecución claro y sabe el trabajo que hay que hacer y el tiempo y proceso para hacerlo. El presupuesto es claro y está lo suficientemente desglosado como para que sea sensato alcanzar los objetivos fijados, que son muchos y ambiciosos. Hay un calendario realista para completar el trabajo, pero me pregunto si un equipo no sería más beneficioso, pero ciertamente puedo respetar al hombre que quiere construir una herramienta en el mannar adecuado y tener miembros del equipo no es siempre el camino a seguir (al menos al principio). Se ofrece una explicación detallada no sólo del \"qué\", sino también del \"cómo\", lo cual es poco frecuente y debe apreciarse. Los recursos necesarios para el desarrollo del proyecto están claros. Los aspectos técnicos, como el editor elegido y las funcionalidades ya presentes y previstas para el futuro, están descritos y tienen sentido como hitos. El proponente ha considerado los retos y riesgos relevantes para una implementación exitosa y, además, ha analizado el impacto de esas decisiones. El proyecto está en sintonía con lo que ya se ha hecho, y creo que esto será un elemento de construcción en el futuro. ¡Un trabajo absolutamente estelar de una propuesta! ¡Buena suerte! ¡Espero que os financien! ¡Votaré por ti!", "q1r": 5, "q2": "Hablando de trazabilidad, el autor ya tiene un calendario y un plan muy específico sobre cómo incluir a los probadores beta de la comunidad para que le ayuden en el ciclo de trabajo, así como planes para la documentación y para que la comunidad conozca las características que se están poniendo a disposición. No veo ningún problema en hacer saber a la gente lo que se hace y se desarrolla. Las métricas y los KPI también están a la par con el resto de la propuesta y eso rara vez ocurre en muchas otras propuestas. Hay una hoja de ruta con hitos y todos los detalles, así como un cronograma que considera los desafíos y tiene un amortiguador para ellos. El problema es claro y comprensible y las soluciones correspondientes están presentes y bien escritas, aunque a veces son un poco técnicas. La solución 100% es una solución para las luchas del ingeniero de software de todos los días.  ¡Buena suerte!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Currently the tools available for developing an app on Cardano (on low level) is still far from perfect. Using cardano-cli would still make developer struggle and have trouble, as what the proposer mentioned that there are a lot of people asking and looking for answers on Discord and Cardano forum. This proposal would build a tool to make it easier to use cardano-cli in a declarative way, means you declare what you want and the tool will handle the command for you. E.g for creating wallet, looking UTxOs addresses, balance, etc. By having this tool, it will greatly help the developer community building on Cardano, and further attract more developer to not get intimidated into getting started.", "q0r": 5, "q1": "Oscar (the proposer) have proven the experience in building these various tool, from the growing open-source Scientific Python Project until it became the open standard, to having a Ph.D. in Theoretical Physics developing simulations for correlated electrons systems. Looking at the Github repo, it has a comprehensive documentation, with already working feature such as: token mints, metadata, delegation certificates, unlocking of Plutus Smart contracts. Although, it would be better if Oscar could provide his Linkedin too for further verification. Reading through this proposal, Oscar could articulate clearly on what the problem, how he came up with the solution, and how to implement that solution with working example already provided. The 10-week action plan he provide is clearly described in details, and shows what to achieve on every week. Overall, this proposal have a high chance of success, considering the amount of experience he had. ", "q1r": 5, "q2": "The roadmap, the goals / achievements, and metrics/KPIs is very well defined in details (10-week plan). It is highly auditable considering this is an open project and we can track the progress through Github commit. The proposer have a clear understandable description of the targeted problem, and also able to articulate the solution in details, i.e using Emacs and specify why he choose it, why it would help developer community in Cardano, etc. ", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 21, "ne": 10, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The team pointed out the dead point of user experience and made a great way to fix it. This idea will save a lot of time and advance the risk when performing transactions in the node. In addition, the team also has detailed content to explain how it impacts and the target. \r\nMoreover, the KPIs are promising for people in Cardano communities. ", "q0r": 5, "q1": "The team has experienced how to perform their plan well, moreover, they did it since fund 6 and there is a video to visualize how this idea happen. The team also provides full of content to explain what they gonna do from point of view of users, and also with the technical explanation. Everything is clear and easy to understand. Moreover, there are many attached links in the proposal that can show how great this team did for the Cardano ecosystem. ", "q1r": 5, "q2": "They have a detailed roadmap in weeks and good KPIs for easily auditing their progress. \r\nThey also have a good explanation about the problem, and that's why their solution can address the problem very well.", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 2, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "A high level, declarative, transaction editor that fully integrates with your wallet, cardano-node and your text editor will be a helpful tool since it solve the problem of the cardano CLI. ", "q0r": 5, "q1": "He's a skillful developer with relevant experience and he explain very well what he plan to do. All information is very transparent: the time he will spend on the project, a detail timeline and KPI etc. Moreover he also demonstrates what the expect outcome will be with examples. ", "q1r": 5, "q2": "The metrics to audit the progress is well-thought. We can easily track the progress of the project because he's very transparent and the timeline is in detail plan.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Un editor de transacciones de alto nivel, declarativo, que se integra completamente con su cartera, su nodo cardano y su editor de texto.", "experience": "Prototipo de trabajo para las transacciones, con mentas de fichas y desbloqueo de scripts de Plutus. Ganador del premio en el desafío Plutus Pioneer Capstone."}