{"id": 381617, "author": "henno", "title": "Open Source for the environment", "url": "https://cardano.ideascale.com/a/dtd/381617-48088", "category": 26251, "amount": 4380, "description": "自然は、私たちの経済システムの外部性です。\n自然からすべてを早く奪えば奪うほど、利益が上がる。", "funded": 0, "upvotes": 19070348, "downvotes": 27883141, "votes_result": 8812793, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=13945"], "media": [], "f6_assessments": [{"q0": "このプロジェクトでは、製品の生産方法や、そのプロセスが環境を破壊しているかどうかに応じて変化する追加の測定要素を介して、自然と相関性のある新しい通貨を提案しています。  その影響は、このプロジェクトの採用に依存するため、それ自体で影響を測定することは非常に困難です。このプロジェクトは、構築されたDappの例として、カルダノ開発者のエコシステムを確実に助けます。提案書には、どのように価値をもたらすかが書かれていますが、cardanoのエコシステムについては明記されていません。このプロジェクトは、DApps & Integrationsチャレンジにもっと適していると思います。この提案が興味を持って拡大できるかどうかは作者次第ですが、述べられている経験を念頭に置くと、挑戦と潜在的な成長を歓迎することに問題はないと思います。  ", "q0r": 4, "q1": "このプロジェクトのインパクトは、このプロジェクトが採用されるかどうかにかかっています。何よりも、製品提供者が自分たちの使っているプロセスを正直に説明することが重要です。この事実は、私にとってこのプロジェクトの大きな欠点です。提案者が多くのことを考えているのは明らかですが、youtubeチャンネルに投稿されたビデオによると、製品に支払うべき金額の関係は、製品を育てるために使用した水の起源、使用した枯れ葉剤（環境を破壊するかどうか）、製品の種類ごとの一連の具体的な質問について、提供者が正直に答えるかどうかに間接的に依存していると述べています。私は、どこにも書かれていない2つの主要な現実的問題を見ています。1. プロバイダーがビジネスに悪影響を及ぼす可能性のある質問に正直に答えることをどのように保証するのか。2.2.特定の製品についての質問を誰が決めるのか。以上の2つの理由から、私はこの商品が実現可能だとは思いません。提案者が今後の提案のためにチームを結成し、この提案をサポートするつもりがないのであれば、このアイデアを実現するのは本当に難しいでしょう。予算は項目ごとに分かれていますが、目標をクリアするためには、もっと資金が必要だと感じます。私は、この提案と同じような仕事を独自に行ってきた開発者としての意見です。提案書にはタイムテーブルが記載されていないので、この提案書の改善点はそこだと思います。最終的な目標についての膨大な記述があり、それは素晴らしいことですが、そこに至るまでの具体的なステップと計画全体のタイムテーブルが提案書には見当たりませんでした。  技術的な面では、提案者のチャンネルで公開されているいくつかのビデオを見ましたが、私が理解できるほど詳細ではありませんでした。ホワイトペーパーのようなものがあれば、このアイデアの実際の実装について人々を教育するのに最適だったでしょう。提案書には、このプロジェクトのトケノミクスが複雑であることが書かれているだけで、それ以上の説明はありません。私が提案したいのは、実装を成功させるためのリスクを考えることです。例えば、チームが必要か、タスクを完了するための具体的なステップ、ロードマップ、タイムテーブルを持っているか、などです。", "q1r": 2, "q2": "提案者は、KPIや提案の進捗状況を確認する方法について言及していませんでしたので、私の提案は、明確な実用例とターゲットを絞ったKPIに焦点を当て、カルダノコミュニティがプロジェクトの全体像を支援し、理解できるようにすることです。  前述の通り、ロードマップやマイルストーンはありません。プロジェクトをどのように実施するのか」という問いに対する明確な説明を見つけるのに苦労しました。ソリューションは素晴らしいと思いますが、実際の実装やビジネスインセンティブの計画がわかりませんでした。", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is a novel and a Nobel attempt to create an open-source system that will enable value creation by following nature-preserving options in any walk of life. However, its direct impact on the open-source echo system is debatable. This proposal may have limited direct impact directly but may act as a catalyst to force the open-source community to delve more in this exciting area. ", "q0r": 5, "q1": "The proposer is developing a model to monetize nature preservation measures, this is a much-needed revolutionary concept and needs to be taken up. The proposer has been following the idea in a passionate manner and created a centralized website that is able to demonstrate the idea. This is a novel and complicated mechanism and needs substantial oracle support in a decentralized setting. The deliverables of the proposal are not explicit and may not create an immediately usable system. ", "q1r": 4, "q2": "The proposal has listed 7 features that he aims to develop in this fund these are clear software features and will be released in open-source. The project can be audited based on the quality and the number of deliverables successfully created. There is a need for creating more documentation on how the tokens can be made valuable and how they will be pegged to fiat. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Your statement, \"The quicker we can take everything from nature, the more profitable we will be.\". The above information would be easy to confuse the reader about your project's working progress intention if not read through your entire project. It should be clearer where and how the community will access your results output and the availability channel. ", "q0r": 4, "q1": "With 20 years plus in database development back and front and website design and implementor. I am not quite sure why your crucial performance and course breakdown only create a small website functionality, draw some pictures on objects and research, research, and a small questionnaire to be developed for $4380. I believe you would deliver better with your skill-set in database and web services. As the proposer stated, it is a proof of concept. I think in the next three months, with the key performance indicator, the proposer would be able to deliver the promised PKIs.", "q1r": 4, "q2": "The proposer should have highlighted clearly whether the community will benefit from your project available in Cardano ecosystem open-source packages or your project using available open-source resources for your project. Once the progress is evident and nailed down agenda, the committee has a more transparent view to audit your project progress. This also helps the current Fund 7 Challenge team easier to make a report for the next three months if your project is being funded.", "q2r": 3, "assessor": "z_assessor_726", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "人生においてこの人生、すべてがつながっている。\n環境を取引につなげるのは難しい？\nこれは、カルダノでもできますか？", "experience": "工業エンジニア、20年以上の開発経験（データベース、ウェブ・ウェブサービス、フロントエンド、バックエンド）\n電子商取引とビジネスに数年間従事"}