{"id": 382199, "author": "highlander", "title": "Smart Contract Library - Phase 1", "url": "https://cardano.ideascale.com/a/dtd/382199-48088", "category": 26251, "amount": 45000, "description": "Cardanoには、開発者がラピッドプロトタイピングに利用できるスマートコントラクトのオープンソースライブラリがありません。", "funded": 1, "upvotes": 47711176, "downvotes": 17707950, "votes_result": 30003226, "votes_cast": 200, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "このプロジェクトは、スマートコントラクトのテンプレートを作成し、オープンソース化することで、カルダノの開発全体をスピードアップしたいと考えています。これは、開発者がcardanoのエコシステムをテストしたり、物事がどのように機能するのかを知るための後押しとなるため、実現すればさらに大きなインパクトを持つ素晴らしい貢献となるでしょう。提案では、課題設定に適した問題を特定しています。これがどのようにカルダノエコシステムに影響を与えるのか、明確なアイデアがあります。課題設定の概要に沿った重要な指標がありません。このような指標を追加することが、今後の提案に対する私のアドバイスです。この提案の著者は、etheriumでのスマートコントラクトの作成に真剣かつ関連性のある経験を持っていることを念頭に置いており、彼らが将来的にどのような課題をも受け入れることができると確信しています。  この提案が実装されれば、再利用可能なスマートコントラクトのテンプレートという点で、エコシステムに多くのものを追加することができます。これは、cardanoのような成長中のコミュニティに必要なものです。   ", "q0r": 5, "q1": "計画では、スマートコントラクトの経験があるオープンプルスのパイオニア開発者を雇うことになっていますが、まだ実現していないため、資格証明書を提供したりリンクしたりすることができません。これは、検証可能な作業を行うことができる具体的な人物がいれば、この提案の信頼性を高めることができるため、ハードルが高いです。予算は非常に簡単で、基本的には仕事をするために1人の男性に給料を支払うことになっています。タイムテーブルは、ベータ版のリリースを除いてマイルストーンがないため、より良いものになるでしょう。このプロジェクトの実現可能性は、チームが仕事をしてくれる開発者を見つけられるかどうかにかかっています。良い点は、提案を実現するために何人のチームメンバーが必要であるかを明確に理解し、計画していることです。予算も明確で、理解しやすく、ゴールに到達するために必要なステップを説明するために断片的に分解されています。途中でより技術的なタスクやマイルストーンが必要になるかもしれません。現実的なタイムテーブルがあり、提案者がそれに従えば、計画通りに作業を実施することに問題はないはずです。実装に必要な項目は記載されていますが、今後の作業の順序を明確に説明したロードマップはなく、このプロジ ェクトの支持者にとっては実装の助けになるかもしれません。  私が開発者として期待していたのは、使用される技術のアーキテクチャやプランのようなものを見ることでした。これがあれば、この仕事をする人を見つけるのがどれだけ簡単かを知るのに役立ちました。具体的な内容がなければ、提案書に書かれていることに基づいて成功するかどうかを適切に見積もることができません。提案者はetheriumでのスマートコントラクトの開発に精通しているので、カルダノではエコシステムやパラダイムが異なっていても有益だと思います。  このプロジェクトと、Developer Ecosystem challengeで見た他のプロジェクトとの間に、コラボレーションの余地があるかもしれません。", "q1r": 4, "q2": "チームはすべてのコードをリポジトリ上でオープンソース化することを計画しているので、興味のある人がプロジェクトの進捗状況を確認するのに問題はないと思います。KPIが提供されていないので、コミュニティメンバーが提案の成功を測るのに役立ちます。私は、より具体的なKPIを追加し、提案をいくつかの異なるタスクに分割して、いくつかの資金で実施することを提案します。  ロードマップは今後のファンド提案のための重要な提案であり、良いプロジェクトには欠かせないものです。  技術的な面でもう少し説明があってもよかったと思いますが、全体的にはこのプロジェクトを信じています。   ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is a brilliant and game changing idea to have a smart contract library available to help speedup the developments proocess on the cardano ecosystem. This is game changing it will help speed up the process of application development on the cardano blockchain since developers can easily use already build open source templates which will ease their burden of having to start writing smart contracts from the scratch.", "q0r": 5, "q1": "The team have the required expertise to execute the project. The budget sits well though not so detailed but it is reasonable to guarantee a successful project execution.", "q1r": 4, "q2": "The proposer has outlined a timeline for project execution but has failed to include key metrics/KPI's, which is key to be able to help audit the progress and success of the project when funded. ", "q2r": 3, "assessor": "z_assessor_799", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly and concretely answers the most important guiding question of this challenge, “How can we ensure future developers benefit from the work that is funded today?”. Its plan is simple to describe and understand, but its impact could be substantial, not only for existing Cardano smart contract developers, but also it could prove a great resource for attracting new developers to the platform by making their transition much easier with a prebuilt library of smart contract templates, which is the aim of this project. Overall the proposal could have a big impact on the ecosystem if properly executed as it could make the experience of smart contract developers on Cardano much smoother.", "q0r": 5, "q1": "The team clearly has experience with building blockchain related applications, as is evident from their website, which hosts multiple NFT related mini-games. But, from the looks of it their current smart contacts run on the Binance Smart Chain & Ethereum and it’s unclear if they have Cardano specific experience, as that’s not mentioned in the proposal. However this may not have a great impact on the feasibility of the proposal as their plan is to hire an external developer part-time to write the Cardano specific smart contract templates, in fact this is where most of their requested budget is allocated towards (40 out of 45K).\nTheir goals are realistic, the proposal is written in a very down to earth manner and the requested budget seems feasible. The very reasonable amount of $30/h is given, and a full year of part-time development is factored in.", "q1r": 5, "q2": "The audibility section of the proposal is the only one that leaves a few things to be desired, like a clear description of the KPIs and of the exact intended launch dates. However these can be easily deduced from the proposal, as they are mentioned. Thus the progress of the proposal according to the given timeline, as well as the completion of the smart contract templates could be easily monitored and verified by the community auditors. However if a future submission of the proposal will be required I would recommend including these elements.\nI would like to mention that in the case of this proposal specifically the community would need to audit the quality of the technical output as well as the overall completion of the project. We certainly want to be vigilant about wasting community treasury funds, but perhaps in this case it would be even more important to assess the quality of the smart contract templates generated by the project. It would be far worse to release a set of flawed smart contracts in the community carrying the stamp of approval of project Catalyst.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is clear and concise which aims to build and publish a series of smart contracts templates, similar to Ethereum's Open Zeppelin which Cardano developers can use. Laudable idea and it addresses the challenge effectively.", "q0r": 4, "q1": "The team is behind the Highlander platform and they have written smart contracts on Ethereum already, and are capable of implementing the project. The plan depicts that they aim to build an introductory series of smart contract templates for token issuance, NFTs, and governance protocols. They will then release the contracts to the public and refine thm based on user feedback. The team can successfully implement the project based on the valid facts in the proposal.", "q1r": 4, "q2": "The budget is well broken down and timeline clearly showing 3, 6 and 12 months. The amount requested is also reasonable for the project.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1}], "solution": "イーサリアムのOpenZeppelinに似た一連のスマートコントラクトテンプレートを構築・公開し、カルダノの開発者が利用できるようにする。", "experience": "私たちは、Highlanderプラットフォームを支えるチームです。Chrisはリードデベロッパーで、Ethereum上でスマートコントラクトを書いた豊富な経験があります。"}