{"id": 385098, "author": "rcmorano", "title": "NFT-authorized NFT-minter contract", "url": "https://cardano.ideascale.com/a/dtd/385098-48088", "category": 26251, "amount": 7000, "description": "現在のところ、スマートコントラクトから、分散化された、認可された、オンデマンドのトークン鋳造を実行する方法はありません。", "funded": 1, "upvotes": 34256077, "downvotes": 19428368, "votes_result": 14827709, "votes_cast": 138, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "\r\n提案書には、Dandelion（GimbaLabsが主導するコミュニティ支援プロジェクト）の開発中に問題が発生したことが書かれています。\r\n\r\nこの問題は、私の考えでは、カルダノをベースにしている多くのプロジェクトが何度も直面する問題であり、一般的に、上級開発者としては、汎用的で再利用可能なソリューションを見つけることが長期的には重要です。\r\n\r\nオープンソースシステムとは、基本的に、誰かがすでに問題に遭遇し、その解決策を提供している場合、車輪の再発明ではなく、その解決策を統合すればよいのです。\r\n\r\n提供されたソリューションは明らかに分散化されており、N人のガバナー（特定のNFTを保有する人）がトークンを鋳造することを可能にするスマートコントラクトを持つことで、問題文の範囲を満たしています。\r\n\r\n素晴らしいアイデアであり、提案の課題設定に完全に合致しています。", "q0r": 5, "q1": "提案者は元Emurgoのメンバーであり、Gimbalabsの共同設立者でもあります。そのため、スマートコントラクトやCardanoエコシステムの技術に関する経験の観点から、何の問題もないと考えています。\r\n\r\nまた、提案者は基本的にPBLチームのメンバーを雇って開発することを提案していますが、提案者自身がGimbalabsの創業者であり、PBLチームのメンバーが既に行った同様の作業のリンクを示していることから、経験の観点からも十分な自信を持っています。\r\n\r\nここで提示されているプランはかなりストレートなもので、これ以上分割する理由はないと思います。予算も2ヶ月分で妥当だと思います。\r\n\r\nとはいえ、これに伴うリスク（例：開発者が見つからない、できないなど）も含めて、どのようにすれば成功するのかを考えておくといいのではないでしょうか？\r\n\r\n例としては、GimbaLabsの既存のプロジェクトで使用されるのではないでしょうか？提案者は多くの経験を持っているので、それらの詳細を加えることができたはずです。", "q1r": 4, "q2": "この提案の進捗状況を監査するには、実装情報そのものが十分である。\r\n\r\nしかし、この提案の実装が成功しているかどうかは、このスマートコントラクトが展開され、いくつかのdappsで使用されたときに初めて判明すると思います。\r\n\r\n 一般的に、提案者の経験があれば、そのような例をコミュニティに提供することは難しくないと思います。そうしないと、実際には誰も使っていない素晴らしい技術的解決策になってしまうかもしれません。）\r\n\r\n提案者には、実装のための幸運が訪れますように :)", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The team is already providing and maintaining open libraries as well as hosted services. This new library does not only further the existing dandelion initiative, it also create what would no doubt become an essential staple for this key functionality crucial a host of decentralized structures including but not limited to DAOs.", "q0r": 5, "q1": "While the dandelion no doubt have the chops to accomplish this, the proposal did not make clear their intention to maintain the library across any time horizon. In my opinion \"success\" of an open source library hinges it's documentation, maintainer(s) and fine folks committed to providing support and addressing bugs. It's clear that they will build thing but with the lack of maintenance and support plan, I can only give 4 stars here. Even something the tune of we hope the community will adopt and help maintain the library going forward  with commitment to setup contribution guidelines would have suffice!", "q1r": 4, "q2": "The KPI and Roadmap is sweet, short, to the point, and sufficient to verify their 1 and 2 months stated deliverable. ", "q2r": 5, "assessor": "z_assessor_336", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The idea is to write a template for a smart-contract that will mint tokens only if an NFT (representin authentication) is included in the smart contract. That would make it decentralized, secure and on-demand. I am no expert in the area so I don't know if this problem needs to be solved or not so I defer to the expertise of the proposer. There could have been a more clear articulation of why is this important and how will it benefit the cardano ecosystem. I feel like the author should have explained in more detail the idea behind doing this so he can get people behind the idea before starting explanation on the technical part. The key metrics are relevant for the challenge. Nothing was mentioned about scaling and considering the words decentralization and minting were mentioned, I think it would be a good idea to include a \"how will we scale?\" section in the proposal.  This proposal would add to the ecosystem, but I'm no sure how valuable would that something be, because no impact was mentioned or how will this affect the cardano community. As a developer myself my concern is that voters would struggle to see the point in this proposal as I am. ", "q0r": 3, "q1": "The proposal has added a skill set that is verifiable and is clearly well experienced. A mention of one team member is mention, but I don't mention if they already talked to them and they agreed to work on the project or that's to be seen. The budget is prety clear: a salary for 2 months for a Plutus Engineer. The proposal could have put a bit more effort in a roadmap breakdown and tasks that can be followed by the community. The plan for implementation is sensible, it's just a bit vague on the specifics.  The technical aspects is one of the pros of the proposal, because they're well explained and connected together. No challenges and risks were mentioned so I hope the work is straightforward.", "q1r": 4, "q2": "There's a linked site where the plutus developers have put a short comprehensive description of their work relating to smart contracts that they've done, so tracability of the progress is there for any interested community members. There is a mention of KPIs although a bit rough and hard to progres check. There's a bids eye view of a roadmap about the 2 months of work planned out. The targeted problem and solution could be better explained and written and that would be my main suggestion for the author for the next proposal.  I'd also suggest for the author to put themselves in the voters shoes or ask someone unrelated to the project check out the proposal and gather feedback to help improval.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I like this proposal and what it aims to do, which will undoubtedly help to grow our open source ecosystem and enable many different teams to use an out of box solution for managing on-demand NFT minting on cardano. The could have a very wide range list of use cases and I think would be a great addition to the toolbox of cardano developers and teams alike.", "q0r": 5, "q1": "The proposer is a co-founder of the team behind the Gimbalands company which is a very reputable company within the cardano ecosystem and have many successful proposals funded in the past, this lends credibility to the idea that proposal would be successful. I would be personally shocked if the team did not deliver, I feel very confident that they will based on the proposal as presented.", "q1r": 5, "q2": "I feel the roadmap is very vauge and lacks specifics. A roadmap should include well defined milestones with specific KPIs for each milestone, otherwise it becomes a grey area when it comes time to audit the proposal we should be able to clearly see which KPIs was hit and which wasn't. I still feel the milestones at a high-level make sense, but we need a little more specifics in order for 5 stars.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "スマートコントラクトを開発し、特定のメタデータを入力として、ガバナンスNFTがTxに含まれている場合にのみ、オンデマンドでトークンを鋳造する。", "experience": "15年以上の経験を持つDevOpsの提唱者。元Emurgo社のDevOpsリーダー。Gimbalabsの共同設立者。Dandelionの設立者兼運営者。"}