{"id": 385023, "author": "mmahut", "title": "Open-sourcing Blockfrost API", "url": "https://cardano.ideascale.com/a/dtd/385023-48088", "category": 26251, "amount": 119000, "description": "Blockfrostは、何千人もの開発者に信頼されているCardanoエコシステムで最も使用されているAPI as a Serviceですが、オープンソースではありません。", "funded": 2, "upvotes": 160386994, "downvotes": 9793632, "votes_result": 150593362, "votes_cast": 602, "f6_no_assessments": 5, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "このプロジェクトの提案者は、Blockfrost APIバックエンド全体をオープンソース化したいと考えています。APIやバックエンドが何であるかを知らない人は、提案書に掲載されているyoutubeのビデオを見てください。このプロポーザルは、問題を特定し、それを解決することを約束しています。私は開発者として、オープンソースは進むべき道だと信じています。この提案は絶対に100％正しいチャレンジであり、オープンソースプロジェクトとしてエコシステムに多大な価値をもたらすでしょう。このプロジェクトは、ブロックチェーンのための開発方法のテンプレートになるでしょう。  このプロジェクトには特定のセクションがあり、そこではセキュリティの問題やプロセスの設定など、プロジェクトをオープンソース化する際に見つかる可能性のある課題を掘り下げています。私は多くの提案に対してこのように言うことはありませんが、この提案に欠けているものはありません。企画書のあり方の一例として、どこかに残しておくべきだと思います。これにより、エコシステムに欠けている部分が追加されます。それは、再利用可能なオープンソースコードで、十分にテストされ、信頼できるものです。開発者としては、この提案に何の懸念もありません。ただ、資金が得られることを願っています。この提案が資金提供されれば、多くのプロジェクトが大きな恩恵を受けるでしょうし、エコシステムへの影響も大きいと思います。", "q0r": 5, "q1": "提案者は、インタビューや名前を提供しており、ウェブサイトへのリンクもあるので、これが信頼できるかどうか心配する必要はありません......信頼できますblockfrost APIをオープンソース化することで、多くの新しい人々がプロジェクトに参加するようになり、blockfrostがこれからの仕事をこなし、適切な規模にするためのマンパワーを確保できるようになります。予算はとてもシンプルで明確です。どこに何をするのかが明確になっています。セキュリティ監査と、1年間働いてくれる人を2人雇うこと。約束された仕事をするための現実的なタイムテーブルがあります。約1年というのは賢明だと思います。  blockfrostユーザーによるFAQのような提案実施に必要なリソースが存在し、それを検討している。  プロジェクトは多くの可能性のある課題を検討しており、それこそがコードバサエ全体をオープンソース化するのに長い時間がかかる理由です。  ", "q1r": 5, "q2": "コミュニティメンバーがプロジェクトの進捗状況を確認したい場合は、様々な媒体を利用することができます。言及されているKPIは（他の多くの提案とは異なり）存在するだけでなく、関連性もあります。ロードマップとマイルストーンはもう少しうまく表現できたかもしれませんが、今回のケースではそれほど大きな問題ではありません。技術系の人もそうでない人もフォローできるわかりやすい説明で、これもこの課題では斬新な点です。また、解決策もわかりやすく、理解しやすいものになっています", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identify the problem that there is no open source API service. They will ad value to the Cardano ecosystem by making it more decentralized. The key metrics of this product is in line with the Challenge setting's in the sense of users/projects building on and using open source code. The project is able to scale well, because it will be open sourced.", "q0r": 5, "q1": "The team behind this project has already built successful projects and is well known in the community. The budget is broken down into 3 parts. It will pay for an audit, and a whole year's salaries for a software engineer and a community manager. The time to launch after funding is at most 7 months, which is reasonable as the audit can take up to 4 months. Since the product is already built, they didn't explain how and what is being built. The fund will go to maintain, audit and community manage this product. They haven't considered any risks, but since it's already a working product and it will be open sourced, it can be very resilient to future risks/challenges.", "q1r": 4, "q2": "The roadmap is basically to audit for up to 4 months then develop for up to 3 months and release. They provided 6 measurable KPIs which will make tracking the performance of this project very easy. They address the problem of centralizing an API service and solve it by making their own API service open source so that other projects can run it themselves. Making the network more decentralized.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 24, "ne": 4, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "The proposal intention is really good and they want to open source the blockfrost backend. The. main member/founder from the blockfrost has been to cardano 360 earlier, and explained in details (this link is also available in this proposal) how blockfrost is helping many developers focus on business logic and abstracted away the interaction with Cardano.\r\n\r\nAs a developer myself, the solution and its benefits are quite clear to me. Moreover, separate section on why should it be open sourced gives a good details to non technical community members as well. \r\n\r\nNevertheless, it would have been better to also provide the historical challenges/decisions on why this was not developed as open source from the very beginning ? With this details included in the proposal, (not only that your intent was to develop open source solution since beginning but also a link to that INTENT reference would have been great)\r\n", "q0r": 4, "q1": "From experience perspective this is quite clear to me, as proposers are the developers/owners of the blockfrost API and backend already.\r\n\r\nThey know best on what challenges are needed to move it to an open source project. \r\n\r\n I can understand that the $24k that are asked for the security audit are absolutely needed, so that before the code is open sourced it is high quality.\r\nWhat i am not clear OR what i think might have been done better is to give more details on what the senior backend engineer will do for a year to make this project open source ? \r\n\r\nWhat kind of major code refactorings/issues they are expecting that they need an engineer to work upon that for an entire year ? I am sorry but being a senior developer myself, i am just hesitant on the budget justification. I agree that it is written that these people will be primarily public, and at the end of the year a report will be shared. But if we are talking about agile way of working, then i feel more information/justification could have been provided by providing a detailed plan (3-6-12 and further split into biweekly to monthly). I think since the proposer owns the entire code base, they will have pretty good idea on what changes are required, and i dont see any reason why this was not presented here :) \r\n\r\nNevertheless, i agree because from proposal implementation perspective, i do not see any issues here :) GOod luck to the team\r\n\r\n", "q1r": 4, "q2": "To this point i can not agree neither can i disagree. Not because i do not think the proposer can not do it, but because I think the proposal should have been more elaborative.\r\n\r\nThe total budget asked for is more than 50% of the total fund. In my opinion would have made sense if they split this further down to man hours, and provide a good backlog (at least based on feature sets per milestones). Also that way they could ask for lets say 30k$ for 3 months first, and then propose again in next funds. \r\n\r\nMoreover, if this is going to be mostly repetitive bug fixing (identified in security audit) (maintenance job), how can we be sure that bugs are indeed found within this year ? Moreover, i see no detailed description given in the proposal for a relation between maintenance of the backend vs moving it to open source. As a senior developer myself, i think often the developers find it hard to convey the work progress if it is just maintenance. However, when you are asking for almost 55% of the total challenge fund, your plan should be crystal clear in terms of planning and work estimations.\r\n\r\nTherefore, i can neither agree or disagree, as i feel that this is hard on the other smaller proposals who are going to bring in also as equal value if not more to the cardano eco system and are much more clear in their project/implementation planning.", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Blockfrost is a well known and trusted API service provider on Cardano ecosystem. Currently, they have already open-source most of their tooling and the specification details, but not entirely. This proposal want to make Blockfrost API source code available and open to the community. By open-sourcing it, the developers could see the source code which then they could collectively help with feature request / ideas, fixing bugs, and collaborate together.", "q0r": 5, "q1": "Blockfrost already have 6,000 developers using their services, and 600 active projects are built on top of Blockfrost. The team already proven enough about their experience. The budget break down is also concise and clear (hiring new senior software engineer, budget allocation for security audit, etc). Timetable is realistic and well defined, with clear metrics and goals explained. And finally, Blockfrost project is also featured in last Cardano Summit 2021 event, and talk about how it being admired by the Cardano community. Overall, this proposal have a high chance of success.", "q1r": 5, "q2": "Metrics, KPIs, and goals are well defined. This proposal provides information on what are the key metrics and target for each respective months (3 months, 6 months, and 12 months). Since this is an open-source project, it can be tracked through Github activity such as: the number of commits from the internal team, and number of support tickets from the community (with a target of 300 resolved tickets by the end of the engagement).", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 18, "ne": 4, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal and its underlying project clearly addresses the challenge. The community has already validated the utility of this service, so converting it into a open source project will clearly have a very positive impact. Perhaps the only pragmatic question for the voters is whether to allocate over a half of this challenge's budget to one project. Therefore, individually this project deserves \"five stars\" IMHO and this is the reason for my rating, but considering the whole community, the final vote will be more complicated.", "q0r": 5, "q1": "Very strong and experienced team, both from the technology point of view and considering the community network. If the funds are allocated, in my opinion, it is highly likely that the proposal will be implemented successfully.\r\n\r\nThe plan itself is presented and perhaps not detail enough in proportion to the amount requested (much about hiring talent, who will then,together with Five Binaries company, figure out themselves what are the details), but it is presented in a convincing way.\r\n\r\nHowever, there seems to be a (last minute?) inconsistency between funds requested (120k in text, 119k in the form)", "q1r": 5, "q2": "Part of the funds will be allocated for additional external audit,  therefore there will by multiple participants that would have to fail all together to derail the project's success.\r\n\r\nThe performance indicators are very professional, sufficient and convincing for auditing the general progress of the project.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "私たちは、この素晴らしいコミュニティの助けを借りて、Blockfrostのバックエンドをオープンソース化したいと考えています。", "experience": "私たちはBlockfrostのクリエーターであり、開発者にとって参入障壁の低いサービスやツールを作っています。"}