{"id": 381354, "author": "swhitenstall", "title": "Catalyst Audit Circle", "url": "https://cardano.ideascale.com/a/dtd/381354-48088", "category": 26253, "amount": 12700, "description": "Catalyst не имеет руководящего круга, который сосредоточился бы на определении приоритетности проблем, связанных с аудитом финансируемых предложений.", "funded": 2, "upvotes": 67964646, "downvotes": 1382596, "votes_result": 66582050, "votes_cast": 276, "f6_no_assessments": 6, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "Отсутствие управления обычно является причиной отсутствующих, жирных или неправильно используемых процессов в организации или во время выполнения проекта. Данное предложение определяет проблему приоритетности проблем, связанных с процессом аудита, четким и последовательным образом. Специальный круг, сосредоточенный на процессе аудита, свяжет недостающие звенья между IOHK и финансируемыми предложениями и обеспечит большую наглядность и прозрачность для сообщества Catalyst. Задачи Круга аудита Catalyst ясны и хорошо описаны без недоразумений.\r\nЦели этого предложения полностью совпадают с целями задачи, поэтому я твердо уверен, что оно будет эффективно решать задачу. Я оцениваю его на 5 баллов.", "q0r": 5, "q1": "Члены команды, стоящие за этим предложением, обладают огромным опытом работы в экосистеме Cardano, управляя пулами ставок, выигрывая предложения в предыдущих фондах или участвуя в других кругах Catalyst. Успех команды с такими членами гарантирован.\r\nБюджет изложен четко и содержит подробный анализ разбивки. Запрашиваемое финансирование является разумным и не превышает 7% от общего объема финансирования вызова. В этом же разделе представлен подробный план выполнения, описывающий все необходимые действия для достижения конечной цели.\r\nОдной из недостающих частей предложения является определение возможных рисков. Например, каковы могут быть последствия для проекта Catalyst, если приоритеты зондирования проблемы будут расставлены неверно? Есть ли слабые места между IOG, надзорной группой и аудиторским кругом? И как такие моменты могут быть смягчены? Есть ли альтернативный способ сбора информации в случае, если обратная связь, полученная в ходе опросов, будет низкой?\r\nЯ согласен с тем, что данное предложение будет успешно реализовано, поэтому оцениваю его на 4 балла.", "q1r": 4, "q2": "Предложение включает в себя четко определенную дорожную карту с прозрачным набором мероприятий в течение 2-3 месяцев. Хотя раздел с конкретными KPI отсутствует, успех предложения все же можно измерить по указанным результатам. Кроме того, не очень понятно, как будет отслеживаться прогресс \"Круга\", поскольку эта информация разбросана по разным разделам.\r\nЯ согласен с тем, что предоставленной информации достаточно для аудита прогресса и успеха предложения, поэтому я оцениваю его на 4 балла.", "q2r": 4, "assessor": "z_assessor_614", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Прежде всего, следует понимать, что это не предложение относительно аудита заявок.  Скорее это предложение по созданию регулярно публикуемого свода работ, в котором будет проводиться аудит процесса аудита заявок.  Это работает в согласии с другим предложением этой группы по аудиту процесса управления (аудит финансируемых предложений является четвертой ножкой этой табуретки).  Благодаря регулярным встречам с общественностью, мониторингу среды и инструментов финансирования заявок, а также проведению 2 опросов, эта группа будет готовить отчет примерно раз в раунд финансирования.  Это позволит сообществу управления рассмотреть следующие вопросы: плохие участники системы (и протоколы для работы с ними, включая процесс апелляции), проблемы масштабируемости, с которыми сталкиваются аудиты и выплаты, надежность имеющихся инструментов, предотвращение дублирования усилий по разработке и использованию инструментов in situ и т.д.", "q0r": 5, "q1": "Эта команда составила четкую дорожную карту (которая сливается с дорожной картой их предложения по надзору) и краткий бюджет, который адекватно учитывает ресурсы, необходимые для проведения примерно 100 человеко-часов общественных встреч и 5 результатов, включая предложение Fund8 для продолжения работы после весны 2022 года.  Команда разработчиков заявки имеет хорошо отработанные навыки и инструменты для реализации проекта, о чем свидетельствуют их роли в Catalyst Circle и предыдущих профинансированных заявках, а также доступ к сообществу, необходимый для привлечения общественности, проведения опросов и ретроспектив, необходимых для сбора информации для итогового отчета.", "q1r": 5, "q2": "Они будут использовать инструменты, которые уже обеспечивают прозрачность и ясность для надзора сообщества за деятельностью Catalyst Circle. 5 результатов, распределенных между двумя опросами, ретроспективой, предложением по фонду и отчетом, обеспечивают легко отслеживаемую временную шкалу продуктивности и эффективности, с естественными точками проверки, которые соответствуют событиям, уже регулярно происходящим в сообществе, таким как ратуши. Сама команда регулярно отчитывается перед сообществом, являясь разработчиками предложений по финансированию, избранными представителями Catalyst Circle, создателями инструментов и наставниками.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "The proposal clearly mention how it will add value to solve the problem by providing reports on the development and implementation of the funded projects in Catalyst. Moreover, the team will also directly engage with the community to have survey and audit the funded proposal in Catalyst. This will bring better key metrics to measure the progress of funded proposal. And also could identify the bad actors within Project Catalyst.", "q0r": 5, "q1": "Team consists of experienced people in Catalyst. Budget is outlined clearly & broken down properly in the proposal. And the team also provide plan for the next phase including the request for additional fund. \r\n\r\nAdditionally, the proposal put realistic time frame to complete the work within 3 months. So, I think this proposal will be implemented properly if funded.", "q1r": 5, "q2": "The project progress could be tracked via GitHub repository and also GitBook link. And also the roadmap after getting funded is describe in the proposal. It will be great if the team could add milestones more clearly for each month. \r\n\r\nI really like that the team will engage directly with the community and do survey. That means the community could directly give feedback & track their project too.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 21, "ne": 4, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "Great Idea! Having a board of people focused on improving auditing is something that cardano community and project catalyst would utilize! With the increased number of proposals, it will be more difficult to have oversight, therefore a governed board can definitely make a difference. \r\n\r\nI believe that such an outcome can increase the overall audit of funded projects.  Rating given 5.\r\n", "q0r": 5, "q1": "the experience of the mentioned team is pretty solid, with no doubt they can deliver. It would be nice to see some linked-in links, just to increase the credibility, but sounds okay. \r\n\r\nThe plan is broken down in reasonable detail and in a reasonable time frame.\r\n\r\nThe budget seems slightly overextended. If I calculated correctly, each person will receive 80 dollars/hour. survey is for 1600 (this would require more detail, why survey cost this amount) Also, the amount for a report of 800 dollars = It would be nice to see these budget/outcomes in more detail, so a voter has a better idea about the outcomes. All of these can be very well thought, but it is not clear from the proposal how \"well\" and \"reasonable\" is a budget designed. \r\n\r\n Rating given 4.", "q1r": 4, "q2": "Key metrics and the plan are provided. Since it is a transparent project, it will be easy to audit the progress, and based on results we can verify if they deliver what is planned. \r\n\r\nBut what about self-funding in the future? any possibility? Also, a key metrics about the number of active members, or audited proposals? These would be interesting to measure too, to compare price/efficiency :) \r\n\r\nRating given 4. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 4, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about establishing a Catalyst auditing circle to guide improvements needed to maximise each funding rounds return on intention. This solution is clearly defined, addresses the challenge, shows the clear impact on contributing to the Catalyst Auditability in certain aspects. Therefore, based on the given information, I agree with this proposal's impact, I would rate it with a score of 4", "q0r": 4, "q1": "\r\nThe Catalyst Audit Circle includes active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. Besides, some members of this team got proposals funded in the prior fund [F5, F6]. This is proof of feasibility from the team profile. The roadmap and budget are clear and logical. Risk is not defined. After all, based on the given information, I agree with this proposal's feasibility, I would rate it with a score of 4", "q1r": 4, "q2": "This proposal provided a lot of meaningful information, with evidence for verification. However, there is a point that is unclear in the way information is provided, this is minor, I suppose, that is: The Catalyst Audit Circle is described as consisting of 8 members, however, only 7 members are listed ? After all, based on the given information, I still strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal seeks to better the Auditing process of funded proposals by creating the Catalyst Audit Circle. This is in line with the Challenge's problem statement, and will thus have a positive impact on the Catalyst ecosystem. The Catalyst Circle will be identifying problems and then find solutions by collaborating with the community. This way they hope to better the Auditability process of funded proposals. It is very important to track whether the funds allocated during each Fund round are used effectively to grow Cardano.", "q0r": 5, "q1": "The Team is set out with their experience and qualifications. They have been successfully funded in previous funding rounds. Not many links are provided as proof. There are eight team members, it would be good to see what each one's responsibilities would be as this seems a bit much. But if it was set-out might have made sense. The budget is broken down properly and makes sense. The proposer does mention that additional funding will be required and has an identifiable plan for this. They have a plan laid out and it seems implementable. Resources are mentioned and are also in the budget. Risks and possible solutions are not discussed.", "q1r": 4, "q2": "A road map with milestones are provided for in the proposal. These deliverables/outputs in their proposal can be used to measure success of the project. Aside from the report I am not certain if the community will be able to track the progress of the proposal. I assume it will be through online meetings where the community will be invited. Maybe next time make this clearer.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Создать круг аудита Catalyst для определения улучшений, необходимых для максимизации отдачи от намерений в каждом раунде финансирования.", "experience": "Аудиторский круг будет состоять из членов Аудиторского сообщества Catalyst. См. подробный план."}