{"id": 383628, "author": "raz", "title": "Impact Measurements Tool - research", "url": "https://cardano.ideascale.com/a/dtd/383628-48088", "category": 26253, "amount": 6000, "description": "Ключевой задачей для отслеживания прогресса и эффективности проекта являются четкие измерения воздействия, особенно для Целей устойчивого развития (ЦУР)", "funded": 2, "upvotes": 80655537, "downvotes": 3413220, "votes_result": 77242317, "votes_cast": 276, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Измерения и определения - ДЕВЯТЬ в чем-то - являются ключом к любому процессу постановки целей и аудита, и AIM предлагает привнести эту конкретность цели для авторов предложений, которые хотят количественно оценить и поделиться воздействием своих идей на ЦУР.  Данное предложение направлено на финансирование исследований, необходимых для усиления компонента KPI ранее успешно профинансированного Инструмента для разработчиков предложений, возможно, самого важного элемента этого инструмента.  Наряду с исследованием они предлагают достижимую дорожную карту обратной связи для настройки этих KPI на предложения Catalyst.  Кроме того, конечный результат этой первоначальной работы - белая книга и презентация - будет полезен не только для самого инструмента, но и для разработчиков и составителей предложений, так как позволит им лучше понять движущуюся цель, которой являются КПЭ.  Наконец, после экспериментов с текущей версией инструмента для разработчиков предложений я вижу, что он может стать хорошим инструментом мозгового штурма для разработчиков предложений с конкретными ЦУР или даже для потенциальных разработчиков, которым интересно, как привнести ЦУР в свои предложения.", "q0r": 5, "q1": "AIM является одним из наиболее известных разработчиков инструментов в экосистеме Catalyst (я использую их инструмент CA для создания этой оценки) и имеет репутацию надежного разработчика и поставщика.  У них отличный доступ к сообществам, особенно к компонентам, специфичным для ЦУР, поэтому интеграция их исследовательских функций в предложения и успешный сбор отзывов о них вполне в их силах.  В представленной дорожной карте не хватает детализации в течение первых 6 недель, но в ней подчеркивается оценка 5 систем KPI и механики отчетности по ним, что обеспечивает естественные точки аудита по мере их проверки.  Следующие 6 недель будут более детальными и будут разделены между анализом предложений с оцененными системами KPI и, наконец, подготовкой окончательного отчета. Бюджет кажется немного скудным и не покрывает доставку и презентацию доклада, но количество часов, отведенных на исследование и анализ, кажется чрезвычайно адекватным.", "q1r": 5, "q2": " Хотя в этой дорожной карте возможно больше деталей, в ней есть несколько точек аудита и 3 результата (руководство, анализ предложения, белый документ), которые будет легко отслеживать сообществу.  Команда AIM является постоянным участником сообщества с историей прозрачности и общения.  Поскольку 12 недель, отведенные на реализацию данного предложения, будут использованы в будущем раунде финансирования для разработки инструмента, это предложение будет подотчетно сообществу и его отзывам.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Impact:\r\n\r\nThis proposal is impressive on so many levels! Not only is it a shining example of a high quality proposal with a user-friendly, readable format, it has made my job as a CA easy to identify and assess Impact, Feasibility, Auditability. I have seen this tool used on several of the proposals I have assessed so far. Using it for myself, I have found it, like all AIM tools to be very user friendly, time saving & practical! This tool simplifies an overwhelming deep dive into the UN SDGs possibly never to resurface or be seen again.\r\n\r\n*Impact on Cardano: As articulated under the title \" SDGs and Catalyst/Cardano\" this proposal not only impacts off chain issues & solutions, the Cardano blockchain, and the Project Catalyst community, it takes impact to a whole new level by showing \"the actual impact of funded projects with clear KPIs\" & continues \"to position Cardano as the blockchain of sustainability, attract more collaborations with UN organizations and states as well as a growing number of companies and people concerned about impact and sustainability. It will show the community, and the world the impact of the funds provided.\" This proposal contributes in a real & meaningful way to fulfilling Cardano's mission of \"Making the World Work Better for ALL.\" \r\n\r\n*Impact on Challenge Metrics & Goals: The F7: Improve and Grow Auditability challenge asks the question: How to make the auditing process of funded proposals efficient, distributed, and transparent? One of the possible directions is \"Reporting on metrics, spending of financial resources.\" This proposal \"will be able to measure the real ROI (return on intention) as well as demonstrate the actual impact of Catalyst on people's lives and nature.\r\n\r\nThe goal of this challenge is \"Several projects evaluating funded proposals, providing reports, articles and metrics on the development and implementation of the projects.\r\n\r\nThis proposal adds another layer of auditability to this challenge. Well done to the team behind it for your forward thinking and making the path forward to tracking the impact of our contributions towards solving climate change. No government is on track to meet the 17 goals by 2030. They are too slow and inefficient to implement the necessary changes. You have provided a tool to help us get this done from the ground up, NOW. \r\n\r\n*Scale: From one fund to the next, I have seen firsthand how any tool initiated by AIM meets challenges head on. I have faith this team will be able to scale to address future challenges.\r\n\r\n*Impact on the UN Sustainability Development Goals (SDGs): Is clear and easy to measure since they used their own tool for their proposal to assist in mapping their impact to the 17 UN Sustainable Development Goals! The SDGs proposal tool https://cardanocataly.st/proposer-tool-sdg/ \r\n\r\nOne of the challenges for future fund CAs may be confirming the accuracy of the self-selected goals.\r\n\r\nThank you to this team for taking the time and making the effort to create a clear & understandable proposal. \r\n\r\n(7) I most absolutely & strongly agree that this proposal effectively addresses the challenge and goes two steps further by their efforts to impact climate change and make this impact measurable through Funded proposals in Project Catalyst and throughout Cardano as a whole.\r\n", "q0r": 5, "q1": "Feasibility \r\n\r\n* Team, including Skills & Experience: The two team members are experienced and well known through out the Catalyst Community. Yoram is a keystone member of Cardano4Climate. Without his continued support, guidance and bar raising, this thriving community would only be wishful thinking. In addition, for those who are familiar with the team members, the proposal provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal. \r\n\r\n* Budget Amount, Breakdown, Timeline & Plan for Additional Funding: The modest budget is reasonable to achieve the set goals within the timeline & a plan for additional redundant. This proposal is the continuation of steps already taken in the right direction to impacting the environment with the creation of tools to measure and audit impact on the UN SDGs. \r\n\r\n* Resources both Off-Chain (Applications) & On-Chain (Technical): Raz presented their research on how many Fund 6 proposals. Turns out this was 97%, with 26% being aware of impacting the goals & another 70%, not knowing their proposals would have an impact on the 17 UN SDGs See https://youtu.be/SAPUIlLFYio?t=1286\r\n\r\n (5) is my overall rating for feasibility: It is highly likely that this proposal will be implemented successfully. Not only have the proposers proven themselves in the past, they have the Cardano AIM, Project Catalyst, Sustainable ADA, WADA & Cardano4Climate communities behind them.\r\n", "q1r": 5, "q2": "Clarity/Auditability\r\n\r\nMy opinion of & support for this proposal is clear. \r\n\r\n* Roadmap: is simple, clear & will be easy to audit, with a clear goal \"to perform the research and evaluation and to prepare a spec for the development of the KPI tool and reporting mechanism and offer it as a proposal for Fund 8.\r\n\r\n* Metrics – KPIs: are simple, succinct & listed below the title, \" SDGs - KPIs & measurements framework\" \r\n\r\n* Problem Description: Why? \" If we can show the actual impact of funded projects with clear KPIs, it will continue to position Cardano as the blockchain of sustainability and attract more collaborations with UN organizations and states as well as a growing number of companies and people concerned about impact and sustainability. It will show the community, and the world the impact of the funds provided.\" The challenge? \" A key challenge to track project progress + effectiveness are clear impact measurements, especially for Sustainable Development Goals (SDGs)\" \r\n\r\n* Solution Description: What? \" Researching the basis of an Impact Measurements Tool to help define KPIs, measure and report them, with a focus on SDGs impact.\" How? \" The proposal seeks to research and design a framework that helps to integrate the KPIs already in the proposal process and measure them through the lifecycle of the project.\" \r\n\r\n(5) I strongly agree that this proposal provides me with sufficient information within their \"Working Plan\" to assess the progress in attaining its stated goals. \r\n\r\nAt the rate I write assessments, it is quite possible that I will run out of time before the 5pm UTC deadline to \"rate\" all the proposal I want/need to. I can let the pressure of this expectation go because, as a community advisor, a passionate supporter of the experiment called \"Project Catalyst\" and an active member of Cardano4Climate, I know beyond a shadow of a doubt that we are headed in the right direction(s). \"Climate Change is a failure of cooperation\"- Scott Poynton. Together, WE will not fail. \r\n\r\nIn the meantime, my hope is that you, the voter, will read this proposal for yourself, connect to the problem & support the solution to this challenge with your voice and voting power.\r\n", "q2r": 5, "assessor": "z_assessor_500", "no_vca": 17, "ne": 7, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "The proposal aligns with the challenge partly. We have 100% match if we assume that Sustainable Development Goals (SDGs) are relevant for proposed projects. We have a lower match then we take into account, that 1/2 are directly and 2/3 indirectly related to SDGs impact. What I like a lot that we all are able to see an SDG-fit of the proposals in the future. What I can imagine is high potential using AI in order to run this analysis automatically. In this case it could scale and after the audibility even attract other investors/team members.", "q0r": 4, "q1": "* The proposal includes an action plan with a realistic timeframe, measurable deliverables and presents a team that proves that it has the knowledge to execute the plan and provide value to Catalyst. What I like most are the increasing success metrics from 3 to 6 to 12 months. The budget breakdown is very short and could be more detailed, given the reasonable amount of money and the fair rate/hour I consider it as sufficient.", "q1r": 4, "q2": "We get an understandable description of the targeted problem and an idea for the solution. The solution could be more specified.. But taking into account hat it is the beginning and research dependent, it is ok. The Catalyst community is able to audit it in a comprehensible manner.", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 12, "ne": 2, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "This Proposal will be a valuable tool for proposers and community members that are thinking of proposing alike, is aligned with the challenge and will have a positive impact on the Catalyst ecosystem. The KPI's are also aligned with the challenge. Looking forward to see the next tool that will be able to define specific KPIs based on the project and sustainable development goals. The Last tool mentioned is the reporting tool to follow up on the KPIs progress. This could become a valuable tool to proposers. \r\n\r\n ", "q0r": 5, "q1": "The team has shown commitment to growing the Catalyst ecosystem through their other successful funded projects, I have confidence in them. The Budget is broken down and seems reasonable. The KPI's are set out and a timeline/road map with success measures is included in the proposal. All I am missing is the possible risks, and how they could be dealt with.", "q1r": 4, "q2": "In their success measurements they set out what they would like to achieve by 3, 6 and 12 months, so the project is auditable. They should have added how it would be possible for the community and voters to follow the progress of the project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "I want to say upfront that I have some significant expertise when it comes to the SDGs so I'm making a point to weigh in on this one. The SDGs are an important auditability metric of the already-existing UN system, and thus seeking avenues to integrate Cardano-based initiatives with the Global Goals already set by the international community isn't just effective but very important if we want Cardano to achieve widespread legitimacy as a productive and respectable financial system. Legitimacy really is the name of the game here: Eventually the Cardano community will be the world community, if we're successful, and so we need to operate in harmony with all the already-existing major evaluation mechanisms to grow and really have a social impact beyond the cryptocurrency subculture. So yes, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "This team has already set up a tool for the same purpose and I even used one of their other tools just now (the CA tool) to find this proposal. This is definitely an achievable goal, with their talents. I'm certain they'll be successful if they get voter support.", "q1r": 5, "q2": "The road map is fair, and the funding request is more than fair. I'd look forward to seeing their KPI development plan myself. If anything, their goals might (emphasis *might*!) be a little bit on the modest side. I see no reason the SDGs couldn't be fully integrated into Cardano fund proposals, especially with regards to challenges focused on the developing world, as a priority, since it's a pre-existing evaluation mechanism we could take full advantage of sooner rather than later. ", "q2r": 5, "assessor": "z_assessor_853", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "Исследование основы инструмента измерения воздействия, который поможет определить КПЭ, измерить их и представить отчетность, с акцентом на воздействие ЦУР.", "experience": "Cardano AIM active Catalyst members, Cardano4Climate, Sustainable ADA, Fund 6 funded SDG proposals"}