{"id": 381139, "author": "spiralway", "title": "Nourish LATAM: Spirulina & Cardano", "url": "https://cardano.ideascale.com/a/dtd/381139-48088", "category": 26242, "amount": 50000, "description": "La desnutrición en LATAM se encuentra en sus peores niveles, COVID-19 amenaza la disponibilidad de alimentos y el acceso económico a los mismos.", "funded": 0, "upvotes": 14841985, "downvotes": 22414535, "votes_result": 7572550, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Según el autor de esta propuesta, el COVID-19 ha agravado el acceso a los alimentos de calidad, lo que ha provocado altos niveles de malnutrición en la región, y sí, estoy de acuerdo con la hipótesis. Sin embargo, esperaría que para este tipo de propuestas se aportaran datos relacionados que respalden sus afirmaciones. Como solución a este problema, el equipo ya ha desarrollado un fotobiorreactor de bajo coste para producir espirulina, que se distribuirá en la región para promover la producción descentralizada. La propuesta también menciona planes de integración con Coti-Pay, la creación de una DApp y la integración con SingularityNet para la generación de modelos óptimos de cultivo de espirulina. En mi opinión, la propuesta es extremadamente ambiciosa, pero si se implementa con éxito tiene un alto potencial.\r\n", "q0r": 4, "q1": "Del enlace proporcionado, parece que la empresa está en funcionamiento, así que por ese lado felicito al equipo. Sin embargo, no se ha proporcionado ningún enlace para verificar los conocimientos y la experiencia del proponente y del equipo. En cuanto a la industria de la espirulina, no me preocupa el conocimiento y la experiencia del autor, sin embargo, cuando se trata de su experiencia en Haskell, Plutus, o SingularityNET, no hay evidencia de las habilidades del equipo, ni de otro miembro del equipo. el desglose del presupuesto muestra 3 secciones principales donde una de ellas está destinada al desarrollo de dapp, pero de nuevo no está claro cuántos desarrolladores están planeando contratar ni el tiempo que esperan que el desarrollo se produzca. Esto dificulta la evaluación de la viabilidad. Para futuros ciclos de catalizadores, recomiendo que el equipo presente un proyecto por fases de manera que permita a la comunidad evaluar la viabilidad con precisión.", "q1r": 2, "q2": "En cuanto a la auditabilidad, sólo se afirma que se espera que la tecnología esté lista para mediados de 2022. Desgraciadamente, no se menciona ninguna métrica de éxito específica sobre el impacto que buscan. Por ejemplo, ¿cuántos derechos de obtentor tienen previsto construir? ¿Aproximadamente cuántos derechos de obtentor esperan haber distribuido? En la sección de ideas, mencionan 3 desarrollos (que, desde mi punto de vista, pueden considerarse propuestas separadas). ¿Podría describir en qué fase de desarrollo se encontrarían en ese momento? ¿Cuál sería la estructura de información? Para garantizar que la comunidad pueda auditar la ejecución del proyecto, recomiendo que el equipo se haga estas y muchas más preguntas en los futuros ciclos de catalizadores.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 21, "ne": 11, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Malnutrition in Latam is at an alarming rate, the proposal refers to creating a quality food source to improve immunity for the people here. The given problem statement is defined and involves most aspects of the challenge. Growing spirulina in decentralized bioreactors could be the solution to boosting the immune systems of millions of people in Latam. The solution given is reasonable and solves the problem", "q0r": 4, "q1": "This is a really good proposal, however, to get funded I think I need to have a clearer plan of the roadmap, the indicators to measure success, as well as the people who make the proposal. this. It seems that it is necessary to seek more cooperation of experienced people to make this project more feasible\r\nThe proponents did not provide any information about their skills and experience. More background and proof of your experience is necessary for the community to believe. The proposal does not take risks into account.", "q1r": 2, "q2": "As stated, auditability is low because it does not show the roadmap with development plan, detailed explanation of each step, milestones and delivery of each part. Not having a KPI would make it more difficult for us to audit.\r\nThe budget is not reasonable and is not broken down into identifiable amounts. In order to receive funding, I recommend clarifying the allocation of funds, the more detailed the better", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "I fail to see how this proposal is alligned with the challenge. It seems like a good business plan based in Chile and scalable to other countries in Latam but I don't see how it helps to grow Cardano's community or adoption (other than the payment to PBR operators and opening payment for product in ADA)", "q0r": 1, "q1": "The proposal doesn't provide any details on the market they plan to sell to. It would be a good adittion to the plan to talk about the demand they expect and the price the customers would be willing to pay. Comparing this to their estimated cost of productions could give the reader a better understanding of the feasibility of the project.\r\nIt would be good to see clear KPI's are provided that can be used to assess success torwards growing Cardano in Latam.\r\nThe budget requested (50,000) seems elevated and no details are provided so justify the amount.", "q1r": 1, "q2": "The proposal could use a section adressing how the community could verify the promised use of the funds and how the implementation and success go.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "La espirulina cultivada en foto-biorreactores de forma descentralizada podría ser la solución para fortalecer el sistema inmunológico de millones de personas en LATAM.", "experience": "Emprendedor con años de experiencia en el cultivo de espirulina y tecnologías IoT, blockchain y fotobiorreactores."}