{"id": 381790, "author": "gilvania", "title": "Cardano for STEM Brazilian students", "url": "https://cardano.ideascale.com/a/dtd/381790-48088", "category": 26242, "amount": 7500, "description": "Hay una falta de cursos sobre la tecnología blockchain en las universidades brasileñas, dejando a nuestros estudiantes fuera de los avances tecnológicos.", "funded": 2, "upvotes": 74939763, "downvotes": 1729513, "votes_result": 73210250, "votes_cast": 151, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Propuesta muy necesaria para difundir blockchain/Cardano en Brasil (y América Latina). De hecho, hay una falta de cursos sobre este tema en portugués, para los estudiantes brasileños, y el Syllabus parece muy robusto.Esto está bien definido en la declaración del problema y la solución propuesta es razonable, encajando dentro del desafío.\r\nAlgunos puntos de preguntas/para considerar:\r\n1) Tengo entendido que este curso será totalmente online. Es estupendo porque tiene un mayor alcance. Sin embargo, si fuera presencial, se podría crear una comunidad/red brasileña más fuerte entre el profesor y los estudiantes. Yo consideraría la posibilidad de tener al menos algunas sesiones online. Por cierto, podría ser más claro si habrá más de 1 sesiones por año o si va a ser una sola.\r\n2) Me encanta que este curso sea gratuito para los estudiantes. Esto hace que la propuesta sea muy inclusiva. Sin embargo, no se indica ningún criterio de selección (si va a ser por calificación, ingresos totales de la familia, etc). De todos modos, yo dedicaría al menos unas cuantas plazas a estudiantes de bajos ingresos/pobres, especialmente en las regiones de las favelas. Esto estaría en consonancia con los ODS #04 y 10 de la ONU, que hoy en día son muy apreciados en los proyectos y organizaciones para ayudar a disminuir la desigualdad.\r\n3) También desarrollaría más en la propuesta el plan de comunicación. Si la intención es llevar el conocimiento de blockchain a quienes no lo conocen, es muy importante un plan de comunicación para llegar a personas fuera de este mundo. Yo incluiría en el plan campañas en las universidades, escuelas y ofrecer esto a las empresas. debe ser tanto en línea como \"offline\".", "q0r": 5, "q1": "una persona, ya comprometida, con experiencia docente y conocimientos en blockchain parece ser suficiente para dirigir este proyecto.\r\n\r\nEl plan es claro y se distribuye en los meses.\r\n\r\nHay un desglose del presupuesto a través de las fases/meses del proyecto, lo cual es bueno, pero serían buenos más detalles sobre cómo se va a utilizar el dinero. Por ejemplo, ¿cuánto se va a pagar sólo al profesor? ¿cuánto se va a utilizar para elaborar el material del curso? ¿cuánto para adquirir las herramientas (micrófono, ordenador, cámara, programas informáticos)?", "q1r": 4, "q2": "Existen algunas métricas, pero algunas de ellas están mal definidas (por ejemplo, la opinión de los estudiantes no puede ser una métrica en sí misma, sino que debería estar mejor definida, como número de opiniones positivas; considere incluso la posibilidad de crear un NPS sobre esto. Lo mismo ocurre con los resultados de los exámenes).\r\nTampoco tienen objetivos relacionados con el tiempo, que serían esenciales para seguir la evolución del proyecto.\r\n\r\nLos kpis del plan no son realmente kpis - son más bien actividades del calendario del proyecto. Algunos de ellos son hitos como máximo - puntos en el tiempo con duración 0 - como el \"cierre del curso\" pero podrían ser destacados aquí.\r\n\r\n\r\nNo se ha realizado ninguna gestión de riesgos. Yo incluiría como riesgo el no llegar al público objetivo (o no tener suficiente público) o la mala calidad del curso.", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "As a Brazilian, I can confirm that there is a lack of these courses around here. The proposal seems to fit in the challenge, making Brazilian students, which are very creative, aware of Cardano. However, I have some points to add: 1) I've seen that you are a professor in UFPE. Are you thinking about having just and online branch or are you interested in having some students from UFPE as well? This may have impact in the extent of people you reach; 2) How much is it going to cost? Since you are a professor in a Federal University, you know that we have several brilliant students but with a very low income, some of them having several problems to access the classes during this COVID situation. Therefore, if it is overpriced you won't have a great number of people attending it; 3) I imagine that, in order to keep this project going, you will charge for these classes and make it running, however I would like to see it more explicit;", "q0r": 4, "q1": "The plan is well written and I have no doubt that a Professor with such curriculum willing to pass this knowledge beyond will be capable of conducting this proposal. However, I've some considerations: 1) The budget could be more detailed; 2) I would like to see more money addressed to marketing – to reach more people; 3) It needs a more clear approach about continuity: are you going to charge, how much, if not, what are you going to do if you do not get funded, etc;\r\n\r\nThere is a huge risk associated with costs/attendance here that should be considered and it must have a focus on the feedbacks (positives and negatives) in order to be successful.", "q1r": 4, "q2": "I'm missing some real metrics here: # of attendance, # positive feedback, maybe # of proposals submitted by the students after the course, etc.\r\n\r\nBesides that, the roadmap and the budget seem fair.", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal 100% addresses the main goal of this Challenge effectively. Only through education can we increase the potential adoption of Cardano. Here we a proactive-outside-of-the-community associate professor from a reputable University in Brazil who has deep ties with MIT and 14 years of experience in teaching STEM courses has come knocking on Cardano's door. The perfect vessel to further the word of Cardano. Initially I had questions regarding how will this proposer acquire the materials on Cardano for it seems the proposer is quite new to the community. Sure enough though, the LATAM Cardano community came in numbers to support the proposer with all the materials they needed. These interactions are recorded in the comments section. Suggest the proposer to also be proactive in reaching out to the Catalyst School on any teaching materials. Google the keyword 'Catalyst School Cardano' and the first search result should be their website complete with all their contacts.", "q0r": 5, "q1": "100% the proposer with their experience as elaborated above and is clearly stated in the proposal complete with a LinkedIn link will definitely implement this proposal successfully. The budget requested is clear, reasonable and in this case, the format of the implementation plan of this proposal, does not require the budget to be broken down to smaller pieces. The 3 (three) month timetable to implement this proposal is clear and has an adjoining detailed action plan that further ensures confidence all goals set by the proposer will be achieve. Although the proposer has not taken into the risk and challenge, it is highly like the proposer will be able to mitigate this on the fly. For proposes of upholding standards, rating must adjusted fairly.", "q1r": 4, "q2": "Roadmaps and milestones are very clear and also provided are detailed action plans, though the proposer has categorized them under KPI's. The KPI's are also clear and majority are measurable though they are not under one specific category but spread throughout the proposal. There are some KPI's that will be challenging to be audit for there are no number associated to them, but all-in-all this proposal is solid. As usual, a solid proposal is usually the by-product of a solid problem statement and solution which are strongly interconnected.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 20, "ne": 8, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "Create courses on blockchain technology in a Portuguese language school for students in science and engineering in Brazil. The problem statement is presented in a logical and clear manner, and is consistent with the challenge summary.\r\nThis proposal is perfectly suited to the challenge, helping students understand Blockchain will help society become more and more technologically advanced, they can apply this technology to improve areas such as cryptocurrency, chain provisioning, data management, healthcare and other fields", "q0r": 4, "q1": "The team involved in creating the incubator is really strong, we can tell who each member is from the description of the proposal and on the attached website where we are told the area of ​​expertise, experience and what their current position has to do with the group. The proposal writer is an associate professor at the Brazilian Technical College, she also provides full information and a link to LinkedIn for the community to easily measure proposal performance.\r\nThe definition of success is described and clearly shows how the successful implementation of the proposal can be verified. Excellent idea, clear presentation, makes me fully confident this proposal will succeed.\r\nTo further increase the likelihood of this proposal succeeding, I would like to see a list of potential risks and challenges. What are the difficulties when implementing the course for students?", "q1r": 4, "q2": "The suggested 3-month roadmap incorporates KPIs, which is great, it makes it easier for us to test. All sections of the KPI are easy to follow with a list of plans tagged after the first 3 month period, increasing transparency and recommendations\r\nBudget analysis was presented, but no details. The proposal claims to pay $2500 per month, although it doesn't specify how that money will be spent, I think it makes sense given the amount of work she listed to do.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 19, "ne": 5, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "Definitely such ideas are needed by the Cardano ecosystem because with workshops, lectures, courses, presentations, information about Cardano will be spread, and in the long run it certainly gives a certain value and brings positive results, impact. The proposal clearly defines the problem in Brazil and offers an excellent solution. KPis in the proposal perfectly correspond to the ones indicated in the challenge and the proposal is able to scale future challenges. Great idea!", "q0r": 5, "q1": "From the website set up in the proposal, it is clear that we have a highly educated person, but the question arises whether we have the necessary skills, knowledge and experience in the blockchain. There is a link from LinkedIn which gives us additional security or not security in the ability to implement this great idea. The knowledge, skills and knowledge of Cardano blockachain do not stand out on both links that are placed in the proposal. Perhaps the lecturer himself will learn through the lecture what is the best school for both the one who teaches and the one who listens to the lecture. The budget is clearly presented but in my opinion $2500 per presentation with preparation of the presentation is unreasonable. These are too high costs per presentation. The plan is well developed but no risks are covered or mentioned. What if students do not come to the lecture or a small number come or the lecturer does not have the necessary skills to deliver the knowledge? One-month lectures are the perfect time frame for the realization of this idea because the lecturer has plenty of time to organize and prepare. We can say that all the necessary resources and technical aspects to implement the proposal are listed.\r\n\r\n", "q1r": 3, "q2": "Roadmap with a time horizon are excellently presented and feasible. KPIs are great presented and make sense. This project is easy to follow not only by KPIs but it would be good to have each presentation recorded.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 17, "ne": 6, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is a great idea. Offering free lectures given in Portuguese for STEM students about blockchain and Cardano not only addresses the objectives laid out in the challenge but also will add value to the Cardano system clearly. Moreover, the proposal can be scaled to address future challenge. It will be helpful for people around the world to get knowledge about Cardano. So that I strongly agree the proposal is impactful.", "q0r": 5, "q1": "The proposal provides a link of the proposer's information (experience, qualifications and certifications, video classes,etc) in Portuguese. I would love to see more about her experience relevant to Project Catalyst and Cardano ecosystem for preparing the learning materials about Cardano and Plutus. It would be great if the author adds information about the online education platform on which the course will be given. In my opinion, we need to make sure that the learning materials can fit the platforms and the user learning data is not trapped in them.\r\nThe budget is divided into 3 months fairly but not yet broken down into identifiable items.\r\nThe challenges and risks which relevant to the success of the proposal, have not been considered yet.\r\nDue to lacking of information I mentioned above, I rate Feasibility with a score of 3.", "q1r": 3, "q2": "The proposal has a roadmap with milestone and time horizon for achivement as well as metrics/KPIs that define the success of the proposal and clear understandable description of the targeted problem. Therefore, I agree the proposal is auditable.\r\nI would recommend the proposer should be in a collaboration for the success of the implementation. There are some similar proposals around (same towards education in content regarding Cardano/Plutus in Latin America). Joining one of them could benefit you both.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}], "solution": "Se ofrecerá un curso de introducción a la tecnología blockchain y Cardano a estudiantes de ingeniería y ciencias naturales.", "experience": "Doctor en Física. Profesor asociado en una universidad brasileña. Investigador colaborador en el MIT, Estados Unidos. 14 años de experiencia en cursos STEM"}