{"id": 383185, "author": "cardosco17", "title": "🔰 dVote - LATAM 🔰 AtalaPRISM", "url": "https://cardano.ideascale.com/a/dtd/383185-48088", "category": 26242, "amount": 98489, "description": "La falta de una plataforma única y fácilmente auditable en la que la gente pueda comisariar, presentar o votar iniciativas populares.", "funded": 1, "upvotes": 25272942, "downvotes": 20949797, "votes_result": 4323145, "votes_cast": 148, "f6_no_assessments": 5, "f6_rating": 3.1999999999999997, "videos": [], "media": [], "f6_assessments": [{"q0": "El propósito de esta propuesta es arreglar la falta o ineficacia de una plataforma confiable donde la gente pueda proponer, curar y votar iniciativas populares que puedan convertirse en leyes. El tema que aquí se plantea tiene sus raíces en la historia de la política latinoamericana. Prácticas corruptas. Por lo tanto, sería beneficioso encontrar una forma de facilitar la organización de las comunidades de forma descentralizada. El equipo busca fondos para desarrollar una plataforma que utilice las características de AtalaPRISM para proponer, mejorar y votar nuevas leyes. En un año, el objetivo es registrar al 1% de la población brasileña, lo que supondría aproximadamente 1,15 millones de personas, que es exactamente lo que requiere el reto. Sin embargo, la propuesta afirma que este prototipo cumple con las leyes de América Latina, pero se refiere únicamente a las leyes brasileñas. Sería interesante describir cuál es la base legal de este mecanismo en el resto de la región.\r\n", "q0r": 4, "q1": "Lamentablemente, la propuesta no presenta no sólo la descripción de las habilidades y experiencia del equipo, sino también la referencia para verificarlas. Como parte del presupuesto, proponen la contratación de personas con habilidades relevantes, pero yo recomendaría al equipo que al menos un miembro del equipo principal tuviera formación técnica. Desde el punto de vista presupuestario, prácticamente todo el monto solicitado está destinado al pago de horas profesionales, y en comparación con otras propuestas dentro de este desafío, los costos por hora son considerablemente más altos; por lo tanto, también recomendaría que el proponente presente los criterios utilizados para la asignación de costos. El autor de esta propuesta afirma que las leyes fueron rechazadas en el pasado porque no se aceptaron las firmas digitales. Por lo tanto, en base a mi lectura de la propuesta, no entiendo si se requiere alguna validación previa para que las entidades gubernamentales reconozcan la validez de los votos que salen de la plataforma. Para futuros ciclos de catalizadores, recomiendo al equipo que tenga en cuenta proporcionar una declaración clara de que estas preocupaciones fueron consideradas.\r\n", "q1r": 3, "q2": "La propuesta presenta hitos de 3 y 6 meses, pero en mi opinión, estos hitos deberían estar descritos de manera que permitan a la comunidad entender cuáles serán las actividades, por ejemplo, en lugar de decir \"marketing en redes sociales\", recomendaría al equipo que describiera qué plataformas se utilizarán, qué tipo de actividades se utilizarán y cuántas se llevarán a cabo. Creo que esta propuesta es el factor comunidad es indispensable, por lo que debe ser parte del núcleo de la estrategia de este proyecto. En cuanto a las métricas de éxito que considero relevantes son número de ciudadanos inscritos, número de propuestas creadas, número de estudiantes y abogados locales que participan, número de votantes, entre otras, que considero adecuadas.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 22, "ne": 13, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "En cuanto al impacto, esta propuesta es muy fuerte. La idea es crear una plataforma en la que los brasileños puedan navegar por las iniciativas populares, viendo las que ya existen, votando y curando las que deseen. La iniciativa está estrechamente vinculada al ecosistema de Cardano, ya que pretende utilizar el AtalaPRISM como fuente de identidad, lo que aumentaría mucho la seguridad de los datos involucrados aquí, utilizando blockchain para almacenar la información presente en la acción. Me pareció una idea muy fuerte porque, de hecho, la seguridad y la privacidad es frágil para este tipo de acción, de hecho, no hay ninguna plataforma que sea completa para llevar a cabo estas consultas / votaciones, y también es un asunto urgente en el país . La política brasileña es extremadamente conflictiva y permeada por mucha corrupción, creo que si la población tuviera más autonomía en la gestión de sus propias iniciativas, sería un gran beneficio para el país, favoreciendo así una importante ubicación latinoamericana, como busca el desafío. En otras palabras, en cuanto a la relevancia del proyecto para Brasil y los beneficios que traería a Cardano, creo que todo está bastante claro, la pregunta aquí es: ¿cómo conocerían los brasileños esta plataforma, cómo aprenderían a usarla? Tiene que ser simple, porque una de las cosas que desanima a la gente a involucrarse en la política es el hecho de que todo es demasiado burocrático, y me preocupa cómo la idea llegaría a una población local tan poco familiarizada con el blockchain. Creo que faltan aclaraciones en relación a la parte práctica de la idea, los autores se dedican a argumentar bien por qué todo esto es importante, pero no explican exactamente cómo se llevaría a cabo el uso diario de la herramienta. También creo que el precio que se pide es muy elevado, entiendo que la complejidad del proyecto es intensa, (el tema del presupuesto lo veré con más detalle en el tema de abajo), pero habrá que analizar mucho la comunidad para decidir invertir tanto en un solo proyecto, por muy interesante que sea, como es el caso.", "q0r": 4, "q1": "El personal no proporciona mucha información sobre quiénes son. Adjuntan una página web, que dio error cuando intenté acceder, y hacen una breve descripción sobre las áreas de especialización de los miembros que participan en la parte de experiencia relevante, pero no es un detalle exacto de quiénes son, porque no sabemos quién hace eso por ejemplo. Tampoco tenemos información en profundidad sobre cada profesional individual, sería necesario entender un poco el feedback de cada uno, es decir, su trabajo anterior, su formación, cómo se conectó cada uno de ellos con el ecosistema de Cardano, etc. En cuanto a la descripción de los pasos, tampoco hay detalles, el periodo total de 6 meses está dividido en dos grandes partes y cada una de ellas tiene una pequeña lista de lo que se hará en el periodo. El problema es que es realmente muy corto, por lo que no tenemos una comprensión detallada de lo que va a suceder. Yo recomendaría que los autores dividieran el tiempo por meses, y dentro de cada mes explicaran mejor lo que se haría, de esa manera tendríamos una visión completa del conjunto. Por último, en cuanto a la financiación en sí, creo que los autores han dado suficientes detalles para que entendamos bien cómo se utilizaría ese dinero. Lástima, sigo con este pensamiento y refuerzo que podría haber aún más detalles en algunas partes de la financiación. Creo que sería esencial que mencionaran quiénes serían cada uno de los profesionales aquí y cómo sería su rutina de trabajo, es decir, ¿qué tareas haría el anunciante para la comercialización del proyecto? ¿Cómo sería la construcción de la UI/UX que haría el diseñador? Me pareció que los valores, al ser altos, necesitaban más información sobre cada profesional y sus actividades, no creo que sea desproporcionado, sino que se necesitaría más detalle para transmitir seguridad en la inversión. En general: no sabemos realmente quién es el equipo, las fases están muy resumidas y la división financiera está presente y muy detallada, por lo que creo que es necesario que los autores aumenten su propuesta en detalle.", "q1r": 2, "q2": "Las métricas de éxito son la parte más detallada de la propuesta (aparte del argumento de por qué es interesante generar una plataforma de este tipo). Con eso, tenemos suficiente información para monitorear el progreso del proyecto. Creo que al tratarse de un proyecto muy particular en la zona, sería necesario que algunos miembros de la comunidad brasileña siguieran de cerca la evolución de las cosas. Son 6 meses de actividades complejas y costosas que necesitan ser monitoreadas y transmitidas al resto de la comunidad de Cardano, sugiero que un pequeño grupo de brasileños comprometidos con blockchain y con sentido político sea suficiente para monitorear el progreso del proyecto. No es necesario ser tan profesional al respecto, pero es un hecho que, lamentablemente, muchas personas en el país no tienen participación política, esta es una característica cultural de Brasil, algunas personas están muy comprometidas, pero creo que la mayoría son un poco ajenas a lo que sucede en este escenario, por lo que sería interesante que las personas que iban a ejercer la audibilidad aquí tuvieran interés en el tema, incluso para generar más energía en el seguimiento del proyecto y hacer que este cambio se haga realidad. En resumen, tenemos información para realizar la auditabilidad, ahora nos toca a nosotros en la comunidad seguir las cosas.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 18, "ne": 13, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "It's great when everyone has the power to propose and vote for what need for their community. I believe that citizen is the one that knows clearly that what need for their friends, family, and their communities. The idea of making a voting platform for Latin American countries like this will be supported by a lot of people who live there for proposing things that help their life better. The team showed a very inspired number about voters in their success key metrics that I believe will make some change in the future. ", "q0r": 5, "q1": "I hope that the team can write more detail about their implementation plan, there is just content about their overview, case studies, some featured questions, and answer about the personal data of users. For this kind of project, I have a lot of questions about: how the citizen can win on proposing new rules, who are the ones that deliver the proposal in their platform to the government, is there any template that can suit the condition of all countries in Latin America... \r\nBy the way, their roadmap in 6 months is so confusing to me because I cannot understand why they have to do these tasks? \r\nThat is the reason why I will say that the budget is unreasonable for what they showed in the proposal. \r\nI also try to get into their website and browse but can't see anything except some event info. ", "q1r": 1, "q2": "The roadmap is nonsense, so I think there is nothing for auditing. But their success metrics are very promising, if they can make it successful, it will make a big move to these countries. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This project will help to grow Latin America a lot. It makes a voting platform that helps citizens vote for their suggestion to make new laws or fix some laws that are not suitable for the current situation of the citizen as the proposer mentioned in the proposal. \r\nI believe this project will have a strong effect on the Cardano ecosystem in the future, but I think the proposer should tell how this platform will add some value to the Cardano ecosystem. \r\nThe proposer also provides detailed key metrics that align with the challenge setting. ", "q0r": 4, "q1": "The proposer just gives some brief info about the features of the platform and some answers that relate to security. I think the proposer should provide some more info like: detailed explanation about the features by user story for easy understanding, technology will be used in the platform, detail about the mechanic... and can be more other activities that will affect directly to the key metrics like: event organization, marketing, content production... \r\nIt's hard to give a high score of feasibility when CA/ vCA can't see anything that makes the project publish to the world successfully. Moreover, some info about the team with experience and roles will help a lot. \r\nLacking a lot of things, that is the reason why I rate this project with 1", "q1r": 1, "q2": "The roadmap is so short and can't clarify for what this project will be executed. That means it is not sufficient to audit the progress of this project. Good thing is that their key metrics is clear and align with the challenge setting.  \r\nHowever, the proposer has a good awareness of the problem and explains well how this project can help to solve that. But I hope that he can discover some risks on the plan then show here in the proposal. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal focuses on developing a platform with the benefits of the Cardano blockchain where citizens could submit proposals, vote, or curate. This is a great idea. The problem statement is quite abstract, however, in the detail, it is explained carefully. The solution is clear, fits the challenge, clear impact on the Cardano ecosystem.\r\nBased on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided, and described enough for understanding, with skill and experiences that suitable for implementation, however, without the external link for verifying the ability of each member [ex: through reference/proof (documents/links,...]. Besides, there is no information on similar works/demos/pilots done by this team. On the contrary, the budget is clearly described with structure and explanations of calculation base. Similarly, the proposal's roadmap and metrics are clearly defined; in terms of this, my advice would be: metrics should be more specific [in number and integrated into the roadmap]. Risk is defined [AtalaPRISM launch delay], but without any mitigation/risk management.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information [(1) The budget with structure and explanations of calculation base; (2) clear and detailed roadmap; (3) Measurable KPIs/metrics. However, there is a lack of: (1) Risk (and mitigation); and (2) Team profile description with external links for verification on each member.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 3, "ng": 5, "nfo": 7, "vca_o": 1}], "solution": "Desarrollar una plataforma con las ventajas de la blockchain de Cardano en la que los ciudadanos puedan presentar propuestas, votar o comisariar.", "experience": "Revolución Blockchain, educador, creador de contenidos, operador de stake pool, community manager, alta experiencia de trabajo con público."}