{"id": 383856, "author": "danicuki", "title": "Cardano Dev Português Brazil", "url": "https://cardano.ideascale.com/a/dtd/383856-48088", "category": 26242, "amount": 21500, "description": "Hay miles de grandes desarrolladores en Brasil con ganas de entrar en Cardano, pero el contenido sólo en inglés sigue siendo una limitación", "funded": 1, "upvotes": 44610157, "downvotes": 22242107, "votes_result": 22368050, "votes_cast": 161, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "The issue being not enough developers from Brazil are able to get into cardona because all the content available is in English. The proposer wants to create good quality content about ADA in Portuguese and also offer free workshop about Smart Contract and Plutus. Portuguese is widely spoken across brazil this should be very helpful to people who would like to get into cardano ecosystem therefore this proposal successfully addresses the issue", "q0r": 5, "q1": "As per the details provided on the proposer has enough experience to implement the proposal successfully and They have given a clear step by step plan with timeline on how the proposal will be executed. Hence it's very likely this proposal will be implemented successfully ", "q1r": 5, "q2": "The proposer has provided a complete timeline and also have set targets to reach within a time period.\r\nThey have given a detailed budget breakdown and also provided Definition of Success for required months. All these information would be sufficient to audit the development and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 17, "ne": 4, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is well written, concise and straight to the point. The proposer wants to introduce the blockchain technology and the cardano network to the developers in brazil and a portuguese speaking audience in general. This is a brilliant idea as developers in those countries can use the power of the cardano network to build dapps that will solve their problems. The key metrics and goal of this proposal align with the challenge. Furthermore the proposal should be able to scale in future challenges. I have a positive note on the impact of this proposal.\r\n", "q0r": 5, "q1": "The information included in this proposal gives me confidence in its feasibility. The proposer is a phd in computer science and has provided a github link to back his claims. With it's knowledge, I think that the proposer can produce high quality informative video to his audience. However, the budget could be broken down a little more. I think that allocating funds to marketing without precision is somewhat vague. The proposer can definitely improve this point. The proposer can also improve the project by adding a plan which will be followed if additional funds are needed. Apart from that, the proposal includes all the information that is needed to be implemented successfully. ", "q1r": 4, "q2": "This proposal includes all the information to be auditable. The proposer has included a roadmap with reasonable milestones, which I based only on my intuition. The metrics and KPIs that define success are also present in the proposal. The problem that this proposal is trying to solve is clearly described and the solution as well. Based on the amount of information given, I have a positive note on the auditability of this proposal.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 17, "ne": 5, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "I love this idea! Proposer clearly points out the problem of lack of information about Caradano in his native Portuguese and offers an excellent solution. Definitely this and similar projects have a positive impact on the Cardano ecosystem. The proposal clearly defines how it will add value to the Cardano and Catalyst ecosystem. Unfortunately the KPIs partially match the ones indicated in the challenge. This proposal is able to scale and address future challenges.", "q0r": 4, "q1": "In the proposal we have clearly highlighted links via Github and a website that let us know who will be working on this project. We can clearly see the experience, knowledge, skills and work required so far for the realization of this project. We do not have a clear insight into how many people will work on this project and a detailed implementable plan has not been developed. The budget is clearly presented, but it is not clear whether an external collaborator will be required for the video production, which carries most of the funds, or the holder of this project will do it himself. It would be good to elaborate on budget usage in a little more detail. Unfortunately, there is a lack of information for details of actionable tasks and order of execution, and the time frames within which the work will be done, it would be good if they were more clearly elaborated. In the plan that needs to be developed, it would be good to present the need for resources and technical aspects for the implementation of this idea. It would be good to think about possible risks if there are any.\r\n\r\n\r\n", "q1r": 2, "q2": "Having video content in multiple languages and workshops on Cardano is a great idea. Such ideas would be good to have a detailed roadmap with time frames for achievement. It would be good to elaborate on KPIs that define success. Although we do not find all the necessary information in the proposal, the community can track the development of this idea through the video content if the proposer really delivers it.", "q2r": 3, "assessor": "z_assessor_656", "no_vca": 16, "ne": 7, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about creating high-quality content in Portuguese for developers in Brazil. The problem (language barrier) is clear, suitable to the given challenge.\r\nThe solution is clearly defined, fits the challenge, with a clear and convincing impact argument.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "The proposal shows that the proposer has the suitable ability for implementing this work. In similar, the definition of success is (can be seen as his KPIs) defined specifically. However, the budget (with items structure) but without explanations of calculation base; and risk (as well as mitigation) should be provided.\r\nTherefore, based on the given information, I agree with this proposal's feasibility, I can rate it with a score of 4.", "q1r": 4, "q2": "The information provided is quite clear and enough for understanding. However, for better understanding, explanations of calculation base and risk (as well as mitigation) should be provided.\r\nTherefore, based on the given information, I can agree with this proposal's auditability, I can rate it with a score of 4.", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Crear contenidos de alta calidad en portugués\n- Contenido en vídeo\n- Talleres gratuitos sobre Smart Contract y Plutus", "experience": "Doctor en Informática, 25 años como ingeniero de software en Java, Ruby, Elixir, etc. Emprendedor y CTO en 3 startups."}