{"id": 384118, "author": "ecomchaco", "title": "ATALA Prism in Chaco", "url": "https://cardano.ideascale.com/a/dtd/384118-48088", "category": 26242, "amount": 24000, "description": "Identidad digital y validación de certificados educativos en español.", "funded": 1, "upvotes": 36386215, "downvotes": 14944128, "votes_result": 21442087, "votes_cast": 138, "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Se trata de una excelente propuesta que tiene un buen impacto para la comunidad argentina. En primer lugar, le gustaría crear una certificación digital utilizando Atala PRISM en colaboración con su ministerio de educación. Las aplicaciones que se quieren desarrollar, podrían ser útiles en otras partes del mundo y podrían ser copiadas. En segundo lugar, esta propuesta añadirá valor al ecosistema de Cardano mediante la implementación de la tecnología Atala PRISM y, por lo tanto, aumentará la adopción en la comunidad local (Provincia del Chaco, Argentina). (Calificación otorgada: 5)", "q0r": 5, "q1": "Sería estupendo que el proponente incluyera los perfiles de LinkedIn de los miembros de su equipo principal. He comprobado su sitio web (ECOM Chaco SA) y el perfil de LinkedIn de la empresa. Es bastante válido. Me gustaría saber si algunos de sus miembros son parte de la primera cohorte del Programa Pionero Atala PRISM o no. Si no, tal vez podrían tratar de participar en la segunda cohorte del Programa Pionero Atala PRISM para obtener algunos conocimientos sobre el SDK y obtener el apoyo del equipo IOG.\n\nEl presupuesto y el número de personal están bien descritos en la hoja de Google. El fondo solicitado es aceptable para este desafío; en realidad podrían pedir más teniendo en cuenta el alcance. Por otro lado, la propuesta carece de una hoja de ruta técnica detallada, como por ejemplo: qué construirán/entregarán cada mes. Por ejemplo: UI/UX, backend y producto final, en lugar de decir solamente \"15.000 certificados educativos generados en los primeros 3 meses\".\n\nEn la propuesta también falta un plan conductible para la implementación que muestre no sólo lo que se está haciendo sino también cómo. Me gustaría saber qué lenguaje de programación utilizarán, cómo se conectarán con el Nodo Atala PRISM, y tal vez añadir algún gráfico simple para explicar cómo funcionará su aplicación en general. Además, el proponente no ha tenido en cuenta los retos y riesgos a los que se enfrentará durante la ejecución del proyecto si se financia. Es bastante útil para la comunidad, para saber cuáles son los riesgos / desafío que podría aparecer durante la aplicación. (Calificación otorgada: 3)", "q1r": 3, "q2": "No he podido encontrar ningún KPI/métrico en esta propuesta. Añadir un KPI que pueda ser fácilmente rastreado por la comunidad añadirá más auditabilidad. Otro punto, tal vez el proponente podría añadir GitHub o cualquier enlace, para que la comunidad pueda seguir el progreso del desarrollo o del producto.\n\nHacer la hoja de ruta más detallada con hitos específicos podría dar a la comunidad de Cardano una mejor comprensión de lo que el proyecto logrará cada mes. En conclusión, el progreso de esta propuesta es bastante difícil de evaluar por la comunidad sin esa información adicional. (Calificación otorgada: 3)\n", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 28, "ne": 17, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "El impacto de esta propuesta está muy en línea con los objetivos del reto. La idea es crear un sistema, en español, donde las personas que tienen certificados digitales puedan interactuar y aprovechar las tecnologías de identidad descentralizada de Atala Prism. Esto sin duda beneficiaría tanto a los titulares de los certificados, es decir, a los habitantes del continente latinoamericano, proporcionándoles todas las ventajas que nuestro sistema de identidad descentralizada puede ofrecer; cuanto sería grande para Cardano una vez que se integraran un número de nuevos usuarios. Esto es interesante porque se produciría una especie de migración, es decir, personas que no necesariamente conocen Cardano y creen en blockchain tendrían contacto con Atala Prism sin que necesariamente tengan que ser \"convencidos\" de hacer tal cosa, creer en sus beneficios, etc. Como la blockchain de Cardano es algo relativamente nuevo y poco conocido, especialmente en el lugar en cuestión (América Latina), gran parte del trabajo suele consistir en introducir a las personas en el ecosistema y educarlas sobre sus diversas ventajas. Como el público objetivo aquí ya está involucrado en otro sistema de certificados digitales, la migración se produciría de una manera más orgánica y sin necesidad de una gran divulgación. Esto para mí es un punto positivo y una forma más práctica de traer nuevos usuarios a Cardano - a través de una migración, y que sin duda hará que las nuevas personas se queden y tal vez incluso recomienden Atala Prism a sus conocidos. Por estas razones le daré una puntuación máxima en términos de impacto.", "q0r": 5, "q1": "Es un poco difícil entender en profundidad quiénes están involucrados aquí. Sabemos que se trata de una empresa con participación estatal, Ecom Chaco. También sabemos que hay unos 15k certificados que ya han generado, provenientes de estudiantes de la provincia argentina a la que pertenecen, y que estos certificados están almacenados en 3 lugares diferentes. Sin embargo, no es posible conocer los datos concretos de quienes trabajan en Ecom Chaco. ¿Quiénes son los profesionales y qué harían exactamente en este proyecto? ¿Cómo son sus rutinas de trabajo? Entre todos los involucrados en Ecom Chaco, ¿quiénes trabajarían en este proyecto? Lamentablemente, la idea que tenemos de la empresa es muy general. Sería más interesante que se diera información individual de cada persona involucrada en la propuesta. Esto sin duda aumentaría el grado de confianza en su trabajo, porque tal y como están las cosas no sabemos cómo serían capaces de tender un puente entre su empresa y Cardano. En la hoja de cálculo disponible, pudimos saber que habría 9 profesionales involucrados, de diversas áreas, incluyendo dos desarrolladores de blockchain. Pero no es posible entender si ya tienen personas definidas para cada posición o si aún serían seleccionadas. Lo ideal sería que se presentaran, como dije antes, principalmente desarrolladores de blockchain - ¿cómo garantizar que tengan la capacidad técnica para integrar el Atala Prism aquí? Una sugerencia también: subtitular el vídeo adjunto, que está en español, la mayoría de los votantes de CAs, vCas y Catalyst no entienden el idioma. Sobre la hoja de ruta, es bastante superficial, lo único que sabemos es cuántos certificados se pretenden generar por trimestre. Pero sería esencial entender qué pequeñas tareas se realizarían mensualmente para obtener esos productos. No es posible entender el proceso, sólo los resultados esperados. Desgraciadamente esto no es un gran guión. Y sobre el presupuesto, lamentablemente lo encontré confuso. La hoja de cálculo adjunta tiene un total de (aproximadamente) más de 4 millones, creo que en pesos argentinos, que convertidos serían aproximadamente 24k dólares. Pero sería mejor que pegaran una leyenda aclarando esta conversión. Además, se puede entender claramente cómo se utilizaría el dinero, básicamente, sería el sueldo de los profesionales involucrados, dividido en un tiempo por meses. En resumen: sobre el personal y el guión creo que hay que mejorar, pero sobre el presupuesto, sólo una aclaración en relación a la conversión de la moneda era lo que creía necesario.", "q1r": 3, "q2": "Lamentablemente, no es posible auditar esta propuesta, al menos no veo ninguna forma clara de hacerlo. Los autores no tienen ninguna información sobre cómo controlar el desarrollo del proyecto. Lo único que se acerca es que nos dicen cuántos certificados se esperan en el tiempo. Así que es la única manera de controlar: ¿se ha generado esa cantidad? Pero esto es muy superficial. No establecen KPIs, es decir, formas de controlar directamente si los resultados prometidos se alcanzaron o no. Como tampoco hay una hoja de ruta, no hay posibilidad de controlar si las actividades propuestas se desarrollan realmente y de forma adecuada. Básicamente, todo lo que se nos dice en la propuesta es: qué se haría, cuánto dinero recibiría cada profesional mensualmente y el número de certificados digitales que se espera generar cada trimestre. Esto hace que sólo se pueda hacer un seguimiento de la faceta cuantitativa - también era fundamental ver las cosas de una manera más cualitativa. En general, no está claro cómo sería esta integración con Atala Prism. Sugiero que los autores elaboren KPIs, aclaren más sobre ese puente entre lo que ya hacen y Cardano, y una hoja de ruta específica de las tareas a realizar. Con esto, se generarían formas cualitativas de auditar el proyecto.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 26, "ne": 17, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "It is the objective of the project team to develop its own interface with ATALA Prism which will be implemented in a region of Argentina. Specifically, they are looking for a way to validate digital identities and documents for educational institutions. They plan to issue 50,000 document certificates within the next 12 months. In addition to being of great value for Latin America, this would also be yet another successful application for Cardano in the implementation of DIDs. The alignment with this challenge's objective is evident to me.  \r\n", "q0r": 5, "q1": "Positively, the team submitted a file containing a detailed explanation of the budget items. Analyzing these figures, I only have a doubt that the same amount is allocated to the front-end developer and to the blockchain developer. I would appreciate it if the team had addressed this concern. Unfortunately, the team fails to provide all of the necessary information to assess the feasibility of the project. For future Catalyst cycles, I would suggest several improvements: (1) Although a reference to an operating company is included, it is necessary to provide information about the individuals who will be participating directly in the project as well as references to verify their abilities. It is important that this information be included in the proposal. (2) It is noted that this company has participation in the state of Chaco. However, I consider it necessary to provide references where this claim can be independently verified; (3) It is essential that a concrete implementation plan be presented which provides a clear indication of what will be required to successfully complete this project.\r\n", "q1r": 2, "q2": "The team presents a roadmap that includes milestones at 3, 6 and 12 months along with 15,000, 30,000 and 50,000 certificates generated as success metrics. However, while I believe these to be appropriate, I think it is necessary to add some milestones, so that the community is able to track the progress of the project. An example would be the completion of the ATALA Prism integration, and the completion of UAT.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The project is within the objectives of the challenge. Achieving the objective of his proposal would imply a great impact both on the adoption of Cardano and on the \"Chaco\" community.\r\nThe proposal could be scaled to all of Argentina, even with the difficulties of having to negotiate with each district. You clearly identify a problem in Argentina and you need resources to solve it. If this project is successful, it would put CARDANO on the politicians' agenda :)", "q0r": 5, "q1": "The proposal is highly likely to be successful. But it will depend on the agreement that is reached with the district authorities, although according to their website they provide solutions to large government projects. I can infer that they have the track record and experience to successfully achieve the objectives of a project of this magnitude.\r\nThe budget is reasonable and details where the funds will be used, that is ... it is auditable. ", "q1r": 5, "q2": "The information provided is clearly sufficient to audit the project ..... We can meet the team behind the proposal, it is a registered and operating company. They provide a roadmap, a work plan, a website.\r\nOnce the project is finalized, it would give the carding platform greater exposure to government authorities, the media and the general population.\r\nWe are facing a successful project, it only requires financing.\r\nGreetings.", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "Implementing an Educational Certification Identity System based on Atala Prism will impact the Cardano Community. The proposal focuses  on a province of Argentina , Chaco , which makes it align with the Challenge brief. I have accessed the proposed web url: Docentessie.chaco.gob.ar , the preliminary work done shows the team commitment on the Project.\nIn my opinion, having a state Government participation in the project is also aligned with Atala Prism's objective to  make  governments around the world  more effective, responsive, and agile with decentralized identity solutions.  I would suggest the team should look into Atala Prism Pioneer Program and possibly submit a proposal on Atala Prism specific Challenge for greater support from the community. If this proposal was on the Accelerate Decentralized Identity challenge , I would have scored 5 on Impact.\n", "q0r": 4, "q1": "The roadmap title on the proposal  addresses  milestones  on the number of certificates the platform will generate and definition of success of 3 , 6 and 12 months. But the actual roadmap of how the platform will be developed is lacking and no actionable step for the proposed  implementation.\n\nI would suggest the Team study the catalyst guideline and funded proposal to see the difference between a roadmap and a milestone/ definition of success.\nA project of this nature should concern about risk and challenges and proffer solution how on how to tackle to them to increase the feasibility\n\nThough there was no Team profile provided in the proposal, I can see Team details in the official page provided. The proposal did not describe the skills needed and the Skills of their team if there is a Cardano Developer among them or not. \n\n", "q1r": 3, "q2": "\nLooking into the Attached spreadsheet I can see the budget Items and amount allocated that makes up the total requested amount. Though there is the Definition of success after 3, 6 and 12 months which the team called Road map , There is no deliverable that the community can hold the  team accountable  to which would have enhance auditability and no  Key Progress Indicators in the proposal.\n", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 24, "ne": 7, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "Desarrollo de una interfaz propia para ATALA Prism", "experience": "Somos una empresa con participación estatal en Chaco Argentina. Estamos trabajando en Cardano"}