{"id": 384299, "author": "seedstars", "title": "Democratising Blockchain in Latam", "url": "https://cardano.ideascale.com/a/dtd/384299-48088", "category": 26242, "amount": 50000, "description": "Blockchain es un mundo de nicho reservado a los que tienen experiencia. Esto deja un hueco para que los potenciales talentos se lancen a colaborar", "funded": 0, "upvotes": 16674719, "downvotes": 19819013, "votes_result": 3144294, "votes_cast": 116, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta está teóricamente bien relacionada con los objetivos del ecosistema, ya que beneficiaría a la población del continente latinoamericano, al promover una serie de eventos/talleres, y también al ecosistema Cardano, en tanto que dichos encuentros estarían centrados en la transferencia de información sobre nuestro blockchain . El problema aquí sería que el continente no tiene tanta actividad blockchain y el acceso es difícil para los principiantes, lo cual es cierto. Sin embargo, toda la información que se presenta aquí, para resolver estos problemas, se da de manera muy superficial. No sabemos en detalle cómo funciona Seedstars; he visto el vídeo, en el que se transmite el mensaje de que, básicamente, Seedstars está compuesta por distinguidos profesionales que tienen ganas de marcar la diferencia y llegar más lejos en sus áreas de experiencia. Muy bien, entendamos el perfil de los participantes; pero ¿qué hacen exactamente? En la parte correspondiente de la experiencia, el autor de la propuesta afirma que el grupo ayuda a los inversores mediante formación e inversiones. Pero no nos es posible entender en detalle cómo es esta ayuda, y sería importante entender también el impacto de la propuesta. No sabemos realmente a qué se dedican, por lo que es un poco difícil entender cómo serían estas acciones en América Latina, qué asuntos se tratarían en las reuniones, en qué país (o países) se llevaría a cabo, cuál sería el público objetivo (probablemente serían empresarios que no conocen Cardano), etc. Ni siquiera está claro cómo Seedstars se relaciona directamente con nuestra blockchain, no se pasa mucha seguridad en este puente, por lo que nuestra confianza en el impacto del proyecto también se tambalea. Creo que sería necesario reformular la propuesta, incluyendo 1) enlaces donde pudiéramos conocer más sobre el grupo Seedstars, su vida cotidiana y sus acciones 2) cómo conocen Cardano 3) cómo esta propuesta podría dialogar más específicamente con América Latina. ¿Pensarían en las especificidades del público, en las necesidades de la demanda?", "q0r": 2, "q1": "La descripción de los miembros del equipo tiene incluso detalles, pero son insuficientes, en mi opinión. Podemos entender las principales funciones de cada miembro del equipo y lo que harían en este proyecto, pero no sabemos cosas muy importantes, como: lo que han hecho hasta ahora en sus áreas de especialización (un pequeño currículo) y sobre todo cuál es su relación con el blockchain Cardano. Las únicas dos personas que citan a Cardano (indirectamente) en sus descripciones son Paula y Rómulo, pero no se puede entender muy bien cómo llegaron a conocer el blockchain, hace cuánto tiempo y qué estudian y/o trabajan dentro del ecosistema. Me gustaría que se aclarara más esta relación, y sobre un conocimiento más profundo de cada uno, esto podría resolverse si adjuntaran sus perfiles de linkedin (si lo tienen). Sobre el guión, es bastante detallado, aunque no es el ideal. Es positivo cómo determinan qué actividades se realizarían y con qué objetivos, pero dichas actividades podrían ser mucho más detalladas. Por ejemplo, en el mes 1: \"llegar a la comunidad y contactar con las partes interesadas para iniciar el compromiso con la iniciativa\". ¿Cómo llegarían a la comunidad? Por cierto, ¿de qué comunidad se trata exactamente? ¿De qué país, grupo de edad, nivel educativo? ¿Cómo se establecería este contacto? Del mismo modo, hay una falta de detalle para entender los detalles de las actividades de todos los demás meses. Es un problema que definan un intervalo tan largo: \"mes 3 - mes 7: Ejecución de eventos\", y hayan dejado tal vacío en esta parte del proyecto en cuanto a detallar la actividad más importante de la propuesta, la ejecución de eventos . Tendríamos que entender una serie de cosas. Entiendo que su idea es, después de la financiación, definir dónde se realizarían los eventos y cuáles son los temas, pero para nosotros sería mucho mejor que estos detalles se establecieran de antemano y se presentaran. De este modo, tendríamos mucha más confianza en si la inversión sería válida o no. Y sobre el presupuesto: le faltaban muchos detalles; por ejemplo, en la parte siguiente \"comunicaciones, relaciones públicas y marketing = 15.000 dólares\". ¿Qué serían las \"comunicaciones\" y las \"relaciones públicas\"? ¿Por qué se piden 15.000 dólares para estas partes? ¿Cómo sería la campaña de marketing? Esto sería muy importante para el éxito o el fracaso del proyecto, por lo que sería importante entenderlo en profundidad. Del mismo modo, no podemos entender por qué se eligió cada cantidad para cada cosa, se necesitaría más explicación y profundidad para transmitir la noción de que sí, la cantidad pedida sería justa.", "q1r": 3, "q2": "Es muy válido cuando dicen que después de cada evento se haría un análisis de las actividades y sus resultados, y esto se compartiría con Catalyst (¿no sería con la comunidad de Cardano, ya que Catalyst es nuestro programa de financiación y no necesariamente nosotros? ). Pero no sabemos quién haría estos informes, cómo lo haría, y cuál sería la plataforma de contacto entre esa persona y la comunidad de Cardano. Al final, también prometen realizar una encuesta general, que analizaría los impactos del proyecto para Cardano, Seedstars y América Latina. Habría que dar más detalles para entender qué se haría aquí, cómo se construiría este análisis, en base a qué estadísticas y cómo se presentaría a la comunidad. Está muy bien que propongan realizar la auditabilidad, porque la mayoría de los autores/equipos no tienen esta preocupación, pero por la forma en que se nos transmite la información, no podemos entender de manera sólida cómo se harían estas retroalimentaciones. Por lo tanto, sugiero que incluyan con más detalle cómo se harían los análisis, y así podremos estar seguros de que la propuesta será debidamente auditable. A partir de la información propuesta en el guión, no considero que sea un proyecto fácilmente auditable porque, como dije, el guión no tiene actividades muy detalladas, lo que dificulta saber exactamente qué debemos monitorear.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The identified problem starts from a false premise as \"the blockchain\" being a niche world, thus the statement of what problem is to be solved remains vague. Since 2009, when Bitcoin was released in the wild :), the use of blockchains has exploded via the creation of various cryptocurrencies, decentralized finance (DeFi) applications, non-fungible tokens (NFTs), and smart contracts. Today, is hard to find a real world use case that cannot fit into the blockchain technology.\r\n\r\nAnyway, the solution aims to give people the knowledge they seek about the blockchain through training, workshops and events but is unclear what are the benefits for the Cardano ecosystem, in particular.", "q0r": 2, "q1": "The team has four members and each of them has a role assigned and there is a brief description of their experience. Unfortunately, is unclear which one has the necessary expertize for providing training/workshops to various people.\r\n\r\nEven the proposal has a timeline defined it is unclear what are the deliverables of each stage, as they are presented in a generic manner.\r\n\r\nNo KPIs/metrics are defined to measure the success of the expected outcome (who is the target audience? how many people are expected to attend trainings/workshops/events? what are the main topics related to the Cardano ecosystem that will be presented to the audience? is there an increase of users using apps related to Cardano? The proposal aims to give the necessary info and expertize to onboard SPOs in the Latam region? etc.).\r\n\r\nThe plan doesn't describe the resources necessary to implement the proposal. The budget is broken down into identifiable items but lucks in providing relevant info on what the funds will be spending (it is unclear what \"Comm, PR & Marketing = $15000\" means in terms of inputs/outputs)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation", "q1r": 2, "q2": "The proposal itself reads very poorly for an outsiders. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work better. ", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "Impact-wise, the proposal is a clear winner. The proposer addresses the problem of blockchain being reserved to those who possess the expertise and is quite a dark realm for those who don't dwell much on technology. The proposer appears to rectify this inadequate outreach amongst the crowd. The proposer states to provide a series of workshops and events in order to foster the creation of multiple hubs and eventually drive varied contributions across the Cardano ecosystem. Therefore, looking at the bright side, this proposal could be the key to providing a lot of resources to the masses which lacks the required expertise to excel on the blockchain.", "q0r": 5, "q1": "The plan howsoever being a great initiative, is deficient in multiple sections. The proposer provides the readers and voters with a detailed monthly agenda, however, the success definition for these milestones seems to be missing. The team however appears to be well versed with the requirements and to have the essential expertise to make this proposal a reality. The possible risks and obstacles involved are not being mentioned and there is no information provided with how the team expects to reach out to the people. Thus, I feel the proposer has overestimated the plan a little, and keeping the time horizon mentioned in the manifesto in mind, I strongly feel the funds requested could be rectified and a portion of it could be requested in the further rounds showing the progress as a shred of evidence. ", "q1r": 3, "q2": "The proposer writes a separate section on how the auditors could track their progress and monitor the success. The team plans to provide regular reports for the same purpose. However, stating a few foreseeable KPIs that the community could look forward to could have added more weightage to the proposal. Metrics such as estimated number of active users of services, the monthly increase in the percentage of new members enrolled in the courses and events, the number of contributions that are initiated and etc., would have provided the readers with a rough estimate about the outreach and impact this would have on people especially in LatAm. Hence, I feel the missing details on key metrics make it tough for the readers to assume the success and impact rate of the proposal, and similarly, it would make the audit process difficult to compare its outcomes to the challenge's outcomes.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses perhaps the most relevant issue regarding blockchain community growth, that is reaching non technical people who does not have expertise regarding this subject. Their intent to promote series of trainings, workshops and events in Latin America could certainly help increase awareness in this region. However, based on the information provided on this proposal, and their website, the contents of such events does not include the Cardano ecosystem specifically, it talks about blockchain in general. Surely, increasing awareness about blockchain in Latin America would increase awareness about Cardano, but not directly. Their KPIs do not match the ones indicated in the challenge, because they don't measure Cardano community growth, increase in transactions processed or formation of new SPOs. The KPIs indicated in the proposal only measure the events success. For that, I cannot agree with the impact of this proposal on the Cardano ecosystem in Latin America.", "q0r": 3, "q1": "The proposal shows a 4 members team, managers of their respective areas, and their responsabilities. All 4 positions are already delegated, but there is not information provided about their experiences and skills.  I could find links to the LinkedIn of 2 of them on seedstars website, Romulo and Alejandra, but not of Paula and Camila. There is a timeline with tasks and objectives that seem feasible, judging by the seedstar's website informations, content and previous events. They are requesting 15 thousand dollars for Comm, PR & Marketing but do not specify how it will be spent. It is not informed which Software & Tools will be used. Therefore, there is need of more detailed information to justify the request for 10% of the challenge total budget.", "q1r": 3, "q2": "The proposal provides a timeline with tasks and a time horizon, but the objectives are not quantified, so it is not possible to measure the success of each step. There are KPIs that measure the events and reports success, none of them regarding Cardano, but they do not have a specific goal, so it is not possible to know what success mean in this project. For a better auditability, the proposal needs measurable objetives, specific goals for their KPIs and include KPIs related to the Cardano ecosystem, like Cardano community growth, increase in transactions processed or formation of new SPOs.", "q2r": 2, "assessor": "z_assessor_951", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Serie de formaciones, talleres y eventos a los actores del ecosistema sobre Blockchain, utilizando nuestros Seedspaces para crear comunidad.", "experience": "Seedstars ayuda a los empresarios de más de 90 mercados con programas de desarrollo de capacidades e inversiones. Tenemos una comunidad vibrante en Latam."}