{"id": 384240, "author": "livingwaters.cr", "title": "Living Waters Costa Rica", "url": "https://cardano.ideascale.com/a/dtd/384240-48088", "category": 26242, "amount": 10000, "description": "Falta exposición del ecosistema Cardano y sus beneficios en la comunidad latinoamericana", "funded": 0, "upvotes": 16179603, "downvotes": 19174543, "votes_result": 2994940, "votes_cast": 117, "f6_no_assessments": 5, "f6_rating": 2.8666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta es un poco confusa. Se entiende que el objetivo sería cultivar un espacio y realizar en él varios proyectos paralelos que puedan beneficiarse del ecosistema de Cardano de diferentes maneras. Sin embargo, la idea es muy grande y no está detallada, no entendí donde, por ejemplo, el cultivo de hongos y la cría de peces interferirían aquí. Sinceramente, la parte que más sentido tuvo para mí fue la reactivación del restaurante, ya que en este espacio los autores pretenden aceptar un ADA como forma de pago y además promover debates sobre el ecosistema. Correcto, pero esto, en ningún momento, se alineó con los objetivos específicos del desafío; estamos tratando de financiar proyectos que sean especialmente beneficiosos para América Latina, sus habitantes, sus microeconomías. Creo que el hecho de que este lugar esté en América Latina sería donde estaría este beneficio, pero sentí la falta de iniciativas que se destacaran en el contexto local, más allá de los límites de la finca. Me parece que el proyecto es un muy buen beneficiario de este emprendimiento, pero ¿qué pasa con el territorio más allá de su perímetro? No está claro cuál es la ubicación exacta de esta granja, por el título sabemos que está en Costa Rica (pero tenemos más detalles), quiénes serían como responsables de cada proyecto, qué grupos estarían trabajando, si estaría 100% abierta al público o sólo en días específicos... Lamentablemente, hay muchos detalles que quedan inciertos, poco definidos, no puedo entender el impacto que tendría esta propuesta para América Latina, en particular. Y con eso, no creo que la propuesta cumpla bien con los requisitos del desafío.", "q0r": 1, "q1": "Sobre el equipo, no tenemos información clara. No sabemos quiénes son; cuáles son sus nombres, roles profesionales, qué papel desempeñaría cada persona en el proyecto de forma específica, un pequeño currículum de lo que han hecho hasta ahora, cómo se involucraron con el ecosistema Cardano. Los autores citan en la parte de experiencia relevante algunas áreas de conocimiento en las que trabajan, como la ingeniería, la agricultura y el 3d (¿diseño?), pero esto se hace de forma muy superficial y sin un contexto. Es decir, ¿quién es el ingeniero? ¿Qué ha hecho, qué haría en el proyecto? Sería necesario que conociéramos al equipo de forma completa, de esta forma se transmitiría la confianza necesaria en su preparación para llevar a cabo este proyecto. En cuanto al cronograma, aquí hay un guión que explica, por fases, qué actividades se llevarían a cabo. Se preocupan por dar detalles y enumerar objetivos, para que nuestra comprensión sea más palpable. Lo que me preocupa es que cada una de estas fases representa algo muy singular, es decir, representa como si fuera una especie de miniproyecto dentro del proyecto. Por ejemplo: una fase trata de la apertura del restaurante, pero tendríamos que entender muchos detalles al respecto. Como qué tipo de conversaciones se promoverían aquí, qué temas específicos dentro del universo Cardano, con qué frecuencia tendrían lugar estos debates, quiénes serían convocados a esas reuniones y mucho más. En otras palabras, entender bien cada parte del conjunto. Lo mismo ocurre con las demás etapas del proyecto, cada una es única y está llena de riqueza, lo que genera la necesidad de un detalle que lamentablemente no existe. Y lo mismo sucede con la división del presupuesto, se dan algunos temas, pero falta el detalle. Cuando piden 4 mil dólares para construir la piscina: ¿por qué? ¿Qué profesionales trabajarían aquí, haciendo qué tareas? En la parte de \"tiempo y gastos para la integración del cliente minorista\", ¿qué gastos? Sería esencial que especificaran de qué están hablando.", "q1r": 2, "q2": "Durante el guión, los autores establecen cuáles serían los objetivos específicos de cada fase. Esto es muy positivo y ayuda mucho en la parte de auditoría del proyecto. Creo que sería mejor que algunos equipos se dividieran para salvar la distancia entre el propio proyecto y el resto de la comunidad. Sería más sencillo si una persona fuera responsable de un equipo y cada uno de los equipos pudiera trabajar en diferentes partes. Por ejemplo, un equipo que trabajara con el restaurante y otro con la piscina de estacas; y cada equipo tendría un representante que pudiera hablar con la comunidad, ya sea a través del Ayuntamiento o desarrollando una forma más condensada de presentar los datos de cada parte del proyecto. También sería mejor que las partes se dividieran en meses, esta es la sugerencia que suelo hacer, porque reunir semestres o trimestres es mucho tiempo para evaluar. Es positivo que el equipo también haya incluido algunos KPIs durante el detallado de la propuesta, esto aumenta la disponibilidad de la información a ser monitoreada. En otras palabras: Me pareció la parte más completa y bien explicada de la propuesta, para mí lo único que quedó pendiente sería el establecimiento de este contacto entre los autores del proyecto y el resto de la comunidad de Cardano.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "This proposal problem statement and solution is about spreading awareness and education on Cardano to the Costa Rican community by creating a mushroom and fish farm and making it as a community center for Cardano learning. The proposer mentioned at least 20% of retail clients incorporating Ada payment systems by Q2 2022\r\n\r\nAt least 20% of employee pay in ADA by Q2 2022\r\n\r\nAt least 20% Delegation from regulars to our stake pool for extra benefits at our location by Q3 2022 . Explain 20% of what? How big is the target market? The estimate number of 20% from unknown value is too general.  Therefore the key metrics and goals presented in this proposal are unclear whether it really gives impact to the community and Cardano.", "q0r": 2, "q1": "The proposer provided evidence of relevant skills and experience needed to implement the project. However, the proposer did not present in details the required manpower and resources to successfully implement the project. Moreover, the budget presented is not outlined clearly and broken down into identifiable terms. For example, in stake pool costs $4,000, which part in running SPO that costs 4000? Is it the hardware? Or the personnel that will be running the SPO?  For time and expenses for onboarding retail clients $2,000, how do you plan on spending that $2000? What expenses that required that amount? Is it on education materials? Or the manpower that teaches the community? What about the community space revival and mini summit that needs $4,000, is it for renovation and organizing events? If it is so, state how much is allocated for renovation and how much is used for organizing events. Therefore it is hard to assess whether the budget requested are reasonable to achieve the set goals. Furthermore, this proposal did not provide a sensible and conductible plan for implementation. Can you share the education materials that you are planning to distribute to the community? How do you plan on onboarding the community to use ADA as payment? How do you plan on processing the payments and how will it integrate with their business?", "q1r": 2, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. However the numbers presented on how many people that they aim to educate or bring onboard Cardano is unclear. Therefore the key metrics and KPI that define the success of the proposal remains vague. Moreover, the proposer did not provide any information for the voters to keep track of their progress. Therefore the information provided is not sufficient to audit the progress and the success of the proposal. ", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 22, "ne": 5, "ng": 7, "nfo": 10, "vca_o": 1}, {"q0": "Living waters Costa Rica will increase exposure of Latin America community through closed loop mushroom and fishfarm, restaurant site and Cardano retreat space/meet ups. Although it seems beneficial to the community, the proposal might need to share more operational information.", "q0r": 3, "q1": "The budget of $10k ADA to make this project possible is not an issue but how to make the project more sustainable and environmental friendly. The information of which will be crucial for the community to decide should the project be funded. The proposal hasn't provided as much this type of information as in how much has been done on site and more operational detail on fish farm, coffee plantation,  closed loop mushroom or the tavern etc.", "q1r": 4, "q2": "As a community, the operational detail will be much appreciated. The majority of budget will be used for eco-stake pool and the community space revival so most of proposal detail are in those areas. However, it is important to study about the impact to the local ecosystem as a key factor to monitor the project progress and if it enhances the community stance on SDG. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I see little alignment with the challenge, it's a good thing that they accept ADA and provide a space for spreading the word in their premises. Also great that they'll setup a Stake Pool Operator. But other than tha I believe the funds requested are not mostrly going to impact wignificantly the growth of Cardano in Latam.\r\nThe scalability of the project is very limited, so the population that could be impacted by this proposal is not large.", "q0r": 2, "q1": "The team seems to have a good general idea of how to move forward but their profiles don't provide any details about their experience of capabilities relevant to the nature of the project.\r\nThe budget could be more detailed so the reader can have a better picture of how the amount requested is justified.", "q1r": 2, "q2": "The proposal could benefit from having a section adressing how the community could verify implementation and succes.\r\nOne of the main items is and SPO which should be easy to audit.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Using a closed-loop mushroom and fish farm that on boards vendors and creates entrepreneurs through employment and mini summits is great way to grow Cardano community on Latin America since the project brings economic value to people. Farming or agriculture is a traditional field and people from this field who can benefit from this project will be the new commers to Cardano community. People easily be attracted to anything that bring immediate realistic value to them. Therefore this is great way to bring these people into the community, which can make the community more diverse since currently member on Cardano Catalyst community is primaly have tech-base or financial-base.", "q0r": 5, "q1": "The proposer is very experienced in relevant field: farming and system engineering. He/she explains well about the solution. The proposal also includes detail plan with roadmap. All the steps are well-thought and is likely that will be implemented successfully. The team also has clear vision about future expansion.", "q1r": 5, "q2": "The roadmap and KPIs are on point. The roadmap is clear with all the phases and action will be taken on each phase, which is easy to track the progress and the KPIs are detail with number quantity for each goal, which make the proposal become easy to measure the success.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Utilización de una piscifactoría de circuito cerrado que en las juntas de los vendedores y crea emprendedores a través del empleo y las minicumbres", "experience": "Más de 15 años combinados en agricultura regenerativa, cultivo acuapónico, ingeniería de sistemas en permacultura, adquisición y desarrollo de propiedades, 3D"}