{"id": 384614, "author": "linconvidal", "title": "Introductory Blockchain MOOC PT-BR", "url": "https://cardano.ideascale.com/a/dtd/384614-48088", "category": 26242, "amount": 9150, "description": "Falta de cursos de PT-BR que expliquen lo que pretende resolver el blockchain desde una perspectiva histórica, señalando a Cardano como posible solución", "funded": 2, "upvotes": 162412637, "downvotes": 1679736, "votes_result": 160732901, "votes_cast": 701, "f6_no_assessments": 7, "f6_rating": 4.904761904761905, "videos": [], "media": [], "f6_assessments": [{"q0": "El equipo de la propuesta abordará la cuestión de la falta de materiales educativos audiovisuales en portugués-BR que expliquen el contexto histórico de blockchain, así como el ecosistema de Cardano. Brasil es una potencia mundial emergente desde todos los puntos de vista, por lo que esto es de interés para la comunidad. Por lo tanto, es absolutamente necesario que el contenido de calidad de Cardano esté disponible para su población. El equipo tiene la intención de desarrollar Cursos Online Masivos y Abiertos (MOOCs) que estarán abiertos al público de forma gratuita y serán presentados en portugués. El hecho de que se pretenda que sólo esté disponible en portugués podría considerarse un punto bajo. Sin embargo, teniendo en cuenta que Brasil tiene más de 200 millones de habitantes, lo compensa. A mí me parece bastante clara la relación de esta propuesta con el escenario del reto. Sólo veo un fallo: se podría suponer que si las personas están expuestas a contenidos educativos, estarán más inclinadas a unirse a la comunidad, sin embargo, no es posible determinar si realmente se convertirán en miembros.\r\n", "q0r": 4, "q1": "En cuanto a la evaluación de la viabilidad, el autor de la propuesta ha hecho un excelente trabajo. Un apartado que destaca esta propuesta es la breve descripción de los contenidos de los diferentes módulos que tendrá este curso, no sólo se nota el trabajo realizado en la elaboración de la propuesta. Sino también, que el equipo cuenta con una persona con experiencia en metodologías educativas. Por lo demás, todos los puntos de control están ahí, se pueden verificar las habilidades y experiencia de los miembros del equipo, y el presupuesto está muy claramente definido y con valores acordes. El único punto que no está explícito en la propuesta es la evaluación de los riesgos que impiden el éxito de la implementación. Después de hacer una rápida evaluación de los riesgos, encontré uno que considero crítico. El equipo propone una métrica de éxito como \"Tasa de abandono\", la propuesta debería haber descrito cuáles son las acciones que el equipo tomará para garantizar que estos ratios se mantengan según lo previsto.\r\n", "q1r": 5, "q2": "En el apartado de auditabilidad, el equipo ha vuelto a realizar un excelente trabajo. Así, se han esbozado cuatro elementos principales en la hoja de ruta. En cada sección se exponen los resultados que el equipo tiene previsto alcanzar, de modo que la comunidad pueda supervisar los avances con respecto al plan según el proceso de desarrollo. Además, me gustaría felicitar al equipo por su capacidad para presentar las métricas de impacto de una manera tan clara y concisa, lo que, para mí, las hace adecuadas para el problema que intentan resolver.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2, "reply": "Great feedback! I agree with everything that was presented. The comment about \"dropout rate\" was a great suggestion that unfortunately we didn't think of in time to put in the proposal text, and we should definitely create ways to prevent people from dropping out.\n\nI strongly agree about the potential size of the audience in Brazil and I think it is a great audience to attract for Cardano, but there are also other Portuguese speaking countries that may consume the course content.\n\nAnd about people being inclined to join Cardano after being exposed to the content, I think it's more about them understanding blockchain and this whole universe to be able to make decisions on their own, so that they can create projects with it, and grow the community as a whole. It would be amazing if everyone chose Cardano, but more important than that is for people to have enough information and education so that they can choose the network that best suits their needs and also their political, personal, ethical and integrity decisions. It's about them being able to choose their network regardless of whether the network is famous, or can generate quick profits, or any of that spurious stuff."}, {"q0": "El problema en cuestión se aborda de manera detallada y eficaz. En resumen, se dice cómo Brasil es una potencia económica que podría aportar mucho al ecosistema de Cardano, si recibiera una dirección adecuada. Esto tendría que hacerse a través de varias iniciativas, y en esta propuesta tenemos una gran idea para resolver este problema. La propuesta encaja perfectamente con los objetivos del reto, porque busca un curso gratuito, en portugués, que explique las caras del universo Cardano (incluyendo las tecnológicas y sociales, como informan los proponentes). Esto tiene mucho sentido y cumple con el desafío, ya que proporcionará material de calidad, en el idioma nativo de los residentes de Brasil (el mayor país de América Latina), dándoles la oportunidad de aprender sobre Cardano y trabajar con él. De esta manera, tanto el continente como el ecosistema se beneficiarían sin duda. Se darían nuevas oportunidades a nuestros brasileños, nuevas personas capacitadas para trabajar en el número de blockchain, así como un aumento de las transacciones y, probablemente, de nuestros proyectos. Por eso creo que es una gran propuesta y muy probablemente producirá grandes resultados, si se financia. El conocimiento del curso ofrecido en Brasil es gratuito es otro punto positivo, es que a menudo es un hecho y vivo en la costumbre brasileña), porque una cierta elitización de los hechos brasileños. El hecho de que esta actividad sea accesible a todo el mundo también permite que personas de diferentes clases sociales y poderes adquisitivos tengan esta oportunidad de mejorar su vida a través de las oportunidades de empleo.", "q0r": 5, "q1": "En mi opinión, este proyecto está en buenas manos, lo llevará a cabo el equipo de la startup EveryBlock Studio, un equipo que dice llevar en actividades desde 2019, promoviendo proyectos relacionados con Cardano. Me parecen personas muy experimentadas y cualificadas para crear un curso e impartir clases. Generan confianza en su trabajo ya que nos proporcionan ejemplos de algunos de sus trabajos anteriores, así como enlaces a otras propuestas en f7. Es muy positivo que el equipo haya presentado a sus miembros de forma individual y muy detallada. Esto nos permite confiar plenamente en sus capacidades, y conocer más profundamente quién es quién, qué hace, etc. Además de los largos detalles, se proporcionan los perfiles de linkedin, donde podemos conocerlos aún más profundamente. Sobre el guión: se puede entender muy bien lo que se haría y cómo. El equipo tiene muchos detalles sobre lo que sería (y no sería) el curso, cuál sería el público objetivo, qué módulos compondrían el curso (incluyendo su orden y detalles específicos sobre cada uno de ellos). Todo lo que he dicho es sobre QUÉ se hará, esencial para entender la propuesta. Sobre el COMO, también se proporciona mucha información, el guión está dividido en meses, y cada mes tiene una lista de actividades necesarias. Con esto es posible entender el 100% del proceso que se desarrollará aquí. Por último, en cuanto a la financiación, el equipo también aclara cómo se utilizaría el dinero solicitado. Está dividido en varias partes que conforman el conjunto, desde el marketing, la edición del video y las horas pagadas de los profesionales involucrados. Por eso le doy a este tema la máxima calificación.", "q1r": 5, "q2": "La propuesta es muy auditable, el equipo nos proporciona KPIs específicos que sirven para hacer un seguimiento de los resultados (¿se está cumpliendo lo prometido?). Además, hay otras formas de supervisar el desarrollo de este proyecto. Como explican exactamente lo que habrá en cada módulo, es posible comprobar que los módulos se están construyendo y pasando de la forma prevista. También es posible comprobar si las actividades que se prometieron hacer cada mes están ocurriendo, y cómo se están realizando. Por lo tanto, creo que el equipo nos proporciona suficiente información para auditar con mucha precisión la propuesta. Basta con que la comunidad establezca este puente y mantenga un contacto constante con el equipo.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 27, "ne": 15, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "Hoy en día, hay mucho contenido de blockchain pero realmente no hay mucho en portugués mientras que Brasil tiene un gran potencial para ser explorado, como se explica en la propuesta. Por lo tanto, los cursos de blockchain centrados en Cardano en portugués son realmente necesarios y deberían tener un gran impacto. Es importante notar que hay otras propuestas en este fondo con el objetivo de elaborar cursos en portugués, pero no vi ninguno en el formato MOOC, que es cada vez más común, ya que el curso está siempre disponible y el estudiante puede hacerlo a su propio ritmo. También veo una gran alineación con las métricas del desafío y la conciencia con respecto a blockchain y Cardano podría aumentar el número de latinoamericanos que se unen a Cardano al mismo tiempo que podría expandirse a otras partes del mundo (con traducciones). Otra cosa que amplificará este impacto es que el curso será gratuito para que pueda llegar a estudiantes de bajos recursos (con acceso a Internet). La propuesta también está muy bien escrita con información completa y ya tiene todo el contenido que se enseñará en el curso, lo que hace mucho más fácil evaluar su impacto.\n\n También me ha gustado que el público objetivo esté ya claramente establecido. El único punto que se podría mejorar aquí es la viñeta que dice \"Cardano potencial\" - Se podría explicar mejor quiénes son estos usuarios potenciales (estudiantes de STEM, personas que trabajan en un determinado sector, etc). Definir un poco mejor este público facilitaría la comunicación con ellos. Una sugerencia aquí sería incluir a los estudiantes de bajos ingresos/pobres, ya que esta es una realidad importante en Brasil, y el blockchain/la tecnología en su conjunto tienen un gran potencial para mejorar sus vidas. Estaría alineado con los ODS 1, 4 y 10 de la ONU, al menos. Sin embargo, para llegar a este público específico, se necesitaría cierta comunicación (y apoyo) específica.\n\nSiguiendo con la comunicación, también se podría explorar mejor aquí cómo se anunciará el curso para atraer a nuevas personas. Las plataformas MOOC tienen un montón de cursos y para que tenga algo de protagonismo, es esencial una comunicación adecuada con el público clave. Podría incluir, por ejemplo, campañas de marketing en los medios sociales.\n\nMis dos últimas sugerencias de mejora se refieren a la auto-sostenibilidad del curso y a la interacción con los estudiantes. En cuanto a la primera, yo incluiría en la propuesta cómo se autofinanciará el curso en el futuro (ya que se supone que es gratuito). Podría ser importante mencionar si la intención es incluir anuncios o ser financiado por el público, por ejemplo.\nRespecto a esto último, entiendo el modelo MOOC, pero sería importante incluir también en el alcance del proyecto la creación de un canal de contacto con los alumnos para responder a las preguntas o tener debates entre ellos. Podría ser tan sencillo como un canal de telegram, una cuenta de twitter o instagram. No estoy seguro de si las plataformas MOOC tienen características que permiten esto, pero si es así, ¡es realmente importante explorarlas!\n\n\n", "q0r": 5, "q1": "En general, el proyecto parece realmente viable. El equipo forma parte de una start up que ya trabaja con proyectos similares y ha desarrollado productos para Cardano. Las personas de estos equipos tienen en la propuesta su experiencia muy bien descrita con enlaces de Linkedin para verificar la información. Hay 2 personas ya comprometidas y su experiencia es sólida en blockchain/programación/tecnología y diversa y parece suficiente para llevar un proyecto como este.\nEn la web de la startup también es posible comprobar más sobre la propia empresa y las personas que trabajan en ella.\n\nTambién hay un plan muy sensato y enmarcado en el tiempo que se describe aquí con las tareas en las que se trabajará en cada periodo. Es importante notar aquí que 4 meses para desarrollar completamente y publicar el curso es realmente bueno. El presupuesto está bastante desglosado y la cantidad total no es mucha. Lo único que haría aquí para mejorarlo un poco sería distribuir los valores en el cronograma también.\n", "q1r": 5, "q2": "Los KPIs están bien definidos y son sensatos y con un objetivo temporal, lo cual es estupendo. Sólo añadiría aquí algún KPI para medir la calidad del curso (me gustó mucho que se midiera la tasa de abandono). Podría hacerse con encuestas a los estudiantes, \"exámenes\" antes y después del curso, comentarios, etc. Entiendo que el número de inscritos también puede ser una forma no directa de medir la calidad, yo sólo añadiría una forma más directa de asegurarse de que se está consiguiendo. Otros posibles KPI (pero más difíciles de medir) podrían ser el número de (antiguos) estudiantes que se unen a catalizador y presentan propuestas, tienen sus propuestas aprobadas, desarrollan aplicaciones, etc. Esto ayudaría a verificar el impacto en el ecosistema.\nTambién hay algunos hitos que podrían extraerse de la línea de tiempo, yo sólo destacaría el más importante para el proponente (que para mí parece ser el último de cada periodo de tiempo).\n\nPor último, en cuanto a la gestión de riesgos, yo incluiría aquí los retos de cumplir el calendario propuesto, impartir un curso de alta calidad, no llegar a su público objetivo, que el proyecto cueste más de lo estimado y que no sea autosostenible en el futuro. Sería importante ver alguna estrategia de mitigación para estos temas, pero veo que se puede elaborar mejor más adelante en el proyecto.\n\nEn general, el proyecto parece realmente factible y hay una sección específica para la definición del éxito que resume muy bien su audibilidad.\n\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 25, "ne": 13, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "On-boarding new users is always a difficult, but a self-paced educational course made by Brazilians for Brazilians can make the process much easier and enable the team to reach a much larger audience. The proposal effectively addresses the challenge goals of grow the Latin American Cardano community by allowing people to learn at their own pace and consequently create a new stream of people entering into the Cardano ecosystem. The proposers emphasizes how local Brazilian communities can use and benefit from Cardano ecosystem.", "q0r": 5, "q1": "This proposal team has been participating in the Cardano community for a while and has several proposal for the Brazilian community. I believe they have the technical skills and qualifying relevant experience to inform and educate new members about the Cardano ecosystem. The plan is comprehensible and layout the structure of the course and topics, but I would love to see a module focused on how the average (non-technical) Brazilian can contribute to the community for after completing the course.", "q1r": 5, "q2": "The road map and timeline are broken down into clear and concise details that will help the community follow along with the progress of the project. The main team members behind the proposal are clearly identified along with their relevant experience, this will help the community build trust in the project as there are people that can be held accountable for the success and failures of the proposal. The proposal clearly defines the KPIs for success which the community can use to track and audit the proposal. I believe this proposal will be one of the easier project to audit due the detail in the proposal.", "q2r": 5, "assessor": "z_assessor_338", "no_vca": 18, "ne": 7, "ng": 11, "nfo": 0, "vca_o": 1, "reply": "I love the suggestion of a module focused on presenting the ways to actively contribute to the community, we will definitely take it into consideration! I'm also glad with the final comment because for us it means that we were able to convey the idea of the project in a clear and concise way. "}, {"q0": "Free Online Courses that will guide interested individuals thru a introduction to blockchain to    electronic payments to explaining Smart Contracts and NFT and Limitation then to the Cardano approach and the future of blockchain technology. ", "q0r": 5, "q1": "Already has an organized company called EveryBlock Studio with Highly Skilled Team members who's objective is to deliver digital products and services.", "q1r": 5, "q2": "Well Defined Video Course Materials, defined what will be in each Module 1 thru 6. Defined what will not be in the course materials. Roadmap is clearly defined Month by Month. KIP's are defined, and Budget breakdown is well defined.", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 30, "ne": 1, "ng": 16, "nfo": 13, "vca_o": 1}, {"q0": "Great job done by the proposer.  The proposal effectively addresses the challenge, very detailed and elaborative and has a great potential of bringing value into the cardano ecosystem by providing the people of Brazil the right blockchain knowledge to effectively to help them maximise the opportunities blockchain presents.", "q0r": 5, "q1": "The proposer has provided relevant links to team members and they seem capable to execute the task when funded per their details provided. Furthermore,  the budget is on point and reasonable enough to execute the project when they are funded.", "q1r": 4, "q2": "The proposer has clearly outlined the roadmap, KPI's and has defined clearly how success will look like after project execution when funded.", "q2r": 5, "assessor": "z_assessor_420", "no_vca": 23, "ne": 2, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "The proposers hope to onboard new Cardano users by creating a free online course in Portuguese. The massive online open courses are interesting because they don't have a limit on the number of participants, so it has theoretically infinite scalability. This idea would meet the criteria in the challenge statement because it directly onboards individuals into the cardano ecosystem who would normally not have the knowledge to enter it. After onboarding new users, the cardano ecosystem would grow because there would be a pool of new future voters, proposers, and CAs. (score given: 5)", "q0r": 5, "q1": "Given the experience listed by the proposers, I have full confidence that the proposal will be successfully implemented. The team has provided thorough experience that is relevant to the proposal. \n\nThe plan outlined seems likely to be successful because the proposers have listed a very detailed roadmap. There are good breakdowns by the month that all seem feasible in the given time period. The proposers also listed a plan for the content to be taught in each module. I appreciate that the proposers thought to plan this out in advance because it allows voters to have a more tangible view of the outcome of the project. \n\nThe budget seems reasonable given the scope of the project and the work that will be done by the proposers. (score given: 5)", "q1r": 5, "q2": "Given the information listed, I think that the proposal will be auditable by the cardano community. The proposers listed some 3, 6, and 12 month key performance indicators that are good milestones for the community to track the progress of the proposal. There are also great quantitative KPIs that the community can use to track the project, such as total number of enrollees. One thing I would be interested in is seeing if there can be a KPI regarding the number of course enrollees who go on to become active members of the cardano community. That would be interesting to track because it would directly relate to the long term goals of the challenge. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 22, "ne": 6, "ng": 16, "nfo": 0, "vca_o": 1}], "solution": "Una completa introducción de PT-BR a blockchain y Cardano MOOC que explica sus principales aspectos tecnológicos y sociales, disponible de forma gratuita", "experience": "Equipo con experiencia en la producción de material educativo (incluyendo blockchain y Cardano) y en la impartición de clases tanto físicas como virtuales."}