{"id": 384226, "author": "michiel", "title": "Crypto4Europe advocacy in Brussels", "url": "https://cardano.ideascale.com/a/dtd/384226-48088", "category": 26235, "amount": 29850, "description": "法律的不确定性阻碍了加密货币的发展和采用；监管机构应提供澄清，但缺乏行业联系", "funded": 1, "upvotes": 98783855, "downvotes": 15499742, "votes_result": 83284113, "votes_cast": 788, "f6_no_assessments": 5, "f6_rating": 3.999999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "The creation of a crypto lobbying forum with the option of meetings and events in the EU-capital of Brussels would be a good medium for lawyers to connect to eachother and get organised. The location of the firm, being in the same city as the seat of EU-parliament provides easier access to representatives. ", "q0r": 5, "q1": "The proposer aims to spearhead a cryptolobbying forum in Brussels. He has already established a network of contacts and has 10 years of relevant experience in the law sector and crypto space. The requested budget is set realistically. The personal time compensation correlates more or less with that of the hourly rate (~50 EUR/hour) in Belgium. Given that the network is already partially realised, the project is highly feasible to succeed and could even be increased by merging with other proposals in this fund who are aiming to realise the same goal.", "q1r": 5, "q2": "The proposal author has provided multiple sources of publications to support this funding request. There is a roadmap in place with a budget allocation. What is not there is a definition of success after 3, 6, 12 months to track the project after funding (KPI). How many members could be called a project success? ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 24, "ne": 3, "ng": 21, "nfo": 0, "vca_o": 1}, {"q0": "This is a well-placed proposal in the challenge as it suggests to create of EU crypto advocacy firm & lobby forum in Brussels (EU) that could help stakeholders in the crypto-asset space. What I am missing in the proposal is what will this EU crypto advocacy firm exactly try to lobby for - in order to benefit Cardano specifically. For example, one big big issue for European users is the staking mechanism and service that Cardano stakeholders perform and the tax implications that this may have and how this should be addressed. I would have liked if the proposal addressed staking directly as a key focus of its scope. I agree that \"legal uncertainty hinders the development & adoption of crypto and that regulators should provide clarification\" but we have legal certainty in some jurisdictions (China) and it is not something that is good \"per se\". We need legal certainty and good laws. As the EU crypto advocacy firm builds up its structure and presence - it needs to build up its pro-Cardano position and develop key recommendations of its own. Involving the key industry stakeholders and community in this process would be of paramount importance. However, this are first steps. The proposing team suggests that it \"will also provide the industry with practical analysis and guidebooks of recent legal and regulatory changes and developments, and of their effects and can be a single point of contact between the industry and the regulator\" ... I would argue that the inverse flow might be even more important - which is: \"to provide the REGULATORS with practical analysis and explanations of recent Proof of Stake and crypto in general technical advancements and developments\" in order to engage and influence regulation early on. Cardano community needs a megaphone (the EU crypto advocacy firm & lobby) aimed at the regulators while the regulators develop their policies. The challenge does call for educating rational politicians and this is not a mere detail. Yes, the proposer does suggest lobbying work - but there is no lobbying without a good platform. I suggest that this lobbying work be proactive - in the form of developing of new ideas and pursuing creative approaches - and creating networks of crypto-friendly MEPs (Members of European Parliament) - possibly leading to a new interest group of MEPs. Great proposal. ", "q0r": 4, "q1": "The proposer Michiel Van Roey has a professional biography that indicates he is qualified for an undertaking of this format. According to pulicly accessible information, the proposer is a member of the Brussels Bar Association and worked as an associate in Stibbe's intellectual property and technology, media and telecommunication practice for six years before starting his independent legal consultancy firm. He also  has experience with patent, trademark, copyright and design infringement cases (on a national, regional and international level) as well as general commercial litigation cases. This seems to be a very good match and I would also highlight the very well presented breakdown of costs. In one of his comments on Ideascale the proposer added: \"My idea is of course also to first focus on the stakeholders in the Cardano community and their needs (before going broader).\" I think that this is of key importance for impact. If Catalyst is to fund this proposal, the team should be clear about how they intend to \"focus on the stakeholders in the Cardano community and their needs \" - to ensure that the proposal is successful in its ultimate aim to fulfill the challenge. This means to \"promote the creation of an environment of laws that are more favorable or less harmful to the crypto space, with a focus on PoS and on Cardano's particularities\". That last part is critical (PoS/Cardano).", "q1r": 4, "q2": "I think that the auditing of this proposal will be relatively straightforward in some parts thanks to the detailed breakdown of the use of proceeds during year 1 to setup and manage the organisation. While some elements that will be funded are really very easy to verify, such as company foundation, accounting costs, website, logo design, social media setup and presence, some other elements also need to be checked. The proposed spending on  events & meetups (2-3 per year) - seems to be too general and lack detail. I would have liked to see a concept of these meetups and expected results. Also, I see that the office would bill for personal time from Michiel Van Roey for project management, legal questions of companies in Europe, lobby work, setting up network, drafting guidelines etc. I would have liked to see more details about the planned lobby work (targets, schedule, specific Cardano-related issues, Proof-of-Stake issues) and steps towards networking - with whom and when and how will this be communicated. ", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The Proposer addresses the Challenge \"par excellence\" which does not be a wonder as the proposer brings a profound knowledge and experience about crypto laws and difficulties. By building a team of european experts to lobby and influence the local industry, the proposer proposes a very effective solution and fully aligned on the challenges purpose.", "q0r": 5, "q1": "The proposer displayed his personal knowledge and experience by providing links to previous work which was done by the proposer. As author and politician with excellent relations within European governance and lawmakers, the proposer shows his strength in driving his proposal to its success. As we can see in the comment section of the proposal, the proposer started already building collaborations and partnerships with projects that move into a similar direction and teamed up with the DLT 360 Team which, on their side, also comes with a Team of experts and strong skills, knowledge and Experience. Given the provided information, the successful implementation of this proposal is very likely and the execution of the proposal will generate value for the ecosystem as whole. ", "q1r": 5, "q2": "As the Proposer is an professional Autor and maintains an github repository in which the progress of the proposal will be documented, the auditability part of the proposal is easy, transparent and open to follow as required skills are definitely on place to ensure the reporting and tracking progress of the proposal ", "q2r": 5, "assessor": "z_assessor_362", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Great idea. It is important to have a lobbying organization at the heart of EU. MiCA is posing as a potential restriction for stable coins and the creation of qualified investors. The proposal should focus on activities that the organization would undertake after establishing to achieve its mission. It would help to engage legislators in a meaningful way to get favorable regulation by assessing the impact of MiCA on the crypto community as well. ", "q0r": 4, "q1": "This team has a great knowlegde-base and experience. However, the proposal does not define success and includes KPIs to measure its outcomes or deliverables. That should be included to enable assessment of implementation. A road map of activities would be useful too. ", "q1r": 2, "q2": "Great budget breakdown. The team should consider documenting activities as well to help track and audit. ", "q2r": 4, "assessor": "z_assessor_727", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal clearly tackles the main fronts identified by this challenge, with the added bonus that a Brussels-based crypto advocacy group would enable lobbying for a large number of jurisdictions from one sole geographical vantage point, thus potentially also reducing the associated upkeep and maintenance costs for the advocacy group. It would be interesting to know whether the proposer plans to engage only at the EU-level, or rather take advantage of the national representatives from the EU member states in Brussels to advance bilateral advocacy and lobbying efforts, rather than focus solely on the multilateral aspect, seeing as many attributes regarding crypto regulation may indeed remain wihtin regulatory discretion of the national-level authorities.", "q0r": 4, "q1": "The proposer's prior experience and previous written articles regarding the subject showcase the necessary expertise to develop the proposal. Also, the willingness displayed in comments and replies to generate synergies with other like-minded projects plays towards the author's strengths and willingness to engage with other Community members in furthering the portrayed goals. In future iterations, perhaps it would be interesting to identify profiles for potential team members and/or partner institutions, as well as which governmental/inter-governmental regulatory bodies and authorities would be approached to initiate the lobbying strategy (eg., if speaking EU-wide legislation, which countries´ representatives should be approached first due to their prior known pro-crypto stances to serve as the vanguard for lobbying favourable legislation, or identifying and engaging key bureaucratic positions within the EU system to be able to become aware of potentially damaging legislative proposals before they are approved and irreversible).", "q1r": 4, "q2": "The roadmap and proposed budget are merely indicative of the costs associated with creating the lobbying group set forth within the proposal. However, the lack of clear milestones, KPIs and success metrics hinders the auditability of this proposal; I would strongly recommend monthly goals set out in regards to either specific measurable lobbying efforts (interviews with national/EU level representatives and/or bureaucrats), published articles, crypto-favorable legislative or regulatory drafts to be circulated to already vetted pro-crypto representatives within the EU system of national governments, growth of number of members actively taking part in the advocacy group, etc.", "q2r": 2, "assessor": "z_assessor_787", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "在布鲁塞尔（欧盟）创建欧盟加密货币宣传公司和游说论坛；帮助加密资产领域的利益相关者，并成为知识的SPOC。", "experience": "总部设在布鲁塞尔的欧洲科技律师和加密货币企业家，在科技法方面有10年的经验，是一些加密货币法律出版物的作者。"}