{"id": 384318, "author": "heinz.gassner", "title": "Transforming Regulatory Risks", "url": "https://cardano.ideascale.com/a/dtd/384318-48088", "category": 26235, "amount": 7500, "description": "有效的法律游说离不开将各种研究结果整合到跨学科的风险和机会视角中去", "funded": 2, "upvotes": 115186197, "downvotes": 14916310, "votes_result": 100269887, "votes_cast": 678, "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "This proposal has a high impact potential but it isn't easy to explain why. It is part of a larger already funded project that creates a risk and opportunity radar to give legal direction by creating inter-disciplinary bridges. This proposal is one of the bridges (law) that are aimed to be implemented and could directly provide the community with new valuable insights. It would be a helpful indicator for lobbying factions to use. ", "q0r": 5, "q1": "The main project has already been funded in fund 6. This is an addition to what has already been created to further build it. The proposing team is highly qualified. One team member has another proposal in the same challenge proposing a lobbying firm in the EU. If both are funded, this lobby could make direct use of this project's outcome, creating early ROI. ", "q1r": 5, "q2": "Given the large scale of the overall project, it is paramount to provide sufficient auditable variables to be able to track its development after each segment is funded. This proposal has succeeded in doing so. Everything in the checklist is present. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 26, "ne": 4, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "This is linked with another proposal which again, addresses very effectively the Challenge Brief and purpose. The Proposal pair increase its value by addressing several crucial aspects on the DLT360 Roadmap and build an very effective solution which provides value to the ecosystem as whole.", "q0r": 5, "q1": "The Team behind the DLT360 Project is built by members which have a profound understanding of the area they are working in. Previous funded Proposals from this Team show us that the Team is able and ready to ensure a successful and effective execution of the proposed solutions. The proposal contains all needed information to allow us to earn a clear understanding of the proposer's ambition and intention. The measurements of success and the roadmap are clearly and realistically dispalyed and the successful execution of the proposal is ensured by teaming up with other individuals and projects which increase the likelihood of a successful implementation of the proposal.", "q1r": 5, "q2": "The given Information regarding KPIs/OKRs and the updates on the proposers website allow the community to track the Proposals success. By including an KPI which is addressed on the communities feedback is a wise and effective way to allow the community a direct feedback on the proposals execution and show us that the proposers go the right way to include the communities opinion on their way to measure the proposals success.", "q2r": 5, "assessor": "z_assessor_362", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "I strongly Agreed because;\r\n1. the problem needed to be solve has been identified and falling in scope of the challenge . And will add value to the cardano ecosytem.\r\n\r\n2. the key metrics of the proposal falls within the scope of the challenge and scale up to address future challengies.\r\n", "q0r": 5, "q1": "Strongly agreed.\r\nbecause the proposal has provide numerous evidences, referens and links needed to implement the proposal if funded. and links are sufficient.\r\n\r\nProposal have identifiably laid in manner, the type and number of team memebers needed or required to omplement the proposal.\r\n\r\nHas locally laid out his team structure with accurate IS budget reasonable to achieve the set goals.\r\n\r\nThe proposal has a realistic timetable for the complement of the work if funded, and has a reasonable resources needed. \r\n\r\n The proposal has also listed some risks relevant for successful implementation of the project if funded", "q1r": 5, "q2": "Strongly agreed; \r\nbecause the proposer has laid down good road maps and time horizon for achievement if funded as in fund 6.\r\n\r\nThere are also clearly defined metrics/KPI's that idenfies the success of the proposal.\r\n\r\nThere are clearly understanderble describtion to the targeted problem and clearly understandable solution that address the problem, has a good contecy plan in place for various outcomes", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 24, "ne": 1, "ng": 12, "nfo": 11, "vca_o": 1}, {"q0": "This is a proposal, which in general is very strong and addresses the challenge well. \r\n\r\nIt is also very positive that the while preparing/finalizing the proposal, there has been an attempt to minimize the overlap with competing proposals to make it complimentary not competing.\r\n\r\nHowever, the value proposition is not sufficiently clear. The current wording for the proposed solution is \"This proposal is about utilizing the findings of various projects by integrating all this into our DLT360 Risk & Opportunity Radar approach\". The fact or plan on integration in itself is not a solution to the challenge. Potentially something what comes out of it. This is more than picking on mere wording - in my opinion it is essential to be very clear about WHAT the proposal is trying to solve, otherwise it is very had later to audit or monitor.\r\n\r\nIn addition: a problem statement \"Effective legal lobbying cannot be done without integrating the various findings into an inter-disciplinary risk & opportunity perspective\" in itself is not convincing if it is unable to say in short version WHAT is the problem. Just integrating \"various\" (?) findings (?) is not convincing.", "q0r": 4, "q1": "The project is feasible, plan is very professional, road-map is clear and budget breakdown is adequate. The team is experienced as well, therefore it is highly likely that it can be implemented successfully.", "q1r": 5, "q2": "KPI-s presented provide a good basis to sufficiently audit the progress.\r\n\r\nWhile being very fond of this proposal, I feel that the information to audit and measure the success of the proposal is not sufficiently clear from the perspective of the community and it is very hard to measure in the end very clearly if it has been a success.", "q2r": 4, "assessor": "z_assessor_685", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "It's not clear how this proposal directly lobbies for favorable legislation.\r\n\r\nPer the proposal: \"During this early stage of our startup, we are fully focusing on servicing the Cardano Community.\" \r\n\r\nPresumably, the \"proposal allows us to integrate the legal and regulatory findings of various Catalyst projects into our DLT360 Risk & Opportunity Radar\" and by doing so gives the community some capacity to more successfully coordinate the lobbying activities sought by the Brief. \r\n\r\nIt is not clear how this proposal effectively executes to the Brief: \"The idea behind this challenge is to fund specialists in regulation, lawyers and politicians who can promote the creation of an environment of laws that are more favorable or less harmful to the crypto space, with a focus on PoS and on Cardano's particularities.\"", "q0r": 3, "q1": "The competence of the team is evident, their capacity to get funded is as well. They are committed and experienced.", "q1r": 4, "q2": "The proposal lists basic \"orientational\" milestones, but they are auditable and able to be used by the community determinationally.\r\n\r\nGeneral feedback from this assessor- this project is far too complex, my sense is that the likelihood of successful delivery would be greatly increased by a significant effort in simplification. The end-user value is unclear, the action path is unclear.", "q2r": 4, "assessor": "z_assessor_701", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "Project utilizes the findings of various projects by integrating all this into specific DLT360 Risk & Opportunity Radar approach. This team had a presentation about their approach in the Townhall meeting that provided more detail. Otherwise I could not understand how is their apporach. \r\nHolistic context, effective and efficient lobbying-strategies is indeed needed and seems that this proposal can contribute to such kind of need so that whole Cardano\r\n community can benefit from the launch of this proposal.\r\nTeam seems experienced and shows the competencies to address future challenges although not clearly identified\r\n", "q0r": 5, "q1": "Again I remember the team presented their capacity and ongoing teaming process in the Town hall meeting. They provided the linkedin profiles shows the team have competencies to overcome challanges.Budget is described in detail\r\n", "q1r": 5, "q2": "Roadmap and milestones are clearly defined. KPIs are in place so gives a sense of clear definition of success\r\nThere is a clear description of problem and solution. However, challenges and risks have not been considered for the proposal itself. \r\n", "q2r": 4, "assessor": "z_assessor_747", "no_vca": 16, "ne": 3, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "这项提案是关于利用各种项目的发现，将所有这些整合到我们的DLT360风险和机会雷达方法中。", "experience": "超过30年的行业领导经验，以及灵活的核心团队和著名的领域专家网络。"}