{"id": 414099, "author": "fimi.vn", "title": "CardanoTalk for Vietnamese", "url": "https://cardano.ideascale.com/a/dtd/414099-48088", "category": 26602, "amount": 15000, "description": "Cardano users in Vietnam are looking forward to more talk shows so they can stay up to date with the news and get their questions answered about Cardano.", "f6_no_assessments": 62, "f6_rating": 4.370967741935483, "videos": [], "media": [], "f6_assessments": [{"id": 10553, "q0": "In my opinion, “Cardano Talk for Vietnamese” is a great idea and meets the challenge “Grow East Asia, Grow Cardano”. This proposal raised an issue that is quite concerned right now, that is: “Cardano users in Vietnam are looking forward to more talk shows so they can stay up to date with the news and get their questions answered about Cardano.” In recent years, the number of Vietnamese people using cryptocurrencies has increased. However, most people participate in the form of speculation, surfing rather than long-term investment, maybe part of the reason is that they do not have enough background knowledge and do not know the practical applications that the ecosystem has to offer Cardano brings. I am new to this ecosystem and have only been in crypto for 6 months. In the process of researching and learning more, I realized that for long-term development in this field, it is necessary to have a lot of knowledge, understanding, and a solid foundation to achieve the expected results. However, my limitation as well as many newbies often encounter is that I don't know where to start, or where to find the answers to questions, especially the biggest barrier is the language problem. I see that there are many problems if searching in Vietnamese will not work or the results will not be as expected. Searching in a common language like English will be much easier and more efficient. Therefore, language and time issues are difficult for us. Our difficulty is a matter of language and time. So creating weekly talk shows in the evenings to encourage people who want to dig deep into Cardano and then present it to the community to make it easier for busy people and newbies to access information about Cardano, is very meaningful and necessary. Besides, monitoring and absorbing information through talk shows, in addition to increasing knowledge and understanding, also help people to expand their relationships and meet and interact with more people. That will help a lot for newbies like me, instead of having to read and learn through dry, boring introductions or articles. With such positive effects, I think it makes sense to reward good and excellent presentations. The solution proposed by the proponent I find is also very clear and specific, through that solution, I can see the impact of the problem on FIMI community members, Vietnam, and the whole community of Cardano. To successfully implement the project, the proponent has also foreseen risks, that as Slippage of ADA price or because too many topics were requested from the community members. However, those risks are all prepared by the proponent to reduce risks. That helps the proponent to always proactively face difficulties. However, for talk shows to be attractive and interesting, in addition to excellent presenters, knowing how to attract listeners through how to lead the story, and knowing how to emphasize ideas for viewers to grasp ideas, the interaction between the presenter and the audience is also important. In my opinion, the proponent should have more exchange programs between the hours and the end of each talk show. Those exchanges can be decoding questions of which answers are keywords related to the talk show's content, or a minigame using 3-5 keywords to emphasize the main content just discussed through the talkshow. For those with good questions or excellent answers, there are rewards for them to encourage, and to let everyone capture the content without getting bored.", "q0r": 4, "q1": "This proposal has developed a relatively detailed and complete plan of implementation roadmap and budget. The proponent has divided the roadmap according to 2 main timelines: The first month after approval and after the first month, the process will be repeated weekly after 6 months after approval. Each milestone is defined with specific and clear tasks to help the community easily track information and progress. Regarding the project's budget, the proponent has also planned the estimated cost for 6 months. Here they presented a very suitable way of allocating and using capital. However, according to the opinion that I have presented above, if possible, the proponent can deduct a small part of the budget to set up a reward fund for participants of the exchanges with excellent results. The gift can be an item with the group's logo or brand on it. This also has the effect of introducing and communicating widely to the outside. Project participants include Mr. Do Manh Hung and the FIMI community, Mr. Hung is a person with a lot of experience and a relatively large influence on the community. With the teacher's strengths in all aspects, the project has a much higher probability of success.\n", "q1r": 4, "q2": "In order to measure the progress of the project, the proponent provided specific and detailed KPIs, including the Number of attendees to the meeting Zoom every week, the number of topics being presented and discussed, the number of questions during the meeting, the Number of views for the talk's video that uploaded on the Youtube. However, in my personal opinion, if possible, the team should add specific data for the above KPIs, which will help monitor and evaluate the completion of the project judgment. The project's success is also presented by the proponent through specific results such as Cardano Vietnam community has one more reliable, fast, and timely information channel; Community presenters get an extra income from the rewards for their presentation, the Youtube channel reached the milestone of 100,000 subscribers. Over the past 6 years, the channel has achieved remarkable results such as more than 150 Cardano and Blockchain videos have been published, more than 15,800 subscribers, more than 635,000 views, and more than 148,000 watch hours. This is a follow-up to the previously funded proposal. With experience and resources available from the previous proposals, I think that's an advantage for this proposal.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 11790, "q0": "I am a Vietnamese so I fully support the Cardano talk for Vietnamese proposal in the Grow East Asia, Grow Cardano challenge. When I read the proposal, I found it sought to solve the problem of creating a community where Vietnamese people could stay up to date with news and have their questions answered about Cardano through the organization of weekly talkshows week.\nThis is a challenge that has submitted a proposal at fund 8 but has not yet been funded, coming back to this fund 9, the authors have chosen to change the challenge to submit the project. I saw two significant changes to the proposal in the problem solving and funding sections of the proposal. If in fund 8, the authors still have shortcomings when they have not included solutions to solve challenges in the proposal, in fund 9 these problems have been fully supplemented and detailed from the author team, for the development of the Cardano community in East Asia in particular and the Cardano community in general. In the budget section, the change can be clearly seen as the amount applied for funding has been reduced by a third from 45 000$ in fund 8 to 15,000$ in fund 9. This shows me, in fund 9, the authors have made an overall recalculation for the proposal, added more content to make it easier for the community to understand the project, and adjusted the budget to apply for funding appropriately. \nI completely agree with the solution argument that the author team makes in the proposal. I myself have known Cardano for 2 years, it took me a lot of time to search for information about an problem online so more than anyone else, I really need a place with a lot of knowledge and information Cardano standards. It will save me a lot of time and effort for this job, and I also know that in Vietnam we, the Cardano community, although not yet accounted for the highest proportion, is still growing in popularity 2022 and beyond. They are all Cardano lovers and are very loyal to the ecosystem, in addition to that, a large number of people who are learning and ready to join the community show a need to find and exchange information the news about Cardano is huge. Both exchanging information and receiving rewards will give members more motivation, encourage them to actively seek, cultivate, refine information, participate and share their knowledge multiply them for the community. Because the impact of the proposal is so great, I will give the proposal 5 points in the hope that it will be funded at this 9 fund.\n", "q0r": 5, "q1": "The project has given a specific timeline and I find it reasonable. Creating a weekly schedule to exchange talk shows is also a moderate time, not too thick to absorb a lot of new knowledge.\nI see the budget of the proposal is 15 000$, which is 6% of the total project budget. The budget has been divided according to each major item, but not enough details, the amount used is not clear and specific. Some items I find lack content to know what it spends on, this makes it impossible for the community to follow the project closely. In my opinion, the author team should clarify this part of the budget, for example, in 6 months of running the project, the amount of $ 2500 training for the new core team each month needs how many people, unit price for each person, how will this amount change each month ..etc. and similarly for other expenses. The more detailed, clear and transparent the budget is given, the better. \nIn order to anticipate the risks, the proposed team has also mentioned two risks that limit the success of the project, which are the price fluctuations of ADA and too many topics raised from the community, along with it is the solution to reduce these 2 risks. I also completely agree with the author's way of taking risks.\nAbout the project's proposer, I got to know Mr. Do Manh Hung and the FIMI community through some of my friends. Although I have not had the opportunity to become his student, I know that he is a person with a lot of experience in the financial field, he has many years of experience in teaching and imparting knowledge about finance in general, about blockchain Cardano in particular for the community. In Vietnam, many young people know Cardano through his financial lessons. Moreover, he already has a certain number of members in the FiMi community he founded and this number is still growing in the future.\nI will give feasibility 4 points because I am not satisfied with the interpretation in the use of budget by the author team.\n", "q1r": 4, "q2": "This is a project where the community can completely monitor the implementation progress and success. The roadmap and implementation content by week and month have been outlined by the author group, which is easy to understand and detailed. In my opinion, if the authors edit and interpret the budget content more clearly and fully, the community will be able to monitor the project progress more continuously and closely.\nThe success of the project is measured by 4 indicators such as the number of spectators attending the Zoom meeting by week, the number of topics presented and discussed, the number of questions in the meeting and the number of video views uploaded meeting. I think these 4 indicators are relatively complete, but the authors should update the data for the 4 indicators every month to help the community easily monitor the progress of the project better.\nI know that Mr. Do Manh Hung and the FIMI community have been studying Cardano since 2017 so they have a lot of experience in this field. Furthermore, this proposal is a continuation of the previously funded proposal at fund 7 which is \"Reward for Community Translators\", the community can refer to more at the author group link below the proposal. They are gradually proving their success when their youtube channel has more than 150 published Cardano and Blockchain videos, more than 15,800 subscribers, more than 635,000 views and more than 148,000 hours of watch time. This number will increase when the author's youtube channel reaches 100,000 subscribers.\nI really hope at this fund 9, the project will be funded and known to many people. The project will develop an in-depth knowledge channel about Cardano in Vietnam to spread and attract community members who love the ecosystem in the near future. I will give the proposal transparency a score of 4, a high score on this recommendation's rating scale.\n", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 16, "ne": 9, "ng": 5, "nfo": 2, "vca_o": 2}, {"id": 12065, "q0": "The proposal \"CardanoTalk for Vietnamese people\" has identified a problem in the challenge and that problem has a great impact on the development of the Vietnamese community. It presented a problem in the development of the Cardano community, the proposed problem is suitable for the challenge, the idea is to provide a solution to help Vietnamese people more convenient in the process of searching and gathering information. of the Cardano platform. With the rapid development and more Vietnamese people interested in cryptocurrencies, Cardano needs to have an additional reliable, fast and timely information channel that responds to timely and in-depth news about cryptocurrency. Cardano from IOHK. Please present the problem clearly and convincingly. It offered solutions to a problem in the growth of the Cardano community, which is the growth of the Vietnamese community. The specific solution of the proposal is to build a youtube channel with in-depth content about ADA and the website of a professional team on Blockchain - Cardano: Fimi. Therefore, based on the recommendation engine, the human community will shorten the search time and collect quality information sources, thereby contributing to the development of the Cardano ecosystem. The team proposes to give specific examples in the presentation with arguments with specific, feasible, and highly effective numbers. It shows that the proposed team has carefully studied the development and needs of Vietnamese people, answering the question: How to increase the quantity and quality of knowledge for the Cardano community in Vietnam? The specific goal of the product you propose is: Providing knowledge and information to Cardano related people by thematic video, The talk show will be held weekly in the evening time frame via Fimi youtube channel. Besides, building a reward mechanism to encourage elite members of the community to learn deeply about Cardano and then present it to the community to help busy people and newcomers grasp new information about Cardano easily. than. The proposal identified a number of risks in the implementation process and proposed solutions to overcome all those risks. You have pointed out two risks in the process of doing work and have solutions to overcome and limit those risks. In the first risk, the proposed team points out the risk of ADA Slippage. Sometimes ADA price drops suddenly, we can't sell ADA for USD or VND in time. This may leave you with insufficient budget to reward presenters and stakeholders. Leading to the disincentive of participants' interests and the success of the proposal and its solution is the request for additional funding ($2,000) to reserve this. In the second risk, the proposed team took a risk because the community members requested too many topics and overcome by selecting only some of the most important topics.. However, I have suggestions for the group. about the solution to overcome and limit the risk that you have pointed out. In the second risk, I want you to solve the problem in more detail, develop criteria to choose the most important topic, this will help you convince the community to trust the project team more, besides knowing how to filter information when receiving. I rate: 5 points.", "q0r": 5, "q1": "Propose clear, detailed and reasonable timelines to perform the work with specific objectives and reasonable assignment. The team presented the proposed target plan within 7 months with detailed plan in the attached proposal file; Recruitment, training, core team of presentations, increased community, increased registered views, timely information and information quality close to the changes of the market.. Results in the process of implementing the proposal. easily check and update continuously through tools, video products, on popular social networking platforms such as at website and youtube channel, Telegram community. The proposal accounts for 6% of Challenge's budget and has a reasonable and transparent spending plan for each specific and transparent activity. The alternative proposed in the supplementary budget is quite reasonable. However, an additional provision is needed in the event that more videos are shared than expected, the Vietnamese community is interested in increasing the number of spikes. Proposing to assign specific tasks to each member; Having experience related to the assigned task includes 4 members - in which 1 has a master in economics and 3 professional core teams on Blockchain; The identities of team members are easy to verify. The proposal also analyzes the tasks for each specific group of members based on the capacity and experience of each team member, suitable and highly specialized, each group will be in charge of a work department. List of core groups and easy to identify members, with YouTube links, with telegram accounts, Youtube, https://fimi.vn/ada . I rate: 4 points", "q1r": 4, "q2": "Proposals provide KPIs, making it easy to accurately quantify a proposal's effectiveness and easily test it. The proposal has four metrics/KPIs to measure project performance and progress (Telegram, Youtube). Accessible to alleverywhere clearly display the number and results of work. The proposal is clearly defined as feasible, very successful and has been successfully tested in practice. The success of the proposal clearly describes the results achieved with the number of people attending the weekly meeting; the number of topics presented and discussed; the amount of work that we have completed; the number of questions in the meeting and the number of views of the talk video uploaded to Youtube . The goal of the proposal is to shorten the search time for Vietnamese people who are interested in Cardano and the presenters in the community to have more income from the rewards for their presentations, so they are more motivated. development of this ecosystem. Proposal This proposal is a continuation of the previously sponsored proposal: Community Translators Rewards and can be checked here at the link to the article attachment of the proposal or the results of the F7 vote. This sponsored project will help successfully change the thinking, choices and actions of Vietnamese people in developing the Cardano ecosystem in the long run, which will determine the change for the better in the world. future. So if funded, I think this proposal is in the top 10% voted. I rate 5 points.", "q2r": 5, "assessor": "z_assessor_3353", "no_vca": 14, "ne": 8, "ng": 5, "nfo": 1, "vca_o": 2}, {"id": 1114, "q0": "The fact that Vietnamese speakers need access to more information about Cardano and its ecosystem in their language is obvious. This proposers solution is simple, well laid out and addresses that need by organizing weekly video meetings presenting new up-to-date information on Cardano for the Vietnamese community. The presentations will be created by different teams of community members, who will be rewarded for their research and involvement. The video meetings will be recorded and uploaded to the FIMI YouTube channel, which already has over 15K subscribers and currently contains over 200 videos of translated and subtitled informational videos.\n\nDo Manh Hung, the proposer, who has been running the FIMI YouTube channel for the past two years, has identified the need for more easily accessible presentations in Vietnamese. Although he has already translated many informational videos into Vietnamese he knows that it can be tedious for many members to read subtitles on technical matters for long periods of time. People learn in different ways, some learn by reading, some by listening and some by watching & participating and he is aiming to provide a more engaging way to pass on condensed information about the Cardano ecosystem.\n\nThe project includes the involvement of teams of 10 to 20 members, who are already interested in Cardano, its blockchain and ecosystem, and who will be taking turns making the presentations once a month in an inclusive manner allowing for the communicative sharing of information. Basically, members of the community are creating Cardano focused educational content for other members of the community, thus connecting and supporting each other. \n\nThis proposal meets the challenge's goal very well: helping the Cardano ecosystem grow in focused initiatives in East Asia. With almost 100 million people in Vietnam, providing facilities for Vietnamese to access information in their own language in an engaging way is critical.", "q0r": 5, "q1": "The proposed budget is certainly sufficient for the 6 month timeline. The act of training teams how to create informative and engaging presentations should be easy enough during the one month training period. After that, weekly video presentations will begin based on subjects requested by community members.\n\nRegarding the budget, it appears that approximately 33% goes for training and consulting but no real details are given if that is to a team or an individual. Approximately 20% for community members but no specifics are given what that means, approximately 30% to presenting teams  and the balance going for slippage of ADA price which does not seem necessary if the proposers simply immediately converted their catalyst funding to $USD or $VND. \n\nDo Manh Hung, the proposer, has a master in finance, has been lecturing about and promoting Cardano and its ecosystem since 2017. He has created a YouTube channel dedicated to sharing information about Cardano to the Vietnamese community which has over 15K subscribers and has certainly proven a commitment to and expertise of the Cardano ecosystem enough to implement the proposal.", "q1r": 4, "q2": "The auditability of this proposal is clear and can simply be measured through the number of attendees at the zoom meetings, the number of videos published and the number of views on those videos. These performance indicators will be updated on a report file for all to see. ", "q2r": 5, "assessor": "z_assessor_2207", "no_vca": 21, "ne": 4, "ng": 16, "nfo": 1, "vca_o": 1}, {"id": 10519, "q0": "This proposal aims to further the knowledge of cardano in vietnam by creating a weekly talkshow to present technical help as well as general news about the cardano world, in vietnamese. This project have several interesting aspects that could help cardano's development in vietnam. First, the technical educational content in vietnamese will help both cardano-newbies and cardano-veterans contribute to the ecosystem in a more meaningful way, as their technical knowledge will be better. Secondly, this project has high potential to atract newcomers because of its interactive nature. Having 4 teams compete and be rewarded to present a project every week will push each team to do better and produce higher quality content. Having the community pick topics will ensure the topics stay relevant and about a topic that interests the users, making them more interested in learning. A disadvantage that I see in this project is how it is a telegram and youtube based community. There exists many well-respected telegram-youtube communities for vietnamese cardano users. It would be preferable to branch out and use other platforms to give more people access to information and reach a wider audience. Overall, I think it is a very good. project that will help develop the vietnamese cardano community. ", "q0r": 4, "q1": "The team that leads this project is very skilled, and the founder has over 6 years experience in the cardano space. The youtube channel has over 150 videos, with a large community of over 15k. The communty engagement seen on both telegram and the youtube channel is very substantial. The website is very informative, regularly updates, and easy to navigate. The aforementioned points show that the team is dedicated, and have proven their experience through quality of their work. I believe the team is more than capable of successfully implementing this project. However, some aspects of the budget breakdown have me confused. There is a budget to \"\"support community members\"\", this is very vague and not elaborated upon in the proposal. What exactly does it entail? Secondly, how will the project sustain itself after initial funding? The authors indicate that this funding will allow 6 months of operation, but with no plan for self-sustainability. Does this mean the project needs to be refunded every 6 months? There is also no mention of marketing, and no marketing budget. How will the authors compete with the already plentiful telegram communities in vietnam? How will the project gain new members? I believe there needs to be a bigger effort regarding these aspects. Overall, i believe this project will be implemented successfully, but could do better if they make a bigger effort to reach a wider audience.", "q1r": 3, "q2": "The author offers interesting metrics to audit progress and success: number of views, members, community engagement. However, it might be hard to find these metrics as the author has provided no indication of where these metrics will be shown. Furthermore, it will be hard for the english community, as well as people who do not use telegram to see progress and audit, if these metrics are only published in the vietnamese telegram. Perhaps posting it on a dedicated section on the website would be good. ", "q2r": 3, "assessor": "z_assessor_3189", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 10591, "q0": "Overall, this proposal is to create programs to update news and answer questions about Cardano for users, specifically here for Vietnamese people. This is an interesting and interesting area because Vietnam is currently one of the countries that can be said to be very open to blockchain and crypto, even very responsive information sources, precisely because The Cardano ecosystem is completely suitable for the Vietnamese community. In addition to creating Cardano update programs, the author will also build a reward mechanism to encourage members to learn Cardano news and documents, then introduce them to the community, this is an idea. good idea, attract users with rewards then give them access to knowledge.\n\nThis is an idea that perfectly fits the purpose of the challenge, which is to grow the community. I appreciate the fact that Fimi always regularly makes videos about the Cardano ecosystem, but I see that the channel has been built for a long time but has not yet attracted many users to exchange (or maybe as the author said, via Zoom) and the video is recorded and upload on youtube). And I also find the information provided by the author is very complete.\n\nHowever, there is a small problem like this, this team has got the proposal of Fund 7, I have checked this information, and the budget of fund 7 is $18,000 with a roadmap of nearly 12 months, then between fund 7 and fund 9 is there any connection or difference? Fund 7 is a Reward for Community Translators, the budget plan for fund 7 is quite similar, it just differs in terms of the wording. I think the author should clarify this point. However, I still rate this as a project that perfectly fits the challenge's proposition. I'll give it 3 stars.", "q0r": 4, "q1": "The criteria for evaluating feasibility and KPIs are presented sufficiently and feasible. Other possible aspects include a development roadmap, milestones and detailed budget sheets. Video metrics or the number of participants will help us partly reflect the progress of video production, these indicators are quite suitable for community development criteria. My small suggestion is that the team should have a subtitle so that other national communities can also learn and watch the Cardano ecosystem video information.\n\nHow will the proponent argue about distributing rewards to the community of contributors to the Cardano ecosystem in the best and most useful way? This $15,000 proposal plans to develop the Cardano Talk community for Vietnamese in 6 months, so how will the plan be implemented after 6 months?", "q1r": 4, "q2": "The audibility of this proposal is extremely easy. Every week there will be zoom talks about Cardano lasting for about 2 hours, and this zoom session will be recorded and posted on the youtube channel by the proponent, we can follow the progress here or through Zoom sessions to see the quantity. However, there is only one thing that bothers me is that the author has already asked for the proposal of fund 7 and this time - fund 9 is also for contributors to the Cardano ecosystem, so I am concerned about that the team has not worked at full capacity and actually on the youtube channel there is still not a video with enough SEO criteria to create a viral video that is popular and reaches more popular searchers (Because Vietnam is also one of the Asian countries with the highest number of searches for crypto and blockchain in the past few years).", "q2r": 3, "assessor": "z_assessor_3191", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"id": 10949, "q0": "The first is about the impact that is perfectly suited to the challenge. I appreciate your solution. Also, appreciate what you have done from previous funds through the channel systems that you have done. Prove that you have invested time and effort and are running this project with great enthusiasm and seriousness. And this solution is suitable in that the Cardano community in Vietnam or the blockchain community in Vietnam is very young and highly developed in Southeast Asia. Therefore, this is a market that should receive more attention and development. However, in the Vietnamese market in particular and the world market in general, investors are still having problems with the coins being inflated in price, causing the price to fluctuate quite a lot. Meanwhile, Cardano is a system that does everything with real quality and comes to life. Therefore, there is a need for Cardano's official information channels in Vietnam to be able to disseminate more information and investors to have more confidence to keep and continue to support the project. Help bring investors and developers of other projects to participate in Cardano's project more. Therefore, the impact of this project is very good, so it is rated 5 points. Now the solution of this project is also fine because some work have already been implemented and done very well. At the same time, you are doing very well with what they are saying. Therefore, the solution here is considered to be very good. It would be better if they added in the risk section, that there are other risks, for example, related to the accuracy of information. Because this part they will assign to Core team groups and some individuals to learn and present to the community, there should be an additional mechanism for content moderation before presenting to the community. To ensure the accuracy and clarity of information. To avoid possible deviations leading to the community being misunderstood during the presentation process as well as after uploading to youtube later for other members to follow.", "q0r": 5, "q1": "The feasibility of the project is rated 5 stars. The project provides a very detailed and clear plan. The plan is also simple enough to repeat at regular intervals to develop the project. The budget for implementation of the work as well as the people involved in the project is quite clear and at a reasonable level. Therefore, I highly appreciate the feasibility of the budget here. At the same time, the team that implemented this project is very strong. The expert as well as the leader of the project is Mr. Hung. And the system of very large Core teams has been providing quality reviews as well as very in-depth research articles. Very good response from the community. I greatly appreciate the team-based feasibility of this project.", "q1r": 5, "q2": "Finally, the suitability of this project, I rate as 5 points. The current project is providing a fairly effective audit method by measuring the number of Zoom participants as well as the number of topics presented. Because your plan has developed to be quite simple and effective. Therefore, the audit indicators are also simple and effective. This is a factor I appreciate because it is quite easy for the community to track and update the progress of their project implementation. Next, what the project's success looks like, they evaluate giving clear factors. It would be even better if you could add numbers to make it easier for the community to see and evaluate the effectiveness of the current project. There is also a specific time, how long it will take for you to reach the milestone of 100 thousand subscribers compared to the current number of 16 thousand people. And another point that appreciates the suitability of this project, is that they have provided very clear data on how they have used the budget from previous funds. And I appreciate how they use the budget and very effectively deploy the funds that have been funded from fund 7, in a very public and efficient way. Hopefully, this project will continue to receive more funding and support from the Cardano community in Vietnam.", "q2r": 5, "assessor": "z_assessor_3211", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 10960, "q0": "This is a good proposal to stimulate the community to learn and share to each other. I think the problem is articulated very clear and the key metrics and goals aligned with the outlined challenge settings. This project will surely add value to the Cardano ecosystem. One thing that I concern is about the risk section, I think the risk for this project isn't about slippage and too many topics, but the biggest risk is the frequency of the presentations (every week) and the credibility of the presentation. It is important to make sure that the shared material are correct and checked. With weekly presentation, it could be hard to check their accuracy of the material that they shared. It is important to collaborate with Cardano Vietnam Youtube channel. It is good to have this presentation at the official channel. I observed the channel too and I found that the video with the Vietnam language has way more views than English translated videos. I think it is better if the channel could have videos from local language.", "q0r": 4, "q1": "As I see the budget, I think it is important to give community who attends the presentation to get some rewards from their attandance too. So it is not only the presentator who could get reward but also the people who join and listen to the presentation. I think the presentation could have less reward, let's say $100 and there is $100 for 10 people who can ask good questions during the presentation. The learning proses can be more interesting if it could go two ways, rather than one way. It is also help the presentator to be accountable to the community and be more prepared before giving their presentation. I think $200 is a lil bit too much for one presentation. It can be shared some for the member of the community who attends the presentation. I disagree with the slippage budget too. With the fluctuation of the $ADA price, it is better to give the reward in USD. The project manager can sell the $ADA token right away after receiving the fund and later when he need to give reward, he could buy $ADA with the current price that time with the same amount of USD. $2000 USD budget is too much and it can be handled with that strategy. The time table is too packed I think it is easier to have it twice a month. As I observed the channel, FIMI youtube channel, videos with local language (not translated) are not more than 2 videos. I think it is hard to double it right away. It is better to have less, but with better quality and production. ", "q1r": 3, "q2": "The Metrics/ KPIs are good and reasonable. It is important to have English subtitles for videos that will be posted at the channel if this proposal funded, because it is good for the community to check about the credibility and correct information given by the presentators. It is hard to check the videos without good English translation (not auto translate). The measurement of success is not only by numbers, but also by the correct informations shared by the presentators and received by the community. This is a good proposal with clear measurement and goals, but I think it need to be integrated with Cardano Vietnam official channel and community too. It could bring bigger impact if the Cardano communities can grow together and united in Vietnam.", "q2r": 4, "assessor": "z_assessor_3213", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11034, "q0": "Cardano users in Vietnam are increasing, they are looking forward to Cardano documents and news to learn about it. Your proposal has met the needs of the Cardano community by building a reward mechanism to encourage members to learn Cardano's news and documents, and then introduce it to the community. This solution achieves two goals, which is to help the community better understand Cardano and continue to develop the Cardano network in Vietnam. Your proposal has identified a possible risk that is the slippage of ADA and the demand of the community is too great, I think your explanation of how to reduce the risk is quite reasonable.\n", "q0r": 5, "q1": "I find it very confusing that the solution you guys suggested is to build a reward mechanism to encourage members to learn about Cardano's document news and then introduce it to the community, but your solution only mentioned: \" There is a base bonus for a Good presentation and a bonus for an excellent presentation.\" In my opinion, you must develop evaluation criteria to consider and reward (number of participants, quality of interaction in the meeting, survey results after the meeting, spillover effects after the meeting, developing more customers). customers, investors participating in the ecosystem, etc.). The proposal has provided information about the people who will participate in the project, I find the information about the FIMI community is still general, the identities of the members are unknown. It's really not suitable for you to use interns as community analysts of FIMI, I think you have to choose experienced people to be able to see what the community is missing and what it really needs to find. response way.\n", "q1r": 4, "q2": "The fact that you provide indicators to measure the progress of the project is not specific, you can give the expected weekly criteria: The number of spectators attending the Zoom meeting; Number of topics presented and discussed; The number of questions to be interacted with during the meeting; View the uploaded meeting video. Hope you continue to add to complete the proposal, I support you\n", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 11135, "q0": "At this stage, Cardano ecosystem try to attract more users to reach the target one billion users over the world. This proposal not only improves the experience for existing users but also attract more new users in Vietnam. For my part, I agree with the proposer in that the rapidly increasing community size requires that documents and news about Cardano should be presented in a more timely and understandable way. There is no doubt about that language is one of the biggest barrier for those who want to learn more about Cardano blockchain in Vietnam. From my point of view, a large number of users in Vietnam realized that technical documents are really hard to understand, especially the newcomers. In contrast, elite members of the community can present it in a more understandable way to other users in the community.", "q0r": 5, "q1": "To be honest, the probability of success is quite high due to the experience of FIMI's Community in translation and blockchain, especially the founder Mr. Do Manh Hung. He learnt about blockchain, cryptocurrency market in general and Cardano in particular very early compared to others in Vietnam. However, the proposer did not provide a detailed plan in the first month. What I mean here is that I do not know how the recruitment and training process take place. As a result, we can not evaluate the effectiveness in the first month. In contrast, the timeline and key milestones are very clear. Moreover, the proposer provided the detailed budget breakdown which is consistent with the proposal spanning more than 6 months. In general, the estimated cost is quite low but this shows that the proposer manages the budget well. It is worth noting that the proposer anticipated main risks. However, I believe that the solution of the second problem is not really good in the long term. The proposer should request more budget in order to serve the community members better.", "q1r": 4, "q2": "Fortunately, the project is easy to track progress. This is due to the proposal is a continuation of the previously funded proposal. All projects in the previous funds can be tracked and audited. Therefore, we just need to track the project in the same way. As can be seen, the teams in FIMI's Community work very efficiently and transparently. The Youtube channel uploads videos every single day and weekly meetings take place regularly. With proven track records, there is almost no reason to be cautious about auditability of this project. ", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 16, "ne": 0, "ng": 14, "nfo": 2, "vca_o": 1}, {"id": 11230, "q0": "This proposal effectively addresses the challenge as it focuses on the Vietnam community and which is one of the East Asia countries and it is a continuation of a previously funded proposal \"Reward for Community Translators\", which was during Fund 7. In the said proposal, the focus is to build a rewarding mechanism to encourage members to find news and documents about Cardano and then present it to the community. The team plans to have a weekly zoom session to highlight topics that the community is interested in and expand on them. Through their approach, ADA holders will better understand the advantages of Cardano blockchain technology to help them clearly see the VALUE of an asset they are investing in, instead of just seeing the UP-DOWN in price like another coin and kept up to date with the technological progressions made by the team of developers and the miraculous growth of the Catalyst development ecosystem, thereby helping them to have a strengthened belief in the future of Cardano. This indeed does help the community grow as a whole. If one understands more about the Cardano blockchain confidence follows, and this will lead to community growth in Vietnam. Leads to more potential users from word-of-mouth. ", "q0r": 4, "q1": "The team is one of the largest groups of Cardano investors (Fimi) in Vietnam and has researched and analyzed blockchain projects for many years. Do Manh Hung is a Master of financial, is the community manager, Plutus Pioneer, an influence and inspire trainer, and the main lecturer of Fimi's course. The Fim Community was founded by Dr. Do Manh Hing himself and its main focus is to train the general community to know and change their mind in financial and investment management. Since their commencement, they have built a YouTube channel focused on Cardano. In said channel, there are more than 150 Cardano and Blockchain videos uploaded, 15,800 subscribers, above 635,000 total views, and more than 148,00 hours of watch time. The Fimi community is well-built and they are already experienced in informing and educating the Vietnam community. Thus, in regards to the experience, it is highly likely this proposal will be implemented successfully. As for the plan, during the first month after the proposal approval, there is a plan for recruiting and training the core team so that they can present in various meetings and have the first presentation. As for the months following the first month the team has an agenda that would be repeated every week in 6 months. The agendas; community members request their topic, said topics will be assigned to the core teams, and the best presentation for each topic will be chosen to be presented in weekly meetings and Q&A sessions in said meetings. For what the team plans to achieve these plans can most definitely achieve their end goal and the funds would be able to cover all the costs during the process. In addition, as the proposer had a previous proposal funded during Fund 7 and has successfully followed through. Thus, the likelihood of the proposal being implemented successfully is high with the experience and plan combined. ", "q1r": 4, "q2": "The following are things that were said in the proposal on how to track the project's progress and the measurement. The number of attendees to the Zoom meeting that will be held weekly. This metric provides the number of individuals that are interested. Next, the number of topics that will be presented and discussed, this metric would indicate the amount of work the team has done. Then, the number of questions asked during the meetings. This would then provide a metric for community responses on relevant topics. Finally, the number of views on YouTube. This metric will inform if the topic chosen is something the rest of the community would be interested in. These means are sufficient to audit the progress of the proposal. As for the success of the proposal, the following information is provided. The Cardano Vietnam community has one more reliable, fast, and timely information channel, community presenters get an extra income from the rewards for their presentation and the YouTube channel reaches the milestone of 100,000 subscribers. The first and last metric is reliable to measure success. However, the second is not a very reliable source. For the second metric where presenters get extra income, this happens either way even if the proposal does not succeed that individual will be rewarded with income as was mentioned in the allocation of the funds. Overall the success can still be assessed based on the first and third metric provided. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11280, "q0": "This proposal is exciting and suitable for this challenge. The Cardano and blockchain documents contain many technical words that are difficult to understand for newbies, as well as the English language barrier, so the team came up with a solution to build a reward mechanism to encourage members to learn. Cardano news and documents, then introduce them to the community. Topics will be explored and presented by groups through weekly talk shows to raise awareness among Vietnamese about Cardano. This solution is very viable to attract potential users and developers to join the ecosystem. The team also foresees the challenges and risks of undertaking this project, but they also offer solutions. The requested budget for this proposal is 15000 reasonable USD. With the success of the project, new entrants will gain knowledge about the Cardano ecosystem, creating a positive impact in the medium and long term.\n", "q0r": 5, "q1": "This project has a very great chance of implementation. The implementation plan is clear and has specific metrics. The process will be repeated weekly for 6 months after approval, the topics requested by the community will be assigned to the core teams and The best presentation for each topic will be choice to be present in weekly meeting. Expenses for training new employees, awarding awards, consulting fees, etc. are clearly explained. Besides, the group that requested an additional 2000 USD to deal with the risk of slippage of ADA will not have enough money to spend on awarding and paying related parties. The proposal writing team is very experienced regarding Cardano and Blockchain. In 6 years they have built a Cardano community on Youtube with more than 15,800 subscribers and 4 groups learning about blockchain technology. I believe that with these achievements, the successful project will definitely attract more people to join the Cardano network.\n", "q1r": 5, "q2": "The information provided to evaluate the idea is quite complete and factual. Project progress and development are measured through Zoom attendance, topics covered and discussed, meeting questions, and uploaded meeting videos. I appreciate the numbers given by the team, I hope the number of people participating in the zoom meetings will double and the team's Cardano youtube channel will hit 100,000 subscribers. The success of the proposal matches the challenge posed, increasing the engagement of the Cardano community with East Asian residents. This proposal is a continuation of the previously funded proposal \"Community of Translators Rewards\" in Fund 7 and I see this continuation as very possible.\n", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 14, "ne": 0, "ng": 12, "nfo": 2, "vca_o": 1}, {"id": 11368, "q0": "Cardano is a third generation decentralised proof of stake blockchain platform designed to be more efficient alternative to proof of work networks, scalability, interoperability and sustainability on proof of work networks like ethereum are limited by infrastructure burden of growing costs, energy use, and slow transaction times. Each development phase in cardano roadmap is anchored by research based framework, incorporating peer reviewed insights with evidence based methods to make progress and achieve use of application of blockchain network. To utilise the uses of Cardano people in Vietnam are expecting more talk shows as they can stay up to date with news of Cardano . Building a rewarding mechanism to motivate Vietnam people should be encouraged. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has been planned properly in which the first month includes training and recruitment for the team to present in meetings and first presentation and followed by assigning topics to core teams , question and answer in meeting, requesting a topic by community members. The budget is clearly outlined and broken down into idenfiable items . It is reasonable to achieve goals . The proposal offers a realistic timetable to complete the work and plan describes resources necessary to implement the proposal. The team has good experience who is the community manager and main lecturer of Fini's course. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "With the given information we can track the projects progress and can measure them by knowing the number of attendees to meeting every week and number of topics presented and discussed, number of viewers for the videos uploaded and questions during meetings. The plan provides details about the recruiting and training for the core team and presentations. Topics will be assigned to the team and are requested by the community members. Cardano is more reliable, fast and timely informed channel for the Vietnam community. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 21, "ne": 2, "ng": 13, "nfo": 6, "vca_o": 1}, {"id": 11750, "q0": "The “FIMI-Vietnamese Cardano Talk” recommendation fits the challenge setting perfectly. This proposal has not been funded at Fund 8. In Fund 9, there are 2 notable innovations of the proposal. First, the authors add an assessment of the impact of the Fimi Cardano talk show on three target groups: Fimi community members, on this challenge, and on the Cardano community. Second, the project budget is adjusted down from $45000 to $15000. I appreciate the team's effort to update and refresh the information. Here, the solution offered is to build a reward mechanism to incentivize elite members of the community to delve into Cardano. These members will then present to the community to make it easier for busy people and newbies to grasp new information about Cardano. The solution to create a Cardano Talk weekly is honestly not new. In fact, some Vietnamese community groups are also conducting weekly talk shows analyzing and discussing the potential of blockchain ecosystems. However, in the context of the crypto market's recent decline and accumulation, the Vietnamese community tends to invest more time in understanding potential ecosystems for a 2-3 year investment cycle. next. Therefore, I personally evaluate this moment, this is a necessary and timely solution. As a Vietnamese who has been involved in the blockchain industry for 2 years now, I agree and clearly feel the barriers that prevent Cardano from reaching the Vietnamese community that the team raised in the proposal. According to Chainalysis, Vietnam is a country with a special interest in blockchain, especially young people under the age of 30. In 2021, Vietnam ranks highest among 154 countries worldwide on the Crypto Acceptance Index (https://blog.chainalysis.com/reports/2021-global-crypto-adoption-index/) . The potential from the community is huge, still increasing, but we currently lack adequate, official, Vietnameseized resources to disseminate knowledge to a large number of people who love blockchain technology by Cardano. Although, nowadays there are a lot of information channels on the internet, small communities about Cardano also appear a lot on Facebook, Telegram… However, most of the information only focuses on short ADA trading opportunities. term. We lack in-depth, methodical, comprehensive information and analysis on the potential of the Cardano ecosystem. As a result, the community is not fully aware of the long-term investment opportunities with Cardano. This is why I agree with the authors' suggestions. The solution is generally useful for busy commuters. The risks outlined are exhaustive. So I rate 5 points on the impact of the proposal.", "q0r": 5, "q1": "The implementation process of the proposal is 12 months, through the organization of periodic online meetings and presentations in the evening time frame, duration of 2 hours. However, I recommend that authors add event marketing activities within the first month after the proposal is approved. For example, schedule a countdown, summarize the attractive content to be presented, propagate the presentation every week via Facebook, Twitter, website... to spread and attract the community to know and care about the event. This communication activity will create a habit for the community every week. I also suggest that the authors add two-way interactions between the presenter and the community at each online meeting. For example, minigames give rewards on the spot to people who have good questions about Cardano, reward lucky people who interact (comment, like, share…) to the event. This activity will add to the appeal of the presentation. An important point that I am wondering about is the topic of each presentation. The authors introduce \"we currently have 4 core groups\", that is, each week only 4 priority topics are selected for each group to find information and analyze. Then, they will choose a topic that is best prepared for presentation. I would like to ask, in case there are too many topics from community members, maybe 10, 20 topics or more, so what are the criteria for the authors to choose 4 priority topics for distribution work for 4 groups? I suggest the authors need to clarify the flow of this problem. For example, every week they need to statistic the number of topics requested by the community, categorize topics (market news, technical topics, etc.), and make a public vote on the top 4 favorite community topics. (voting takes place on website, telegram). Why do I suggest this? Because I want to make sure that the topic presented at each meeting is also the most engaging topic, most loved by the Cardano community in Vietnam. In Fund 9, the proposed budget reduction is only 1/3 of the total funding applied at Fund 8. In which, the biggest reduction is the cost for community members to be reduced to $3000 (the old level was $18000). Cause, due to the reduction from 3 supporters per month to 1 supporter per month. The remaining expenditure items are kept the same name, but all costs are reduced from -40% to -200%. As for the reward section, I suggest that the authors build a more flexible reward mechanism for the presenter. Here, the authors propose a fixed $200 per week bonus for presenters. I suggest building three levels of rewards: excellent, good, and bad. The community will be the one to vote for the award. Excellent will get $300, good $50. Excellent presenters will deserve higher rewards. This will encourage the presenter to be more creative, more interested, and more engaged with the project. About the team, FIMI founded by Mr. Do Manh Hung is a prestigious community that has built its own brand for 5 years in Vietnam in the blockchain industry. This blockchain lovers can monitor and verify through FIMI's information channels in Vietnam (youtube, telegram, website). However, I rate 4 points for feasibility due to the deduction of -1 point due to the points that need to be added and clarified above.", "q1r": 4, "q2": "Regarding the auditability of the proposal, the team mentioned audit items but lacked specific measurable indicators. For example, the author mentioned that the YouTube channel reached 100,000 subscribers, but did not specify how long it would take to reach this number. I am inferring that the proposed plan is 6 months, so this target number will be reached in 6 months. The number of spectators attending the weekly zoom meeting is also unknown. Communities need metrics to be as specific as possible. From there, it is possible to measure the success of the proposal through the success metrics that grow every week: the number of views followed, the amount of interaction at each zoom session... Therefore, I see the ability to audit of the proposal is possible but not clear and complete. I rate this item 4 points.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 11872, "q0": "It can be seen that you have prepared quite well for this project. You come up with some problems and solutions to those problems. You also created a Youtube channel to serve this project. I highly appreciate that. However, I think one thing that can stop you from making a successful project is how do you get people to join your talkshow? You've built a reward mechanism to incentivize elite community members to present about Cardano, but haven't built a solution to incentivize newcomers to the talkshow. This is a pretty important issue in most talk shows that take place in reality.", "q0r": 4, "q1": "Your team is led by Mr. Do Manh Hung, a master of finance, with extensive experience in Cardano. It can be seen that this is a very potential team, I also want to know more deeply that Mr. Do Manh Hung graduated with a master's degree at which university? What industry specifically? for a deeper understanding of his abilities. Other than that, I found the build team budget table to be quite reasonable. As for the progress of the project, I would like you to clarify and be more specific, because it hasn't really stood out yet.", "q1r": 4, "q2": "I think the indicators you set out are reasonable, but I urge you to set specific KPIs to strive for more. For example, in the first talk show, you set a milestone of 200 people, then gradually increase the milestone by week, 250 people for the second talk show, 300 people for the third talk show,... Well. This project is more complete than your previous project, I believe you will be successful with this project.", "q2r": 4, "assessor": "z_assessor_3309", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 11898, "q0": "The proposal is fully aligned to the challenge statement as it intends to build a rewarding mechanism to encourage members to dig deep into cardano and present it to the community in Vietnam. \n\nThe proposal justifies that it is a  strategic plan to invest, because there are users who struggle to understand cardano documents, technical words and information also there are users who prefer verbal presentation over written document for better understanding and with this project it is highly likely that there will be an increase in the number of users in Vietnam and immense growth of cardano community in Vietnam . \n\nI found it interesting how this project will have a huge influence on both community and cardano ecosystem that is, they just don't intend to only create talk shows to provide news or document translation but gives ADA holders better understanding of cardano block chain technology advantages and strengthen their belief in the future of cardano.In addition to this it will promote cardano technology and get more developers in the ecosystem and  thus it clearly articulates how it adds value to the cardano ecosystem. \n\nThe Proposer is greatly concerned in providing all the details regarding understanding of the meetings, about subjects that meetings would cover, how many meetings can go into practice, who would  present each meeting, also about rewarding criteria, this even shows their ability to scale to address future challenges as well.\n\n\nThe proposal has presented clearly a short discussion on the potential risks and challenges that might occur during the development along with all possible solutions to overcome them. \n\nOverall the impact of the proposal is high and fits in very well with the challenge and thus I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The author has specified details regarding who they are. There are details of only founder Mr Do Manh Hung. The other team members details are not specified in detail . There is lack of evidence to authenticate their experience or expertise . It would have been better for the proposal if they provided certain links like their LinkedIn or Twitter profiles. They provided us with some videos but as they are not in English we can't really understand them clearly. So there is no assurance with the experience and expertise of other team members and thus it is uncertain as to how well experienced or qualified they are for executing the proposal .I believe the level of detail here is very low. \n\nThe plan and time frame is stated  for first month and after first month the tasks that will be repeated every week in next 6 months are also outlined very well .I would just like to suggest that tasks/activities should have been mentioned on a weekly basis which would eventually help in monitoring the growth of the proposal.\n\n\nThere is a budget breakdown that ideally elaborates how well money would be used ,as they split the total amount with clear details about each part ,which ultimately gives an accurate understanding of it. The proposal will require additional funding for improving reward system in next funds .So They will return to catalyst again for funding. \n\nThe proposal has considered challenges and risks, as I stated above,   relevant to successful implementation. \n\nI believe this proposal could have a bit more detail in describing the team and backing up their ambition and with this reason I'm not certain with the level of feasibility here. So I neither agree nor disagree that this proposal will be implemented successfully and so I give 3 which justifies it.", "q1r": 3, "q2": "The proposal has provided all the key metrics that can be used to track project's progress. All the key metrics are realistic and achievable. \n\nAs stated given matrix will be uploaded on the funded report file which will help in monitoring the project. If the tasks were divided on weekly, it will certainly help the auditors to track the proposal's progress on weekly basis. \n\nOver all I believe there is clarity in the problem, solution and in their alignment with this challenge. All the metrics and deliverables are clear and objective.\nHence I strongly agree that there is sufficient information to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 12260, "q0": "The proposal to build Cardano Talk in Vietnam will be a place to share and discuss topics related to the Cardano ecosystem through weekly Zoom meetings. Participants will listen to presentations from the core team of the Fimi community, directly ask questions during the meeting for answers or discussion. This is a pretty good and effective way to provide insights and knowledge to participants in the Cardano community, especially when the Covid-19 epidemic is still happening in Vietnam, such online meetings will make sure everyone is safe and anyone can participate. Before an online presentation takes place, any member of the community will suggest a list of topics they are interested in and want to know about. This poses the challenge of the large number of different topics proposed. The proponent offered a solution of choosing only the most important topics, but this solution is quite vague, I wonder who should evaluate the proposed topics, and what criteria are given out for evaluation. The community has many members, each member has many suggestions, creating an exponential number of topics that want to be explored and covered, making it difficult to filter out topics to talk about. I come up with an idea to overcome this problem that is every week 4 core teams will research, explore and propose 2 topics/team and create polls for community members to choose. The four most voted topics will be explored and researched for online presentations.\nI also add some risks that the project is likely to encounter, which is the problem of the network connection system, unstable wifi, unsecured technical equipment. Online meetings will not go well if the network connection is broken or weak. Project implementers should prepare well the network system and technical equipment to ensure the online presentation.", "q0r": 4, "q1": "The information is introduced quite fully about the Fimi Community, the youtube channel \"Tai Chinh -Tam An\" with certain statistics is quite good, and this project has previously received funding in Catalyst ( fund 7), which is the premise to have confidence that the project will continue to be funded and successful. The proponent provides a plan, the progress of the proposal for the first and 6 month period. However, the plan is not really detailed and complete, if possible, provide a way to inform the community about the topics that will be presented in the future, and at the same time provide communication information and promotion so that community members feel interested and want to join the meeting.\nIn the detailed budget breakdown, $3000 is used to pay community support members with each member being paid $500/person/month, equivalent to $3000 for 6 months. Based on this parameter, does the community only have one support person? This is not reasonable and the proponent should calculate more. The core team of the community is divided into 4 groups with 10 to 20 members, there is also a cost to pay for these members when they work, research topics presented in the community.\nIn addition, the information of participants in the project is provided quite enough, it will be more convincing if the proponent can provide authentic evidence of Mr. Do Manh Hung's educational and professional qualifications.\n\n", "q1r": 4, "q2": "This proposal provides provisional information sufficient for evaluation and examination. Project metrics and progress will be uploaded to an online file that can be audited by anyone. The indicators and goals set out are quite important and appropriate to evaluate the success of the project. However, I look forward to providing specific numbers for each of the goals set for an objective, realistic, easier-to-follow assessment.", "q2r": 4, "assessor": "z_assessor_3376", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 12387, "q0": "This proposal brought up the issue of the imbalance between the increasing number of Cardano users in Vietnam and the amount of communicated Cardano documents and news that are easily digestible by the community. The proposed solution is to hold a weekly talkshow (primarily targeted at the Vietnam demographic) in an online meeting platform presenting news regarding Cardano and its ecosystem for 2 hours that will be uploaded in a YouTube channel later. The proposer provided some example topics that are going to be presented in these weekly talkshow, such as technical documents (Hydra, smart contract, etc.), Cardano update (Cardano 360, Hoskinson’s update livestream, etc.), and market news. The aim of this solution is to provide more information and updates about Cardano so that the community can be more informed on the state of the Cardano ecosystem. I think this proposal can add value by raising the community knowledge level by educating Cardano users about updates in the ecosystem since blockchain is a really fast moving field and with more people getting into blockchain and Cardano, the amount of information might be hard to take in for the average user. However, this project lacks the aspect of “raising the awareness levels of regular people in East Asia about blockchain and the Cardano network…”, which is the challenge setting objective, since it’s primarily targeted at people already using Cardano instead of growing Cardano’s outreach to more people that are still unaware of the blockchain and Cardano ecosystem. ", "q0r": 4, "q1": "The team is lead by the founder of FIMI who has experience with Cardano, such as the Plutus Pioneer. The team has also worked on translation project translating Cardano and blockchain videos to Vietnamese as well as conducting short courses regarding blockchain and crypto. In the proposal, there was an attached website showing the team’s past project regarding blockchain and Cardano. This shows that the team members have the relevant skills that are needed to implement this project. \n\nThe roadmap provided is pretty simple going over the training of the core presenter teams for the talkshow as well as preparing for the first presentation within the first month of the approval. Then for every week in the next 6 months, the content cycle will repeat with gathering news regarding Cardano and topics request from community members, creating the presentation, choosing the best presentation on each topic, holding the weekly meeting, as well as conducting Q&A in the meeting. Overall, the timeline seems reasonable to be completed in a weekly cycle.   \n\nThe budget of 15000 USD has been requested for this project and has been broken down into several items. This includes the training for the core presenter team, video editing (50 USD per video), presenter rewards (200 USD per week), consultant fee and backup funds in case of ADA value going down. However, some of the items in the budget lacks explanation or justification. For example, 2500 USD was requested for training for the presenter team however it lacks information, such as the total hour needed to train the team, and the hourly rate requested for this training, etc. Another example is the 3000 USD “fund for supporters” aspect of the budget, this might be lost in translation since the proposal was auto-translated into English but I personally don’t get what the proposal meant by “supporters”. Is it some sort of giveaway for the viewers of the meetings? Overall, I think the budget has been broken down adequately for some items but there were ambiguity or lack of justification on some of the items as well.\n\nAll in all, I’m in neither agreement nor disagreement over the feasibility aspect of this project since the team members involved in this project have the skills needed, the roadmap is well laid out and seems realistic to achieve but some of the items of the budget lacks explanation.", "q1r": 3, "q2": "The KPIs chosen as a way to measure the success of this project include metrics such as the “number of attendees”, “number of topics presented”, “number of questions during the meeting”, as well as “number of views each video got on YouTube”. The metrics chosen by the proposer were well defined and relevant to measure the success of this project regarding the outreach the project has via the number of attendees and views on YouTube, the amount of produced content via the number of covered topics, as well as the interactivity of the meetings by the amount Q&A exchange. I’d have liked if there was also a metric to measure the quality and reception of the presentation which can be done for example via feedback form giving scores on how interesting the topics are, how good is the delivery of information, etc. Other than that, I think the KPIs are suited to measure the project performance. ", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 13, "ne": 5, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 12462, "q0": "The project effectively addresses the challenge. Vietnam is in the top 10 in the world in terms of cryptocurrency ownership according to data from cryptocurrency payment company Triple-A. In addition, the cryptocurrency trend in 2021 made a huge impact on this country of nearly 100 million people and opened a new type of investment for the Vietnamese. Millions of Vietnamese people who every class are holding or trading crypto now including ADA and will there be millions of potential ones who want to jump into crypto in the next few years. However, the number of people who have a good understanding and awareness of cryptocurrency is very few. They just follow the trend and put their money on something they don’t know or even never heard of. Cardano is huge and in the top 10 cryptocurrencies but there are not so many Vietnamese who are well understanding it because Vietnam is not an English-speaking country so it is very hard for people knowledge and access it. Furthermore, there are tons of fake projects silking and scamming people. The key objective of this challenge is to help to grow East Asia and ADA community in East Asia. So this proposal is to give people a new reliable channel, and an easy way to get to know exactly about Cardano. It is kind of a trusted ADA information hub for Vietnamese to keep up to date and better understand the advantages of the Cardano blockchain. Vietnamese people do need an official information channel like this project. Therefore, this proposal is a very good and helpful idea to grow a better and stronger community, especially an ADA one. I strongly agree with this proposal. ", "q0r": 5, "q1": "I highly appreciate this project. The proposer has planned everything in detail such as recruitment, estimating budget, operation process, and media channels. Providing clearly team information, experience, and qualifications. The proposal shows how the funds will be used in detail for each specific job and the timeline of development with growth evidenced by numbers of audiences, topics and even uploading meeting videos. Additionally, the network infrastructure in Vietnam is one of the best in the region, which is covered all over the country. The team has already built up from channels like the website, and telegram to a youtube channel with over 15 thousand subscribers. That's so cool. Furthermore, this proposal was successfully invested in the last fund proving lots of voters are on the same page to this so you can see how feasible it is.\nSmall point, please add English subtitles to all videos so if there are any foreigners who want to have a look they can get what the videos are about and should improve website speed.", "q1r": 5, "q2": "The project is easy to be examined by the number of videos uploading, subscribers, views, and telegram members. All those figures will tell how the project and the ADA community are growing that is a visible picture and “a picture describes a thousand words”. Process and milestone are obviously with ambition 100000 subscribers on the youtube channel seem the team really put their back into the project. Nevertheless, the timeline to reach the milestone is not outlined specifically that would be better if it is in plan with a specific timeline so the team and voters can imagine and keep up to date with the project.", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 12590, "q0": "Suggestions that match the challenge, chat shows so they can stay up to date with the news and get their questions answered about Cardano are essential, even when I was just starting out with Cardano, I already found it difficult to get used to them because the technical documentation about Cardano and blockchain contains many technical words that are difficult to understand for newbies.\nThe reward mechanism is a potential idea to promote the learning of newcomers to the Cardano ecosystem, which further builds the community and grows the ecosystem. Rewards are given for good presentations of presentations, I suggest organizing more activities or events, knowledge contests and applying rewards. This contributes to the diversity of the reward mechanism.\nIn Vietnam, people seem to be familiar with Crypto, so the project with the goal of bringing them to Cardano is extremely potential. And I believe in the huge impact that the project will have if it is funded.", "q0r": 5, "q1": "I think I can be confident in the feasibility of the project, the background information and experience of the team are listed clearly and in detail. As far as I know, the group owns a large community that is focused on education about Cardano and ADA Staking activities, related projects have also achieved certain success, so This project has a very great chance of implementation. The project's roadmap is also reasonable as all the preparations will be completed in the first month, and in 6 months will hold repeated weekly presentations. This is really easy to understand and I think through many presentations, meeting organization skills will be perfected.", "q1r": 5, "q2": "The proposer outlines how the community can track project reports and surveys through funded reports. As for the metrics to measure project success, I suggest you should have the number of good and excellent presentations paid out, this gives me a more solid view of the situation the quality of the meetings and the effectiveness of the project. I have no opinion on this part, I think the goals you set forth and the transparency of the project are satisfactory.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"id": 12659, "q0": "The proposition that needs to be addressed here is that Cardano users in Vietnam are looking forward to more talk shows so they can stay updated with the news and have their questions answered about Cardano. This proposal will add value to the Cardano ecosystem by Building a reward mechanism to encourage members to learn Cardano news and documents, and then introduce them to the community. The proponent proposed the following solutions: Build a reward mechanism to incentivize the elite members of the community to dig deep into Cardano then present it to the community to help busy people and newbies capture new information about Cardano easier. The talk show will be held weekly in the evening time frame through the Meet Zoom program, lasting 2 hours. All meetings will be recorded and uploaded to the FIMI youtube channel. To expand the scale of the project, the proponent already has 4 core groups and will develop a few more. Every week, any community member will propose a list of priority topics they are interested in and want to know about. Each core team group will take on a topic on the list. Then, they will go together to find information and analyze those topics. The core group with the best preparation with the most information will be selected to introduce to the community through a Zoom meeting. There is a base bonus for a Good presentation and a bonus for an excellent presentation. I believe that with the above core forces, the project can scale up by increasing core teams and effectively solve future challenges, with the impact of this proposal I believe 5*.", "q0r": 5, "q1": "The proponent has provided evidence of the relevant skills and experience required to implement the proposal. Mr. Do Manh Hung (Master of Finance) is the founder of the FIMI community.  built a youtube channel dedicated to Cardano. Gain: Over 150 videos.Over 635,000 views. Over 148,000 hours of viewing. is One of the largest communities of Cardano investors in Vietnam that has been researching and analyzing blockchain projects for many years. Over the years, the core teams have continuously shared their knowledge of Cardano and its ecosystem that they have analyzed with the community. The proponent now has 4 core groups with 10-20 members each, they have done information research and organized online zoom sessions to share with the Fimi community. these meetings have been uploaded to youtube according to the links attached to the proposal. verifiable. Specifics: Proposer Estimated Cost $15,000: $200 Video Editing,$3,000 Community Members Support,$4,800 Presenter Bonus,$1,500 Consulting Fee. To prevent the ADA price slide from affecting the referral reward, they have applied for additional funding of $2,000 equivalent to about 13% of the total funding. I think this contingency budget is a bit big. but given the volatility of the crypto market, it is still acceptable. but I think it would be better if it dropped between 5-10%. The proponent gave a realistic timetable for implementing the project in 6 months as follows: In the first month after approval: Recruiting and training the core team to present in the meetings. they will present the Presentation for the first time. After the first month: The following process will be repeated weekly for 6 months after approval: Community members request their topics. Topics will be assigned to core groups. The best presentation for each topic will be selected to present in the weekly meeting. Questions and answers in the meeting. The proponent has considered the risks and proposed specific measures to address those risks to implement the project successfully. With the information given I completely agree this proposal will be successfully implemented.", "q1r": 5, "q2": "The proponent has provided a 6-month implementation roadmap with specific milestones to be achieved that are clearly stated, looking at the progress of the project can be checked. When the project is implemented, the Cardano Vietnam community has an additional reliable, fast and timely information channel.\nCommunity presenters get extra income from their presentation rewards.\nThe Youtube channel reached 100,000 subscribers. however, I would like the proponent to be able to provide more detailed, specific timelines of the time each achievement will be achieved. The proponent provided metrics The number of spectators attending the weekly Zoom meeting. The number of topics covered and discussed.The number of questions in the meeting. View the uploaded meeting video. and I believe they are good indicators of the success of the proposal. The proponent has clearly described the problem Cardano users in Vietnam are looking forward to more talk shows where they can stay updated with news and have their questions answered about Cardano. This proposal is a continuation of the \"Community of Translators Rewards\"  sponsored at fund7. I have actually checked the work they have done according to the commitment in the proposal. I can see the amount of translated video content and can see they work extremely seriously. That's a plus about the group's reputation. and also gave specific, clear, and understandable solutions to solve the given problem.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 12710, "q0": "In the Vietnamese market, the group of people who know about Cardano coin, blockchain, and ADA, ... Very little. And the group of people who want to learn about it is increasing. There are not many documents for Vietnamese people. So this proposal is a good idea for those who want to learn and get involved in the field. However, talkshows conducted only through Meeting Zoom will be limited in the number of people reaching out instead of doing talk shows on other platforms. ", "q0r": 4, "q1": "This group of proposals has a lot of experience, understanding of Cardano and Blockchain,... They have also made significant contributions in this area to the community. Therefore, the proposal to be successfully implemented is completely feasible. However, there are still a few small unanswered questions: Where will the community ask the group members? For those who are completely new, how can you access the talkshow? And through where?", "q1r": 4, "q2": "The proponent provides ways to measure project progress in great detail and specific for each timeline and the whole project within 6 months. I think it would be more transparent and effective if there was a measure of the quality of each video the team posted and the rewards worthy of the presentation of the person who made it. In the proposal I have not seen how to measure and reward this.", "q2r": 4, "assessor": "z_assessor_3469", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 12850, "q0": "I strongly agree that this proposal effectively addresses the challenge. The solution of the proposal is to update information about Cardano regularly, quickly, and understandably in the form of presentation to the Vietnamese community, thereby helping to develop the Vietnamese community in particular and the East Asian community in general. \nVietnam is a country with a population of 99 million people, ranking 15th in the world and 3rd in Southeast Asia. Therefore, the development of the Vietnamese Cardano community will have a great impact on the world Cardano community.\nThe goal of the project is to share information in the form of attractive and easy-to-understand presentations, which help to attract a wide range of viewers, such as newbies, developers, Ada holders, etc. This is a good point because we need to reach out to beginners, and newbies including those who don't have a technical background to expand the community quickly. \nBecause of the above analysis, I give the project 5 points in the Impact category.", "q0r": 5, "q1": "I strongly agree that it is highly likely that this proposal will be implemented successfully.\nFirstly, the core team of the project has many years of experience in researching and analyzing blockchain projects in general and Cardano in particular. They have a website and a youtube channel that shares a lot of useful information and knowledge about Cardano with high viewers. \nSecondly, they had an approved proposal in Fun7 about translating and providing information in the form of a document, so they have experience in implementing a similar project. \nFinally, the timeline, division of human resources, and finance are planned clearly.\nHowever, in the detailed implementation plan, the proposer should consider whether to do multiple presentations and then choose the best one to present, or just focus on preparing for one. Preparing multiple presentations could be labor-intensive. In my opinion, first, choose presenters with knowledge and experience that are relevant to the topic and then focus on only one presentation.\nI rate the Feasibility category 5 points.", "q1r": 5, "q2": "I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. Metrics used to measure project progress are clear and easy to check, for example, number of presentations, number of topics presented, number of audiences, and number of views. \nHowever, the proposer should consider providing some quality indicators such as the number of good presentations / excellent presentations, and the rate of increase/decrease in audiences/views after each month…. This helps to evaluate the effectiveness and success of the project.\nBecause of the above analysis, I rate the project 4 points in the Auditability category. I hope that if the project is funded, the proposer will make adjustments according to my advice so that we can evaluate the proposal's success more clearly and effectively.", "q2r": 4, "assessor": "z_assessor_3494", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 12870, "q0": "FIMI is a large information channel in Vietnam that covers many topics, ranging from macroeconomics to news updates, project analysis, and summary translation of CH Livestreams. This channel has a very solid reputation and is very powerful. Motivating the core groups of a department that consists of many groups specializing in researching the Cardano ecosystem and then sharing their findings with the community in order to assist the community in gaining the most comprehensive and up-to-date perspective possible on the progression of blockchain technology. in addition to Cardano is required and appropriate for the challenge that has been posed. The weekly monitoring and listening to information, in addition to asking questions that I do not really understand, which the groups will answer after carefully studying the projects, makes me feel very excited. It demonstrates to the community not only the consistency of the Cardano ecosystem but also the consistently increasing power of Catalyst over the course of its existence. The proponent of the proposal mentioned two difficult things when conducting live sessions as well as ADA's price slide which led to the allocation of capital to team members when discussing the risks and difficulties associated with the proposal. excellent, as well as strategies for overcoming the challenges and dangers involved. To a perfect T, I agree. This IMPACT gets a score of five points from me.", "q0r": 5, "q1": "Mr. Do Manh Hung, a pioneer in Vietnam regarding blockchain as well as the Cardano ecosystem, is the person in charge of FIMI. Within FIMI, there are three main core teams that specialize in blockchain research. In addition, there is a community that is comprised of members who are very good and very active in the field of blockchain. There are a number of domains connected to blockchain technology and the ecosystem surrounding Cardano. Concerning the comprehensive plan that the author has provided for the proposal, which includes work that is carried out in cycles and repeated once every six months to facilitate training, recruitment, and talks on topics related to Blockchain and Cardano. With regard to the Vietnamese people's living standards, income levels, and income from the military, I believe that it is reasonable, taking into account the cost levels for each item, the amount of time involved, as well as the amount of work that must be done per hour. Regarding the project team, as I mentioned earlier, this is completely a miniature community of the Cardano ecosystem. It consists of groups and communities in which the members have a very deep understanding of the Cardano, Catalyst, and Blockchain ecosystems. If you work with this team, you will undoubtedly finish the project in the most effective manner, which increases the likelihood that it will be funded. I give this feasibility 5 points.", "q1r": 5, "q2": "The author provides the parameters for the community to monitor and comment on through various social media channels as well as through videos uploaded by the author to YouTube. This allows the community to observe the progression of the project as well as the responses from the community. The community surrounding topics that have been voted on in the past is excellent. by means of which the community can gain new information and insights regarding the Cardano ecosystem As a result, this will assist presenters in increasing their income from the rewards they receive for their presentations. And the author also set the subscriber milestone for the group's YouTube channel at 100,000 subscribers after six months, and while I don't believe it will be impossible to achieve that goal, I do believe it will be possible. Therefore, I will award 5 points for AUDITABILITY.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 17, "ne": 1, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 13047, "q0": "Vietnam is a fast-growing country in Southeast Asia with a young, tech-loving population. As finance / digital transformation / crypto issues are more and more popular, more and more people know and are interested in virtual money / block chain. But most Vietnamese people do not understand English well, so accessing and learning about blockchain still faces many difficulties. In addition, the information about cryptocurrency scams is so much that many people have a bad view of blockchain even though cryptocurrencies are only one part of the blockchain. Opening talk shows like this will help improve people's understanding of the blockchain or more specifically, the CARDANO platform, from which it will be possible to make more contributions to the CARDANO ecosystem. Raising awareness and understanding will also help people avoid being scammed.", "q0r": 4, "q1": "Projects with high feasibility:\n1. teams are composed of many members whose knowledge, skills and experience are also mentioned.\n2. in order to give talk shows about CARDANO, core teams must spend time and effort to research and learn about the topic. Rewarding good presentations will motivate members to give better presentations that are easier for everyone to understand and access.\n3. organizing meetings on Zoom is very convenient, everyone just needs to have a device with access to Zoom and internet to participate. On Zoom, you can also share and record the screen to make recording easier. Learning through Zoom without having to go to offline sessions also helps members be more active in terms of time. Offline learning can also be done from the Kovid.... When there is a problem, the internet connection is the most affected.\nI have a question that what is the topic of the presentation in the first month? For those who are just starting to approach CARDANO or for the community.", "q1r": 4, "q2": "Based on the information provided, it is enough to auditable the implementation and results of the proposal. The proposal can be objectively measured based on the number of participants and the number of questions in the meetings. The proponent made it clear from the start that these are meetings to share information and support the development of the Vietnamese community with the Cardano platform in a sustainable way.", "q2r": 4, "assessor": "z_assessor_3550", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 13343, "q0": "\"Build a rewarding mechanism to encourage elite members of the community to dig deep into Cardano and then present it to the community to make it easier for busy people and newbies to grasp new information about Cardano.\", this suggestion is very practical and I like it. \nAnd Vietnam is a developing country, with young human resources with a lot of positive energy, has a lot of contributions to expanding the Cardano network in East Asia, this proposal is perfectly suitable for the challenge posed. Topics covered include: technical documents, Cardano updates, market news that will be selected and condensed by your team members with the most necessary and useful information. are the real values that the Cardano community in Vietnam needs.\nBecause without a re-translator, newcomers or even those who already know Cardano will still not be able to fully understand the content because there are some technical terms and technical terms that are difficult to understand for them.\nYour team has many years of experience in operating pools, knowledge from basic to in-depth in the Cardano ecosystem is a plus.\nAnd with a large population of ~100 million people along with a rapidly growing IT force in Vietnam, promoting Cardano with the values that Cardano brings will attract more talent, contributing many interesting and high-value initiatives, contributing to the ever-growing Cardano ecosystem.\nWhen going to the website fimi.vn, this is a website for Vietnamese people, and provides a lot of valuable information such as how to install Deadelus wallet, how to create a Deadelus wallet address, how to withdraw ADA from exchanges to Cardano wallet, instructions related to operating pools, stacking.\nI appreciate your proposal, and hope that it will be successful and develop a strong Cardano community and promote the good values that Cardano brings.\nI have a small suggestion to improve the user experience at fimi.vn that is:\n - Upgrade server (Hosting, VPS, Cloudserver...ect) for faster page loading speed\n - In the footer: should add a small section such as CONTACT with us, then you leave the link (shortcut) like: youtube, Facebook, ....ect, then there will be More connected and professional, also better for SEO.", "q0r": 5, "q1": "The information about the team described in the proposal is not detailed, although your team is one of the largest groups of Cardano investors in Vietnam that has researched and analyzed Blockchain projects for many years. The years and experiences described and the work done to show that the team is fully capable of developing this work.\n- Therefore, it will be more wonderful when the information of each team member is introduced about their educational background, experience in the field links to their personal pages such as Linkedin, Twitter ... will let the community understand more about them and the strengths of your team members.\n- The plan is divided into 7 months by you, including the first month to prepare and the next 6 months to act according to the process that is repeated weekly after approval, in general, the tasks are divided into clear and specific planning, the plan itself does not require technical difficulty and there are no barriers that require programming but just steps to organize and provide information.\n- The detailed budget table for the proposal is divided by you into 6 sub-categories, in which the third item is \"$3000 supporting community members ($500 x 1 supporter per month)\", this part I don't understand It's very clear and confuses me a bit, Can you explain a little more about this for me and the community to better understand, although this is vague to me, I still believe this is my favorite expense. reasonable requirements with the organizational experience your team has performed.", "q1r": 4, "q2": "- Parameters such as: the \"number of people attending the weekly Zoom meeting\", \"number of TOPICS presented and discussed\", \"number of questions in the meeting\", \"number of video views\". talks uploaded to Youtube\" has shown a clear management in describing what to measure to track your project's progress.\n- One thing I really like about your group that few groups have is that the report file is published to a file like Google Sheet so that the community can easily track and measure the progress of your project. This is very transparent, I appreciate this.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"id": 13690, "q0": " I found this proposal very interesting and smart in terms of the way it motivates people to contribute for the needs of the whole community. It states that more talk shows are requested by the Vietnamese community as it has so many questions about Cardano and needs it to be solved. Therefore the initiative of building a reward mechanism to attract contributors has come up. To be honest, one of the obstacles in developing the project with our blockchain is the lack of quality resources. In other words, I think it’s because they don’t  know how the project can benefit them therefore they hesitate joining it. This states a problem for the pioneers of how to make contributing for the Cardano ecosystem interesting and at the same time creates more value for the community. I think that having research that makes it clear and proven how to proceed in these situations will be extremely useful for Cardano and will certainly develop for a future. Now let’s talk deeper to the impact. According to the proponents, the fast increase in the community size demands the in-time Cardano documents presented in an understandable way. Besides, there is much news about Cardano published everyday and it contains technical terms which are hard to understand without interaction with others. Because of that, it causes a high demand for full-time translators who can verbally present the news and explain the technical words in an interesting way. With what the proposers have outlined, I find those are solid and well-founded arguments with quantitative data to prove that if solved, there may be an impact on not just the FIMI Vietnamese community but also the (East Asia) Cardano community due to its practicality. Not just so, based on what they mention I assume that Cardano's awareness will be expanded leading to more people contributing ideas for the Catalyst Fund and diversifying the creation in Cardano ecosystem. During reading the solution and risks they might face, it is generally described with easy-to-understand terms and thanks to that, I have an overall image of the way they deal with difficulties. I believe it is a signal to show that they have a deep understanding about the project they are doing and will have a plan for any cases happening. For such  strong and logical arguments, I am convinced and rate high for the impact part of this proposal. \n", "q0r": 5, "q1": "Let's look into the script. I think the information that is given is extremely rich and explains in an extensive and detailed way what would happen during the project development process. There are milestones highlighted for example: their first month after being funded will be recruitment; The project lasts for 6m, weekly meeting for 6m. They state in a very specific manner what targets are included in every month which are divided into small tasks repeated every month. I understand that there will be topics requested by the community. After that, the core teams will take over it and start researching. The best research then is presented in weekly meetings and has time for Q&A from the members. So I think the script gives me a full comprehension of the work for example what would be done and how, making me feel like I am joining their talk show at the moment. Let’s move to the budget of this proposal. The requested fund is $15.000 which accounts up to 6% of the whole challenge. However, this amount is reasonable compared to the complexity of the work. There are expenses needed to pay for example the recruitment fee, training fee, editing videos, supporting fee and so on. The budget plan is distributed into 6 categories of work with specific spending for each category and comprehensively outlined therefore I understand how much money is used for what task. We continue with the project members. There are 1 project leader and 3 core teams clearly stated. They have full confidence in them because we are aware of their professional backgrounds. The project manager is a Master with over 10 years of expertise in finance and investments, as well as over 6 years in technological and blockchain (Cardano) areas. Additionally, he is the direct instructor for more than 15k members' blockchain classes. He provides quantitative data on his accomplishments, which are simple to verify on his Youtube account and Telegram. His coreteam demonstrated to me that they had extensive knowledge of both translation and blockchain technology, particularly Cardano. I believe it is simpler to manage the available resources and the produced goods when the tasks are explicitly assigned to each team member. I learned from my investigation that Fund 7 previously provided funding for this FIMI project cince a very long time ago, they have had more concepts and projects in the works. As an illustration, they run their own website, have thousands of members in their Telegram groups, and have a YouTube channel with over 15,000 subscribers. If there are other suggestions and projects of similar such, I just wonder if they could elaborate a little more on how they would handle their workload. The other thing I hope would be made obvious is how the project manager may select the best presentation to give. In conclusion, this component has a very high feasibility.\n", "q1r": 5, "q2": "The proposal outlines four methods in which this project's progress will be checked while it is being developed: the number of people who attend the weekly Zoom meetings, the subjects that were given and discussed, the questions that were asked during the meeting, and the views of the talk's YouTube video. I can see that the measures are straightforward and are easy enough to be used with manual methods. However, I anticipate that these figures will be formed in a set of KPIs so that we may base our efforts on a bit more qualitative data. He also explains to me the goals of the reporting. In other words, all the methods for measuring, analyzing, and reformulating the project are described, making it crystal apparent to the Cardano Community what should be prioritized as the various project phases move forward. As we move on to the outcomes, they provide a more thorough explanation of what would need to be accomplished (without, for instance, setting specific goals), but they also provide the following details of what to anticipate: \"Cardano Vietnam community has one more timely, accurate, and dependable information channel (1); community presenters get more money from the prizes for their presentations\" (2). For the transparent and logical statement they’ve made, I think it’s very crystal and trustworthy in this auditability part", "q2r": 5, "assessor": "z_assessor_3750", "no_vca": 11, "ne": 5, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 13806, "q0": "In order to effectively address the challenge of growing Cardano by growing the East Asian Cardano Community, this proposal will need to make a few adjustments. Having a more clear and simple channel of community within the Cardano Community seems to be the core issue of our challenges if we want to continuously grow and expand. Nevertheless, it’s not just a question of having a clear and understandable language, having audiovisual content that might explain and answer basic questions, but to design a strong communication strategy that reaches out the inner circle of Cardano Community to a wide range of a variety of newcomers. This might be the weak point of this proposal. Talk Shows can help to welcome newcomers but won’t be an efficient way of reaching out for potential newcomers if they only stay within our Community. ", "q0r": 2, "q1": "Team seems to have wide experience in audiovisual content but this might not be enough to implement the plan presented successfully in order to really achieve the Cardano Catalyst goals. Planning doesn’t seem consistent or well detailed. Also the diversity of teams that will work on weekly presentations can be confusing and not efficient. A more detailed planning in a key milestone breakdown might help in the successful implementation of their proposal. ", "q1r": 2, "q2": "Number of attendees, topics, questions and views might be helpful but not insightful enough to efficiently audit the progress and the success of the proposal. Numbers can be tricky. Having 100,000 subscribers in the Youtube channel doesn't mean a thing if these members don’t actually engage in real projects within the Cardano Catalyst Community. To grow the East Asia Cardano Catalyst Community we need not just numbers but ideas and above all people behind the ideas. Transparency and digestible content can be useful if we can work out a good strategy of drawing in and truly engaging newcomers. In Spanish we have a beautiful saying: better bird in hand than a hundred flying. ", "q2r": 2, "assessor": "z_assessor_3833", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 10471, "q0": "- Surely we all know that now Cardano has been developing very strongly, the benefits and success of Cardano have been recognized by the Vietnamese community. However, nowadays Cardano users are looking forward to hosting more talk shows and providing knowledge and answers to questions about Cardano. With the idea of ​​CardanoTalk for Vietnamese people proposed by the topic, I find it a very good and useful idea.\n\n    - Here the problem has been raised by the topic very specifically that is. Cardano users in Vietnam are looking forward to more chat shows where they can stay up to date with the news and get their questions answered about Cardano. I find the problem proposed by the topic well suited to the challenge. If the project is successful, it can scale up so that Cardano technology is more widely promoted, attracting potential consumers in the Vietnamese community and more developers to join the ecosystem.\n  \n    - In the solution section, the export topic has identified solutions to solve the above problem. Build a reward mechanism to encourage elite community members to dig deep into Cardano, then introduce it to the community to make it easier for busy people and newbies to grasp new information about Cardano. Talk shows will be held weekly in the evening time through the Meet Zoom program, lasting 2 hours. Then all meetings will be recorded and uploaded to FIMI youtube channel. I find the solution proposed by the group very suitable to solve the problem of the challenge with reasonable evidences and arguments as stated in the proposal.\n\n    - Besides, the team has also foreseen the main risks that may be encountered in the project. ADA slippage, community members asking for too many threads. However, the group has also come up with a plan to reduce these risks in a very reasonable way. Ask for additional budget and choose only a few of the most important topics. I found the group's presentation to be very good and had no further comments.", "q0r": 4, "q1": "  - In the section provide a blueprint, including progress and milestones for delivering your proposal. The proposed topic has identified a specific timeline to complete all work within a period of 6 months. I find the timeline outlined above to be reasonable for completing the proposed tasks. The objectives have been outlined very fully and in detail for the two phases as stated in the proposal. However, the progress of the project is not easy for the community to check and monitor.\n\n    - As for providing a detailed budget analysis, with a budget of $15,000 estimated costs for 6 months and broken down to 6 different expenses as detailed in the proposal. I think it's perfectly reasonable to split the expenses like that. Besides, the group has come up with a backup plan in case ADA slips, I am very satisfied with the plan that the team proposed.\n\n    - In the section provide detailed information about the people who will work on the project. The proposed topic raised is that the FIMI community founded by Do Manh Hung is also the subject of the proposal, along with a team of FIMI analysts with 10-20 members each, the core team and the team of translators. FIMI. The members have been assigned, the work is suitable for each team. Through the introduction of the proposed topic, I see that the members have quite good experience and capacity. However, the identity of the members has not been easily verified so that the community can check and track.", "q1r": 4, "q2": " - With a description of what you will measure to track your project progress. The proposed topic has outlined 4 specific KPIs. The number of people attending the weekly zoom meeting, the number of topics covered and discussed, the number of questions in the meeting. The last metric is the number of views of the talk video uploaded to YouTube. I find the metrics outlined as such to be very exhaustive and all of the above will be uploaded on the funded report file.\n\n   - In the success description of the project, the team clearly described the results to be achieved specifically. Cardano Vietnam community has one more reliable, fast and timely information channel. The next success is that the presenters in the community get extra income from the rewards for their presentations. The final success is the Youtube channel reaching 100,000 subscribers. I see the success of the project as closely related to the challenge of the campaign.\n  \n    - In terms of funding, this proposal is a continuation of the previously funded proposal in Catalyst. However, the proposed topic wants to apply for funding to deploy the new version, in order to attract more people to participate in the Cardano community. I find this proposal very good and meaningful, hope it will be funded in this fund.", "q2r": 4, "assessor": "z_assessor_3188", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 10262, "q0": "Currently, the Vietnamese Cardano community is growing, however, there are not many resources for the community to update general information. Besides, one of the biggest obstacles for the Vietnamese community is the language barrier, Vietnam's score of 470 out of 700, put it in the low proficiency categrory Therefore, it is indeed difficult for Vietnamese to catch up internationally. FIMI is really a large and reputable organization in Vietnam with many years of experience in analyzed blockchain projects. The group's youtube channel has hundreds of video clips sharing information on all aspects of blockchain technology and Cardano. I agree with the author about the need to develop technology news and present it in a more interesting way that focuses on explaining and making technical words easier to understand. And to improve the interaction in the community, the idea of ​​encouraging good, experienced members to share knowledge is very good and deserves recognition. The reward mechanism for active contributors will promote community engagement and information exchange, enhancing confidence in the future of Cardano. I support your proposal and hope it will be funded.", "q0r": 4, "q1": "The author has predicted and listed the risks that may make it difficult for the success of the proposal, which is the devaluation of the ADA coin, the standard in choosing topics in the community, and also points out the solutions to overcome. I would like to add one more risk that is how to attract the community's attention to your Youtube channel. How to promote FIMI to grow bigger and more known? The author has detailed the work items if funded, but I find it necessary to be more detailed, especially the period after being funded. Your core teams will need a specific training and strategy plan to build and execute presentations. The author of the proposal, Do Manh Hung, is an expert in finance and investment management, besides Hung has connected and built a large FIMI community, experienced in Blockchain and Cardano.\nI am confident in the success of the proposal.", "q1r": 4, "q2": "With the experience and success of the \"Reward for Community Translators\" proposal at Fund7, I believe in the possibility of your next success in this proposal. The actual operation has shown the influence and effectiveness FIMI has brought to the community since its implementation. The number of people following and joining the group is constantly increasing is the clearest evidence for the community to audit and continue to support you. One difficult problem in your proposal is that finding funding for comunity presenters and the milestone of 100,000 subscribers, currently only about 16000 subscribers, to reach 100,000 in 1 year is not easy. I hope your suggestions will have good results.", "q2r": 3, "assessor": "z_assessor_3170", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"id": 10204, "q0": "The project's aim is to create well-prepared and high-quality talks to help people better understand cardano and to create a reward mechanism to make the information easier to get active by many good people. find out and bring it to the audience when participating in talks as well as watching videos\n the team also gave a website link related to this project (https://fimi.vn/ada,...), in terms of problems, they gave corresponding solutions to solve. , for the problems that prevent the project from succeeding, they have outlined measures to solve, but with the risks they pose, they should pay attention to how to attract listeners and create new ideas. really quality talk and pre-censor what they will say in the talk so that the listener understands exactly what the speakers want to convey.", "q0r": 4, "q1": "the project has outlined how to implement the workflow to create a talk, but the reward mechanism is not mentioned and the content of the plan is not very specific, The costs for the entries are quite reasonable, the members include \"Do Manh Hung\" (Telegram: Hung Do Manh) and the group of trainees of Fimi, however, there is no specific information about the group that only vaguely know through some videos about these groups that the project has launched. This is also a very important thing the project needs to pay attention to in terms of the necessary transparency of the people who will do this project.", "q1r": 3, "q2": "with what the project measures and the promises it makes are very good, besides that the project is a continuation of an earlier proposal \"Community of Translators Rewards\" should succeed of the project is very desirable as well as the value that the project will bring is great, if well developed, this can become a good bridge for bringing the cardano community to more people.", "q2r": 5, "assessor": "z_assessor_3166", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 10121, "q0": "Ideas are trying to address the region-specific approach of Cardano news in East Asia. With a reward mechanism to encourage core teams to give positive news to newbies and amateurs to capture accurate information. Personally, I find the team's idea very well suited to the challenge of F9: East Asian Development, Cardano Development. And the team also clearly presents the risks as well as governance to solve the project's problems. will meet mainly related to the price of ADA. I appreciate the team's constant effort as well as this idea.\n\n With a reward mechanism for each correct information, to create a competitive mechanism. keep the group active to gain rewards as well as benefit the community. Personally, I think you have come up with a very convincing idea to help ADA holders better understand the advantages of Cardano blockchain technology to help them clearly see the VALUE of an asset they own. are investing, instead of just seeing the price UP-DOWN like other currencies. And regularly update specific news to reach the community in Vietnam for more sustainable development. The solutions are stated clearly enough. , explanatory examples accompanied by ideas.", "q0r": 5, "q1": "I myself have read through quite a few projects. And get a visual view of your project. The idea team has been involved in the community for quite some time, as well as having successful ideas from previous rounds. This is great to show their experience with the proposal, moreover, it's also a continuation of the ''Editors Community Rewards'' project from F7. In the group information section, you have provided the group's private links that are presented fully and clearly + with the 4 core groups involved in the communication process in the public meetings. This proves very clearly that you are experienced enough to take on this proposal.\n\n Through many projects. What I find different about this idea is a roadmap that clearly calculates the rising and falling prices of ADA as it gets funded. This is necessary for a context of price uncertainty. The Proposal Team anticipated the risks of the idea's sponsored proposal. But one element that I think the team needs to make clear in the concept roadmap is allocating time to deliver the first presentation. ,to presentation in time in the first month is a bit rushed. You need to think about whether new hires need time to get used to and keep up with the workload the team has set. I think the author should take this idea into consideration. This explains why I'm giving a 3-star opinion on this part of the recommendation.", "q1r": 4, "q2": "The indicators that the group mentioned determine the success and acceptance of the regional market in a practical way. And meet the measurement index of challenge requirements. At the same time, there are indicators that make it easy for the community to check the progress of the idea to see if it reaches the community and achieves the group's goals. This is very tightly linked to the proposal. The success of the idea will help the Vietnamese Cardano community have a more reliable portal. Help expand the community in the area, and solve the difficult problems of newcomers catalyst. In order to solve the problems of amateurs, officially in this area. I look forward to your exciting ideas and best wishes to the team for great success.", "q2r": 5, "assessor": "z_assessor_3160", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"id": 1186, "q0": "The in-depth knowledge of blockchain as well as the latest news updates and content upgrades for less English-speaking countries is always a big barrier for the majority of the community. (here is Vietnam)\nA proposal that encourages elite members to actively research, learn about this knowledge and be willing to share it with the rest is a great idea.\nIf this is done, it will create a culture of sharing everywhere, and attract more people to cardano. This idea should be applied in any less English-speaking country. So I found it perfectly suited to the requirements of the challenge.", "q0r": 5, "q1": "The main part of the plan is the weekly knowledge sharing sessions. Each live sharing and answering session lasted for 2 hours, and lasted for 6 months. I find it not too difficult to imagine what they will do: find and train core teams, research knowledge, choose research topics & share, share back with the community weekly, record videos and publicly updated on youtube.\nAnd to be more complete, they should have good communication strategies to attract the majority of the community.\nAs for the budget, I don't have any objections to the costs here, but there are quite a few side costs; while the main cost is to reward those who share, it is too low compared to the rest. Therefore, it is not enough to convince me.", "q1r": 4, "q2": "The proponent will make statistics and report all relevant numbers to measure the progress and quality of this project: Number of audience attend to the Zoom meeting every week, topic were presented and discussed, questions during the meeting, View of Uploaded meeting video.” These parameters are clear enough for a fairly simple project proposal like this one.\nIt's good if they set numerical goals, for example 100-200 people per session, it will be more detailed enough.\nThey have a good, active and large staff, a youtube channel with a large number of followers, and very good views, this is one of the factors that we should recognize in terms of transparency and seriousness of the project. But the related reports should be filled out in the form required by the catalyst to make it easier to track.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 17, "ne": 0, "ng": 15, "nfo": 2, "vca_o": 1}, {"id": 1996, "q0": "The idea is to create a talk show, rewarding community teams which creates a good presentation and present it in a meeting on zoom platform. All the meetings will be uploaded into YT channel. \n\nThe metrics and  goals of this proposal is to improve the interaction among people which desires to learn about ADA blockchain and create awareness. Being successful it will be good to Vietnamese people and ADA community, aligning with this challenge.\n\nThere is a huge positive aspect in this idea, which is promoting crypto and ADA to vietnamese people, making it easier for them to understand and follow the ADA news, since the majority of content is released in English. Besides that, Vietnam has a very open Crypto community, having a huge retail value (https://triple-a.io/crypto-ownership-vietnam/). However, the Vietnamese people have some English skills, mainly centered in the capitals and more rich county’s part (https://howwidelyspoken.com/how-widely-spoken-english-vietnam/). \n\nAt last, it seems quite important to have initiatives that brings more participants to the ADA community and makes the active members more active (giving them some revenue for their work).\n", "q0r": 3, "q1": "Since the proposal is about increasing the participation of Vietnamese people and foment their participation by creating a revenue compensation for their work (finding news and content and preparing presentations), and having the budget it’s feasible.\n\nThere are some points that I’m questioning, though:\n1 – How the core members team gonna be selected? – Since it’s an important condition and will receive rewards, this process should be water clear, however there is no explanation on how they gonna be chosen.\n\n2 – Choose topics – it’s not clear the mechanism which you’re gong to interact with the community neither, after some topics of choice, how are you going to select the “more important\n\n3 - core team – it’s said that the core team members are going to be responsible to find news and prepare presentations to the community, however, the selection process is not clear. Moreover, the ‘training’ process is also not clear.\n\n4 – roadmap – it would be good to have more details. Since this is divided in two main groups (first month and after), it should have more details inside the smaller tasks. To exemplify, the first point (community members requesting their topic) – how long it gonna take? Which platform they gonna use? Etc.\n\n5 – budget – the budget asked seems enough, however it misses some details. E.g., it asks USD 2500 for training the core team: how is it going to be? What will be needed? The other points have the same issue. \n\n", "q1r": 3, "q2": "The first auditability aspect that I think of is the core member’s choice. Since it’s an important part of this proposal and it’ll receive rewards, it should be more transparent.\n\nThe KPI are nice. One of the more important is the YT view afterwards. Since the problem statement and solution mention the busy people, this KPI can measure if it’s worth to continue doing the meeting or only recording videos to YT *cheaper*.\n\nThe metrics and aimed objectives are good, however it should include more objective numbers such as reaching a X number of YT views, X numbers of catalyst participation (maybe adding a survey), X number or meeting participation in 6 months etc.\n\nAnother aspect that should be more detailed is the roadmap. Since there is no deadline and all the measurements are made by ‘time spent on the task’, its hard to know what to expect one the date.\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"id": 2384, "q0": "When analyzing the proposal, at first we came across ideas that were already widely used by other projects, which makes us have a little doubt if the idea in question would have enough impact, or would be just more of the same. However, unlike other projects, we were able to find here a great background that helps FIMI to differentiate itself, both for the professionals involved and for the activities already established. With this, it is possible to believe in good chances of this project positively impacting the Cardano ecosystem in the medium and long term, as well as disseminating education and knowledge about blockchain in the Asian continent. With this we can say the proposal fits perfectly in the metrics of the challenge. Furthermore, given the activities that will be completed and the total time of these activities, we have that the amount being requested seems correct.", "q0r": 5, "q1": "As mentioned before, one of the great differentials of the project is the fact that similar activities have already been carried out by the team. Thus, there will be no need to learn how to create a teaching environment, because this environment is already largely built. Furthermore, the steps mentioned in the action plan make sense and it is interesting to observe the existence of an internal filter on which material will be transmitted, increasing the chances of learning. Additionally, the professionals involved seem to be quite qualified to carry out the activities, and although we were not able to find the LinkedIns of these professionals in the proposal in question, we were able to find several links referencing materials already produced, which also serves to prove experience. Regarding the detailing of the budget, we see correct distributions of capital and that make sense with what must be carried out, however, the observation remains that although the project is already underway, it would also be interesting to allocate part of the capital so that the project was made public.", "q1r": 4, "q2": "Regarding the aforementioned ways to follow the project's evolution, we have chosen good metrics that match the scope of the proposal, that is, from these parameters it is really possible to know if the generated teaching materials are having a good impact. It is also interesting to see that a numerical target has been established (number of followers to be reached) which will help in the assessment of whether the project was successful or not. We also have that the team also made available a document in which the results will be made available.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 19, "ne": 0, "ng": 16, "nfo": 3, "vca_o": 1}, {"id": 3070, "q0": "\"This is a follow-up to a project that has been funded since the previous round, here is the idea as well as a request from the community for the previous proposal to compile progress updates and information. The development of the Cardano platform, especially the live videos of CEO Charles Hoskinson about the progress updates on Cardano's technology in progress, along with the proposal has expanded and improved further by addition of videos with in-depth analysis on terms or a feature of the protocol that Cardano is developing, especially the past and upcoming eras, the upgrades will provide additional features. What functions and protocols and a lot of things need to be analyzed and clarified about the technology for the community to gain useful knowledge, and at the same time firmly believe in the technologies that Cardano is developing for investors. owned by the original ADA.This proposal is developed to target all Vietnamese citizens. am, and the colony of Southeast Asia, so the proposal is a perfect fit for the requirements of the challenge. *this is a great community development idea, with a solid foundation and reputation, the group has a great influence on the Vietnamese community, so this proposal will be an expanded affirmation communities across the country, and also leverages future developers in the region to gain knowledge from the proposal, then contribute great proposals to the Catalyst ecosystem. with the self-sufficient model from the community is to take the knowledge and information available at IOHK to spread them to the community, and this work will be done by an elite group of members from the community, so the risk The risk to this proposal is almost nonexistent, and the only problem we are seeing is the network drop of the ADA coin, which will affect the value and projected spending of the originally intended goals. Initially, however, the proposed team had a plan to apply for more for this provision. * However, in the matter of hedging for the reserve fund, in my opinion, the group needs to explain more or declare that \"\"if during the implementation process, the reserve requirement is not used because it is possible that the ADA price will increased in that time, what will the money be used for? example might be adding to the budget for later round development expansions\"\", \"", "q0r": 5, "q1": "\"Because the work of this proposal does not use much technology, but only focuses on translations and information search, synthesizes them and publishes them to the community by live streaming videos, so the roadmap reasonably provided by the group to do so, I will have no opinion if the proposed team provides a more specific explanation in the detailed budget table, the part of the fund to pay the presenter, as in the group solution mentioned above, there will be a basic reward. for a Good presentation and a bonus for an excellent presentation. so this section: \"\"$4,800 Presenter Bonus ($200 per week)\"\" should be used for that purpose if the right group needs to explain more specifically about community incentive rewards, for example how much is a good presenter and how much is a good presenter, The founders and core teams are provided with information and evidence that they are active with videos available on each team's own Youtube channels. but unfortunately I can only give the team 4 points because it is not perfect in the presentation of the budget summary of this proposal.\"", "q1r": 4, "q2": "\"The work of this proposal is mainly to have meetings to update information, and analyze protocols and techniques on videos to be uploaded to Youtube, so monitoring or verifying progress implementation and the metrics that the team proposes to provide, will be very easy because they are all available on Youtube. The success of this proposal will contribute to broadening the deep understanding of the protocols and developing projects in the Cardano ecosystem, and also contribute to increasing the number of developers in the Vietnam region. with Catalyst through this proposal. \"", "q2r": 5, "assessor": "z_assessor_2396", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}, {"id": 3220, "q0": "The problem is clearly defined in the proposal. Match this challenge item. Due to the language barrier, many Vietnamese Devs have difficulty accessing Catalyst. The project was born to train Vietnamese developers to join Catalyst.\nThe problem here meets one of the essential requirements of the challenge. Engage developers from outside the existing community to participate in Catalyst. Hand in hand, guide developers with ideas to write proposals on Catalyst professionally, on the right topic.\n\nHelp DRep evaluate proposed projects on Catalyst, raise capital from Catalyst to operate and develop their projects.\nThe scope of influence on the 1-language community. Scope of influence and development in Vietnam.\nThe target group of users is the Blockchain-loving community in general and Catalyst in particular.\nThe project is scalable beyond the Cardano ecosystem.\n\nAbout the product of the project, Products are live sessions, live talks, youtube videos, and zoom group meetings, with direct interaction between experts, the core team, and members of the Fimi community.\nProposal to add value to the Cardano ecosystem. Specifically, the CatalystTalk product makes it possible for an amateur developer to know how to write a proposal or, to evaluate a project, to propose on Catalyst. By participating in talks and sharing about Catalyst. Attract developers to participate and contribute their products to the development of the Cardano ecosystem. They are increasing the number of participants in Catalyst, and improving the quality of reviews of proposals.", "q0r": 4, "q1": "The team has assigned work to each team member. They have the relevant experience for the position in this project. Team members are public and easily authenticate their identities. The team includes Mr. Do Manh Hung, founder of Fimi, who is an influence and inspirer for PAs, Vietnamese proposals on Catalyst, has experience as a PA, and a seasoned proposal writer with experience and expertise. he is a trainer of Blockchain courses, Cardano. Mr. Do Manh Cuong has many years of experience as a translation team leader. They have the necessary competencies and skills to solve the problems of this project.\n\nIn this proposal, some of the risks are outlined and there are solutions for some of them. For example, the solution establishes a $2000 contingency budget in case ADA slips; to ensure a valuable source of rewards for presenters and stakeholders. And select only some of the most important topics from the community requests for presentations. I think we can do community polls before deciding on the next live topic.\nIn terms of revenue, in addition to the sponsorship money from Catalyst, the CatalystTalk project also has revenue from Youtube from videos uploaded to the Youtube channel, which currently has 16,000 subscribers with 635,000 views.\n\nThe proposal has a trial product and has positive feedback from the community. More than 150 videos about Cardano and Blockchain have been published on the Youtube channel: \"Tài Chính Tâm An\".", "q1r": 5, "q2": "Expenses are explained and properly allocated. $15,000 is spent on 6 categories of work. In which, $ 13,000 is used for video editing, staff training, ... The rest, $ 2,000 is used as a budget to prevent ADA from slipping.\nThe overall implementation roadmap has not been presented in detail. Mostly generic dateline for 6 months.\nMetrics are clearly stated with specific numbers. The number of attendees, the number of topics, the number of questions in the meeting, the number of views on Youtube, ...\n\nThe success of the project is described in detail, and easy to understand. The key team has been working together since the first project was Funded for more than 1 year. The roadmap and timeline are reasonably distributed and detailed.\n This is a follow-up to the Fund 7 funded proposal that is \"Reward for Community Translators\" with an already Funded $18,000. I quite appreciate your proposal for Fund 7. So far that project you guys have continued and developed well. With good reception and feedback from the community.\n\nRegarding the transparency of measurement indicators, the community can check the indicators, and update the team's work progress through the statistics of the number of attendees, the number of topics presented and discussed, and weekly community questions. The number of video views on the Youtube channel. The indicators are fully updated on a Google Sheet file with a link in the proposal.\nRegarding product value handover, they hand over value through group meetings and online and offline training sessions. Videos uploaded on Youtube.", "q2r": 5, "assessor": "z_assessor_2412", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 3417, "q0": "A talk show is a great way to keep people informed about Cardano in na interesting way. It also is aligned with challenge as it directly addresses main challenge definition of success (\"A broad spectrum of people across Asia and connected to Asia, coming together and forming teams to grow our ecosystem\"), specially considering the size of vietnamese community interesting in Cardano. Proposer shows the value proposition in an articulated manner, showing the benefits for each stakeholder (Cardano, challenge and Fimi community members)\nThe approach selected also seems innovative, by making people participate, as their topics of interest will be selected, and incentivizing elite members of the community  to present this topic, with a reward mechanism. Some examples are also provided which helps to make the propject more tangible.\nAs suggestions, this reward mechanism could be better explained here how the rate of good and excelent for the presentation will happen. A communication strategy would also be much welcomed, as it is essential that this talk show is properly advertised and reach the right people, for this proposal to have its full impact. These are just minor detials, though, and my rate is 5.", "q0r": 5, "q1": "There's a simple but sensible plan in place, based on how the dynamics of the talk show will work. Budget breakdown is properly done and matches project plan scope. It's good they added a reserve (contigency) line for the very frequent flippage ADA price - which is part of their mitigation plan for it. The team is composed by proposer plus the Fimi's community. Proposer has experience in finance, plutus and Cardano and was able to put together the Fimi's community, which have been working for the last 6 years and published more than 150 Cardano and Blockchain videos on YT. Their channel is provided to verify the information. All in all, I dont see major hurdlers in feasibility", "q1r": 5, "q2": "There are some good metrics provided but they could have target on the number they want to achieve, at least for some of them. The only target provided is for the Youtube channel subscribers (100k). Another metric nice to be added is the feedback from the community, which could be measured by a survey, for example.\nIn addition to these kpis, the videos will be uploaded in youtube so it's also possible for anyone to check thereif project is progressing and talk shows are indeed happening.\nAll in all, I agree that the project is auditable but some minor improvements could be made here.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 21, "ne": 2, "ng": 19, "nfo": 0, "vca_o": 1}, {"id": 3714, "q0": "The Cardano community in Vietnam is one of the largest and growing communities. However, there are very few programs that share in-depth about Cardano and update new developments of the Cardano ecosystem. This makes it difficult for the community to update information due to the language barrier. Recommending CardanoTalk for Vietnamese is a good idea to help the Cardano community in Vietnam easily update regularly on Cardano developments, thereby helping the Cardano community in Vietnam grow stronger and stronger. again. Through sharing sessions like these, it can also give newcomers the opportunity to learn more about Cardano and participate in the Cardano system. This proposal perfectly fits the challenge presented.", "q0r": 5, "q1": "With the experience of Do Manh Hung and the in-depth understanding of a large team of Core Team members. I believe you will implement this proposal successfully. The high volatility of the Crypto market can be a major barrier to the success of the proposal. I completely agree with your handling that additional budget is needed to hedge this risk. Information about Do Manh Hung and community Core Teams can also be easily found on social networks such as youtube or telegram. I appreciate this very much.", "q1r": 5, "q2": "The 6-month roadmap given by the group is very complete and detailed. This shows your very good preparation for the success of this proposal. In addition, the use of the $15,000 amount is also very transparent and clear. I believe the community appreciates this as well. However, there is a small suggestion for you that the KPI you need to give is more specific and clear in terms of numbers so that the community can easily measure the success of the proposal. Example: After 1 month, how many new people are expected to join the Cardano community? After 6 months, how many people know about Cardano and join the system? I believe that if it is fully presented, the community will appreciate it more.", "q2r": 4, "assessor": "z_assessor_2476", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"id": 3806, "q0": "This proposal seeks to build a rewarding mechanism to encourage members of their community to find out news and documents about Cardano and present them to the community. It is a laudable idea but the problem statement section is rather showing a solution, not a statement of a problem. \nThe proposal seeks to encourage elite members of the community to get deep into Cardano to be able to present news and documents to the community to make it easier for busy people and newbies to grasp new information about Cardano.\nIn addressing the challenge, the proposer has mentioned that this project will help community newbies to better understand the advantages of Cardano blockchain technology which is a goal of the challenge and also Fund9 objective. The proposal mentioned again that this idea will grow the Asian community and widely promote Cardano to potential users in the Vietnam community, and also get more developers involved in the ecosystem. \nThe proposal has mentioned the risks associated with the project and mitigating measures, mentioning one of them is, too many topics requested from the community members and mitigating measure is to select the most important topic. \nSince the problem from the beginning is not precisely stated, but all other contents have addressed the challenge, I will give a rating of 4 for this section.", "q0r": 4, "q1": "The plan presented by this proposal shows that the project will be completed in six months. The timeline has been divided into showing the first month and the rest of the months as one. \nThe first month indicates that the core team will do a presentation in meetings, while the second part is showing that there will be repeated weekly meetings in 6 months; write an outline as community members request their topic; topics will be assigned to the core teams; the best presentation for each topic will be presented in weekly meeting and Q&A session in the meeting.\nThe budget total is $15000 with breakdown quite reasonable. The breakdown for 6 months shows costs for training of the new core team, editing video, support community members, etc.. The cost of $4800 being the highest among the cost estimates is for presenters. \nThe team is made up of of 2 core members whose names are mentioned as Do Manh Hung and FIMI's Community. From the write up, Mr. Do has Master's Degree in Finance, and has built a YouTube Channel dedicated to Cardano, which has a laudable achievement of more than 150 Cardano blockchain videos published, more than 15800 subscribers, etc. which makes him capable of implementing the project successfully. However there is no LinkedIn reference for further checks on the team's experiences. \nThe proposal has stated that after launching, they will continue to submit proposals in the next funds for support from Catalyst to continue to attract more people to Cardano in their communities. \nThe team stated that they are involved in other proposals and also working on previously funded projects. The plan is quite detailed and the team is capable of implementing the project though there is absence of links such as LinkedIn to further check the experience of team profile, hence I will give 4 star rating.", "q1r": 4, "q2": "To track the progress of their project, the proposal seeks to measure the number of zoom meetings every week, the number of topics presented and discussed, number of questions during meetings and number of users for the uploaded video. It is mentioned that the progress report will be uploaded on the Funded Report File for the community.\nThe success will be be seen as Cardano Vietnam Community which has more reliable , fast and timely information channel; community presenters rewarded for their presentation; YouTube Channel reach their milestone of 100,000 subscribers. \nThe proposer has indicated that this proposal is a continuation of previously funded proposal. SDG rating was not provided in the proposal. \nThe information provided is sufficient to audit the progress and success of the proposal. My rating is 5 star.", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 4335, "q0": "The proposal to solve the goal in the Challenge is East Asian growth and Cardano growth. The problem here is to create more chat programs so that Cardano users in Vietnam can stay up to date with news and answer questions about Cardano. This proposal directly adds value to the Cardano ecosystem. It is possible to gradually scale up and tackle future challenges. As more and more people know about Cardano, the opportunity to propose new ideas when building the ecosystem and working on the Cardano ecosystem increases. We can see the potential through proposals like these of Fimi, which is also a premise for continuing to build community and promoting Cardano blockchain adoption in Vietnam. Therefore, I have high hopes for this proposal and consider it a form of improving Vietnamese people's knowledge (knowledge of the Cardano blockchain). If this proposal is funded, it will be an incentive to encourage members to learn about Cardano news and documents and then introduce them to the community. I endorse the impact of this proposal because the great benefit it brings to the Cardano Vietnamese community is the world's first-class knowledge of blockchain technology. I rate it 5 stars.", "q0r": 5, "q1": "Fimi is already very well known in the Cardano blockchain world in Vietnam, and also has experience in participating and being funded in Fund 7 of Catalyst. Therefore, it is reasonable to continue building a Q&A program to impart knowledge on the topic of Cardano. As one of the largest groups of Cardano investors in Vietnam has been active in blockchain research and analysis for a long time and has made hundreds of videos to convey blockchain knowledge and the Cardano ecosystem on Youtube, which has created a great reputation for Fimi in the Vietnamese community. What I strongly agree with is the presentation of the material (videos, Youtube channel Fimi), it increases the credibility and trust of the community in the team and the feasibility of this project. It would be perfect if the team presented a few more links to the social networks of some key members, it would gain the trust of the community almost completely (especially the trust of the complete people). brand new, don't know anything about Fimi). Team members all have extensive experience in their respective areas of expertise (blockchain research, news gathering and synthesis, Cardano blockchain fundamental analysis, media, video making, etc…). It is a guarantee of the feasibility of the proposal when applied in practice. The budget is reasonably divided, suitable for building the bonus mechanism (estimated within 6 months of implementation), and the stages to make Youtube videos, which are very familiar jobs of the team. I have a budget question: If Catalyst funding has not been received in Fund 9, does Fimi plan to continue with the proposal? Are there other sources of funding to implement this proposal? I think the community will believe when they see the team working according to their passion for so long. What makes me feel very secure is the hard work spirit of the team, why does the team have that? It's because many members have a passion for Cardano. Only passion can make people work so hard. The plan and implementation method have been fully stated in the proposal. Along with the necessary resources to implement the proposal, the human resource seems to be adequate because the team of collaborators works together (Jaguar coreteam, Owl coreteam, Viet coreteam, Fimi translator team). I heard that some members of Fimi are also applying for funding for another proposal in Fund 9, if all proposals are funded by Catalyst, will the team have enough human resources to implement this proposal? How to make the knowledge-rich and confusing Cardano videos receptive to everyone? I know Fimi is keen to make information more interesting and engaging. My advice is that the team should promote more communication activities so that more and more people know about Fimi's videos. This is also consistent with the forte of some members specializing in communication. To increase the attractiveness, Fimi can consult more experts. It is very important to contact and learn from experts because they are the best in their field. My questions are suggestive. I would like to contribute positively to the proposal. I want Fimi to have more videos to serve the community. I find it reasonable with the risks the team may face during implementation and the solutions offered. I vote 5 stars for the feasibility of this proposal.", "q1r": 5, "q2": "Fimi has set out important milestones and roadmaps in the process of implementing the proposal. In my opinion, if these important milestones are tied to specific months of the year, PA & vPA will be very favorable to monitor and evaluate the auditability & transparency of the proposal. I feel a bit sorry that I can't see the KPI performance indicator. In return, other measures of success are presented in the “funded report file”. Based on the “funded report file” it is possible to assess the success of the proposal. This proposal of Fimi is very practical, very necessary to disseminate knowledge, and improve Vietnamese people's intellectual level, and is completely practical to be able to implement. During the whole process, the problem was clearly described, and easy to understand, along with the solution. It contributes to improving the real effectiveness of the proposal when applied in practice. Fimi wrote a highly methodological proposal, the ideas well organized, and clear. In summary, the proposal has demonstrated transparency and auditability, I strongly support the team implementing this proposal. I hope it will be funded in Fund 9 and be implemented soon to give the Vietnamese community a lot of knowledge about the Cardano blockchain. I completely agree with the suggestion - vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 15, "ne": 7, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4708, "q0": "The team of the proposal came up with a very good idea, the project matched the goal of the challenge. With the problem clearly identified, Cardano-made Vietnam users would love to have more chat shows where they can stay up to date with news and have their questions answered about Carano. This project solves some of the questions of the challenge, builds a reward mechanism to encourage members to learn about Cardano's news and documents, then introduces the community, through which suggestions can be found. can scale to solve future challenges and grow the Cardano ecosystem. talk about the solution of the proposal the team has identified the problem to be solved , the group also explains what will be done in each phase , very detailed and specific . talks about the risk that the team has identified Potentially can prevent the project from succeeding, the ADA price slippage, community members request too many topics, so the project owner also offers solutions to minimize the development and perfection of the project. .i think the proposal has high value and development . thank you", "q0r": 4, "q1": "The proposal has given the milestone of completing the work, the appropriate timelines to complete the proposed work, the specific objectives, the community can see the roadmap of the development project. Talking about the budget with the required amount of $ 15000 is quite suitable for the proposal as well as the value of the project, as well as the time that the team worked, the budget has been broken down into each item. To spend, through those expenses, you can know what the money is used for, how much money is spent, that amount is publicly transparent, the project theme has attached $ 2000 to prevent ADA price slippage. The project team is seen as a personal and team analyst .everything needed for a good faith to be informed is related to them therefore I attach great importance to this part . thank you", "q1r": 4, "q2": "Proposed measures to track progress have identified KPIs such as the number of people attending the weekly meeting, the number of topics presented and discussed, the number of questions asked in the meeting, the number of views of the talk video uploaded to Youtube , the metrics easily measured and checked , uploaded on the . about the success of the project the team describes the results achieved , the Vietnamese community has an important channel of information quickly and in a timely manner , the presenters on the community get extra income from the program . For that presentation , the youtube channel reached 100000 subscribers . As this proposal is a continuation of a previously funded proposal to build more public confidence in this proposal, more information from the previous proposal has been released to build trust in this project. development and community evaluation for possible funding . good luck", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"id": 4883, "q0": "This proposal works on meeting Cardano users' quests of news and information and of deeper understanding of the Cardano ecosystem.\n\nThe means of achieving that involves encouraging members of the core teams with rewards. It also encourages the Cardano users to interact with the core teams weekly. Due to demands and the increasing news pieces, there is a need to recruit members to increase the number of core teams to meet the demands for research and translations of the information into Vietnamese. All this as I see it, involves getting members of the core team and the community at large to actively involve and contribute to the Cardano ecosystem aligned with the challenge settings. \n\nI am not clear about how it would enlarge  and expand the Cardano community as the proposal is not suggesting any marketing or promotion. However the successful implementation of the proposal and the weekly interactive activities coupled with the effort of producing good information, would also tend to promote and attract more Cardano users. For that reason I would rate a 4 for this setting, that I agree that this proposal effectively addresses the challenge. \n\n", "q0r": 4, "q1": "I am given to understand that the core person of the proposal team is Do Manh Hung. He has experience over the last 6 years training the community in financial and investment management. He is leading 4 core teams, each consisting of 10 to 20 members and their main task is to learn about Blockchain technology. I am not clear whether the core team members are involved in this proposal activities other than the FIMI community translators. Neither I am clear about the work distribution or if there is any as only one person is listed as the proposal team member and that is Do Manh Hung. But work allocation is important for an effective and successful implementation of a project. \n\nAs for the budget, the cost element can be elaborated so as to give a clear understanding of the work involved. The item in question is the \"Support community members\".\n\nWith all the above as stated, my initial rating is 3 stars. However, bearing in mind that the proposal is auto translated into English that could have some flaws in the clarity that I am looking for; and that the core teams have produced more than 150 videos with more than 15800 subscribers (220 and more per month), it shows that there has been some coordinated efforts among the teams involved. For this, I would give some credits and thus I would settle for a 4 rating. I agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "I am looking for an indication of how this proposal when implemented would impact on the Cardano users community. I agree with the KPI metrics used.  However without any estimated numbers and the timeline, the measure of progress cannot be done as time passes. This may not give funding a sense of confidence. \n\nNumbers of targets estimate also allows project management to identify deviations so that rectification or correction can be taken. Deviation can be caused by e.g. delay in the video production, uninteresting content, problem of translation etc.  This also allows the use of the progress information as the factor in the rewards system.\n\nThe absence of the information prompts me to rate 2, that I disagree that the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 2, "assessor": "z_assessor_2631", "no_vca": 18, "ne": 0, "ng": 17, "nfo": 1, "vca_o": 1}, {"id": 5216, "q0": "Cardano's brand awareness in Vietnam among crypto investors is still relatively low because many people do not understand Cardano and ADA well because the information they received is not official and most come from social networks and not be fact-checked. Therefore, this proposal contains an objective is organizing talk shows to update information about Cardano and answer investors' questions is an extremely urgent, useful, and valuable job for the community.\n\nAt the same time, the project also has a payment mechanism, which will attract Cardano experts to participate as speakers, increasing the quality of talk shows.", "q0r": 5, "q1": "Fimi is one of the major Blockchain communities in Vietnam, focusing on research and development of projects on the Carado Blockchain. At the same time, Fimi is led by Master Do Manh Hung. He is one of the first to disseminate knowledge about Cardano and ADA to the Vietnamese cryptocurrency investor community, so with a wealth of institutional experience as well as teaching. I believe in the success of the project.\n\nThe working mechanism of talk shows is started by surveying and collecting opinions from the community to choose the right topic, which I think is very reasonable because that will ensure these topics are interesting enough to attract the attention of many people..\n\nWith a project budget of $15,000 to operate within 6 months, it is pretty reasonable in the Vietnamese market.", "q1r": 5, "q2": "The indicators that the project chooses to evaluate the success of the project such as number of attendees, number of topics, number of questions, and a number of views are completely reasonable.\nIn addition, in my experience, your team may concern to use some metrics, to evaluate how a project can impact the community, such as you can do a small survey, to be able to understand what the community is really thinking. about talk shows such as quality of speakers, quality of topics, would you recommend this talk show to you and your friends,... some of those questions will help the project improve well over time.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 15, "ne": 0, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 5794, "q0": "This proposal very effectively addresses the challenge by providing original content in Vietnamese language and publishing the content to YouTube. The YouTube channel has an impressive amount of engagement and would be a benefit for Cardano to raise awareness in east Asia. The project team are all native Vietnamese speakers and are a good choice to lead this imitative. The proposal also funds a weekly zoom call among Vietnamese Cardano community members. ", "q0r": 5, "q1": "The proposer team is very qualified and experienced to carry out this project. The previous completed catalyst proposals indicate that this project will continue to have success. The plan is presented very clearly and has a good roadmap to success. The project team have been making original content in Vietnamese for some time and have a good track record. The YouTube channel currently has over 100,000 subscribers. There are no SDG goals listed in this proposal. ", "q1r": 4, "q2": "The information in this proposal is sufficient to audit the progress of this proposal. The metrics of success aare clearly defined and can be collaborated with the amount of new engagement to an already successful project. all accomplishments of this campaign will be uploaded to a funded report file that is publicly available. Based on previous proposals ability to carry out auditability it is highly likely it would continue with this proposal as well. ", "q2r": 4, "assessor": "z_assessor_2751", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 13994, "q0": "I do completely agree with the presented idea in this proposal. I do believe in the offered benefits from this proposal as the Cardano community can grow both in size and quality prospect as much as the Catalyst. Since nobody can deny the popularity of blockchain or crypto’s inhabitant is more and more large, the demand that people want to join our society but starting at zero background of crypto knowledge has been increasing rapidly. In fact, most of knowledge resources primarily have the academic characteristic as well as a lot more specialized information is involved in this day and age.  Therefore, we need a thing or a frame of knowledge that has been simplified so that it will incentive the users to join with us. And the encouragement in this proposal is contributed to let every member of Fimi core-team study in-depth to each of technology solution and then deliver their knowledge to Cardano community. I do think it is extremely crucial to find out such a well-qualified individual or group of people that can handle each of the issue but still ensure their capacity in meeting requirement during the inputting information process. After that, by using their languages, the new knowledge which is simplified to understand will be delivered to every person in the community. This proposal is really reliable in rising the community’s cognition of crypto as well as develop our Cardano society. Thereby contributing to the well-known of Cardano in every blockchain platform. ", "q0r": 5, "q1": "The possibility of this proposal is quite in a high-reliability since the proposer have a specific orientation for their plan and completely certain about their capacity. Cardano community can take advantage from them through their workshops which aim is to share with us their fascinating discovery, or their conducting process in detail. On the other hand, the foundation and experience of each member in the core-team have convinced me to place my expectation on them and I would not feel disappointed. Honestly, when the first time listening to their published workshop via Fimi Youtube Channel, I realised that they have such a wonderful sustainable foundation and deeply knowledge in the researched field. They attracted me by the way they create the innovation in the delivering message, simple but not trivial content. Lastly, when taking a look into the financial statement or the balanced sheet, the proposer has carefully included each number with corresponding expense item and why these costs appeared here in a very detailed description. Also, all the involved costs are exposured obviously, and the pricing risks are mentioned in case there is the volatility in ADA price. Hence, there is no doubt about the major amount of agreement will be sent to this proposal from Cardano comminuty and the rise in successfully charging fund. ", "q1r": 5, "q2": "Auditability is always a vital section that needs to be considered carefully. I hoped to see a more visualization of those numbers that assist the users can easily follow the progress but there is nothing mentioned, just in general. I think an addition of more numbers and measurement methods related to the project progress would help the proposal gain more the persuasive proportion to the community. The statistical number of Zoom participants, or how many uploaded meeting videos over a month can be taken as examples. Readers or any of us can come up with their imagination about how large of the project size is, and support the reliability of the proposal. Moreover, the description inside the proposal has been stated in a very detail and again, easy to understand definitely. All the target are set up specifically. Therefore, it assists Cardano community to catch the value that will be brought back from the proposal.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 5942, "q0": "This proposal is very much aligned with the challenge setting of Grow East Asia community, and very welcoming to grow in other countries in the region. The solution is the incentivizing mechanism for the quality team to find the quality content/research and present them to the community. This makes the content deliverers more accountable for what they share.\nThe solution is very simple yet the impact is very huge for the beneficiaries, however, it requires the knowledge capability, and quality team members to deliver it. The voice of the community is truly taken into account with an individual member voicing up for the weekly topic, thus making the proposal really decentralized knowledge sharing. The risks are mentioned regarding the Ada price slippage that may affect the rewarding scheme. The over-requested topics are also well-covered and the team already thinking about prioritization. What could have been done better is the criteria flow for the topic selection and prioritization. Moreover, it is suggested that the core teams and presenters' selections should be more carefully mentioned as they are the keys to the proposal. It would be greater if the proposer can elaborate more on the process of recruiting/validating the core presenters.", "q0r": 5, "q1": "The budget is 6% of the total challenge setting Fund which is very reasonable compared to the complex process and 7-month proposal timeline. The budget was steamed down by the small tasks required to complete the proposal. It could have been improved if this budget can be split during the whole proposal timeline of 7 months (ie. training in month 1, month 2 to month 6: Four talks per month which will require xx amount of budget on the monthly basis.) This will help the Catalyst team in terms of funding release, the proposer to have a sufficient amount of cash flow to deliver the proposed timeline, and the Voters/PAs to have transparency to judge and monitor the proposal.  \nThe team is very reliable and shows a long history of commitment to the community of FIMI with more than 3000 participants on telegram channels which frequent interactions. The PA already joined the telegram channels and checked the real conversations on the channel. The PA also watched the attached videos of the related presenters that the proposer included in the proposal and found the quality content for the audience with around 200 participants on Zoom per sharing. The team also plans to come back for the next round of funding and wants to implement this activity on a frequent basis.\nThe milestones are clearly identified with the first month being prepared and the next 6 months with weekly CardanoTalks from the community which make it really decentralized. It would be greater if the team can share a standard weekly flow so that the members of the community can get used to the weekly calendar.", "q1r": 5, "q2": "The proposal will be measured on their Youtube channel at the link provided https://www.youtube.com/channel/UCoyi5FmVh6aFY2pWM0EI8Vg/videos. As the PA entered the link, it is very much well updated since fund 7 (the team got funded with another Catalyst project.) and makes it very easily tracked and audited. Moreover, all of the KPI/OKR indicators are reported in a separate Excel sheet which can be found at https://docs.google.com/spreadsheets/d/18KPD12rf_qkODfPACXEAzclDsUethZjo5bUcBETWVO4/edit#gid=1788143507. The PA checked and it showed more than 3,000 minutes of the videos translated by the community from Cardano Ecosystems. It would be suggested that the proposal can help to separate the funds (Fund 7 vs. Fund 9 and upcoming funds as per stated in the application.) The metrics were very well covered in the Attendees/Tops/Interactions Q&A (DURING), and Views of recorded videos (POST). The visioned successful pictures are both qualitative and quantitative (x8 of the current views of the FIMI channels) which is very inspiring yet also stretching from the PA point of view. What would be greater is the PRE CardanoTalk KPIs (number of registers/votings of the topic of the weeks) and/or number of team research for better content research. It is also suggested the roadmap to get from 16k views to 100k views and a deadline attached to make this happen.", "q2r": 5, "assessor": "z_assessor_2759", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 6579, "q0": "Here we have a solution to the need to obtain information in a fast, verified and understandable way for the Cardano community which, over time, is achieving a fast increase in its size, it explains that there is a lot of information that it is difficult to understand due to its technical language and the time it takes to get an accurate translation of it. Due to this, a reward mechanism is proposed so that qualified people are in charge of investigate and verify information and then delivering it to the community. The idea of informing the community to facilitate the entry of what many may consider a new world seems to be something that could add a lot of value, but something worring about that it is never indicated what the selection method of these will be. It would be great if they make this clear to have a better idea. However, it seems to be a proposal which can guide and help many people, progressing in the future. I rate the impact with 4.\n", "q0r": 4, "q1": "The proposal did not provide evidence such as references or links about the team to support their experience, it only has the telegram users of the team and a link to their Youtube channel with some of the achievements along 6 years. It would be nice for voters to add these references because they may be able to validate this information about their experience and skills. As far as the budget is concerned, this one does not show too much development in-depth, in comparison with the amount that seems to be quite high for what they ask for. I do not really expect a successful implementation so I can only rate feasibility with a score of 2.\n\n", "q1r": 2, "q2": "The proposal lacks some important information, such as a roadmap and time horizon for achievement, I recommend including this information so that the community may have a better point of view for future. I rate auditability with a score of 2.\n\n", "q2r": 2, "assessor": "z_assessor_2822", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"id": 7491, "q0": "Cardano seminars are an effective means of communication that should be widely adopted in different regions, not only in Asia. Vietnam has been conducting such live streams, but completely voluntary and without reward. This proposal is very practical, and a motivation for the talks to be better invested in quality and form. However, to spread to the community more, the proponent needs a mechanism for more participants to contribute content instead of just one presenter doing it. It is the facilitators who contribute content to the presenters who will better understand Cardano and will have the next layer of followers. I rate 5.", "q0r": 5, "q1": "This proponent is very experienced and has successfully hosted Cardano discussions on youtube, so I have no doubt about the success of the proposal. With enthusiastic personnel, a clear roadmap, reasonable budget, the possibility of success is very high. However, to attract even more viewers, I recommend having at least 2 presenters, possibly in the form of interviews, and at the end of each show, there is a Cardano quiz and giveaways for viewers ( in ADA or USD). I rate 5.\n", "q1r": 5, "q2": "With the dedication and professionalism of this Cardano community building team in Vietnam, I think the goal of Youtube channel reaching 100k subs is feasible. The proposed ways are also very easy to measure the success of the project. If possible, the project should proceed to livestream on Youtube and broadcast on channels such as Facebook fan pages to reach more community, so views and interactions are recorded more clearly. Rate 5.", "q2r": 5, "assessor": "z_assessor_2897", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 8336, "q0": "The proposal is very interesting and will address a lot more people than before as we all know visual representation or hearing representation will have more impact on the individuals than just reading the texts or scripts. People might find it difficult to remember the concepts they read from the scripts whereas people tend to remember more when heard in a speech or a visual representation of the documents and this will enable a lot of new users in the cardano ecosystem as they will be doing Cardano talks in their local language i.e Vietnamese and this will provide an impact to a lot of local speaking people to gain more knowledge on Cardano. This is a very innovative idea to spread the knowledge of Cardano to a large number of users through speech which gives more impact. The proposal is scalable to future challenges as it can be implemented throughout the world in different language speeches and hence I agree the proposal has been effectively addressed.", "q0r": 4, "q1": "The idea of the proposal is outstanding but when it comes to the experience of the team members the proposer has failed to give out information of their team members in detail which couldve made this proposal stronger but they have provided several links to support their proposal and the budget is outlined clearly and has also broken down into individual items which is reasonable for the completion of the project. The proposer has also not provided a detail plan along with milestones to complete this proposal. They need to improve on this planning and presentation of the proposal or else the idea of this proposal will go into waste. They have considered the challenges they will be facing during implementation of the proposal but due to certain unmentioned factors by the proposer I neither agree nor disagree with the given experience and the plan presented to be sufficient to define the success of the proposal.", "q1r": 3, "q2": "The information provided for the roadmap of  the proposal with milestones and the time interval to complete this project is not sufficient to audit the progress of this proposal as they have not mentioned anything in detail. It is just a brief on what they might do but does not seem convincing and they have not clearly mentioned about the key metrics or anything that will define the success of this proposal. The proposer has a very good idea for the proposal but might go wasted due to insufficient information provided in this proposal. The proposer has a clear understanding of the problem proposed but has failed to provide the required information to assure their project will be successful.", "q2r": 2, "assessor": "z_assessor_2976", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 8429, "q0": "The proposal aligns with the challenge's objectives as it is a good proposition in guiding Vietnamese people to know more about Cardano. at the same time, build unique incentives on the incentive mechanism to encourage participants to learn about Cardano's documentary news and spread the word to the wider community. As a professional Cardano investment group, sharing knowledge about Cardano and the ecosystem is very easy to promote a lot of confidence for participants. Once we have made a project, we find that building a detailed plan is not enough to require new things, creating interesting attraction for the community. Providing concrete solutions such as building attractive mechanisms for elite members to learn about Cardano then to gain knowledge to present to others to understand valuable information about Cardano, accompanied by sessions The weekly talkshow is arranged at a suitable time and is recorded and uploaded to the group's own Youtube channels to save so that busy people can watch it again, which are plus points for this project, thoughtful. understand, put the position of others to plan carefully so that no one is left out. Topics are raised clearly and openly in this project. Worried about the risk that ADA fluctuates up and down and sometimes drops too low due to not being able to prepare transactions in time, so it is difficult to get enough capital to reward you solve it by making a temporary budget. For that to happen, it is inevitable that many participants will each have different ideas and requirements, but in this project, only important topics should be selected for implementation to avoid rambling and confusion.", "q0r": 5, "q1": "Form a detailed plan with a very clear time division so that we can easily observe the actions to be taken, divided into the first month after approval and then the next month all actions mentioned quite well. clear for this plan. In terms of budget allocation, we found a coherent distribution of expenditures, with much of it spent training core members and rewarding good presenters increasing incentives for the following. . Regarding the expert involved in the proposal, we see that they have a vast experience with Cardano development and their ecosystem. With deep preparation of knowledge, there will certainly be a good plan that works.", "q1r": 5, "q2": "\"As for ways to track progress on this project, we see that you let us observe the outcomes participants expected. And regarding the perceived success indicated, We found the main idea meaningful, the goals exposed to the participants very clearly, the project gives Cardano Vietnam community a reliable place to learn information quickly without any problems. exactly.\n    It can be seen that this is a project expressed by a team with in-depth knowledge so the defined goals will be achieved with the potential of a large number of participants. For all that is presented by this whole project, there seems to be a great chance of being passed successfully.\"", "q2r": 5, "assessor": "z_assessor_2984", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"id": 8772, "q0": "1. It is proposed to build a reward mechanism to encourage members to learn about Cardano's news and documents, then introduce them to the community. The problem is suitable for Challenge. Challenge's multi-question solving problem. The issue could expand in the future and add value to Cardano's ecosystem. Proposing to build a reward mechanism to encourage elite members of the community to learn deeply about Cardano and then present it to the community to make it easier for busy people and newbies to grasp new information about Cardano . The rapidly growing community size requires that Cardano documents and news be presented in a more timely and understandable manner. Technical information needs to be presented more interestingly. Translating the document is also difficult because the technical documentation about Cardano and blockchain contains many technical words that are difficult for newcomers to understand. Even translators with a high level of English fluency have difficulty achieving fluency, understanding, and closeness in their translations. The number of documents and news sometimes spikes (due to news related to government policy, Beartrap market, Bulltrap market, market crash...) so the number of full-time translators is not enough to meet demand. Although all documents have been translated and presented in written form, there is still a large number of community members who wish to hear a visually stimulating oral presentation. sense and can ask their questions and answers..The talk show will be held weekly in the evening time frame through the Meet Zoom program, lasting 2 hours. All meetings will be recorded and upload to youtube channel FIMI . Proposal has 4 core groups and will develop some more groups. Every week, any member of the community will propose a list of priority topics they are interested in and want to know about. Each core group will take on a topic on the list. Then, they will go together to find out information and analyze those topics. The core group with the best preparation with the most information will be selected to introduce to the community through a Zoom meeting. .There is a basic bonus for a Good presentation and a bonus for an excellent presentation. Topics to cover, here are some examples: Technical documentation (Hydra, sharding, smart contracts, UTXO ...) Cardano update (Cardano 360, Hoskinson live video...).Market news.Strictly argued and relevant to the issue. Risk: Slippage of ADA. Sometimes ADA price drops suddenly, we can't sell ADA for USD or VND in time. This may leave us with insufficient budget to reward presenters and stakeholders.Risk: Community members request too many topics.Solution Requires 2000$ for backup and Select only the most important topics.I rate 5 point for this.", "q0r": 5, "q1": "2. \"In the first month and the following months. A reasonable timeline. repeated weekly for 6 months after approval.Community members request their topics.Themes will be assigned to core groups.The best presentation for each topic will be selected. to present in weekly meeting.Meeting Questions and Answers.. Youtube Videos and Livestreams Budget 7% of Challenge. Estimated cost for 6 months\n$2,500 New Core Team Training\n$1,200 Video Editing ($50 per weekly video for 6 months)\n$3,000 Community Members Support (500$ x 1 supporter per month)\n$4,800 Presenter Bonus ($200 per week)\n$1,500 Consulting fee\n$2,000 Pre-order in case ADA prices slip\nTotal request: $15,000. $2000 for ADA for slippage. The proposal includes finance master Do Manh Hung and the Fimi community and financial analysts. Tasks are analyzed in detail fit with Members and leaders can be found via Telegram and Linkedkin. . \"", "q1r": 5, "q2": "3. The project success index is expressed by the number of people attending the weekly meeting. This metric means whether the talks are attractive to many people. We will record the total number of people who attended. Talks and compare with previous talks.Number of topics presented and discussed.This metric means the amount of work the group completed.Number of questions in the conversation. meeting . This metric allows the team to measure the community's response to topics. Talk video views uploaded to Youtube . This metric means whether the topics the team covered in the talks. whether or not the former has appealed to the rest of the community. The success of the project is judged by the presenters in the community getting extra income from the rewards for their presentations, the Youtube channel reached 100,000 subscribers. Success related to Challenge. There are products running test on Youtube. Proposal already has 1 proposal funded at Fund7. Proposal is relevant to the present. 50% is the number voted because the proposal has contributed to community growth in 17 development decrees of the United Nations. I rate 5 point.", "q2r": 5, "assessor": "z_assessor_3001", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"id": 8822, "q0": "Developing a talk show and rewarding the viewers is a great idea, where it will help people in clarifying their doubts in their native languages and as well as keeping people updated regarding changes that are involved in cardano in the current media.\nThe drawback of the project is how long will the proposer can continue this project , how long can he update the people regarding latest cardano changes in the market , whether it will be permanent solution or just for temporary days ,other than that idea of rewarding is a great promotional touch to make this project work hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The mentioned task is never a difficult one where setting up an online meeting and lecturing can be done and is already done by many people in Vietnamese itself , the challenge here is how will the proposer stand out among other you tubers or other presenters in the current catalyst program.\nThe presented plan has already pre boost available where the proposer has introduced us with the rewarding system, there are many people who'll join the meeting just to earn the rewards which is definitely a big boost in marketing strategy. Hence, with the minimal risk involved in project and with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The plan of rewarding the viewers has not been elaborated here, where the rewards are based on viewership engagement or completion of certain assessments that'll be provided by proposer's team, the proposer could have added what are the unique ways that'll he add  to maintain the engagement of the viewers for very long time.\nOther than above point the audit has presented its team and their expertise in each field in very detailed manner which is definitely an add on to the project , with the decent timeline and budget breaking idea provided  the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"id": 8986, "q0": "Proposal to effectively solve the challenge. Cardano documents contain a lot of technical words, many users in Vietnam want more talk shows so they can stay up to date with news and get answers to their questions.\" Questions about Cardano The team has come up with a solution to build a reward mechanism to encourage members to learn Cardano's news and documents, then introduce it to the community. This is a solution to help new people, busy people easily absorb documents and news about Cardano. This solution will attract many potential users, and many developers to participate in Cardano's ecosystem.", "q0r": 5, "q1": "This proposal has a very high probability of successful implementation. The team has a clear implementation plan: the first month after it is approved, it will recruit and train the core team to present in meetings and have the first presentation. Then the process will be repeated for the next 6 months. Each week the best presentation will be selected for each\nTopics will be selected for presentation via the Meet Zoom channel and uploaded to Youtube. A clear and reasonable budget of $13000 to reward project team members and $2000 to prevent ADA slippage is still enough to pay members. The proposed team is experienced in blockchain and Cardano research. In 6 years they have built a Youtube channel dedicated to Cardano with 15,800 subscribers and 4 groups learning about blockchain technology. With this experienced team, I believe the project will be successfully implemented and attract many people to the Cardano network.", "q1r": 5, "q2": "The information given is quite complete and measurable. The progress of the project will be measured by the number of people attending the weekly meeting, the number of topics presented and discussed, the number of questions during the meeting, and the number of views of the talk video uploaded to Youtube I appreciate the metrics the team came up with. Hopefully, the number of people attending the meetings will increase, and the group's youtube channel will reach 100,000 subscribers. The success of the project will help develop the Cardano community in East Asia. This proposal is a continuation of the previously funded proposal \"Community of Translators Rewards\" in Fund 7 and I see this continuation as very possible.", "q2r": 5, "assessor": "z_assessor_3011", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 9285, "q0": "I found this recommendation to be a good fit for the ongoing issue of being updated with the news and having questions answered about Cardano. With this proposal, it will help those who already know Cardano to understand it more deeply, but there needs to be a good marketing strategy along with it to attract even those who do not know Cardano to participate. Example In Vietnam, people tend to go to cafes to work and relax a lot, this will be a place to help people know more about Cardano, so in addition to meeting via zoom, you can meet face-to-face.  So, if this project is implemented, I think the team's proposal will be easy to implement because in Vietnam, coffee shops are also easy to do or meeting via zoom, almost everyone already knows how to use the software this soft.", "q0r": 5, "q1": "Your proposal has a plan but needs to be more specific, what will happen by week of the month? The team calculated the full estimated cost totaling all amounts. Team members are listed with full information with access links and specific youtube videos. However, for the international PA to evaluate easily, you can make more videos in English. The team can use social networking sites to announce information about Cardano before preparing the event in order to increase the number of participants. The group's recommendations are easy to implement in practice.", "q1r": 5, "q2": "In my opinion, the analysis and progress measures of the proposal are fine, but there are no specific KPIs to be achieved yet. Besides, the success of the project in my opinion is that the number of Vietnamese people participating in Blockchain blockchain is increasing day by day, specifically Cardano, more people know about ADA coin and participate in transactions on binance. In addition, further measures are needed to increase people's accessibility, for example through surveys in Vietnam. I think the survey results will contribute a useful part to the project's organizational activities to improve efficiency. At the same time, strategic planning to have a long-term project for long-term development in the future.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"id": 9383, "q0": "The proposal was made to build a reward mechanism, encourage members to learn about Cardano, and then re-introduce it to the Community with the aim of helping busy people and newcomers to fully understand about Cardano easier. I think the proposal effectively addresses the challenge.\nThe proposal raises the problem as follows: Cardano documents have appeared and existed a lot, but mainly the form given is text that sometimes the reader can not fully understand, need a channel interactive through oral presentation and interpretation, there is a reciprocal interaction between presenter and listener to create high efficiency in imparting knowledge about Cardano. This is one of the important issues in order to create people with knowledge about cryptocurrencies in Vietnam, because of many reasons that electronic money in Vietnam has not yet been widely developed and popularized. This proposal creates a knowledge base about Cardano and will have real effects in the development of Cardano in Vietnam.\nTwo talk shows a week on topics around Cardano, while topics are prepared each session by the core team of the project. This forced the project to find a team with a lot of experience and knowledge about Cardano to bring quality to each talkshow. This is a small challenge that the project needs to overcome.\nThe biggest impact of this challenge that the team needs to overcome is the expansion of Cardano to the community. Cardano blockchain technology is still a rather strange topic to Vietnamese people, so the solutions that the project offers are aimed at developing the Cardano community in Vietnam, including: providing knowledge and understanding about the Cardano community. Cardano is one of the core solutions today. The method of implementation through verbal interaction is a great advantage.\nI think the proposal outlines quite enough the specific impact on the Cardano community in Vietnam.\n", "q0r": 4, "q1": "The training of the team in the first phase will determine the success or failure of this project. In the proposal, it is mentioned that the use of FIMI trainee groups, each group has 10-20 members. They are members who are passionate about blockchain and believe that blockchain will bring many applications to society. This is an important resource, because the journey to bring blockchain platforms is still challenging and requires the cooperation of many people. However, the project also highlights great potentials in the training of specialized personnel.\nThe project was built by Mr. Do Manh Hung, a person who spends a lot of time and enthusiasm on the Cardano blockchain project. By building a youtube channel dedicated to Cardano, I can see the author's enthusiasm for this project.\nThe project provides an appropriate estimated budget, in which the budget for training personnel to operate the project is $2,500, accounting for ⅙ of the total budget, during the 1-month training period. I think that, given the volume of personnel that the project is proposing, the training time should be longer, because the quality of human resources is the core thing in this project.\n The effect of the market has been measured by the author due to the fear of ADA depreciation. The calculation of the plan to avoid risks for the project is welcome.\nThis is a project that is feasible in practice and can be implemented to address the challenge.\n", "q1r": 4, "q2": "The project provides a report from funding receipt to completion. In addition, the author measures success by 100,000 followers on a YouTube channel dedicated to Cardano within 7 months. In addition, the benefit to the community is that there is an additional reputable information channel related to Cardano and well-reviewed presentations that both bring useful knowledge to listeners and increase income. for the selected group.\nThe project is measured through the amount of actual interaction on the Cardano youtube channel. This is a good proof that the project creates positive effects for the Cardano Community in Vietnam and around the world.\nI think this project completely meets the expectation of solving the challenge posed.\n", "q2r": 4, "assessor": "z_assessor_3049", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 9564, "q0": "\"The problem described in this proposal fits the challenge. Vietnam is one of the countries with the largest population in the world, about 100 million people. Vietnamese people are very agile, flexible, and adventurous. With a young population that always welcomes technological improvements, a high percentage of people accessing the internet, and an increasing number of people owning smartphones, Vietnam is expected to become a country with a high adoption rate. get high with new technologies. This would be a great resource if there was a truly practical and effective platform like Cardano. However, basic information channels that are easy to understand for Vietnamese people to access are very few due to the complexity of this technology.\" \n\n\"It is seen here that the proposal of the project is very necessary. I appreciate the elaborate preparation of the core team. Readers can not only watch good videos in their familiar mother tongue but also listen to very intuitive explanations to help listeners easily grasp the information.\"\n\n“The solution described in the proposal is to build core groups. Each group will develop a certain theme. Then, the best group will be selected, with a lot of good information and analysis to present. Through the reward mechanism to encourage the team to perform well. This is an effective solution to create competition among project teams. That will help the sharing sessions become more and more quality. However, it would be great if after those weekly sharing sessions there were collected evaluation information from the community, the quality of the sharing sessions would be more objective.”\n\n\"The way the proposed solution will help ADA scalpers in Vietnam will have a deeper understanding of what they are pursuing, so they will invest more sustainably. It should be repeated that the Vietnamese are very adventurous and most of the Vietnamese who know ADA are speculators. They will be the pioneers to popularize Cardano to more people in Vietnam. I am impressed with how the proposal addresses this challenge.\"\n\n\"The risk of ADA slippage and rambling on topics to share is always present. The hedging solution of the proposal I consider reasonable. However, it is also necessary to consider the risk of difficulty when conveying relatively complex content online.\n", "q0r": 5, "q1": "“The progress of the proposal is relatively clear, but the recruitment and training program for the team should be held regularly every month so that the level of the core team is regularly improved.”\n“The budget is divided in detail, the expenses are allocated to jobs that are suitable to the income level in Vietnam. You should add the cost of the excellent presenter so that the cost description matches the proposed solution.\n\"The information about the team described in the proposal is very detailed, and the experiences described in the work done show that the team is fully capable of doing this work. It is easy to find out that the project leader is Mr. Do Manh Hung, an influential person in the financial community as well as the Cardano community.\n", "q1r": 4, "q2": "“The metrics proposed by the proposal are perfectly reasonable to judge a successful project. The charisma of the core team and the transparency of the proposal will further develop the Cardano community in Vietnam.”\n“When it was not funded, the core team did a very good job of this. I firmly believe that after being funded, the source of expenses will be the motivation for the group to better fulfill their passion.”\n", "q2r": 5, "assessor": "z_assessor_3065", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 9583, "q0": "The problem is that Vietnamese users lack chat programs about the Cardano platform knowledge so they can stay up to date with news and answer questions.\nThe solution to the problem is to organize 2-hour talk shows held weekly via meet zoom. Encourage members to participate by rewarding them for learning Cardano news and documents and sharing them with the community.\nThe project is also in line with the goal of catalyst in fund 9. The project helps to develop the community, building a community willing and able to contribute to the development of Cardano.", "q0r": 5, "q1": "\"The project mentioned two risks. (1) The risk comes from community members asking for too many topics. (2) Risk of ada slippage. The solution they came up with was to choose important topics for the talk show to address the risk 1. This solution dealt with the risk well. And the solution requests a reserve budget for the risk of slippage. Follow me. The second problem the group raised was no risk. When they receive funding, they can immediately convert to fiat for operations, avoiding price slippage—unreasonable reserve budget requirements.\nThe team consists of Mr. Do Manh Hung with experience in Finance, Community Management, Plutus Pioneer, Influencing and Inspiring Coaches, and Fimi Course Lead Instructor. Especially the team includes Fimi Community: Established for more than five years with 120 videos, more than 15 thousand subscribers, 554,000 views, and more than 138 thousand watch hours. The three carefully selected fimi Core teams to have Cardano expertise.\nEnthusiastic team, vibrant community, with a lot of content posted daily. The work is divided and appropriate for the members. The members are clearly divided into tasks in accordance with each person's experience. Everyone can check the information quickly through the attached link.\"", "q1r": 5, "q2": "The measurement indicators are clearly stated, clearly explaining the meaning and measurement of the indicator. There are four metrics to measure:\nThe number of participants, the second is the number of topics presented.\nThe number of questions in the meeting.\nThe talk view on youtube.\nThe proposal results are verifiable through the community platforms where the project will post the talk shows. Checking the page through youtube can check the number of talk shows held, the number of views, and the number of reviews.", "q2r": 5, "assessor": "z_assessor_3067", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 10002, "q0": "The proposal identifies the problem to raise vietnamese awareness of Cardano so that it can be applied to real life by 2022. It's a great idea to have a reward mechanism that encourages members to learn cardano's news and materials. The proposed solution has a clear impact on the cadano ecosystem. Talkshow is a good way to convey to me thereby raising the awareness of Vietnamese people about Cardano and can be applied to real life. The topic that you have come up with is practical for users to grasp what cardano is blockchain is. The solution to the challenge is appropriate. The implementation of the future expansion of the proposal is of interest, the implementation of the proposal shows us that it has met the learning needs of the Cardano community. The proposal presents risks in the implementation process in line with the problem, it is reasonable to offer a solution to supplement the required amount for the ADA slide for Fiat money. For topics that revolve around cardano/blockchain there is a lot of selection, ensuring priority over what is needed in the knowledge exchange in blockchain, this makes sense to solve the stated problem.\nRating: 5\n", "q0r": 5, "q1": "Before submitting the proposal at F9, the authors built a large Fimi community, members with certain understandings of Cardano. Fimi with the core teams has developed and has projects implemented on the Cardano platform, owns a YouTube channel content about the knowledge of blockchain with many views, many followers. We are seeing a fairly detailed implementation plan, however the content of the presentations has not yet been stated. With the goal of making presentations, we expect the author to build details of the content over time. Examples: Presentations on NFT, DAO Explanations, DEFIs, Tutorials, introductions to new iohk videos, etc. Pre-build content will be more proactive than waiting for master requests from members. Making weekly presentations makes sense. The number of members performed is appropriate, these presentations are not only made by an individual but the members with the appropriate competence will make presentations. Presentation content should be moderated through fimi's core member. The required amount of $15,000 is less than 10% of the funding for the F9 challenge, the Budget Analysis Table gives in detail, the contents of the use of clear capital, having a spare fund for risk in the $2000 financial risk is appropriate.\nRating: 4\n", "q1r": 4, "q2": "As assessed above the success of the proposal is an increase in the number of people attending weekly presentations. The proposal is carried out cyclically during the implementation period, the presentation is held weekly is what we see and determine the time of implementation. The results achieved by the proposal upon completion are performed correctly. The indicators/KPIs of the proposal have not been specified, the number of participants, the number of topics, the videos published are the estimated figures. The proposed mechanism for performing audits through recorded and posted videos easily performs accurate audits. However, in terms of the increased number of attendees that need to be given, how many active members will actively participate regularly? The proposal is implemented as promised, it brings great value to the Cardano ecosystem.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 18, "ne": 0, "ng": 16, "nfo": 2, "vca_o": 1}, {"id": 10058, "q0": "A project. A very good idea for weekly talk shows to generate experiential knowledge for users who are interested and want to know the potential future value of Cardano Blockchain Technology application. The quick support tool helps users to master the information and analyze the topics related to cardano to some extent, helping to increase the experience for the review members. . Therefore, I believe it will contribute to the creation of elite members voting for the catalyst and dapps for the entire cardano blockchain ecosystem. I completely agree with this project proposal.", "q0r": 5, "q1": "Regarding the time and route that the project proposal offers, I completely agree. Each stage, each detail has an appropriate budget. I totally agree.\nBut I'm a bit curious that the personal link information is too little, if you can add personal information, add many different links such as GitHub, LinkedIn or Twitter for easy checking. will contribute to increasing transparency for this enthusiastic project.", "q1r": 4, "q2": "The project is clearly proposed, but in terms of KPIs, I have a few small incentives to contribute to measuring your success on this one project.\nFor example, how many views and attendees will you gain on your channel per Week and grow every month. Not only that, each week you should estimate how many meetings for the project are on Zoom so that users can grasp participation information more easily. That will confirm the credibility of the community. shared the same passion for cardano and also attracted a lot of new members.", "q2r": 4, "assessor": "z_assessor_3146", "no_vca": 17, "ne": 0, "ng": 9, "nfo": 8, "vca_o": 1}, {"id": 5993, "q0": "I completely agree with the ideas presented in this proposal. It is proposed to build an incentive mechanism for members of Fimi's core team to research deeper into technology solutions and share what they learn with the community. This output fits perfectly with the \"Grow East Asia, Grow Cardano\" challenge given because it increases the participation of the Cardano community as well as Catalyst. Because today the source knowledge is heavily academic or in-depth knowledge that is difficult for a knowledgeable person to continue to acquire. Do that need a people or group who have enough to know the moistene sharing will back to the source of this knowledge in the simplest and easiest to understand style. Thereby helping to raise awareness of the Fimi community in particular and the Cardano community in general, contributing to increasing Cardano's coverage in the blockchain space.", "q0r": 5, "q1": "I completely agree on the feasibility of the project because the proposer knows exactly what work needs to be done to be able to bring a lot of interesting knowledge sharing sessions to the community, i.e. The proponent has detailed here the implementation roadmap. Next is about the budget statement, the proponent has specified for us the work items and the cost for each item which is how much money, and also the cost of hedging in case of ADA price fluctuations. Next is about the experience of coreteam members, I have heard their sharing sessions uploaded on Fimi's youtube channel and find that their knowledge is very deep and have a very good background, so I believe that this proposal will reach support from the community and the fund will be successful.", "q1r": 5, "q2": "About the audit, I think it would be more convincing if the proponent could add here the numbers to measure the project progress such as: #number of spectators attending the Zoom meeting, #number of meeting videos uploaded I think these numbers can be easily calculated because the project has a very quality community with more than 2,600+ members on telegram as well as on youtube reaching 15,900 subscribers. Members' information is also public and includes a link to the profile page for verification. Besides, the proposal also describes in a very understandable and clear way the targeted goals, helping to community understand what value the proposition brings.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 18, "ne": 0, "ng": 17, "nfo": 1, "vca_o": 1}, {"id": 14098, "q0": "Yes, this proposal addresses the challenge, as it will encourage elite members of the community to dig deep into Cardano and then present it to the community to make it easier for busy people and newbies to grasp new information about Cardano. And as meeting will be conducted on Zoom Meeting, All the members will be able to easily access the meeting. Hence, it can be assessed that proposed solution can be impactful.\n\n\n ", "q0r": 5, "q1": "Yes, this plan has high probablity to be implemented as well as be successful, reason being that, Proper recruitment and training will be done for the team who will be presenting the meetings, And after that initial meeting will be executed. And after that the given steps will be repeated every week so that fluency can be achieved in arranging TALK SHOWS.\n\n\n", "q1r": 5, "q2": "Yes, because the meetings will be arranged on ZOOM meetings, Proper attendance will be done hence, Core team will be able to extract the attraction of members in the TALK SHOW, Then after a track can be kept on the topics proposed for the meeting, this will also indicate the amount of work that has been completed by the team, Team will also be able to track the questions asked during the meeting, which will be helpful to see the response of the members.", "q2r": 5, "assessor": "z_assessor_3902", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}], "solution": "Build a rewarding mechanism to encourage members to find out the news, documents of Cardano, then present them to the community.", "experience": "We are one of the largest groups of Cardano investors in Vietnam that has researched and analyzed blockchain projects for many years. Over the years, our core teams have continuously shared the knowledge of Cardano and its ecosystem we have analyzed for the community."}