{"id": 414874, "author": "lamvoi2022", "title": "Tre Viet - VN support channel", "url": "https://cardano.ideascale.com/a/dtd/414874-48088", "category": 26602, "amount": 9950, "description": "Cardano Vietnam community needs a trust worthy place to discuss, update, look up and analyze information about all projects on the Cardano, and provide technical support in time.", "f6_no_assessments": 24, "f6_rating": 4.680555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 1116, "q0": "Vietnam has been a leader in cryptocurrency usage for the past few years. It has the second highest rate of cryptocurrency use according to Statista's 2021 Global Consumer Survey. Unfortunately English proficiency in Vietnam is very low, and prohibits access to up to date information of the Cardano ecosystem for most people. \n\nThis proposal aims to create awareness and educate the non-English speaking Vietnamese crypto community about Cardano's features and ecosystem. The proposers aim to do this by actively providing current information and prompt technical support in Vietnamese via a telegram room, eventually consolidating all relevant information onto a dedicated website where both new and experienced users can access archived information and practical solutions in order to become knowledgeable members of the Cardano community – thus growing Cardano in East Asia.\n\nAfter the VASIL Hardfork when more dApps are expected to deploy, an active Telegram group providing immediate technical support to the expending Vietnamese Cardano community could prove to be highly effective.", "q0r": 5, "q1": "The proposer has laid out a precise plan, schedule and budget for attaining their goal within this Fund9 Challenge. The team has given a doable strategy that is broken down in monthly benchmarks.\n\nThe budget is reasonable for the tasks to be undertaken, the only lack of detail is in how the marketing expenses will actually be utilized. Since it is 20% of the budget, some further clarification could be helpful to voters.\n\nThe team certainly has the qualification to implement their strategy, with experience in creating Telegram bots, creating websites and translating Cardano technical information into Vietnamese. They have shown commitment to the Cardano community by being an ambassador to Genius Yield, operating a Telegram channel on Cardano and expressing their willingness to continue for the long haul.", "q1r": 4, "q2": "The proposers have provided measurable targets for the key performance indicators: tracking users and messages, articles translated and published, support via community donations, bot users and website completion. They have presented a realistic time-frame to achieve the above goals.", "q2r": 5, "assessor": "z_assessor_2207", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 12876, "q0": "There is a lot of information that relates to DEFI, Wallet, and other things that is being updated and published. This includes information about how the Cardano ecosystem is developing, how platform projects are having advantages and disadvantages, and so on. Tre Viet is the one who will assist you in the Telegram channel. I have also joined the group, and the support is extremely enthusiastic and spot-on, and your community is extremely sociable, pleasant, and hilarious. Not only does the team provide knowledge about the Cardano ecosystem, but it also provides bots such as the following: bot that changes wallet balance; bot that looks up information on token prices; ISPO program; ADA price fluctuation bot; The Exchange wallet volatility reporting bot; wallet whale; this not only makes the community the most closely watched on the market, but it also enables the community to track all of its wallet activities.\n\nIn relation to the dangers you pointed out, there are three primary contents to consider: fluctuations in the exchange rate; costs incurred outside of calculation; competition with other information channels; and channel spam bots; and you have also provided them. how to find a solution to that issue. The fact that you do your own research and then provide support and information to the community is sometimes objective. However, because you have a community with members who have a lot of knowledge about the Cardano ecosystem, the community will respond and support again if the information you give is incorrect. In addition to this, it is a very sound and helpful strategy for acquiring knowledge. The proposal struck me as being an excellent response to the challenge posed as East Asia Development and Cardano Development, respectively. As a result, I will award this impact 5 points.", "q0r": 5, "q1": "In regard to the plan for the implementation of the project, you guys provided a road map for the next four months that will allow the channel to be developed into the most powerful channel in the Cardano ecosystem in terms of the quantity and quality of the expertise it possesses. The channel, in general, also possesses a few features and is very close to being finished. You are currently working on adding two new features to the channel and linking to them: Create marketing and communication campaigns in order to entice users to join Tre Viet's Telegram channel at regular intervals (every two months, for example): From Construct Construct, a website that compiles useful information about projects from contributions and shares on the Telegram channel. I believe that the level of particular cost levels for each item, with a total amount of $9,950, is reasonable for the cost and average income of people in Vietnam.\n\nYou have knowledge of information technology as well as community management and team building, which will help you implement this project successfully. Regarding your team, you have two members who are both Cardano enthusiasts and researchers from more than two years ago. And additionally, a group of people who are extremely enthusiastic about their channel. The evidence of this is that even if you are not awarded funding from this fund, you will still carry on with your project and assist the community in gaining an understanding. Cardano ecosystem, which is more comprehensive and possesses the most up-to-date information and knowledge regarding the Cardano ecosystem, which is a wonderful gesture. This feasibility earns a score of 5 points from me.", "q1r": 5, "q2": "The author has been very clear when posting the targets and important milestones, and all of you have posted them on the telegram group, which is currently functioning very well, so that the community can monitor your progress as well as your own progress. Develop the channel so that it can handle larger numbers after 3, 6, and 12 months. In regard to the KPIs that you provide, I believe that it is possible, and reaching those indicators by means of a funded project is not particularly challenging. In light of the information presented above, it is clear that in the not-too-distant future, the Tre Viet channel will play the role of a channel that monitors information, knowledge, and projects related to the leading Cardano ecosystem of the Vietnamese people. I hope someone will sponsor you. This AUDITABILITY receives a score of 5 points from me.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12662, "q0": "The proposal to identify the problem in the challenge that needs to be solved is that the Cardano Vietnam Community needs a reliable place to discuss, update, look up and analyze information about all projects in Cardano, and timely technical support. The proponent clearly demonstrated how it will add value to the Cardano ecosystem by building Tre Viet's Telegram Channel which has become the trusted address of the Vietnamese community in supporting project information. on the Cardano ecosystem. The proponent has taken appropriate measures to address the challenges of the proposal: Tre Viet channel will update information related to Cardano and projects on the Cardano platform, Analyze and evaluate information on Cardano and Cardano platform projects. potential projects and share them with the community, Discuss Cardano and projects on the Cardano platform. technical support about Wallet, decentralized exchange, Show how to take steps to participate in projects or get rewards from projects. share investment experience in projects on Cardano platform, Security knowledge. provide free tools to the community: Bot changes wallet balance, information about token prices, ISPO program, ADA price fluctuations...Tre Viet channel is trusted by the community, so it is receiving more and more contributions from the community, so I firmly believe that this proposal can completely scale up to solve future challenges and I agree 5* recommendation, I completely agree that this proposal will effectively address the challenge.", "q0r": 5, "q1": "The proponent gave concrete evidence of the skills and experience required to implement the Project Manager's proposal Mr. Chau Do- programmer, Community Manager with 2 years + experience About Cardano Ecosystem and Project Moderator is Mr. Lam Nguyen -Community Manager, Community Advisor from Catalyst 8 Foundation. Telegram channel has been operating for nearly 5 months, total nearly 600 users, total more than 21k messages, 150 messages per day on average. The proponent has also identified the necessary team members to implement the proposal including IT engineers, developers, investors, and community managers with 4-5 years of experience above the Cardano platform. The proponent also came up with a budget that I think is reasonable specifically: The proponent requested a budget of $9950 which is divided by: Channel Admins: $1200, Mods in charge of the channel: $900 Marketing cost: $2000 Hosting, server, domain for the bot: $500. Website construction fee: 1500 $, Cost of writing bots, building tools for community service: 1500 $, Cost of researching and publishing in-depth articles: 1350 $. In which, for each type of funding, the proponent clearly states details and specifications for each item with each necessary milestone to help investors easily identify each cost of the proposal. , in addition, the proponent also provides a specific verifiable plan with a contingency budget of $1000 so that costs may arise beyond the original calculation of the team. The reserve fund if not used up and ADA donated by the community will be accumulated to continue developing the channel the next time. The proponent also gave a reasonable timetable to complete the work. Project master plan: Build Tre Viet Telegram channel to become the largest Cardano Vietnam community channel in both quantity and quality. Total time to implement this proposal: 3 months. The proponent has made a very specific, detailed, and clear plan for each month. Challenges and risks related to project implementation have also been considered by the proponent, and for each challenge, the proponent has also come up with specific solutions to address those challenges. I strongly agree that this proposal will be successfully implemented and given the feasibility of this project I will give 5* ", "q1r": 5, "q2": "The proponent provided a detailed roadmap with milestones to achieve: Telegram channel participants increased from 600 to 1000 in 3 months, from 1000 to 1500 in 6 months, and from 1500 to 2500 after 12 months. Number of messages on the channel: 200 messages/day after 3 months, 250 messages/day after 6 months, 350 messages/day after 12 months. The number of bot users: 150 times/month. Metrics and KPIs are carefully selected, and suitable to determine success with the following indicators: Number of users on the Telegram channel, Number of messages on the channel, Number of in-depth analyses published to the community & number of positive reactions, Number of community donations and ADA donations, Number of bots used. The problem is clearly described, and easy to understand, and the solutions given are suitable, easy to understand, and detailed. I give a 5* rating to this proposal and I fully agree that this proposal provides me with enough information to gauge the project's progress and success.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 12465, "q0": "The proposer is suggesting building a Vietnamese support channel through Telegram that addresses the challenge setting impressively to grow the Cardano community. Along with the development of the blockchain and cryptocurrency market last few years, the Cardano community is also on the rise in quantity and quality. However, in a time of information chaos on social media right now making many obstacles to people who want to approach and learn about Cardano correctly and safely. Therefore, creating a support channel for people is very necessary and encouraging. Like any other proposal, this proposal is dedicated to growing the Cardano community on Telegram for the special grow, here is Vietnamese. That is a good idea because  Vietnam is not an English-speaking country so it's tough for people who want to get to know, keep updated and analyze Cardano technology. In addition, there are lots of crypto scammers using sophisticated island fire tricks to damage and harm the Cardano community. it is necessary to have an information channel so that people can exchange scam warning information to help increase community trust in Cardano.", "q0r": 5, "q1": "This project is highly feasible. Creating an information channel using Telegram is not so tough and many community groups have been coming out on Tele. Seems the proposer has one with around 600 members now and they want funded to open and grow it in the next three months. The founder with clear information and experience working on software, the Cardano ecosystem, and leadership as a community manager. However, the project is just in the very first place and the team has not been formed yet. It would be more feasible if the team is formed before raising the proposal. The budget breakdown is listed very clearly and detailed. I do hope the project will be sucessful", "q1r": 5, "q2": "The project is easy to outline for audibility. We totally can check the project KPI through the indicators of their youtube, and the Telegram group such as the number of users, messages, reactions, and research posted. However, the roadmap seems so humble getting more than 400 new users after 3 months and that does not match the budget requested. It should be faster and more ambitious. Furthermore, if it succeeds to reach 1000 members so the number of messages the proposer expects is just 200/day. It means just a fifth of them are active literally. I do think you should modify your plan a bit for better and faster growing up and effects.\n Good luck!", "q2r": 4, "assessor": "z_assessor_3420", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12261, "q0": "The proposal aims to develop the Telegram channel \"Tre Viet\" into the largest Cardano community channel in Vietnam; provide, update and analyze information related to Cardano, actively support the community participating in the Cardano ecosystem. In fact, on social networking platforms such as Facebook, Instagram, Discord, telegram, there are many communities and groups about Cardano in Vietnam attracting thousands of participants. For example, Telegram channel \"Cardano Vietnam Official\" with more than 1800 members exchanging and discussing projects on Cardano. The common point of these channels and groups is to share information about Cardano, exchange and discuss with everyone, but not all of this information is accurate, reliable, the discussion content may not be relevant to Cardano and the support is not good for users.\nThe solutions described by the channel “Tre Viet” will bring to the community quite specific, clear and desirable, which can effectively solve the challenge posed by: providing in-depth information. , accurate, constant updates on Cardano, discussion, sharing, technical support, security; providing free tools for users who already know the Cardano ecosystem and also newbies (newbies). But it will be a big challenge for those involved in this project to ensure all the solutions are successfully implemented because the solutions involve many aspects, topics, and content about Cardano. It requires moderators and project managers to have a broad, in-depth understanding, knowledge, and analysis of various Cardano related topics. The channel \"Tre Viet\" must not only ensure good organization and management of channel content, but also channel participants.\nThe success of this project will make a significant contribution to the Cardano ecosystem in general and in Vietnam in particular.", "q0r": 5, "q1": "As introduced, the Telegram channel “Tre Viet” has been active for more than 5 months and attracts a certain number of users, which is the premise for this proposal.The proponent provided a rather detailed plan. is divided into 3 phases, clearly presents the tasks to be performed in stages. However, I find there are a few places that do not make sense. Firstly, building a website to update information about Cardano and Cardano projects should be launched from the first month. Some in-depth research articles of “Tre Viet” channel should be posted on the website within the first month. Then the marketing campaign, promoting not only the Telegram channel but also the website, increasing the ability to attract users and support information. Second, the proponent should increase the number of in-depth research papers on Cardano and projects. If only 3 articles a month, after 9 months, the channel has a total of 9 research articles, which is quite a small number.\nThe budget analysis presented by the proponent is quite reasonable and convincing.\nRegarding the detailed information, the experience of the people working on the project, I look forward to providing more information of the project manager and operator such as their educational background, knowledge of technical, security (related to wallets and exchanges) to ensure that the knowledge they provide to users is accurate and reputable, the solution proposed by the proponent is successfully implemented. Besides, the proponent also said that building bot, the community service tool is completed, would be more convincing if they could provide more data on the number of users have used their bot.\nI believe this proposal if implemented will be successful but I cannot give 5 stars.", "q1r": 4, "q2": "This project is easy enough to check, the evaluation criteria are very specific, easy to follow, people can easily access the channel to check the number of channel participants, articles, discussion content, project manager progress reports,etc.\nHowever, the level of project success is clearly defined by the proponent through 3 phases: after 3 months, 6 months, and 12 months. The total time to implement this proposal is only 3 months, the budget analysis is only 3 months. So only the milestone after 3 months is to have a specific and detailed plan, the criteria set has a high probability of success. The longer-term milestones of 6 and 12 months do not have an implementation plan or budget, so they are not really feasible and difficult to accomplish.", "q2r": 3, "assessor": "z_assessor_3376", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12069, "q0": "The proposal \"Tre Viet - VN support channel\" has identified a problem in the challenge and that problem has a great impact on the development of the Vietnamese community. The proposed problem is suitable for the challenge, the idea is to provide a solution to help Vietnamese people more convenient in the process of searching and collecting information of the Cardano platform. With the current demand of Vietnamese people to learn this issue is high specifically according to Finder, the use of cryptocurrency in Vietnam (among respondents) is 41%, of which 20% have bought Bitcoin and 17% of NFT holders, Cardano needs an additional reliable, fast and timely information channel that responds to timely and in-depth news about Cardano - a suitable place for community development. Please present the problem clearly and convincingly. The specific solution of the proposal is to build Tre Viet's Telegram channel to become a trusted address of the Vietnamese community in supporting project information on the Cardano ecosystem. From there, it is possible to provide diverse official information about the Cardano ecosystem to Vietnamese people. The proposed team gives specific examples in the presentation with clear arguments with specific numbers from the actual survey. To do this, the proposed team has carefully studied the development and needs of the Vietnamese people, answering the question: How to increase the quantity and quality of knowledge for the Cardano community in Vietnam. Vietnam? The specific goal of the product you recommend is: Tre Viet channel helps develop the Cardano community in Vietnam by actively supporting the community, helping to remove technical barriers for newcomers. Then build a website to aggregate information about projects and other valuable shares such as wallets and security, for the community to easily find. The proposal identified a number of risks in the implementation process and proposed solutions to overcome all those risks. You have pointed out three risks in the process of doing work and have solutions to overcome and limit those risks. In the first risk you mentioned is competing with other communication channels like Facebook or other Telegram or Discord groups. To solve the problem, your solution is Tu Viet Channel providing better quality information, closer to the community, in charge of the self-research team, with continuous support from community care staff, respond quickly and promptly .. The second risk the group mentioned is due to bot spam channels, users provide untested information and solutions, you research and develop the management and control team regularly administer and remove junk information, information unrelated to Cardano and projects on the Cardano platform. All information posted on the Telegram channel needs to be analyzed clearly. The final risk due to the nature of Telegram, the amount of messages will be very large, important information can be difficult to find. Communities may miss out on important information because they may not be able to read all the messages. Ban has come up with a solution to build a website that aggregates important information. Everyone can easily check the important information of the project. Also you can think more about the risk I mentioned below that updating information may be outdated, slow compared to official information from Cardano ecosystem and the necessary solution is to build a successful team. staff have enough experience and capacity to receive and process that diverse amount of information. I rate: 4 points.", "q0r": 4, "q1": "Proposal to provide a time table with detailed and reasonable work schedule. The team presented a plan of proposed goals within 3 months with a detailed monthly plan, meticulously stated in the project proposal. Example of the first month: Announced Telegram channel support staff and in-depth research team, implemented a marketing campaign to promote Tre Viet channel to the wider Cardano Vietnam community through other platforms… The results of the proposal implementation measure the project's progress, which can be easily tracked by visiting the proposal's Telegram channel and viewing a weekly report on the project's progress. Once implemented, all major milestones will be widely communicated to the community. The proposal accounts for 3.98% (9950 USD) of the Challenge's budget and has a plan to use spending appropriately for each specific activity. able, transparent, open. The alternative proposed in the supplementary budget is quite reasonable. However, an additional provision is needed in case the channel receives more support than expected, the Vietnamese community is interested in increasing the number of mutations. Proposing to assign specific tasks to each member; Experience related to the assigned task as a team of IT engineers, developers, investors, community managers with 4-5 years of experience on the Cardano platform; The identities of team members are easy to verify. List of core groups and easily identifiable members with telegram, Twitter, Github accounts. I rate: 5 points", "q1r": 5, "q2": "Proposal provides KPI, making it easy to accurately predict the effectiveness of the proposal and easy to test.The proposal has four metrics/KPIs to measure project performance and progress (Telegram, Youtube). Accessible anytime, anywhere clearly shows the number and results of work. The proposal is clearly defined as feasible, very successful and has been successfully tested in practice. The success of the proposal clearly describes the results achieved with the Number of Users on the Telegram channel;Number of messages on the channel; Number of in-depth analysis published to the community & number of positive reactions; The number of donations and the number of ADA donations by the community; Number of bots used. The goal of the proposal is to shorten the time to find information for Vietnamese people interested in Cardano and to develop the ever-growing Cardano Vietnamese community. Proposal This proposal is brand new, but there is already a test product that has achieved some success in practice The Telegram channel has been active for more than 5 months and has a stable visitor count. If funded this proposal is in the top 20% to be voted on. I rate: 4 points.", "q2r": 4, "assessor": "z_assessor_3353", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11975, "q0": "The success of the proposals in the previous funds has had a significant impact on the community in Vietnam. The number of people who need to learn about blockchain technology and the Cardano ecosystem has increased sharply. However, the number of channels and forums for people to discuss, update, look up and analyze information about Cardano is still limited. Realizing that inevitable need, the Tre Viet team decided to expand the scale of their Telegram channel. This channel has long become a trusted address of the Vietnamese community in supporting project information on the Cardano ecosystem. In Vietnam, there is a vague understanding of blockchain, and many people think blockchain and cryptocurrency are essentially one. The development and expansion of channels like this make the understanding of blockchain more and more accurate in the Vietnamese community and the knowledge of the Cardano ecosystem. I fully agree that this proposal meets the criteria of the challenge.", "q0r": 5, "q1": "The proposed team is committed and experienced in the area of knowledge, which is necessary and will help the project to advance. There is a link to verify the information (e.g., Linkedin). The work progress in three months is specifically built and divided into three main milestones. The proposed budget is very well allocated and detailed. The proposed team also carefully reserves $1000 for costs that may arise beyond the team's original calculation. I believe the feasibility of the proposal deserves five stars.", "q1r": 5, "q2": "A significant risk associated with the proposal is competition with information channels from other groups. I believe that different information channels will all develop their communities, and all can harmonize for joint development in the Cardano ecosystem in particular and human society in general. The criteria selected to evaluate the transparency of the proposal include the number of users on the Telegram channel, the number of messages on the channel, the number analysis published to community & number of positive reactions, the number of donations & number of ADA donations by the community, and the number of bot uses. These KPIs are all framed with a specific value three months after the proposal implementation. It will allow the community to understand the project's progress and direction.", "q2r": 5, "assessor": "z_assessor_3321", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 11797, "q0": "Proposal Tre Viet - VN support channel has an idea suitable for the goal of the challenge Grow East Asia, Grow Cardano. I see this proposal, the author team has relied on their inherent strengths when implementing community development from their active telegram channel. As far as I know, Vietnam is a country that is currently ranked 2rd in the world in terms of the prevalence of cryptocurrencies, this number has not stopped but is growing in the future. I completely agree with the author's way of posing the problem when stating that the Vietnamese blockchain, especially the Cardano-loving community, needs a reliable place to discuss, update, look up and analyze information, Timely technical support on all projects on Cardano. This proposal is born to partly solve the goal of the challenge to develop the Cardano ecosystem in East Asia and especially in Vietnam.\nI find the unique and outstanding feature of the proposal is that the author group in many development community channels today on the application such as facebook, tiktok, twitter... chose telegram because this application is gradually being used by people. It is mostly used by individuals who participate in the financial market because of the benefits it brings such as simple, light, fast interface, sync messages everywhere, no flickering, no dependencies depending on other infrastructure, high safety and security, the ability to search and transfer information files quickly, can create groups of up to 200,000 people or create channels to broadcast content to an unlimited number of audiences term. I think this is also a huge difference when the authors know how to choose the most optimal platform, which is their strength to build this proposal.\nIn Vietnam, I find it very necessary to develop an in-depth knowledge channel about the Cardano ecosystem. The solutions proposed by the team have largely satisfied me, and I believe in helping me solve the major problems encountered when learning about this community such as technical problems for people newly joined, there are many high-quality market analyses, reviews, comments, information on new projects and valuable shares about wallets and information security. These are also issues that need to be promoted by the Cardano community to help the community grow and go far in the future.\nI will give the proposal impact a score of 4 out of 5 because of how the proposal solves the problem and how effective it is on the challenge.\n", "q0r": 4, "q1": "The project will be implemented within 3 months, the author team has given specific timelines for each month of implementation, the major tasks that need to be done in the month are presented clearly, specifically, in detail. Understandably, the team has worked very seriously and properly. It is clear that the plan and its execution were well laid out by the team members.\nThe grant application budget has been divided for each item, the cost is explained in detail and clearly for each item and I find this expense in Vietnam to be completely reasonable. At $9950, which is 3.98% of the challenge's total budget is a viable amount for this project.\nThe proposal foresees 3 main risks that can limit the success of the project: the risk of competition with other media channels, bot spam channels, users providing untested information and the number of messages to the channel is too much, making it difficult to find or miss out on good information and ideas. I found the risk reduction solutions also given by the project team to be very clear and easy to understand.\nProposers of the project are people who have many years of experience in the blockchain market in Vietnam, Mr. Chau Do and Lam Nguyen are the 2 people who directly manage and run the project and have participated in many projects in the ecosystem Cardano. I find them fully qualified to carry out this proposal. From the information the team provides on community channels such as telegram, github, twitter, linkedin, I can completely verify their identity and believe that this is true information.\n  I give 4 points for the presentation of the feasibility of this proposal because of the clarity and transparency in the project's project schedule and budget.\n", "q1r": 4, "q2": "In my opinion, this is a monetizable project, the community can completely monitor the progress and success of the project continuously and closely through the implementation plan and budget paid. For me, the team needs to do the right thing in terms of updating the work done on a monthly basis, corresponding to the amounts spent and the results of the expenses brought on their channel to be public and transparent help the community track the project.\nI see that the project has given a lot of specific indicators and numbers to measure the success of the project, these numbers are completely reasonable and with the current development of the channel they are completely successful achieve these milestones after 3 months of implementation. These numbers have also been regularly updated by the team and reported to the community on a weekly basis. Criteria are given for evaluation such as the number of users on the telegram channel, the number of messages on the channel, the number of in-depth analysis published to the community & the number of positive reactions from the community, the number of donations and the amount of ADA donated to the community, the number of times the bot is used. In addition, there are numbers with a very clear roadmap to evaluate success such as the number of people participating in Telegram channel (increased from 600 people to 1000 people after 3 months, increased from 1000 people to 1500 after 6 months, up from 1500 to 2500 after 12 months), number of messages per channel (200 messages/day after 3 months, 250 messages/day after 6 months, 350 messages/day after 12 months) and bot users: 150 times/month.\nThis is a new proposal and have never participated in fundraising at previous funds, I see that the community can completely follow more information of the proposed group from the links to youtube, telegram in the proposal.\nBecause of the completeness and detail in terms of the content presented, I will give an absolute score of 5 points for the transparency part of this proposal because it has met all the requirements I set out.\n", "q2r": 5, "assessor": "z_assessor_3281", "no_vca": 11, "ne": 4, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11283, "q0": "This suggestion is very helpful and certainly achieves the goals of the challenge. Because it aims to create a trusted place to discuss, update, look up and analyze information about all projects on Cardano, and provide timely technical support through the Telegram application. The proposal presents how it will add value to the Cardano ecosystem. Tre Viet's Telegram channel has been operating for nearly 5 months, with a total of nearly 600 users, I believe the number of participants will increase rapidly. I see the proponents have great ideas, they will build a website that aggregates information about projects and other valuable shares such as wallets and security so that the community can easily find it to help raise money. high level of awareness among East Asians about Blockchain. The team also gives very detailed and reasonable risk challenges and solutions. Overall, I find this proposal very viable and scalable to address future challenges.\n", "q0r": 5, "q1": "The proponent provided a very detailed roadmap with many milestones. The total time to implement this proposal is 3 months, the proponent goes into presenting a detailed plan for each month to build the Tre Viet Telegram channel to become the largest Cardano Vietnam community channel in terms of both volume and volume. quality. The budget is built based on the clues of work, I find such a payment level to be reasonable to achieve the set goal. The proposed team needs an additional contingency cost of $1000 to cover the costs incurred, if not used up, it will be accumulated to continue developing the channel the next time. I see the people implementing the project are people with experience in the Cardano Ecosystem through the references and links that the team provides.\n", "q1r": 5, "q2": "The proposal has a roadmap with specific timelines and measurable metrics. The data to evaluate the success of this proposal is relatively clear, intending to increase the number of people participating in the Telegram application from 600 people to 1000 people after 3 months, after 6 months increasing to 1500 people and after 12 months the number of people increased to 2500 people. The number of messages and the number of Bot users also increased. This is a new project, the success of which matches the challenge posed, increasing the engagement of the Cardano community and the Catalyst team with East Asian residents.\n", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11137, "q0": "As can be seen, Cardano ecosystem have more than 1000 projects so it is very difficult for Cardano Community in Vietnam to keep track of each project and identify potential projects. In my opinion, the proposal can solve this problem and improve the experience for the Vietnamese Cardano Community. Furthermore, Tre Viet channel shows how to take steps to participate in projects or get rewards from projects that will be a great help to those who are participating or intend to participate in the projects in Cardano ecosystem. In addition, Tre Viet channel also provides a variety of bots to the community for free which make it easy for the members to follow fluctuations of Cardano. If this project is funded, Cardano Community in Vietnam will have a website to aggregate information about projects and other valuable shares. I believe this will increase the value of Cardano Community in Vietnam.", "q0r": 5, "q1": "In general, the two main persons of Tre Viet team who will work on the projects seem very reliable because of some reasons. Firstly, both of them have been working on the Cardano platform for several years, especially Project Manager: Mr. Chau Do. He is the one who lead Tre Viet team, a team to research and evaluate blockchain projects on Cardano platform. Beside being a member of Tre Viet team, Project Executive Mr. Lam Nguyen is also a member of FIMI translation team, a famous team in charge of translating documents about Cardano blockchain in Vietnam. As a result, it is not difficult for Tre Viet team to research, evaluate and then convey to the Vietnamese Cardano Community. As is seen, the proposed team provided a detailed plan, including timeline and key milestones as well as a plan for the disbursement of the received fund. It's commendable that the group has foreseen the risks they will face. The most important thing is the competition with other information channels but I believe that the competition will make them become stronger.", "q1r": 5, "q2": "From my point of view, everyone can easy to track the progress of the project by visiting the Telegram channel of Tre Viet team and viewing weekly reports of project progress. if that is not enough to audit, we can join the Telegram and see what the proposed team achieve. For example, we can read in-depth analysis published to the community and audit the quality. With that, it is easy to see if they're really doing well. For my part, I believe this project has no reason to be cautious about auditability.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 10950, "q0": "This is a proposal to provide an information support solution for the Vietnamese community to help newcomers remove technology barriers, and a large market, and help old people update the fastest information about Cardano. In my practical experience, this idea is interesting because now the Cardano platform is a project instead of FOMO like other projects in the market to inflate the price, Cardano focuses a lot on sustainable value. It is even more necessary for the community to know the true value of Cardano. Based on the target metrics set by the challenge, I feel that the proposed problem is well suited for this challenge. The way Tre Viet offers solutions related to both information channels as well as timely technical guidance, and bots that monitor balances or price fluctuations is very practical to help investors and create value for the community. The proposal clarifies the challenges of community development, demonstrates that the team is also experienced in community development, and offers specific solutions related to Spam, competition, or omission. Regarding the implementation challenge, important information can be missed on telegram, I can suggest you use more Discord because there the information is divided very logically and easily accessible so you do not miss information. I appreciate the solutions and suggestions to add hedging measures more suitable for them so that they can solve the challenges of implementing the proposal. So I give the impact of this recommendation 5 points.", "q0r": 5, "q1": "I find this a viable proposition for the following reasons: \nThe first is that they provide a very detailed budget and the budget levels are very suitable. It's not over-budgeted, but very appropriate. I work in the marketing industry, so I know this is a suitable cost for positions in the budget part of the proposal. Next, is their detailed plan which is very reasonable, and divided into months. At the same time, there are specific milestones related to the implementation plan. And these plans are completely realistic and it is highly feasible. I am also a marketer myself, in my experience, with this plan alone, you can use an important factor to attract users, that is to use bots. Because now the bot supports the user community very well. And especially, I have experienced the bot to look up your balance fluctuations on telegram, I realized that the bot is very effective. So you can use bots as a method to reach more users in the community. And can use promotional campaigns related to in-depth research in the Cardano ecosystem, especially the community that uses a lot of bots related to token prices, ISPO information, price fluctuations ADA or volatility of whale wallets... I look forward to having you complete it. At the same time, the feasibility of the proposal is highly appreciated because it is based on the team, the team is experienced, and people. By observing your Telegram accounts as well as Twitter, I realize that they are all sharing quality information and contributing a lot to the community. Also, your channel has been active before writing this proposal for 7 months as I follow on youtube and longer on Telegram. And the community is very active on social networking platforms. I appreciate their spirit of helping the community, because they did it before applying for funds in Catalyst, and helped the community a lot. So for feasibility, I give 5 points.", "q1r": 5, "q2": "About the ability to audit yourself give 5 points. Because the proposal has enough parameters to monitor and evaluate transparency. The proposal gives very clear indicators of how many users interact with a particular community. It will be better if you can update what you have done and where you have implemented it so that the community can easily follow and support you. In addition, the community is ready to donate more for you and transparency greatly supports this.", "q2r": 5, "assessor": "z_assessor_3211", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 10808, "q0": "I believe the project is perfectly suited to the challenge objective. The idea here is to support and transmit project information on the Cardano ecosystem to the Cardano Vietnam community through the Tre Viet channel. This scheme is not new but it is necessary. The author introduced the proposal very well. The benefits that the channel brings to the community. What information will be updated and shared on the channel; tools that the channel provides for free to the community? The author also offers solutions to solve existing challenges. All presented very convincingly.", "q0r": 5, "q1": "This part of the project is perfect. We know exactly what will be done within 3 months of the project. In addition, there is detailed information about what activities will take place each month. The budget of the project is allocated clearly and reasonably. The level of detail is also very good. We also know their names, roles, and how they relate to the Cardano ecosystem. They also have LinkedIn profiles and other accounts such as Telegram, and Twitter for us to verify the information and contact if needed. ", "q1r": 5, "q2": "The auditability is workable. The criteria for evaluating project quality are presented in detail. The community can also get this information through the Telegram provided by the group. The success of the project is also described through the numbers achieved in the number of participants and the number of messages on the channel. It is a pity that the author did not mention what positive impact the project will bring to Cardano. However, I will still give this part a perfect score because the testability is very good. ", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10530, "q0": "The proposal aims to further develop the cardano communty in Vietnam by building and growing a vietnamese support channel. The current telegram group is already very active, with over 600 users, 150 messages a day on average. The authors have already published some cardano project analysis videos on youtube, with good community engagement. Funding for this project would be to expand on this already built community, and upscale the content that is offered. I think their work is very good quality, educational, easy to understand even for newbies. The community seems dynamic, and active everyday. The author'sp plan to builda website where news and information can be posted will make cardano more accessible to the vietnamese community. The research articles will be very interesting and help vietnamese users gain ides, and learn from successful projects from the english speaking community.They already have a very solid foundation, and I believe with the support of funding this project will definitely bring more vietnamese users int the cardano platform. I think this proposal answers the challenge very well.", "q0r": 5, "q1": "This proposal is built upon an already solid foundation, and the community seems well-established. The team is very experienced in the crypto space, and judging from the content that they have put out, they seem like good teachers, and are very good at explaining technicl aspects in a way that is easy to understand to newbies. The telegram group is also very dynamic, and helpful. The community seems very engaging. I believe the team is very capable, and I hope they can keep growing their community. The budget seems reasonable, and the timeline is very manageable. However, I think the marketing aspect will be crucial in the success of this proposal, and needs further thought put into it. Currently, the authors plan to advertise to Cardano users from other communities. I think it would better to aim to advertise to crypto-users from other ecosystems, and even complete crypto-newbies. The team is more than capable of explaining the basics to the cardano-unaware, it would be a waste to not broaden the audience. I also think it would be better if the project also had a way to link the vietnamese community to the international english speaking community, so that vietnamese users can interact with other users directly. Overall, I believe this proposal will be implemented sucessfully, though i believe they can aim to be a bit more ambitious.", "q1r": 4, "q2": "The author offers auditability through the engagement numbers from the telegram group (numberof messages, number of users, bot usage, donations). While I think this is adequate to get a general idea of the success of the project, I think telegram is a little messy to post updates on, the updates can get washed away by the chat activity. Perhaps a platform that does not require signing up, or joining will be more suitable to post updates and important progress reports on, such as twitter. This will also help provide updates on the website, which i believe is necessary to reach a wider audience, as telegram is still not the biggest or most preferred platform to chat on. Overall, while i believe thisproject can be audited, i would like better ease of access for non-telegram users.", "q2r": 3, "assessor": "z_assessor_3189", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "In the Auditibility section, the PA gave a score that did not correspond to the comment: “Overall, while i believe thisproject can be audited, i would like better ease of access for non-telegram users.” however only rated 3 stars."}, {"id": 10206, "q0": "Through the creation of a Telegram group called \"Tre Viet\" where group participants can exchange all the information they know and need to know with the main purpose of updating information, providing technical support. art, sharing and a place to provide free tools for the community\nfrom here they create an environment that helps know and don't understand deeper knowledge of Cardano brings people to come and understand better. besides they also presented risks and challenges and provided solutions for these (Risks: exchange rate fluctuations, costs incurred outside of calculation)\n→ reserve 10% more money for this, ....), the group has also been active for nearly 5 months with a very good number of members and interactions (600 users, more than 21k messages), giving project-related links (https://t.me/Cardano_ECO_VN,...) . It can be seen that this is a project that is very suitable for this challenge and needs to be expanded and developed in other places, from here people will come to, better understand, and love the Cardano community.", "q0r": 5, "q1": "The project has the master plan to make Tre Viet Telegram channel become the largest Cardano Vietnam community channel in both quantity and quality, implementation time within 4 months with clear plans, however Therefore, it is necessary to indicate a specific timeline in reality to make it easier to follow, besides, the fees they offer are quite reasonable, the project members are all experienced in the necessary fields. and have a clear identity address (Telegram: https://t.me/ducchau18\nTwitter: https://twitter.com/DucChauB,...), the group also gained the trust of participants and closed to help the channel survive and develop (the total amount of money ADA has donated to Tre Viet wallet. : 666 ADA). This is a very potential project when it has been deployed and active for a while, building a community and the success of the project is very very high.", "q1r": 4, "q2": "The number of members as well as the interaction is essential, but the success of a project needs to be worth it, you should have a specific data about what your team has brought. return to participants such as data on total ADA transactions (eg: number of donations) or interactions on the posts your group makes, not the whole number of messages in a day, to be successful, The project should pay more attention to this part.", "q2r": 4, "assessor": "z_assessor_3166", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 9803, "q0": "The proposal aims to support the Vietnamese Cardano community of the Tre Viet team. They have come up with a very clear community-driven solution by providing technical support, information, tools and bots for free to the Vietnamese community. It can be seen that their project has been operating relatively effectively and has had a positive impact on the Cardano ecosystem, even before going to Catalyst. The problems of the Cardano ecosystem and the projects on it are supported and enthusiastically explained by the Tre Viet team to the community. I myself have received a lot of support from them. I highly appreciate the bot systems and tools they provide for free to the community such as bots reporting account fluctuations, checking ISPO information, updating token prices… These tools and bots are completely replicable for many more users, even to the international community.", "q0r": 5, "q1": "For the Tre Viet team, this will be a project that is not too difficult for them, because of the fact that this community channel has been built and operated very well in recent times. I am very impressed with the numbers of the channel that have done such as the number of messages, the amount of ADA community donated to the project. Even recently when the market went down, most of the community groups on Telegram could no longer maintain regular activity. Tre Viet team has long been known in Vietnam as a team with deep expertise, technical knowledge and a lot of support for the Cardano Vietnam community. They have also successfully organized many livestreams sharing in-depth topics such as Oracles, Empowa project… They have received a lot of positive feedback from the community. Coming to Catalyst, they also made a proposal with a reasonable roadmap, clear timelines and achievements. Another inherent problem of Telegram groups is that spam and scam messages caused by bots have also been foreseen and solved by the proposed group. In fact, with the number of about 600 members and the amount of interaction of about 100-200 messages a day, they are currently doing very well. I believe that they will keep that success in the future.", "q1r": 5, "q2": "The proposal has provided a set of KPIs to evaluate the quality of their work as well as a way to evaluate progress and implementation. A very good point of this project is that the information related to the project's KPIs such as the number of members, the number of messages, ... are all quantifiable numbers. They are all easily measurable, verifiable, and highly transparent. The project has also clearly defined the goal of becoming the largest Cardano community channel on Telegram in both quantity and quality. However, the project's goals are being relatively humble. I think the Tre Viet team can absolutely do a lot better than that.", "q2r": 5, "assessor": "z_assessor_3099", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 9566, "q0": "\"The proposed solution is to create a place with all the necessary elements so that every Vietnamese can participate in the Cardano ecosystem. This is a very ambitious proposition. Users participating here can get information about Cardano and projects on the Cardano platform, and can also be guided to participate in projects through support for using wallets, and trading via decentralized exchanges. and equipped with security knowledge. The project also supports Vietnamese people with tools to control investments by Bot. This could be a very smart solution to get the community involved in the Cardano platform.\"\n\n“With a new and difficult to access technology like blockchain, effective dissemination of information to the community is extremely important. The solution that proposes to solve the challenge is possible when it comes to removing technical barriers for newbies. This is the biggest barrier, overcoming this condition, it is only a matter of time before the development of a strong Cardano Vietnam community.”\n\n“For a community to develop sustainably with loyal supporters, quality information and enthusiastic support are very important. The risk that the proposal presents about competition from other channels is entirely correct. With what you are doing, I believe that the solution you offer completely overcomes this risk. Combining the Telegram channel and the aggregate Web is a good solution to address the risk of spam bots and excessive messages from the community.”\n", "q0r": 5, "q1": "\"The process of implementing the proposal has set out specific milestones for each month. I have seen progress in channel administration and promotion. It would be better to propose to give progress on channel quality. Publishing 3 research articles also need to be more specific. For example, are these studies published on reputable news sites? If you can do this, I believe your proposal will be a reliable source of information.\"\n\"The budget is allocated in detail for each type of work and is suitable for the income of Vietnamese people. However, the active contribution from the community is very important, so you should add cost to reward these contributions.\"\n“With 2 people to carry out the project, I think your force is quite small. Need backup people for important positions. With the work you are doing, I believe that the proposal will be successfully implemented. Because before there was no proposal you guys did a pretty good job on this. However, there needs to be a roadmap for the time to come when the channel grows bigger and bigger.”\n", "q1r": 4, "q2": "“The metrics you give are completely reasonable. I am particularly interested in the number of in-depth analyzes published and the number of positive reactions. This will be the premise for other indicators to develop. In addition, you also support the community through the Web. If possible, you should include a Web visit metric in your proposal.”\n“The success of the project is confirmed by the increase in the indicators, I agree with the increase in the number of users and the number of messages that you give. However, it should be emphasized that the number of messages must be from actual users, not spam messages. You guys need to update this to increase the transparency of the proposal.”\n", "q2r": 4, "assessor": "z_assessor_3065", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9400, "q0": "The proposer mentions a fact that Cardano Vietnam community needs a trust worthy place to discuss, update, look up and analyze information about all projects on the Cardano, and provide technical support in time. Therefore, he suggests to use Tre Viet's Telegram channel to support project information on the Cardano ecosystem. Through the interaction between the engineers and users, Cardano value will surely be raised, more and more people understand deeply about the content inside and this channel will surely attract more user to Cardano team. The problem is identified clearly and the proposer has addressed the challenges effectively. I evaluate mark 5 for this criteria.", "q0r": 5, "q1": "First of all, this project is stated clearly in using the estimated costs for related activities. The author intends to use the budget of 9950 USD for Admin for operating and managing the of the channel; Moderator to support the admin; Marketing expense; Cost of hosting, server, domain for bots; Website construction fee; Cost of writing bot, building tools to serve the community; Cost of research and publication of in-depth articles; Contingency cost. This budget is logically and clearly. Second, the team members of this  project may have proper experiences to run the program. The project manager has more than 2 year experience in Cardano Ecosystem, building and operating Telegram Bot of projects. He is also the manager of a community group dedicated to researching and discussing the Cardano ecosystem. Therefore, I believe he could run this project smoothly for broadening further value of Cardano. The second member, Project Executive, is the team member of Fimi translation team and a CA of Fund 8. He is in charge of community management. I hope to have further information of his skill to manage the community. Regarding the challenges for this project, the author states out 3 points which are the competition with other information channels, channel spam bot, The risk of missing important information due to large amount massages. To solve these problems, the author suggests to build a unique channel of quality information, closer to the community; regularly admin and remove spam information; build a website to synthesize important information for users easily access useful notes. These solutions are good and can be moderated well during the project implementation. I evaluate mark 5 for this criteria.", "q1r": 5, "q2": "The author would like to build Tre Viet Telegram as the largest Vietnamese Cardano community channel in terms of quantity and quality. The detail plan is drafted in 3 months, including: preparation of support staff for in-depth research team; carrying out a marketing campaign to promote Tre Viet channel to the broader Cardano Vietnam community; updating information and taking care of the community; publishing in-depth research articles on Cardano or projects on the Cardano platform. Through these activities, we can see that this project has good plan to deploy. The proposal is clear and the problem solving is easy to understand and follow. Referring the KPI, I appreciate the target number stated out for evaluation since it is easy to follow and assess whether this project is successful or not. Particularly, the writers suggests the specific number of people joining the channel, the specific number of messages after 3/6/12 months and number of bot users per month. In conclusion, I totally agree with proposer and evaluate mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 9102, "q0": "The Cardano Vietnam community needs a trusted place to discuss, update, look up and analyze information on all Cardano projects and provide timely technical support. The project will build Tre Viet Telegram channel to become the largest Cardano Vietnamese community channel in terms of quantity and quality. Tre Viet channel will be the place to update and discuss information related to Cardano and projects on the Cardano platform; analyze and evaluate information about potential projects and share with the community; is a place to provide technical support for wallets and decentralized exchanges; is a place to share investment experiences in projects; providing free tools to the community… Therefore, Tre Viet Channel will help develop the Cardano community in Vietnam through this active support. Tre Viet channel is currently being trusted by the community in Vietnam, increasingly receiving community contributions. The goal of the project is completely in line with the challenge's goal of increasing participation in the East Asian resident Cardano community, increasing the quantity and quality of proposals from East Asia...\nThe project also gives the risk of competing with other information channels such as Facebook, other Telegram groups, channel spam bots, a large number of messages so important information is difficult to find... they have also come up with solutions to reduce them.\n", "q0r": 5, "q1": "The project is implemented in 3 months, the first month: implement a marketing campaign to promote the channel, update information, take care of the community, publish 3 in-depth research articles on Cardano or projects on the Cardano platform; the 2nd month: building website, updating bots, publishing 3 articles… The project has specific work for each month so it is easy to implement successfully.\n\nThe proposal requires a budget of $9,950 for cost items such as marketing costs of $2,000, research and publication costs of $1,350, costs for admins to run and manage the channel $1,200, contingency cost is $1,000… I find this cost reasonable.\n\nThe project implementation staff includes 2 people: 1 person with experience in building and operating telegram Bot, team management, programming and experience in Cardano ecosystem and 1 person with experience in community management, experience translation, specializing in blockchain and Cardano projects. I think they have enough qualifications and experience to carry out the project.\n", "q1r": 5, "q2": "The community can easily monitor and control the progress and results of the project via their Telegram channel. They also have weekly reports on the progress of the project. They also provide criteria to evaluate the quality and results of the project such as: The number of users on the Telegram channel, the number of messages, the number of times bots are used... These criteria can be measured and the community can check them.\n", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 6972, "q0": "\"  - I admit that cardano is currently developing very strongly. Already many people around the world know about Cardano. in Vietnam however. Cardano is still unknown to many people, with the idea of ​​​​creating a Channel to support Tre Viet - VN, I think this is a very good idea.\n\n   - Here the proposed topic has raised the issues that are. The Cardano Vietnam community is in dire need of a reliable place to discuss, look up and analyze project information on Cardano as well as provide timely technical and support. I find the issues raised to be well-suited to the challenge.\n\n   - Following that, the proposed topic also gave solutions to solve the above problem that, Tre Viet's Telegram channel has long become a trusted address of the Vietnamese community, Here the Vietnamese community Nam can chat, exchange, support project information on the Cardano ecosystem with each other and help each other develop. So far Tre Viet channel helps develop Cardano community in terms of quality. There are more and more articles sharing and analyzing value on the channel, as evidenced by donations to Tre Viet wallet: 666 ADA). I found the solutions outlined above to be very suitable for solving the problems in the challenge.\n\n    - In addition, the group also pointed out the risks that the project may face such as exchange rate fluctuations causing additional costs to be incurred, Having to compete with other provinces is also a risk. , and channel spam bots, are also problematic. However, the above risks have been proposed by the group to reduce those risks in a very reasonable way. and I completely agree with the options of the proposed topic.\"", "q0r": 4, "q1": "\"    - In the section provide a detailed plan, including progress and milestones. I see that the team has identified a specific timeline that will complete the project in a period of four months and has broken down into many steps to complete I think the above timeline is completely appropriate. reason to complete the assigned tasks. There have been 11 goals to be achieved during this time period as detailed in the proposal and especially the progress of the project is easy for the community to follow.\n\n  About the budget. with a budget of $9.950 and split it across 8 different expenses. i think with the split sorted as in the proposal is perfectly reasonable. and the team was also very careful to leave a backup in case of lack of budget. All expenses of the community budget can be easily tracked\n\n    - In the section provide detailed information about the people who will work on the project. Here, I see that the proposed topic has raised two members, There has been a specific assignment of tasks for each member. Through research, I found that the working capacity of the members is very good, they have has many years of experience in programming and management. The identity of each member is easy for the community to track at the link.\"", "q1r": 5, "q2": "\"   -   With a description of what you will measure to track your project progress. I see the team has raised a few metrics like, Number of users on Telegram channel, Number of messages on the channel, Number of insights published to the community & number of positive reactions, Number of community donations and ADA donations, and bot usage. I find the indicators listed by the group to be very complete. I have no further comments on these indicators.\n\n   - About the success of the project. The team has listed a number of successes in which there are 3 main successes that are, The number of Telegram channel participants increased after 3 months, The number of messages on the channel increased to 350 messages / day, and The number of bot users : 150 times/month. I see the above successes as closely related to the campaign.\n\n  - In the funding section. this is a new proposal so it has not been funded yet, but it is very good and practical. I fully support this proposal.\"", "q2r": 5, "assessor": "z_assessor_2856", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 5217, "q0": "Currently, there is a little information about Cardano-based development projects in Vietnam. Especially the information that has been carefully reviewed and analyzed before being sent to the cryptocurrency investor community is even rarer. Therefore, I believe that your proposal will bring a lot of benefits to investors holding ADA in Vietnam, helping them to have more confidence in the development of Cardano and also hold token built-in Cardano Blockchain", "q0r": 5, "q1": "Tre Viet is one of the rare telegram groups in Vietnam that focuses on introducing Cardano-related projects and information. Especially, Mr. Chau is currently the ambassador of the Genius Yeld project - one of the major projects developed on the Cardano Blockchain platform. Therefore, I believe that the experience and knowledge of the project members will help the project to succeed.\nBecause this project focuses a lot on providing information as well as evaluating projects, the content production stage is especially important, especially for heavy technical information. \nBesides, to let members be more engaging with your content, I think the team should hire one more person in design and content marketing to make your content more attractive to team members.\nWith a budget of about $9950 for this fund and operating for 03 months, I think it is reasonable. Especially for marketing costs, the project should not run large campaigns with a large budget but should divide the budget to run many small campaigns, so that the team will know what content really matters, copper, and interested for your members.", "q1r": 5, "q2": "The metrics that the project chooses to evaluate the success of the \"Number of users on the Telegram channel\" project will be the most important, and I think that with your efforts, the number of participants will be higher than your expectation. Your telegram community in 3 months must be much larger with the target number you set being 1000 people.\nAs for other indicators such as Number of messages on channel, Number of in-depth analyses published to community & number of positive reactions,Number of bot uses, in my opinion, are secondary.\n\nI really appreciate the team when you choose the \"Number of donations & number of ADA donations by the community\" index, which shows your interest in the sustainable development of the community.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4727, "q0": "This proposal is a very good idea and fits the goal of the challenge. The way to look at the problem is clearly defined by the project owner, the Vietnamese cardano community needs a reliable place to discuss, update, look up and analyze information about the projects, and provide technical support. timely technique. Talking about the solution of the project, it is very detailed for each solution such as Tre Viet channel is a place to update information through which to analyze and evaluate information about potential projects, discuss Cardano and other solutions. Cardano-based project. , Tre Viet channel is a place for technical support such as a decentralized exchange wallet, showing how to take steps to participate in projects or receive rewards, etc. solutions that will solve challenges help remove technical barriers for newcomers, build a website that aggregates information about projects and shares valuables such as wallets and security for the community to easily easy search. Talking about risks, the project owner has given potentials for his proposal and has given very detailed remedial plans for each part. in my personal opinion appreciate this part of the proposal", "q0r": 5, "q1": "The proposal with the roadmap provided by the team has identified a timeline that the proposal will implement is 3 months. This timeline is quite consistent with the proposal to complete the proposed work. The goals have been given in great detail and are broken down by the theme of the project by month, to see how the roadmap is going. The progress of the project is easy to check and track by the community , such as the first month of proposed implementation ? announced support staff and intensive research team , implemented a marketing campaign to promote ,, etc. February and March was very detailed , I liked the roadmap of the project . Talk about the project's budget the theme the project requires in the amount of 9950$ that amount matches what the scheme works. the budget is divided into sections to know what to spend and is very reasonable, so the community can see how and how much is spent with the progress of the project, I appreciate it when the project theme can provide contingency cost for the project , through which the project topic has prepared a very good scenario for this project , i like this project . About the proposed team, it includes members of the team and assigns specific tasks to each person, working experiences, and also attaches personal links to social networking sites. I fully trust the team that wrote this proposal", "q1r": 5, "q2": "With the project's measurement, people can easily follow the weekly report on the project progress on the Telegram channel. Indicators are defined to evaluate the quality of the project such as the number of users on the telegram channel, the number of messages on the channel, etc. about the success of the project, then the team described the results achieved. and related to the challenge of the campaign increased from 600 people to 1000 people after 3 months, increased 1000 to 1500 after 6 months the number of messages also increased from 200 messages after 3 months, 250 messages after 6 months, number The number of bots used 150 times per month, the statistics show the potential of the project. Because this is a new project, the project topic is given to the community to consider and evaluate more for possible funding. My personal opinion, I rate this project very well. thank you", "q2r": 5, "assessor": "z_assessor_2615", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 3072, "q0": "\"The solution of the proposed idea to solve the problem of the challenge required is: create a community using social networking sites such as Tlegram, Youtube to update information related to the Cardano ecosystem as well as the knowledge and protocol features that Cardano brings, In addition, the group is also committed to providing bot services so that the community can look up for example: \"\"Bot to look up information on token prices, ISPO program, Exchange wallet volatility reporting bot, wallet whale \"\" however can the team explain more about the bot that looks up personal wallet balance fluctuations, does this affect the privacy or the user's? If the community uses bots for on-demand lookups, will they pay for their use? I strongly support the ways of making the solution of the group, especially the group mentioned will evaluate the quality projects, analyze the project's protocols, good for the community and investors to provide it on the Youtube page of this proposal, this can help the community identify good projects and become more technically savvy, but by evaluating good projects the team has created a toolkit of criteria to evaluate, a potential project or not those criteria can the group be made public to the community, Risks such as price fluctuations of ADA, competition with other community sites and information management to remove spam information, are mentioned by the proposed team and all have taken measures to thoroughly eliminate the risks. there. \"", "q0r": 4, "q1": "Full and detailed implementation roadmap of the proposal is provided with specific explanations, as well as a budget sheet that also clearly outlines each expenditure and has a provision for slippage in the price of the ADA native token, in The team section also clearly shows the identity of the relevant experience, and the links to each member's social networking sites, and especially commends the initiative of the proposed team because the channels are currently being development and the team stated that even if it does not receive funding from the fund, the team will still maintain and operate the development channels, in general I completely agree with the feasibility of the proposal.", "q1r": 5, "q2": "\"all indicators for the community to monitor this proposal are fully provided by the team and they will be verified on the community development channels of the proposal, as all activities for this idea are possible. on it, so it's very easy for the community to track, numbers that increase bot users and community members over time will speak to the success of the proposed team, The strength of this proposal is that the videos that analyze the projects in our ecosystem will have a very strong community attraction because most investors or the community do not have much time to dig deep. of a project, and also limited knowledge,\"", "q2r": 5, "assessor": "z_assessor_2396", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 13362, "q0": "- Raising awareness among regulars in East Asia, and especially in Vietnam, about blockchain and the Cardano network is a priority for the Catalyst community, so I see the suggestion of a dedicated channel. Cardano is highly reliable so that the Vietnamese community can update news, discuss, look up and analyze information about all projects on Cardano which is suitable for this challenge of the Catalyst program.\n- Your team already has members with information technology backgrounds with more than four years of experience in the blockchain field and working with the Cardano ecosystem, I believe it will be useful and valuable information. most valuable to share with the community.\n- With your group's commitments such as: developing the Cardano community in Vietnam by actively supporting the community, removing technical barriers for newcomers, focusing on platform projects on Cardano, building build a Web site to aggregate information about projects and share useful experiences on security issues, personal wallets to ensure the safety of investors' assets, then I can believe that the project will be successful if you fulfill these commitments to the community. I support this suggestion of yours", "q0r": 4, "q1": "Your plan for the proposal is divided into 3 months and in each month there are specific work items to complete the challenge, which is very good and shows your thorough preparation.\nHowever, would it be better to show how many people are on your team and what tasks will each person be responsible for? such as: who will be the supporter on the Telegram channel, who will carry out the marketing campaign to promote the Tre Viet channel to the wider Cardano community through the Facebook, Twitter, Telegram and Discord platforms, who will who is responsible for building the website and how long does it take to build a website?, when we divide the work into small pieces and allocate resources appropriately, the project will have more reliability.\n- The costs are clearly divided into categories, but in the cost for the Website, I find it quite ambiguous, it is not clear what programming language the website is built on, where to rent a server, buy a name. The international domain or the Vietnamese domain name has not been mentioned by you.\nI have a small suggestion that with the website, if using Wordpess, it will be simpler and faster, easier to manage and upgrade, easier to write and post with a lot of supporting plugins, wordpress has a lot of components. good part for SEO, and if you already know and have experience then ok, great.", "q1r": 4, "q2": "- You already have a Telegram channel for the community to access to see the work progress and success of the project, this is great because it is open and transparent to the community, but However, if you have a bot to block foreign usernames, you can consider removing this block mode, I see many telegram channels have bots that block foreign users because if you block, the Cardano community abroad will think the project is a scam and give it a low score.\n- It is clear that KPIs such as number of users on Telegram, number of messages on the channel (indicating engagement), and number of in-depth analyses distributed to the community with respective timelines are the norm. an important criterion for evaluating the success of a project.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "Thank you for your comments and suggestions. However we do not use bot to block foreign usernames."}, {"id": 14343, "q0": "With the aim of attracting participants and increasing the awareness of Cardano, this project will solve the problem because it creates a channel for investors and people interested in Cardano to have the opportunity to exchange and share information as well as find development investment opportunities. The beauty of this project, unlike many other community channel-building projects, is that it only focuses on Cardano, so it is quite selective and also very beneficial for Cardano. Of course, there is probably also a more limited number of participants.\nIn addition, this project is proposed by Tre Viet, a team of reputable investors in Vietnam, often sharing knowledge and investment opportunities, so the possibility of success in attracting participants Telegram channel is also positive. Moreover, they are also committed to making tools and bots for users to easily look up market information, and ask and answer questions about Cardano knowledge as well as Cardano projects, so it should be easy to attract investors. because it is clear that they benefit from joining this channel of Tre Viet. At the same time, because on this channel Tre Viet also focuses on sharing a lot of research on profitability, founders, and the structure of projects on Cardano, it is extremely good for projects on Cardano, helping the projects themselves. The platform attracts a large number of investors, like a promotion channel. One fact to be concerned about is that Telegram is not a very friendly platform for people in East Asia, they all have their own social networking platforms, so it will also be difficult for Tre Viet. Only recently, this platform is gradually becoming more familiar to financial investors.", "q0r": 5, "q1": "This is a not too complicated project, so I personally think it is completely feasible both in terms of products as well as plans to attract participants. I believe this will be the channel that many investors will join because they find their interests there. Considering the background of the project people, it is easy to see that the team has experience and expertise in technology as well as engineering, and has a deep and long enough understanding of Cardano. At the same time, they have also created their own Youtube channel sharing experience, knowledge, and information about the Cardano platform such as the Empowa project, which proves that they are capable of taking care of the community, and producing content. content that attracts as well as understands the needs of Cardano investors and participants. The next plus point is that this is not a project that has not been started but has been tested, according to my research, the numbers are also relatively good with about 1000 participants, which also shows the effort. Team effort and contribution made in promoting Cardano to newcomers. But the problem here is that the project wants to spread to East Asia, not just their country Vietnam. So they need more English content to attract, not just Vietnamese. This problem I think is not too difficult if there is financial help from Fund 9. This project also mentions some challenges when building a Telegram channel because as I said before Telegram is a social network. There are a lot of virtual accounts and spam that make users hesitate to use them regularly. The implementation team has come up with a solution with 2 admins who regularly delete it, but if the number is too much, it is also relatively risky for the project.", "q1r": 4, "q2": "The plan and goal of each part can be clearly seen in this project so it is quite clear, specific and also relatively reasonable. The KPI is obvious when accessing the team's Telegram channel directly, so it's not difficult to see the actual number of participants. KPIs to measure the development of the project such as the number of users, the number of messages, the frequency of using bots are reasonable, easy to check and evaluate objectively. Reasonable costs, all expenses are clearly explained and consistent with the proposed solution. But there is a problem with the Telegram channel that there are so many clone accounts that it can be uncomfortable to measure the actual number of people", "q2r": 4, "assessor": "z_assessor_3994", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Tre Viet's Telegram channel has long been a trusted address of the Vietnamese community in supporting project information on the Cardano ecosystem.", "experience": "Team of IT engineer, developers, investors, community managers with 4-5 years experience on the Cardano platform\nTelegram channel has been operating for 5+ months, a total of nearly 600 users, a total of more than 23k messages, an average of 140 messages a day."}