{"id": 416688, "author": "cryptoloops", "title": "CNFT Alliance: Japanese Community!", "url": "https://cardano.ideascale.com/a/dtd/416688-48088", "category": 26602, "amount": 7500, "description": "There is a need to raise awareness of and provide accessibility to CNFT projects in East Asia. Therefore, it is paramount that language does not deter people from being involved within NFT projects.", "f6_no_assessments": 7, "f6_rating": 3.8095238095238098, "videos": [], "media": [], "f6_assessments": [{"id": 2005, "q0": "The proposal’s idea is to translate, English to Japanese and vice versa, CNFT projects aiming to engage Japanese people in this world. At first it seems strange, but a quick search on the internet you find out that the percentage of people speaking English in Japan is below 3% (https://en.wikipedia.org/wiki/List_of_countries_by_English-speaking_population), which is quite low. More than that, the percentage of crypto users in Japan is also very low, below 2% (https://triple-a.io/crypto-ownership/), meaning that ADA has a great opportunity to grow there. This absence of people using crypto in Japan might have something to do with the quantity of non-English speakers there, since the majority of the material of this subject is in English.\n\nThat being said, it’s clear that having a group which already has a platform of CNFT and Gaming (which the link was provided and the team seems very good) translating materials, English-Japanese-English, match with this challenge because it will encourage people from Japan to learn and produce this kind of content. More than that, translating CNFT from Japanese to English will increase the number of people who can consume this content.\n\nAs the proposer stated, the fund risk is very complex. Since you need to hire translators, it is imperative to have a cash flow in order to continue this project. Therefore, it is mandatory to think of a strategy (I’ve seen that you’ve said that you have these strategies, however you’ve not told us what it is) to monetize it and continue to translate. More than that, maybe the volume of people willing to translate materials is bigger than your capacity to translate. Therefore, you’ll have a huge problem – a very big queue or a need to select content to translate. These are points that should be sorted out.\n\nAt last, but not least, just translating materials might not be enough because of the low percentage of people in japan using crypto. Maybe adding a budget to marketing and creating awareness among this Country would be a nice expenditure.\n\n", "q0r": 4, "q1": "Since the idea here is to translate content, it does not seem quite hard. The first step mentioned is to translate the Alliance website content (link provided) and then a Full NFT project.\n\nHowever, one point that should’ve been more explored is the budget. Every translator that I’ve already used and know about translate the content counting the words. Meaning that they charge USD X to translate a word. Therefore, saying which is this value (X) would be a good strategy. Asking for USD 7500 does not tell me how many things we’re talking about. It could be just the website, website + 1 NFT project, website + 2 NFT project, etc. \n\nAnother point that caught me is: how the projects will be selected both ways?\n1 -  English to Japanese: I imagine that there are several NFT projects that could be translated and the budget is short. Therefore, it should have a method to choose the right one – obviously this one should consider the cultural differences as well to have engagement. However the proposal does not specify that.\n2 – Japanese to English: Now the aim is selecting a NFT project in Japanese which has the potential to have an incredible grow. There must be a method to filter this one amongst several projects.\n\nThat being said, maybe for a MVP this would work, but to be scalable, it must consider these points.\n\nThe roadmap seems very feasible. \n", "q1r": 3, "q2": "Important: I must start by saying that these proposers are proposing some similar projects. The main idea is to translate CNFT projects to the language. Therefore, I must warn that my accesses in these projects might be a bit similar since the main idea is the same and the group is the same.\n\nThe KPI are good. I would measure the queue growth as well, since this could be a problem – having people willing to use the service but, since it is a mechanical thing, it takes time. \n\n\nThe solution described really tries to tackle the problem. And the goal of helping people from Japan to onboard the ADA community is clearly seen if we remove the barrier.\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1, "reply": "With regards to the translators rate, we already got the rate that was listed in the proposal. So stating a per word rate could be done, but is completely unnecessary as we have many people that we are in contact with who are willing and able to provide the Japanese Translation."}, {"id": 2413, "q0": "By the designated goals in the challenge in which this proposal is, we have the main scope of the project in question must be the evolution of East Asia with the use of technologies from Cardano's ecosystem. In fact, we do not have here the creation of a new innovative product or an ambitious idea that aims to change paradigms in a certain segment. However, the main activity to be carried out, translations into the Japanese language, is of great importance to provide easier access for people from this community to teaching materials or services that permeate around blockchain technologies. Therefore, this proposal has a good potential to expand Cardano's horizon of operations in the medium and long term. Regarding the capital being requested, we note that it is consistent with what is desired to be accomplished, given some caveats that will be better explained in the analysis of the project's feasibility.", "q0r": 5, "q1": "As a first positive point about the project's feasibility, we can mention that the team's objectives are well defined, which can even be perceived through the existence of a well-structured project website, with clear information that demonstrates the objective of the action in financing and support NFT related projects. Another advantageous feature of the project, especially when compared to other translation proposals, is the concern with the translation of certain specific terms, which is essential when a more technical project will be translated. Regarding the team, we can mention that many professionals involved have a great view of technology, having considerable experience in this market. However, the technology area is not the only one with which the team has an affinity, we perceive the existence of professionals who work in different spheres, which builds a very complete productive ecosystem. Among these other areas in which the team has experience, we can mention the management of human resources. However, in terms of budget detail, we realized that some additional details could have been stated. Even with the possible expense being variable, it would be nice to have quoted an average translation cost for a certain number of projects, especially because the costs per project may become lower with the greater volume of these projects.", "q1r": 4, "q2": "Regarding the ways to follow the progress of the project, we have the presence of parameters to verify the evolution that are very solid with a good detailing of the factors that will be assisted along the way. In addition, with regard to the perception of success, the team understands well how the ultimate goal must be a comprehensive ecosystem, which encourages the participation of an increasing number of people in Cardano's environment. As an additional detail, it would also be interesting to indicate a tool that would be used to constantly transmit the results to the Cardano community, increasing visibility around the entire project. A possible tool for transmitting this information clearly would be Trello.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11694, "q0": "This proposal is similar to the same team's other proposal within this challenge, where I have also assessed their chinese community proposal. In total, i realized that the team provided 4 languages to be added for their translation services: Chinese, japanese, korean, and vietnamese. After coming across this proposal as a second proposal from the same team using the PA tool, i do feel 4 languages simultaneously for the same timeline is a little much for an \"experiment\", though i understand the enthusiasm for CNFT games and projects may differ wildly from country to country. \n\nfeedback:\n1. i think that in the realization of this scenario, though the requested amount of funding is not huge, i would suggest to do two languages of choice for a start. any 2 of the 4 will do as a proof of concept.\n2. the team could've improved their proposals by providing tansparency that they intend to do the same in 4 languages, which was not indicated at all anywhere in the proposal\ni wont be copy pasting my remarks made in the chinese community proposal because they are mostly feedback to assessors and is generally good comments, they can refer back to my assessor id, if required. I will also not be copy pasting this comment to the other two languages proposal, vietnamese and korean, for avoiding redundancies.\n\nin a nutshell, for the convenience of voters, i did give good reviews for this proposal, a 4/5/4. the team intends to perform two way translation between english and another language, and in this case its japanese. this is on top of their current work at CNFT alliance trying to help and incubate CNFT projects by providing support and guidance to them. i believe in the impact this project may have if they are able to recruit more players / developers / community by reducing the language barrier, though i would say that doing 4 languages from the get-go is a little much for a proof of concept. no doubt, bringing down these barriers will add tremendous value to cardano.", "q0r": 4, "q1": "as mentioned, i wont be copy pasting my remarks made in the chinese community proposal. for the benefit of voters, i will highlight some feedback i think they can pay attention on that serves also as feedback to proposers, though not a huge con to the project as i am still rating them 5 for this section. timeline and budget amount and team credibility is all fine. \n\nfeedback\n1. It would be ideal if they can also provide the target NFT project they would work on, if they have these requests already on hand.\n2. for the budget, it would be helpful if they included average rates for a  translator", "q1r": 5, "q2": "same here, wont be copy pasting my remarks made in the chinese community proposal. for this section, my feedback is:\n\n1. on the source of data. They mentioned that the metrics are trackable by following up with every partnering project. yet, they also mentioned that newly engaged users would be obtained through follow up surveys and polls. i cannot definitively point to which one is better, but perhaps only one source should be the source of truth. . \nif they poll a game's community and 30% of respondents say they are there because of the chinese translation, while the game's team gives another number say, 40%. which is the source of truth?\n\n2. would like to know the medium of communication for their KPI reporting, would it be the website under a particular section? some clarification on these notes will help. they did mention quick communication frequency and in some cases, real time. \n", "q2r": 4, "assessor": "z_assessor_3270", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14992, "q0": "This proposal will enable a translator to help go back and forth between English and Japanese for projects in the CNFT Alliance space and should help build and expand growth in both directions (Japan <--> English Speaking World).  This should have a sizeable impact in the CNFT space since both the reputation of the CNFT Alliance as well as the plans that are enabling this and other similar proposal to branch out a plan for growth in East Asia.", "q0r": 5, "q1": "The plan is simple in nature and should be completed with the resources requested, the breakdown of funds and the rough timeline in which they are setting for this proposal.  Given the team's size, reach, and capabilities this should be easily accomplishable.", "q1r": 5, "q2": "As mentioned, due to the small reach of this proposal and the capabilities of the team, this project should be very easy to track and see the progress being done within it.  The metrics are adequate to show timelines of when they are planning to accomplish project translations and as well as track the users that utilize the translated texts.  Overall, this project should be fairly transparent to track.", "q2r": 5, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15013, "q0": "IMPACT\nThis proposal is a copy of the CNFT Alliance: Korean Community!\nThe only change made is the statement that Japanese is one of the top spoken languages as it has 125M speakers.\nAs per the above clarification, I have the same considerations as per the other proposal.\n\nThe idea of the proposal is to produce a translation service from the CNFT Alliance to translate CNFT projects from english to Japanese, in order to lower the barrier for adoption.\nI do agree that by doing so, it will help with the Challenge objectives to grow Cardano in East Asia, specifically in Japan.", "q0r": 4, "q1": "FEASIBILITY\nThe team seems very talented and skilled, but there is not a single Japanese within it, none of them is showing/providing, translation skills, neither Japanese language or experience within it, just claiming that the translator will be hired, that puts the whole project at risk and rises many doubts on the team's capabilities to deliver it in a proper way for the Japan's culture and people, so it can reach its objectives. (A proof of that is that the proposal claims that Japanese is one of the top spoken languages in the world because it has more than 125Million speakers, this statement clearly shows the proposers lack of knowledge about languages)\nThe timeline is very generic and vague, Q3/2022 Hiring a translator and translate the CNFT Alliance site, Q4/2022 translate 1 NFT project, Q1/2023 translate 2 NFT projects, not allowing me to make a proper assessment of wether all the proper activities had been considered.\nThe budget details are not provided, stating \"It is difficult to provide a detailed budget breakdown for this proposal as it will depend on the number of projects that want translation.\" so it is unclear what will be the purpose of the USD7.500 requested.\nWith the provided information and because it is just a copy of the other proposal, with no added value, neither a statement about why they have chosen to present both, I strongly disagree that this proposal will deliver on its intention.", "q1r": 1, "q2": "AUDITABILITY\nOutcome KPIS were provided on top of the general milestones, these KPIS:\n\"The number of users of the CNFT Alliance’s translation services.\nThe number of projects that the CNFT Alliance’s translation services have helped boost their target audience.\nThe number of users engaged by these projects that were not previously engaged due to language differences.\"\nWill allow the community to track the outcome of the project, though the progress auditability will depend on which metrics the proposers create, as they were not provided.\nSo I agree that this project will be auditable by the community.", "q2r": 4, "assessor": "z_assessor_2398", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15056, "q0": "The proposal identified a problem in a language barrier – English/Japanese and also states, that such issue should not be deterring people from entering to the CNFT space. The solution offered by the proposer is to translate fully CNFT Alliance website, and then to offer translation services and aim to have fully translated two NFT projects. The basics for the impact of this proposal lies in the amount of speakers – claiming that more than 125 mil people speak Japanese, which could potentially lead to the onboarding. I think the overall idea is fine, but it would be nice to somehow consider also the fact, that out of these 125 mil people, some can also speak another language, such as eng, thus these language barriers would not be affecting them. Overall, I agree that more translated content we have, more people can eventually participate. Nevertheless, to support the potential impact of the proposal, the proposers could have provided current number of visits of their website, because we do not know whether it is well known, visited, or actually overlooked site, thus, the impact would be 0. ", "q0r": 4, "q1": "The roadmap is set to 3 quarters, till the Q1 2023, and the high-level tasks are provided – such as – hiring Japanese translator, translating CNFT Alliance website, and translating two NFT projects. The lack of details is not really providing confidence, when having 3 months dedicated for hiring and translating the website. It Is very unclear how many days you will be hiring, and if you end up having no translator at the end of first quarter, then obviously you will not translate the website on time. Thus, some milestones should have been set, to provide a better overview. At the same time, since the website is already set, you could have outlined how many tabs/text is going to be translated, and how much time you expect it will take to translate. Regarding the translation of the NFT projects, it should have been outlined what type (example) of NFT project you have in mind – visiting your website, there were also NFT Games, which definitely have more content, than an NFT project where you translate only e.g. attributes of each NFT in the particular series. The budget requested is 7500 USD, but no expected time spent, or hourly rate is disclosed, thus, it is hard to tell whether it will be enough or no. If you plan to have at least 2 projects till the end of Q1 2023, then I would assume the budget is adjusted to that. Saying you do not know the demand is decreasing the feasibility, because you admit it might not be enough. The team is consisting from 10 members (if counting correctly), with vast bio provided + linked in profiles. Besides that, website looks very nice and working (even tough there is not much content I would say), thus I am sure they are capable of having the website running. Yet, setting up a feasible roadmap + budget is not one of your pros (based on the proposal). Also, since you aim to offer translation services, it is specified nowhere how this will be occurring – on demand? Some marketing? Already discussed with some projects? ", "q1r": 2, "q2": "The problem (lack of Japanese content) and solution (to translate your website and some NFT projects) is logically tied. The progress can be tracked at the end of each quarter, and I assume we can verify it on your website, whether it is translated or no. Since the translation services are the goal of the proposal, then having hired translator should be the primary metrics for both progress and success. Based on this, you can then apply mentioned metrics such as project being boosted due to translation, demand of projects for translations or engagement increase. The proposer state that they will use surveys and polls for data collection, but I did not notice a simple metric of visits (maybe it is included in the last KPI – users engaged). ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15381, "q0": "The problem identified in this proposal was the language barrier, which reduces the accessibility of projects, in this case NFTs, to the Japanese community.\n\nThe concept of translating NFT projects addresses the challenge from the point of view of Japanese onboarded users.\n\nThere is no mention of which projects will be translated or how these projects will be selected, without knowing which projects will be translated, the impact projection becomes more uncertain. It is to be expected that the NFT projects to be translated are relatively popular in order to generate value and engagement, after all, translating a project that is not popular would not result in relevant value to the community. This could have been considered in the proposal.\n\nThere is no mention of KPIs with targets, the absence of this indicator makes it difficult to visualize the impact of this challenge.\n\nHow many japanese members will be onboarded through this proposal? The team could set a target to make it clearer what to expect as an outcome.", "q0r": 3, "q1": "There is no detailed plan, only a high-level notion of what will be developed, which is the hiring of a translator, the translation of the website https://cnftalliance.org/ and the translation of 2 CNFTs projects.\n\nAs I mentioned in my impact rationale, there is no mention of how the projects to be translated will be selected.\n\nThere is no mention if the team intends to run outreach promotion campaigns in order to reach the Japanese community.\n\nConsidering the information present on the website https://cnftalliance.org/ today, I don't see the point in translating the website, as the website contains very little relevant information about CNFTs.\n\nThe team has expertise in different areas, however several of the members do not have relevant experiences for this proposal. Skills in game development and design, production, art are apparently not relevant to this proposal, at least according to the plan. I mention this because the proposal includes several members whose roles in this proposal are not apparent, so it is doubtful whether they will actually actively participate in this proposal and how.\n\nThe main role to be evaluated here would be the translator, but he will be hired.\n\nThere is no budget breakdown.\n\nThe team only considered the financial risk, but I would recommend that they be aware of the risk that translations may not result in significant onboarding. As there is no mention of promotion campaigns, the proposal may have problems and the result may not be satisfactory.\n\nConsidering the low complexity of the proposal, the timeline is sufficient for the translation of at least 2 NFT projects.", "q1r": 2, "q2": "Relevant metrics such as the number of onboarded users and the number of translated projects that had a positive impact due to translation were included.\n\nThe definition of success \"A broad spectrum of people across the Japanese community, coming together and forming teams to grow our ecosystem.\" can be partially verified by the suggested metrics, however the team could have established periods for verification of the metrics and included KPIs.\n\nAlthough the roadmap is extremely simple, I believe it is easy to audit, as the deliverables are clear (translations of 2 CFNT projects).\n\n*This team submitted another proposal similar to this one, modifying only the language to be translated, I am submitting similar assessments for this reason*", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "The CNFT Alliance plans to offer translation services to CNFT projects to engage Japanese users into the CNFT space by removing barriers and opening the ecosystem to everyone, regardless of language!", "experience": "Co-founder (CF)/Game Design: Alex\nCF/Marketing: Conward\nSr Programmer: Dirk\nProjects Coordinator: Sam\nAssistant PC: Jye\nNarrative Design: Chris\nGame Programmer: Simon\nArtist: Dilara\nIllustrator: Ann-Kathrin\nProducer: Christian\nSFX: Rudi\n(More Details Below)"}