{"id": 416694, "author": "cryptoloops", "title": "CNFT Alliance: Korean Community!", "url": "https://cardano.ideascale.com/a/dtd/416694-48088", "category": 26602, "amount": 7500, "description": "There is a need to raise awareness of and provide accessibility to CNFT projects in East Asia. Therefore, it is paramount that language does not deter people from being involved within NFT projects.", "f6_no_assessments": 7, "f6_rating": 3.380952380952382, "videos": [], "media": [], "f6_assessments": [{"id": 2007, "q0": "The proposal’s idea is to translate, English to Vietnamese and vice versa, CNFT projects aiming to engage Vietnamese people in this world. \n\nI’ve found two important data to start thinking about its impact: 1 – it has low proficiency in English, probably meaning the classical tests of English (https://www.ef.com/wwen/epi/regions/asia/vietnam/); and 2 – the majority of people speaks English in the big cities (https://howwidelyspoken.com/how-widely-spoken-english-vietnam/). Therefore, probably the English language amongst people which have internet access are quite high.\nOther important data is that the cypto ownership in this country is about 6,12% (https://triple-a.io/crypto-ownership/), meaning that Vietnamese people are willing to adopt this technology. They are very open to crypto and would use crypto as online payment method (https://triple-a.io/crypto-ownership-vietnam/).\n\nThat being said, there is a huge opportunity to ADA in Vietnam. However, since the English there seems not to be a huge problem, I’m quite thoughtful about this projects impact. It’s clear translating materials match with the challenge and intend to facilitate the penetration of these content in the country and to the people, however it doesn’t seem that it’s mandatory to do it. Therefore, I’ll discount some points in here.\n\nAs the proposer stated, the fund risk is very complex. Since you need to hire translators, it is imperative to have a cash flow in order to continue this project. Therefore, it is mandatory to think of a strategy (I’ve seen that you’ve said that you have these strategies, however you’ve not told us what it is) to monetize it and continue to translate. More than that, maybe the volume of people willing to translate materials is bigger than your capacity to translate. Therefore, you’ll have a huge problem – a very big queue or a need to select content to translate. These are points that should be sorted out.\n", "q0r": 3, "q1": "This proposal objective is to translate content of its Alliance website (link provided) to Vietnamese and CNFT projects to Vietnamese-English-Vietnamese. The proposal states that to accomplish this they will hire a translator and, that being said, it’s quite feasible.\n\nTranslating content might be tricky – there are lots of things to consider like cultural meaning variations, technical stuff etc. Therefore, it might be good to hire a certified translator to certify all the translation. And, every contact I ever had with a certified translator they charge by counting word. Therefore, it would be better if the proposal had given its required budget by associating the average length of a CNFT and the length of its website. The way it was given, give us, voters, no clue of how many proposals it means to translate, e.g.\n\nOvercoming the budget issue, there are other two that could be accounted, them both related with the quantity of proposals requiring to be translated (language-english-language). Meaning that this could create long queues and demanding the proposer of this project to choose which submitted proposal should be translated.\n\nBoth of the issues mentioned above could risk this project operation.\n\nSince Vietnamese people are already open to crypto, it could be interesting to separate part of the asked budget to invest in marketing and attract people to use this platform.\n\n", "q1r": 3, "q2": "First, KPI seems good. I would measure the queue growth as well, since this could be a problem – having people willing to use the service but, since it is a mechanical thing, it takes time. \n\nAnother aspect is that they have a channel to share all the information.", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 14985, "q0": "This proposal will help by introducing translating services for Korean-to-English and vice versa for CNFT project to grow outside of Korea.  Korean being a largely spoken language globally will help to expand the CNFT experience from Korea to beyond.  The impact from that area will be felt widely as it is a hotspot for Crypto and could help to entrench the Cardano brand through expansion.", "q0r": 5, "q1": "The goals and ambitions of this proposal are pretty straightforward and should be accomplishable.  They are planning on hiring a Korean translator and then having full projects to be translated over the next couple of quarters.", "q1r": 5, "q2": "The metrics are very clear in targeting and tracking projects translated and subsequent users that use the translations.  The breakdown of funding and milestones for this project are manageable to track and should allow for full transparency.", "q2r": 5, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15007, "q0": "This proposal aims to fund the translation of information about NFT projects to make them more accessible to the Korean community. I agree that language differences is a big problem for projects. Korean people are well known for their adoption of crypto currencies, yet I see a lack of discourse in Korean threads on CNFT social media such as Discord, however, I don't think this proposal will have much impact. They are asking for $7500, but it is unclear how much each translation would cost. The roadmap states it aims to have at least two projects translated by Q1 2023. As someone who lives in Korea and has worked on many translation projects, I estimate each translation would cost no more than $500, so I would expect a much more ambitious roadmap for $7500. They mention becoming self-funded. How might this be achieved?\nI think it would be much better for CNFT projects to reach out to their own communities if they need any translation work. There is no shortage of people who would help with translation if a bounty were offered by the project.", "q0r": 2, "q1": "It certainly seems feasibly that the project could successfully translate two CNFT projects and the CNFT Alliance website by Q1 2023. There is very little to translate on their website. However, it's important to know much more about their budget breakdown. Where does the $7500 go? Is all of that being used to hire a translator? Or is some of that being used for the team and costs, is so, how much? If the full amount goes to the translator, how many projects will they complete for this sum? This information seems key to access the quality of the proposal. Have they translated any projects to date? This information would give some indication of the impact that their service provides.", "q1r": 3, "q2": "Clear ways of measuring and auditing the success of the project are given, but what are the goals that they are being measured against? How many projects would this budget allow to be translated?", "q2r": 3, "assessor": "z_assessor_2133", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15011, "q0": "IMPACT\nThe idea of the proposal is to produce a translation service from the CNFT Alliance to translate CNFT projects from english to Korean, in order to lower the barrier for adoption.\nI do agree that by doing so, it will help with the Challenge objectives to grow Cardano in East Asia, specifically in Korea.", "q0r": 4, "q1": "FEASIBILITY\nThe team seems very talented and skilled, but there is not a single Korean within it, none of them is showing/providing, translation skills, neither Korean language or experience within it, just claiming that the translator will be hired, that puts the whole project at risk and rises many doubts on the team's capabilities to deliver it in a proper way for the Korean culture and people, so it can reach its objectives. (A proof of that is that the proposal claims that Korean is one of the top spoken languages in the world because it has more than 75Million speakers, this statement clearly shows the proposers lack of knowledge about languages)\nThe timeline is very generic and vague, Q3/2022 Hiring a translator and translate the CNFT Alliance site, Q4/2022 translate 1 NFT project, Q1/2023 translate 2 NFT projects, not allowing me to make a proper assessment of wether all the proper activities had been considered.\nThe budget details are not provided, stating \"It is difficult to provide a detailed budget breakdown for this proposal as it will depend on the number of projects that want translation.\" so it is unclear what will be the purpose of the USD7.500 requested.\nWith the provided information I disagree that this proposal will deliver on its intention.", "q1r": 2, "q2": "AUDITABILITY\nOutcome KPIS were provided on top of the general milestones, these KPIS:\n\"The number of users of the CNFT Alliance’s translation services.\nThe number of projects that the CNFT Alliance’s translation services have helped boost their target audience.\nThe number of users engaged by these projects that were not previously engaged due to language differences.\"\nWill allow the community to track the outcome of the project, though the progress auditability will depend on which metrics the proposers create, as they were not provided.\nSo I agree that this project will be auditable by the community.", "q2r": 4, "assessor": "z_assessor_2398", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15028, "q0": "The proposal is to implement a plan to provide translation services from English to Korean or vice versa for CNFT projects to attract Korean users or CNFT projects based in Korea who wish to expand their audience. Their goal is beyond the Korean-speaking community. The proposal is suitable for this challenge, it will be great when the team expands on the Catalyst-translated content about Cardano. I have learned and updated about the Cardano ecosystem a lot from document translations or videos, so the means of content transmission are also very important for the Korean community to understand. Quickly capture content. Translators play an important role, especially in translating technical topics that require the translator to have a basic knowledge of Blockchain expertise about Cardano.\n", "q0r": 4, "q1": "The team proposes to provide a roadmap for implementation in 3 quarters (Q3 and 4, 2022 and Q1 of 2023), the details of the work to be done in my opinion are incomplete, (for example, Hiring a Korean interpreter) needs to be done. set criteria for selecting interpreters or have training sessions to guide interpreters to understand and properly translate professional keywords. The number of projects to be translated in Q4 and Q1 is not clear. In the proposal, at least 2 projects should be recorded. Translated projects should have a weekly or monthly implementation plan. The proposed cost of Korean translation is $7500 and there is no cost to translate Korean projects into English. The details of the proposed amount are also not clear, should add how many interpreters will translate how many projects and how many hours or how many words to translate to calculate the cost. Information about each team member is provided fully including social links pages, they are experienced people but I wonder if these people are involved in the translation?", "q1r": 2, "q2": "Implementation roadmap in 3 quarters, as I have stated in terms of feasibility, it is recommended to add details to clarify the work to be done further and to add important milestones. The group measures are also related to (the number of users, number of projects, and number of participants), and the survey should be added to assess the quality of translations. The proposed team also stated that it could apply for additional funding in future rounds if the team added plans for this future projection.", "q2r": 3, "assessor": "z_assessor_2714", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15055, "q0": "The proposal identified a problem in a language barrier – English/Korean and also states, that such issue should not be deterring people from entering to the CNFT space. The solution offered by the proposer is to translate fully CNFT Alliance website, and then to offer translation services and aim to have fully translated two NFT projects. The basics for the impact of this proposal lies in the amount of speakers – claiming that more than 75 mil people speak Korean, which could potentially lead to the onboarding. I think the overall idea is fine, but it would be nice to somehow consider also the fact, that out of these 75 mil people, some can also speak another language, such as eng, thus these language barriers would not be affecting them. Overall, I agree that more translated content we have, more people can eventually participate. Nevertheless, to support the potential impact of the proposal, the proposers could have provided current number of visits of their website, because we do not know whether it is well known, visited, or actually overlooked site, thus, the impact would be 0. ", "q0r": 4, "q1": "The roadmap is set to 3 quarters, till the Q1 2023, and the high-level tasks are provided – such as – hiring Korean translator, translating CNFT Alliance website, and translating two NFT projects. The lack of details is not really providing confidence, when having 3 months dedicated for hiring and translating the website. It Is very unclear how many days you will be hiring, and if you end up having no translator at the end of first quarter, then obviously you will not translate the website on time. Thus, some milestones should have been set, to provide a better overview. At the same time, since the website is already set, you could have outlined how many tabs/text is going to be translated, and how much time you expect it will take to translate. Regarding the translation of the NFT projects, it should have been outlined what type (example) of NFT project you have in mind – visiting your website, there were also NFT Games, which definitely have more content, than an NFT project where you translate only e.g. attributes of each NFT in the particular series. The budget requested is 7500 USD, but no expected time spent, or hourly rate is disclosed, thus, it is hard to tell whether it will be enough or no. If you plan to have at least 2 projects till the end of Q1 2023, then I would assume the budget is adjusted to that. Saying you do not know the demand is decreasing the feasibility, because you admit it might not be enough. The team is consisting from 10 members (if counting correctly), with vast bio provided + linked in profiles. Besides that, website looks very nice and working (even tough there is not much content I would say), thus I am sure they are capable of having the website running. Yet, setting up a feasible roadmap + budget is not one of your pros (based on the proposal). Also, since you aim to offer translation services, it is specified nowhere how this will be occurring – on demand? Some marketing? Already discussed with some projects? ", "q1r": 2, "q2": "The problem (lack of Korean content) and solution (to translate your website and some NFT projects) is logically tied. The progress can be tracked at the end of each quarter, and I assume we can verify it on your website, whether it is translated or no. Since the translation services are the goal of the proposal, then having hired translator should be the primary metrics for both progress and success. Based on this, you can then apply mentioned metrics such as project being boosted due to translation, demand of projects for translations or engagement increase. The proposer state that they will use surveys and polls for data collection, but I did not notice a simple metric of visits (maybe it is included in the last KPI – users engaged). ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15380, "q0": "The problem identified in this proposal was the language barrier, which reduces the accessibility of projects, in this case NFTs, to the Korean community.\n\nThe concept of translating NFT projects addresses the challenge from the point of view of Korean onboarded users.\n\nThere is no mention of which projects will be translated or how these projects will be selected, and without knowing which projects will be translated, the impact projection becomes more uncertain. It is to be expected that the NFT projects to be translated should be relatively popular in order to generate value and engagement, after all, translating a project that is not popular would not result in relevant value to the community. This could have been considered in the proposal.\n\nThere is no mention of KPIs with targets, the absence of this indicator makes it difficult to visualize the impact of this proposal on the challenge.\n\nHow many Korean members will be onboarded through this proposal? The team could set a target to make it clearer what to expect as an outcome.", "q0r": 3, "q1": "There is no detailed plan, only a high-level notion of what will be developed, which is the hiring of a translator, the translation of the website https://cnftalliance.org/ and the translation of 2 CNFTs projects.\n\nAs I mentioned in my impact rationale, there is no mention about how the projects to be translated will be selected.\n\nThere is no mention if the team intends to run outreach or promotion campaigns in order to reach the Korean community.\n\nConsidering the information present on the website https://cnftalliance.org/ today, I don't see the point in translating the website, as the website contains very little relevant information about CNFTs.\n\nThe team has expertise in different areas, however several of the members do not have relevant experiences for this proposal. Skills in game development and design, production, art are apparently not relevant to this proposal, at least according to the plan. I mention this because the proposal includes several members whose roles in this proposal are not apparent, so it is doubtful whether they will actually actively participate in this proposal and how.\n\nThe main role to be evaluated here would be the translator, but he will be hired.\n\nThere is no budget breakdown.\n\nThe team only considered the financial risk, but I would recommend that they be aware of the risk that translations may not result in significant onboarding. As there is no mention of promotion campaigns, the proposal may have problems and the result may not be satisfactory.\n\nConsidering the low complexity of the proposal, the timeline is sufficient for the translation of at least 2 NFT projects.\n", "q1r": 2, "q2": "\nRelevant metrics such as the number of onboard users and the number of translated projects that had a positive impact due to translation were included.\n\nThe definition of success \"A broad spectrum of people across the Japanese community, coming together and forming teams to grow our ecosystem.\" can be partially verified by the suggested metrics, however the team could have established periods for verification of the metrics and included KPIs.\n\nAlthough the roadmap is extremely simple, I believe it is easy to audit, as the deliverables are clear (translations of 2 CFNT projects).\n\n*This team submitted another proposal similar to this one, modifying only the language to be translated, I am submitting similar assessments for this reason*", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "The CNFT Alliance plans to offer translation services to CNFT projects to engage Korean users into the CNFT space by removing barriers and opening the ecosystem to everyone, regardless of language!", "experience": "Co-founder (CF)/Game Design: Alex\nCF/Marketing: Conward\nSr Programmer: Dirk\nProjects Coordinator: Sam\nAssistant PC: Jye\nNarrative Design: Chris\nGame Programmer: Simon\nArtist: Dilara\nIllustrator: Ann-Kathrin\nProducer: Christian\nSFX: Rudi\n(More Details Below)"}