{"id": 416986, "author": "cryptoloops", "title": "Flooftopia: Chinese Translation", "url": "https://cardano.ideascale.com/a/dtd/416986-48088", "category": 26602, "amount": 7500, "description": "Currently, there is a need to raise awareness & provide accessibility to CNFT gaming projects in East Asia. As the interest continues to grow, is paramount that we remove any language barriers.", "f6_no_assessments": 14, "f6_rating": 3.2142857142857144, "videos": [], "media": [], "f6_assessments": [{"id": 1663, "q0": "In terms of impact, the proposal is perfect and meets the objectives of this challenge very well. We seek to fund projects that benefit both Asia and Cardano; and we know that one of the biggest problems faced in this context is the language barrier. Thinking about solving this, the creators of the game Flooftopia are suggesting to create a version of the game translated into Chinese, where both the issue of building the NPCs (Build-An-NFT) and the story itself of the game would be translated. This would definitely boost the game's adoption in the country in question. We know how popular NFT games are, and I believe that the purpose of this game is very different from the others, as the gameplay is adventure, world discovery, village construction, character evolution, etc.; ie a kind of RPG, I would say. Another differential point of this game is that it is suitable for all ages, that is, it is neither focused on a child audience nor on an adult audience, which would greatly increase the range of people who would be attracted to the project, and consequently introduced to Cardano. Proponents provide us with data that reinforce the importance of carrying out such a translation: “With more than 1.3 billion speakers (16% of the world's population), Chinese is the most spoken language globally. However, most NFT and/or game projects on Cardano represent a language barrier for Chinese users, as the vast majority of them are based in North America and Europe.” In fact, both blockchain technology is more developed in these locations, as well as more specific approaches such as the creation of games, and especially games with these characteristics. I believe that with Flooftopia's translation, many goals of the challenge will be achieved, such as increasing the participation of the Cardano community in East Asia and also increasing active wallets (from what I understand the game would be free, but certainly some features and options would be paid - maybe to acquire a CNFT or to buy accessories for the doll, maybe some map elements, etc). That said, I believe the proposal deserves top marks in terms of impact. My only observation would be regarding the following excerpt: “We have many translator connections who are ready to provide the services, but funding is needed to keep these individuals employed by Flooftopia”. It would be important for proponents to make it more explicit which connections these would be, how translators would be hired, etc., as I will comment in more detail in the following topic, on feasibility. In my view, all the main KPIs of the challenge would be met here, some of them being: “The number of proposals originating from East Asian participants in Project Catalyst + The quantity and quality of funded teams originating from East Asian + The observed impact of funded projects (meeting their KPIs) + Did we increase the participation of the Cardano community and Catalyst teams with East Asian residents?”. In addition, one of the KPIs of the dApps challenge would also be met, as an existing integration (the game) would be improved and expanded to new audiences: “Integrations with other existing services, products, and protocols that improve the end-user experience whether that's giving the user more options or making something easier to use that benefits the wider ecosystem”.", "q0r": 5, "q1": "In my view, the way the information is presented, the proposal is not very viable, and I will argue why. Talking about the script first: in Q1 the actions of “hire a Chinese translator / translate Flooftopia website and coining functionality / start translating in-game dialogue” would be done. How long would each activity take? Proponents claim they already have connections regarding translation, so probably hiring a Chinese translator wouldn't take that long. But we would need to know, for example, how many days he or she would be working on it, what their work routine would be like, how many hours a day, how the translation review would be carried out… In relation to the fourth quarter of the year, the missions would be translated and dialogues from the NPCs, that is, maybe what would be translated in the third quarter would be the platform and in the fourth the game itself? It would have been important if more details had been provided regarding the translation process in practice, how things would happen in everyday work. Regarding funding, I am a little concerned when they state that “it is difficult to provide a detailed budget breakdown for this proposal as it will depend on how much dialogue the Flooftopia game has”. In this case, we still don't know the exact amount of content to be translated? So how did they establish that the amount to be charged would be 7500 dollars? This amount would correspond to 6 months of work, as described in the script, which would correspond to the monthly payment of 1250 dollars. It is a high value, so we would need to know if the translator would dedicate himself full-time or part-time to the work, so that we have a more solid notion if what is asked is in fact fair. Regarding the volume to be translated, this also raises some doubt, since it may not have content for 6 months of full-time work - what would it look like, in that case? Would the remaining funds be used for another part of the project? Finally, by analyzing the team, we have a lot of information about the team members, those who work on the game, in one way or another. We know their names, CVs (in a very detailed way), what their areas of expertise are, if they have any relationship with Cardano (and if so, how)... However, the most important part would be to get to know the translator himself, who would be responsible for most of the work on this particular proposal. It would be necessary to understand if you are a person trained in the area, if you have previous experience with game translation, if you know something about Cardano (this is not mandatory, but it would be a differential). Unfortunately, not so much trust is passed as we don't know who would be chosen. With that, I think this topic is not necessarily bad; is ok but needs some significant changes.", "q1r": 4, "q2": "Proponents say it is difficult to measure progress by roadmap, as changes and unforeseen events are very likely to happen. I agree with this statement, but I still think it is necessary for us to have some kind of monitoring of the translator's daily work. In my view, it would be interesting if the team defined the expectation of content that would be translated in 1 month, and at the end of this interval, a meeting could be held with the translator to keep us updated on what is being done. Was it possible to work as much as was planned, was there an impasse? The bridge between the translator and the rest of the game's development team remained firm during the month, was there a member of the team that helped the translator with specific doubts, referring to the particularities of the game? In my view, it is as important as measuring KPIs, knowing such information. They state that “we could use a more milestone-based approach to the ultimate goal of connecting the Chinese-speaking community with the rest of the Cardano Ecosystem in the NFT space.” With this, they point out a series of KPIs that would be measured to measure progress, such as the number of Chinese-speaking users of the game, newly engaged users who previously did not play Flooftopia due to language differences, user satisfaction level speaking Chinese… Regarding this last metric, how would the measurement be made? Perhaps a quick satisfaction survey could be created, which would appear in the interface of the game itself, for this type of player (Chinese speaker) to report the presence of an error or suggest improvements, for example. I believe that the auditability of progress is good, even if not perfect. Turning now to the success scenario, this can be summarized as introducing Flooftopoia to the Chinese community more consistently, “attracting more East Asian users who may have been discouraged from entering the CNFT gaming space due to language barriers / having a A solid number of users who have benefited from our language integration features would be a big indicator of success as we expand our impact on the community.” I think the definition of success is quite adequate, what could be done was a better clarification of how this scenario would be perceived and proven. In my view, it would be valid if the proponents did a final survey, in order to demonstrate the increase in users in East Asia, the level of satisfaction, how this all impacted our blockchain, how many new wallets were created, how these new players would be discovering the cryptographic universe from Flooftopia and so on. For the aforementioned reasons, I evaluate the project's auditability as good, but not perfect.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1916, "q0": "Although the idea of translating any projects into non - English in East Asia is always a good idea, I do not see the proposer sharing the supporting data, such as how much the NFT-gaming user base in East Asia vs in the Western, etc and its relation with English proficiency in each country/language. With more and more projects in Cardano build by the western (English) team, I think we need more global solutions rather than using our Catalyst funds for each project to translate into another language. As for this proposal, were aligned with the Challenge setting, and will value the Cardano community as a whole. The adoption of NFT gaming will help onboarding newcomers for sure - IF the game succeeds.\n\nNote to vCA: I use generally the same feedback since the proposer has multiple proposals, with the same problem but different languages to translate. In overall this is how I view the proposals", "q0r": 4, "q1": "The proposer shares with their team how they will deliver the game successfully, but not about the translation - which they will use external resources - but how good or experienced these resources were not given. Are they experienced in NFT-gaming translation? Is the proposer reached the local Chinese Cardano Community to get references? any plan of collaboration? The team might wants to add some feedback from them and hopefully can get more insight into how they should start this project.\n\nWith Q3 and Q4 as the timeline which is given in the proposal - but without detail on how many words need to be translated - it is difficult for me as an assessor to see if the timeline is reasonable or not. Considering the proposer are the developer of this gaming, they should have a rough idea about how many words need to be translated and multiple that number using the market price of translation - which is about $0.13 - $0.18 area - but how many words in total?\n\nWithout the total words not mentioned in the proposal, assessing the total budget of $7,500 is very hard (too low or too high? it depends).", "q1r": 3, "q2": "The proposer shares the rough timeline with enough metrics to monitor the progress of this project clearly. I would suggest that the proposer use the Cardano Forum and/or the Github Projects about their progress that can be easily tracked by the community - and they can post these results on their website. With a total of ~ 6 months of implementation, the auditability of this project should be easy to track.", "q2r": 4, "assessor": "z_assessor_2289", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 2008, "q0": "The main idea here is to translate Flooftopia, which is a MMOPRG game with customizable minting functionality, to Chinese. Its aim is to integrate and engage Chinese speakers in this game, creating interconnection and value to Chinese community and ADA, which, theoretically, conforms the challenge objectives.\n\nThe real impact here is the problem. The MMO games are a well know by the need of cooperation among the players. Therefore, there are two possibilities here:\n1 – Creating a dedicated Chinese server: This was not mentioned, therefore I’ll not consider this option; and\n2 – Having an international server: This is a problem to the proposal. Having a need to cooperate in the game in order to evolve, it’s quite impossible to eliminate the language barrier by simply translating the NPC, quest etc. \n\nThat being said, I must say that having only an international server the translation won’t be sufficient to generate engage and integrate Chinese community to ADA and the game itself.\n\nMore than that, Crypto is prohibited in China, which may be a problem to adopt this game. There are some countries which the Chinese live as well, however, this accounts to less than 4% of its community (counting people living in US which might speak English and, therefore, this project won’t apply) (https://www.worlddata.info/languages/chinese.php).\n", "q0r": 3, "q1": "The team is well defined and the proof was given. The majority of them has experience in the gaming field and there is one which works with game marketing. Therefore, all the game development seems mapped.\n\nI missed a blockchain/ADA expert, which will be necessary to implement the NFT integration. It’s not detailed, at least, and there is no part of the budget associated with this.\n\nThe budget is quite simple. It’s being asked USD 7500 to translate content, not specifying how much it’ll do (could be just the website, which is the priority on the list supplied, website + 1 or 2 NPC etc). It must be added the cost of the translator, allowing the voters to know if this asked fund is sufficient or not.\n\nThe proposal does not specify the monetization strategy – very important to keep this project going (need funds to pay the translator to translate the remaining). \n\nThe given timetable states that the Alpha version will be released in Q12023, and the finalization of all translations is Q42022. Therefore, if there is a dedicated translator and, depending on how big is the game, it seems doable. However, was not given enough information to evaluate this (quantity of stuff that must be translated).\n", "q1r": 3, "q2": "The roadmap given in the link provided, about the game creation and deliverables, is nice and fair. The timetable of translated content depends on how big is the game and on the translator (which is not the team expertise), therefore it is hard to evaluate.\n\nAnother point that should be exposed is that seems to have no place to verify the translation evolution. It should be added on the website, or create a place that the text is shown and people can criticize it (translation).\n\nThe KPI seems fair but there are no metrics, no aimed numbers (few thousand gamers in 1 year, few thousand players from Macau, X from hong kong etc), X NFT created in 1 year etc. Showing what you expect is good to verify the ambition and effort. \n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2414, "q0": "We have that the proposal in question addresses a game that has previously participated in Catalyst, which makes us wonder how this project is going and whether or not it has continued in its production. By looking at the project's website and the latest news around it, we can see that its development and updates have been constant. In this way, we can see that the proposal in question has the possibility of causing an increase in the visibility of the Cardano ecosystem and thus is aligned with the objectives of the challenge in which it finds itself. The budget being requested for the translation also seems fair, considering the benefits that can be translated, given that a large part of the world's population speaks Chinese. However, it is also worth mentioning that the eventual non-success of this game would cause this proposal (and other similar ones) to end up not having the expected effect. But we understand that this risk may be being minimized, mainly because the product being translated is a game and the professionals involved in the project are highly specialized in this area.", "q0r": 5, "q1": "Regarding the mentioned ways for the project to be completed, we have that there is not a great detail of the activities to be carried out, but this is justifiable since the steps to carry out the translation are not very complex. However, a point that seems to need more explanation is about the total budget that will be spent. In the budget detailing section, it was explained that it is not possible to estimate the expenditure accurately, as it depends on the amount of dialogues present. However, we observed that the professionals involved are closely related to the production of the game, so it seems that it would be possible to provide some approximation on what would be the maximum amount of dialogues present in the game, consequently indicating what the expected cost ceiling would be. Regarding the project team, once again, they have excellent technical requirements. We were able to find experiences of these professionals in several areas that are complementary to the development of a successful game, such as marketing and narrative design. This makes us believe in the chances of general success of the game and, consequently, also of this project. Furthermore, it is interesting to note that the team is already planning to reach a point of sustainability of the project, in order to possibly not need to request more funds.", "q1r": 4, "q2": "Regarding the metrics chosen to monitor the evolution of the project, we have that they are quite accurate in verifying if the present language barrier is being broken, and we know that this is the main objective of the proposal. With this, we can say that indicators such as the number of users from Chinese communities and the level of satisfaction with the translation are great progress checkers. In addition, ways were also indicated for the monitoring of these parameters to be possible. In a complementary way, the team's perception of success seems quite correct, using ideas that are the result of a good execution of the previously mentioned actions.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2605, "q0": "Flooftopia is a blockchain NFT game that is a social MMORPG that combines timeless MMORPG mechanics loved by players of all ages. In this fund9, the Flooftopia project has four proposals, #417062, #417033, #416986, and #417057, asking for funds to translate into four languages ​​Korean, Japanese, Chinese, and Vietnamese. This proposal is intended to expand and serve an audience in the East Asian market, so it fits well with the challenging setting posed. However, the Flooftopia project is only at the stage of publishing the website and litter Litepaper, so there isn't much content to translate. From my own experience, I've played some famous NFT games like Axie and The sandbox... all games with multilingual player communities, but these games are still only available in English, and no need for market-specific languages. Moreover, to translate languages ​​for each market, the game must have a large community in each language, which the new publisher should consider. For the above reasons, I think Flooftopia's language translation proposals are unnecessary and it does not impact does not help the development of the Cardano ecosystem.", "q0r": 2, "q1": "Proposals #417062, #417033, #416986, and #417057 of the Flooftopia project to serve four different markets in east Asia are similar proposals, so that I will rate them together. The human resources of the proposer are experienced and sound professionals, but the most necessary personnel for the translation proposal must be outsourced, which will affect the quality after translation. The estimated budget for funding in each submission is 7500 USD; combined, this is a significant amount. Currently, the new Flooftopia Project is in the early stages, and it is not necessary to apply for a fund for translation. In my personal opinion, I suggest letting this money fund other projects that will help the Cardano ecosystem more. After accessing and reviewing the project's roadmap at the website https://flooftopia.org/, the number of works in the second quarter of this project has not been completed yet, with many delays. I suspect this proposal was also not completed on time committed. A good, substantial project must have a roadmap and backup funding, but this proposal Flooftopia construction team entirely relies on calling for funding. This is just a form of profiteering from the funding. Simple from Catalyst.", "q1r": 2, "q2": "Flooftopia is a social MMORPG that must first have large user communities, but this project is in the early stages of development. The proponent does not anticipate how many users will be able to speak Korean, Japanese, Chinese, and Vietnamese. There is no community yet, and translating English content into that language is not necessary, so I find this proposal does not provide a specific goal; there is no measurable KPI that the Cardano community can check. I rate proposals #417062, #417033, #416986, #417057 not clear in all respects.", "q2r": 1, "assessor": "z_assessor_2324", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5799, "q0": "The idea somewhat addresses the challenge but might not have a good reach because the game is early in development. It looks like on their website that there is not yet a working product only roadmaps. It doesn't seem logical that they could translate something that has not yet been released. It says in the proposal that there are some risks of not receiving additional funding in other categories that would create problems for finishing this proposal. This means if they didn't get funding to build the game then there would be nothing to translate. ", "q0r": 2, "q1": "It looks like the team is talented at building video games. There are non native Chinese speakers listed as contributers to the project. They claim they will hire a chinese translator but do not list anyone specific. The plan does not have a detailed budget only lists full amount for Chinese translation. There is not enough information in this plan to show it would be likely to succeed. I find this proposal to be misleading because the information describes a game but on the website it says the game is not finished. ", "q1r": 2, "q2": "There is not enough information to audit this proposal. They give no timeline as to when this project is expected to be finished. They only give milestones which also are very vague considering there is no actual game that has been released. The proposal says that they will release information in real time, but does not specifically state where this information will be reported. There is really no way of knowing when this project would be finished. ", "q2r": 1, "assessor": "z_assessor_2751", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6329, "q0": "Disclaimer: I will be using almost identical assessment text for four proposals of these proposers.\nThis proposal is about translating the game 'Flooftopia' from English to Chinese to engage more Chinese users and thus broaden the game's impact. Hence it is aligned with Challenge as it wishes to serve the Chinese community from East Asia.\n\nEnglish is taught to Chinese students in Schools starting from elementary level; despite this, most young Chinese below the age of 35 can read only basic English but cannot understand long sentences or articles. On the other hand, Chinese Graduates of decent colleges can read simple articles with difficulty here and there; they may encounter words/phrases that they don't know. But they can get a rough idea of the article, or with the help of a dictionary; they can get a more precise idea. Hence this Flooftopia game translation effort from English to Chinese will provide value, but it depends on the game's success. \n\nMost CNFT & Game projects fail to gain traction and become dormant or have decreased community engagement after their launch. So it is not easy to ascertain the impact of this translation proposal as it depends on the success of the Flooftopia game. I hope they get the traction and success they desire. But as it is still in development, we cannot evaluate the game's success and impact on Cardano space. \n\nThe proposer stated that the main risk is the funding, which may be true. But I think the main risk will be the success of the game and the onboarding of users to the game. It depends on the quality of the game, marketing efforts, social media engagement from the game developers, and its popularity among the Cardano CNFT community. The success of the game can determine the impact of this proposal. Hence I cannot agree or disagree with the impact criteria of this proposal. ", "q0r": 3, "q1": "The proposer provided the team details along with their brief introductions. Their LinkedIn profiles are also given. The team is skilled as they are comprised of Game designers, developers, videogame programmers, etc.; considering the team's qualifications and skills, they will likely develop a good game. But the main person who will translate the game's content is yet to be hired. The proposer stated they are in contact with many translation service providers, and they are waiting for the funding to hire one of them.\n\nThe budget is $7,500, which can be reasonable if the game to be translated is fully developed and we know the volume of data to be translated from English to Chinese. The amount can differ based on the volume of data that has to be translated. Also, it has not been broken down into identifiable parts, which is not expected from the proposer. It is better to let the game fully develop, and then he can attempt to translate the game's content. \n\nThe timeline mentioned is two quarters. I cannot say it is reasonable without knowing the game's content to be translated. For example, if the translator has to translate a significant volume of texts, we can justify two-quarters worth of time, but if the work is not massive, then the mentioned time will be unreasonable. \n \nI think it is not feasible to propose something for translation that is not yet developed fully. So my suggestion for the proposers is to let the game fully develop and get it to the stage where it is gaining traction in Cardano space. Then you will have specific data on the volume of data to be translated, which can be mentioned in the proposal, such as 'these many pages multiplied with this much amount,' then maybe we can justify the amount as well as duration.", "q1r": 2, "q2": "The proposer stated we could utilize the timeline to track the progress. However, as I said above, the timeline is extended over two quarters which may or may not be reasonable to execute the mentioned task of translating the game that is not yet fully developed.  \n\nThe asked budget of $7,500 is not broken down into identifiable tasks. This omission also hampers the tracking/auditing of the proposal's progress. If the proposer is in touch with the translators and knows how much data will be there upon full game development, they may get some quotes, and based on those quotes, the budget should have been broken and mentioned in the proposal.\n\nThe success metrics are the increase in on-Chain activity from Chinese users via the Chinese-translated Flooftopia game and the new users coming to Flooftopia with the help of the translation services, which were refrained before due to the language barrier. \n\nI disagree based on the fact that the game to be translated is not yet developed. Hence we cannot ascertain the timeframe and budget required to execute the translation. If the proposer has an idea about the content, they should provide specific details in the proposal. ", "q2r": 2, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7101, "q0": "I believe this approach takes care of the challenge setting. It is essential for us to observe their timeline in order to comprehend the influence of this Chinese translation.The website and paper from the Flooftopia team are complete. They also intend to complete their NFT Floof minting customisation, German translation, and tale lore. Thus, by suggesting that Chinese translation begin in Q3 of 2022, the timetable is ideal since alpha testing will be finished in Q4. Having said that, I would like it if the proposer provided a ballpark figure for the number of prospective users their Chinese translation might reach. Although I'm sure there are a lot of MMORPG players from China, seeing those statistics in the proposal—or, at the very least, knowing how many Chinese-speaking players are already participating in Flooftopia—would help us understand the proposal's potential effects. I am aware that the proposer could immediately conduct a survey or poll among their community to gather this data (as was already indicated in their success metrics section), but as of right now, the absence of information makes it difficult to assess how crucial it is to reach a Chinese-speaking audience. However, given that they are situated in America, it is also not a terrible idea to get in touch with as many users as you can. The fact that so many items will need to be translated—including their website, their paper, the character dialogues, in-game guides, etc.—makes me inclined toward accepting this idea. Since I'm from Asia, I can see firsthand how many people genuinely refuse to play games that don't have their local language because they don't understand the game menus, what to do, and many other things. This is sad because the player base here is quite large. Therefore, I believe that every game nowadays needs to localize its content to cater to these users.", "q0r": 4, "q1": "Not due to a lack of expertise on their part, but rather due to a lack of information regarding the translation procedure, I can't totally concur with their implementation specifics. We could tell the team had given the concept a lot of attention because they had already taken into account the issues of translating technical jargon and planned to deal with them through proofreading. The team, on the other hand, is made up of very experienced and enthusiastic game developers. There is no information on who would translate it, how many translators they will need, or how they will compensate or collaborate with them. The proposer claimed that there are currently people in the community who can do this. Additionally, there is not enough clarity in the budget breakdown. What would happen if the requested budget was insufficient or excessive has not been addressed by the proposer. Again, I realize it's challenging to come up with those figures and present the data at this time; but, it's equally challenging for me to judge whether or not it's reasonable. My advice to the proposer is to make an educated guess at the specifics based on how they would translate German into Q2 2022. Using that as the basis for comparison, the proposer might calculate the amount of effort needed for the translation, describe it in the proposal, and finally justify funding.", "q1r": 3, "q2": "I tend to concur that the metrics in use today are enough for auditing. The proposer explains that the number of participants from Chinese-speaking groups and their satisfaction are key indicators of success. These indicators would be offered through polls and surveys, and the outcomes would be easily trackable. The absence of any method for tracking the translation process comes to mind as one modest improvement. It is not really useful to keep track of how many X words have already been translated from Y words when it comes to translation. It is considerably more beneficial to keep track of which tasks—such as character dialogues, game menus, etc.—have been accomplished. I'm interested in how the community translator informs or updates the proposer on the status of their translation. In the end, the timeline-based milestone strategy currently in use suffices.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8005, "q0": "The issue addressed in this proposal is the need for awareness and accessibility of CNFT gaming projects in East Asia. By offering a language integration in Chinese in this CNFt gaming project (Flooftopia). For example, 1.3 billion speakers no longer suffer from the language barrier. This project can have a positive impact on the Cardano ecosystem to give this game greater accessibility through language integration. The aims of the proposal thus correspond to the outlined challenges setting. The biggest future challenge included is funding. The connections with the translators that are ready to provide the services are in place, but money is needed to pay for them. It will be very important to get enough publicity about this game in China to get a bigger impact. a few similar proposals have been made. This proposal will have the biggest impact because there are very many speakers worldwide. (1.3 billion)", "q0r": 5, "q1": "The proposal describes the team members who will participate in this project. The team members have the relevant experience necessary to carry out the project. You can check the experience via their Linkedin. There is also a lite paper on their website with the photos of the team members and their position. (https://flooftopia.org/static/media/CryptoLoops_Litepaper.2fbc1c460a1ae415b08d.pdf) The proposal clearly states what type of team members are needed for this project. The budget will be used to translate the game into Chinese. It would be helpful to include an indication of how many hours it will take to translate the game. The hourly salary could also be included in the proposal. The budget seems sufficient to me to translate everything. The intention is to take Flooftopia to a point of sustainability. It might be useful to come back for future funding to translate the game into other languages. A plan has been included stating what will be translated Q3 and Q4. This plan is certainly realistic to carry out everything on time. The roadmap with milestones describes what and how everything will happen. The main thing will be not to exceed this budget. The main risk is that financing must be provided in order to pay the translator. These translations are certainly achievable and will have a positive impact on the game.", "q1r": 4, "q2": "A roadmap with clear milestones is included in the proposal. Work will be done in two quarters. In these two quarters, a translator will be appointed to translate the website and the game. The KPIs are included and are clearly measurable. It is good that these statistics will be easily traceable through surveys and polls among the target audience of Flooftopia. The petitioner has clearly described the language barriers to involving people from East Asia in CNFT gaming projects. Translating Flooftopia could be a first step towards better integration of these games built on the Cardano ecosystem. The project can be followed up well by the community,\nThe roadmap is the same as the 3 other proposals submitted. These different translations can then be done simultaneously.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10138, "q0": "This can happen. When the proposed team is having the idea of ​​a billion-people market. When providing accessibility for CNFT game projects in East Asia, specifically China. This is really great idea as well as scale your game in this market by translating the game into Chinese This is necessary to reach people who don't know English in this place, as well as breaking language barriers.\n\n    The writer has come up with a perfect solution to. Set the premise to reach more Chinese to join the team game. The author's explanation is accompanied by specific examples and has strong arguments to complete this idea. By accelerating the reciprocal relationship between East Asia and the rest of the Cardano Ecosystem. By integrating Chinese into the Flooftopia project, the project will be able to attract users that were previously inaccessible due to language differences.\n\n   The idea team is also aware of the costs involved. And offer affordable solutions seeking funding by Project Catalyst. At the same time, it has demonstrated the benefits of reaching the Chinese market, with billions of people participating in the CNFT game in local languages. direction. Bring people closer to the community.", "q0r": 5, "q1": " I think with the experience of each team member, they are strong enough to complete the idea. Moreover, the author group also assigns each person with specific work. This helps the group work properly as well as each member. do their professional job properly. As well as they provide full verification links for each member to fully recommend.\n\n  The proposal team has provided full information related to the idea's implementation roadmap, along with specific timeframes in 2 quarters, including the 3rd and 4th quarters of 2022. This helps everyone have an idea. Visually look at ideas + proposal groups. With this, I think the team can complete the idea on time and achieve high results.\n\n  But there is a note about the team's budget explanation. Can you explain each item using capital would be better?. If possible, please provide a clearer invoice for the amount of 7500usd, how it is used, including expenses for translation costs, as well as hiring game translators. Help people understand better on how to use the budget of the proposal.", "q1r": 2, "q2": "The author has provided information on indicators to evaluate the success of the project fully and transparently to the community, including measurable KPIs including: '' Number of Flooftopia users originating from Chinese-speaking communities.\nNumber of new users joining Flooftopia who have not joined before due to language differences.\nFlooftopia users feel satisfied with Build-An-NFT process and game in Chinese ''. This helps to accurately measure the impact of the proposal on the best Chinese community. The project also highlights the positive effects of the proposed activity as well as the benefits this idea brings to the Cardano Ecosystem in the NFT space. And hope that the team will soon complete the proposal on schedule to help the community in China soon access the team's game. As well as creating a new Cardano community in this area.", "q2r": 5, "assessor": "z_assessor_3160", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10541, "q0": "This proposal plans to make cardano more inclusive for the east asia community by translating their game, Flooftopia, into chinese. As stated by the author, chinese speaking communities are a very large market that would really benefit the caardano ecosystem with their participation. Flooftopia is an interesting game with many features that would teach users a lot about the world of NFTs and the cardano ecosystem as a whole. The many uses of cardano features within the game will be a great introduction to new crypto enthusiasts. As flooftopia is still in development, it is hard to know if the quality of the end project will be attractive enough to appeal to a lot of chinese users. But as it currently stands, the information provided on flooftopia is already very interesting to learn about NFTs and the different cardano features. I believe regardless of the success of the flooftopia game, translation into chinese will benefit growth and inclusivity of cardano in east asia.", "q0r": 4, "q1": "As stated previously, the scope of chinese speakers that will join the cardano community through flooftopia is an unknown variable, as the flooftopia game is still in development itself. There should be no technical difficulties in translation, but the budget is vague, as the authors don't know the amount of content that will be translated. The budget seems arbitrary because of that. I think the team needs to plan for a more specific amount of content to be translated, and make amore appropriate budget with that. If it is still too early to have at least a general idea of content, then the team needs to focus on finishing flooftopia development before thinking of translating into any language. For these reasons, I think it is unwise to ask for funding at this stage, and they will most likely have to come back for funding later, so I cannot give them a very high feasiblity rating. ", "q1r": 1, "q2": "The progress of this project is hard to audit. The authors currently do not know the amountof content that will be needed to translate. It is hard for the cardano community to know if the requested funds were successfully used for translation. The success is easier to audit than the progress, as we will be able to see community engagement by chinese users. Overall, the translation is hard to audit, but the success will be easily auditable.  ", "q2r": 3, "assessor": "z_assessor_3189", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10963, "q0": "Flooftopia is an interesting game with interesting roadmap too. I think this is a good opportunities to be able to translate it to the Chinesse language, so that this game could be played in Chinesse language. The proposal can add value to the Cardano ecosystem if this can be funded and integrated with the game developers. The key metrics and goal are align with the outlined challenge settings and able to scale to address future challenges.", "q0r": 5, "q1": "I think it is important to have a team already with detailed budget. It could be adjusted later, but it is not wise to put a number without details. There are so many expenses that could be listed down, like project managers working hours, how many translator that the proposer want to start with, the pay rate for each translator, etc. I think every translation project need to have a PIC for this task, so that this person can lead the process of the project from time to time and update it in a trackable platform by the community. In timeline detailed plan, the proposer need to have more detail timeline. How many months this translation will finished and it was written that the proposer will only hire a translator at Q3, I think it is too risky to have just one translator to translate flooftopia and too high budget ($7.500) for one translator only. I think in translation process in the game translation, the team need to have some people who can check the translation result from the translator. These people will make sure that the translation is correct and can be understood by the players in the future.", "q1r": 3, "q2": "The Metrics/ KPIs should be about the translation process for now. It is not about the user or the player for the game. Metrics/ KPIs that was written at this proposal can be fit after the game launched in the future. For translation proposal, the goals and metrics should be something like the translation progress and finished by the end of the year or something like that. It is not about the game adoption yet for now. I think the team could also add github or any open platform to report the progress of the translation, so that our community can track and see the translation progress from time to time. ", "q2r": 3, "assessor": "z_assessor_3213", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11287, "q0": "In East Asia, people need to raise awareness and provide access to CNFT game projects. To remove the language barrier for players the team came up with the solution to provide Chinese language integration to attract more Chinese users, thus expanding the impact of the game and the Cardano Ecosystem. It's not an idea with a strong creative ethos, but it certainly fits the challenge's propositions. The author plans to provide Chinese language integration for both Build-An-NFT functionality and the game itself to expand the target audience. With the team's Chinese integration into the Flooftopia project, they will be able to attract users that were previously inaccessible due to language differences. But I find this solution very vague, I think this proposal should go into detail explaining how to integrate the language into the game?, How long does it take to translate from English to Chinese? , Who will translate the dialogue in the game?... I think this lack of specificity will become a very significant problem for the project to become viable.\n", "q0r": 4, "q1": "When I read about the information of the people working on the project, I found the project very feasible. I believe in the experience of the group, the information of the members provided through LinkedIn is clear and detailed. But I didn't appreciate the detailed budget breakdown and roadmap part of the proposal. I think the proponent should come up with a more detailed plan to deal with the work leads, which will affect the audit process of the project. The implementation of the project should be divided into more specific timelines corresponding to the goals achieved, the team should divide the work progress by a week or at least by month. Quarterly progress will be very general and elusive. For example: In the third quarter of 2022, what month of the quarter does the team propose to hire a Chinese interpreter? What Number of interpreters?, Translate the Flooftopia website and mint function for how long?... I think the more specific a roadmap of tasks associated with time is, the easier it is for the community to track and evaluate the feasibility of the project. The group budget analysis is also very general, and difficult to evaluate. The budget requested by the team is $7500 to pay for the Chinese translation work. But I think the team should go into the cost analysis for each sub-item. For example, how much does it cost for 1 hour of translation? or does the team pay the cost of translating by day/month or by in-game dialogue?. In my opinion, the team should add information to the roadmap and budget to make the proposal more feasible.\n", "q1r": 3, "q2": "In the proposal, I see no mention of a roadmap with milestones and timeframes for achievement. The team only provides metrics that can be measured through the number of Flooftopia users from Chinese-speaking communities, the number of new users joining Flooftopia who have not previously joined, and the level of user satisfaction. Flooftopia. They measure these quantities through surveys and polls. I think it is very difficult for the community to check the progress of the project. As for success metrics, it would be better if the success metrics include measurable goals, such as having 300+ users or more than 70% of users satisfied with the product (from survey ). Quantitative numbers will make your proposal a lot better.\n", "q2r": 3, "assessor": "z_assessor_3235", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 14788, "q0": "Because this proposal has almost the same content as the other 3 proposals of the team in the same challenge (99% similarity). So this assessment of mine can be close to my assessments for those 3 proposals.\n\n- Developing NFT games and translating them into Chinese could be a way for Chinese speakers who don't speak English to participate in Game Flooftopia while also participating in Cardano (Chinese is the language with the most number of users in the world). But there are a few issues with the impact of this proposal.\n1. This is a game that is still in development. The gameplay of the game is still not clearly defined. So it is difficult to know if this is an NFT game that can attract community participation or not.\n2. The project has not yet built or developed the community and has no product, so the impact of the proposal is difficult to determine.\n3. The majority of people who can access NFT games and participate in NFT games are young people. Young people in China today, English is not a problem for them. Recently, the NFT games on the market only have English language, but I have not seen any problems with players. A lot of players in China do not know English but can still play NFT games because the features in the game are usually not too difficult to understand.\n4. In my opinion, translating a game into Chinese won't bring as much value as focusing on creating a great product. Take Axie Infinity as an example, Axie Infinity does not build games in many languages ​​(only English) but the development of Axie Infinity in Asian countries recently is very large. So translating the game into Chinese can't have too much of an impact on Cardano's growth in East Asia.\n\n- To show the impact of the proposal better, I have some advice:\n1. This NFT game needs to be completed and published in mainnet before translating it into other languages. The team also needs to have a significant amount of people involved in the game and include that information in the proposal to demonstrate the proposal's ability to have a big impact. If the team has completed the game and has a large enough community, translating the game into other languages ​​can prove to be an impact on the community.\n2. Proposer needs to clarify who the players of this project are in order to analyze if they have language problems. How many people know only Chinese but don't know English? Do players really have difficulty in the game if they do not know English? Is there a way to design the game interface so that people who don't know English can still play the game?\n3. Proposer should also state how the proposal will help develop Cardano in East Asia. How many people will create new wallets? How many people buy and sell NFT on the game? What is the achievable trading volume?", "q0r": 2, "q1": "- The detailed plan of the proposal is very sketchy. Proposer only gives a quarterly plan but no specific implementation tasks. Job descriptions for each team member are also not mentioned in the detailed plan.\n- The team has many proposals in this fund but also does not explain how the team will implement all these proposals.\n- Budget breakdown of the project is also not shown in detail. The team also doesn't really know what their workload is to calculate the cost.\n- Information of team members is listed very specifically and linkedin is attached. This is a proposal to translate English to Chinese. But I don't see any team members with Chinese translation experience.\n- The project is still in the development stage, there is no mainnet or testnet version yet. So it will be difficult to translate the game into Chinese when the game is not finished\n\n- To improve the feasibility of the proposal, I have some advice for the proposer:\n1. Proposer should submit this proposal after the project's game has been completed or the mainnet is available. Because if there is no game but the team wants to translate the game, it is difficult to prove the possibility of the proposal's success\n2. The detailed plan needs to be more specific. What are the specific tasks that need to be done? What is the monthly plan? What is the job of each member with relevant experience? After completing the translation, what is the marketing plan for the Japanese market?\n3. Proposer needs to determine exactly how many words need to be translated in the game. Because translation costs will usually be calculated on the number of words translated. If the team hires a translator, what is the monthly cost for that person? How many hours a day do they work?\n4. The members who directly implement this proposal need to have detailed information about their experience to prove the team's ability to implement this proposal.", "q1r": 2, "q2": "- The team measures the proposal process with the following metrics:\nThe number of users of Flooftopia originated from Japanese-speaking communities.\nThe number of users newly engaged in Flooftopia that were not previously engaged due to language differences.\nThe level of satisfaction among Flooftopia users’ experience with the Build-An-NFT process and the game in Japanese.\n- These metrics can be measured by surveys and polls in the game. But these are metrics that can be measured after the project's game is released, not the project's progress.\n- The above metrics are also only used to measure the results of the proposal implementation and marketing results, but cannot be used to measure the project's progress.\n- To measure the project's progress, the team needs to provide a way to measure the progress of the team's translation work such as: The first month will complete translating new player instructions, the second month will complete the dialogue translation in games, ...... and how to test and measure those work results.\n- Therefore, this proposal is very difficult to audit the process of the proposal", "q2r": 2, "assessor": "z_assessor_4100", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Flooftopia will provide Chinese language integration to engage more Chinese users (Hong Kong, Taiwan, Singapore, etc), thereby broadening the impact of the game and the Cardano Ecosystem.", "experience": "Coding: Dirk\nGame Programmer: Simon\nArt: Christian\nStory: Chris\nMarketing: Conward\nGame Design: Alex\n2D-3D Artist/Animator: Oleg\nLighting Artist: Lena\nStrategic Advisor: Marcin\n(Additional Team Detail Below)"}