{"id": 417057, "author": "cryptoloops", "title": "Flooftopia: Vietnamese Translation", "url": "https://cardano.ideascale.com/a/dtd/417057-48088", "category": 26602, "amount": 7500, "description": "Currently, there is a need to raise awareness & provide accessibility to CNFT gaming projects in East Asia. As the interest continues to grow, is paramount that we remove any language barriers.", "f6_no_assessments": 9, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 1669, "q0": "Vietnam is one of the countries that most adopt blockchain technology, according to several proposals that I have analyzed throughout the funds since the East Asian challenge was launched. We know that it is a very fertile market, which represents a vast potential for Cardano's growth. It is also said by the proponents that about 85 million people speak the language, so that, even numerically, it is very favorable for us to work towards the translation of language projects from our this language. So talking about this project, in particular, it is about translating the game Flooftopia into Vietnamese. In my view, this is important in several ways. Knowing the project because of other reviews I've done about it, I know that it's a game focused on NPCs, that is, animated characters that would be built by the player himself (in the Build an NFT modality, in which characteristic such as color, eye shape etc.) would be chosen individually. The objective of the game would be to explore the world from there, that is, conquer missions, build a house, a village, evolve your NPC and etc. A kind of RPG. I think this in itself is interesting because it corresponds to a different game than most games that involve NFTs, for example, we know that most of this type of game is focused on games of chance, battle, and for an audience that already knows the cryptographic world and is familiar with the technologies in question. The difference of Flooftopia in my view is that it works on conquering a different audience, which encompasses a wide range of ages (from children to adults) and people who do not necessarily already know about blockchain. That is, it would be very interesting to bring a game with such characteristics to the Vietnamese audience, this would certainly meet the specific objectives of the challenge to expand the Cardano ecosystem to the intended location. Most likely, new people would get to know Cardano and blockchain through this project, I believe that new digital wallets would be created, since to play some options they would be paid (it would be interesting if it was defined if all payments would be made in Ada, as is ideal). Since the cryptographic universe would be introduced to people through this game, they could even get involved with other aspects of Cardano, which would increase the number of active members in our community. My only observation here is: we don't know who the translator would be or how much content would be translated, which somewhat undermines our certainty regarding the requested funding and also compromises our understanding of the project's practical realization process. Proponents claim that they already have contact with the Vietnamese translator community, which is an advance, but that information has been overlooked a bit too. Therefore, I believe that the proposal is very impactful in a positive way, some more details were pending, which does not compromise the importance of the project, but could add more understanding.", "q0r": 5, "q1": "Unfortunately, the feasibility of the project is not high. When it comes to the roadmap, the level of detail of the activities is very low. It is said that in Q3 2022 the activities would be “hire a Vietnamese translator / translate Flooftopia website and coinage functionality / start translating in-game dialogue”. We would need more explanation on all this. How would the translator be selected? They point out, as I mentioned in the impact, that they already have a certain degree of rapprochement with the Vietnamese translators. It would be important for us to know who the candidates are and how the candidate would be selected to work on this project, specifically. What would the work routine be like to translate the site, and to start translating the dialogues? How much time would be spent on each part? It would be more ideal, in my view, if activities were explained monthly rather than quarterly - and that we had a greater degree of specificity regarding each of them. Talking about the last quarter of the year, it is said that in this interval the quests and dialogues of the NPCs would be translated; how many missions are we talking about exactly? What would be the volume of the dialogues, that is, how much work time would this activity take in relation to the whole? In budgetary terms, there is also a major problem here. We have a request for $7500, but we don't know how that money would be used in practice. It all depends a lot on how the translator's work routine would be. How many hours would he put in each month to justify the salary of 1250 dollars (7500 divided by 6 months)? What is the average salary of Vietnamese translators? I believe it is a higher value than for translations such as English/Spanish, as it is a language that is spoken by fewer people than Spanish, but it would still be important to have an understanding of how much is normally charged, so that we could do a fair assessment. Speaking of the team, the (very detailed) curriculum of each team member is attached to the proposal, as can be seen in the excerpt: “Game Design: Alex worked as a creative director at Ubisoft's campus and as lead developer of Faith and Honor Barbarossa. He has considerable experience researching psychological and neurological sweet spots in game-based learning. With over 4 years of experience in game design, Alex is geared to bring the best gaming experience to Flooftopia!” . However, we do not know who the translator would be responsible for taking this initiative forward. As much as a lot of confidence is transmitted in the team, since we have vast information about who they are, what their professional backgrounds are and what roles they play within the Flooftopia project, it would be essential for us to know more about the translator, if they have training in the area, experience with blockchain, with games and etc. In general, several parts of this topic need improvement, deepening.", "q1r": 3, "q2": "The auditability of the proposal is good, although it could improve in some points. Talking about progress, it is said that this would be measured through some pre-defined KPIs due to instabilities that may occur during the development of the schedule. Such KPIs would be “number of Flooftopia users originating from Vietnamese-speaking communities / number of recently engaged Flooftopia users who were not previously engaged due to language differences / Flooftopia users' satisfaction level with the Build-An- NFT and the game in Vietnamese”. I agree that these are very straightforward and useful ways of measuring partial results; but in addition, it would be important to follow the processes that would be behind such results, the work routine of the professionals involved. Our main agent is the translator: how could we monitor their work routine? In my opinion, this improvement would be part of a greater specificity of the script. While we would know what would happen in each part in a deeper way, we would be more able to follow if what was planned was being done in the right way, in the planned time and with all the details well supported. I believe it would be necessary for the translator's work to be done together with that of a fixed member of the game's development, so that possible impasses and doubts can be resolved together. Therefore, regarding the auditability of the progress, the information provided is very useful, but it is not enough for us to have the necessary degree of understanding of what would be being done with the development of the stages. And finally, about the final results, we know that the goal is for a large portion of Vietnamese speakers to be able to play Flooftopia and learn about the possibilities of NFT games, blockchain technologies and so on. That is, the goal is that, indirectly (through the game), the Cardano community can increase, that the number of NFTs minted on our blockchain (CNFTs), smart wallets, Ada in circulation, etc. The issue here is that the proponents do not make it clear how such data would be studied, measured and presented to the Cardano community. I think it is necessary that a survey be carried out, in order to collect data such as: the number of new players coming from Vietnam, how these people would be actively working within Cardano and so on; as well as the KPIs specific to that project, for example “ The number of proposals originating from East Asian participants in Project Catalyst + The quantity and quality of funded proposals originating from East Asian teams + The observed impact of funded projects (meeting their KPIs) + Did we increase the participation of the Cardano community and Catalyst teams with East Asian residents?”. Such information must be taken directly to our entire community.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 2010, "q0": "This proposal aims, basically, to translate a game called Flooftopia, which is a social MMORPG having a customizable minting functionality.\n\nEven though I’m not a game person, I recognize that the game potential is incredible, having an expected market size USD 0.5T in 2028, thus having a slice of this wouldn’t be bad.\nHowever, since MMO stands for Massive Multiplayer Online, I suppose that Flooftopia will be an online game. That being said, I just don’t think that translating the site, NPC, quests etc will help with ‘accelerating the interconnectivity between East Asia and the rest of the Cardano Ecosystem’.\n\nI’m from Brazil and when I was younger, I’ve played, for many years, Mu Online and then World of Warcraft. At the time I didn’t speak English and was a pain trying to play in the same level. I’m telling this because even if the NPC and quests were translated in Portuguese it would not help me since the majority of people who played were from countries that spoke English and, in order to be competitive, since it is a collaborative game, I had to learn English.\n\nThat being said, the proposal, which aims the culture’s interconnectivity, won’t reach it and therefore, won’t add value to East Asia community, not tackling the challenge objectives.\n", "q0r": 3, "q1": "The proposal could be divided in two parts:\n1 – Translation:\nSince the translation depends only on the translator, this part is easy to accomplish if it has funds. Therefore, it’s not an issue to finish this bit.\nHowever, there is a problem. The Budget is not well defined and, therefore, we, voters, have no clue if the asked fund is enough or not. \nThe majority of translators that I had contact charge for words. Therefore, it would be interesting to add an estimation of words to be translated in each part of the project (website, NPC, quests etc), allowing the voters to measure if the fund is enough or not.\n\nIf the fund is not enough, which is the risk listed by the proposer, what is the solution to keep translating (besides come to the Catalyst)? There must be a strategy tackling this.\n\n2 – Game\nThe proposer gives the team’s qualification proof, having experience in this area of knowledge. Therefore, it seems feasible. The only point that I didn’t see explored is the professional who has the knowledge and experience to work with Cardano blockchain nor a part of the budget to it.\n\nIf there is a way to create separated serves (Vietnamese server, English server, e.g.) could be a solution.\n", "q1r": 4, "q2": "The website provided gives a clear roadmap with milestones, showing what has already been completed, which is good.\n\nThe KPI are well defined, however the metrics is missing. The proposer did not specify which are the numbers that they’re aiming. It would be good to include the expectations, time divided, and the final objective.\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2416, "q0": "We have that today the video game industry is bigger than the movie and music industry combined. In this context, we see that game projects using Cardano technologies, if successful, have great chances of considerably expanding the visibility of the Cardano ecosystem. And in this context, we observe that a translation project like the one mentioned here will make the game, which naturally already has a great appeal, reach an even greater number of people. Therefore, we can say that this proposal is in line with the goals established for the challenge. Additionally, the budget being requested also seems fair, especially because there are more and more Cardano projects emerging and aimed at speakers of this language.", "q0r": 5, "q1": "Regarding the feasibility of the project, we have that the steps described in the action plan are not very complex. However, in the same way, what you want to accomplish is a very direct action. Still, it seems interesting that a little more specification was given on the budget breakdown. It was said that an exact value could not be given as this will depend on the total amount of dialogue. However, we also have that the game's development team is very attached to the proposal, so it would be nice if a maximum amount of dialogue was established, even if approximately, so that we could also know the maximum that would be spent on translation. And still about the team involved in the project, we noticed professionals with experience in several areas, making the general technical skills of the team quite comprehensive> Furthermore, the involvement of professionals with the universe of games is quite evident, and we know that this proximity of the development team with the project is essential for the game to have its own personality. And the more original this personality, the greater the chances of the game to stand out and have a lot of adoption, making Flooftopia and also the proposal in question successful.", "q1r": 4, "q2": "Regarding the parameters defined for the project's progress to be monitored, we note that the points mentioned here are extremely accurate, since they will measure the magnitude of the rupture of the previously existing language barrier. In addition to this great definition of the parameters to be used, we also noticed a concern in the way they will be measured over time. Finally, regarding the team's perception of success, we found a very well-defined scenario, in which language barriers were overcome and greater integration between East Asia and the gaming market took place using blockchain technologies. We also note that this is exactly what was intended during the development of the idea.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6332, "q0": "Disclaimer: I will be using almost identical assessment text for four proposals of these proposers.\n\nThis proposal is about translating the game 'Flooftopia' from English to Vietnamese to engage more Vietnamese users and thus broaden the game's impact. Hence it is aligned with Challenge as it wishes to serve the Vietnamese community from East Asia.\n\nThe need for translating content into Vietnamese is something that may not be needed, nor will it help grow the Cardano community in Vietnam. Because if you do some research online, then you will know most of the students in Vietnam learns English and can understand it clearly, but they lack confidence when it comes to speaking. Also, English is spoken in Business circles in Vietnam. Hence we can anticipate the crypto community, usually educated people from Vietnam, to understand the English language.\n\nMost CNFT & Game projects fail to gain traction and become dormant or have decreased community engagement after their launch. So it is not easy to ascertain the impact of this translation proposal as it depends on the success of the Flooftopia game. I hope they get the traction and success they desire. But as it is still in the development stage, we cannot evaluate the game's success and impact on Cardano space. \n\nThe proposer stated that the main risk is the funding, which may be true. But I think the main risk will be the success of the game and the onboarding of users to the game. It depends on the quality of the game, marketing efforts, social media engagement from the game developers, and its popularity among the Cardano CNFT community. The game's success can determine the impact of this proposal. Hence I am afraid I have to disagree with this proposal's impact criteria as I think the Vietnamese translation will not add value irrespective of the project's success.", "q0r": 2, "q1": "The proposer provided the team details along with their brief introductions. Their LinkedIn profiles are also given. The team is skilled as they are comprised of Game designers, developers, videogame programmers, etc. Considering the team's qualifications and skills, they will likely develop a good game. But the main person who will translate the game's content is yet to be hired. The proposer stated they are in contact with many translation service providers, and they are waiting for the funding to hire one of them.\n\nThe budget is $7,500, which can be reasonable if the game to be translated is fully developed and we know the volume of data to be translated from English to Vietnamese. However, the amount can differ based on the volume of data that has to be translated. Also, it has not been broken down into identifiable parts which is not expected from the proposer. Therefore, it is better to let the game fully develop, and then he can attempt to translate the game's content. \n\nThe timeline mentioned is two quarters. I cannot say it is reasonable without knowing the game's content to be translated. For example, if the translator has to translate a significant volume of texts, we can justify the two-quarter worth of time, but if the work is not huge, then the mentioned time will be unreasonable. \n \nI think it is not feasible to propose something for translation that is not yet developed fully. So my suggestion for the proposers is first to let the game fully develop and get it to the stage where it is gaining traction in Cardano space. Then you will have specific data on the volume of data to be translated, which can be mentioned in the proposal, such as 'these many pages multiplied with this much amount.' Then maybe we can justify the amount as well as duration. ", "q1r": 2, "q2": "The proposer stated we could utilize the timeline to track the progress. However, as I said above, the timeline is extended over two quarters, which may or may not be reasonable to execute the mentioned task of translating the game, which is not yet fully developed.  \n\nThe asked budget of $7,500 is not broken down into identifiable tasks. This omission also hampers the tracking/auditing of the progress of the proposal. If the proposer is in touch with the translators and knows how much data will be there on the full development of the game, they may get some quotes, and based on those quotes, the budget should have been broken and mentioned in the proposal.\n\nThe success metrics are the increase in on-Chain activity from Vietnamese users via the Vietnamese-translated Flooftopia game and the new users coming to Flooftopia with the help of the translation services, which were refrained before due to the language barrier. \nI disagree based on the fact that the game to be translated is not yet developed. Hence we cannot ascertain the timeframe and budget required to execute the translation. If the proposer has an idea about the content, they should provide specific details in the proposal.", "q2r": 2, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "So, does the game have to be out before we provide translations for the game? This seems to be a re-occurring theme, and we are looking to take the translations for dialogue and more and get those translated for the alpha release."}, {"id": 7103, "q0": "I tend to agree that this proposal is up to the challenge. To understand this impact on Vietnamese translation, it is crucial for us to see their timeline. The Flooftopia team has finished the website and paper. They also plan to complete the storyline, Chinese and German translation, and their adaptation of the NFT Floof minting. So, by proposing the Vietnamese translation to start in the third quarter of 2022, the timeline is perfect because the alpha tests will be completed in the fourth quarter. That said, I would appreciate it if the sender could give us an estimate of the number of potential users they would reach by providing Vietnamese translations. I'm sure there are tons of MMORPG players from Vietnam, but seeing those numbers in the proposal, or at least, how many Vietnamese-speaking players are currently in Flooftopia, would convince us more of the impact of this proposal. I understand that these numbers may not be available at the moment and that the proposer could do a quick poll or survey within their community to get them (already listed similarly in the success statistics section), but at the moment, the lack of information makes it difficult to determine how important it is to reach a Vietnamese-speaking audience. On the other hand, it's also not a bad idea to reach as many users as possible since they are based in North America. What prompts me to agree with this proposal is that there are many things that need to be translated: their website, their litepaper, character dialogues, game manuals, etc. As an Asian person, I immediately see how many players don't actually play games that don't speak their native language, because they don't understand game menus, what to do, and much more, which is a shame as the player base here is incredibly large. That's why I think it is necessary nowadays for every game to reach these players through language localization.", "q0r": 4, "q1": "I cannot fully agree with the details of their process, not because of their lack of skill, but because of the lack of details in the translation process. No, the team consists of very experienced and passionate game developers, and you can tell that they have considered this proposal because they have already considered the challenges of translating technical terms and planned to address them through validation. However, there is no word on who will translate it (the proposer mentions that there are already people in the community who will, but no specific details are given), how many translators they will need, or how they are working with them. Also, the budget is not broken down in enough detail. The proposer did not specify what would happen if the requested budget was insufficient or exceeded. Again, I know it’s hard to find these numbers and present the information now, but it’s also hard for me to judge if it’s fair. My suggestion to the proposer is to approximate the details of what they are currently doing based on how they translate Chinese and German in the second quarter of 2022. With a stable knowledge base, the proposer can estimate the amount of work required for the translation, explain what is in the project, and finally justify the budget.", "q1r": 3, "q2": "I am inclined to agree that the current review criteria are sufficient. The amount of success is determined based on the number of players from Vietnamese speaking communities and their satisfaction. These metrics are provided by surveys and polls, and the results are quickly tracked. One small improvement I can think of is how they control the translation process. When it comes to translation, keeping track of X number of words already translated from Y words is not very useful. It is useful to keep track of finished items like character dialogs, game menus, etc. I would like to see how the translator reports or updates the proposer on the progress of their translation. However, the current approach to milestones based on timelines is sufficient.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10817, "q0": "* Note: This assessment would be similar to other of my assessments since these proposals are also similar.\nThe proposal fits partially with the objectives of the challenge because it seeks to translate an existing game into Vietnamese, to make a game known and accessible to everyone (with more than 85 million speakers, according to the author's research). In this aim, we seek to benefit both Viet Nam and Cardano. I say that it does not meet 100% of what we are looking for because Vietnam is not located in the geographical region targeted by the challenge, East Asia, but close to it. I think the project will succeed. By having such a game translated into their native language, the inhabitants of Viet Nam would have an easy to become members of the community. Therefore, I believe that the proposal would benefit Viet Nam to the full. And naturally, the Cardano Ecosystem would also come to an advantage, since so many people would know more about our blockchain, maybe invest in its buy and delegating Ada, CNFTs, the number of transactions on the blockchain could increase, etc. are the objectives of the current challenge. As Cardano becomes more popular, the overall investment may increase. However, some contents of the project have not been clarified. I think it is necessary to include the basic information about the game to be translated. How is this game? The highlight of this game? Why translate this game? How will this game benefit Cardano Ecosystem? All this information could be clearer. So I'll give it 4 stars (I would give it 5 if this was explained).", "q0r": 4, "q1": "* Note: This assessment would be similar to other of my assessments since these proposals are also similar.\nI think this part leaves a lot to be desired and requires a good improvement. We have a roadmap that explains what would happen in Q3-4 of 2022 and Q1-2 of 2023. The activities that have been presented but no details on the work routine. How are these jobs done? Who would be responsible for each part? How long would the translation process take? Could some of them happen in parallel or one at a time? Therefore, the script is just a notion of what would happen, in my view, not being adequately detailed. It would be necessary to understand the routine of the professionals involved. Analyzing the team part, this part of the proposal is quite adequate, we know the names and main roles of the team members, as well as we have a link ( LinkedIn) where we can see the work they develop in practice. However, the problem here is that the proponent provides information about the people involved in creating and developing the game, without any information about the translator. I think the game translator plays an important role in the success of the project. The author claims that a professional translator or translator will be hired, but do we already have candidates in mind?  We need to know: What's your name, academic background, and the projects he translated? How would you be selected? how does this person relate to the Cardano ecosystem? It would be even more interesting if we had a complete picture of the translator. Finally, in relation to the budget, a total of 7500 dollars is requested. But there is no explanatory information about the amounts of the budget. Who will be responsible for the translation? How is the salary calculated? Is it based on the number of words translated or based on the number of hours worked?", "q1r": 3, "q2": "* Note: This assessment would be similar to other of my assessments since these proposals are also similar.\nLike the previous topic, this one leaves a lot to be desired. All metrics chosen to measure progress are numerical. The proponent claims that \"we can make this information available quickly and in some cases in real-time\". But where will that information be tracked? how often? In what form will it be presented? It would also be important to have qualitative information. I thought immediately, that surveys could be carried out in the app itself, after just a few days of use, to collect data such as: are users participating in other ways in the activities of the Cardano ecosystem, beyond the game? Are people getting to understand, even if not so deeply, how the cryptographic world works? It would also be important for us to follow the process beyond the result, and this would be done more effectively if the author had established a detailed timeline on the feasible part.", "q2r": 3, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "So, does the game have to be out before we provide translations for the game? This seems to be a re-occurring theme, and we are looking to take the translations for dialogue and more and get those translated for the alpha release."}, {"id": 11288, "q0": "In East Asia, people have a need to raise awareness and provide access to CNFT game projects. To remove the language barrier for players the team came up with the solution to provide Vietnamese language integration to attract more Vietnamese users, thus expanding the impact of the game and the Cardano Ecosystem. It's not an idea with strong creative ethos, but it certainly fits the challenge's propositions. The author plans to provide Vietnamese language integration for both the Build-An-NFT functionality and the game itself to expand the target audience. With the team's integration of Vietnamese into the Flooftopia project, they will be able to attract users that were previously inaccessible due to language differences. But I find this solution very vague, I think this proposal should go into detail explaining how to integrate the language into the game?, How long does it take to translate from English to Vietnamese? , Who will translate the dialogue in the game?... I think this lack of specificity will become a very significant problem for the project to become viable.\n", "q0r": 4, "q1": "When I read about the information of the people working on the project, I found the project very feasible. I believe in the experience of the group, the information of the members provided through LinkedIn is clear and detailed. But I didn't appreciate the detailed budget breakdown and roadmap part of the proposal. I think the proponent should come up with a more detailed plan to deal with the work leads, which will affect the audit process of the project. The implementation of the project should be divided into more specific timelines corresponding to the goals achieved, the team should divide the work progress by a week or at least by month. Quarterly progress will be very general and elusive. For example: In the third quarter of 2022, what month of the quarter does the team propose to hire a Vietnamese interpreter? What Number of interpreters?, Translate the Flooftopia website and mint function for how long?... I think the more specific a roadmap of tasks associated with time is, the easier it is for the community to track and evaluate the feasibility of the project. The group budget analysis is also very general, and difficult to evaluate. The budget requested by the team is $7500 to pay for the Vietnamese translation work. But I think the team should go into the cost analysis for each sub-item. For example, how much does it cost for 1 hour of translation? or does the team pay the cost of translating by day/month or by in-game dialogue?. In my opinion, the team should add information to the roadmap and budget to make the proposal more feasible.\n", "q1r": 3, "q2": "In the proposal, I see no mention of a roadmap with milestones and timeframes for achievement. The team only gives measurable indicators through the number of Flooftopia users from Korean-speaking communities, the number of new users joining Flooftopia who have not previously joined, and the level of user satisfaction. Flooftopia. They measure these quantities through surveys and polls. I think it is very difficult for the community to check the progress of the project. As for success metrics, it would be better if the success metrics include measurable goals, such as having 300+ users or more than 70% of users satisfied with the product (from survey ). Quantitative numbers will make your proposal a lot better.\n", "q2r": 3, "assessor": "z_assessor_3235", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 12670, "q0": "The proposed issue that needs to be addressed here is that Currently, there is an increasing need to raise awareness and provide accessibility to CNFT game projects in East Asia which is of paramount importance to remove all language barriers. This proposal will add value to the Cardano ecosystem as Flooftopia will provide Vietnamese language integration to attract more Vietnamese users, thereby expanding the influence of the game and the Ecosystem of Cardano. The proponent that came up with the solution is that Flooftopia plans to integrate Vietnamese for both the Build-An-NFT functionality and the game itself to expand its target audience beyond English-speaking communities. translation takes into account the accuracy of technical terms in each language, always proofreading the translated work to ensure a high quality of delivery. strives to break down the language barrier between East Asia and the rest of the world, bringing the community together with a highly qualified team with connections to the community of translators. This proposed solution addresses the challenge by accelerating the reciprocal relationship between East Asia and the rest of the Cardano Ecosystem. With the integration of Vietnamese into the Flooftopia project, the project will be able to attract users previously inaccessible due to language differences so that it can be scaled up to effectively address challenges. awake in the future. I give 5* for the impact of this recommendation.", "q0r": 5, "q1": "The proposer has provided evidence of relevant skills and experience required to implement the proposal including Coding Man, Game Programmer, Card Art, Marketing, Game Design, Art 2D-3D Artist / Animator, Light Artist, Strategic Advisor, type and number of team members required are also presented in detail by the proponent of each relevant experience and skills. members have the link attached. The proponent gave an estimated budget of $7500 however the proponent did not provide a detailed budget breakdown for the proposal and they also explained that it would depend on the amount of dialogue the game would have play of Flooftopia yes. However, I think it would be better if the proponent just sketched out the necessary costs and the approximate amount for each cost, which can be estimated temporarily with each amount of dialogue that Flooftopia's game about how much will it correspond to the budget. The proponent gives the actual timetable for implementing the project in the 3rd and 4th quarters of 2022 as follows: 3rd quarter 2022 Hire Vietnamese interpreters, Translate Flooftopia website and mint function, Start translating for game dialog. Qúy 4 2022 translates all completed quests and NPC dialogues. The proponent has identified the main challenge of the project as funding so they are still seeking Project Catalyst funding. With the information given I agree that this proposal will be successfully implemented.", "q1r": 4, "q2": "The proponent provides a roadmap for implementation in the 2nd and 3rd quarters of 2022 with specific milestones to be achieved. The proponent has selected indicators to determine the success of the project: The number of Flooftopia users originates from Vietnamese-speaking communities. A number of new users joined Flooftopia who had not previously joined due to language differences. Satisfaction level of Flooftopia user experience with Build-An-NFT process and game in Vietnamese. And I think those are the right indicators to determine the success of the proposal. The proponent clearly described the current issue of the need to raise awareness and provide accessibility to CNFT game projects in East Asia. As interest continues to grow, it is paramount to remove any language barriers. This is a new proposal for Project Catalyst but the proponent has already provided clear, concrete solutions, easy to understand to solve the given problem.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13668, "q0": "This proposal helps many vietnamese people to get started into CNFT. It helps to kick start their career in Blockchain technology and help many vietnamese people to mint their NFT too. But this proposal does not fully addresses the challenge.In my view if their is a educational content on how to use the platform will be helping many vietnamese community to get started easily. Vietnamese language integration helps onboard many users in cardano community. This proposal breakdown the language barrier between vietnamese community and remaining people. Intrepreting one's native language and create a Build-An-Nft functionality and the game itself is awesome.This proposal helps the cardano ecosystem to be unique because  other blockchain technology doesn't have language integrations except English.", "q0r": 3, "q1": "This proposal has a high chance to be implemented successfully. The proposal has posted relevant skills which help identify the issue. The team is hiring the translators which help the work to be done properly. The budget break down is not clear, but it is for a good reason because the intrepretation will be depending upon how much dialogue it has. In my opnion the budget seems a bit high. It provides a detailed roadmap whch helps  the future of this project grow. But their is going to be a lot of challenges to be faced in future . If they onboarded as manu viernamese community into their platform , it easily helps the the project to grow.", "q1r": 4, "q2": "The information above is enough to audit the progress and the success of this proposal. It helps many east asian communities who has a language barrier to onboard in this project. The team working on this project have relevant skills . The team is making an effort to change the future. If their are any queries the project has community groups  like discord,twitter and you tube which help the communities in every aspect. To Onboard many users especially East asian communities their should be a proper marketing team. With right marketing many people get to know their is a project created for the East Asian community. The CEO is the marketing head of this project,By this we can undertand that how good their marketing going to be.", "q2r": 4, "assessor": "z_assessor_3735", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Flooftopia will provide Vietnamese language integration to engage more Vietnamese users, thereby broadening the impact of the game and the Cardano Ecosystem.", "experience": "Coding: Dirk\nGame Programmer: Simon\nArt: Christian\nStory: Chris\nMarketing: Conward\nGame Design: Alex\n2D-3D Artist/Animator: Oleg\nLighting Artist: Lena\nStrategic Advisor: Marcin\n(Additional Team Detail Below)"}