{"id": 417356, "author": "vcoincheck", "title": "Vcoincheck Library (Phase 2)", "url": "https://cardano.ideascale.com/a/dtd/417356-48088", "category": 26602, "amount": 28500, "description": "Knowledge and news about Cardano are mostly in English,it is difficult to reach Japanese community, affecting the expansion of Cardano...\nKnowledge about Cardano and blockchain are very large", "f6_no_assessments": 15, "f6_rating": 4.955555555555557, "videos": [], "media": [], "f6_assessments": [{"id": 3611, "q0": "I really like the challenge theme \"Developing East Asia, Developing Cardano\" because I am a Vietnamese from East Asia.\nWhatever proposal is for East Asia, I will be the beneficiary.\nThe proposal given is very simple but meets the challenge requirements.\nThe blockchain community in Japan is very large, passionate and a promised land for Cardano if choosing this country to develop and expand the ecosystem.\nThe solution is to develop phase 2 of a knowledge library, articles on blockchain will be updated in 3 languages ​​in English, Japanese and Vietnamese. Not just articles, the community can come here looking for blockchain terms.\nIt can be said that this will be the East Asian electronic google.\nThe project will attract blockchain enthusiasts, who are new to blockchain, they will update their knowledge of Cardano with confidence and Catalyst.\nWith 2 potential risks identified, and with a reasonable solution associated with them, I find it suggested to anticipate this risk.\nThere will be a platform for people to learn more about blockchain, the proposal is very practical, I support you", "q0r": 5, "q1": "The functions are gradually completed and updated as shown in the detailed plan in the first month, the remaining months will update the updated content into the library. This is a specific timeline for the community to follow. It is essential to have a trial library demo for the community to evaluate. The budget is divided and reasonable with over 50% of the solution development budget.\nI see the project has a team of experienced, strong blockchain and Japanese and Vietnamese languages. All staff members are fluent in English, Japanese and Vietnamese, and are native speakers. The qualifications are clearly public, I believe that the team will develop the project as well as it did with the projects that have been successfully funded in the previous Funds.\nIt is a continuation of the project funded by the previous Funds, plus all information about the team, budget, and progress shows the feasibility of the project.", "q1r": 5, "q2": "The proposal sets out goals to measure project progress in line with the detailed construction plan, the goal of completing the library in 04 months, updating 30 articles in 3 languages in English, Vietnamese and Japanese every month. This goal with specific numbers will help the community to easily track and check the Detailed Report of Work submitted to Catalyst public to the community monthly will further assess the transparency of the project.\nEvery project is considered a success if it is well received by the community and so is your project.\nThe successful results are clear: 200 updated knowledge articles. In addition, the library is open to the community to share knowledge, which will help the East Asian Cardano community thrive.", "q2r": 5, "assessor": "z_assessor_2464", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3820, "q0": "The proposer is saying that knowledge and news about Cardano are mostly in English, and this is a problem in the Japanese community, and this affects Cardano expansion in Japan.\nThe proposal is thereby seeking to build on their already established Vcoincheck.io team (a funded proposal in Fund 8) to add more knowledge articles into Library in phase 2.\nThe proposer is addressing the challenge by proposing that they will create a place to store blockchain blockchain information with high reliability, which is a tool to help break down the English language barrier and help the Japanese community to access Cardano and Catalyst faster and promote development. \nAlso they will create a place for knowledge exchange between the Japanese community and the Vietnamese community, and develop a stronger and closer Cardano community. \nOther relevant factors to grow the ecosystem were mentioned in the proposal. \nThe proposal explained two risks and solutions associated with the proposal, which are impressive.\nI can conclude that this proposal effectively addressed the challenge. My rating is 5. ", "q0r": 5, "q1": "There is a clear roadmap and timeline which shows that this proposal has 4 months of implementation. Details of tasks for each month have been outlined in the proposal. Articles that need to be translated into Japanese have also been outlined in the proposal for each month. \nTargets for each month have been explained well.\nThe budget total for this proposal is $28,500 and it is broken down into smaller budget. The amount requested is reasonable.\nThe team is made up of 17 members who have been divided into different teams with specific tasks. \nThe teams are : the Leading team which has 2 members; the core team has 7 members and the specialist team has 8 members.\nThe team has various qualifications and experiences that are relevant to the proposal, such as translations, interpreters, developers and designers, blockchain experts, etc. \nThe team has indicated that they will return to Catalyst for further funding to continue the work. They have also indicated that they are part of other proposals in Fund 9. \nWith all that said, the team experiences and plan presented will make the implementation of the proposal successful. My rating is 5.", "q1r": 5, "q2": "This proposal has provided details on how to track the progress of work through the Vcoincheck.io website or Cardanolibrary.net. \nThe indicators to measure the progress have been outlined into 4 months as in the 1st month, there will be summary of articles and translate into Japanese; in month 2, also outlined, to month 4. \nSuccess of this project as indicated is that at the end of the project, there have been almost 200 knowledge articles, more diverse function that can serve more people in the community. The library's knowledge can satisfy all audience at all levels. Many East Asia Cardano  Communities will be connected to make a stronger and thriving community. It is indicated as a continuation of funded proposal in Fund 8, with links provided , i.e. Blockchain and Cardano Library. \nI believe the information provided is sufficient to audit the progress and success of the proposal. My rating is 5", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4857, "q0": "Well, I think, this proposal is very good and necessary. As we know, blockchain technology is now frequent headlines, and its knowledge is very vast. In fact, more and more people want to have deep understanding especially about decentralized Cardano blockchain. Due to language barrier, it is not easy for Japanese or Vietnamese community to access official source of knowledge that most terms are related to technical and written in English. To solve this problem, the proposer suggests the idea of building a 2-way interaction website called Vcoincheck Library between posters and viewers which is now in Phrase 2 of development (funded Phrase 1). Besides 2 current products Vcoincheck.io and Cardanolibrary.net, Vcoincheck Quizz will be the third component of Vcoincheck Library which is an integrated solution for users. I think, their solution is suitable for the challenge \"Grow East Asia, Grow Cardano\" because this proposal stores blockchain knowledge, enables Japanese and Vietnamese community access to Cardano, Catalyst, blockchain information faster, and  build a stronger and closer Cardano community, at the same time, promote the development of Cardano ecosystem. However, there are some unexpected risks in delivering this project successfully, in which the proposer states it clearly and gives a quite detailed solution for imitigating these risks. For example, to ensure the quality of writers (both proficient in Japanese with basic knowledge of blockchain), they suggest opening 2 training courses to educate their team from non-knowledgeable to knowledgeable people.  In reality, they already trained their first team and they are translating articles with basic knowledge, with provided link for reference. In short, I would like to give them full marks for this part because this proposal solves an urgent need of knowledge and updates about blockchain in general and Cardano blockchain in particular for Japanese, Vietnamese communities in a very detail way. ", "q0r": 5, "q1": "The feasibility of the proposal is very good. For the plan, it is easy to visualize the development process in practice of this proposal. Their plan will last for 4 months in which the proposer is very specific on exactly what would be done for each month, and these activities would be carried out on a weekly basis. For example, for the first month, I know their flow of work from researching to writing, translating to checking and editing process, how many articles would be written for each topic in both Vietnamese and English, how many articles would be translated into Japanese,..I am more convinced of this project as this is an ongoing project (funded), it means they does not start from scratch at this phrase. Regarding the budget, the total required expense is $28,500 which I think, it is a reasonable for the amount of work delivered and the number of people commited to this proposal. I know exactly how much would be paid per article, how much per translation page, correction fee per page, ... Also, the payment of reward for most valuable comment is also explained very detailed, it is 30 dollars for an article, but not more than 3. So, it is easy for us to understand this part. Finally, in terms of the team, I think these members are qualified and experienced to carry out this project well. Through their profile's introduction, they show a lot of confidence: I know their name, position, expertise and last experience with social media Telegram and Linkedin provided which I could find out more about them intimately. In general, with all part above analyzed in a very clear way, I believe in the implementing of this proposal. ", "q1r": 5, "q2": "It is fully auditable project. The proposer gives a very specific plan on what will be done weekly, knowing exactly how many articles that must be written in Vietnamese/English and translated into Japanese after each month period, so I think it is very possible for us to audit the process. Also, the best way to measure the success of the project is by the number of posts, the number of active users in real time, how quick questions are answered,..In addition, community could follow their 2 current official websites to update their achievements, and leave comments on the posts in which they could be rewarded for most valuable feedback. In short, I'm absolutely sure that the team could safely monitor the tasks and it is very simple for community to audit the project development. ", "q2r": 5, "assessor": "z_assessor_2622", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5226, "q0": "Japan is a major Cardano market with the largest number of crypto holders. Therefore, to access this market, it is necessary to know Japanese, and most documents need to be used in Japanese, because English is not popular in Japan. Therefore, if you want to disseminate the knowledge and project information of Cardano, you must have a library to translate from other languages ​​into Japanese.\n\nThe solution that the project team came up with was to create a library with a lot of articles (about Cardano, Catalyst, and Blockchain) translated into Japanese that the community could contribute to building.\n\nThe special part of this proposal, according to me, is located in the \"Vcoincheck quizz\" section that helps readers check their reading knowledge. In my opinion, this is a rather unique solution compared to other knowledge sites because they only focus on providing information without a tool to help readers check if the information they received has been received or understood correctly.\n\nThe right knowledge will lead to the right investment decisions and this is also relevant for the community of investors who hold the ADA token. So your proposal will make a lot of sense and create a lot of value for the community, especially the Cardano community in East Asia.", "q0r": 5, "q1": "The team provided a detailed action plan in 04 months with quite specific contents of work to be completed (including 03 main parts: summary, translation, and post in website). And each category is tied to a specific outcome index - the number of articles translated in each period.\n\nThe budget for the project you propose is $28500 with a total of 100 translated articles (and 200 articles posted on 02 websites). The costs in the implementation process are also detailed by you with specific prices to help voters can easily evaluate. In my opinion, the budget is reasonable.\n\nRegarding the experience of the project team, I am quite impressed with the quantity (14 members) as well as the quality, especially the translation team with up to 8 members. Therefore, I believe that the project will complete what has been committed to the community.", "q1r": 5, "q2": "The main indicator that is used in the proposal is the number of translated articles is 100 articles and posted on 2 websites of the group with different formats and is counted as 200 valuable articles for readers. I agree with the above indicator.\n\nIn addition, I suggest that the team add additional indicators to measure the quality of the article such as how much time it takes users to read it. Besides, it is possible to measure the number of times that the user correctly does “Vcoincheck quizz”. These indicators can help the team know that users are interested in articles and these articles provided knowledge to users. And from there you can improve the quality of published articles.", "q2r": 4, "assessor": "z_assessor_2678", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5944, "q0": "The proposal is clearly focused on the Japanese community's exchange of knowledge based in the East Asian region.  The problem is clearly defined by the speed of updated information very quickly in the Cardano ecosystem after having smart contracts. It also nailed down the one-way interaction of most of the knowledge-providing platforms. The content is also well-edited with more concise and knowledge compression to fit more user-centric reading behaviors. The solution is an update of Libraries version 1.0. What makes the proposal more interesting is the quiz session to promote more and more two ways of interaction from the community. The proposal is an extensional feature based on the ecosystem of VCoincheck.io, this would be really encouraging for language adaptation to grow the community, especially in the Japanese community. The quiz proposal is a separate proposal that is also in this fund. The risk is well-mentioned mostly the team is transparent about the language barrier, and the team calls out the solution of having more members from the other East Asian country, especially in Japan. The risk also highlights the lead into a more decentralized platform with post-interaction feature as an extension.\nWhat could be greater is the risk of what if the other quiz project https://cardano.ideascale.com/c/idea/417364 \nwas not funded; then what is the plan B scenario. As this is what really makes this proposal different. ", "q0r": 5, "q1": "The team is showing capability in a rich history of blockchain knowledge and community management. The team also has a team of Japanese translators and has a great relationship with the Japanese community which makes this more likely. A NATIVE Japanese team is such a great addition to this proposal's feasibility. This was already well-mentioned in the risk and the team also planned to have the translational course/blockchain knowledge for the core team members and the translation teams. \nThe budget is 11% of the total challenge is reasonable for the whole challenge setting, which is justifiable for such an extensive knowledge research-based proposal.  The budget was mostly allocated for the main tasks from original language/translation/editing and other additional features (quiz) It is suggested that the budget should be broken further into project timing within four months of the propsal milestones. These would make the budget release more reliable and transparent for the Catalyst budget allocation and proof of life in the following months. A slippage fee was also carefully added to avoid the price of ADA after receiving funds.\nWhat makes this proposal really stand out is the well-detailed milestones laid out, albeit of 4-month project management. The number of articles was broken down very carefully by each month with the original content and translational and editing timing. The interactions feature was also mentioned for new user registration and commenting and posting on the website. This makes the proposal very closely monitored and delivered to the community.", "q1r": 5, "q2": "The impact can be audited easily on the websites (Vcoincheck.io  and/or Cardanolibrary.net) provided by the team in which the PA already visited and see the frequent updated progress since the Fund 7 and Fund 8. The detail KPI/OKRs are well planned for detail month and also weekly actionable plan. What coud be improved is a summary board of what is the newly updated content so that both audiences can stay updated  with the trending updates and the VOTERs/DRep or vPA can also see the summary of status instead of the need to find it at a seperate links.  And there is a slight confusion on what is the primary website/source for this proposal.\nThe success pictures are more on a number of content uploaed almost 200 knowledge articles, more diverse function that can serve more people in community. There should be more quantifiable in terms of users interaction and community expanding OKR/KPIs in order to make it  more stretching and trackable instead of just a vague target. A suggestion for the PA, there should be a video demo of the new feature Quiz/Comment feature for as the guidance for new users of the community. There should also be a proactively newsletter weekly update to the users to maintain the current user base which is also extremtly important.", "q2r": 5, "assessor": "z_assessor_2759", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6020, "q0": "The idea here is quite creative, proposal to bring a completely different product from what I have known before. The basic idea is to build a library of knowledge that caters to all audiences. The creativity here is shown that in order to help readers to remember for a long time, the article is good enough and attractive by 2-way interaction with the reader. This means that readers will be able to interact with the author of the article about issues not understood through quick test questions or through questions in the comments sent to the author. At the same time, adding a \"dictionary\" feature for the convenience of readers if there are any terms that they do not understand. I think the benefits that this proposal brings are enormous for the development of the Cardano ecosystem. Firstly, the Cardano community will increase awareness of the technological aspects and technical solutions that Cardano is building. Second, it is an extremely valuable store of knowledge to pass on to the next generations. That is why I strongly support this idea.", "q0r": 5, "q1": "A few aspects that I rate are quite positive when it comes to project viability. They include:\n-budget breakdown: the proposer has listed in quite detail how the budget will be used to pay for what works. The specific costs are how many dollars, the corresponding number of working hours for each expense. I really have no objection to this part.\n- Project members: I think that introducing each member's experience like that including who they are, related experience, what role in the project is enough to help us have more confidence about their ability to do the job. A special feature of the members is that they have successfully implemented projects together in previous funding rounds (Fund7 and Fund8). Therefore, I am confident that they will continue to perform well in this funding round.\n- The proponent visualized the workflows to perform for this project. Each timeline is clearly divided corresponding to each different work performed. This reinforces the confidence that the proposed team can fully implement the proposed plans.", "q1r": 5, "q2": "In terms of auditilbility, I think it's pretty safe to be able to check the criteria the proponent gives us here. First of all, for library articles, it's easy for us to do. visit the attached website to keep track of all the posts they publish for that month. Secondly, the content translated into other languages ​​like English, and Japanese can be easily tracked through notifications, through the built-in language switch button on the website, but it would be interesting if we could add an index to measure the level of \"understanding\" of readers through the scores they perform and displayed at the end of each article, I think it will help a lot to re-check the quality of the article to take appropriate measures to increase the quality of the article.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 8869, "q0": "As most the details regarding cardano project are in english, it is hard for non english speaking people to understand the accurately ,so this project helps in such scenario where people can understand the catalyst project without having any doubts, where it will be easy for communication among the people and also helps them to clarify doubts among them, hence bringing up articles after making proper research on blockchain in Japanese is a big boost for cardano, hence the proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The team consist of experienced people where they have worked already in fund 8 proposal, as research and translation for such team wont be much difficult task to achieve.\nWhen the team brings up data to online and provide users to edit , then there could be chances of some people where they might provide wrong ideas, this might sometime affect the quality of the project , the team has failed to explain what will be precautions taken to tackle this issue hence with given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 4, "q2": "The proposer has properly introduced his team and their relevant experience in each field , the proposal has already proven experienced people, where catalyst team can rely on.\nThe proposal contains proper timeline of the project and they have set proper goals as number articles that will be published each month. The proposal even has detailed budget breaking in the audit so with the task not much difficult the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 10826, "q0": "This is an extension of our fund's proposal in Fund 8 (Blockchain and Cardano Library). The project's importance to the Cardano community in Japan and the development of Cardano was well presented. Phase 2 will focus on solving some new challenges of the project. First, ensure the science of writing by having a clear process to check the quality of the article. Next is to provide shorter articles suitable for the reader who doesn't have too much spare time to read. Finally, improve the two-way interaction and create Vcoincheck Quizz to help reader can remember or in-depth understand what they read. The author really knows what he needs to do to make the project successful, even though the risks have been resolved. ", "q0r": 5, "q1": "This is a proposal with a lot of participants with many years of experience operating in the Cardano ecosystem. Vcoincheck.io is a big team, we have 5 fund proposals in funds 7 and 8. I have full confidence in what this team can do with this proposal. They gave a very detailed roadmap: Implementation plan for 4 months, work content per week, and target number of articles/articles per month. Another commendable point to mention is the project budget, which I think is reasonable and detailed. Example: Translation correction fee 4900 USD (Japanese) (Number of correction pages to edit 700 articles and Translation unit price 7 USD/page). ", "q1r": 5, "q2": "Based on the detailed plan presented in the previous section, we can completely measure the project's progress. Targeting each month with specific numbers makes the audit easier. Vcoincheck.io (website) or Cardanolibrary.net. are two websites that help the Cardano community to track project progress. ", "q2r": 5, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11069, "q0": "Cardano knowledge and news is mostly in English, hard to reach the Japanese community, affecting Cardano expansion…. Your proposal is to build Vcoincheck Library (Phase 2) to create a highly reliable blockchain knowledge and information store, which is a tool to help break down the English language barrier, help community the Japanese community access Cardano and Catalyst faster, promoting development; The library is also a place for knowledge exchange between the Japanese Community and the Vietnamese Community, developing the Cardano Community to become stronger and closer. I find this a very good proposal to develop the Japanese community on the Cardano ecosystem. The proposal introduced two main possible risks: the accuracy of the information in the articles posted by users to the site and the competence of the team involved. I see you've got the right solutions to tackle the underlying risk.", "q0r": 5, "q1": "I find your solutions very clear, focused on solving the problems posed by the challenge. Especially to improve the quality of knowledge, you have used 2 websites Vcoincheck.io and Cardanolibrary.net in which, Cardanolibrary.net is a website for the team to write, edit and collect comments from the community. people with good knowledge of blockchain. After the editing is complete, the articles will be officially published on the Vcoincheck.io website - these are articles that have been edited many times to ensure that when they come to readers, they must be really good articles. quantity. In your solution, there are three new breakthroughs to improve the service quality of the library: firstly, your knowledge of Cardano and blockchain is huge, so I think you guys are very creative. when creating a new section in the library: \"Cryptocurrency Dictionary\". In my opinion, this dictionary can be compiled in an open way so that you can mobilize the comments of a large number of developers and customers to participate in making the vocabulary richer but still ensuring accuracy. ; Second, you can write articles at the request of the community; 3rd created Vcoincheck quizz is a type of quick quiz that allows the community to test their knowledge anytime, anywhere without spending time learning from scratch. In my opinion, you can set voting criteria to reward the person with the best test results to attract more and more readers to the library. You have developed a very specific plan, a detailed analysis of the project's budget, I find all the information very specific, clear and appropriate in the construction of spending norms. The project participants have a very clear background, comprehensive capacity, rich experience, I trust you very much.", "q1r": 5, "q2": "You have provided quite enough information to measure the progress of the project, I find all issues very reasonable and transparent. The success of the project is described very specifically. This is an extension of our sponsored proposal in Foundation 8, I see the Vcoincheck library will have more knowledge articles, more diverse functions serving more people in the community. The library's knowledge can satisfy all audiences at all levels. Not only that, this is also an open library for all subjects to contribute and share their knowledge, but I want to know to come to the library you need to clarify the rights and responsibilities of readers. so that everyone has the right choice according to their ability. I fully support the project. Good luck", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11291, "q0": "This is a great project that is very useful for the Vietnamese community and the Japanese community. Currently, knowledge and news about Cardano and Catalyst only stop at the introduction of basic knowledge, most of which is in English, so it is difficult to spread widely. Knowledge-sharing sites are only one-way interactive and there is not yet a good interaction between content posters and post viewers. This proposal aims to implement phase 2 of the Vcoincheck knowledge library, to help Cardano enthusiasts save time synthesizing knowledge, and at the same time create a place for knowledge exchange between the Japanese Community and the Community. Vietnamese. Their solution is to increase to 100 articles published at 2 websites Vcoincheck.io and Cardanolibrary.net, Create a new section \"Cryptocurrency Dictionary\", increase the 2-way interoperability of the library and create products. new is Vcoincheck Quizz. This project is suitable for the challenge, of helping Japanese people understand Cardano from basic to advanced. I completely agree with the challenges that the proposal poses. They came up with detailed and logical solutions to those challenges.\n", "q0r": 5, "q1": "This project has a very clear roadmap. The implementation plan of this proposal is 4 months, information search and translation work will be carried out weekly. The evaluation indicators and goals of the group are also clearly quantified on a monthly basis. This shows that the proposed team works very scientifically and has a good preparation for the idea, I believe this project is very feasible. Budgets are clearly allocated for each work item. Funds are mainly to pay for translation, editing articles, and upgrading website functionality. I find the total Team Budget required to be: $28500 to be reasonable. I appreciate the team members. The team is experienced and in-depth knowledge of Blockchain technology, the team is fluent in Japanese. Information about each member is public and transparent. With the above factors, I find the project to be completely feasible, able to scale up and do more for the community in the future.\n", "q1r": 5, "q2": "The project has clear committed indicators and goals for each month. The team knows what needs to be done for the project to succeed. They know what a successful project will look like, giving members the confidence to dedicate themselves to the project in the long run. Indicators can be easily tracked on Vcoincheck.io (website) or Cardanolibrary.net. The group clearly stated the roadmap and the time to achieve the results by month. If the project is successful, there will be 200 knowledge articles, and more diverse functions serving the community, Vcoincheck library is a place to contribute and share knowledge to help bring together the East Asian Cardano community.\n", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11451, "q0": "As we know, most Cardano and blockchain knowledge is in English which is difficult for Japanese community to understand, as a result, affecting the expansion of Cardano. Therefore, the proposer has the idea of creating a blockchain knowledge database, namely Vcoincheck Library, including Vcoincheck.io (website), Cardanolibrary.net, and Vcoincheck Quizz. This platform  aims for Japanese, Vietnamese readers, and other communities, mainly about decentralized Cardano blockchain, to access to reliable knowledge and information on a daily basis. In my opinion, this is a very practical idea. These articles are from basic knowledge to technical terms which could meet a variety of users'need. As a result, this project promotes the development of Cardano ecosystem which is suitable for the challenge. After all, I fully support their idea. ", "q0r": 5, "q1": "As far as I'm concerned, the team members are very talented and experienced which is qualified to execute this project well with Telegram and Linkedin link for more information. Moreover, the proposer made a very detailed plan for the next 4 month (Phrase 2). I know exactly what jobs need to be done each month with clear target on the number of articles written and translated into their favourable languages, leaving nothing to complain. In addition, the expenses are clearly shown and calculated which I think very reasonable. A good point is that from Phrase 2 community could get reward for good comments on articles. I hope this proposal get funded again on this round and get more community support. ", "q1r": 5, "q2": "It is possible for the team and community to manage and track the development of this proposal. Based on their targeted goals for each month, the proposer could manage how effective the team are doing the websites Vcoincheck.io and Cardanolibrary.net as those use same database sources. Community could base on some key metrics such as the number of articles completed, posted on websites, the number of readers active on their website, the number of articles translated into Japaneses,...In short, it is an auditable project. ", "q2r": 5, "assessor": "z_assessor_3246", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12673, "q0": "he problem to be solved here is that Cardano and blockchain knowledge is vast. Cardano knowledge and news is mostly in English, which makes it hard to reach the Japanese community, affecting Cardano's expansion. The proposal clearly shows how it adds value to the cardano ecosystem by adding more knowledge articles to the library in phase 2. User community can comment and participate build library content. A new number will be created to make the content of the library more diverse. The solution given by the proponent is as follows: Increase the number of knowledge articles to 100 where it will be 60% of the Cardano knowledge. Post knowledge articles at 2 websites Vcoincheck.io and Cardanolibrary.net. Continue studying the list of knowledge articles suitable for all audiences.Create a new section in the library: \"Cryptocurrency dictionary\". Write articles on demand. research and create another new product for Vcoincheck library, that is Vcoincheck Quizz. This proposal creates a highly reliable blockchain knowledge and information store, is a tool to help break down the English language barrier, help the Japanese community access Cardano and Catalyst faster, and promote evolution. Japanese community, CA community, vCA, Japanese proposal. At the same time, it is creating a place for knowledge exchange between the Japanese Community and the Vietnamese Community, developing a stronger and stronger Cardano Community. In addition, To encourage and encourage the spirit of user contribution in the community, it is expected that there will be rewards (gifts or cash) for users with good opinions, a sense of well built. therefore I firmly believe that this proposal is fully scalable to address future challenges well.", "q0r": 5, "q1": "the proponent has provided clear, detailed evidence with attachments about the role, duties, relevant skills and experience required to implement each member's proposal. The proponent determines specifically the type and number of members in each necessary group, including the leading team, the core team, and the expert team (Japanese content team). The proponent provided a reasonable budget that was clearly outlined and broken down into definable and easily verifiable items. Specifically, the proponent requests a Total Budget: of 28500 USD which is broken down into items such as a Writing fee of 4500 USD (Vietnamese), an English translation fee of 2000 USD, a Community Incentive fee of 3000 USD, and a Fee translation of 9100 USD (From Vietnamese to Japanese), Translation correction fee 4900 USD (Japanese), Proposed Administration Fee: 2000 USD, Website Functionality Upgrade (Quizz): 1000 USD, The proponent has applied for additional reserve funds to prevent ADA slippage: $2000 (7% of the proposed budget) I think the provisional budget of 7% of the project's budget is reasonable and suitable. fit The proposal outlines a realistic timetable with a specific, detailed plan to implement the project in 4 months and breaks down the work for each week, and has specific goals for each month. The proponent also considered the risks that prevent the successful implementation of the project and also provided specific measures to address that risks. With this proposal, I rate  5* and I strongly agree that this proposal will be successfully implemented.", "q1r": 5, "q2": "The proponent has given a 4-month implementation roadmap with specific milestones to be achieved, clearly stated with specific, detailed goals for each month, looking at the progress can be checked project set. Indicators that determine the success of the project are tracked at the source of the database: Vcoincheck.io (website) or Cardanolibrary.net. When this project is successful The users in the community have more income from rewards for their good ideas, and good construction sense. This proposal will create a connection between the East Asian community. The proponent clearly described the problem Knowledge and news about Cardano are mostly in English, difficult to reach the Japanese community, affecting the expansion of Cardano...Knowledge of Cardano and blockchain is very large, and the proponent has also given specific, clear, and understandable solutions to solve the given problem. This proposal is sponsored as a \"Cardano and blockchain library\" proponent in fund 8, which is a plus in terms of the team's credibility. I fully agree that this proposal provides me with sufficient information to gauge the successful progress of the project.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12851, "q0": "This proposal aims to add more knowledge articles to “Cardano and blockchain library” through 2 websites Vcoincheck.io and Cardanobirary.net (these websites have been built based on one approved proposal in Fun8 called “Cardano and blockchain library”). The articles are written in 3 languages ​​English, Vietnamese and Japanese with the aim of reaching Japanese and Vietnamese communities -2 very large and potential communities in Asia.\nI strongly agree that this proposal effectively addresses the challenge because of the following reasons. \nFirstly, Japan has a population of more than 120 million people (ranked 11th in the world), Japan also has a lot of young enterprises who want access to blockchain and Cardano projects, besides Japan has a large number of ADA holders. Vietnam has a population of 99 million people (ranked 13th in the world). Vietnam has a young population and an increasing number of young people who are tech-savvy and want to participate in the cryptocurrency market. Therefore, meeting information needs about Blockchain and Cardano to these two markets will have a great impact on the expansion of the Cardano community in East Asia in general and in the world in particular.\nSecondly, the solution in this Phase 2 has many new points to increase the 2-way interoperability of the library, for example, users can suggest article topics and users can give reviews and comments on the article.  Users can post their own articles and receive rewards if the article is of high quality. Besides, there is a quiz section for users to challenge and self-assess their knowledge level... These new features will create more interactions with the community, creating a more connected, interactive community.\nThe proposal`s plan for each month is: Searching and inquiring about library content (week 1 - week 2); Writing articles summarizing knowledge (week 2 – week 4); Translate into Japanese (week 1 - week 4); Check and editing (from week 4~). The target for each month: 30 article posts on the library in Japanese, Vietnamese, and English.  As far as I understand the final step of checking and editing will be done in the 3rd and 4th week of the month and article posting will be done mainly in the last week of the month. This will affect the interactivity of the website. Because for a website, having new posts every day will attract more interaction. Therefore, I recommend that the proposer consider scheduling posting times to ensure that new articles are posted every day. Because of the above analysis, I rate the proposal 5 points in the Impact category.", "q0r": 5, "q1": "I strongly agree that it is highly likely that this proposal will be implemented successfully because of the following reasons:\nFirst, the project team has 15 people divided into 2 teams: The core team and the Specialist team. The core team consists of 7 members who have deep knowledge of Cryptocurrency investment, blockchain technology, and blockchain projects. The specialist team is the Japanese content team consists of 8 members, most of them are fluent in Vietnamese and Japanese and have experience as translators and interpreters. Besides, the team includes Japanese members and members who have knowledge of Cardano and Blockchain. I have checked the team members' profiles on Linkedin, Facebook links, and Japanese certificates, and I noticed that the team has the right knowledge and experience to implement the proposal.\nSecond, The proposal is planned to be implemented in 4 months with the goal of publishing 100 articles in 3 languages ​​English, Vietnamese and Japanese. The plan is broken down for each month, 30 posts per month. Each month, there is a detailed work item plan by week. The plan is very specific and clear. On the other hand, the team has experience in implementing a similar plan in Phase 1, so I think the plan will be implemented successfully.\nThird, The total cost of the proposal is 28500 USD, including the Article writing fee (45USD/article), English Translating fee (20USD/ article), Japanese Translating fee (13 USD/page), Website admin fee (2000USD), Website function upgrade (Quizz): 1000 USD…Most of them ae is clear and reasonable.\nHowever, in the Japanese translation section, they propose a Japanese Translation correction fee of 7 USD/page, while in the English translation section, there is no Translation correction fee. I think the author should give a reason why this section is needed.\nBecause of the above analysis, I rate the project 5 points in the Feasibility category.\n", "q1r": 5, "q2": "The proposed workflow is clearly divided by week, and the results are summarized by month. The target is  30 article posts per month in 3 languages ​​English, Japanese and Vietnamese, consist 10 on the topic of Cardano, 10 on the topic of Catalyst, and 10 on the topic of Blockchain. The articles will be posted on Vcoincheck.io and Cardanolibrary.net websites. Roadmaps with milestones and timelines are clearly laid out. I think people can easily track the progress of the project till the end.\nAlthough the project team has depth knowledge of Cardano, Catalyst, and Blockchain as well as experience in translation, which guarantees the quality of the articles, however, I think the author should consider adding more indicators to evaluate the quality of the article objectively, such as the minimum number of words per article, number of article views, number of good reviews on the article .v.v.\nWith the above analysis, I rate the project 5 points in the category of Auditability. I hope that if the project is funded, my contributions will be considered and implemented.\n", "q2r": 5, "assessor": "z_assessor_3494", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13774, "q0": "The proposal is a project that received funding in the previous period. They talk about adding more knowledge articles to their library, allowing users to contribute to the library, and making library content more diverse. making the content in their library more practical for the reader is a good option for them. It's very clever that readers will quiz on their understanding. This project, which they have done to disseminate information about Cardano, dazzles with its development for users' comments. They will catch a different perspective on supply and demand.In order to enable the Japanese community access Cardano and Catalyst more quickly, reduce the language barrier, and foster development, this proposal creates a location to keep blockchain knowledge and information in a highly reliable manner.Additionally, the website includes a platform for evaluating the quality of cryptocurrency projects. Users can assess and research the necessary pertinent information without consulting other sources.They have a feature that suggests posts that could be improved. Users who have good comments, are kind and helpful to others, and are endorsed by many users will be rewarded and encouraged. In the knowledgeable Fund 8 they funded a proposal to open 2 training courses to train people without knowledge to become people of knowledge. Currently, they are training the first team and they are translating the basic knowledge articles in the library\n\n", "q0r": 5, "q1": "Plan has 4 steps divided into months. It outlines the steps that will be taken and the budget for each step. They explained the budget in detail. I didn't see an error. A team that likes to progress step by step, safely.\nThe team consists of very successful individuals. It has a large staff. Everyone has put their hand under the stone for this job.\nIt's clear that their offerings will expand and they're struggling to get decent audiences.", "q1r": 5, "q2": "The target roadmap has been determined by the team. The plan provides details for all phases.I think it's all about auditable projects. Fund 8 has a high probability of developing the project because they know that they will make good use of the investment they have received and get a good return. I believe that the team with this amazing spirit, will make it well! Great work!", "q2r": 5, "assessor": "z_assessor_3793", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14013, "q0": "In this day and age, we cannot deny the popularity of blockchain and its attraction. However, to understand blockchain, it takes a lot of time and effort in researching and memorizing the knowledge related to blockchain. Since the knowledge may be written in English and that is a hard barrier for those who are non-native English speaking. Thus, some users may feel less motivated and their interest in the blockchain would also be reduced. This proposal offers a quite convenient and highly effective solution for this obstacle. The team proposer has explained the possible risks and challenges in their plan and recommended detailed solutions that I think are fruitful a lot. I am quite satisfied with the way they presented the idea and then explain it chronologically. Definitely, this proposal impact would not only on the users’ knowledge but also Cardano’s growth. The more knowledge of blockchain is simplified and delivered, the more attractive Cardano inhabitant is.", "q0r": 5, "q1": "Some aspects that raised my expectation for this proposal’s possibility that can be mentioned here are budget, members as well as the visualization provided by the proposer. Firstly, the budgeted plan is written in detail and explains which costs would be calculated by which formulae and the costs’ role on the sheet. That means we can easily catch how our money is spent. I think $28500 is a reasonable and acceptable amount. On the other hand, with the proposal’s members, I think through the provided information about them like who they are, how long they have worked with this/that field, we can know clearly who we are financing for, and do they reserve our fund. By the way, I am impressed by the experience of Mr. Sang Nguyen. His knowledge is not only about cryptocurrency but also his experience on the stock exchange, as well as the forex. It is such a diversity of knowledge resources. Thus, in this round, I am confident about how tremendously they perform.", "q1r": 5, "q2": "In terms of auditability, the KPIs are written in specific for each month in which there is the targeted number of summary of articles and number of the translated document into Japanese. I think quite easy for people in the community to keep an eye on the progress and then make an evaluation or complain about the achievement of the proposal. The translated content into other languages such as English and Japanese can be easily tracked on the website. By the way, it's easy for us to visit the attached website to keep track of all the posts they published that month. On the other hand, the keyword “success” is defined as quite a fascinating viewpoint and illustrates the expectation of the team on this time participation. I am curious about how the audience will rate the quality of the translated document. Therefore, I suggest the team consider whether to provide or not a statistical report about the effectiveness of the proposal by showing the audience’s ratings. This is optional so that the team could supplement or not that is up to the team’s decision. ", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "We will add more knowledge articles into library in phase 2\nCommunity user can comment and participate in building library content.\nSome new will be create to make content of library more diverse", "experience": "Our team Vcoincheck.io team, We are funded proposer of \"Cardano and blockchain library\" proposal in fund 8"}