{"id": 417653, "author": "cerpofficial", "title": "Cardano ERP - Grow Asia", "url": "https://cardano.ideascale.com/a/dtd/417653-48088", "category": 26602, "amount": 47400, "description": "Cardano needs more developers from Asia participating in Emurgo Academy training and developing enterprise-grade products on the Cardano blockchain.", "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 4373, "q0": "I realize that this proposal can contribute to the development of the goal in the Challenge, which is to develop East Asia, to develop Cardano. Specifically, creating more developers from Asia (taking an Emurgo academy course and developing enterprise-grade products on the Cardano blockchain). The team has determined that the problem to be solved here is to focus on developing high-quality human resources from Asia, where there is a lot of human potentials. Participating in Emurgo academy courses will indirectly contribute to adding value to the Cardano ecosystem. I think that after this course, there will be a certain human resource in Asia that can meet the requirements of product development businesses with the Cardano blockchain platform. However, in my personal opinion, what is the product of the business developed on the Cardano blockchain platform? Based on that, the community will have a more accurate assessment of the impact. However, I still believe that if this proposal is successfully applied, it can scale up and solve future challenges (which require a lot of time). Because human resources are always the most important factor of all times and countries. With the development based on the Cardano blockchain, I think it will create high-quality products just like the Cardano blockchain has always been one of the best blockchains in the world today. The interesting thing here is: that Enterprise products are built directly on the Cardano blockchain - this is the first time I have seen such a fresh idea proposal. I agree with the enormous impact of this proposal. I vote 4 stars.", "q0r": 4, "q1": "I tried to look in the documentation the team attached, specifically the website: cerp.dev, but couldn't find any clear identities of any of the members. Contact information such as email, social networks, and personal profiles are hidden. We all know that currently with proposals where the team is still hiding information, it is very difficult to implement in reality because the community sees it as not a good proposal/project. Those cover-ups and lack of transparency cause serious damage to the reputation of the team in the community. I sincerely advise the team to add all records related to the personal information of all members to regain the reputation of the community and confirm the feasibility of the proposal (I don't see it at the moment) suggested to state the number of members and the identity of the members - even when searching the web).\nThe detailed budget table provided by the team is quite sketchy, only stating the training course cost and required training time without further analysis so that the community can grasp the details from which to evaluate the effectiveness of the training. feasibility of the proposal. In my opinion, the team should carefully analyze the budget, the budget must be divided into sections and be reasonable with the goal and there must be a specific explanation of the amount of money used for each given job. No one can deny the importance of publicizing the budget and detailing the funds required to demonstrate the feasibility of the proposal. I see that the team hasn't done this yet.\nThe plan and how to implement it are not clearly stated. I am continuing to search for the implementation team's plan to implement the proposal but can't find it. So my third piece of advice for the team is to quickly complete the plan and implement the full implementation method in the proposal for the community to know. Because a very good thesis cannot lack a specific plan and the implementation method that goes along with that plan.\nThe proposal also failed to demonstrate the resources needed to implement it, it was the result of a very sketchy, pointless presentation. My fourth piece of advice is to quickly add the resources you need to make it happen. Specifically here are human resources (financial resources still need approval and funding from Catalyst). The team must prove its ability through existing personnel to confirm its feasibility. If it has not been funded by Catalyst, does the team intend to continue this proposal?\nThe technical aspect is also not clearly stated, it is sketchy and vague like an unfinished proposal. In my opinion, the team should review all the items mentioned and add to the explanation the technical aspects of the technology along with the language used to make the proposal and put it into practice.\nThe team also does not pose any risks if it receives funding from Catalyst. I advise the team to think more to find the risk. The fact is that there are risks, I would like to give a single risk as an example, which is the devaluation of the Ada, then we have to study more carefully to ask for an appropriate amount if the Ada has slippage in the market. Or if additional funding is needed, the team must come up with a plan that is verifiable by the community.\nHaving analyzed the above aspects, I strongly disagree about the feasibility of the proposal. I have given positive advice for the team to refer to, which is considered a basis for improving the proposal if it is to be accepted by the community.", "q1r": 1, "q2": "The team has outlined essential steps to complete the proposal within 6 weeks, however, I have not seen the so-called roadmap. In my opinion, the team should attach the tasks that need to be done with the specific time of the months of the year to make a roadmap according to the specific time of the proposal. From there, the community can easily assess the progress of the work and it is also a way to confirm the transparency and auditability of the proposal. The team has outlined four essential elements in the KPI, but there are no key metrics, which is a pity. Because if there are more key metrics, it will be much better for auditing. The definition of project success is simple as the team considers that all 6 developers have completed the training course of Emurgo academy. This is one of the simplest definitions of success I've read as a PA. Throughout the proposal, a problem was described but it was not completely clear and in some places, there was still a lack of a reasonable solution to the problem. I both agree and disagree about the auditability of the proposal. I vote 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5669, "q0": "The proposer provides a problem statement that captures an existing problem which when solve could lead to value addition to the Cardano ecosystem. However, the proposer failed to provide a detailed description of the solution to the problem. A more thorough information on the approach to address the problem could help the community appreciate the overall project better. I suggest the proposer redesign the project to capture the appropriate details on the solution to the problem. Therefore the project doesn’t address the challenge.", "q0r": 2, "q1": "The information on the feasibility is insufficient . With the exception of the detailed budget breakdown that specifies amount allocation for each item, the proposer failed to provide a detailed information on the roadmap for project implementation. Aside that the project also failed to indicate the team members with their experience and expertise. I prefer the proposer refine the proposal to reflect all the questions raised here. Therefore it’s likely this project would not be implemented.\n", "q1r": 2, "q2": "The information provided is not sufficient to audit the project. The project has no specific milestone and KPIS that enable us determine the progress and success of the project. Additionally, there is no indication that suggest the willingness of the team to communicate the progress report to the catalyst community. I  wish the team restructure the project to include all the appropriate details.", "q2r": 1, "assessor": "z_assessor_2734", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5827, "q0": "Cardano is a growing blockchain and there is the need to have a number of developers who through their skills and creativity will help build the blockchain and make it better to compete in the world of growing technologies. \nThis proposal seeks to onboard developers by training experienced developers to work on the Cardano open source enterprise resource planning software. The impact will be the developers gaining valuable knowledge in Cardano and the on boarding of these developers on the Cardano ecosystem to participate actively. This proposal addresses the challenge effectively. ", "q0r": 5, "q1": "The proposers have have presented a  plan with milestones and timelines which span within 6 weeks. They also give details of team members, their skills and experience relevant for completing this project successfully and links are also provided as evidence. They also provide a link to the CVs of developers to be trained and onboarded and that is a good step. It gives the community and idea of what they are found for in funding their project. The proposal includes resources to be used for the training that is the Emurgo Academy Solutions Architect training course. The fund requested is within reasonable limits and a budget has also been provided although I find the budget not so detailed. \nThe proposers do indicate they will not return for any funding because of funded this round, the goal of training and in boarding the 6 developers will be achieved. \nThe proposer have already started the process by identifying the participants and the material to use. With all these put together I think the project can be implemented successfully. ", "q1r": 4, "q2": "The proposers indicate the milestones of this project with timelines which means progress reports can be revived from the team within these timelines. The proposers also indicate in simple terms what success looks like, that is training of the 6 developers they have already identified. The budget is also clear and simple for accountability. ", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6280, "q0": "The proposal aims at training six developers from Asia to participate in Emurgo Academy training. The challenge focuses on Asia and for that reason only, this proposal fits the challenge because the selected developers are from Asia. The proposal however is silent on the real impact it holds or how it adds value to the Cardano eco system aside the fact that the developers will begin working on the open-source Cardano ERP project after their training. Proposers could add some more information on the tangible benefits the project can bring to the Cardano ecosystem.", "q0r": 3, "q1": "The proposal is a straightforward one and given the fact that the Emurgo Academy will be handling the training, the feasibility aspect is quite assured. The only key tasks to be done are selecting the participants of the training, which has already been completed, and enrolling them into the Academy. It would be interesting however to have some more information on the last task which is \"Developer practice projects or participation in architecting Cardano ERP and/or developing MVP\". This will help in clarifying what exactly it entails and perhaps enhance the assessment of the feasibility of the project. \n\nWith respect to the team, a website is provided which has links to the profiles of the team. The team however play a dual role as both the project team and participants of the training. The budget is succint and clear, and a timeframe of six weeks is provided to complete the course.", "q1r": 4, "q2": "The proposal does not provide much information to enable the community to audit it. Beside the completion of the 6 week course, no milestones have been provided, no indicators or metrics are provided to facilitate auditability. Proposers only mention that they will \"measure the number of experienced developers from Asia who successfully complete Emurgo Academy courses\". This proposal however covers only 6 developers so it is unclear whether there are other developers the proposers have not mentioned but intend to measure as part of this project. A little clarity on the auditability aspect will be helpful. ", "q2r": 3, "assessor": "z_assessor_2803", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6388, "q0": "Although the Problem-Statement and mission and solution seem quite straightforward and simple, the Proposal itself is quite lean and short. Functionally, basically, at its core, the project is a sponsored scholarship for 6 (or 5, based on provided CVs) already-chosen experienced developers to take the 200-hour Emurgo Academy Solutions Architect training course and pay them $30 hourly for their time studying. \n\nIt does seem that the project is well on it's way, having already selected the 6 (or 5, according to the CVs on https://cerp.dev/team-cvs ) developers to undergo the Emurgo Academy course. Given that each developer is already experienced in the field and merely would need to learn Emurgo specifics, this Proposal has quite high Impact as a way to solve the Challenge goal of onboarding developers from East Asia. \n\nThe only two things that give me pause are 1. whether this has $47,400 worth of utility and Impact, which is left to the voters to decide, and 2. that the Proposal itself is so short and doesn't seem to have had much time spent actually explaining and spelling out more details. ", "q0r": 4, "q1": "Absolutely high Feasibility, on account of that half of the work is already done, by not only having chosen which 6 (5) developers are slated to take the Emurgo course, but even providing their CVs which each are quite impressive and do, very clearly, demonstrate that each of the chosen students are well-suited for onboarding as Cardano developers. ", "q1r": 5, "q2": "This project is very, very straightforward, therefore simply monitoring the progression of the students through the Emurgo Academy course is largely all that is needed to track. Although the Proposal is so simple, I still would have liked to have seen more than 1 brief sentence spelled out for Auditability. If this Proposal were to not pass, my suggestion for redoing it in the future would be to articulate more in-depth some more ways of following each student's progress through the course, who all graduates/finishes, and where auditors could go to check in on this progression. All in all, though, because it is so simplistic, strong Auditability. ", "q2r": 4, "assessor": "z_assessor_2814", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9245, "q0": "The presentation of the issue consists of a brief and clear statement about the shortage of developers in Asia.\n\nBased on this premise, the proposed solution meets, in a way, the problem at hand. It is important to note that part of the delivery the author considers the implementation of an ERP project for Cardano. However, this complement to the proposal loses some of its initial objective.\n\nThe proposal ends up not focusing on the scale development of new developers or on the development of the system itself. Given the reduced number of trained developers, future scale gains are limited, in addition to uncertainty in their commitment to executing the project after training. It would be interesting to see how, in fact, the capacity building effort can have high value for the community.", "q0r": 3, "q1": "In principle, the author will not be responsible for training the developers, the focus of the proposal, so his experience does not directly contribute to the success of the project. Analyzing the author's other proposals for fund 9, it is possible to see that he has extensive experience with ERP systems, which is part of the continuation of this proposal in question.\n\nSince this is a specific proposal to enroll 6 developers in a course, the schedule and budget are very straightforward and were presented clearly.\n\nAn important point that could be better explored is the potential risks. According to the author, no risks are expected. In this case, I would recommend considering at least the risks related to the success of the training process, meeting deadlines, meeting quality requirements and discontinuing developers on the project. The author even states that he does not consider this last risk, but in fact it can only be 100% mitigated if there is a contract for the protection of interests, which was not mentioned.", "q1r": 2, "q2": "The proposal did not consider ways to favor the audit of the project's progress, nor the monitoring by the community. This would be an important improvement for the author to consider.\n\nThe defined indicator concerns the training of the 6 developers, which is fair considering the proposed solution, but very simple considering the dimension of the problem. It would be interesting to see the author indicating metrics that point to the development of the project, generating value for the community.\n\nFinally, the proposal does not have a consistent solution to the problem it is challenging. For this proposal to have real meaning and relevance, it must be analyzed together with the other proposals of the author in the background 9. These proposals alone are partial deliberations.", "q2r": 2, "assessor": "z_assessor_3035", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "The requested funds will be used to cover Emurgo Academy training fees for experienced developers residing within Asia.", "experience": "Please see our website for CVs of developers."}