{"id": 418462, "author": "saonkoliver", "title": "Promoting Cardano in the highland", "url": "https://cardano.ideascale.com/a/dtd/418462-48088", "category": 26602, "amount": 29950, "description": "The highland children do not have the concept of coin investment or blockchain career, bringing this concept to them helps them have ambitions to develop themselves and the community where they live.", "f6_no_assessments": 16, "f6_rating": 4.104166666666667, "videos": [], "media": [], "f6_assessments": [{"id": 5235, "q0": "Highland where the economy is the least developed, the educational conditions are also the most deprived in Vietnam. Therefore, there should be a lot of programs to help people here have access to new knowledge and technologies to reduce the gap between the rich and the poor in this area. Therefore, I strongly support proposals aimed at these highlands.\n\nYour solution is to build a school and a library called “Cardano” and you will write articles to be published on mass media sites to promote this event to help raise brand awareness of Cardano in the Vietnam market.\n\nIn addition, when children here who study at a school called \"Cardano\" read books from a library called \"Cardano\", they will leave a very good impression and later when they grow up, they will be the factors that help promote the growth of the Cardano community.\n\nThis is a very humane proposition and demonstrates the values ​​of balance and sustainable development that the founding team of Blockchain Cardano is pursuing.", "q0r": 5, "q1": "The plan to build a school and library named \"Cardano\" of the proposal is expected to take place within 03 months with the work items to be completed. With the workload for a construction project of about 100m2, I think the plan you have given is reasonable and can be done.\n\nAbout the cost for the project you proposed is $29,950, you have clearly stated each item and the cost attached. This part is presented quite transparently and clearly, so I think the above cost is reasonable.\n\nYour project team has 04 members with a full experience to operate for this project such as education, social organization, and construction company. With the above capabilities, I believe that the team can complete the proposal as committed.", "q1r": 5, "q2": "Your proposal’s recommendations for performance evaluation will depend heavily on the progress of the school and library. And in this section, you have committed to uploading progress images every month to the community. I agree with this measurement and tracking.\n\nIn terms of project success metrics, construction completion is the most important, followed by indicators related to Cardano's brand image known as the sponsor of the project. this program. And the team used indicators such as 03 articles in the mass media, the above index is reasonable for the nature of this proposal.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7417, "q0": "The way the project is set up makes me feel quite warm for the future of the children and families in the highlands because I understand how difficult life is up there. Attending school regularly, literacy is already a difficult problem, most of them have to drop out of school halfway, and their future is unfinished.\nCan the project be more specific about the ages of the children the project is aimed at? And how is the popular method of blockchain for teachers up there? These are two very important things for the project to achieve long-term results and guide the children's thinking.\nIn terms of risks, the project has outlined methods to reduce risks from the weather. However, about the risk of price escalation due to inflation, I recommend increasing it (compared to $1,000) because inflation is escalating very quickly and shows no sign of stopping. The project is aimed at educating and upland the children's community, so it makes sense to give the best support to complete the project. I would like to give a score of 4 in this section\n", "q0r": 4, "q1": "The project offers themes and workflows that fit timelines, and team members specialize in multiple areas, covering the entire project. Regarding detailed funding, the project should reconsider spending on 3 newspapers, 3,000 USD is too big a number compared to the highland life. Instead of spending money on the press without knowing the results, the project should use it to develop communication channels such as Facebook, Tiktok, and Youtube... which are both owned by the project and promoted throughout and long term, just used it as a source to report completion progress to the Catalyst community, and at the same time help guide teachers and students in upland areas to access social networks in a sustainable way.\nIt is a pity if the project does not plan to apply for funding in the next funds. Everything has just begun, to maintain and developing sustainably will be more difficult and require more funding. If it's just a school, a Cardano library is not enough. It is necessary to train teachers in a methodical manner, orienting children to a brighter future. Help them understand that, in the present, we can do any job around the world without being constrained by geographical distance.\nHopefully my suggestions will help the project to be more complete. I'm comfortable giving it a 4\n", "q1r": 4, "q2": "The project indicators outlined are very intuitive and easy to quantify. And as I shared in the previous section, create your own communication channels, it is very easy to report to the community about the development of the project, while also promoting the project. I hope in the future, the community will receive links to the project's social networks. I am really excited to see the success of the project. I'm very happy to give this part a full 5", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8886, "q0": "Most of the Govt fails to provide the basic necessities to people in high land, this also includes education hence the presented idea is excellent idea to build a school for such high land people where this school can last long up to 20+ years ,which also helps these students to educate regarding cardano's development project and students can educate their parents, relatives, friends regarding the importance of such project .hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Building a school is never a easy task  but the presented team has good experience in all the administrative ruling areas such as IT, Stock exchange and charity funding organization, So with the provided experience task can be achieved.\nThe proposer has even developed idea of presenting the cardano projects in newspaper and articles where it can be achieved without much difficulty , since people in high land prefer newspaper instead of modern technology due to lack of connectivity to get the latest updates.", "q1r": 4, "q2": "The audit has provided the details of each team member and their experience and role , the proposal contains proper budget breaking ideas ,as well as proper timeline by when the school will be completed.\nThe project has proper key indicators as how they can boost the idea of spreading catalyst ideas among the high land people.The proposal has failed to explain, what are premeasures that will be taken to maintain the school for more longevity and how to maintain subsequent funding for the school hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9023, "q0": "This proposal would definitely fulfill the goals of the challenge. The proposer is an East Asian teacher, and would be working in combination with East Asians to teach East Asians more about Cardano. Additionally, this proposal would build a school that would have a Cardano sign in front and a Cardano library. The proposers would teach children about blockchain and crypto while sitting under a Cardano sign. This is the kind of impact that we can have that will improve real people’s lives. The proposal’s budget seems so low, but I believe that it will be sufficient based upon the team member’s experience and knowledge of the region. The proposal also takes seriously the risk of building during the rainy season, and plans to avoid this. Long-term positive growth results by building a school and teaching young students about Cardano and blockchain", "q0r": 5, "q1": "This proposal has sufficient detail to give a good idea of the plan for the project. This proposal is not as detailed as some that I have seen, but it is good enough to evaluate. I have little experience building schools in the highlands of Vietnam, so I have to lean upon the experience of the team members. The team seems confident in their capability to follow their schedule, and they have listed they have the experience to enable the successful completion of this proposal. The budget seems very low, but based upon the pictures, I can see that the kind of school they are building is much smaller and cheaper than the ones I am familiar with. I also assume that the cost of building supplies is substantially cheaper than where I am from as well. So, depending upon the cost of building supplies in their location it would seem likely that this budget is sufficient for completing the proposal as listed. ", "q1r": 5, "q2": "This team will post monthly updates and reports regarding the completion of the proposal. I hope they also decide to post progress photos of the school being built uploaded monthly. They have already included several photos of what I believe to be the existing school. The metrics they are reporting on are sufficient to determine the progress of the school. The final metric is three newspaper articles about the completion of the school. Those would give sufficient detail to determine the proposal’s completion. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 9406, "q0": "This is a good project which helps Cardano values access remote areas. According to the proposers, they intend to build a school and a library named Cardano Library for highland children. The highland children do not have the concept of coin investment or blockchain career, bringing this concept to them helps them have ambitions to develop themselves and the community where they live. Clearly, through these activities, people of remote areas could access basic knowledge of blockchain and Cardano, having chances to develop themselves in the better way. This model can be applied in many other places if the first one is successful. The proposal has addressed effectively the challenges and given out comprehensive solutions to gain the target. I evaluate mark 5 for this criteria.", "q0r": 5, "q1": "First of all, the budget for this project is described clearly and logically. The authors in this project has broken down in detail the estimated costs which include fees for Field survey, meeting local authorities and the school; making the document to legalize the construction (funded by local); making a school building blueprint (free from key-person); Workers, materials, furniture, construction supervision, meeting, setting up the Cardano billboard on school, setting up the mini Cadarno library, connecting to three newspapers for reporting the even, incurred fees. The total budget is 29,950 USD. Second, the members joining this project have good skills and knowledges to run a program like this. One member is the lecturer of a National University, receiving Ph.D. in system information. She is also the data hiding expert, developing many applications. Other member has experience in designing, supervising, and executing construction works. The third member is the CEO and also a primary member of a group charity. I appreciate this group and believe they can apply their experiences and skills to run this project smoothly. The authors mention two main challenges they may face out when running this project. They are the impact of bad weather and raw material price increase. To solve these problems, the authors suggest to build the school from September till March, having the reserve fund for arising fees. I totally agree with what described in the project and evaluate mark 5 for this criteria.", "q1r": 5, "q2": "This project has clear schedule to follow. It is expected to take 4 months from beginning till finishing the job. The proposers take one month for field survey, meeting local authorities and the school, making the document to legalize the construction and a school building blueprint. The construction would last 2 months and it takes one month for completion, setting up Cardano billboard on the school and Cadarno library, organizing one meeting before running the school and library. We can also see the particular KPI for success evaluation which are the appearance of one completed school, a Cardano library, 03 reports in newspapers about the sponsor of Cardano for school, Advertise on Youtube, Facebook, Zalo.  Generally, this proposal is clear and the solution given out is easy to understand. I evaluate mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9573, "q0": "\"I see a proposal targeting underdeveloped places as always a priority and in line with Cardano's philosophy of building. So your suggestion is worth considering. However, your problem is not convincing. Putting the issue of coin investment as the center of ambition development is not reasonable. Should direct them to Cardano's philosophy of making the world a better place, from which ambition will grow in them, investing in coins is just the result of that process.\"\n\n\"Investing in social infrastructure such as schools in the highlands always brings practical meaning. It helps children learn better while helping Cardano's image to be present for a long time. Parallel to the construction of the school. For Cardano to spread, you have come up with possible solutions that are to build large billboards, and set up a library \"Cardano Libary\". However, to effectively promote capital, you should come up with more solutions to help spread the Cardano platform immediately. You can integrate appropriate applications on the Cardano platform for children studying at school. It could be the digitization of user data on the Cardano platform that makes data management easier. \"\n\n\"Projects in the form of infrastructure construction cannot promote value immediately but need a long time with many years. I agree with your solutions that will solve the challenge. Through the project, participation in the Cardano community will certainly increase.\"\n\n\"The risk caused by bad weather and overcome by construction at a favorable time is reasonable. Inflation is currently increasing and will continue to increase shortly. You should be cautious with this risk. In addition, you also need to consider the risk of corruption, which is very common in construction projects in underdeveloped areas. This affects the funding and progress of the project.\"\n", "q0r": 4, "q1": "\"The process for building a school infrastructure that you have given is quite sketchy and needs more details. In the early stages of construction, there is a lot of preparatory work. During the next 2 months of school construction you should provide a monthly schedule for the basic work that needs to be done such as rough construction, finishing, interior installation, etc so that the Cardano community can easily follow. . In addition, it is possible if you can specify the specific location where you plan to build the school. This is very necessary to create trust in the community because of the transparency of the project.\"\n\n\"The budget you propose is clear and detailed by the construction area. However, some issues need to be more specific. You should come up with some main types of materials to build the building. Newspapers to report events must be reputable newspapers, with a large audience, the better.\n\n\"The project's personnel are all people operating in the fields necessary for the project. I pay special attention to the personnel in charge of construction. The person who will decide the success of the project. You should add enough information about Nguyen Viet Huong so that the Cardano community can easily monitor and make the best decision for your proposal. Once again I would like to note, that if you can somehow prove that the school is built exactly as the funding source, the proposal will easily be approved. I trust your enthusiasm will help the project succeed.\"\n", "q1r": 4, "q2": "“About the metrics to track the project progress given by you is reasonable. However, please note that it is necessary to upload documents and drawings with full legality.”\n\"The success of the project is quantified by a school building, a billboard, a library, 03 reports are not enough. That was only the beginning of success. You need to add in the quantification of what developments the completion of the school will bring to the Cardano community in East Asia.\"\n", "q2r": 4, "assessor": "z_assessor_3065", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10024, "q0": "The proposal identifies the problem of \"Highland children have no coin investment concept or blockchain profession.\" We find that the issue raised is not in line with the installed challenge, children are young subjects, in Vietnam children do not earn money so it cannot be said that children need to know about coin investment, the investment of cryptocurrencies in Vietnam is not protected by the State of Vietnam. Introducing children to cryptocurrency investing or blockchain is unnecessary. However, we see the solution offered to build a school and have a Cardano library for highland children. We support this if it is done for charitable purposes. Commenting to the author I find it inappropriate to promote Cardano to children, the construction of a charity school is to promote Cardano's image to the community, to the teachers and parents of the school this will have an appropriate impact on the audience. The proposal will have a positive impact on the community when building cardano's image through the meaningful work of \"Charity School\". The proposal identified risks of weather conditions that could affect construction progress, but the implementation of demolition and construction from September to March next year was inappropriate affecting the school's learning. The high price of raw materials is proposed to be minimized by applying for additional sources of spare funds.\nI rated: 2\n", "q0r": 2, "q1": "The plan gives full details on the implementation of the proposal, there is a period of implementation after being granted the granted the grant amount. The plan describes the resources needed to implement the proposal, having clear information about the members. The budget analysis given by the proposal is detailed, and full of items to spend. However, we do not agree with this budget table for a number of reasons submitted below: As the proposal presents the construction located in the highlands, the construction of the school with charitable purposes to promote cardano's image. I don't agree with the amount paid to the workers is $60 per square meter now the price of building solid buildings with concrete ceilings is $55 per square meter, We are building uplands where labor prices can be cheaper. Moreover, the local construction that has available human resources is the parents, a charitable work they are willing to carry out at an even cheaper price. The second is that paying for the reporting of newspapers is not appropriate for charitable work. A charitable work that completes the reporting will be automatically taken place because of the actions that contribute to the locality. The promotion of Cardano's image is the real material about the activities that have been carried out that need to be put on social networking sites to make a great impact. The third is that I do not agree to overpay for metting activities, placing Cardano billboards at schools, this amount may be less than avoiding waste. My opinion is to make sure that the cost savings can build a broader school, creating a better learning environment.\nI rated: 2\n", "q1r": 2, "q2": "The success of the proposal has shown that the construction of the school is complete, but the KPIs on advertising on YouTube, Facebook, Zalo are not clear. The author needs to include specific metrics on the number of viewers and interactions with the ad content. We have not yet determined the implementation roadmap of the proposal in accordance with the plan set out. The progress of the implementation of the proposal should show: Labor lease contracts, invoices for purchase of materials. The implementation of reports in newspapers is not appropriate, the work done requires detailed monthly reports on Github, Catalyst. We are unable to determine whether the proposal is being implemented as planned.\nI rated: 2\n", "q2r": 2, "assessor": "z_assessor_3144", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for commenting on our project, through your comment, I guess that you are Vietnamese.  You set a labor rate in the plains at $55 and assume that it will be cheaper in the mountains.  The fact is that in these mountainous areas, they don't know how to build, and we will have to hire workers from other areas to go there to do it, so it fluctuates $5 from your cost.  You emphasized that this is a charity project so it needs to save money, I mean, this is a project to promote Cardano.  That's why it was necessary to build a Cardano billboard so it would last as long as the school existed, and if you wanted the free report on newspapers, you wouldn't be able to get it on the front page of the newspapers or the front page of the catalog.  You are bringing the perspective of a charity project from the contributions of benefactors with maximum savings to a Cardano promotion project and want to cut costs for the promotion."}, {"id": 10936, "q0": "Currently, the economy is growing, and the demand for human life is increasing. Still, most development investment projects focus mainly on big cities, forgetting the development investment in the highland. Therefore, the people in the highland areas' economic, learning, and physical conditions are still lacking and difficult. The proponent with the desire to build a new school for upland children and a library named Cardano Library. The project aims to improve and improve the learning conditions for children in the uplands better and better, and to help children here access knowledge more easily. In addition to building schools and mini-libraries, the project also propagates and promotes Cardano knowledge to people, especially children here. That helps them understand more about Blockchain concepts and invest in and develop the Cardano ecosystem in the future. This is a meaningful project, bringing many benefits to people and society; it meets Cardano's criteria. Especially when they know that Cardano has funded the construction of schools and libraries to improve learning conditions, they will have a deep impression of the Cardano ecosystem, read more Books about Blockchain Cardano, and have the opportunity to invest and develop Cardano in the future. The proponent will put the school's opening event in the newspapers to promote Cardano in order to make the Cardano brand more familiar in Vietnam. The project perfectly fits the challenge, which is to help East Asia growth, and Cardano growth. Through the project, more people will know about Cardano, and the ecosystem of Cardano will be increasingly developed and expanded. This is a great proposition!", "q0r": 5, "q1": "The proposed team has four members with clear membership information. Each member has tasks and experiences relevant to the project, enough ability to complete the project, and the number of members is quite reasonable. The project has a detailed development roadmap within four months, with the most favorable weather from September to March next year, the time used to prepare and construct schools and schools. The mini library is so reasonable. The budget is divided into categories: the cost of field survey, design planning, labor, materials, furniture, construction supervision, Marketing, Cardano billboard placement, and Cardano library. mini, event news… The project has an appropriate, transparent, and detailed budget proposal. In particular, the proponent has a very thoughtful provision for inflation costs. The proponent gives reasonable project completion KPIs.", "q1r": 4, "q2": "The proponent gave the criteria to evaluate the project's success: a school will be built, a Cardano billboard at the school, a Cardano library, and 03 articles about the Cardano sponsor for the house. Schools and have ads on social networks such as Youtube, Facebook, Zalo. The proponent has a specific KPI and a clear and reasonable development roadmap. This project would be appreciated more if the proponent would add details on the number of newly built classrooms, list retrofitted facilities to improve their learning conditions, and especially be equipped with more computers so that children can quickly look up information and access information technology. One problem is how long the Cardano advertising programs and signs will be maintained, so there should be specific numbers so that generations of children here know about the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_3208", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10979, "q0": "The proposal identifies problem that needs to be solved and clearly articulates how it will add value to the Cardano ecosystem. Education is very important and strategic investment for the future of course, but as the proposer mentioned that most children in highland has very low education, it will be hard to teach about blockchain to them. This proposal also need more specifics age of the children that the team will invite to join this school. Key metrics and goals of this proposal might be align with the challenge, but I don't think that this is strategic range of age to be exposed to the knowledge of blockchain and its technology. The proposer also mentioned that \"there are many schools in the highlands in Vietnam that are degraded, the teacher and students teach and learn in difficult conditions. This leads the children to not know that in the future, they can get rich by investing in coins or developing a career based on blockchain.\" The proposer also has wrong way to see the problem here. It is dangerous to teach children that they can get rich by investing in coins. We should educate them how to invest wisely and learn about the technology instead of tell them to buy coins to get rich. I think the proposer and the team also need to learn about blockchain technology and Cardano even more before run this big good project that they proposed.", "q0r": 2, "q1": "The proposer need to be more specific about the school that they want to build: how many classes, teacher, student and how big is the building that they will build. It's very fast to build a school for 2 months and the biggest risk is the permit process to build school from outside funding. It is important to expand this project to a longer time frame, so it can be more reasonable to accomplished. The budget is suitable for a library, but it is too small to build a registered school (100 square feet). To build a school, the team also need a real budget from contractor that they can attach in the proposal. The proposer need to add their student target, their age and the curriculum that they will use for the school. For the risk section, I think the biggest risk is about the permit and also who are the target of the students that will register. It need to be addressed and anticipated.", "q1r": 2, "q2": "The Metrics/ KPIs are too short for building a school. The proposer can expand the plan for a 6 months or a year project. To build a school, the team also need a real budget from contractor that they can attach in the proposal. The team need to have an accessible public channel for delivering regular updates to the community for auditing progress.", "q2r": 3, "assessor": "z_assessor_3213", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11005, "q0": "This proposal has a clear problem identification and also has provided a solution to grow Cardano in East Asia especially in long term goals by creating awareness to school kids in remote areas.\nThis real life utility is what Cardano is for. And by having this activity covered by local newspapers, it will multiply the impact in regards to differentiating Cardano with other blockchains. I can see many more upcoming Cardano technologies can be applied here in the future, like what Atala Prism is doing now with schools in Africa. So this could be the starting point for Cardano to build a better life in East Asia.\n\nThe team behind the proposal also has a relevant thought about how to build a powerful memory of the kids, as well as their parents, by building a billboard sign to publicly announce the sponsor of the school and library. As I think the project will soon be a new trend in East Asia, this proposal absolutely effectively addresses the challenge.\n", "q0r": 5, "q1": "The team behind the proposals are teachers and lecturers whose credentials can be seen in their activities documented on their Facebooks pages. Others are a charity group member and an architect who will not have any difficulties in outlining the budget and executing it to make a modest school building and library. I also noticed that a specific time frame is given to start the erection due to the weather condition in the site where the new school and library is planned to be built.\n\nThe time horizon for the budget also has a detail set. We can see that every necessity from preparing the legal paper for building permit, executing the construction work and having all of the activity covered in the newspapers is very well organized and in very reasonable allocations. And there is also a reserved allocation to mitigate risk due to the building material price inflation. Another great thing to see in the proposal is that the team is trying to minimize the cost in some areas by having cooperations with volunteers such as the kids’ parents and other people from the localities.\n", "q1r": 5, "q2": "The proposal is so auditable as the team is going to publicly deliver their progress in social media. They are currently active on Facebook, and they also will upload every update on YouTube and Zalo. I just learned that Zalo is the most popular local messaging app in Vietnam. The KPI are the completion of the school building, the library, the Cardano billboard, and the newspaper coverage. And if I could make a suggestion here, it would be wonderful if the kids’ parents or anyone involved in this activity is also being introduced to Cardano, and being assisted in creating their own wallets.\n", "q2r": 5, "assessor": "z_assessor_3214", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11145, "q0": "The proposal fits the Challenge \" Grow East Asia, Grow Cardano \" as it aims to build a new school for the children who live in the highland of Vietnam. This is a great project to improve the image of Cardano and help children learn about blockchain, which they have never learned before. However, the team has to clarify an issue. The issue is \" How will they get access to blockchains in general and Cardano in particular ? \". According to my knowledge, it is very difficult to access the network in highland areas. Moreover, almost the people living in the highlands are not interested in getting rich so they don't have to invest in cryptocurrencies in general and Cardano in particular. In general, this proposal is simply a charity project but this is undeniably a good proposal to help more people know about Cardano, especially in Vietnam.", "q0r": 4, "q1": "With good resumes as provided in the proposal, there's nothing to complain about. The roadmap of the project can be said to be quite urgent but the construction period lasts from September to March. I agree that the construction will face a lot of difficulties, such as transporting building materials to the highland and bad weather condition. However, the construction process takes too much time when the school size is only 100 square meters. The funds requested seem adequate and are clearly lead out for each section. There is even planning for the increasing of raw material price because of inflation. Good work.", "q1r": 4, "q2": "Unfortunately, the proposed team did not provide a separate link for the audit. The project needs a separate link which is belong to the team. This is very important because the team needs to report and communicate the necessary information about the project and the community needs it for the audit. With audit difficulties, this can make it difficult for the team to gain support from voters.", "q2r": 1, "assessor": "z_assessor_3225", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11773, "q0": "For me, the idea of “Advertising Cardano in the highlands” is linked to the challenge setting and has a lot of fun to evaluate. Here, the authors propose to build a school and a library named Cardano Library for children in the highlands of Vietnam. The purpose of the solution, according to the group's argument: one is, to \"bring the concept of coin and blockchain investment to children to help them have the ambition to develop themselves and the community where they live\"; second, will promote Cardano on the media in Vietnam. Being a Vietnamese myself, I appreciate the humanity of this solution for giving the opportunity to access blockchain potential for upland children in my country. However, I have not really appreciated the impact and ability to raise awareness about Cardano to the community of this solution. The reason is that in Vietnam, children in upland areas are especially difficult in terms of physical living conditions (diet, poor nutrition, poor housing, etc.), difficulties in accessing 4.0 technology. Specifically, lack of online teaching technology equipment, many schools do not have internet coverage (https://baophapluat.vn/tre-vung-cao-vung-xa-va-giac-mo-tiep-can-4-0-post414471.html). Therefore, bringing the concept of blockchain to children when they themselves have little or no access to the internet is very difficult, even impossible. In addition, the construction of a school, a library only affects children in a specific area, does not have much impact on identifying and solving difficulties for many other highlands in Vietnam. Meanwhile, according to data from the Ministry of Education and Training, Vietnam currently has 12/63 highland provinces, accounting for 19% of the country's provinces (https://moet.gov.vn/giaoducquocdan/giao-duc-dan-toc/Pages/tin-tuc.aspx?ItemID=4724). It is a good idea that the authors propose to put the opening event of Cardano high school in newspapers to promote Cardano in Vietnam. However, the drawback is that this event only has an impact at the time the school is first launched. While, to increase awareness of the community, we need more than a continuous, long-term, persistent communication campaign to increase memory and awareness about Cardano. The authors also propose building a Cardano Library at the new school, helping children read books every day, including some books about blockchain. However, I did not find content related to introducing and teaching about blockchain for children in the proposal. At a young age, it will be difficult or impossible to read and understand basic blockchain concepts on their own without an instructor. Especially in the situation that children have little or no access to technology like children in big cities. This concerns the risks of the solution that the team has not mentioned: the risk of children accessing blockchain technology concepts (they do not understand what Cardano is, what blockchain looks like), the risk of the solution's limited impact (because only one school, one library, one Cardano billboard can be built in one area)... For these reasons, I rate 3 points in impact of the proposal, deducting -1 point for the scope of the solution's impact, -1 point for unforeseen risks.", "q0r": 3, "q1": "Regarding the feasibility of the solution, the team refers to a 3-phase roadmap, conducted over 4 months. In which, there is 1 month for survey and design; 2 months to build the school and the last month to complete and promote the Cardano brand. I suggest that the group should add information about the planned survey locations and the estimated time to start the project (if the proposal is approved). This helps the community to understand why the Cardano billboard is located at the specific location identified and when the project can be completed. The project's budget is divided into 3 corresponding phases, with costs for each  item. However, here I would like to ask the team to clarify some cost items. For example, the cost of $2000 for furniture should be explained in more detail (specifically, how much $ is needed to buy furniture, lights, equipment in the classroom, for how many layers… Similarly, the cost of placing billboards Cardano advertising $800 at the school, the community needs to understand: what is the estimated size of the billboard? Advertising depending on the material (corrugated iron, corrugated board thickness, Hiflex canvas, corrugated sheet, etc.) will have a unit price per m2 from $10-$25/m2. Communication costs are similarly understood, depending on the brand. Newspapers, number of readers, print or electronic newspapers, appearance of homepage or subpages... the cost of advertising will be different. The team needs to clearly the communication objective, so that the community understands how the advertising costs are used. Regarding the team, the group consists of 4 members who are lecturers and entrepreneurs. However, the profiles of 2 out of 4 members do not have a reference link, making the community not have enough information to understand their experience and capacity. I rate 3 points for feasibility due to minus -1 point for lack of budget statement explanation, -1 point for lack of link to team member profile.", "q1r": 3, "q2": "In terms of auditability, the team has given specific KPIs on the success targets to be achieved. Personally, I think that this project can be completely audited by the community because the team has provided sufficient auditable data during the implementation process. However, I suggest that the team consider adding some more detailed evaluation criteria. For example: how many children is a school built for? How many readers is expected to reach the newspaper reportage?... This will help the community understand exactly what the project's value and success means to children in the uplands and its impact how to the Vietnamese blockchain community. For this reason, I rate the project's auditability 4 points.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12679, "q0": "The problem in the challenge that needs to be solved here is that upland children do not have the concept of coin investment or blockchain profession, bringing this concept to them helps them have the ambition to develop themselves and the community where they live.  the Proposal presents how it will add value to the cardano ecosystem as follows: build a school and a library called Cardano Library for upland children, and promote Cardano in the media and press. The proponent offers a solution to the problem: build a new school to help children learn better. set up a big billboard to show that Cardano sponsors this. Besides, set up a small library called \"Cardano Libary\" in this school so kids can read books every day and put some books about blockchain there. put the school's opening event in newspapers to promote Cardano to make the Cardano brand more familiar in Vietnam. With the above problem solved, Cardano community participation will increase as more people come to know Cardano through this project so it can scale to solve future challenges. I completely agree that this proposal will effectively solve the challenge.", "q0r": 5, "q1": "The proponent has provided specific evidence of the required location and experience of the people who will be involved in working on the project. The proponent has provided a reasonable and clearly outlined budget, breaking down the items so that they are identifiable and easily verifiable. Specifics: Proponent Estimated cost of $29,950 for this project. The proponent gave a realistic timetable to implement the project in 5 months and estimated the budget for each job in each month. First month: Field survey, meeting with local authorities and schools: S400, Building legalization documents, School building blueprints $250. Second and third months: School construction: Labor$6000, Materials $15000, Furniture: $ 2000, Construction supervision: $200. Fourth month: Metting at the end: $500, Place a Cardano billboard on school: $800, Set up a Cadarno mini-library: $800, Connect with three Newspaper to cover the event: $3000, Estimated costs incurred: $1000. The proponent has considered the risks and proposed specific measures to address those risks to successfully implement the project. With the information given I completely agree this proposal will be successfully implemented.", "q1r": 5, "q2": "The proponent has provided a 5-month implementation roadmap with specific milestones to be achieved clearly outlined in the feasibility section of the project, looking at the progress of the project can be checked.  When the project is implemented will help increase the participation of the Cardano community. The proponent has chosen the indicator that determines the success of the project which is A school was built, A Cardano billboard at the school, A Cardano library, and 03 newspaper reports about Cardano sponsor for schools, This proposal is a new proposal and the Proposer has clearly described the problem as well as given specific, clear, and understandable solutions to solve the given problem. With this proposal, I agree 5* and I agree that this proposal provides me with sufficient information to assess progress towards goals.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12884, "q0": "The idea of ​​building a school, then installing a Cardano billboard, and making a small library with Catalyst's funding, this is like a charity work, through which to promote Cardano and Blockchain to the people. minorities. The promotion and guidance of young people in the highlands from a young age so that they can then orient their careers in the future is a noble gesture, but it is still too far away. What the highland children really need is a school with full facilities, a training environment with highly qualified teachers, and most of all, children's meals. Upland areas need more nutrition, which is really a concern for someone in the lowlands like me. And that problem really needs the support and contribution of the entire community, to be able to develop the highland into a place that is not too lagging behind the plains. Your ideas can be said to be a noble gesture. And highly humane.\nRegarding the risk you posed, there are 2 risks that you mentioned, one is weather conditions, the other is an increase in raw materials due to inflation, and you have also come up with specific solutions to overcome the risks. that ro. But I would like to contribute one more risk that is the problem of terrain, in the highlands, difficult terrain, will hinder the construction and transportation of materials. There are some issues that I still have questions and need your answers: In which locality will the construction of the school and library take place?, exactly the commune, district, and province. The next step is to build a primary school, a secondary school, or a high school. Although your proposal is suitable for the challenge posed, from a personal point of view, you need to specify the location where the project will be implemented. . I give this impact 5 points.", "q0r": 5, "q1": "The project implementation plan that you suggested, which gives us a total of four months to finish the project, seems like it could work for the construction of a school. However, there is one issue that I would like to point out to the team: even though we are in the second and third month of working on the project, I believe that it is still unfinished, and you should add more. For instance, you will construct a school with a floor space of one hundred square meters, during which you will specify the number of classrooms, the level of students who will attend the school, and whether or not you will also construct a place for yourself to sleep far away (upland areas will often have other schools). (dormitory-style education) Regarding the cost, as you pointed out, I completely agree with you that it is reasonable because of the high price of raw materials and the difficulty of transportation. The staff of the team consists of four people, one of whom is a native, and there is no question in my mind that the personnel of the group are the primary ingredients that will contribute to the project's success. I also hope that you will be able to find sponsorship so that you can make a contribution to the growth of the highlands. I give this a score out of a feasibility 4.", "q1r": 4, "q2": "It is essential that you upload every single one of your workflows, blueprints, and reports from newspapers on a monthly basis in order to demonstrate to the community what you are working on. Unfortunately, I haven't been able to locate all of the links necessary to view and follow your projects. Perhaps you've made a mistake in your reasoning. This is a really good idea, it's more charitable, and it can help children in upland areas, where living conditions are difficult, to have a stable, clean school roof as well as a safe place to live. This is a really good idea, and it's more charitable. Cardano Institute has access to a library where they can read and learn interesting things connected to Cardano as well as other knowledge that is helpful. As a result, I will award AUDITABILITY with a score of 4 points.", "q2r": 4, "assessor": "z_assessor_3497", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13050, "q0": "This is a really meaningful project. In the highlands of Vietnam, people are still backward and have a difficult life. The construction of schools will help children in the highlands get an education, eliminate illiteracy, and help them have more opportunities to develop in the future. This, if successful, will really mean a lot, both to help them gain more knowledge about technology, and to promote the Cardano community in line with the goals set out in Fund9.", "q0r": 5, "q1": "I was very confused when I read about this proposal, because there was still the need to build a school, create documents, connect with the media.... But when I read the membership group, I was much more reassured. Building more Cardano libraries and advertising will help more people in the highlands learn about Cardano. However, I did not see where this particular highland area? As for the main potential risks, besides the risks of weather and price increases, I did not see an extremely important issue addressed, which is the health and safety of workers during construction. In addition, people in the highlands often do not pay much attention to education due to their low education levels, making it difficult to get children to attend school. I look forward to the team providing more information on the two risks I presented.", "q1r": 4, "q2": "The proposal details the timeline and costs incurred for each month. In addition, the proposed team also attaches a construction plan table for each item for easy tracking. When the project is completed, there will be a report on the school being built, which will both let people know that the proposal has been successful, and help promote the Cardano community to many people.", "q2r": 4, "assessor": "z_assessor_3550", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13385, "q0": "You are a teacher at a large university in Hanoi, the capital of Vietnam and your idea is aimed at young people in the highlands, I would love to suggest this as you have been thinking about it.\nThis proposal aligns with the challenge of this Catalyst program.\nAnd after having a library in the highlands, this will be an opportunity for those who have a desire to escape poverty and a door for young people who are passionate about blockchain, their job opportunities with Catalyst to nurture bigger dreams, to make your proposal highly philanthropic and humane, I would definitely like to see your proposal succeed.\nIn addition, there are also some risks such as:\n - In those highlands, technology is still weak and the internet is not strong, there are not many financial systems there like banks and funds... so it is very difficult for children to join the Cardano community. just stop at the level of research.\n - Second, after the project and the Cardano library are built, who will manage and maintain that library, because I think the building is not difficult but maintaining and nurturing will be very difficult.", "q0r": 5, "q1": "This plan of yours is active for 4 months, in each month there are clear work lists. However, in the description of the construction in the 2nd and 3rd months, it should be clearly defined that in that 100 square meters you will divide the classroom into how many compartments, how many cabinets and the Cardano, Blockchain document libraries. where is presented.\nYour budget for each work category has been broken down in detail by each month of action, do you have a plan for this $1000 cost of inflation?\nThis proposal does not have too many technical elements in terms of technology, so there is no big technical barrier, so with the work schedule as you have outlined, the probability of success will be high.", "q1r": 4, "q2": "Every month, the team will upload in-progress information such as: \"working with local documents, project blueprints, project implementation progress, reports from newspapers\", but you will Where did you upload it, you haven't seen it yet? You update the link so that the community can easily track periodically the implementation of the group's project if it is sponsored, such as a Google Doc link.\nIn general, the roadmap with important milestones and specific time to achieve achievements is quite clear, easy to understand, and can be trusted.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "We build a school and a library named Cardano Library for highland children, and through this event, we will promote Cardano to the children there and in the media and newspapers", "experience": "We are highland teachers, main members of charities, architects, business leaders, and persons who are knowledgeable in Cardano"}