{"id": 418795, "author": "kocangi27", "title": "Catalyst for Student in Vietnam", "url": "https://cardano.ideascale.com/a/dtd/418795-48088", "category": 26602, "amount": 5979, "description": "In Vietnam, the tendency of students to learn about blockchain and cryptocurrencies is increasing. However, Cardano generally and Catalyst, in particular, are still new and unknown to many students.", "f6_no_assessments": 14, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 3388, "q0": "This proposal targets university students to join the catalyst community with a simple and clear approach, where the proposers provide rewards to those who join, and contest for those who decide to play a role within the group, of being a PA or a Proposer.\nThe strategy to offer rewards will surely help the idea to easily spread within the student community, and attract many people to join the group, and be part of this initiative.\nThis proves how the proposal aligns with the challenge objective. And starting from one university, the idea may be replicated in others within Vietnam, and why not globally.\nI rate it with a 5 star.", "q0r": 5, "q1": "Social media will play a big role in the implementation process of this proposal as proposers are planning on opening up a Facebook group, a a Facebook page, TikTok, Youtube.\nPromote the idea within the students community and expect to have those to get interested and decide to join. But what seems to be an extra attraction, is the rewards and contest system. As always, when there's retribution to join a campaign or do any task, people intend to easily participate. What would be the case for this initiative too.\nThe proposers team is formed by people with less experience around the catalyst project, which may be a challenge for them but that may be overcome as they mentioned on the risks section of the proposal.\nThe budget breakdown is detailed and covers essentials items expenses. What would be better to learn more about is the names of universitie(s) targeted to start with this time around and elaborate more about the expansion strategy to others.\nWhat's not clear too is if the resources information materials around the cardano will be created in English or Vietnamese? If those resource materials are in other languages than English, may make them more accessible.\nWhile being feasible and with chance of access, I rate it with a 4 star based on the few above questions I raised.", "q1r": 4, "q2": "30 new members to join the project catalyst in the first phase. Deliverables are detailed for this project and are clear enough to follow as there will be social media platforms with information in about it. Also, a website will be built.\nRate it with a 5 star.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 5483, "q0": "As a reader and as someone who has worked repeatedly in the catalyst funding rounds I have personally seen that the issue with reviews is not the quantity but it is with quality. And this draft in front of us is not addressing the challenge's expectations in the most appropriate way. The proposer plans to draw more students onto the catalyst PA/VPA assessments through the help of several social media and reward them for successful registration. The proposer fails to explain how exactly, the students who might not have the required expertise to understand the proposals, be taught about all the concepts and technical details to assess. Without a plan to educate them first regarding Cardano, there is no way they could produce quality reviews. The plan laid out by the proposer lacks this very important aspect. With just videos and documentation, and no one to supervise, the number of sub-standard works is bound to increase. Hence, I feel this proposal is not something that is apt for this challenge but might be apt for a challenge such as \"Challenge & scouted for students\" with necessary changes to the issues mentioned above.", "q0r": 2, "q1": "The proposer provides a very elaborate plan to achieve their goals, with clear month-by-month milestones. The proposer also provides the readers with a detailed budget breakdown for the requested funds of $5979, which is commendable. However, there are various other areas that I feel the proposal is lacking. One such area would be the roles of each team member and how the distribution of work is done, considering that they are all students. The major doubt lies in the expertise of the team members to pull this together. There are many areas, where an expert might be required such as teaching the new students about Cardano and about the right way of assessing various proposals, and I personally feel this is where the current team members might need some help. And the other major aspect is what is the end goal of this implementation, if this proposal is only a means to introduce new PAs, then I feel it is not justified to fund this proposal, considering a lot of other proposals in this challenge that are targeting to add much superior value to the Chain.", "q1r": 3, "q2": "The proposal despite being sub-par in my personal view, I sure have to appreciate the proposer's groundwork on identifying the valid metrics and KPIs to track their work. Quantifiable metrics such as social media group size, number of user engagements, page visits, and also monthly reports regarding the progress of the project are all viable and dependable metrics the auditors could make use of to keep track of the fund's utilization. Eventually, the number of PA and VPA registrations could be the ultimate success metric to evaluate the proposal's success. The target audience being students could actually draw a lot of traffic onto the chain but one thing that the community has to be wary about is the credibility of these students who registers themselves just for the sake of rewards. The proposal is a fairly new one, and also the team involved. Given the kind of problem they are intending to tackle, the proposal is very weak in its fundamentals and if funded through fund9, the audit process might also have to evaluate the kind of knowledge each student has while registering for the next fund PA/VPA rounds.", "q2r": 3, "assessor": "z_assessor_2704", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 5766, "q0": "The student bloc is a unique bloc with strong and energetically fresh minds, ready to explore and learn new things. This target group need to be directed with focus to the catalyst ecosystem to grow it. This implies the proposal address a specific problem with focus on the cardano community. \nThe solution comes with rewards and exciting activities that make students to want to learn more.\n\nThe proposal has the potential to onboard many students in the catalyst space to be PA's, proposers and developers. ", "q0r": 5, "q1": "The activities and plans are detailed with specific actions to be taken. The timelines for each activity are well linked to each other. \nThe Budget is reasonable and the breakdown is  clear for implementation. \n\nThe team are peers to the target group and mobilization of peers could be done easily for this proposal during the implementation stage. this shows a successful execution of the project. Seeing their peers organizing them would make them curios to learn more and explore", "q1r": 5, "q2": "The KPIs are clear and have made estimations of the outcomes. This will serve as references to audit for challenges and success. A monthly feedback on success and failure is also important to have records of outcomes. Measuring success is important for auditing and the proposal has made specific projections to guide for  monitoring and evaluation. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 8467, "q0": "I think it's really cool that this project wants to build a community for Vietnamese students that uses Facebook's primary platform to share and discuss information about Catalyst. I think that would be really beneficial. The team has already determined who their ideal participants will be and how they intend to get them to become members of the community. In addition, in order to advertise their primary Facebook group, they will establish accounts on several other social networks, such as YouTube, Instagram, and Tiktok, amongst others. In addition to this, they will develop a website that will provide community members with Catalyst-related material that has been compiled by them in order to facilitate a quicker onboarding process for Catalyst. In addition to this, they plan to host online sessions in which they will discuss the lessons they have learned while working on Catalyst (writing PA, writing a proposal). My impression is that this initiative has been meticulously planned out with a variety of strategies to recruit and educate new participants. Students will be given further information on the Cardano and Catalyst blockchains if the team is successful in their mission.", "q0r": 5, "q1": "The plan lays out in full detail the sequence of events that will take place over the course of the following five months. The supplementary duties for each month are broken down into obvious categories based on the amount of time they will require. The use of the money is appropriate, and the way in which it will be spent has been articulated quite specifically. The listing also includes a marketing strategy that will be used to promote the project.\nI would like to make a suggestion to the team that they provide additional personal professional references (in terms of programming, website designing, and public speaking), such as LinkedIn profiles or project files, so that I can gain a better understanding of how well the experience of the team aligns with what the project requires. The reference to my Facebook profile is not especially relevant because there is no essential information that I can extract from it.\nIn general, the project is highly viable once the team add more information regarding the team profiles.", "q1r": 4, "q2": "In the proposal, the measures that are related with the results of the study are provided in a form that is simple and easy to comprehend. Examining the timelines for the job that has been finished, as well as the number of online meetings, the number of community members on the Facebook Group, and the number of postings, is an easy process. In addition, there is a predetermined quantity for each of the goals that they have set for themselves; this demonstrates that they are quite concerned about how the success look like.\nIt is a plus for pointing out the possible risks - difficulties - solutions to such problems, as well as updating detailed reports on costs used, community members, and percentage completed on the above Github link and Website; this will help us to easily keep track of the progress that has been made.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9345, "q0": "The idea of ​​the proposed proposal is to create a group on Facebook to build community, the information provided in the group will revolve around Catalyst. That said, we can see that the proposal fits the objective of the challenge and that the creativity isn't too high. With your proposal, I think it suits the tastes of young Vietnamese people, almost everyone in universities uses Facebook. And if you can do good marketing on tiktok, it will help the facebook group to be more widely known. Because Vietnamese young people today are very fond of the tiktok platform. The only information you guys make suggestions in the group are : Steps to become a CA, VA, How to write and submit proposals to Catalyst, Some Cardano knowledge. I further suggest maybe what is Catalyst? Summary of projects in the funding round from Fund 4-Fund8, How to calculate bonus when doing CA... That's the information you can refer to to include in the group.", "q0r": 5, "q1": "Although your team is very young and inexperienced, I see that you work seriously. Have a detailed plan, divided into each week of the month. Besides, the budget you do is also very detailed and specific. Hope you will get funding and do well on this project.", "q1r": 4, "q2": "I think your KPI should be set higher, you should put 100-200 people in the group I think is better than 50 people. Besides, the success of that project is not only that people know more about Cardano but Vietnamese students will have the opportunity to participate in the Cardano blockchain and have creative ideas to build the community together. In general, I think you also need to try a lot because your young experience and ideas are not too creative, as well as not having an expert to guide you to implement the idea will be a challenge for you.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 9574, "q0": "\"Although I like your idea of creating a community for students to provide and exchange information about Catalyst, I remain neutral, not completely supportive. Because the solution you proposed is not convincing. To attract people to participate you have to spend a certain amount of money is not necessary because Catalyst itself is attractive enough, as long as you organize to promote people to understand how Catalyst works, they will join themselves. family. In addition to you, there is a PA writing contest and a project writing contest, and awards are given to the winners. This model looks reasonable at first glance. However, you need to understand that if the winners continue to be paid from the Catalyst fund. As such, they will be paid 2 times from the Catalyst fund. This creates an imbalance in the Cardano community.\"\n\n“Because your proposed solution is not reasonable, your proposed solution will not be able to solve the challenge.”\n\n\"The risks and solutions to reduce the risks that you offer are completely appropriate. However, I think of a bigger risk that you will take. If your project is approved I am sure there will be a large number of students involved then your organization can be overwhelmed.\"\n", "q0r": 3, "q1": "“I appreciate the detailed plan you outlined. Tasks are scheduled week by week in a clear sequence. A carefully prepared plan always wins people's trust. Unfortunately, the solution to your proposal is not good, so I have to give a neutral opinion. I hope you will adapt the solution to be more suitable for getting through the project.”\n\n“Like the plan, the detailed budget analysis is also very careful and meticulous. I appreciate your hard work.”\n\n\"Members include 3 people, all with complete and clear information. I hope that your proposal will have the appropriate updates for the project to be implemented. \".\n", "q1r": 3, "q2": "“The metrics to measure to track project progress are, in my opinion, consistent with your proposal. Give the constituency a clear basis to monitor the progress of the project.”\n\"The specific indicators to evaluate the success of the project are carefully selected by you. Each indicator is quantified. \"\n", "q2r": 4, "assessor": "z_assessor_3065", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10838, "q0": "I think this proposal fits the goal of the challenge. The proponent wants to use popular social networking sites such as Facebook, Youtube, Instagram, Tiktok, etc. to bring Catalyst closer to Vietnam. Through that, the Cardano ecosystem will also be known to more people, receive more benefits and develop. It was also interesting that they came up with an idea to attract participants and held a contest “PA writing contest, project writing contest”. As for the risk part of the proposal, I agree with the author. They recognize the problems that need to be solved if the project is to be successful. However, the solution they offer is not clear and lacks conviction. ", "q0r": 4, "q1": "The author gives a 5-month roadmap, activities are carried out in each week for a month. Basically, we understand how the project process works. However, some content has not been detailed. What videos and documents will be posted? Was it created by a team member or was it obtained from somewhere? Who will be responsible for this part? As for the budget, I think they did well. Expenses for each activity are detailed. Finally, about the members of the project, we write their names, email addresses, and the name of the school they are attending. I think this part also leaves a lot to be desired. We need to know more about their previous experiences. Especially the relevant experiences in the Catalyst and Cardano ecosystem. ", "q1r": 3, "q2": "I think the metrics to measure the project are not detailed and not clear enough to track the progress of the project. Talking about the success of the project, the author also mentioned the successes of the project and the success of Catalyst and the Cardano blockchain. The success of the proposal is made clear by the KPIs achieved. However, for the success of Catalyst and the Cardano blockchain, how can we measure it? Besides Catalyst, are they involved in other Cardano activities? Will the number of ada users increase? I think the author needs to find a way to evaluate these factors. ", "q2r": 3, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11147, "q0": "In general, this proposal geared towards students in Vietnam, young people with creative and flexible minds. By creating a group on Facebook to build the community and provide information about Catalyst, this will help the Vietnamese students have more knowledge about Cardano and find opportunities from Catalyst. On the side of Cardano, the platform will have more creative and flexible thinking human resources to contribute to the platform's development. In addition, students will have more opportunities to develop additional skills and expand their knowledge when coming to Catalyst. With Cardano and Catalyst growing, students in Vietnam will be looking for opportunities to work or even start a business. If this project is funded, it will be the first step for young people to have the opportunity to know and approach Cardano. With the number of students in Vietnam, I believe that the scalability and scale that the project can achieve is relatively large.", "q0r": 5, "q1": "It is great that the members of the proposed team are still students. Therefore, I do not judge the feasibility based on the experience of the members but they should provide some information relevant to the positions of the members, such as the leader of the team and job position of other members. As can be seen from the proposal, the proposed team provided a detailed plan, including timeline and key milestones. However, the budget is a bit inconsistent with the goal of the community with at least 30 members in five months. In this case, advertising cost is unnecessary because the proposed team can self-promote to their friends. Although the proposed team anticipated the risks, there were no specific solutions and too much dependence on the team outside the project like teachers and Project Catalyst advisors.", "q1r": 2, "q2": "Fortunately, the project can be tracked thanks to the monthly reports the team will provide in the Website and through GitHub. If that is not enough to audit, we can also join in in the Facebook Group and their online meetings. As a result, we will have a more comprehensive view of how the proposed team works. In my opinion, there's very little reason to be cautious about the auditability of this project.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 11298, "q0": "The problem proposed by the team that properly reflects Cardano in general and Catalyst, in particular, is still new and not known to many students. Their solution is to create a community to provide and exchange information about Catalyst based on Facebook's main platform for Vietnamese students. I like how they solve problems to add value to the ecosystem. Proposing to effectively address the challenge, they Develop Catalyst to grow the Cardano community in East Asia. They present challenges and risks when implementing projects. But they did explain clearly how to reduce the risk. I found their biggest challenge was the experience of the members however, they came up with a solution by consulting with experienced Project Catalyst advisors.", "q0r": 4, "q1": "I do not appreciate the experience of the group, the team members are all university students. But I think students are young, knowledgeable, and ambitious to learn about technology and blockchain, so I have high hopes for this proposal. The team has come up with a realistic timetable to complete the work very detailed and specific. The jobs will be deployed weekly in the months. The group will prepare knowledge to post on the website, build a Facebook Group, and organize online meetings to solve the questions of the group members. I found the required team budget of $5979 to be reasonable. The budget sheet is clearly outlined and broken down into identifiable sections.\n", "q1r": 4, "q2": "Sufficient information is provided to assess the progress and success of the proposal. The community can evaluate the progress and development of the project through the number of community members on the Facebook Group, and the number of posts, the number of entries, the number of online meetings, the Number of people tracking, views on websites. The success of the proposal matches the challenge posed. The project to help raise awareness among Vietnamese students about blockchain and the Cardano network should be a priority for the Catalyst community.\n", "q2r": 4, "assessor": "z_assessor_3235", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11775, "q0": "Essentially, the project responds to what is required in this challenge. The author's solution is to set up a Facebook community about Catalyst for Vietnamese students. The purpose is to support, exchange information, help students become Catalyst PAs/proposers, and provide updated knowledge about the Cardano ecosystem. This is the 2nd proposal at Fund 9 by a group of 3 students from the University of Transport (Vietnam). Another of their recommendations is for a sports match ticketing app (https://cardano.ideascale.com/c/idea/418922). Personally, I think the content of the solution is suitable for the goal of the challenge, but it is not different and really stands out. In fact, in Vietnam, there are also a number of active Cardano Facebook communities, attracting from a few thousand to tens of thousands of members: In which, there are large communities such as: Cardano ADA Vietnam Community, Cardano ADA Vietnam… Although they are not specialized in Catalyst, the information they provide about Cardano is up-to-date and diverse. On the Telegram and Youtube platforms, some specialized Catalyst communities for Vietnamese are also active. Prominent among them are @The2MinReview, @TIGERViewVN, @StakingADA, Fimi Financial Channel… Personally, I think Vietnamese students can fully participate in these communities. Because they have a ready-to-use system of information, documentation, and knowledge about Catalyst. This will involve one of the risks of the solution which is competition with other Catalyst community groups in Vietnam. Meanwhile, the authors are students who do not have much experience working with Catalyst to advise the community. This has also been acknowledged by the group: \"Because we are students, we do not have much experience\". I rate 4 points for the impact of this solution after making deductions: -1 point for the content of the solution is not too creative.", "q0r": 4, "q1": "Regarding the progress and budget of the project, I especially have to commend the team because the plan they describe is very complete, detailed, and clear. This is exactly what we expected. The project process is designed by the team for 5 months, with detailed work items each week, specifically: the first month to collect documents, and knowledge about Catalyst, the next 4 months to implement Facebook community activities, marketing promotion, organize proposal writing contests to encourage student participation. The group also plans to share knowledge on other social platforms, such as Tik Tok, and Youtube, and set up an information storage website. Budget related to work items with a full explanation of unit price, quantity, and component cost. About the team, the member profile information is complete and clear, with reference links attached. I believe, the team has the perfect skills and plan to successfully implement the project. My score is 5.", "q1r": 5, "q2": "Regarding the auditability of the solution, I continue to praise the team. The proposal provides a very complete set of metrics that can measure success for each implementation work. Here we have KPIs to understand if the project is to achieve what it intended. However, some indicators are quite modest in my opinion. For example, the minimum number of members in the Facebook Group is 30 people, 300 views on Youtube and Tiktok, and 120 website visits. I don't know if the number of web visits is calculated by day/week or month. Similarly, video views across platforms are calculated for each video or the total number of channel views. Only 30 members join the Facebook group – this number in my opinion is quite small compared to the group's potential to reach hundreds of students. Overall, I think the community has enough data and information to audit this project. My score is 4 points, deducted -1 point because of unclear audit data mentioned above.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11801, "q0": "This is a proposal in Vietnam, the country where I was born and live, a country in the East of Asia. When I read the proposal of Catalyst for Students in Vietnam, I found it to be a perfect fit for the challenge Grow East Asia, Grow Cardano when it solved the problem of the challenge, which is to raise the awareness level of the people in Vietnam and East Asia about the Cardano blockchain and network, thereby creating a community to develop the Cardano ecosystem here.\nAccording to figures based on Finder's crypto adoption index for 2021, for 42,000 people across 27 countries, Vietnam surpasses 26 countries to lead in terms of crypto users. From this information, it can be seen that the cryptocurrency market in Vietnam is being interested by many people, including students. However, with such a large blockchain market and a lot of knowledge, Cardano is still a new field and not many students know about it.\nI found the proposal to emphasize the purpose of creating a community to provide and exchange information about Catalyst on facebook for Vietnamese students. The project goes deep and revolves around Catalyst like (steps to becoming a PA-vPA, how to write and submit proposals to Catalyst, some Cardano knowledge). From here will develop a large living community in Vietnam that loves the Cardano ecosystem.\nI completely agree with the argument, the solution to the challenge in the author's proposal. As someone who is living and working in Hanoi, the capital of Vietnam, I realize that the current state of the cryptocurrency ecosystem in Vietnam is a very developing market, especially in recent years. Recently, the percentage of students who learn about information and participate in the market is increasing. I myself have participated in a few Cardano community groups, but I find the Cardano community for students to be small and limited. I hope, this is a concern that needs to be promoted by the Cardano community for the development of our ecosystem in Vietnam.\nI will give this proposal 4 points because it has solved the challenge posed, the author of the proposal is very young, although knowledge about blockchain, about cardano and about social experience is still limited but with I, this proposal has been presented, planned, fully argued, detailed. I highly commend the author team, this shows that they have put a lot of time, effort, and dedication into the proposal, they have the ambition to develop this proposal to be more extensive and developed.\n", "q0r": 4, "q1": "The project has provided the community with a very detailed and specific roadmap and plan. I personally like this very much because when I read this information, I have a view from the overview to the details of the project's workload, the time and progress to be completed are all clearly presented clear, coherent. Whether a project is successful or not, the first thing you should look at is their planning board.\nFrom many years of experience working in the planning and budgeting field at a leading corporation in Vietnam, I see that the proposed funding amount is $5979, accounting for 2.3% of the total budget of the challenge very reasonable number for this project. Similar to the project's plan, the budget allocation is also built very well, the budget has been divided in accordance with each item, the expenses are reasonable and necessary.\nThe proposal also foresees 4 big risks with specific content: many people are not students but still participate in the community, ADA market price fluctuates, not reaching the number of members in the group as set out goals and limited experience of individuals in the group. I find the solutions to deal with these risks that the authors have given to be very clear and necessary.\nThe current group of authors are all 3rd year students but have had a long time involved in researching and researching about Catalyst, I have read their personal information publicly, viewed some of their products to see that they are really good students in our country. I fully believe that if this proposal is funded, they will do well and have ambitions to go further in the next funds of the Cardano ecosystem.\nI will give the feasibility of this proposal 5 points because the information given by the author team has made me very satisfied.\n", "q1r": 5, "q2": "In general, with the analysis and personal comments I mentioned in the previous sections, I see this project as a good audit project. The community can monitor progress and success. This monitoring is completely continuous and close, and I trust the author team to commit to updating detailed reports on usage costs community members and completion percentages on the Github link and the proposal's Website.\nThe project's measurement KPIs have also been given by the author group with specific indicators to measure the success of the project, the figures given are completely reasonable. With 7 indicators to say the success of the project is a number I consider very positive for this project. When this project is successful, I think it will give the student community in Vietnam who love Cardano a new playground, a place to learn and exchange knowledge about catalysts, about the Cardano community and more.\nThis is a new project that has never been participated in before, I hope it will be funded at this fund 9 and the success indicators of the project will increase many times in the report of fund 10. I do not hesitate to rate the transparency of the proposal a score of 5, an absolute number on the rating scale of the challenge.\n", "q2r": 5, "assessor": "z_assessor_3281", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12130, "q0": "In general, this project has a fairly clear goal which is supported by the increasing tendency of students to study blockchain and cryptocurrencies. By creating a community with the Facebook platform with promotional media through fanpages, YouTube accounts and Tiktok, more students will join. In addition, they will also give rewards to students who want to join the community, this is an effective way to attract students to join. But along with the development of the era of the existence of facebook began to dim and will make students feel bored quickly. I suggest that apart from their Facebook platform, they also use Telegram as a support platform where they can easily share and ask questions about Cardano and Catalyst.", "q0r": 3, "q1": "They write clearly their team profile including their name, email and facebook account link. They also explained in detail the use of funds in this project and did a breakdown of the stages of community formation and also added information if additional funds were needed later. However, the team running this project lacked experience because they only had basic experience and had never run a project before. And for the target member within a period of 5 months too little because it only targets 30 members. I suggest that the target number of members within 5 months can be increased to more than 100 members.", "q1r": 3, "q2": "They explain the roadmap in detail covering the projects they will run before and after getting funding. However they do not use metrics/KPIs to measure their performance or projects. They will only provide monthly reports via the Github site link so there is no intensive project monitoring. Suggest: They are should describe more about metrics/KPIs to measure their performance or projects and also their link progress of a project. ", "q2r": 2, "assessor": "z_assessor_3362", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12888, "q0": "Making use of social networks to educate students about the Catalyst and Cardano ecosystem is not only a good idea but has also been successfully implemented by many different groups and individuals. Facebook, in particular, as well as youtube, Instagram, Tiktok, and Twitter are extremely popular in Vietnam. Because the students are young and full of the energy and vitality of youth, it will be very quick for them to find out new things and learn them. Because the proponent is also a student in their third year at the University of Transport and Communications, having an approach to peers and people of the same age is much simpler for them. You mentioned the rewards for people who had good results, which is an encouragement to help the remaining students in your locality learn more about Catalyst and Cardano. You also mentioned that the rewards were mentioned in your previous sentence. Consequently, I believe that the solution you have proposed is perfectly adequate for the problem of developing Cardano, which is East Asia.\n\nYou discussed the four most significant risks associated with the proposal as well as the solutions to those risks. There is one question that I would like you to answer in an honest and straightforward manner, and that is as follows: What is your understanding of this Cardano ecosystem really reflected in, and how long have you been exposed to Catalyst and Blockchain for a very long time? In the event that you are able to mention such factors, the student community will have a greater degree of trust and support for you. Despite that, I will still award 5 points for this impact.", "q0r": 5, "q1": "Putting together your proposal will take you five months, after which you can still submit an application for funding in the following fund. I believe that the goal that your community will have fifty members after five months is attainable, and I also believe that this is a really reasonable number that is not difficult to achieve. It is clear, based on the preparation and planning that you put into the proposal, that you have given this endeavor a lot of attention and care. Your team is made up of three people, two of whom are students in their third year (which makes you very young), and neither of you has any accomplishments to speak of, nor have you mentioned that you have come to Blockchain with Cardano at any point in time. But that's only a small portion of it; you're still learning, and I suggest that you find someone who has extensive knowledge of the Cardano ecosystem for guidance and follow-up. That's all there is to it. They are soon to be successful and able to gain a lot of insight from those who came before them. The price of $6,500 is a reasonable amount; it's not very much, and I hope that the community will be able to assist you in some way, so that the remaining students will have the opportunity to learn more about Cardano. The feasibility receives four points from me.", "q1r": 4, "q2": "You mentioned that the measurement of the project's progress will be aggregated on Github and the Facebook page that you will set up in order to attract students. These two platforms will be used. I concur with you that if the project is successful, then a large number of students will be able to do PA, vPA, and Proposer, and possibly even serve as a standard model for other educational institutions. You mentioned earlier that there will be approximately 50 students participating in the community as a means of measuring the success of your project; however, in my opinion, each month is accompanied by a development path that should be used instead. In order to develop your project, you should compile a list of numbers, such as the following: the number of people who follow the page after one month; the number of people who interact on other channels; the number that is closest to that; the number after two months; the number after three months; the number after four months; and finally, what it will be like. In the end, however, I also sincerely hope that your project will be a success and will receive funding. As a result, I will award this auditability with four points.", "q2r": 4, "assessor": "z_assessor_3497", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13387, "q0": "The solution to provide and exchange information about Catalyst is not new in Vietnam, but connecting via the Facebook platform is a seemingly simple thing, but this is the first time I see it in this Catalyst, your group includes 3 members are information technology students, so I see that you have boldly written proposals, and this proposal is of course perfectly suitable for the challenge.\nIn Vietnam there is a proverb: \"học thầy không tày học bạn\" so creating a level playing field between students and you instructing them on participating in Catalyst to act as a proposal evaluator (PA) ), becoming a veteran proposal reviewer (vPA), how to write and submit proposals to Catalyst and share Cardano knowledge is extremely practical contributions to the expansion of the Cardano network in Vietnam and the main goal As enthusiastic young students, I look forward to seeing your project funded.", "q0r": 4, "q1": "You guys have a detailed and specific roadmap for your action plan for more than 4 months, in each month there are specific small jobs, which I see the 2nd month is you creating websites, This shows the seriousness in executing the project.\nI see you write in the proposal to do Front-End and Back-end interface, then I think you are programming to build a Website from a certain language such as PHP and using JavaScrip, HTML, CSS will be very complicated and time-consuming, I have a small suggestion as to why you don't try to build a Website on WordPress platform, I find it very easy to build and develop, I personally have some blogs on this platform, so from my little experience you just need to:\n - Buy a domain name at namesilo, the cost is very cheap, only about $ 10 / domain name\n - Buy hosting to store data at azdigi, this is a company in Vietnam that has a pretty good server service, the cost is also quite attractive.\n - Buy more themes for the web if needed, install SSL and just install other necessary plugins, you have a website running smoothly\nAnd with information technology experience like 3rd-year students, creating a website probably only takes 2-3 days or faster.\nThe costs have been broken down by you and it sounds reasonable with the work items as well as the reward for the members participating in the game", "q1r": 4, "q2": "This proposal of yours is not heavy on technical factors, so there are not many barriers, and the information provided as well as the KPIs is enough to evaluate the success of the proposal.\nI wish you success and increasingly expand your model to all universities in Vietnam if possible, it can be a fresh wave for young people who are passionate about technology and especially blockchain as well as the path that Cardano's Catalyst has led you.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "Our solution is to create a community with one purpose: to provide and exchange information about Catalyst based on Facebook's main platform for Vietnamese students.", "experience": "The team of 3 third-year students, majoring in information technology, at the University of Transport. Has won numerous scholarships and has basic experience in team/community management, public speaking, and experience designing and building a complete website."}