{"id": 418881, "author": "marcus.puchalla", "title": "Translate Eternl", "url": "https://cardano.ideascale.com/a/dtd/418881-48088", "category": 26602, "amount": 46000, "description": "Without support for Asian languages in Eternl, we exclude ~1.45b non-English speakers from the Cardano system. While Asia accounts for 52% of global growth in tech-company revenues in the last decade.", "f6_no_assessments": 12, "f6_rating": 3.7500000000000004, "videos": [], "media": [], "f6_assessments": [{"id": 4470, "q0": "The Eternl wallet is a highly-rated light wallet (4.9/5 stars on the Chrome web store) that provides rich DApp browser and NFT-capable functionality and is therefore often used by many popular Cardano applications, for example the Minswap and Wingriders DEX or the Cardahub NFT marketplace. By including support for 6 Asian languages (Mandarin and Cantonese Chinese, Japanese and Korean, Thai and Vietnamese), user confidence in East Asia could receive a boost as non-English speaking users would no longer have to rely on Youtube tutorials where to click and how to navigate its front-end. More broadly, local language support for Cardano wallets, which is currently non-existent, could open up an entirely new demographic for DApp adoption, as users currently intimated by “foreign” looking applications could be persuaded more easily to “give it a go” when combining local-language DApps with local-language wallet support. It is in my opinion easy to underestimate the potential impact this seemingly simple task may have on the number of Cardano wallets and the use of ADA as a whole, given the large size of the target markets (i.e. China, East Asia and Southeast Asia where these 6 languages are widely spoken or understood) and the rapid adoption other technologies provided in local languages have enjoyed - QR code payments in China or trading of in-game items in Korea just as examples. Therefore, I agree strongly that this proposal addresses the challenge setting well and has potentially large impact. It is currently possible to use automatic translation using Google Chrome (right-clicking anywhere inside the in-browser Eternl extension), but the Google translation is quite poor and does not work in other browsers or on all devices.", "q0r": 5, "q1": "The proposers are upfront in stating that they do not have any of the language skills required to translate the Eternl wallet into 6 Asian languages. Given the sufficient budgeting for external translation and connecting with community members that are native speakers of these languages for \"quality control\" and crypto- or Cardano-specific language make it highly likely that the project can be carried out successfully within 6 months after the launch of Eternl v2. As the success of this proposal is contingent on the launch of the v2 Update, it would have been helpful to elaborate the timeline and risk factors of this release within the scope of this proposal.\n\nThe Tastenkunst GmbH team behind Eternl have an impressive depth of development know-how and their existing, highly popular live wallet speaks for itself. I therefore agree strongly that the skills, experience and track record make the successful implementation highly likely.", "q1r": 5, "q2": "With 3 sentences and 36 words in total over the three sections of the Auditability category, this otherwise excellent proposal falls short by lacking details on how its progress or success can be assessed by the community or auditors. The overall impression of this proposal would benefit greatly from KPIs, roadmap and milestones. I understand that the proposers are highly respectable and have a successful working product, but it would be fairer to new proposers and less well-known teams if the same rules for transparency and auditability applied equally to all teams requesting Catalyst funding.\nSome aspects of milestones are mentioned in the Feasibility category, but are contingent on the successful launch of v2 of the Eternl wallet and should have been matched with suitable performance metrics and a timeline allowing the auditability of the project.\nI am not a \"stickler for rules\" and think that confidence in progress tracking could be instilled by for example providing a Project Stage Diagram anywhere in the proposal, or elaborating where dialogue with the translating community members is taking place and will be formalized, so that curious community members could check on the exchange and gain an understanding of the implementation process. Sadly, none of this is currently present, and I highly recommend the team (which I respect very much) to address these issues in future proposals.", "q2r": 2, "assessor": "z_assessor_2554", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1515, "q0": "Eternl is a light wallet client in Cardano. This proposal aligned with the challenge problem, as it will increase user adoption in East Asia. They will add language support for 6 languages. As for future sustainability plan, I don’t see they are discussing it (they’ve only mentioned further language support for another continent). Funding for language translation needs a sustainable solution as it will grow overtime and maintained. Other than that, language support will bring a great user adoption within countries that doesn’t speak english, especially in East Asia, as it is the majority of the world population.", "q0r": 4, "q1": "The project have proven itself to be able to deliver into the market, as the wallet is being widely used in the Cardano community. Although I have no doubt that they will deliver this proposal, this proposal doesn’t provide detail about their team. They’ve only mention Tastenkunst GmbH company but didn’t have any information about their team experience. Some LinkedIn profile would be great, as it will show us who will work on this project. The budget is lacking in details. A good example would be to include work-hour and salary rate for each developer, like what the proposer already did with translation budget breakdown for each word. For the roadmap, I don’t see any precise date of timeline. They said it will be 3 to 6 months after the Eternl V2 release, and I assume Eternl V2 will be finished in 6 month after Fund 9 (?). With that consideration, for Feasibility stand-point unfortunately I have to give it 2 out of 5, since there’s lack of roadmap, minimum information on the team, and lack of budget breakdowns. Since I really like this project, I will gladly help the proposer in the next Fund to write a better proposal.", "q1r": 2, "q2": "As I mentioned before, there’s still lack of roadmap detail. For the metrics, they could further explain it in detail on how the 6 language target would be reached (first month: 1 language, third month: 4 language, sixth month: 6 languages). For the ease of checking its progress, they have an active Twitter account to give an update, and also their Discord server. However, I still have to give it a 2 out of 5 since it’s still lacking of roadmap, KPIs and metrics, and target goals. The reason why this is important is so that the community could check if the progress met the expectation.", "q2r": 2, "assessor": "z_assessor_2255", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1790, "q0": "This proposal offers to translate the Eternl wallet from English into 6 Asian languages. In this way the author hopes to facilitate access to this wallet for 1.45 billion non-English speaking users. The 6 target languages are Mandarin, Cantonese, Tahu, Vietnamese, Japanese and Korean. This translation project effectively addresses the Grow East Asia, Grow Cardano challenge.", "q0r": 5, "q1": "The author is the original publisher of the Eternl application, and multi-language support is planned for version 2 of the application. By surrounding itself with a professional translation service, there is no doubt that the team will manage to translate the application into the 6 languages targeted, it is a much simpler development than the development of a wallet.\nA correct level of details about the translation budget is provided, with an estimate based on the number of words to be translated (22000), leading to a cost of 6000USD per language.\nThe main risk mentioned is the fact that this proposal assumes the successful development of version 2 of Eternl, and also the fact that no member from East Asia is currently part of the team.\nFor these reasons I agree the proposed plans and budget seem feasible to deliver.", "q1r": 4, "q2": "Success is well defined by the implementation of 6 asian languages in Eternl V2. A public discord channel is listed where EternlWallet could provide updates on the project development. By this mean, the community will be probably be able to track the progress of the project, but this is not precised in the proposal.", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 1840, "q0": "This proposal addresses the challenge by having inclusive support to the East Asia community by adding multilingual on Eternl wallet. The Cardano ecosystem will benefit from this by attracting East Asia’s languages to ease the process and understanding of using a wallet. This will have a global impact when more users can use a wallet in their preferred language. Hence, by having this function built in Eternl wallet do have the ability to scale around the world. The proposal has listed the risk of this project is dependent on the success of the Eternl wallet V2. In my view, many people in the Cardano community have used or heard about Eternl and the progress of Eternl wallet have been doing well. ", "q0r": 4, "q1": "Since this proposal is highly dependent on the success of Eternl wallet V2, the milestone given is vague and the timeline to complete the project only after Eternl wallet V2 is released. This is another risk that this proposal has as there is no proper timeline given and it will be difficult to audit once they received the funds. The budget requested for the translation cost is justifiable as I have checked the average cost per word globally is within the range quoted/stated in the proposal. The team, Tastenkunst GmbH, for this proposal is not shared. There were no links, LinkedIn profiles or the number of people behind the team which affects the score on the feasibility section. Furthermore, they have not found any East Asian translators yet and rely on the community to help on translating into the 6 languages. On the other hand, this does increase the participation of the Cardano community and Catalyst teams with East Asian residents.", "q1r": 3, "q2": "As I have listed the risks in feasibility section, it is difficult to audit the progress of this proposal as it highly depends on the Eternl wallet V2 release. The community cannot properly track the progress for this proposal unless they monitor the progress of Eternl wallet V2. The community can only audit once there is multilingual in Eternl wallet V2. Suggestion 1) to share publicly who will be the translator working on this proposal 2) sharing their experience in translating 3) have another third-party translator to audit on the translators’ work 3) constant update (weekl/bi-weekly/monthly) about the progress of the translations to the community and publicly share them 4) Lastly, the team can create a metric of how many users use the translated version of their wallet. This metric make sense as it is a measure of how successful executing this proposal.", "q2r": 2, "assessor": "z_assessor_2274", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1924, "q0": "With Eternl (previously ccvault) became one of the community wallet favorites for quite some time and set the bar how a light wallet that the community like, happy to see the proposer is trying to reach the East Asia Cardano community through a multi-language approach. This surely will help the adoption and bring 1st hand experience exploring how blockchain space in daily life. This proposal is align with the campaign goals and surely will trigger collaboration through East Asia community.", "q0r": 5, "q1": "The proposer shares relevant experience and links to the eternl team which is satisfying and needed to implement this project successfully. \n\nThe budget was outlined clearly and broken down for easier assessment, the $0,135/word is within the market range and acceptable. Unfortunately, with $6,000/language and the proposer's intent to do 6 languages, the total budget requested will be about ~18% of the total challenge budget, which is on the high side. If the proposer can split this proposal in half or a total of around $25k by doing lesser language on phase 1 (maybe 2 or 3 languages) it would be more acceptable. I would suggest the proposer do some early research to find which language is become a priority.\n\nAs for timetable and milestones, understand that the proposer cannot give a fixed timetable but focusing on iterations and not rush to release their v2. As an assessor, this is difficult to assess, and would suggest the proposer modify the proposal and start with 1 or 2 languages first with a reasonable timetable. Secondly, I would recommend if possible creating a crypto wallet glossary that is open source - free to use by other community wallets - focusing on the East Asian language - so we can have a common standard language to prepare the crypto adoption in the coming years and larger community contribution.", "q1r": 4, "q2": "As for auditability, the proposer, unfortunately, does not share a detailed milestone or how the community can track the progress - with a clear target to finish all 6 languages but with no timeline given it is hard to assess this proposal. As mentioned before, I would suggest adding a rough timeline with room for flexibility/language and starts from there.", "q2r": 3, "assessor": "z_assessor_2289", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5159, "q0": "The proposal wants to add 6 Asian languages support to the eternl v2, with the help of community and professional translators. The impact of enabling billions of non-English speaking users to use eternl is huge. As the project is simple, the proposal is concise and very straightforward. However, some parts of the proposal need more detailed information, such as the timelines, background of proposers, and auditability. Because of the simple nature of the project and the proposers is from Tastenkunst GmbH employees themselves, the chance of the project failing to be delivered is very low.", "q0r": 5, "q1": "The proposal does not provides a detailed timelines of how the translated version will be released. The proposal can state estimation date of UI that enable users and translators to translate eternl, and eventually the final version, rather than only giving 3 to 6 months estimation after eternl v2 release date (which also not provided). The budget breakdown provided is specific, 22000 word translated that cost 6K$, times 6 languages totaling 36k$, plus 10000 developer cost. However, it can be better if proposers also provides developer cost per hours, so the community can determine if the cost is reasonable or not. The proposal does not provide any personal information of the core team member, even though the proposers are Tastenkunst GmbH employees, it still better if the proposers also provide core team information.", "q1r": 3, "q2": "The proposal doesn’t provide a clear way of how the community can track project progress. It will be better if proposers add a periodical report or MVP of the translated version of Eternl along the way, so the community can know how far the project is. As the project is relatively simple, the defined success is straightforward, all 6 proposed languages are available on Eternl.", "q2r": 4, "assessor": "z_assessor_2675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 7418, "q0": "The proposal is very focused and has convincing data, Asia in general and East Asia in particular is a young, very dynamic continent that is developing at an amazing speed. The removal of the language barrier would be a big step forward. This proposal is successful will add value to the Cardano ecosystem a lot. I see the team mentioned Eternl V1, I think it's the first version of the project. Is this right? If yes, please provide more link for my reference. The team has chosen to develop 6 languages with high population density in East Asia, with great interest in blockchain and Cardano in particular. However, in the context of possible risks, the group does not have members from East Asia, so what criteria does the group have to select members from the community? To ensure accurate, timely and fast translation. I think point 4 would be consistent with what you have presented", "q0r": 4, "q1": "As for the $46,000 funding, which is ~18.5% of the entire Challenge, for community approval and Catalyst disbursement, I think you should be more detailed and specific about the roadmap. For example, in the first month, what will you focus on, and how much will it cost? How long does it take you to complete a language? How long does it take to complete this proposal?\nYou should specify how many members the team includes, how many developers and how many translators you intend to need from the community. At the same time, it is recommended to provide a link to the member's social network for the community to consult and exchange. I can only give 3 on this part\n", "q1r": 3, "q2": "Each new language introduced will measure the progress of the project, which is very intuitive and I support it. However, about the detailed steps when doing it, do you have any other quantifications? For example, the number of members translating from the community? Selection criteria… And do you have any public channels to update the project progress as well as the results of completing the steps? I hope that helped give you some ideas. In this section, I rate 3", "q2r": 3, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8018, "q0": "Eternl is a Carano light wallet that allows you to send and receive Ada and native tokens. There is also an Eternl browser extension that is especially suitable for CNFT collectors. Currently there is no support for Asian languages. As a result, 1.45b non-English speaking people are excluded from the cardano ecosystem. Thus, this problem identifies a clear problem within the challenge that needs to be solved. This proposal will clearly add value to the Cardano ecosystem as it will give many people access to this system. (Mandarin, Korean,Japanese, Cantonese,Thai, Vietnamese) The risks are included. I think it would be interesting to actively look for people who speak these languages. This way it can be checked that no errors have been recorded.", "q0r": 4, "q1": "The proposal states that the team consists of employees of Tastenkunst GmbH and freelancers. It would be better to list the names and link to their relevant experience. This part is too limited. The proposal does state which team members are needed to carry out the project properly. The budget is clearly defined and seems sufficient to me. It would be helpful to include the hourly salary in the proposal. There may be a return for additional funding to add other languages. (African or Latin American languages) A ​​timetable is included. I think this could be a little clearer if it was worked out. For example, a monthly progress could be included. The intention is to implement the translations via the existing Eternl platform. The resources are included in the proposal. It is also good that an average price per word is included. Little is explained about the technical aspects. The challenges and risks are also included. It would be helpful if a few possible solutions were included. I think this project is definitely feasible.", "q1r": 4, "q2": "A very limited roadmap with milestones is available. It says that it will be very important to release Eternl v2 with at least 3 of the 6 languages proposed. The other languages will be included 3 to 6 months after release. It would be useful to include a deadline per language in the proposal. No clear KPIs are included. Any language added to Eternl will be used as progress of this project. I think it would be better to use more KPIs. For example, you can open how many people from the suggested languages use the platform. This way it can be seen that the translations are actually used. There is a clear language problem that needs to be solved. By offering these 6 languages in eternl, a large part of the problem will be solved. By including more translations later, the problem will get smaller and smaller.", "q2r": 3, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10437, "q0": "Eternl wallet is very popular and widely used in the cardano ecosystem. However, many people in Asia have difficulty with language. Therefore, it is difficult to use all the functions of the wallet. I think the proposal to translate the wallet into languages with a large cardano community in Asia is appropriate for the challenge's requirements. It will increase the interactivity with the cardano ecosystem in the Asian community. While using a wallet is not difficult anymore, it also contributes to attracting users to the cardano ecosystem.\n", "q0r": 5, "q1": "The proposal gave a reasonable solution. They chose languages that have a large community of Cardano lovers but often have difficulty using English. Their use of community checks for translation quality will make the translation more and more complete. The stages are not specifically divided, but they only give important milestones for development. Although they do not list details. I think the cost is reasonable\n", "q1r": 4, "q2": "Although there are no KPIs, it is possible to check the progress of the work through the timelines and the work completed at the end of each phase. Finished products in each stage can be announced in their media. However, I think the proposal should have KPIs for easy audit.\n", "q2r": 4, "assessor": "z_assessor_3186", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 11148, "q0": "The proposal fits the challenge \" Grow East Asia, Grow Cardano \" as it aims to support the translation of Eternl into 6 Asian languages, including Mandarin, Korean, Japanese, Cantonese, Thai and Vietnamese languages. With the upcoming overhaul and the development of Eternl v2, multi-language support would be a great improvement. This not only provides a better experience for users in Asia, but also serves as a solid springboard to attract new Asian users to the Cardano ecosystem once the language barrier is removed. Personally, I think this project has a great impact on the Cardano communities in Asia so I give this section 5 stars.", "q0r": 5, "q1": "I think the proposal should provide a little more information about the people who will be involved in the project more specifically, or at least the project manager. This is an important information because everyone needs more basis to evaluate the feasibility of the project. By providing this information in such a vague way, it will be difficult to reach and gain support from voters. The proponent provided a very easy to understand plan but it is undeniable that it is really detailed. Moreover, it's great that the proposal also provided the average cost per word translated and thus gives a detailed budget breakdown.  Although the proponent has foreseen the risks, there is no specific solution and depends too much on the associated project and community. Since Eternl still has a long way to go, I recommend that the team recruit more members from East Asia. In addition, the proposer should also consider market fluctuations as a risk, sliding ADA prices can lead to budget shortfalls. Therefore, the team should apply for a reserve fund or request more budget the following proposals.", "q1r": 3, "q2": "The proposal provided information about the roadmap, including the milestones, especially making it easy for everyone to see what this successful project will look like. The users just have to wait for the specific timelines that the proposal has provided and experience the languages ​​released on Eternl. In my opinion, this project does not have any difficulties in the audit stage.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11852, "q0": "The proposal has a clear background and purpose, and the problem presented is aligned with the challenge. To expand the user base in various countries, adding support for 6 Asian languages in Eternl v2 with the participation of community members will help grow Cardano ecosystem activities, especially in East Asia. \n\nThe translation user interface provides a solution for an accessible translating tool to add support for other languages planned in the future, although more information is needed regarding the planned features, user flow, and future development plans of the user interface to give a clearer image of the overall product, as this plays an important part in fulfilling this proposal’s goals. \n\nOverall, the proposal managed to offer a solution that will help the growth of user base of various countries, supported by the development of translation user interface that might help further language support plans in the future.", "q0r": 4, "q1": "Eternl is a well-known Cardano light wallet in the community, proving that the proposer team managed to deliver a reliable product, and competent enough to deliver further improvements to the product. \n\nThe proposal provides a brief explanation regarding the team, goals, and budget needed to do the project. However, the proposal lacks of details about their team members and experiences (Tastenkunst GmbH). The proposal should provide a company / team description, previous works, and details about the key members working in the project (LinkedIn / GitHub). A detailed timeline would also give a clearer vision of development time. For example, providing the release date plan of Eternl v2 and translation progress goals for each language in each months before and after the release of Eternl v2.\n\nThe proposal provides a reasonable budget, however, there’s no further details about the planned salary for team members and translations for each language. Providing salary rate, and detailed resource costs for development would provide a good budget breakdown. Proposers should also provide the information about the translation services they want to collaborate with and the translation rates for each language, considering the limited supply of professional translators for some particular languages, thus having a higher translation rates. Overall, the proposal should provide detailed information (budget breakdown, timetable, technical aspects) to provide a better proof that the proposal will be delivered smoothly.", "q1r": 2, "q2": "Eternl is a well-known product in Cardano community, with an active Twitter account and Discord group that can be used as a public channel to provide updates about the project. The success indicator is also stated, when 6 proposed languages got included in Eternl v2. However, it would be great if the proposal also provides a clearer roadmap and metrics for the project. For example, providing a “% translated” target for each language in each month might give a clear progress track while also encouraging community members to help contribute fulfilling that target. Overall, providing a clear progress checker for the community is important as they’re also plays a part to contribute in the project.", "q2r": 3, "assessor": "z_assessor_3296", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11942, "q0": "The project tries to grow Cardano’s Asia community by bringing idea of providing translation on eternl wallet, which will greatly impact by expanding user base in Asian countries, giving access of Eternl to proposed countries. They will also include community and professional translators which will implicitly access the community contribution in East Asia. The project is simple and concise enough, yet it would scale greatly as it opens access of Cardano for a new users and contributors from East Asia. There is also minimum risk of failure since the project will rely on the community feedback for mistakes in translation, without any assessed risk on development or deployment.", "q0r": 5, "q1": "The project is concise and simple, yet the proposal have not mentioned any timeline vision, which makes its development time is unclear, but with the mentioned milestone of developing 3 of 6 languages, it should be auditable as the project developed. The total of budget is also quite high, yet it is in a feasible number ($6000 per language), yet it could be improved by providing the more detailed per hour fee or the number of working people for the community to be able to assess the reasonability of project development time and development cost per manpower.\n\nThe proposal could also be improved by providing more explanation on the technical requirements or resources that will be used in the development, as it only mentions developing “special interface” and developing “language modules”.\n\nThe project will be developed by Tastenkunst GmbH employees and some freelancers, thus the risk of failing should be low, yet it could be improved by providing the contact or mentioning the proposed contributors for this project to make it more traceable.", "q1r": 4, "q2": "The auditability of the project is concise, by having each languages translation developed and deployed, it should be considered as progress for audit, and the finish line should be having the 6 languages translation being deployed on Eternl. The proposal should also include the reference towards the developers for more auditability. It also have not included any reference for community to trace the development, let say repository or any other way, making the way to know its progress per language development unclear.", "q2r": 4, "assessor": "z_assessor_3319", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Translate Eternl to 6 Asian languages with professional translation services and help from our community.", "experience": "Professional translation services will support the translation of Eternl into 6 Asian languages. In addition, several members of the community have already offered to help with translation into their respective languages."}