{"id": 421010, "author": "dimitri777", "title": "Cardano in Burmese", "url": "https://cardano.ideascale.com/a/dtd/421010-48088", "category": 26602, "amount": 11150, "description": "Lack of official Burmese content . Thus Burmese speakers cannot learn in their native language. There are 51 million speakers globally", "f6_no_assessments": 8, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 3830, "q0": "The Proposer has stated the problem clearly that Burmese speakers cannot learn in their native language and there is lack of official Burmese content. The proposer seeks to solve the problem by providing official Cardano documentation translated into videos in Burmese to educate their community in Sri Lanka about Cardano and the ecosystem. This proposal addressed the challenge by stating that they will prepare a group of people who are willing to contribute to the ecosystem. Proposer stated that the project will bring information to people in their local language that would attract more developers, which is part of the goals of Cardano in Fund9 to bring in more developers into the ecosystem. The project fits within the challenge because it seeks to bring people of Myanmar into the Cardano community, thus the project seeks to add value to the ecosystem by bringing in new community in India. \nMention is made of key metrics and goals as the number of subscribers to the LanCardano Youtube channel, the number of average views per video, number of comments per video and number of watching hours to be measured. All these mentioned key metrics fit into the challenge well. \nThe project also fits into the challenge by taking into consideration how it will scale to address future challenges by bringing in more content. The proposal meets Fund9 objectives because the project will enable more people to become empowered to contribute to the ecosystem and participate because they would have understood Cardano through the project work.\nThe proposer mentioned the risks associated with this proposal and how to mitigate the risks in detail, mentioning a few here as incidence of COVID variant causing lockdowns and absence of Master Translators due to illness. Mitigating factors were mentioned; among others is that they will have many Translators so that in case of illness they will have a replacement easily. \nWith all these factors, the challenge has been effectively addressed by this proposal.", "q0r": 5, "q1": "This proposer has laid out a comprehensive plan for the project. Mention is made of launching LanCardano Youtube Channel with 6 videos daily and a total of 10-20 videos at end of 3 months. They aim to bring out one translated video every 3 days, which is quite comprehensive. Proposer mentioned that the original videos will have a pace of 140 words per minute and that around 2 hours of content will be published per month. The timeline is quite reasonable. The proposer mentioned that in case of an emergency fund, they will request in Fund10 which is good for planning. The plan is detailed and clear by the facts provided.\nThe budget total of $11150 is reasonable and it is broken down comprehensively showing detailed cost for transcription, dubbing, editing, publishing, social media campaign, contingency fee and fees for Translators. The highest cost is allotted to Translators fees of $6650 which is more than 50% of the total budget and it is reasonable because translation content forms larger part of the work.\nThe team that is going to implement the project is made up of four experienced members with skills in marketing, translation, creative writing, entrepreneurship, etc. They are also Cardano community members who are CA/PAs, vPAs, Voters and active members in Town Halls, Circle and Challenge team. Linkedin references of the team members have been provided by the proposal for further referencing. The team is likely to implement the project successfully. The proposer mentioned that they are likely to ask for more support from Catalyst in future proposals, and the team has other proposals in other challenges as well.\nWith all the facts above, this proposal is highly likely to be implemented successfully.", "q1r": 5, "q2": "The proposal has provided a clear roadmap for the project. Mention was made of clear solutions to the project. This proposal mentioned that they will measure the progress of work by the number of followers to the LanCardano Youtube Channel, the number of average views per video, the number of watching hours, the number of comments, the number of shares and number of downloads. All these will make tracking of progress successful and lead to successful auditing. \nThe project's success will be seen in the awareness created in Cardano in the Burmese speaking community and thereby bringing in more new members into the ecosystem. Mention was made that they will continue to build the channel in future funds and grow the ecosystem. All these ensured that the objectives are clear and can be audited easily. \nThe proposal is new and SDG rating provided fit the proposal. \nThe information provided is sufficient to audit the progress and the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "This is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 2024, "q0": "This proposal intention is to extinguish the language barrier existent between ADA content and Burmese, which has a 40M people speaking it as mother tong (https://www.worlddata.info/languages/burmese.php). To address this problem the proposer will translate official ADA content, creating dubbed videos.\n\n\nBy diminishing the language barriers, it adds value to ADA ecosystem because it will reach a part of the world population that had no entries in it. Therefore, since ADA aims to be the world used blockchain, it must have content in every language, promoting knowledge and encouraging people to use it. Therefore, the proposal align with this challenge. \n\nA point that should be mentioned is that this proposal’s bottleneck is the quantity of translating material that the translators can manage. Therefore, in order to scale it is good to have lots of translators involved in this proposal in the future.\n\n\nThe goal of this proposal is reach every Burmese speaker, which also aligns with the aim of reaching the maximum people as possible of ADA.\n", "q0r": 4, "q1": "Unfortunately the proposal roadmap is confuse. It does not have a exact quantity of videos per month, therefore it makes hard to evaluate the possibility of being done or what to expect.\n\n\nThe budget is clear, reveling the experience that the team have. It gives clue of how much they can produce and the time length of the content proposed.\n\n\nThe risks are well defined and the mitigation is also explained. However, there is a huge risk that must be taken into account which is the choice of the content. Since the team will be responsible to choose the videos, it might happen a poor choice. Therefore, maybe creating a more interactive profile and make the viewers choose the content might mitigate this risk and have the possibility of creating more engagement in the Channel – which creates more awareness and monetization possibility. Another possibility is add a hashtag for specifics content and then measure which is the winner.\n\n\nIt was provided the team LinkedIn links exposing the experience. However, there is not a specific marketing member, which would be good to include since the aim is having lots of viewers.\n\n\nAs mentioned, the bottleneck of this proposal is the quantity of content managed by the translators, therefore, in order to scale and add more platforms to diffuse content, it’ll need to hire more translators (since it’s a mechanical project)\n\nThat being said, the proposal has a high probability of being done and, if managed the raised risks there is a high probability of success.\n", "q1r": 3, "q2": "\nIt is quite easy to know if the video was uploaded in YT, however this proposal is missing a method to verify the in between implementation. Maybe creating a Instagram profile to communicate daily with the followers, creating content and interacting with them, showing the making off process. Maybe using this would increase the engagement.\n\n\nAnother noted point is the lack of details in the timetable, which makes hard to know what to expect.\n\nThe KPIs provided are related with number os views, hours watched, comments etc, which is sufficient to measure progress.\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "There are some points which indicate the assessor is not that clear, because he says our roadmap is not clearly laid out but it has been given in detail. Also he says theres no marketing specialist but i have been listed as the marketing specialist plus we have an external partner who handles our social media marketing for indian subcontinent work as well as other langauges with different SM partmers. but its not that serious to be filtered out."}, {"id": 5803, "q0": "Yes, This project effectively addresses the challenge by translating Cardano Content into Burmese for native speakers in east Asia. Only 7% of the worlds population speaks English so it would be beneficial for Cardano to competently translate relevant materials. This project would produce highly educational content for the east Asian county of Burma, and native speakers of Burmese. This proposal calculates the minutes translated per hour and gives exact quotes and figures. Will be able to get a lot of work done that will benefit Asia. ", "q0r": 5, "q1": "The experience of the proposer suggests that they are very capable of successfully implementing this proposal if funded. The plan has been meticulously laid out to include detailed timeline of important accomplishments and milestones. The plan lays out it intentions to translate IOHK open source media into the language of Burmese. This is an efficient approach to translating already available professionally produced content. This plan is very likely to succeed and to be implemented based on the plan presented.  ", "q1r": 5, "q2": "This proposal has clearly defined goals and metrics for auditability. The progress can be measured via publicly available information on YouTube to see view counts, and also of the Cardano foundation public channels. This proposal meets all requirements and gets a perfect 5 stars in this section because of the clarity of the proposal. The Information provided therefore is sufficient to audit this proposal. ", "q2r": 5, "assessor": "z_assessor_2751", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "This is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 7736, "q0": "They have the best idea for this CHALLENGE, in my opinion. Due to the Cardano Project's lack of official Burmese material. Therefore, Burmese speakers are unable to learn in their own language. Because they now UNDERSTAND and have resources in a language they ARE COMFORTABLE WITH, this approach will empower many people who would not otherwise be able to join and contribute to the ecosystem.", "q0r": 5, "q1": "The only challenges and risks relevant to a successful implementation would be another Covid variant causing lockdowns and the possibility that Master Translators would be unable to work due to illness. However, given the plan presented, it is highly likely that this proposal will be implemented successfully. However, if they were to overcome this difficulty, they would have a large pool of backup Master Translators who could take over the workload in the event of an illness.", "q1r": 5, "q2": "The information given is adequate to assess the proposal's success and progress. Since there are currently hardly any Indians in the Catalyst ecosystem, this proposal demonstrates clearly how it would enhance the Cardano System by integrating a brand-new community. It would be beneficial for the 51 million Burmese speakers to have access to this ecosystem, as well as to Blockchain technology and cryptocurrencies.", "q2r": 5, "assessor": "z_assessor_2916", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "This is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 8366, "q0": "Teaching in local languages promotes an educational principle of moving from known to unknown so that a people can link the old with the new knowledge. Local languages promote and develop a sense of belong among citizens as there will be a feeling of closeness with one language. As many of the people might not know English and would be familiar in their local language can also get the knowledge of blockchain and Cardano by this proposal. As there are 51 million Burmese speaking people globally they will be educated about Cardano through this translation which will inturn get more users to cardano system and will increase its value and credibility. The proposal is able to scale for future challenges as this can be translated into many other local languages and benefit people worldwide.", "q0r": 5, "q1": "The proposer and his team are well experienced with a experience of more than 20+ years on average in translating and languages which is more than sufficient to implement this proposal. The proposer could have attached few relevant links to provide evidence to the proposal. The budget is outlined clearly and has been broken down into identifiable items which is reasonable to implement this proposal and also provides a realistic time to complete this proposal and is well planned and this proposal is most likely to be successful and will benefit a large community of Burmese speaking people. Considering the experience of the team members they possess necessary resources required to successfully implement this project. The proposer has also provided key metrics and SDG ratings to support their proposal and is most like to be implemented successfully.", "q1r": 4, "q2": "The proposer is well aware of the implementation of the proposal and has laid out a realistic roadmap to achieve the goal and the progress of the proposal can be audited from time to time. By the given experience and the realistic roadmap to complete this proposal the provided information is sufficient to audit the progress and the success of the proposal. The proposer has a clear understanding of the proposal as many of the people worldwide do not speak English and many of them prefer to learn in their native language which is easier for them to understand the concepts and gain more knowledge through these translations and proposer has done a very good job of providing a feasible solution to the addressed problem. ", "q2r": 4, "assessor": "z_assessor_2976", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "This is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 8415, "q0": "It can be seen that the proposer lives in Sri Lanka and there are many Burmese people there who need to get education about cardano. The problem presented is well explained along with the solution by providing burmese language to attract more cardano blockchain users which hopefully there will also be a new cardano developer and community, not only from sri lanka but also all Burmese-speaking people around the world. In the explanation of the main risks and their mitigation, improvements still need to be made, for example by inviting more people who can speak Burmese and teaching them about cardano in general so that they can help create dubbing content in Burmese or find contact with friends in Myanmar / Burma so they can collaborate better. We can also take advantage of automatic translation from YouTube to Burmese. And regarding the conversion of ADA to fiat, I think it would be better to pay in ADA instead of exchanging it on p2p binance, so that contributors can adapt to ADA and its ecosystem.", "q0r": 4, "q1": "The project work process is described in detail with a time schedule of 3 months along with the budget and work team. In general, the team is very experienced in translating content and has experience with many languages, but it doesn't seem to be clear that there are Burmese experts, which are called only tamil and sinhala. But the team will of course coordinate the general work of the project and collaborate with all who can accomplish the goal of content in Burmese. It would be nice if in this session the topics that would be used as dubbing content were explained, starting from the introduction of cardano to the target for all those who speak Burmese to be able to adapt to cardano. And all work is made to focus more on translation into Burmese. The costs are also explained in detail which of course has become the standard in Sri Lanka in creating translated content like this.", "q1r": 4, "q2": "The roadmap is clearly explained and all video transcripts will also be published on the cardano forums. The results of the work will be YouTube content which of course can be accessed at any time and makes it easier for people who speak Burmese to search. The KPI metric chosen will certainly be a good indicator to evaluate the work. It's a good idea for example to join more IT groups or communities that speak Burmese for content dissemination and introduce cardano to them.", "q2r": 4, "assessor": "z_assessor_2982", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "This is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 8472, "q0": "The idea has the ability to dramatically boost the amount of awareness that Burmese speakers already have of the Cardano ecosystem by presenting them with videos that have been translated into their language. According to the author, there are more than 51 million individuals living in different parts of the world who are able to communicate in Burmese, which is a significant number. Through the translation of documentation and the production of content videos geared toward Burmese speakers, the proposal will make it easier for the Burmese-speaking population to have access to Cardano-related material. In addition, the idea will make it possible for a huge number of new people who have quite diverse points of view to join the community. This will bring about a richer diversity of perspectives.\nThe author has offered a strategy to problem-solving that is clearly defined and intends to give a solution that will last for the long run. The author has also scaled with future difficulties and the Burmese community on the Cardano ecosystem. The author believes that understanding blockchain fundamentals would assist everyone in this region develop better applications. In addition to this, they discuss the potential risks that may arise, as well as some potential responses to these risks, while drawing attention to the difficulty of the situation from a legal standpoint.\nIn general, the goals of the project correspond to the level of complexity of the tasks that need to be completed. It is also a project that is capable of being scaled up, and it may offer Cardano with benefits on a worldwide scale if it is successful.", "q0r": 5, "q1": "The proposal provides a thorough timeline and output, including the expected number of translated videos every month and the typical duration of each video.\nTeam members gave information that was both accessible and credible, and they even included links to their LinkedIn pages. The authors have more than three decades of experience interpreting official papers for the Ministry of Languages, in addition to their prior work with the Sri Lanka Broadcasting Corporation. In addition, they have a background in software engineering. These applicants have the experience and training that gives me confidence in their ability to translate documents and create videos with relevant material for the Burmese community. Also, the budget is set down extremely well, including fees for things like translation, social media marketing, and a contingency fee.\nHowever, I think there are a few points of information that need further information. First, I'd want to learn more about the core of video's subject matters so that the Cardano community can determine whether or not its viewers have a decent understanding of Cardano ecosystem. Second, there's a deficit of publicly available data on how effective certain marketing strategies actually are at drawing in customers.\nWhen additional information is provided, the plan's feasibility increases.", "q1r": 4, "q2": "In order to permit more precise tracking of progress over the course of three months, the proposer offers a comprehensive road map that outlines the many milestones that need to be achieved. The metrics that are going to be tracked make sense when it comes to evaluating interaction on YouTube, which is a good component that should be measured.\nConcerning the question of what the indication of success will appear to be, I believe that it would be more helpful to determine the level of success by first establishing a particular goal to achieve, such as an increase of one thousand members in the Burmese Cardano community; ten proposals submitted by the Khmer community;...\nIn conclusion, if this project receives funding, I am confident that the initiative will be a great success. It will have a positive influence, bringing Cardano to the attention of a greater number of individuals.", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "This is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 11397, "q0": "Cardano is an amazing blockchain technology that is the face of a secure and sustainable blockchain with ground breaking use cases. Cardano is capable of redistributing power from unaccountable structures to margins. Cardano can use new advancements done throughout the years including, security, sustainability, and multiple layer architectures to develop versatility. Cardano earned a quick continuing in the crypto space because of its advancements in languages and plan . As there is no content of it in Burmese language the speakers are not able to learn language. Translated content from cardano documentation in Burmese language helps them. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The plan in the feasibility part includes launching videos in LanCardano YouTube channel and adding new content to it. Creating videos taken from cardano documentation and translating them . This plan is acceptable and proper timeline is also mentioned clearly. The budget is reasonable and outlined clearly and broken down feasibly. The people working with the project is a former general ADA holder in catalyst circle V3 and founder of South Asian town hall. He is also a serial entrepreneur and marketer by profession which is very impressive. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The metrics provided clearly align with proposal goal and timeline, it surely address the challenge requirements. The roadmap given is doable and achievable. Milestones include checking published videos through YouTube channels. The roadmap is given in 3 months having complete transaction and production of output videos and launching channels. The metrics includes number of views, watching hours, comments , shares and downloads. Bu creating the awareness and interest in Burmese speaking community to become more aware of Cardano project and developer pool. Bringing new proposers and new members to the community the success of the project can be achieved easily. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "This is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}], "solution": "Provide translated content taken from official Cardano documentation in the form of Burmese videos about Cardano ecosystem.", "experience": "Answer\n1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n1995 to 2022 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\nOver 30 years experience in Ministry of Languages as Official Languages translator."}