{"id": 421124, "author": "cardano4climate", "title": "Cardano4Climate East Asia", "url": "https://cardano.ideascale.com/a/dtd/421124-48088", "category": 26602, "amount": 15400, "description": "While climate change is an increasing risk for East Asia today there is no specific community platform supporting initiatives to promote climate resilience into everyday activities", "f6_no_assessments": 7, "f6_rating": 4.523809523809524, "videos": [], "media": [], "f6_assessments": [{"id": 2946, "q0": "I think this proposal aligns with the challenge's goal of creating a concrete community platform that supports initiatives that promote climate resilience into everyday activities. The proposal identifies many of the issues in the challenge, and those issues have far-reaching implications in the future. At the same time, it is also possible to identify solutions for the risks that will occur when the implementation begins.", "q0r": 5, "q1": "The group outlined the main activities plan and specific roadmap, the budget allocation is quite reasonable, but it would be nice to be more detailed about the expenses. The original team leaders are experienced and skilled people. The Cardano4Climate Global Center and East Asia City Hall provide operational support and coordination that will increase the viability of the project.", "q1r": 4, "q2": "The proposal provides key KPIs to measure project progress. Monthly events, weekly meetups and planning meetings will be posted to the web and youtube channel as an information that increases the transparency of the proposal. The team also provided specific numbers to measure the success of the project.", "q2r": 5, "assessor": "z_assessor_2365", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3477, "q0": "Starting a hub dedicated for climate change issues in East Asia makes a lot of sense, considering the number of industries and people located there. its time-zone and culutural differences and languages. In other to resolve this problem globally, local solutions need to be adopted in a coordinated manner. Cardano 4 Climate is an already exsiting organization/hub who clearly exposed in the proposal what they have been doing in the past months and how they operate. Therefore, I think this idea is valid and fits well the challenge, as it will incetivize the development of solutions in East Asia, focused in climate change subject.\nAs suggestions, it would be nice to see here some general numgers YTD on C4C work globally as number of projects they supported, number of people they onboarded and what impact they maneged to do so far. some exampales of initatives they intend to support and incentivate could also be provided to make it more tangible.\nAll in all, I toally agree with the relevance of this proposal for the challenge and for Cardano. Sutainable iniatives should always be incentivized and this topic has been growing in importance more and more in all layers of society.", "q0r": 5, "q1": "A sensible plan is provided with good level of description on the actvities. In the plan, it is already considered all the meetups and the preparation necessary, including research and guidelined development. However, its important to highlight that a full plan for the hub still is to be developed (October activity).\nBudget breakdown is fair and considers all project scope. The amount of hours for some budget lines are provided and link for a treasury guide is also available.\nAs for the team, it will be supported by C4C global but will have a dedicated team. The descriptions for the 2 initial leaders is provided and with links for reference. their competences seems good for the project, however, none of them seems to have any experience with projects in this region (at least thats not mentioned). I think this would be imporant mostly because of cultural possile language barries. They intend to bounty new leaders as project advance, which makes sense, but it would be good to have someone from the region since day 1.\nAll in all, I agree that project is feasible but considering my plan and team comments above, I'll rate as 4", "q1r": 4, "q2": "Overal, project seems transparent as several good kpis are proposed, feedbacks are considered and the meetings will be recorded and uploaded online and there'll a github so everyone will be able to have access to al information. Some of these kpis already have some targets, which is really good.\nAs further suggestions, there could be a way to measure the impact on climate  in a more quantitative way. For example, it could be measured how much CO2 eq/y the pipeline of projects supported by this iniative have. Or the amount of energy the projects are reducing. However, this suggestion would proably apply better in a later stage, after implemented and running succesfully. My rate is 5.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 3831, "q0": "The proposer wants to build a nature-based solution to support climate related initiatives that have been built on the Cardano blockchain , with joint collaboration between East Asia Townhall and Cardano4Climate.\nThe problem statement is clear and concise. \nCardano4Climate already has over 300 members on its global platform. \nTheir aim is to combine the evolving Cardano blockchain  technology with solutions and models for climate change action, and make the needed change now and for decades in the future. The Asian community is also impacted. \nThe challenge is about preparing Asia for Cardano wide scale adoption into the future. Addressing the challenge in this proposal, the Proposer has made mention that Cardano should take the lead in developing solutions to problems that threaten the health and well being of the Asian community, to make the world better for all. \nA community hub will connect blockchain Dapps and technology to local agriculture supply chains, green energy, nature conservation, etc.; traceability of resources and real, measurable impact will be promoted to both internal and external organizations.\nUsing Cardano Dapps to solve the climate issues will promote Cardano to a wider scale, thereby effectively addressing the challenge.\nThe proposal has stated some risks and mitigation measures for the project. To mention one, Asia is large and has diverse culture, languages and localized issues. So effective collaboration will help mitigate this risk.\nThis proposal has addressed the challenge very well so my rating is 5 stars.", "q0r": 5, "q1": "This proposal has outlined a detailed plan showing key activities to be undertaken, a comprehensive roadmap and detailed deliverables for successful implementation of the project. \nSome of the key activities are - participation in bi-weekly East Asia Townhall to promote climate related issues; weekly one hour meetups to promote certain topics or support activities; Coordination with other C4C hubs; Research and information gathering, etc., among others.\nThe project, as indicated in the proposal, will start from September 2022 and end in 12 months. It has weekly meetups, and all monthly activities laid out well.\nThe deliverables include 16 townhalls and ATH 16 hours; Hub plan and Database initiatives, to mention a few.\nThe budget total request is $15400 which is reasonable. The breakdown is understandable and done in order. Costs have been budgetted to cater for Hub coordination, event participation, promotional activities, translation, etc. The highest cost of $8000 is allotted to Hub Coordination for 4 months for 2 or more people.\nThe team is made up of members of the Cardano4climate global hub, and a dedicated team. However, team leaders include Dylan Kreis and Blane Edwards. Dylan has led Algae Token for 12 months and has been active in C4C and Catalyst meetings. Blane has also been architect and crypto content creator with a passion for environmental conservation. LinkedIn profile link is provided for reference for Blane and algae token link for Dylan for further checks on profiles and experiences. \nAs C4C grows in Asia, more people will join the ecosystem. \nIt is mentioned in the proposal that the team will need future support from Catalyst to continue the good work because C4C is an active and growing community within Catalyst and Cardano. They are also working on previously funded proposal and also part of proposals in other challenges in Fund9.\nWith all the facts above, the plan is comprehensive and the team is capable of implementing the proposal successfully.", "q1r": 5, "q2": "In this proposal, there is enough information for auditing. The proposer has outlined key performance indicators which will help measure the progress of the work, such as the number of proposals addressing the fundamental issues preventing Cardano adoption in East Asia; the number of new East Asian-based users onboarded to Cardano, to mention a few. All these factors outlined in the proposal can be seen on the various channels that the proposer has mentioned- telegram, Twitter, YouTube, Discord- and then can be audited easily. It is stated that the weekly meetups and town hall videos will be recorded for auditing. \nSuccess for the proposal will be seen at the end of the project when over 100 members have been added to the East Asia Telegram and Discord channels; over 50 Database projects; about 10 local use case; supporting over 20 proposals, 10 new proposing entities and 20 new PAs.\nThe facts above show that the information provided is sufficient to audit the progress and the success of the proposal, so my rating is 5.", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5779, "q0": "Climate issues are important part of global discourse now and there has been the challenge for many tech experts to integrate into technology. Having a blockchain ecosystem to lead this innovation to address climate related issues is important for the catalysts community. \n\nThe proposal is addressing the challenge with real time pressing issue of global concern. The proposal has already built a network of Cardano for climate hub, providing ideas to tackling climate challenges. \n\nThe diversification of the solution is unique and would drive a  conversation using blockchain to solve climate issues", "q0r": 5, "q1": "The implementation plan is detailed on the weekly and hourly meetings to create awareness and profess blockchain solutions to climate change. \n\nThe team has experience in organizing meetings and understands the in and outs of their networks for success. This critical because the credibility of the team shows that they would be able to mobilize for the climate hub and have good participation for all their meetings. \n\nThe budget is also reasonable to help implement the challenge. The number of weeks and hourly engagement are spelt out. The budget corresponds with with deliverables\n\nThe proposal will therefore be implemented with easy for success", "q1r": 5, "q2": "KPIs are in reference to the challenge and should not be that, all the KPIs of the challenge could be achieved by one project. The proposal should have had its own KPIs in the context of the implementation of the proposal. \n\nHowever, there seems to be on going activities with good outcomes of this project. This also shows that success are being measured and could be a great reference point for auditing. \n\nThe proposal however has interesting projections for success and auditing. ", "q2r": 4, "assessor": "z_assessor_2749", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7564, "q0": "Climate change affects East Asia but there is no community base to support East Asia related initiatives not a single element of their day to day climate resilience. This is a serious issue that needs to be addressed in this challenge. This proposal could scale up the challenge in the future. The author has come up with a workaround of this problem to offer a nature-based solution like adaptation with support for climate-related initiatives built on the Cardano blockchain through This joint collaboration between East Asia City Hall and Cardano4Climate is a great initiative to help solve the problem. It would be great if this solution could make it clear and easy to understand for the participants to have a better overview. They are committed to improving the transparency of their processes and decisions with increasing access to this information for all stakeholders. With an in-depth look at the proposed risk strategy has also outlined numerous solutions it navigates towards solving this problem and providing a permanent solution to the relevant problems. Those issues are directly related to the world and the ecosystem.", "q0r": 5, "q1": "We appreciate the proposal's auditability showing that it provided a reasonable roadmap or milestones, timelines for development, or KPIs. We can easily determine this if the proposal is to deliver on its promises based on the outlined timelines as the project has outlined. The timeline under which the proposal has been put forward is perfectly reasonable in terms of the quality and quantity of the content that will be easily identifiable as the product produced by the proposal will be public content. The progress of this proposal is easy to test this proposal looks feasible and I believe the given group can come up with this proposal. This proposal, if successful, will become a reference center for the Cardano community in East Asia to help better climate change in this place. The project's success has the potential, in the long run, to bring greater visibility to the Cardano ecosystem helping to make the community stronger. The proposition is well-defined I see that this is a group that appears to be highly competent and well-connected in the community it is looking to serve. The proponent identified the problem to be raised and provided an easy-to-understand solution that gave participants a better overview. This solution reaches the highest level in human cooperation with people to solve humanity's greatest challenge, climate change. To become a leading blockchain in Asia, Cardano must be at the forefront of developing solutions to problems that threaten the health and well-being of the Asian community. This proposal combines Cardano's growing blockchain technology with climate change solutions and action models, and we will make the impact we need, now and for decades to come. There is clarity in the alignment of the problem and solution with the challenge.", "q1r": 5, "q2": "The project provides specific measures of the proposed future implementation plan which is very detailed and complete with the metrics listed by the author showing that the performance is quite clear. They are committed to improving the transparency of their processes and decisions with increasing access to this information for all stakeholders. This recommendation is provided by the author with a clear roadmap of the suggested KPIs in a very relevant challenge setting. The work assignment is very detailed and very transparent so that the community can easily check the project in a certain task. This proposal will include people with relevant experience related to the proposal, the team will be supported by the Cardano4Climate global hub and a dedicated WADA team and East Asia town hall will provide operational and coordination support for the issue. this. Initial team leaders include: Dylan Kreis: Last 12 months, lead in organizing Algae Token. Chemical Engineer and Information Systems specialist, Blane Edwards: Sustainability Architect - Empowa.io Blane is an Architect and Crypto Content Creator with a passion for environmental conservation. Their profile shows the right skills and experience to undertake this project. The author provides full information about the team members skills necessary for the development of the project. The project's funding request is now $15,400. The funding request is less than 20% of the challenge. This budget is broken down into reasonable expenses by the author. They also break down the amount into reasonable expenditures for each item that needs to be spent and I have found that the roadmap and budget are sufficient to audit the progress of the proposal. They also provide a link to the treasury guild services that help us see in more detail what the author does. I think if the project is funded, the project will be successful. This is a completely new project funded by the author for the East Asian vibe, related to Cardano4Climate.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9354, "q0": "The Cardano4Climate I found is consistent with the reported issue. However, it is not powerful enough to completely solve the problem. The project is still in development and has not really stood out yet. You've got a good looking website design. However, about the risks you offer, you do not have a convincing and detailed solution. In the proposal you also said that \"the problem is so big that we feel helpless and don't know where to start.\" This makes people feel a lack of confidence in the ability of your project. By combining Cardano's growing blockchain technology with climate change solutions and action models. So how to combine? What are your specific implementation plans and actions? I haven't felt the detail in the proposal yet.", "q0r": 3, "q1": "\"The proposal has a detailed plan, budget analysis, team information. However, the detailed plan of the group I saw was only released in September and said to be in continuous operation from September to December. This is not reasonable because in my opinion there should be changes in the months to develop the work Since this is a large project so there should be no generalities, there should be more detail.\nTeam Info - 2 people I think are too few people to do a big project.\"", "q1r": 3, "q2": "Compared to the 2 suggestions above, I find this part you guys do quite well. In terms of presentation format, the presentation is easy to understand, giving reasonable criteria. You have specific metrics that need to be achieved to measure success for example East Asia Telegram & Discord members more than 100 members, database of projects - over 50 . Overall this section is quite good, you have methods to track the progress of the project clearly with links.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10276, "q0": "I think your way of posing and solving problems is quite good in today's conditions. Climate change has been and will be a prominent issue for individuals, communities and countries. The solution you offer is to build a community hub that supports connection, discussion, and training to raise the community's interest in Cardano and its applicability to climate change prevention. This proposal is completely aligned with the challenge setting, which is to develop cardano with Asia. The value it brings to the Cardano ecosystem is increasing the number of users in a common concern, climate change. The proposed team has identified and developed a fairly detailed roadmap from 2022 and beyond, with a particular focus on the simultaneous development of Cardao and Asia. The KPIs are provided in the form of titles, but clearly show your vision and target. I think this proposal will be supported and very promising for future development.", "q0r": 4, "q1": "The list of individuals participating in the proposal are 2 expert members in the field of Blockchain and Crypto, in addition, you have great support from Cardano4Climate global hub, I think this is a great advantage to help you successfully execute the proposal. Dylan Kreis is an expert in the field of chemicals, Alga Token, he has had many previous initiatives in the field of Blockchain and is highly appreciated. The detailed budget breakdown is specifically built, the amount is quite reasonable for each work item, but need a more detailed explanation for promotional materials spending, I see there are 2 similar expenses.\nThe risks have been predicted and solutions have been given to mitigate, but I would like you to come up with a longer-term roadmap to not depend on funding from the Catalyst fund. The implementation plan is built with activities, roadmap and deliverables quite enough for the community to see that you are completely serious about implementing the proposal.", "q1r": 4, "q2": "I think it is not difficult for the community to check how you use the money and the progress you have made, because all the information about the number of new members, the number of East Asian projects, feedback... has been published on website channels and social networks. The implementation roadmap of the proposal clearly defines the results and is tied to specific timelines which is a plus point in the proposal. I think the success of the project will contribute a lot to the common goal of global development and the development of Cardano.", "q2r": 4, "assessor": "z_assessor_3170", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "A nature-based solution as adaptation with support for climate-related initiatives built on the Cardano blockchain through a joint collaboration between East Asia Townhall and Cardano4Climate.", "experience": "Connected by shared values, the Cardano4Climate and East Asia Townhall communities are active and growing within the Catalyst and Cardano ecosystem."}