{"id": 421248, "author": "mie.tran.0407", "title": "Cardano Catalyst TV - Ideas Sharing", "url": "https://cardano.ideascale.com/a/dtd/421248-48088", "category": 26602, "amount": 10560, "description": "New and funded proposals have no source or platform to communicate with the community properly if they have new ideas or would like to update their proposals' progress for the community", "f6_no_assessments": 9, "f6_rating": 4.518518518518518, "videos": [], "media": [], "f6_assessments": [{"id": 4408, "q0": "The proposal addresses the goal set out in the Challenge of contributing to the growth development of East Asia and Cardano. This is a great idea, easy to bring to life. The fact that you have implemented when funded by Catalyst in Fund 7, I have tracked and understood its impact and feasibility. In this Fund 9 proposal, you have identified an existing problem that new/sponsored proposals have difficulty communicating directly with the community. Thereby, I understand that Cardano Catalyst TV acts as a television bridge to transmit proposed information to the community (5-minute video), Cardano Catalyst TV's video is also educational about relevant knowledge. related to the Cardano ecosystem (Cardano blockchain, NFTs, smart contracts, etc...which are evident in the proposals). As such, the proposal has added value to the Cardano ecosystem, which is fully scalable and solves future challenges. If properly invested and deployed, Cardano Catalyst TV can completely become a famous TV channel of the Cardano community with world scale and stature. I completely agree with this proposal, especially its impact on the East Asian community and the Cardano ecosystem. I vote 5 stars.", "q0r": 5, "q1": "Through the proposal, we see that the proponent is already working in the Cardano ecosystem (Cardano Catalyst TV host, Eastern town hall moderator, etc..) so you have experience available. In this area, another element of feasibility is that the material you present in your proposal (videos) makes the feasibility of the proposal clear. Equally important when it comes to proposal writers is the disclosure of their identities via social media. You did this by quoting Linkedin's link. In terms of budget, it has been divided into sections with quite reasonable prices with the target to be achieved. I only have 2 small questions: do you intend to spend the extra budget on marketing the Cardano Catalyst TV channel? If you do strong propaganda, many people will know about Cardano Catalyst TV. And then it will continue to increase the value of the Cardano ecosystem in the community, and the number of likes & views will increase. And if you haven't been funded by Catalyst in Fund 9, will you continue to make good videos? Those are my 2 small questions. In another criterion, you have clearly stated the plan and how to implement the proposal. This makes the feasibility of the proposal demonstrated. Regarding human resources, I know that you also participated in other proposals in Fund 9, so does this affect the quality of Cardano Catalyst TV's work? And another possible risk is that when you have personal problems that cannot be implemented, who will be the one to act on your behalf? The remaining risks in your proposal are very reasonable, I agree. So, I agree with showing the feasibility of the proposal, and it would be much better if you could further clarify the questions I posed. I vote 4 stars.", "q1r": 4, "q2": "You've shown the roadmap and milestones across each fund. To me, this is acceptable. I would like to present another opinion to clarify the roadmap and milestones, that is, you can attach the roadmap and milestones to work with the time of the months of the year. If doing so, it is very convenient for the PA community to evaluate the auditability and transparency of the proposal. They will know very well the progress of the work when compared with the date stated. Although there are no KPIs yet, I am satisfied with the 4 success measures, and the key performance indicators you have listed. I am impressed with your analysis in answering the question: \"What does the success of this project look like?\". It is true and thereby shows your quite deep understanding and skill when developing this proposal. I think if you add KPIs, it's great. Throughout the proposal, a problem has been clearly described by you, easy to understand, and a solution to solve the problem exists. I was just wondering, is there anyone else working on this proposal besides you, or are you going to get help from the community? Just now was my question and positive comments on the auditability of the proposal. I wish Cardano Catalyst TV will last forever with the development of Cardano in the future. I strongly agree - vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5242, "q0": "Most proposals funded by Catalyst often spend most of their budgets on operations and product development, and proposers often forget about communication activities to communicate with the community and provide continuity of project activities to the community. So we want to create a communication channel between funded projects and the community in which the project is implemented.\n\nThe proposal of the team to make short videos to provide information about the project to the PAs/voters is very necessary, because communication through video channels is also the most attractive and informative form for getting knowledge.\n\nAt the same time, these videos are created for free, which will greatly reduce the burden on marketing budgets for small project owners.\n\nI strongly support this project because of the great value that this proposal brings to the proposers, helping them to complete the project soon as well as having a marketing document to apply for funding in Catalysts for many later rounds.", "q0r": 5, "q1": "This proposal is expected to be implemented in 2 funds, fund9 and fund10, with a clear video production process and goals to be achieved.\n\nAs for the cost for video production, the project team also describes in detail each item calculated for each video with a total budget of $ 10560 for a total of 60 videos for 2 funds is reasonabe in my opinion.\n\nRegarding the experience of the project team, I completely believe in the team's ability, you guys have made a sample video for a project with the pretty good video quality. So I completely believe that you will do well with other proposers.", "q1r": 5, "q2": "The success indicators of the project that your team chooses are the number of videos created as well as the number of video views, which are quite reasonable.\n\nIn addition, to help the project team improve the video quality as well as the real needs of proposers about an introductory video, your team should have a small survey to evaluate the perception of the video, because the video is made for free, so sometimes the proposers will not dare to ask for much, leading to the video quality not being as expected but still being used.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9867, "q0": "The proposal has well solved the challenges raised. Creating short 5-minute videos with content summaries, proposal ideas, visual illustrations, and caption explanations helps the community better understand recommendations. I appreciate conveying content with images. From there, PAs has more accurate assessments and improves the quality of proposals. A small suggestion to suggest is more well received than adding voiceovers combined with images in videos. This is quite simple when the subject of the proposal is the TV presenter Cardano Catalyst. It should then expand to include subtitles in other languages.", "q0r": 5, "q1": "The proposal is a complementary idea that will run alongside the Cardano Catalyst TV proposal that was funded in Fund7 and run on Fund8, they have all the experience and skills needed to tackle the challenge. The youtube channel has videos that were completed on time, so the project has a great chance of success. The experience of the proponent is consistent with the success of the project. A blueprint presented to Fund10 shows commitment to Catalyst. The risks are also taken into account and how to limit them appropriately.", "q1r": 5, "q2": "I agree the audit plan is clear and the community easy to checks the progress. Because the videos will be published and easily tracked on Youtube, Twitter, Voter tools, and Telegram, ... However, success metrics, and key performance indicators have not yet clear milestones. so that the community can evaluate each stage. For example the number of turns specific play rate? the number of responses and comments? the number of social shares? Finally, I hope the proposal succeeds to continue the group proposals that have been funded in Fund7 and Fund8.", "q2r": 4, "assessor": "z_assessor_3119", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10413, "q0": "This project is helpful for the community in Vietnam specifically and in Asia in general. The proposer has answered the questions that raised in the project. This project is possibility due to the previous projects has been funded in fund 7 and 8 and bring good impact on the community. ", "q0r": 5, "q1": "The project has a clear objective in Fund 9 and 10. The proposer also mention the number of the videos for each Fund (30 videos/ fund), and where she promotes the videos on (Youtube, Twitter,...). There's a very convinced information of the proposer to prove that she's quality to make this project success. The proposer also name the task for making a video such as: sending invitations to ask for proposal ideas/ arranging time schedule/ scriptwriting/ Collecting documents and designing the videos as well as the promotion plan. The budget is divided quite logical and fair enough for each team members with different kind of tasks. It would be nice if the proposer mentions the team members in this project. ", "q1r": 4, "q2": "The KPIs for the project has a clear vision, all of the measurement is reasonable and understandable. The proposer also makes a clear description for measurement the success of this project. ", "q2r": 4, "assessor": "z_assessor_3184", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11155, "q0": "The proposal is quite suitable for the Challenge \" Grow East Asia, Grow Cardano \" as it aims to helps increase community engagement inside and outside of the Cardano ecosystem, especially in Asia by spreading proposal insights in the form of 5-minute videos. Sharing ideas in the form of videos is a good way to help proponents easily reach, connect, and gain support from the community. On the other side, the community gets up-to-date with proposal insights with more details in-depth, graphic images, background musics and subtitle explanations within 5 minutes. This helps them study and relax at the same time. In the long term, this proposal will help the Cardano community improve both in quantity and quality.", "q0r": 5, "q1": "In general, the project does not have any human resource problems. The resume of the proposer and the information about the Marketing Agency are provided clearly and transparently. Moreover, this proposal builds on the previous funded proposal in Fund 7 so their ability and experience in project implementation is nothing to worry about. Another great point is that the proposal gives a very specific development roadmap of the project and the budget division is very clear for each item. The proponent even set aside 10% for the reserve fund. This is a good move to limit unnecessary risks that make the project short of budget, such as ADA slippage or additional costs incurred during implementation. Good job!", "q1r": 5, "q2": "Fortunately, all the metrics and KPIs of the project will be measured. In my opinion, this project is easy to track because of two reasons. Firstly, this proposal is an extra idea of the funded proposal funded in Fund7. Therefore, we can track the project in the same way. Secondly, the videos will be published on Youtube, Twitter, Voter tool and Telegram. Hence, everyone can easily access and verify. For my part, I believe that this project is completely transparent in terms of audit so it deserves 5 stars.", "q2r": 5, "assessor": "z_assessor_3225", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11400, "q0": "Project catalyst is a series of experiments which seeks to generate the highest levels of community innovation. Catalyst is bringing on chain governance to the Cardano blockchain by allowing the community to self determine priorities for growth. The project catalyst is divided into a series of funds which are deployed every six weeks . These funds will illicit ideas in the form of proposals from participants. As voters donot have time to read and comprehend the insights of proposals and lack credibility and reputability to reach voters and marketing means. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposal plan has objectives of conducting atleast 8 videos per week which will have complete translation. Each video will be promoted on twitter, YouTube, Facebook so on . The tasks include sending invitations to proposers arranging time and documents, editing and translation, marketing through video posting. The budget is outlined clearly and is reasonably achievable. Mie Tran who is working for the project is Cardano Catalyst TV host, Eastern Townhall Moderator, interpreter and translator Cardano passionate. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The success of the project can be tracked through interactions, viewers on YouTube, telegram, voter tool, townhall landing page. Key indicators includes play rate, feedback and comment, social sharing, view count on each video. They are going to upload videos in each funding round with more views and allow them to reach more voters. The translated content can reach local members successfully and help them understand proposal insight. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 11781, "q0": "Quite clearly, the “Cardano Catalyst TV - Ideas Sharing” idea ties in perfectly with the “Grow East Asia, Grow Cardano” challenge setting. This is a complementary idea and a continuation of the “Cardano Catalyst TV” proposal that was funded at Fund 7. The solution the team continues to pursue is to create short videos (5 minutes each) that introduce briefs idea of a proposal submitted at Fund 9 and Fund 10. At Fund 9, the team is expected to select 30 proposals to make an introductory video. The purpose is to help these proposals introduce themselves, communicate and connect with the community through concept videos. Video outreach is a great way to increase public awareness, marketing effectiveness, and response, the team argues. This also helps to overcome the limitation that many people do not have much time to read the proposed documents. I totally agree. However, my concern is that the team did not specify when these videos will be published at each funding round. Since the purpose of the idea is to create a communication bridge between the proponent and the community, I personally think that the idea video should be released before the community conducts voting for the idea. This leads to risks, difficulty contacting the proponent, difficulty in accessing the full information of the proposal before the idea is finalized and submitted to Catalyst. If waiting for the idea to complete, the time it takes for the team to produce videos is very short, which may affect the completion schedule of 30 videos per Fund as expected by the team. Since this is a follow-up to the proposal that was funded at Fund 7, I would expect the team to provide a detailed report on the results of the work. Unfortunately this was not implemented by the team. The community needs to consider and compare the achieved success with KPIs that the team have been committed. So that a decision can be made whether to continue to accept funding for this proposal or not. My rating on this section is 4 points, -1 point deducted because the team did not provide the results they did after receiving the funding.", "q0r": 4, "q1": "Regarding the work process and implementation budget, the team is expected to use the budget to produce 60 videos for Fund 9 and Fund 10 (30 videos for 1 fund), the speed is 10 videos per month. However, specific timelines regarding video production at each fund were not mentioned by the team. The group also mentioned promoting these videos on platforms: YouTube, Twitter, voting engine, Ideascale, Facebook. However, specific information related to this promotion and marketing plan is not provided. In terms of budget, the cost categories given by the group in my opinion are reasonable, clear and detailed. About the team, Mie Tran is the one who received the community's approval at Fund 7, so I believe she has the capacity and experience to successfully implement the solution. Here, I have made a deduction of -1 point in the work progress section, due to some content that I personally consider to be missing the above information. My score is 4.", "q1r": 4, "q2": "Regarding auditability, I think the community has enough grounds to audit the success of this proposal. The team provided concise, specific KPIs: there were 30 successfully uploaded videos per fund, each with at least 100 views, 1 more Asian member joined Catalyst. I only have a small suggestion, the team should consider adding some survey activities, receiving feedback from the Catalyst community after the series of concept videos produced at Fund 9. This will help the team continue to edit, improve the quality of videos at Fund 10. My rating in this section is 5 points.", "q2r": 5, "assessor": "z_assessor_3279", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11807, "q0": "I find the Cardano Catalyst Tv - Ideas Sharing proposal perfectly suited to the challenge of Grow East Asia, Grow Cardano has solved the problem of the challenge of wanting to develop the ecosystem in East Asia by raising the level of awareness level of people here about blockchain and Cardano network. This proposal will remove the problem that new and sponsored proposals don't have the source or platform to properly communicate with the community if they have a new idea or want to update their proposal progress community.\nThe outstanding and unique point of the proposal is when it converts ideas and plans from boring words on paper into unique videos. A short 5-minute video with a proposal's body/idea summary visual illustrations, and caption explanations to help educate and self-introduce the proposed ideas to the community.\nI completely agree with the argument of the author's solution to this proposal. Concept videos will be a great way for proponents to connect with a deeper community, a platform with contact information where viewers can communicate, comment, and ask questions. Videos will be known to the global public of their projects and on social networks such as Youtube, Telegram, Twitter and voting tools, ... Personally, I have many years of experience working in the industry media and television. For me in Vietnam, the use of videos and clips for the purpose of advertising, marketing and communicating with the community is no longer a new job, but it cannot be denied that at the present time it is still a A leading effective communication method in the media market that greatly changes public perception, a highly effective marketing communication channel.\nI will give this proposal impact 4 points as it is not a new proposal but just an idea that complements previous funded proposals.", "q0r": 4, "q1": "The plan table of the proposal has been built with clear contents for 2 funds, fund 9 and fund 10, I can see the construction of detailed and reasonable tasks, set plans and specific tasks and very obvious. However, for me in terms of time, if I define a fund as 3 months, the plan table that needs to be divided into tasks to be done by week/month will be clearer instead of the current timeline according to the fund. \nThe suggested budget portion of $10560, which is 4.2% of the challenge's total budget, is a perfectly reasonable number, however I find the budget to also need to split usage by week/month and interpret it in detail more detailed. For example, each video needs to use how many employees, how many days, how much is the unit price of a specific tool to create a video. When a detailed budget construction is given, the better the use of costs and persuasion to sponsors will be.\nThe authors also identified two main risks of the proposal: it can be difficult to contact proponents to ask for ideas and to follow up with proponents on a regular basis to see how the proposal develops how can be a big challenge. I think the solutions to reduce the risk have also been given by the author group to be reasonable, but I think the best solution here is to have regular interaction and connection between the author group and the researchers propose to build a close relationship, this will greatly help in the working process and reduce risks, helping the project have a higher success rate.\nThis is an extension to the proposals that have successfully raised capital from previous funds, so I have complete confidence in the author's ability to implement this project. I have watched the demo video on youtube, twitter or the author's community sites are provided such as linkedin, telegram... The author is a person with competence, expertise, education and experience that has been verified at different sites previous funding round.\nI will give 3 points to the feasibility of this proposal due to the lack of detailed information in the planning and budgeting sections.", "q1r": 3, "q2": "I find this project completely auditable, but for me, the audit only stops at the general level of every 3 months, lacks continuity and rigor. For me, whether the audit is good or not, whether the community can monitor the progress of the project and the success of the project seamlessly, from the planning step must be detailed, clear and clear reasonable. In addition, for a project, there should be public and transparent monthly reports on the implementation of the plan implementation and budget usage so that the community can easily track the proposal.\nKPIs of the project I saw that the author team gave 4 main indicators as a measure of success, which are views per video, play rate, feedback and comments, and social shares. For me, these 4 indicators are relatively detailed and complete, but they lack specific numbers to measure for these 4 indicators. In addition, the author team has provided a demo video of the project to help the community refer to, monitor and visualize the content that the proposal is building.\nThe project is considered successful when it meets the criteria of successfully uploading 30 videos per funding round with the hope of getting at least 100 views per video, which has helped the project to market its proposal succeed and increase their presence on most social channels, add another Asian member to the Catalyst project, strengthen the connection between the proponents and the community, and collaborate with the many available channels of Cardano Ecosystem.\nAs said in the previous section, this is a supplementary idea to the proposal that was funded at fund 7, currently this project is not profitable and only serves to spread Catalyst to a larger part of the community. The authors determined that many services will be added in the future to support fundraising for channel expansion. The community can see the products at the fund first by following the author group link at the end of the article.\nI give the transparency of this project 4 points, -1 point because the project's auditability is not tight.", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12086, "q0": "It is proposed to identify one issue in the challenge that needs to be addressed, which is to increase the awareness of regular people in East Asia about blockchain and the Cardano network through a deeper community connection, a platform with contact information where viewers can contact, comment, and ask questions. Videos will gain global publicity around their projects and on social networks such as Youtube, Telegram, and Twitter, and will be used as voting tools for the purpose of improving. Public awareness: the community is up to date with a detailed proposal with a more detailed explanation. For 5 minutes, sit back and relax. Get feedback. Cardano members can use video to spread ideas to the majority of the community and introduce new Cardano members. Additionally, to tackle the future challenge of the development of the Cardano ecosystem in East Asia, the proposal clearly outlines how it will add value to the Cardano ecosystem through a blueprint. Clearly identify the risks and devise ways to reduce them when accepting the challenge. However, it is proposed to add the following risks to the project for reference and appropriate remedial plans:First, 5 minutes is not enough time to summarize and convey enough data in a long, deep proposal. Second, if for proposals that are not in the expertise of the project person, it also causes difficulties in accurately conveying the idea of the proposal.\n", "q0r": 3, "q1": "The proposal includes the essential knowledge and practical expertise needed to carry it out. Every resource required to implement the suggested team size is listed in the plan. The proposal offers a practical and useful strategy for implementation, including not only what is being done but also how and by whom, as well as a realistic timeline for completion. If language and technology are crucial for implementation, the proposal makes sure to explain both in detail. The proposal's promoter offered a strategy for a lengthy undertaking in case additional funds was required to carry it out. Boost time savings and knowledge updating efficiency for the update community.\n", "q1r": 4, "q2": "The proposal includes a roadmap with exact completion dates and benchmarks. Videos will be published and easily tracked on Youtube, Twitter, Voter Tools, and Telegram, which are publicly accessible projects. -specific success metrics that provide updates Regular updates to the community to check progress, success metrics, and key performance metrics: Views per video, play rate, feedback and comments Social sharing,.. These tools provide a clear, easy-to-understand description of the specific targeted issue of the project's success, such as: successfully uploaded 30 videos per funding round in the hope of getting at least 100 views per video. helped the project proposal to successfully market and increase their presence on most social channels. Add another Asian member to the Catalyst project. strengthens the connection between proponents and the community. Create and collaborate with the many available channels of the Cardano Ecosystem.\n", "q2r": 5, "assessor": "z_assessor_3356", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A brief 5-minute video with a summary of the proposals' content/ideas, graphic demonstration, and subtitle explanation to help educate and self-pitching about the proposed ideas to the community", "experience": "Cardano Catalyst TV host, funded proposer, Eastern Townhall Moderator, Interpreter and Translator, Challenge Team member, sub-circle team member, Cardano Passionate"}