{"id": 422034, "author": "cardanoprojects.org", "title": "Educational Hub by CardanoProjects", "url": "https://cardano.ideascale.com/a/dtd/422034-48088", "category": 26602, "amount": 6400, "description": "Currently, KOLs on social networks still call Cardano a Ghost Chain. We want to build a portal on CardanoProjects.org to educate users in a mainstream way about the Cardano ecosystem.", "f6_no_assessments": 9, "f6_rating": 3.4814814814814814, "videos": [], "media": [], "f6_assessments": [{"id": 6865, "q0": "The proposal fits the challenge as it contributes in extending  knowledge about Cardano ecosystem and information about projects based on the blockchain.\n\nI agree that a lot of negative and false information has been spreading from media and public channels and it is definitely necessary to build a sustainable educational network which would provide trustworthy information about Cardano, its tokens and running projects.\nThat would significantly increase a number of users and community participants and attract new ideas to Catalyst. \n\nThe idea to create a website with comprehensive information, educational articles and videos would help to fulfill this mission.\n \nThe design of the website (the link is provided ) is built in such a way that all content is divided into different categories classified by the list of existing projects, which helps with \nclear navigation and easy access to the necessary information. \n\nProposer considers the manual moderation of the content obtained  from partners to avoid a risk of getting low-quality information. That will help to make the portal a reliable source of educational information about Cardano.\n", "q0r": 5, "q1": "The proposer provides a detailed budget breakdown which indicates the cost (based on hourly rate) and timeline of implementation of each task. Total amount 6400$ looks realistic for this project. \n\nThe plan includes 3 key milestones to give a clear understanding of how and within what time the proposal is going to be delivered.\n\n The portal is designed in English but in my opinion the multilingual version could make the educational content achievable for the people who don't speak English but are interested in Cardano. It would attract more people from Asia and other countries to the community.\n\nThe proposer claims that he has been developing websites since 2010 but did not attach any link of his profile with education and previous professional experience information. \n\n", "q1r": 4, "q2": "I find this proposal not difficult to audit. As key metrics to measure the progress three criterias are given: completed proposal features, amount of educational content and  number of people accessing the portal monthly. This data is able to indicate stages of the execution of the project and measure success. \n\nHowever, I think a more specific explanation of how success looks would be better. For example, what amount of educational content and traffic in 6 months could be considered as a successful implementation of the project.\n", "q2r": 4, "assessor": "z_assessor_2840", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10941, "q0": "In recent years, the crypto market has been growing stronger and expanding. The number of people participating in the market to buy and sell tokens is increasing, but they only experience and think it is a quick and easy way to make money. Because there is not enough knowledge about blockchain, participants often think that this is a virtual market, unreliable, making money as forms of betting, speculation... In the Cardano ecosystem, The stronger and more sustainable it is to maintain and develop, the more we need to provide knowledge about the Cardano blockchain system fully, systematically, and officially. That helps participants have a higher understanding of the Cardano ecosystem and trust. In my opinion, the Educational Hub by CardanoProjects project is a great project. It is a portal to meet the needs of providing educational information about the Cardano ecosystem from basic to advanced for newcomers market participants and longtime participants. This is official sustainability information and knowledge platform, helping the Cardano ecosystem to grow and expand. Through the project, participants confidently hold more ADA and help the Cardano ecosystem come to life quickly. The projects of the Cardano ecosystem will bring many benefits to society and people and meet the goals Cardano wants to achieve. The project helps participants have the right and complete knowledge about the Cardano ecosystem, letting them understand that ADA is not a virtual currency, a fire island, only speculation. The future Cardano blockchain will develop long-term and sustainably to help improve lives, people, and society. I found this project, in addition to self-written academic knowledge, the project also automatically updates more articles and knowledge videos from partners' channels, which helps the project to have rich and attractive content. meet the high demand for users.", "q0r": 5, "q1": "This project has a full development roadmap with a detailed plan, project features completed in the first two weeks, the next two weeks for basic content, and the 2nd month onwards for content development. Enhanced content. The proponent has experience in Web design, research, and evaluation of Blockchain projects, especially as an ADA investor, and I appreciate that. The project construction team is a bit thin, with only one person; I think it will be better if they add more personnel to build the project. The proponent has designed and prepared a very thoughtful and beautiful website, which shows that the proponent has embarked on this project, so it makes sense to build this project with only one person. The project has a reasonable and transparent budget, and the budget is divided into clear and appropriate categories. The proponent provided clear success metrics with reasonable metrics. When the project is successful, the Cardano community has a new educational portal, meeting the needs of each person to learn and learn. One risk is that the content provided by the partner may not be appropriate and accurate, so the proponent suggested the option of self-censoring the content before posting. Since this project aims to provide the most valuable knowledge to the Cardano community, the content provided should be carefully moderated before posting to help readers avoid misunderstandings.", "q1r": 5, "q2": "The project has a thoughtful and reasonable web link attached, a suitable development roadmap within two months, a transparently allocated budget for items, and clear success metrics. The proponent set out the goals that the project aims to achieve very well with the learning needs of the current Cardano community. I realize that this project will develop more new features in the future to meet the growing needs of the Cardano community. The project, in addition to basic educational knowledge, also provides advanced knowledge and experience in participating and investing in Cardano, including content, images, and videos for readers to understand. I think if the project can build groups with sessions to exchange, share, and engage the Cardano community, the project will grow stronger. With the project construction time starting in 2 months is very reasonable and fast, it helps to quickly respond to the needs of learning and providing information for the Cardano community. Proposers need to provide more details of the project's category hierarchies and features, and the project will be appreciated. The proponent needs a specific marketing plan to achieve the desired number of website visitors for the project to have the best results.", "q2r": 5, "assessor": "z_assessor_3208", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12688, "q0": "The problem that needs to be solved is that Currently, KOLs on social networks still call Cardano the Chain of Ghosts. The proponent wanted to build a portal on CardanoProjects.org to educate users in a mainstream way about the Cardano ecosystem. The proposal presented how it would add value to the Cardano ecosystem by creating an educational portal where users can access official knowledge about the Cardano blockchain. The proposed approach here is to create a portal with blockchain knowledge, and in-depth content about the Cardano blockchain for both new users so that users will be educated and aware. true about the Cardano blockchain. Adds an educational space to CardanoProjects.org designed with various categories categorized by the list of existing projects on the platform. This project will help CardanoProjects.org gain a new audience through SEO optimization. however, I think that in order for the scale of the proposal to be expanded further, the proponent should have a plan to share information and advertise the portal on popular information channels: Youtube, Facebook, and TikTok.. ., thereby helping more people to access this portal and the scale of the proposal will also be expanded to help effectively solve future challenges. I rate 4* for the impact of this recommendation.", "q0r": 4, "q1": "The proponent identified that all educational content design, development, and writing was done by the proponent Garry himself, The proponent also provided information on relevant skills and my own experience as a professional website designer since 2010 and also an ADA investor who has researched and evaluated blockchain projects from 2017 to present. Proposer requested funding for this project of $6400 where detailed budget: User Interface Design, Education Category Hierarchy: $1,600, Proposed Feature Development: $800, Contact educational content providers and partners: $ 400, Write educational content $ 3,600, with each cost the proponent has specified the implementation time, the cost level for each timeline to complete the work so that it can be audited. The actual timetable as well as the plan to carry out the work given by the proponent is in 6 months, and the specific work of each month is planned in detail and detail. The proponent has taken into account the risk when implementing the proposal and has taken measures to address that risk. I strongly agree that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proponent gives a 6-month project implementation roadmap, the important milestones and time for implementation are also specifically given by the proponent, looking at it, the progress of the project can be determined. when the project is successfully implemented Community will have one more portal to learn about the Cardano blockchain, Traffic from search engines will increase, Educational content will be distributed to a wide range of users through through search engines. The proponent has selected metrics to track project progress: Recommended Features to be completed in 2 weeks, Cardano blockchain Educational Content, Education Portal Visitor monthly education and these are good indicators of the success of the proposal. The proponent clearly described the problem of social media KOLs still calling Cardano the Chain of Ghosts and suggested that the appropriate solution is to build a portal on CardanoProjects.org to educate users in a genuine way. Cardano ecosystem system. I rate 5* for the project's suitability", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13673, "q0": "I gave this rating because it provides detailed information about Cardano Ecosystem. It helps many of the community people who want to learn more about blockchain and cardano. This proposal clearly addresses the challenge . I went to the website and it looks damn good. It explains each and every category clearly and helps the community grow. The CardanoProjects.org website looks awesome. It shows what are the latest Dapps that came into cardano too. It can be used to collect Information about the projects.if you want to learn about a project, It can be used to find more about that project with detailed report. This proposal helps the community easy to understand about cardano ecosystem and find all the right information here. The content that the team is presenting is good.", "q0r": 5, "q1": "I think this proposal will be implemented successfully. My concern is only one person is working in this project. Even though he is a professsional web designer and a blockchain analyst. Most of the work completed in my opinion. Some content should be added. The funding of 6400 usd is good. But i don't think the proposal features will be completed in two weeks because their is a lot of projects to be added a lot of content to add. One man is not enough in my opinion. But their is a high possibility that this work can be done in given time because when i saw the website , I don't believe myself how one person can do all the work like interface design, category hierarchy, education content and partnering with major brands. Adding articles and videos to improve community understanding in cardano ecosystem and development is good idea. It will help to engage more people because some community likes to listen than read. ", "q1r": 4, "q2": "The given information is enough to asses the proposal and their is a high chance that this proposal is going to be a success. The roadmap is clear but the duration of the proposal timeframe is less. If their is a public channel  like telegram,discord,twitter etc.that can help any queries and give time to time update on how the funds be used and how far the proposal reached its roadmap. if we know the name of the partnership above stated it would be good , so that we can understand how far that this project has gone and how much it can help the community grow.  This project has a nice future and can solve the lack of education in blockchain and Cardano technologies to the community. ", "q2r": 4, "assessor": "z_assessor_3735", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 15003, "q0": "The proposal is looking to help build an educational resource page for cardanoprojects and has a basic plan in place to help grow it.  CardanoProjects has been around in the Cardano ecosystem for a while and has some reputation, but the reach of this project may be limited and will require sufficient marketing to get the measure out.  The major question is how this proposal matches the challenge fund since it's pretty general and doesn't seem to target Asia at all.  For this reason it scores as a 3.", "q0r": 3, "q1": "The building of educational content seems to have a straightforward plan and provides additional avenues for people to learn about Cardano. Questions arise around how, what, and the format of the educational content to be delivered though as there are very little details on how it will be done.", "q1r": 3, "q2": "There is a breakdown of funds and a small blurb about timing of deliverables, but there is little about the project to help track it's progress from development to rollout/implementation.", "q2r": 3, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15107, "q0": "Unfortunately, the proposal is not at all in line with the challenge. Here we are looking to fund projects that are both beneficial and profitable for East Asia and Cardano. But at no time is the Asian continent mentioned in the details of the impact. The idea is to create an “educational portal where users can access official knowledge about the Cardano blockchain”. What would the portal look like, in terms of design? And what topics would be addressed? How to ensure that many people access this site? What content will be created for the portal, and which partners will include articles and videos here as well? How is this all interesting for East Asia, how will it especially help its inhabitants to become active members of our community? There are many questions and no clarifications, so no confidence in the project's impact is given.", "q0r": 1, "q1": "The roadmap provided is rather superficial. We have basic information about what would happen: in the first two weeks the work would be focused on design, hierarchy of categories and so on. How would such things be defined? How would core educational content be created? An explanation of what exact subjects would be addressed was appropriate here. It would also be necessary for us to understand the process of defining partners. How would they be chosen, what kind of content would be sought after, etc. The breakdown of expenses is the best part of the topic, as here we understand how the requested money would be spent, in a detailed way. It worries me a lot that the whole project is handled by just 1 person, who didn't even present a detailed resume, we don't know how Gary relates to Cardano, what his experience is in the cryptographic world, etc.", "q1r": 2, "q2": "I think the auditability is average. I say this because we know some necessary information, but a deepening could be done. We know the partial results expected at the end of 2 weeks, some KPIs such as the amount of content posted on the portal and also the number of monthly hits. But it is still not possible to understand how the portal production process would be monitored. What would be behind these small successes. The end result is the realization of a really broad portal, which reaches many users, educating them about Cardano. But how could we really understand the impact of these contents on the community? What is the target audience and how to measure their steps after accessing the portal, would they have become active members of the community, etc? What would be the communication channel used for all this information to become public?", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15119, "q0": "The proposer wants to continue developing the website https://cardanoprojects.org and to add an educational portal that will contain articles about blockchain basics and in-depth content related to Cardano. There are no further details related to the subject of the articles, who the partners are that the website will draw part of its content from, who is the person that will be writing the articles and what his skills and knowledge are etc.\nThere are still many questions that have been left unanswered, and the two most important ones related to this section of the proposal are how this ties in with the challenge of “Grow East Asia, Grow Cardano” it has been submitted in and how with the lack of information can I judge the potential impact the proposal might have on the entire Cardano Ecosystem. The proposer is highly confident that his project is “risk-free”, yet he should be aware that promising risk-free developments to the Cardano community will probably raise suspicion among its members.\nIn conclusion, I will advise the proposer to resubmit his project in a future fund - in a possibly better challenge? - and provide some additional details in his text and links. The rating for this section is a 2.", "q0r": 2, "q1": "With the very brief information provided is hard to envision a successful implementation of this project. The plan is very succinct but could have possibly worked if the rest of the needed details would have been provided. The budget is somewhat detailed, but for the task of writing educational content the metric provided is 6 months, yet nowhere in the proposal do I get a sense of a clear volume of articles to be provided through this period of time. It can be 2 articles per month or 20 articles per month and there’s a huge difference between those two values.\nRegarding the team description, I will add that the proposer has noted only that everything related to this project - design, development and writing - will be done by him, and by him, I mean that the only identification we have been provided is the name “Garry”. \nAs such, the lack of details and transparency in regards to the proposer’s skills and previous work I find I cannot consider the project to be successfully implemented and I will rate this section a 2/5.", "q1r": 2, "q2": "For the progress development, the proposer has provided some metrics to be followed - like the amount of educational content and of people accessing the portal monthly - but there is no specification on where these metrics will be available to the entire Cardano Community, thus empowering it to independently and objectively assess the evolution of the project.\nThe success definition is not pertinent to the proposal process. Having another portal to learn about Cardano is not a success in itself, it should provide details of why this portal is important to fund and what sets it apart from the others. There are no clear numbers in regards to success that would enable a fast assessment for the community.\nAs such, the proposal is very hard to audit and I would suggest to the proposer to resubmit the project in a future fund, but with the added details. The rating for this section is 2.", "q2r": 2, "assessor": "z_assessor_2192", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15127, "q0": "Proponents make an educational portal where users can access official knowledge about the Cardano blockchain. This proposal solves part of the challenge, I entered this portal and it is written in English, this will limit people in east Asia who don't know English, it would be great to have a website language ​​in East Asia. In addition to Cardano's website, there are many other websites that update information about the ecosystem, if possible, the proponent should add highlights or differences of this portal. The risk of updating information from uncensored partners and the solution proposed by the proponent is manual browsing, which will take a lot of resources and time", "q0r": 4, "q1": "The proponent provides a detailed plan by week, month, and implementation within 6 months. The proposed budget is detailed by an hourly, cost-based piece of work (Educational Content Writing: 6 months * $600 = $3,600) It is unclear how many articles will be published per week/month and how many hours the writer will work during the week. The entire project will be implemented by one person, Garry, whose information has not been fully provided in the proposal or website. In addition, marketing for the community to know and use is also very important, so it should be supplemented", "q1r": 4, "q2": "The plans and goals for building features in the first 2 weeks were challenging with this one-man project with lots of work to do. Measurements are clearly stated in the proposal (Features, number of visitors, amount of educational content), and should add comments from the community to promptly adjust to meet", "q2r": 5, "assessor": "z_assessor_2714", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15262, "q0": "This proposal is a draft, in its current form too many details are missing to be evaluated as a proposal, so I recommend that the proposer watch Catalyst School workshops/tutorials on YouTube or ask for help on Catalyst channels (Telegram or Discord).\n\nFirst point to be taken into consideration is that there is no information that indicates why this proposal was submitted in this challenge. The concept is to create a portal with Cardano projects to educate the community, which is positive, but it has nothing to do with the challenge. Perhaps the proposer is Asian or the proposal intends to translate content into languages of East Asian countries, there is no way to be sure.\n\nThere are no metrics/KPIs with targets that allow projecting impact potential or any other information that may indicate impact on this challenge.", "q0r": 1, "q1": "Draft proposal.\n\nThe proposer, Garry, has been a website designer since 2010, but there are no sources for me to check the proposer's qualifications.\n\nThe website doesn't contain information about the team, so it is not even possible to confirm that Garry is in fact responsible for the website.\n\nThe plan is extremely short, there is not enough information to understand the dimension of what will be developed.e.g. number of researched/curated projects.\n\nThere is a budget breakdown and the hourly rates seem adequate, however as the plan is just a draft there is no way to tell if the budget is adequate. The deliverables are also unclear so there is no way to know what will be included on the website.\n\nThe proposer didn't identify any risks, but I can think of two risks quickly:\n\n1 The website may not be popular and may not serve the purpose of educating the community.\n\n2 Articles may recommend a scam project (I'm not saying it's the proposer's intention, but when one curates projects, it's important that there is a standard of quality and diligence)", "q1r": 2, "q2": "Two relevant metrics were mentioned, which can identify the number of monthly users accessing the website, the number of educational content, but they are insufficient for good auditability.\n\nHow will we check the quality of articles? It would be important to at least create a system that allows the user to evaluate the content that was created and projects that were curated.\n\nThere are no targeted KPIs.\n\nThe definition of success has two premises:\n\n\"The community has one more portal to learn about the Cardano blockchain\" This premise is hardly indicative of success, as the portal/website already meets this definition, the point is that this portal has relevance for the community, something like Adapulse has for the Cardano community for example.\n\nThe other definition is:\n\n\"Educational content is distributed to a wide range of users via search engines.\"\n\nIn this case, the definition ends up complementing the first one. Having content widely distributed is relevant, so it would be important to establish targeted metrics and KPIs to improve auditability.\n\nThere is a roadmap, but the deliverables, milestones are insufficient to allow verification of what is being developed.e.g.\n\n\"After two weeks: Deploy basic educational content.\"\n\n-After two weeks, it can be 3.4 or 100. To establish a milestone, it is important to be more precise, especially for activities of lesser complexity and with less chance of unpredictability, which is the case with this proposal.\n\n-Deploy basic educational content is an extremely subjective definition.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We want to create an educational portal where users can access official knowledge about the Cardano blockchain.", "experience": "I have been a professional website designer since 2010 and am also an ADA investor who has researched and evaluated blockchain projects from 2017 to the present."}