{"id": 422747, "author": "jtrube", "title": "Promoting Japanese Content Abroad", "url": "https://cardano.ideascale.com/a/dtd/422747-48088", "category": 26602, "amount": 10000, "description": "Cool things are happening in the Japanese Cardano Community everyday - but many western audiences are unaware. English coverage of Cardano in Japan tends to favor speculation over community activity.", "f6_no_assessments": 9, "f6_rating": 4.0740740740740735, "videos": [], "media": [], "f6_assessments": [{"id": 1930, "q0": "An interesting approach from the proposer finding this very specific problem in the community. This problem may be overlooked by many local communities, especially non-English - that most of the discussion is in the local language.  This proposal might bring western (or English-speaking) newcomers into the local community hub/meeting to discuss more non-speculative topics and build the community together. This proposal if succeed, will add value to overall Cardano ecosystem.", "q0r": 5, "q1": "The proposer shares their website links with past experience which will relevant to the project to become successful. In addition, the proposer lived and work in Japan which makes the proposal more relevant - although the number of teams is not given in detail to run this project - which would be better for me as assessor to assess this proposal. Nick Clarke, the Co-founder / Director of the agency Eggworm, seems to have all the experience to lead the project with confidence.\n\nThe budget is explained in detail and looks reasonable for the planned output. The total budget is also still <10% of the challenge budget which acceptable.\n\nLastly, the proposer shared a detailed and reasonable timeline to deliver the project within 3 months. Unfortunately, there is no mitigation plan if the risk mentioned are happening, and considering the pandemic or any force majeure event - is there any backup plan if the project leader is not available to finish the project?", "q1r": 4, "q2": "The proposer gives enough detail of the timeline but has not given the detail of KPI numbers/ tangible that can be easily measured by the community - understand the growth % is mentioned but by how much? It would be great if the proposer can give a rough number of - for example, the number of views, and percent of increase- that they want to achieve. They can also mention how many videos they want to translate every given timeline (monthly / weekly ?) vs the actual work later on. ", "q2r": 4, "assessor": "z_assessor_2289", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2033, "q0": "The first part of the problem addressed by this proposal is the fact that there are lots of ‘cool projects’ in the Japanese ADA community, however several of these projects are limited to its community, since there is the presence of the language barrier. \nThe second half of the problem statement is not very clear.\n\nThe proposer aims to tackle the fist half by creating an online English hub in which it is going to have news about Japanese projects, SNS channel, provide copywriting for original blogs etc.\n\nThis proposal clearly articulates the method to address the problem and, furthermore, its metrics and goals do align with this challenge because it aims to increase the impact and reach of the Japanese ADA community.\n\nThe proposal, however, is quite mechanical, meaning that there will always have a need to a person execute one job, translating, e.g. Therefore, the scalability of this proposal is proportional to the quantity of content creation, translating etc the team can execute.", "q0r": 4, "q1": "To evaluate the proposal’s feasibility, we could analyze some specific points:\n\n1 – Roadmap: The roadmap is too general needing a bit more detailing in each task. It would be good to include information about the expectation, not only the duration : “translating X blogs and articles in a month”, e.g.;\n\n2 – Budget: The budget is also a bit general needing further explanation. To contextualize, the proposal states that it’ll need $ 2K for translation, however the majority of translators that I’ve already seen and worked with charges per word, therefore, how many blogs are expected to translate with this value?\n\n3 – Team: It was provided only one name in this part of the proposal. The link provided does not show how many people the eggworm has nor their field of actuation. Therefore, it’s quite hard to evaluate this part.\n\n4 – Self fund / scalability: In order to keep this proposal going it needs a perennial source of money, because it’s a continuous work of translating, video editing, creating content etc. However, it does not provide a plan to do that.  Therefore, the continuation of this proposal and, thus, the scalability is at risk.\n\n5 – Risk management: There was accounted some risks relying the Japanese community characteristics, however it would be good to include some more, such as content to translate selection and the quantity of material. These are considered risks because: a) choosing the wrong proposal might reduce the interest of Japanese participation and western community visualization; and b) if this proposal is a success, the human part will be a bottleneck causing delays and queue to translate content, possibly making the Japanese community tired.\n\nThat being said, there are some points that might cause trouble to the feasibility and success of this proposal.", "q1r": 2, "q2": "As mentioned before, the roadmap and milestones provided are quite general, making it hard to follow the proposal’s development and progress. Would be good if it provides more details in this part.\n\nIt seems that the metrics and goals provided does not visualize the success of the idea since the goal of the proposal is to make the Japanese community appear to the western community, however the metrics and KPIs are not directly correlated to this view. The metrics and KPI provided might include the validation of a western number of views and participation. This way we could measure its success.\n\nAlso, there was not provided a channel to share all the development content and information, allowing us, voters, to follow its progress. There was a link provided, however there is no part in that link that might serve as a disclosure of information about development of the online hub, infos, etc.", "q2r": 2, "assessor": "z_assessor_2298", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3926, "q0": "The issue being community activity happening in Japanese Cardano Community isn't reaching many western audiences due to lack of English coverage of Cardano in Japan. The proposer wants to resolve this by creating message of the Japanese Cardano Community in English and thus helping it reach western audiences. This will be helpful for English speaking audiences to understand the things going in Japanese Cardano Community thus helping in cardano growth. The proposal does addresses the challenge ", "q0r": 5, "q1": "The proposer hasn't given any details regarding their experience in language translation But they have given a clear details on how the plan will be implemented and how it will be helpful for the community. The requested fund of 10000$ seems reasonable for the work needed to be done. They do have considered the risks and challenges they may face while executing the proposal. The proposer is planning to partner with existing creators which will be helpful to reach more audiences. With all these information it is likely this proposal will be carried out successfully ", "q1r": 4, "q2": "The proposal does consist of a monthly milestones to achieve which will be crucial to measure the progress of the proposal. The proposer have also provided a budget breakdown which comes handy while auditing the development of the proposal.  They have provided a clear monthly metrices which will be helpful to track the progress of the proposal.\nThe proposer have also provided how the success for this proposal will be. Taking all these information into account it should be enough to measure the growth and success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5029, "q0": "The Eggworm team wants to create a platform where they collate the best Japanese Cardano content and make it all accessible in one place and then provide English translations for it. They plan to focus on educative and entertaining content from Japan and promote it to English-speaking audiences. They will leverage their connections with the Cardano content creators in Japan and use their experience in campaign management to reach their audiences. The proposal could have used the names and profile links of some of the Cardano content creators whom the proposer has connections with. The proposal’s impact is based on the quality of the content, quality of translations, and the strength of the campaign. \n\nNote: There is another very similar proposal by this team. The only difference is that they mention translations for the content in this proposal. Obviously, the campaigns would target different audiences. It is not clear if the content remains the same or not.\nThe rating is a reflection of that.\n", "q0r": 4, "q1": "The proposer is the co-founder of eggworm, a media campaign agency. Based on my research, the company has covered quite a few high-profile events and seems to have the necessary experience to create a successful campaign. The proposer will be creating a website and a social network page where content will be filtered, collated, and translated. Then they organize campaigns to promote it to English-speaking audiences. Based on the relevant experience, I believe that it’s highly likely that the proposal will be implemented. Usually, the translation costs are based on the number of translations. Since the budget is not broken down based on the number of translations done, it’s tough to assess that part of the budget. The rating is a reflection of the above rationale.\n", "q1r": 4, "q2": "The auditability is based on reports of Cardano Japanese content translated, audit of existing web traffic (SEO,SNS), number of commits on the code before the website and the Social Network pages go live. It’s unclear why Git commits are an auditability criterion.\nAfter the website and Social Network pages go live, the audibility criterion would be the number of blogs and articles, page views, clicks, and traffic generated through the campaign. The auditability is fairly clear but more details on tools used to track traffic generation would have helped assess better. Above is the rating based on the rationale.\n", "q2r": 4, "assessor": "z_assessor_2663", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6283, "q0": "The main objective of this proposal is to raise awareness, among english speakers both in Japan and abroad, of Cardano activities and projects taking place in Japan in order for the Japanese Cardano Community, to grow its audience abroad. The project responds to the challenge in the sense that it focuses on Japan and is centred on people who are within the Asian context. Its reach however extends beyond Asia to the \"western audience\" as the proposer puts it. \n\nTHe focus of the challenge however is on how to grow the Cardano ecosystem in East Asia. I would kindly suggest that the proposer considers refocusing the objective of the proposal to not only creating awareness within and outside Japan, but creating awareness in order to facilitate linkages and collaborations among Cardano projects in Asia and those in other parts of the world such that the synergy from such collaborations will cause exponential growth for the Cardano community in Asia first and elsewhere. This would likely enhance the impact of the proposal and its potential to meet the objectives of the \"Grow Asia Grow Cardano\"challenge.", "q0r": 3, "q1": "The proposal has a clear implementation plan for what is expected to be done during the 3 month period of the project, with a monthly breakdown of activities. The first month is dedicated to audit, taking inventory and setting up a website. The second month is for the actual work of translating blogs and articles into english etc. It would be good however to know how many blogs or articles the proposer intends to upload within the project period as a goal setting measure. \n\nThe proposal could be enhanced with more information and clarification on how the project will be implemented. For instance the proposal talks about providing translations for partner blogs and articles, partner videos and photos. Does the proposer intend to partner with other blogs to obtain content? This was not mentioned. The budget is clear and budget items are tied to the implementation plan ie. SEO and SNS marketing to promote content on the website, translation etc. The timeline of three months for the implementation of the project is realistic and achievable. In terms of risks however, the proposer only mentions that the project may encounter challenges relating to the disclosure of information and/or identities of persons since reputation is a concern to many. He did not however provide any mitigation measures for managing this risk.\n\nThe proposer is the sole member of the team and has provided information relating to work experience in marketing and PR. He also provides a social media link.", "q1r": 4, "q2": "The proposal will pose no problem in the area of auditability, given the metrics the proposer has provided as a basis for determining progress of the project. Metrics to be measured are presented on a month by month basis and at the end of the project, reports will be provided on growth in the overall reach of the website in terms of Page views, clicks, SNS engagement . THe community can equally track progress from the website", "q2r": 5, "assessor": "z_assessor_2803", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11409, "q0": "Cardano has overcome straight regulatory hurdles to finally launch on Bitpoint in Japan. After a week of pushing all time highs , Charles Hoskinsons brainchild has announced the listing of ADA following months of box ticking for Tokyo's licensing regime. The cryptocurrency will launch for Japanese customers on the country's most popular exchange Bitpoint. Japan's cryptocurrency comes as part of wider straight financial controls aimed at protecting Japanese investors from financial volatility, scams and mis-selling. Tokyo's regulatory agency has established dedicated crypto section, as well as a panel of financial experts to help government digital and decentralised finance. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The plan of proposal has a timeline of 3 months including performing investory of existing Japanese and audit of existing web traffic, purchasing domain, server and establishing homepage. Creating original blogs, articles and videos in English and populating the homepage with content. Promoting the content with campaigns. The budget breakdown is clearly outlined and is reasonably achievable. The people working with the proposal has an international marketing professional and creative specialist in events , marketing and PR.  Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project includes numbering blogs and articles translated and written, and number of videos translated. Reporting detailed traffic through SNS and SEo campaign. The metrics provided clearly align with proposal goal and timeline, it surely address the challenge requirements. The budget is brokendown clearly and is acceptable. By articulately communicating the message of Japanese Cardano Community to western and English speaking audiance the success can be achieved.  The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 11721, "q0": "disclaimer: I do not live in japan on a permanent basis but have visited the place on multiple occasions and have connections in the country as friends. Understanding the granular nuances of the local culture may not be my forte, but as I am from the region, there are similar aspects to some cultures in neighboring countries that i can relate to.\n\nthe proposal is well aligned with the challenge setting, to grow the cardano ecosystem in east asia. i'm not extremely involved in the japanese community of cardano, but i'm sure they have great thinkers and doers in the community that develops and contributes and use cardano locally in their own way. we, as english speaking citizens, do not have sight into their ideas and work, and i believe in the additional value and impact this project can provide to the cardano ecosystem, if executed well. we will reduce language and knowledge barriers, opening a whole new bottle of knowledge in that part of the world.\n\ni also apprevciate that the proposer was able to share a little about what particular actions they are going to take to get the impact they desire, such as providing translations for different media platforms, the medium in which they intend to present it, and other services. it helps to tie in their actions to the desired impact.\n\nthe risks listed are fair, and i understand the local culture where appearance and reputation is crucial. private relationships matters alot in the regional and local context. however, i do not see this as a huge hurdle as the ideas and contents may be shared as well from the japan community, if its comes under the project team's radar.", "q0r": 5, "q1": "the timeline roadmap describes a reasonable 3 month plan, each with specific tasks to do. This is excellent as the actions are granular enough to understand what the team will be up to.\n\nBudget breakdown can be improved. Attaching figures for each activity is fine, but more details are needed to know if rates for employees are fair, and if the timeline is realistic. for example, they have 3 tasks to complete in the first month. 1 person at a high rate / cost may not cut it, perhaps the tasks requires 2-3 people at lower rates. this is important to distingusih if the budget attached to timelines are realistic. additionally, the people listed is only one team member, Nick, making me doubt he has more members of a team working on this, and he's enjoying the funding as a single resource. however, if the proposal is taken at face value, the company behind the proposal, eggworm, has a team to it and i'm assuming here that it is not solely nick working on the project. for this ambiguity, i can only afford a rating of 3. ", "q1r": 3, "q2": "the measures of KPIs that are set for themselves is excellent, attaching and relating back to the activites described in their timeline for each month. However, it can be improved  by:\n1. stating clear numberic targets for each of the measures, not just stating that a report will be produced. what are the expected numbers? so that voters can know if the aspiration is realistic.\n2. for all the reports they mentioned, what will be the medium of communication? through a dedicated site that they will develop? \n\nif these were provided, we can have more confidence that the project will be tracked well and heading towards success", "q2r": 4, "assessor": "z_assessor_3270", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13557, "q0": "The proposer wishes to promote the Japanese Cardano Community to the English-speaking world. As of now, not many influencers or KOLs are talking about Cardano on social media. With this campaign, people who are interested in Cardano and Japanese culture, will be more involved and become part of the community. Although, it would be nice to give us (PA, vPa, voter) some examples of the Japanese Cardano Community worth sharing with the world so that we are sure to vote for this project.", "q0r": 4, "q1": "The project timeline is relatively short, only 3 months. Within 3 months, the proposer has given us a detailed plan on how they will implement the project. The budget is relatively reasonable considering that this project is carried out by an agency. For the record, this agency has collaborated with many brands such as Onitsuka Tiger, Beats by Dre x Pigalle, Google, and many more (https://www.eggworm.jp/en/our-work). With this experience, I believe that this project will succeed on schedule.", "q1r": 5, "q2": "The proposer has provided us with a roadmap that must be completed within 3 months of implementation. Each month has a different target that is reasonable and well thought out. Although the proposer has not provided us with a public channel to achieve this target, so I suggest that we can look at this target publicly. I also suggest if this project has been successfully implemented, future projects will not only promote the Japan-Cardano Community, but the Cardano Ecosystem in general so that many people can know about the mass adoption of decentralization in everyday life.", "q2r": 4, "assessor": "z_assessor_3688", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13861, "q0": "The Japanese Cardano Community is growing and producing super interesting dynamics but are somehow isolated by the language barrier. This proposal aims to build a platform where the Japanese Cardano Community will be able to share their dynamics and work in the English language so the whole of the Cardano Community will get to know what is already happening in Japan towards Cardano technology. Creating an English language Cardano hub in Japan might enhance communication and internal dynamics within the international Catalyst Community and this will certainly enhance the whole of the Catalyst Community. Having all the valuable content that is being produced in the Japanese Cardano Community available for the whole Cardano Community will bring value and interest to all Japanese Culture fans. Enhancing communication channels between every Cardano Community is fundamental if we want to grow and expand our activities. This proposal effectively addresses the challenge of helping the East Asia Cardano Community improve and enhance and therefore the whole of the Cardano Catalyst Community. ", "q0r": 5, "q1": "Team experience is not very specific and this might be the central hurdle this proposal will face in order to be successfully implemented. Marketing experience might not be enough to develop an ambitious translation platform where all Japanese content will be uploaded. They have experience in brand alliances and this might be just what they are needing to do, building a strong alliance with a translation company or team to assure and guarantee that the ambitious project will be feasible. Key milestones are fine but the timeline might be too optimistic. Translating all Japanese content and dynamics might take more than just one month. They could easily check timing measures with a translating team that would help them set realistic goals in terms of time and schedule. Budget breakdown seems also too optimistic, especially in  the translation area.", "q1r": 3, "q2": "Auditable milestones are detailed and would be sufficient if they specified communication channels and strategies in order to correctly share the information gathered and the progress made with the whole of the Catalyst Community. This process will already require a translation instance that could also be problematic and take more than a month. It might be interesting for this proposal to consider the first stage of funding the gathering and translation of a first Japanese Cardano Community survey. The next step could be the translation of the information and content they have found. ", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "From on-site, in Japan - we will create original content and partner with existing creators to help share the message of the Japanese Cardano Community with the English speaking world.", "experience": "Eggworm as an agency has spent over a decade establishing valuable working relationships between brands, companies and communities in Japan. We create experiences that empower our partners and bring their brand stories to life."}