{"id": 422893, "author": "silvia.ecclesia", "title": "Cardano for Asia - impact ventures", "url": "https://cardano.ideascale.com/a/dtd/422893-48088", "category": 26602, "amount": 25000, "description": "Cardano can greatly benefit impact entrepreneurs in Asia but there is not much awareness on it and entrepreneurs would need to learn about the potential of blockchain and the Cardano network.", "f6_no_assessments": 14, "f6_rating": 4.452380952380952, "videos": [], "media": [], "f6_assessments": [{"id": 3844, "q0": "This proposal talks about how to get the opportunity to connect with impact entrepreneurs in Asia to understand their knowledge and needs and give them some introductory workshops on blockchain and Cardano and the potential benefits in Project Catalyst.\nThe proposer anticipates that the outcomes of the projects described in the proposal will set a strong basis for the further development of relevant blockchain-based business solutions across 'Accelerate 2030'.\nThe proposal is addressing this challenge in terms of Asian companies that are introduced to blockchain and Cardano, among others. Thus, more impact entrepreneurs will contribute to Cardano and grow the ecosystem.\nFew risks were mentioned with mitigating factors explained effectively.\nThis proposal addresses the challenge effectively.", "q0r": 4, "q1": "The comprehensive plan provided in this proposal shows a project roadmap from August 2022 to February 2023. This period has been subdivided into clear timelines such as August -September 2022. and so on , with activities explained in detail.\nThe deliverables explained will really make this proposal successful, such as the co-designed survey among Accelerator 2030 and project catalyst.\nThe budget of $24,950 is reasonable and it is divided into workable budgets that make sense.\nThe team consists of 5 experts whose names and credentials have been outlined in the proposal. The team members are part of Impact Hub in various countries and are capable of delivering a good project.\nThe experiences and the plan provided point to the successful implementation of the proposal. ", "q1r": 4, "q2": "The progress of the project will be done through the metrics provided as the number of Asian companies surveyed, the number of companies introduced, etc.\nSuccess at the end of the project will be seen as having 80 responses from the initial survey; educating at least 20 - 30+ entrepreneurs and connecting them to Cardano ecosystems.\nThe information provided is sufficient to audit the progress and success of the proposal. ", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3877, "q0": "A great idea, it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge poses, it can expand rapidly and large to many other places, they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I would like to see this project again in the next Foundation if this proposal is not Funded in this Fund. A lot of entrepreneurs and their businesses are not aware of the potential of Blockchain technology, Cardano, and the Catalyst ecosystem. I think it's a good idea to spread the great apps in the industry to business leaders in Asia. The impact of this project is quite large,\n\nThe solution of this proposed idea is excellent, it identifies almost all the problems that need to be solved in this challenge, and the author's argument through the description is logical and clear. clear and complete. With the two steps outlined in the description: Survey a group of over 100 entrepreneurs and Host 3 virtual demos. Besides, under the support of the Impact Hub data platform. This shows that this is a long-term project, and the idea in this Fund 9 is just the beginning, however, most entrepreneurs and businesses are in a busy state, constantly producing, the author needs to offer more specific solutions on the enterprise approach for surveying and disseminating knowledge most effectively.\n\nThe project has a detailed description of some implementation risks, in addition to some suggested solutions by the author to overcome them, but the community needs to be informed for more solutions to these problems. . That risk if the Scheme is funded. What will the author do if the number of surveys does not meet the set goals, as well as the quality of the answers in the survey, besides, how do we control the answers coming from the people themselves? the owner of that account?\n", "q0r": 4, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable. Based on the experience gained from Impact Hub as well as the knowledge of CardaShift, this is a suitable process for this recommendation.\n\n The project budget required less than 20% of the total funding of this challenge, compared to the information provided by the project, all expenditures for the project were clear and explained very clearly and transparently. White. The budget analysis table is quite complete but needs more details, in addition, in my opinion, the author should watch out for price slippage, which is when the price of ADA at the time of proposal and the time of disbursement. Consider the project.\n\nHuman resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that they are entirely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project is Silvia Ecclesia, and collaborators Stephanie Arrowsmith, Ljupka Mitrinovska, Mala Henriques, Carol Chou, and Skye Gao show that this is an experienced team in working on this project, however, the author please provide more links to determine the identity reputation such as LinkedIn, Facebook, Twitter, Discord, ... for the community to verify identity easily and practically.\n", "q1r": 3, "q2": "This project provides KPIs for accomplishing the project's goals, all of which are easy to measure thanks to the metrics provided by the project, but they are difficult to test during implementation. The community cares about where and how these metrics are checked, which improves project transparency.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and testing has achieved considerable initial success which is amazing.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5254, "q0": "Blockchain technology in general and Cardano are quite new and currently the application is quite limited. However, with its outstanding features such as decentralization, transparency, etc., it will be widely applied in the future. And the people who will pioneer the application of new technologies in real life are entrepreneurs. Asia is an area with high economic growth, and the number of entrepreneurs also increases exponentially, so if these people can know about Cardano, it is a great thing for the growth of the Cardano community in Asia.\n\nYour recommendation is to include Cardano content in the workshops of Impact Hub, a global network of 24,250 people across 12 locations in Asia-Pacific, in conjunction with Accelerate2030, a global program supporting entrepreneurs from & emerging markets, in 33 countries, supporting nearly 500 entrepreneurs, with a strong presence in Asia. These two communities are quite large, so bringing Cardano into these two organizations will help Cardano reach a lot of entrepreneurs and maybe they will be the ones who will build potential projects on the Cardano Blockchain.\n\nIn order to the contents of the workshop relevant to the reality and needs of the participants, the proposers will conduct a survey of 100+ impact-driven entrepreneurs in innovation in Asia on Blockchain and Cardano, this is a very effective and professional approach. Based on the survey results, 03 virtual workshops will be organized with the expectation of reaching 30+ companies across Asia, to introduce them to Cardano and Project Catalyst. I completely agree with the above approach of the project.", "q0r": 5, "q1": "The proposal's roadmap is 03 months, with each main job described in detail according to each logical timeline from Project inception to Launch of Survey & Application Process and finally Intro workshops on Blockchain and Cardano. Quite simple and easy to understand for a project related to organizing workshops.\n\nThe total budget you want to receive for this project is $24,950 for 03 vitural workshops. The costs to implement for the project are also stated. In my opinion, this cost is reasonable and acceptable.\n\nJoining this proposal are 05 members from many locations of the world such as Jakarta - Indonesia, Geneva - Switzerland, Medellin - Colombia, Shanghai - China. With a lot of experience in the field of business networking as mentioned in the proposal, I believe that the group will successfully complete 03 workshops as committed to high-quality content, bringing value to listeners as well as customers. expanding Cardano's image to entrepreneurs in Asia.", "q1r": 5, "q2": "The metrics to measure performance mentioned in your proposal are: “Number of Asian companies to understand their needs for Cardano-based solutions. Number of Asian companies introduced to blockchain and Cardano. Number of use cases developed with Asian companies for solutions on the Cardano blockchain. Number of audience reached in a communications campaign in project locations.”, these metrics are reasonable for the kind of proposal.\n\nWith the experience and professional organization of the project members, I believe the results will be more than the number you are aiming for is 80 responses the survey and +30 companies can join the workshops to be education about Cardano and Catalyst program.", "q2r": 5, "assessor": "z_assessor_2678", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6262, "q0": "This proposal seeks funding to connect with impact entrepreneurs in Asia in order to understand their knowledge and needs and offer them intro workshops on blockchain and Cardano, and the potential of participation in Project Catalyst.\nThe problem is clearly presented, Cardano can greatly benefit impact entrepreneurs in Asia but there is no awareness.\nThis proposal is clearly in line with the Grow East Asia, Grow Cardano challenge goals.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer foresees two major risks for the success of this project and provides sound mitigation strategies to address them.\nThe proposal presents a strong explanatory plan for the roadmap of the project and outlines the main deliverables. We could see that the project spans from August 2022 to February 2023.\nThe budget of the proposal is clear however it is organized in lump sums for task rather than experts needed, hours per expert, hourly rate. The proposer also fails to explain the pricing model that he is using.\nThe team is presented well, however the team members did not provide CVs or linkedin accounts in order to support their claims and for additional research.\nFor the scope of the work laid out in this proposal, the proposers will not return for furder funding from Catalyst, however for further development or expansion of the project the proposers will come back to Catalyst for funding.\nThis proposer has 4 proposals in fund 9 for a total ask of $128500.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The proposers have experience with tracking the development of such projects and have outlined a list of KPIs that will be measured. Also the proposer presents a list of deliverables in the plan of the proposal that the community could use to assess the progress of this project. Unfortunately, the proposer does not present an accessible channel where the information for the progress of the project will be presented in order for the community to audit the progress.\nThe success metrics are presented and supported by concrete numbers against which to compare.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7145, "q0": "I am really excited to see a proposal like this coming because it drives blockchain adoption, more specifically Cardano, to entrepreneurs. The problem right now is that many companies and entrepreneurs are simply not aware of the opportunity surrounding blockchain. Which is why the proposers, Impact Hub Asia Pacific X Accelerate2030, are planning to facilitate discussions on the entrepreneurs' business needs or potential usecases. They do it by conducting a survey of more than 100 entrepreneurs in Asia regarding their needs, for example, improving traceability and supply chain management, and delivering 3 workshops for participating companies who are interested and selected to join. Those companies would then be introduced to Project Catalyst to unlock funding opportunities. It is going to be huge if the project is successfully implemented, and those companies are submitting their ideas because their resources are far superior compared to current proposals, and they could drive mass adoption much more quickly. Project Catalyst might have to create a new challenge setting in Fund 11+ specifically for proposals like this because it is game-changing. In the end, I am strongly positive about the scale of contribution this proposal would have because those companies and entrepreneurs will bring ideas on a scale larger than what we currently have.", "q0r": 5, "q1": "Unfortunately, I can’t strongly endorse this proposal simply because the questions and materials about the survey and workshops are not present in the proposal. I understand that the information is not currently available and is already allocated in the timeline, but it’s also hard for the community to completely determine the project feasibility without it. That being said, all the components are being put in the right place. The team members are incredibly well-versed in the world of entrepreneurship, with years of experience behind them. The budget is broken down into identifiable items. Although the numbers are close estimates for now, I still concur that the amount is reasonable considering they plan to deliver on four locations and three workshops. Although small, there is a small difference of 50USD in the budget breakdown (24950) and the budget requested section (25000), which needs a small clarification. Their provided timeline is sound. I would imagine this proposal isn’t the only project they are running right now, so I consider the seven month implementation to be flexible and realistic enough. I applaud the proposer initiative to mitigate the challenge of survey interests and language barrier by offering the survey as a ticket to the workshops and translating the content using their Impact Hub local networks. Another thing I really admire is the collaboration with Cardashift, Cardano School, and Cardano Foundation for the workshops because they need blockchain expertise (that is one of the main concerns when delivering a workshop) and this would also enable future collaborations.", "q1r": 4, "q2": "The proposer targets are ambitious; they aim to get 80 responses, educate 20+ entrepreneurs, deliver 2-3 workshops, and reach 30+ companies within 4 different locations. The milestones are clear and divided into timespans. We could see their overarching plan based on the roadmap provided. There is no information about the availability of the survey results or workshops, so one would assume they won’t be shared publicly with the community. The methods of tracking progress are also absent in the proposal, but it could be done through a regular update report through Coodinator. Overall, I am confident the current information is enough for us to audit their progress.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 7884, "q0": "The proposal at hand address an major issue of awareness about cardano , a entrepreneur would need to learn about the potential of block chain and the cardano network, the proposer came up with the solution this proposal offers an unparalleled opportunity to increase awareness and understand the cardano in Asia through global impact hug network accross the world.  the proposer offer a workshop to enterpreneur to understand about the cardano and block chain, workshop related to servey a pool of 100+ impact driven enterprenure , deliver 3 virtual workshop which clearly helps to understand about cardano. This workshop offered to 30+ companies accross the Asia and to provide knowledge about block chain technology. The challenge that proposed to submit to expanding of cardano adoption in East Asia by engaging with Innovative and entapped market of impact enterprenure metrics we will use to measure our success. Asian companies survey , communication leads to success. The challenge or risk they face is language barrier they may find difficult in some areas in Asia so they found a required action to overcome i.e translator and responses of people and action to overcome is ongoing relationship with enterprenure this would be the proposal.", "q0r": 5, "q1": "The proposal comes with a magnificant plan that explains the key milestone that the team has planned to achieve the proposer have provided us a time line in na monthly project way by sharing a monthly project road map like project inception servey, workshop on block chain and cardano to spread awareness to the entrepreneur and the output is also clearly described or explained in the proposal the team requested for the total budget breakdown is $ 24,950 USD and they have also clearly explained how they utilise and how are they going to segregate the fund to different purposes and the team members who all will be working in this project and they all put together to succeed in this project to make idea into reality is very reliable. The members carry a lot of experience and skills from there previous fund of working in other proposals, also the members of there team working on other proposals in this funds and they assured to come back for the later round for further funding to catalyst and they assured to come back with the new ideas and This shows the passion and future plan for the proposal", "q1r": 5, "q2": "The proposal along with its wonderfully laid out game plan, also comes with excellent ideas to measure it's progress. They key measurable metrics are all very apt to the challenge expectations and are very lucid by defination. This proposal is highly auditable for the deliverables and at project inception, they will set up a monitoring and evaluation plan to track the progress based on the project plan and KPIs outline. Sucess for the project metric are clearly explained in detail. In an ideal scenario we will be able to educate a significant number of enterprenure and have a significant group take their business it will integrating cardano in their business it will conducted in synergy with a funded projects in catalyst implementation similar activities in Africa to know about the cardano to enterprenure in Africa. The proposal coming into this round with a lot of modules already funded and prepared along with many proposals submitted in this funding round can sure make a collective impact and the society there is no about that it will provide all necessary assistance to make sure the auditing process turns out to be smooth and prolific.", "q2r": 5, "assessor": "z_assessor_2930", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8155, "q0": "This proposal offers an opportunity to raise awareness of Cardano among entrepreneurs in Asia through Impact Hub - a global network of impact hubs. It is the world's largest network focused on building entrepreneurial communities to create impact at scale, with over 16,000 members in over 100 locations around the world. This project will be implemented through a partnership between Impact Hub Asia Pacific and the largest program of the Accelerate2030 network. Accelerate2030 works with entrepreneurs around the world, most of whom are still unaware of the potential of blockchain technology. This project will collect detailed information and data on the needs of these entrepreneurs and introduce them to blockchain & Cardano. Ultimately, this project aims to provide entrepreneurs with the knowledge and support to integrate blockchain and use it as an incentive to benefit the people and issues they serve. The proposal will conduct a survey of a group of 100 entrepreneurs to explore their current status and needs with blockchain, especially Cardano; they will then host 3 virtual showcases on how entrepreneurs can benefit from using blockchain in their businesses and drive Cardano adoption in Asia. As such, the project will help expand Cardano adoption in East Asia, in line with the challenge's goals. In addition, the proposal also introduces risks of survey implementation and language, they also have a solution to overcome them.\n", "q0r": 5, "q1": "The project has a clear and specific roadmap as follows: 8, 9/ 2022 to launch the project, design the survey, set the criteria for selecting participating companies; October and November 2022 to launch the survey and application process; 1,2/2023 will hold an introductory seminar on Blockchain and Cardano. With this roadmap, the project can be successfully implemented.\n\nThe project requires a budget of 24,950 USD for tasks such as survey design, survey implementation, response analysis, workshop organization... However, the project has not detailed the cost of conducting the survey 3,000 USD for each location, 3 locations are 12,000 USD including what costs, so it is difficult to assess the reasonableness of this expense. In addition, the detailed budget section and the Amount Requested section are different $50.\n\nProject implementation personnel are leaders and members of Impact Hub such as Stephanie Arrowsmith Head of Asia - Pacific at Impact Hub and co-founder of Impact Hub Jakarta; Ljupka Mitrinovska - Co-Founder and Global Program Director of Accelerate2030, Impact Hub Geneva…I don't see them stating that they have any qualifications or knowledge about Blockchain, Cardano. If they are not experts in Blockchain, Cardano, they should add members who are experts, qualified and knowledgeable about Blockchain and Cardano to jointly implement the project.", "q1r": 4, "q2": "The project provides success metrics such as: Asian companies surveyed to understand their needs for Cardano-based solutions, Asian companies introduced to blockchain and Cardano, Asian companies for solutions on the Cardano blockchain, audience reached in a communications campaign in project locations. They also set a target of 80 responses from the initial survey, training a significant amount (at least 20, 30) of entrepreneurs implementing Cardano integration into their businesses. These numbers are controllable by the community.", "q2r": 4, "assessor": "z_assessor_2957", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8421, "q0": "Proposers who are members of the Impact Hub provide ideas so that the cardano blockchain can be used by many entrepreneurs to build their businesses. This was done in 2 steps, surveying entrepreneurs in several countries in Asia and also conducting workshops by cooperating with experienced parties in this case, cardashift and cardano school. I think this proposal can certainly address the challenges in this category because the indicators for the metrics that are written are clearly targeted, which will definitely raise awareness for cardano and blockchain. Solutions to address the risks that occur have also been described. It is better if prior to conducting surveys and workshops, also conducting campaigns on social media and mainstream media so that the message to be conveyed to entrepreneurs can arrive earlier.", "q0r": 4, "q1": "From the written team composition, the name of the proposer did not appear. Maybe as a man behind-the-scenes for the project. The team composition is also not included with the url for example to linkedin. The timeline and budget presented are larger in the survey than during the workshop. I think it's normal because we have to know the initial understanding of the targeted entrepreneurs first before starting the workshop on blockchain and cardano. Doing a survey will of course introduce cardano to these entrepreneurs.", "q1r": 3, "q2": "In my opinion, the audit process presented is good with clear targets, but as a community I can't see how far the proposer and team have achieved. There should be media to explain to the public the achievement of the target, for example to the information technology communities, to the mainstream media, social media, websites, blogs and others that are accessed in general. The success of the project I think is well described with the hope that there will be adoption of the use of the cardano blockchain in business management by entrepreneurs in Asia.", "q2r": 4, "assessor": "z_assessor_2982", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8966, "q0": "As there are many entrepreneurs who are not aware of Cardano eco system and have no idea blockchain potential in the future , Hence to overcome such cases the proposer wants to conduct 3 workshops for entrepreneurs, so that they can understand the potential of the blockchain and later they can tie with ADA holders as investment and help in growth of their company ,and as well growth of demand of ADA in the future , by this idea blockchain economy can grow stronger and wider in the Asia , so that ADA can be even used as medium to exchange money in the future, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The biggest challenge here is asking Entrepreneurs to join these workshops to attend , as entrpreneur's will usual be busy with their work ,making them to join will definitely be a challenge here, but the proposer's team has already worked on similar proposal in 2016 with the name Accelerate2030,a global program supporting 450+ entrepreneurs from emerging markets participated in the program. Since with the proven experience provided completing one more workshop for Asian entrepreneurs can be achievable as the team members have worked on developing entrepreneurial skills and With Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has a great goal where they want Entrepreneurs to make ADA holders part of their future business integration , so the proposer want conduct workshop to Entrepreneurs so that they can understand the future markets of blockchain , which has been clearly mentioned in proposed solution of audit, the audit has introduced all the team members that will be working on this project, the presented audit has clear timeline to complete the project , the audit even contains decent budget breaking idea, the audit has displayed the proven experience of team through Accelerate 2030, with good key indicators provided to measure the success rate of the project, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9370, "q0": "I like the suggestion of Connecting with influential entrepreneurs in Asia to understand their knowledge and needs, and provide them with blockchain and Cardano introductory workshops, as well as potential participation. join Project Catalyst. Because Asian countries are becoming the world's blockchain focus. Example It is estimated that daily cryptocurrency transactions in South Korea account for 20% of the world's. In Thailand, Central Bank is researching blockchain applications in operations. Meanwhile, China is also leading in crypto innovation and sales. South Korea is one of many countries in Asia that not only accept cryptocurrencies, but the government is also promoting programs in this area. Typically, the Singapore Government has begun testing blockchain programs and providing grants to companies in this field. Programs often prioritize promoting advanced technology and innovation. Companies like Fluffar, a startup that blends blockchain with augmented reality, have the opportunity to thrive in this community. That's why projects like yours are needed to build entrepreneurial communities to make large-scale impact to raise awareness and understand the opportunity for Cardano in Asia.", "q0r": 5, "q1": "\"With a clear implementation plan and specific metrics, the project's execution is completely feasible. You also explain in detail the project startup example work and then you clearly explain what the project startup includes. I like such clear details.\nThe budget is quite reasonable for a project implemented in a few months. You have calculated the cost but there is no corresponding time, you just sum up the amount to use. Your group has good and experienced members. I hope this project goes well.\"", "q1r": 5, "q2": "I find that the proposed measures have enough criteria to evaluate the effectiveness of the project. The information provided to evaluate the idea is quite complete and factual. I don't know how you will set up a monitoring and evaluation plan to track progress based on the project plan and KPIs outlined below. You should mention it. I find progress with specific goals can easily assess the speed of work satisfactory or not. Therefore, you should present your goals more easily, written in paragraphs without newlines I find it quite difficult to read. But in general, in my opinion, the proposed measures have enough criteria to evaluate the effectiveness of the project.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10856, "q0": "The idea of ​​this project is very good. The target of this project is entrepreneurs who are solving pressing social and environmental problems. This project will gather insights and data on these entrepreneurs’ needs and introduce them to blockchain & Cardano. The proposal team did a great job of introducing the project and describing the steps to take. Two risks are seen by the proposed team: the number of respondents responding to the survey and the language barrier. I think these are very real risks that project ghosts face. It's great when they see the problem and find a solution. I am confident that the success of the project will expand the adoption of Cardano in East Asia. At the same time, blockchain will become a driving force to serve social and environmental issues.", "q0r": 5, "q1": "The project is deployed through the global Impact Hub Network, where a community of entrepreneurs is available, with 16,000+ members in 100+ locations around the world. This helps to show the feasibility of the project better. The project also includes qualified and experienced members. The proposed team presented a fairly basic plan of the main task for each month. In the end, I think the budget is well allocated and it is presented quite clearly for us to understand.", "q1r": 4, "q2": "The proposal has indicators to measure project progress and clear goals to measure success. The only thing this project needs to add to make the project audit better is a way to make this information available to the Cardano community. A report or a platform to update project progress is necessary.", "q2r": 4, "assessor": "z_assessor_3196", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11306, "q0": "Entrepreneurs in Asia are not very aware that Cardano can be of great benefit. So the team came up with a solution to connect with entrepreneurs and provide them with introductory seminars on blockchain and Cardano, as well as the potential to participate in Project Catalyst. The two-step process of organizing seminars: surveying over 100 entrepreneurs driving impact in innovation ecosystems in Asia and organizing 3 seminars on the benefits of entrepreneurs using Blockchain in the industry their business. I see this proposal as providing a great opportunity to raise awareness about Blockchain and Cardano network in Asia especially entrepreneurs. The proposed key indicators and goals match the challenge. The team raised the risks when implementing the project. Surveying, collecting information, understanding the needs of entrepreneurs is very difficult, besides the language barrier is also a challenge for them. But the group also offers very reasonable and detailed solutions to reduce risks. In short, I find this proposal scalable to address future challenges.\n", "q0r": 5, "q1": "The team provides a reasonable and favorable plan for the implementation of the project. They not only show what's going on with specific timelines, but also how it's done. August-September they work with the Project Catalyst team to select Impact Centers, survey design, workshops and selection criteria for participating companies. October - November they surveyed more than 100 Impact Hub Network companies to collect information. Jan - Feb 2023 they hold 3 seminars for more than 30 companies expressing interest in blockchain integration in their businesses. Budgets are clearly outlined and broken down for specific identifiable tasks. The total budget requested by the team is 24,950 USD to be paid for the design, survey implementation, and conference organization in a very detailed and reasonable manner. The team provides detailed information about team members, who are people with long-term experience in impact management in the Impact Hub network. But I don't see the proponent providing proof (Link) so that people can verify and easily follow.\n", "q1r": 4, "q2": "The team provides sufficient indicators/KPIs to evaluate the progress and success of the proposal. The community can measure the progress of the project through indicators: Asian companies surveyed, Asian companies introduced to blockchain and Cardano, audience reached in a media campaign in project positions,...The success of the project matches the challenge, when the project ends they will increase the number of entrepreneurs (at least 20, 30+ in excellent cases) who integrated Cardano into their business. Although this project is not a continuation of a previously funded project in Catalyst, I hope this project is successfully implemented to benefit the community and solve future challenges.\n", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11365, "q0": "The problem raised by the proponent reflects the lack of proper awareness of the full development potential of blockchain and the Cardano network by the majority of entrepreneurs in Asia.\n\nCreating a global network that can connect with influential entrepreneurs in Asia to help them have the right understanding of Blockchain and Cadano network will bring enormous benefits in expansion and development. Cadano network development contributes to the awareness of the Cardano community, providing an opportunity to make the world a better place.\n \nThe proposal clearly states its target solutions in solving the set challenges.\nThe special feature of the proposal is to provide knowledge to entrepreneurs about blockchain technology and its potential benefits for their businesses, helping them to be more autonomous in their work. \n\nFacilitating access to Cardano and the opportunity to participate in Project Catalyst across Asia.\nThe proponent's goal of addressing this challenge is to expand Cardano adoption in East Asia.\nThe proponent listed challenges, metrics, and specific challenge solutions for each performance item. This is essential for the successful implementation of the description of the proposal.\nThe potential risks are detailed by the proponent and the way they deal with the risks is really flexible, I appreciate translating into languages ​​accessible to everyone.\nThis proposal fits the challenge.", "q0r": 5, "q1": "The proponent provides a detailed plan of progress and milestones with a clear timeline for accomplishing the goals of the proposal.\n\nThe detailed presentation of expenditure budgets for each item is a prerequisite for the success of this project.\nIn addition, the proponent needs to add the necessary contingency budget to ensure the successful completion of the project.\nThe proposal can also provide more than using the budget from the Catalyst fund, is there any other funding source that can be called for?\n\nThe team involved in this project are people with high expertise, long-term experience in the fields of Blockchain and global connection development, they are also people who hold key positions in companies. countries in Asia and Europe. They have international experience.\n\nThe provision of full details about the title identity, relevant work experience of each team member is a prerequisite for the success of this project.\nHowever, in order to create trust for the community, the proponent needs to provide more profile pictures, social networking sites, affiliate links so that the community can verify.\nWith a professional working team and clearly detailed plans, this is a good opportunity for the successful implementation of the project.", "q1r": 5, "q2": "KPIs are specified by the proponent which makes it possible for the community to audit what the success of the proposal looks like.\nThe success of the project is training a significant number of knowledgeable entrepreneurs to be able to take the first steps in integrating Cardano into their businesses.\nthis shows growth in companies learning about Cardano and further connecting with the Cardano ecosystem and participating in Project Catalyst.\n\nThe sustainable development goals that the proponent presented in detail, with clear timelines, give the community a better overview of what the project can do.\n \nWhile this is not a continuation of a previously funded project in Catalyst, if funded, they will proceed alongside a funded project in Catalyst that is doing similar activities. in Africa.\nThis is clearly a good opportunity to successfully accomplish the objectives described in the proposal.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11722, "q0": "Impact hub is an esatblished organization even before their participation in this funding round of Catalyst. Their global network and establishment, with their presence already rooted in east asia, is in clear synergy with the idea being proposed, aligned to the challenge it's submitted under Grow East Asia, and i can clearly visualize their idea (if successful) to align with the Fund 9 goal #3 of building real world solutions based on the cardano blockchain.\n\nThe credibility of the proposer is undoubted, having years of track record to show for on their websites provided. the approach to the problem statement is clear, and commendable seeing as they start off with a survey for problem sensing, and not just diving right in with the idea execution itself. It is clear that the team has thought this out thoroughly, down to the partnerships they wish to establish for different areas of expertise. \n\nAll in all, an examplary proposal for this IMPACT section that i think deserves the best rating, and if successful, will bring immense value to the cardano blockchain.", "q0r": 5, "q1": "The project roadmap is as clear as a new project can get, on a monthly estimation basis, though something more granular would be appreciated. Timeframe is realistic for delivery. \n\nBudget breakdown can be further improved. For example:\n- Survey design: $2,500 -  Pre-survey research and design\nhow many FTE is involved in this, and at what rate? where would the job be based at, as the price seems pretty steep, for, let's say, 1 freelance worker, to do survey research and design over a 2 month timeframe. more details, if provided in the proposal, would have helped clarify these questions. the same concern is reflected on the other line items for the budget breakdown.\n\ncredibility and experience of the proposing team is well, and am hopeful that their experience can bring success to the project. ", "q1r": 4, "q2": "The proposal falls a little short in terms of providing clarity for measuring the success of the project. The metrics they mentioned to be used to measure success in this AUDITABILITY section were:\n1. # of Asian companies surveyed to understand their needs for Cardano-based solutions\n2. # of Asian companies introduced to blockchain and Cardano\n3. # of use cases developed with Asian companies for solutions on the Cardano blockchain \n4. # of audience reached in a communications campaign in project locations\nand i fully agree with all 4 of these chosen metric, particularly metric #3. However, it is confusing as they mentioned an exactly same statement in the IMPACT section earlier, which only contains metric 1,2, and 4. For whatever reason that the consistency was not maintained in the proposal, i hope to see all 4 metrics being implemented for tracking.\n\nadditionaly, there was no mention of the interval/frequency of updates for all the metrics, and neither the medium of communication. progress tracking monthly on the cardano funding google sheet would not be sufficient. they target for 80 survey responses, and this will be conducted in the Oct-Nov timeframe. this means that the community will only likely get 2 updates, probably one at the end of each month. If the team misses numbers on the Oct numbers showing a very low response rate, there would not be sufficient time or resources for remediation and the project will run the risk of delays. would suggest for a weekly update of progress through a suitable medium, and for the team to prepare a more concrete contingency plan if survey is not well received by the public. \n\nOn that note of a contingency plan for the survey - it is acknowledged that the proposers addressed this concern under project risks under IMPACT, but am not convinced of steps like \"framing the survey as a first step to being invited into a series of workshops and an opportunity to join Project Catalyst\" - this may be insufficient - and \"benefit of local Impact Hubs’ ongoing relationships\" - the website and proposal does not disclose the number of existing relationships they have. if the proposers had provided these details, we can then as assessors work backwards on a funnel of success rate to estimate the possiible number of successful survey respondents\n\ndue to the ambiguity, will only rate this as 3.", "q2r": 3, "assessor": "z_assessor_3270", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Connect with impact entrepreneurs in Asia to understand their knowledge and needs, and offer them intro workshops on blockchain and Cardano, and the potential of participation in Project Catalyst.", "experience": "Impact Hub is a global network of 24,250 people driving change – 4,000+ of whom are spread across 12 locations in Asia-Pacific. In 2016, Impact Hub & UNDP from Geneva launched Accelerate2030: a global program supporting 450+ entrepreneurs from emerging markets."}