{"id": 423157, "author": "jtrube", "title": "Amplify Japanese Cardano Content", "url": "https://cardano.ideascale.com/a/dtd/423157-48088", "category": 26602, "amount": 10000, "description": "Cool things are happening for Cardano in Japan everyday - but reaching audiences outside of the existing community is difficult. Media coverage in general tends to favor speculation over innovation.", "f6_no_assessments": 10, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 1855, "q0": "This proposal addresses the challenge by providing Cardano Japanese contents for brands in Japan. By having brands educated with Cardano blockchain, their involvement can funnel their own existing customers to the Cardano ecosystem. Thus, growing the Cardano ecosystem by having quality brands and users. Other great points are the team have already partnered with Cardano Japanese content creators and they have large Japanese following from their own and partnered medias. The proposal have stated the risks involving participants disclosing themselves. They did not state how they would solve this issue. Possibility to solve this is by having decentralized identities (DIDs) from ATALA Prism.", "q0r": 4, "q1": "The team have provided the breakdown of their timeline of 3 months with achievable milestones. The team intend to produce webpage, server, and market their contents through SEO, SNS, newsletters, and other Japanese media channels. The budget requested for producing webpage development and marketing is reasonable. We know where the funds allocated to for this project. However, not enough breakdown on how many people and hours they will be working to deliver this project. ", "q1r": 4, "q2": "The community can audit based on the team’s reports on their progress. The team will report on their web development progress (from number of Git commits), web traffic, and number of articles written, views and clicks. This is good for the community to measure how successful their delivery on this project. The team could also give metric of the number of brands reached out to them after they learn about Cardano from reading contents produced by the team.", "q2r": 5, "assessor": "z_assessor_2274", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2040, "q0": "\nThe proposal’s aim is to expand the reach of Japanese Cardano Community, stating the problem that there are lots of coverage about speculation in crypto world but no coverage on the innovation part (in Japan). Therefore, their objective is to address this problem by, basically, creating an online hub with informative and entertaining content aiming to amplify the edges outside the Japan.\n\nSince its aim is to increase the reach and opportunities of the Japanese community by expanding it to the western community removing the language barriers – translating blogs, videos, ideas etc – it aligns with this challenge by focusing on improving the opportunities to Japanese community.\n\nThe impact of this proposal, however, is affected by its capabilities of growing/scalability. Since there will always be a human bottleneck – translating, editing, finding content etc – it might become hard to scale in the needed speed.", "q0r": 3, "q1": "To evaluate the proposal’s feasibility, we could analyze some specific points:\n\n1 – Roadmap: It would enhance the proposal if there was more detail in the roadmap part. There was provided an one month time expectation to complete each task, however these tasks could be broken down into smaller ones and provided some milestones allowing us to follow the development in an easier way.\n\n2 – Budget: It would be beneficial to the proposal if it could break into smaller pieces the budget asked, or even give more explanations. Meaning that would be good if the proposal provided an idea of how many content would be possible to translate with the USD 2K asked, or how many hours of videos could be edited with the amount asked. \n\n3 – Team: Although it was provided a link to eggworm portal, we cannot find all the team members there. Furthermore, it was provided only one name in this part of the proposal.\n\n4 – Self fund / scalability: As mentioned before, the scalability is highly correlated with the translating, editing and selecting capability. If there is a large amount of content to be translated, the human will be the bottleneck, avoiding this proposal’s expansion. Another point that should be managed is the self funding part. All the main points of this proposal needs a continuing funding, however it was not provided any plan to support it. \n\n\n5 – Risk management: Besides the risks and mitigation acts proposed, there is always the content choice risk, meaning that there is a necessity of choosing the right content to be translated and edited, mainly in the beginning of this proposal and, moreover, there is the queue risk, meaning that there is the possibility of having more people wanting to have their content translated that the project’s capacity.\n\nTherefore, in order to increase the feasibility’s chance and its success, it might be good to add some modifications in this proposal·", "q1r": 2, "q2": "The auditability is highly correlated with some points:\n1 – roadmap and milestones: as mentioned before, the roadmap provided is general needing more details to allow us to follow its development.\n\n2 – channel: There was not provided an exclusive channel to disclosure all the steps and dev.\n\n3 – KPI and metrics: The KPU and metrics provided are related to the hub access and content views. However, it would be good to know the difference between a Japanese access and a western access, since the goal of this proposal is to create a ‘window’ to the western community into the Japanese innovation and news.\n", "q2r": 2, "assessor": "z_assessor_2298", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2552, "q0": "The team is an established media company and is a great candidate to bring awareness about Cardano in Japan. Indeed, the project falls under the challenge's guidelines and is aligned with them. Also, the project can have a great impact on Cardano adoption in Japan based on the experience of the firm with other big brands. And the scalability doesn't seem to be an issue since this team is an established one.", "q0r": 5, "q1": "Judging from all the links and media items provided by the team, the success likelihood of such a project is pretty high. The team is pretty experienced in the media field and already has been working on the Cardano community and re part of it. Hence, their expertise seems to be aligned with the necessities of the project. Furthermore, the team provides a breakdown of the timeline with detailed explanations of what will be done. The budget is also broken down and explained thoroughly. Risks are also taken into consideration and mitigations are discussed by the team, especially when it comes to the delicacy of dealing with the Japanese population.", "q1r": 5, "q2": "The community can audit the work of the team by checking on its content when it comes to quality and frequency. Since this work will be public, we will have the opportunity to follow through and track the work of the team. Furthermore, the team provides an extensive roadmap with necessary KPIs to keep them accountable and several milestones with deadlines. The delivery dates are also stated clearly in terms of timelines to the nature of the project.", "q2r": 5, "assessor": "z_assessor_2317", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3848, "q0": "This proposal is aiming at creating a promotional campaign for Japanese Cardano content by leveraging their owned and partner media channels. The proposer team is already partnered with Japanese Cardano content in Japanese.\nIn addressing the challenge, having already formed Japanese communities, they intend to support the existing and ongoing efforts by getting as much awareness as possible.\nThe proposer mentioned risks such as disclosure of information and / or identities. \nThe challenge is addressed to some extent. My rating is 4.", "q0r": 4, "q1": "The timeline of the project is 3 months and it is outlined clearly in the proposal. For instance, in the 1st month, they will perform an inventory of existing Japanese language in Cardano content, etc. \nThe proposer mentioned that they will promote the content through SNS, SED, newsletters, and other active Japanese media channels.\nThe total budget requested is $10000 which is reasonable and it is divided into clear smaller budgets to cover web development, web media marketing, Seo marketing, and SNS marketing.\nThe proposer's name is provided as Nick Clarke who is an International marketing professional and creative who specializes in events, marketing and PR. He has established strong and lasting relationships with clients, associates and partners stretching across a variety of industries. \nThe proposer has indicated that he will return for further funding to remain involved in Cardano. \nHe is involved in other proposal in Fund 9 and also working in a previously funded project.\nThe information provided can contribute to the successful implementation of the project. My rating is 4 ", "q1r": 4, "q2": "In tracking the progress of this proposal, the proposer has mentioned that reports detailing an inventory of existing Japanese language content, reports on web development progress will be on GitHub. \nThe progress will be measured by the monthly tasks and based on the number of blogs and articles written, page views, clicks, etc. to mention a few. \nSuccess will be the amplifying of the message of the Cardano community to Japanese-speaking audiences in Japan. This is a new proposal.\nThe information provided can help audit the proposal. My rating is 4.", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3932, "q0": "The problem being things happening in cardano ecosystem isn't reaching people outside the existing community members and on other hand media is covering all the speculation but not the advancement. The proposer wants to resolve it by promoting japanese cardano contents through various  media channels. This will be helpful to reach more audiences and will also help onboard new members into cardano community intern helping cardano ecosystem to grow. Therefore this proposal does addresses the problem", "q0r": 5, "q1": "As per the proposal the proposer's agency already have the experience working for various companies to promote their brands hence this should be sufficient to promote cardano related Japanese content. hence the proposer has the needed skills and experience to successfully carry out the proposal. The proposer has given complete timeline and budget breakdown which will be helpful and also the budget of 10000 seems justified. The proposal also consists of risks and challenges that the proposer may face while implementing the proposal. Therefore with the experience and plan given it is likely the proposal will be implemented successfully", "q1r": 5, "q2": "The proposal do consist of clear timeline and work being broken down for each month this will be helpful to track the progress of the proposal. They have also provided a clear budget breakdown and have taken in account of all the expenses that may arise. The proposer has also given metrics and milestones to achieve within a timeframe all this should be enough to measure the progress of the proposal and also sufficient to measure the  success of the proposal  ", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5031, "q0": "The Eggworm team want to create a platform where they collate the best Japanese Cardano content and make it all accessible in one place. They plan to focus on educative and entertaining content and promote it to the Japnese speaking audiences. They will leverage their connections with the Cardano content creators in Japan and use their experience in campaign management to reach their audiences. The proposal could have used the names and profile links of some of the Cardano content creators whom the proposer has connections with. The proposal’s impact is based on the quality of the content and the strength of the campaign. Due to a lack of clarity of the content providers, the rating is four stars.\n", "q0r": 4, "q1": "The proposer is the co-founder of eggworm, a media campaign agency. Based on my research, the company has covered quite a few high-profile events and seems to have the necessary experience to create a successful campaign. The proposer will be creating a website and a social network page where content will be filtered and collated. Then they organize campaigns to promote it to the Japanese audiences. Based on the relevant experience, I believe that it’s highly likely that the proposal will be implemented. \n", "q1r": 5, "q2": "The auditability is based on reports of Cardano Japanese content, audit of existing web traffic (SEO,SNS), number of commits on the code before the website and the Social Network pages go live. It’s unclear why Git commits are an auditability criterion.\nAfter the website and Social Network pages go live, the audibility criterion would be the number of blogs and articles, page views, clicks, and traffic generated through the campaign. The auditability is fairly clear but more details on tools used to track traffic generation would have helped assess better. Above is the rating based on the rationale.\n", "q2r": 4, "assessor": "z_assessor_2663", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5638, "q0": "The described problem in this proposal fits well within the challenge settings. In a way of an Online campaign, It aims to make more regular people knowledgeable about the Cardano movement in Japan. That addresses the local challenges such as how public perception of similar novel movements can make unknowing people skeptical. \n\nThe value of this project comes in the form of creating a new online hub, expanding social networking, and optimizing search engines. It would be interesting to see more details on how the formerly mentioned criteria are accomplished. For example what exactly goes into “expanding social networking”?\n\nThe key metrics align well with the challenge of East Asia's Cardano growth. More engagement, clicks, and overall engagement with the online hub is definitely a signal of increased participation in the Japanese Cardano community. In this fund setting, growing interest is indeed among the top priority tasks and shows this proposal's direct impact. \n\nThe scalability and future challenges of this project are not mentioned. To raise confidence in the long-term viability of this project this needs to be addressed.\n", "q0r": 4, "q1": "The budget amount demanded seems reasonable at a glance. A more comprehensive breakdown of the 4 cost categories presented would be equitable. We get monthly progress reports as a means to measure the feasibility of the project. I find it realistic that we get details of the overall local growth for Cardano content at the end of the fund. \n\nThe proposer and the associated Japanese-based Eggworm brand agency seem competent for this challenge. The number of team members and the breakdown of technical aspects is not mentioned. To raise the voter's confidence these are the details that are essential. \n\nThey have clearly referenced their evidence of experience in numerous fields such as organizing events, networking, and brand management. It helps the mission that they claim to be knowledgeable about everyday life in Japan. Overall they seem equipped to deal with the risks that they have outlined.\n", "q1r": 4, "q2": "The problem statement is clear and the solution addresses it. Growing the online Cardano community presence in Japan through a campaign satisfies our need for more Japanese-speaking audiences.\n\nThe proposal clearly outlines different tasks for every month of the three-month period. For auditability, we get monthly reports on the success of every work phase. Plans past the three-month period are not mentioned. Since this project will keep running past this fund this section would welcome expanding. \n\nWhen creating the online social hub is completed, measurements of the growing social media engagement will be published. The KPI-s such as page views, clicks, and social media platform interaction work well to detail the growth of the overall reach of this project and also Cardano.", "q2r": 4, "assessor": "z_assessor_2730", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9873, "q0": "The proposal addresses a problem that, if solved, will add value to the cardano ecosystem. However, the proposal does not have detailed metrics about the objectives to be achieved in solving the problems raised. My suggestions is to provide a metric about the targeted of community growth which can be used as a benchmark for assessing the success of this project. Correspondingly, the absence of clear metrics makes this proposal difficult to scale up in the future.", "q0r": 3, "q1": "The proposer already knows the type and number of team members who have the relevant skills and experience for this project. The budget for this project is reasonable and has been broken down. This proposal also has a realistic timetable and also explains how to implement this project. The proposal has also explained the required resources, as well as the technical aspects that the proposer considers crucial for this project. This proposal has also considered the challenges and risks relevant to successful implementation. However, this proposal does not have a clear planning if there is additional funding. My suggestion is to give a brief explanation regarding what will be done if there is further funding, suchs as asking for more funding to enrich content and expand reach by adding collaboration with content creators.", "q1r": 4, "q2": "The proposal has a clear roadmap and milestones. In addition, the proposal also offers evidence that will be included in each milestone. However, the proposal states that the success of the project is amplifying the message of the Cardano Community to Japanese speaking audiences in Japan, whereas the success of this project should focus more on the growth of the cardano community where more people are involved in the cardano community.", "q2r": 4, "assessor": "z_assessor_3122", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11161, "q0": "This proposal aims to serve the Cardano community in Japan by establishing a homepage and SNS channels. And they will be used to upload news and content relating to Cardano in Japan. It is a fact that the Japanese Cardano Community has been attached to Cardano from the beginning. Therefore, it would be great if they had one more place to access information about Cardano. Moreover, the team will also create a Japanese language online hub. This online hub is multi-dimensional, making it a great place for the Cardano community in Japan to interact and entertain each other.", "q0r": 4, "q1": "Honestly, this project is short of member.. Thesedays, the number of Cardano news and contents rising dramatically. Updating news needs to be quick and only one person in charge of the project, no matter how talented, the project will be difficult to implement, especially in the stage of operation. Planning and budget analysis of the proposal are too general. According to the proposal, the project will have 3 months of implementation. However, this is just the process of making the homepage and stopping at promotion. There is no operating phase. Furthermore, the budget breakdown is really weird, there is no basis for the expenses and disbursement stages. As the proponent stated, the project may face some risks but the proponent doesn't seem to have any preparations to deal with or mitigate those risks.", "q1r": 1, "q2": "From my point of view, this section is also too general and not specific. I suggest that the proposer should include specific metrics and KPIs. Specific indicators and KPIs can help the community know whether the project is well implemented or not, superior or worse than the proposer's expectations. Therefore, this will help the community be more proactive in auditing. ", "q2r": 2, "assessor": "z_assessor_3225", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11416, "q0": "Cardano is a decentralised public blockchain and cryptocurrency project and is fully open source. Cardano is developing a smart contract platform that seeks to deliver more advanced features than any protocol previously developed. It is the first blockchain platform and research first driven approach. Trading futures is an alternative to actually buying or selling the underlying crypto. Trading cardano through futures offers several advantages over spot trading of Cardano yet reaching audiance outside the existing community is becoming difficult. Creating promotional campaigns for Japanese Cardano Content has become necessary. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposal is planned in 3months includes platforming an audit of existing web traffic and inventory of existing Japanese language also purchasing domain , server and homepage establishment. Also includes content promotion through SNS, SEO , newsletters and media channels. Detailed budget breakdown is given with proper timeline and the Nick Clarke who is working with the project is an international marketing professional who has done specialization in events , marketing and PR. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Tracking the project progress in three months , first includes detailing an inventory of existing Japanese language content and detailing an audit of existing web traffic and web development progress. The second includes detailing page views, clicks, SNS engagement, blogs and articles written. Third includes detailing traffic through SNS and SEO campaigns. The budget breakdown is quite impressive and success is achieved by amplifying message of Cardano Community to Japanese speaking audiance in Japan. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}], "solution": "We will create a promotional campaign for Japanese Cardano Content by leveraging our owned and partner media channels.", "experience": "Eggworm as an agency has spent over a decade establishing valuable working relationships between brands, companies and communities in Japan. We create experiences that empower our partners and bring their brand stories to life."}