{"id": 423129, "author": "dimitri777", "title": "Cardano in Khmer", "url": "https://cardano.ideascale.com/a/dtd/423129-48088", "category": 26602, "amount": 11150, "description": "Provide translated content taken from official Cardano documentation in the form of Khmer videos about Cardano ecosystem.", "f6_no_assessments": 8, "f6_rating": 3.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2039, "q0": "\nThe problem that this proposal aim to mitigate is the lack of material in Khmer language, which is spoken by 18M people worldwide (https://www.worlddata.info/languages/khmer.php) and it’ll be done by translating official content from the ADA platforms.\n\nDue to ADA objective of being the most used blockchain in the world, it is mandatory to have content in several languages, which will increase its usage and will encourage people to start developing solutions using ADA’s blockchain. Reducing language barriers is quite important when we have a popularity ambition.\n\nTherefore, this proposal aligns with the challenge objective and ADA’s aim.\n\n\nThe proposal’s goal is ti reach the maximum of people as possible, which aligns with the challenge objective.\n\nIn order to be more scalable, it’ll be necessary to hire more translators, since it is a mechanical job, the human is the bottleneck.\n", "q0r": 4, "q1": "The proposal lacks a bit of organization. There is no previous selection of content that will be translated, which might be a problem due to the possibility of choosing a content that people are not interested or a dense material etc, creating a huge risk to its success.\n\nThe budget is well defined. It gives idea of how much material it’s possible to translate with the asked budget. \n \nThe risks were exposed and with the actions to mitigate with is good to analyze its feasibility possibility. However, there is a content poor choice risk, since the team will define which content will be translated. Having few peoples deciding about the content might have a wrong interpretation of the community needs reducing the engagement and its success.\n\n\nThe team is experienced in the translating world and content communication, which is mandatory to this proposal. It was provided LinkedIn links.\n\n\nBeing a purely mechanical proposal, in order to scale it is necessary to have lots of translators, making it possible to increase the rate and quantity of videos.\n\nThat being said, it is probable that the proposal will be done and, if the risks were managed correctly there is a high probability of success.\n", "q1r": 3, "q2": "YT content publication makes it possible to know and verify if the promised content was done, however it is missing a way to verify the making and progress. A way to mitigate it is creating a instagram profile, e.g., to show the making of and progress. This attitude might even enhance the engagement.\n\nDue to the lack of roadmap derailment it is hard to really know what to expect.\n\nThe KPI/metrics/success are all related with the quantity of viewers and interaction, which is a good metric when you’re posting videos and willing to disseminate a content.\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "Please filter this out. We have been rated 3 on points which I have clearly laid out in the proposal which PA has chosen to ignore.."}, {"id": 4458, "q0": "People always love to learn all the new things in their native language, which will help them to have clear idea on the subject, this proposal will be effectively addresses such challenge.\n\nSince proposer not providing any data about Khmer speakers / language users, I think Proposer should explain why Proposer choose to translate Khmer Language. If there any data about our community ask the Khmer translation, it would be great attachment in it. As far as I know, this translation project will have only a small impact on the cardano ecosystem.", "q0r": 3, "q1": "Given the information in the proposal, I do think that the proposal has the potential to be successful since Proposer has more than 30 years of experience in the ministry of languages as a translator. These credentials make me believe that the Proposer will be able to successfully handle this Khmer translation project. The proposers have given a clear and complete roadmap with good goals that I think it can be achieved in the given timeframe. The budgets breakdown of the cost is thought out very well and very well-explained. Those breakdown helped me understand how they will use their requested funds.", "q1r": 4, "q2": "KPIs are already measurable, also that can be used to measure the success of this project. The proposer didn't mention any numbers on their KPIs, so it will be difficult to measure its achievement. I would suggest the proposer add these numbers for easy-to-track progress such as the growth of Youtube channels viewers, or exact numbers they want to achieve (ex. 500 views within 1 month or others) This project certainly offers a solution to the requested problem. A 3 months project seems reasonable with a detailed plan to achieve it. ", "q2r": 4, "assessor": "z_assessor_2553", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 8478, "q0": "By providing Khmer speakers with translated videos, the proposal has the potential to significantly improve the level of understanding they have of the Cardano ecosystem. The proposer claims that there are over 30 million people who are able to speak Khmer all over the world, which is a significant quantity. The proposal will make it simpler for the Khmer-speaking community to access Cardano information by translating documents and creating content videos for Khmer speakers. Additionally, the proposal will open the door for onboarding a large number of new individuals into the community who have very different points of view.\nEven though the proposal includes statistics on the number of Khmer speakers, I believe that it should also include further research on the degree to which Khmer speakers comprehend blockchain technology. Creating movies about blockchain technology should take precedence over posting content regarding the Cardano ecosystem if there is a lack of awareness about blockchain technology. A more significant and favorable effect on the community will result from this.\nIn general, the objectives of the project are aligned with the difficulty of the task. It is also a project that can be scaled up, and it has the potential to provide Cardano with benefits on a global scale.", "q0r": 5, "q1": "Proposer gives a detailed timeframe as well as output, including the number of translated videos that will be published each month as well as the average length of each video.\nThe information that was provided by team members is understandable and reliable, and they linked their LinkedIn profiles. The proposers have previous experience working for the Sri Lanka Broadcasting Corporation, in addition to more than three decades of expertise translating official documents for the Ministry of Languages. In addition to that, they have experience in the field of software development. Because of these credentials, I have faith that the applicants will be able to translate documents and produce content videos that are appropriate for the Khmer-speaking population. In addition, the breakdown of the budget is very well thought out, and the costs have been broken down into detail such as translation, a social media campaign, and a contingency charge.\nHaving said that, there are a few points of information that, in my opinion, need further elaboration. Firstly, I'd like to get a better knowledge of the core topic covered in each video so that the community can make an accurate determination as to whether or not the audience will have a fundamental comprehension of the Cardano ecosystem. Second, there is a lack of information that is readily available concerning the attempt at marketing to attract an audience.\nThe viability of the plan will be improved with the addition of more detailed information.", "q1r": 4, "q2": "In order to facilitate more accurate tracking of progress, proposer provides a detailed roadmap that details the monthly milestones that need to be reached.\nIn terms of key performance indicators and metrics, there are a few measures that I believe should be introduced. These metrics include the ratio of positive to negative audience comments and feedback, as well as the weekly tendency of view rate.\nRegarding the aspect of what the realization of success will look like, I believe that it would be more helpful to determine the level of success by first establishing a specific goal to achieve, such as: an increase of one thousand members in the Khmer-speaking Cardano community; ten proposals submitted by the Khmer community;...", "q2r": 4, "assessor": "z_assessor_2985", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 14994, "q0": "This project is looking to expand translation services to Khmer-native speakers in Laos.  The impact of this proposal is mixed, given the scoring of 3, because of a couple of different factors.  Yes, it does open the door for Khmer-native speakers to Cardano, but that language is such a small percentage of the world, funds could ideally more optimized to grow and outreach other areas with more efficacy.  Although I'd like to score the impact higher on this, just due to the small outreach that the Khmer community would have I have to give it a score in between.", "q0r": 3, "q1": "The team and translators seem highly skilled to be able to generate the outputs that they seemingly would like to output.  There is some concern about the rate at which they plan to have material translated (one video per 3 days), but given the scale and amount of content available, this probably is doable.  One major question is the contingency funding that is requested (almost 15% of the total amount requested).  This additional funding should be described more in detail why there is a need for that amount of contingency funding and what it will seemingly mitigate.", "q1r": 4, "q2": "The metrics in the proposal are sound and reasonable metrics to the dubbing and publishing of material/content to measure subscribers and viewers.  This should allow the project to be tracked and transparent through it's development.", "q2r": 5, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15044, "q0": "The proposal aims on delivering a cardano content in Khmer language spoken in Cambodia. Comparing to Tamil proposal, here the proposer did not disclose how many people speak Khmer, and according to google, it is approx. 18,5 mil., which is 4 time less than Tamil proposal. It is obvious that the audience will be much smaller thus the impact of the proposal will end up being smaller as well. The proposer also states, that having such videos will provide education to those who speak Khmer, will result in onboarding this community to the crypto space. Overall, I agree with the problem statement – to have more content in different language in order to bring more people to ecosystem. Nevertheless, I am lacking more supporting data of the solution, because we can not determine whether having Khmer content will automatically lead to the onboarding. (since I remember that such proposals were already set in the previous fund – different translations – proposer could have provided these data to support the estimated impact.) Key metrics stated in the proposal such as number of views and likes are aligned to the solution of the proposal and we will be able to evaluate the impact retrospectively. It is also important to state, that the proposal contains some inaccuracies – khmer is spoken in Cambodia (as google say), yet in some parts of the proposal, the proposer kept paragraphs mentioning Laos community, or Tamil community. ", "q0r": 3, "q1": "The time plan is set to 3 months, whilst the proposer plan to have 10-20 videos at the end. I find this range  - 10-20 large. We are talking 100% diff. If the goal would be 18-20 it would seem more reasonable. Despite this large deviation, it does not decrease the feasibility to have at least 10 videos, but I find it incorrect set. The videos will be taken from official IOHK channels, so the source of videos is clear. The budget is set to 11 150 USD, whereas it is divided into 2 250/ month for videos, and when respecting 10 videos after 3 months, it is 750 USD/video. The proposer states, that the rate for word is 0,15 USD, but since the content of the videos is already pre-determined (taken from IOHK channels) this part could have been more detailed e.g. video 1, duration 10 min, 400 usd….etc. I know it would require more thorough analysis, but since there were many proposals as such from the same proposer, assuming translating similar content in different languages, having one analysis could have been performed. Another part of budget is 2 500 for social media campaign and 2 000 contingency fee. To be honest, I completely disagree with contingency based on market volatility. As far as I know, the ADA received could be transferred to a stable coin in case of need, or even for fiat currencies on any exchange, which would lead to preserving the amount. Maybe I am overlooking something, but it does not seem “needed”. The team is composed from 4 members, with vast bio provided and linked in profiles. I find these somewhat less relevant, since it is mentioned that master translators will be still hired. These profiles could have been disclosed instead (or just a representative). To conclude, because some parts of the proposal I find slightly misleading, overextended or not explained fully, I am decreasing one star down. ", "q1r": 4, "q2": "The problem – lack of Khmer content – and solution – to create it and onboard new people to the ecosystem is logical, and the solution will try to fix it. As for KPIs, about the progress, we know that the proposer wants to have atleast 10 videos after 3 months, so we can check whether 3 videos were publicized after each month. Regarding the success of the proposal, we can count interactions of these videos, but unfortunately, it will not tell us how many was on boarded due to this content. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15102, "q0": "The proposal has potential, but lacks detail so that we can understand what would actually happen here. It is known that the main objective of this project is to bring videos in their native language to the Khmer community about the Cardano ecosystem. It is said that this will be very positive for our blockchain, as there are a large number of South Asians who are in the technology area and could add qualified labor to our projects. I agree, but for us to have better confidence about what will be done, it would be necessary for us to know the exact contents of these videos. One of the points cited as obstacles is: “It takes a long time to convert ADA into local currency as it is completely dependent on Binance’s P2P market”. I disagree, this is fast, it's just the time for the verification transactions to be made on the blockchain itself; it takes less than half an hour for sure. In general, I think the impact is lacking due to the lack of specificity in their explanations.", "q0r": 2, "q1": "The script is ok, we know what would happen monthly. However, more detail regarding the activities would be needed. In month 1, translations would begin; how would the contents to be translated be selected? How would the internal team meeting be done, who would the dubbing partners be? In month 2, how would the video production start? The team's presentation is really impressive. We have extensive explanations of each member involved, so we have a solid understanding of each one and a lot of confidence is conveyed in this team's ability to successfully carry out the project. The budget division is ok, but not perfect. Some parts could be better explained, for example: what would be the contingency fee? What would the social media campaign look like and why would it cost $2500? In general the proposal is viable, needing some small improvements.", "q1r": 4, "q2": "Auditability is not good; on progress: the same information given in the roadmap part is repeated. Even if we know from the top what would happen each month, it would be necessary for the proponents to organize reports at the end of each month, explaining what was actually achieved, both in terms of tasks and partial results. Suggested KPIs are numerical: number of Lan Cardano Youtube Channel followers, average number of views per video, etc. How would this data become known to our community? What would be the communication channel used here? The ultimate success is basically bringing quality content about Cardano to the target audience in their native language. We would need to understand how the impact of this would be measured. How is the Khmer community getting involved in the ecosystem?", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15124, "q0": "Implementation Proposal Provide translated content taken from the official Cardano documentation in the form of a Khmer video. This challenging proposal makes it possible for many local people who do not speak English to learn about the Cardano ecosystem through their language, especially the edited material presented in the form of videos. will help the community update information faster. I'm also a community engagement learner from translated videos so I understand the impact. The hard part will be finding experts who have blockchain knowledge about Cardano and can summarize documents that are easy to understand and then translate into the local language, and then people who have experience in creating video content. easy to understand. The team also presents some risks and has solutions for these risks", "q0r": 5, "q1": "The proposed group gives a very detailed implementation plan within 3 months of each month's work. However, the content and documentation about Cardano are so extensive and extensive that I have not yet seen a proposal stating which material to focus on. The team has 4 main members with professional experience in the field related to the proposal, in addition, the team has introduced a network of translators as partners to join when needed, it would be great for the team to introduce more about the subjects. work. The proposed budget is calculated in detail and the unit price is very clear, plus communication and contingency costs. The team has stated that they will develop more content and continue to recommend funding at a later fund, it would be great when the team provides more information on plans", "q1r": 4, "q2": "The team's roadmap will work within 3 months with the goal of having 10-20 videos and publishing 1 video every 3 days. The project's success metrics are also mentioned by the team such as (number of channel subscribers, number of viewers, number of hours watched, number of shared comments), the evaluation comment information is also information to help the team. adjust the video to suit or add content requested by the community", "q2r": 5, "assessor": "z_assessor_2714", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15232, "q0": "The proposal shows the key points that brings a new community. The community who speals Khmer language. The proposal will help Laotians to approach Blockchain Cardano by translating official videos and documentations. But the proposal is duplicated from another proposal that is named Cardano in Tamil. After reviewing the two proposals, a lot of key points are matched each other, they just are altered Tamil to Khmer. The proposal is not written honestly.", "q0r": 1, "q1": "The proposal is duplicated from another proposal. Milestone is copied and written unclear. So the feasibility is got 1 star. The KPI does not show detail of work for each month that the proposal needs to be accomplished.", "q1r": 1, "q2": "Definitely, the proposal is copied from another proposal. The auditability is got 1 star. The creteria sets KPI but it can not be audited because it does not show specific numbers from its KPI.The proposal writes not clear.", "q2r": 1, "assessor": "z_assessor_4128", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create content from documentation, in video form.", "experience": "Dimitri Fernando\n1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n1995 to 2022 - 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\nOfficial Translator for Department of Languages Sri Lanka"}