{"id": 367168, "author": "", "title": "Cardano Smart Voting", "url": "https://cardano.ideascale.com/a/dtd/367168-48088", "category": 26104, "amount": 1750, "description": "たくさんの提案に投票するのが難しくなっている。ユーザーが自分の関心事に基づいて素早く投票できる簡単な仕組みを提供しましょう。", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is a very out of the box way of trying to improve and grow the Catalyst system.  It is looking to build an interpretable system based on blockchain analytics, voter trends, and impressions.  This can help to make Catalyst a little bt more approachable with the ever-increasing number of proposals that are coming.", "q0r": 4, "q1": "Considering this proposal is in the early brainstorming and research phase.  The plan has a high-level plan of milestones that it plans to accomplish in various intervals and with what the proposal includes, the targets and milestones should be accomplished with the requested funds and timeframe.  The proposer has a reasonable background and a plan to work with various community parties to help drive insights into developing a working solution.", "q1r": 4, "q2": "Additional information can be detailed in the roadmap to make the plan more auditable.  Since it's researching a solution that may be hard to do, but it would make monitor and/or tracking progress easier.  ", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very well presented, justified, and scoped. It is pleasant to see a proposal where the proponent took the time to understand the challenge and submitted an idea that is actually oriented to address it effectively. That being said, it is important for me to note in this assessment, that this is a proposal to start and plan a project, it is not a proposal to have definitive execution, and therefore, effectively \"address\" the challenge\". I am giving five stars to this proposal in this category because being a very clear proposal, it elaborates an adequate scope for its goals at the time, and a budget that is consequent. The budget may seem small, but it seems to me that the author has demonstrated the ability to advance the project effectively, and I trust that he will be capable of using the resources requested for the best outcome. All and all, congratulations.", "q0r": 5, "q1": "Yes, given the experience presented by the author and the scope of the project, I believe that with the resources requested the author will be capable of implementing the proposal successfully.", "q1r": 5, "q2": "Yes, I believe that the information provided by the proponent would be sufficient for a competent and committed auditor to evaluate the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_183", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I found this proposal very interesting and consistent with the objectives of the challenge. The author suggests creating some tags to classify the proposals, as he explains: some are more geared towards art and NFT, others towards steakpool and investments, and that way you can better guide the voting members of the Cardano ecosystem. Thus, the collective decision-making process would certainly benefit, since part of the work would be facilitated, and voting members would have a personalized list of proposals that dialogued with their interests. I believe this project is extremely relevant, as our ecosystem grows and each fund has more and more submitted proposals.", "q0r": 5, "q1": "The author of the proposal claims to have previously worked on projects of the same nature, and attaches his linkedin profile as a way of exemplifying when and where such work took place. He details in a very technical way how this new way of voting would work, how the algorithms would be, etc., thus demonstrating a lot of mastery over the technology that he intends to launch. Furthermore, he recognizes the need to hire different professionals to carry out the project, such as developers and marketing people, and also to get in touch with community members such as CAs, vCas and so on. Therefore, I believe that the author (and his future team) have the necessary attributes for the successful realization of the project.", "q1r": 5, "q2": "The author of the proposal describes how this system would be self-sufficient, say. How people who use it would contribute in ada transactions to keep it viable. It also details what would happen at each phase of the project, describing them in weeks. The detail in this part is very satisfactory, giving enough data so that the readers of the proposal can visualize how it will all happen. In addition to having a notion of the main present objectives, the author situates us in relation to what he wants to achieve with the next funds. In other words, there is a very broad vision of the project here, but not an abstract one (which is positive). Regarding the distribution of the financing money: there is very little detail here, which is a very negative point. The author only vaguely mentions how he will use the funding, as when he says he will go to \"buying a domain, little assessments, maybe a logo etc\", for example. It is necessary that he establish how much will go to each part, so we can have a more solid notion of this very essential part of the proposals. One downside is that it tracks success metrics, making community tracking easier.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "As the number of proposals to be voted on is increasing, facilitating information gathering before the vote is an essential contribution to the distributed decision. It is an impactful project for the Distributed Decision Making Challenge. \r\nThe proposed strategy ot ease voter's task is indeed smart : every voters defines his point of interests by answering several questions, and is receiving as a return a personal voting list.\r\n", "q0r": 4, "q1": "This is the first Ideascale submission for this project, whose principle is quite well explained.\r\nAt this stage, the proposer asks for a funding for research to refine the project\r\nEven if the basics about the technical solution and algorithms are described, and if some challenges are listed, it needs indeed to be refined. \r\nThe proposer as a high experience and good references in conducting projects, which is why I give 4 star feasibility score for this project research proposal. \r\n", "q1r": 4, "q2": "Enough details are provided to monitor the development of the project, at his different steps. Of course the funding at next step will need a lot of more technical details.A 3 months schedule is provided, splitted in three milestones leading to a fully budgeted and detailed proposal. The requested amount is initiation costs aimed at hiring a team to transform this draft proposal in a more concrete one that will be proposed in Fund 7 or 8. Even if there isn't a detailed budget, some examples of future costs are listed.", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "すべての提案に対して、3～6個の「記述子」という共通のセットを定義しましょう。投票者は、3～6の質問に答えるだけで、個人用の投票リストを手に入れることができます。", "experience": "私は、複雑さを切り抜け、具体的なソリューションを提供することが求められるさまざまな仕事や業界で働いてきました。https://bit.ly/2W2mO9D"}