{"id": 368984, "author": "", "title": "Voter Tool - AIM", "url": "https://cardano.ideascale.com/a/dtd/368984-48088", "category": 26104, "amount": 9790, "description": "提案や評価に関する情報への有権者のアクセスは制限されており、ユーザーフレンドリーな方法で提供されていない。", "f6_no_assessments": 9, "f6_rating": 4.703703703703703, "videos": ["https://youtu.be/z1yU_dV2JKg?start=132", "https://youtu.be/5988qJvf-FQ?start=4116", "https://youtu.be/al5m14299ww?start=5274", "https://www.youtube.com/watch?v=UpTjulWM0MQ"], "media": [], "f6_assessments": [{"q0": "This Voter Tool is currently a complementary tool to IDEASCALE and to the official Voting APP. Currently it provides valuable features, which are lacking in the other tools. Therefore this proposal for maintaining and enhancing the Voter Tool is definitely useful and in alignment with this Challenge Setting's goals. \r\n\r\nI would nevertheless like to see a mid-term strategy about how to merge the 3 tools and get to one really powerful Ideation and Voting APP. Did not find this in the proposal.  ", "q0r": 4, "q1": "This proposal is driven by a very experienced team. The AIM members are the team behind the voter-tool, CA-tool, vCA-Tool and the Community Landing Page, a good mix of developers, designers and data experts.\r\n\r\nTh Voter Tool is already existing and used since fund 4. Therefore the likelhood of success can be easily answered with: Very high. This proposal is mainly about improving already existing software.  ", "q1r": 5, "q2": "A bit unconventional  is the approach of this proposal, asking for retrospective funding of tool-developments (done during fund 4 & 5, improvements in fund 6 and 7). Since this ask comes from well-integrated core-contributors, closely linked with the CATALYST team, I support this move - also because the asked amount is small and very reasonable. In the future I suggest to avoid asking for retrospective funding. ", "q2r": 4, "assessor": "z_assessor_101", "no_vca": 27, "ne": 14, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "The Voter Tool is an important tool for decision making. As it positively impacts the Cardano ecosystem, the continued work on this directly addresses the challenge.", "q0r": 5, "q1": "The proposing team has done the work previously and thus it is highly likely they will implement this proposal successfully, too. The budget breakdown is understandable and reasonable.", "q1r": 5, "q2": "KPIs are sufficient to audit.", "q2r": 5, "assessor": "z_assessor_22", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "The problem and solution described are within the scope of the challenge.\r\n\r\nThe voter tool provides more options for voters to access information on all proposals through a friendlier interface. It is worth noting that at the voting stage CAs, vCAs and proposers become voters too, so it is a tool that is widely used in the community. One of the problems I see currently is the fact that casting votes is only possible in the Catalyst app, so using the voter tool fragments the experience and because of that the user base is limited. Regardless of that aspect, the voter tool seems to be an excellent option to present voters to proposals in a friendlier way than the voting app and IdeaScale itself and also allows the creation of lists for sharing, which is an important item for sharing. lists/ expert ballots.\r\n\r\nKPIs were included, but targets were not set for these KPIs, which makes the impact assessment more subjective.", "q0r": 4, "q1": "The trio responsible for the project has already demonstrated qualification and achievements in the Cardano community for many months. They are involved in several improvement projects in Catalyst. The proposal details the qualifications of the three members. The AIM voter tool has already been used in the last Fund and has proved to be useful at the voting stage.\r\n\r\nThere is a detailed and reasonable budget breakdown. Part of the resources is for retroactive funding. The budget was established for development and updates in Funds 6 and 7.\r\n\r\nThis set of information indicates that the proposal is completely feasible.", "q1r": 5, "q2": "There is clarity in the problem, solution and alignment with this challenge.\r\n\r\nPart of the roadmap is retroactive and most of the goals/milestones have already been fulfilled and delivered. Some features are ready and there is the intention to add the possibility of creating lists by groups. It is not clear whether this will be available in Fund6 or only in Fund7.\r\n\r\nThe KPIS included do not have goals that allow for a more objective audit.", "q2r": 4, "assessor": "z_assessor_43", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "A tool that can improve the access to more informations for voters is a good idea. This proposal responds in great way to the challenge. In fact voters may need more informations about the proposals , assesments and more, in order to perform better informed votes. Building a tool that help them achieve that will have a positive impact on the funds.", "q0r": 5, "q1": "The AIM tool is behind the CA tool, the VCA tool ans the voter tool. Given the fact they have enough experience building useful tools for the catalyst community, I think there are high chances that they succeed once more. I give a 5 for implementation.", "q1r": 5, "q2": "The proposer has provided a detailed budget breakdown as well a measurable KPI. He gives us enough informations in his proposal. The progress of this project can be easily audited.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is an outstanding proposal that effectively identifies a problem and then sets to work in finding solutions to that problem. The team have a track record of providing cost-effective, practical value to the Catalyst community. The one thing I would like to see from this team is the incorporation of succession planning to their projects whereby they actively recruit and hand over administration of the resources they develop to newer members of the community whom in turn would do the same after a period of administration. This I feel would be the crowning glory of a decentralised ecosystem that this team are making huge strides in helping to develop.  ", "q0r": 5, "q1": "The team have excellent experience and apply themselves diligently to the task at hand. The tool has already been developed and while it may undergo further iterations is already able to be used by the community. The team appear open to user feedback and seem willing to uphold the key values of a decentralised community.   ", "q1r": 5, "q2": "The information provided with this proposal is excellent and some ways may represent the gold standard in application funding. Identify the problem, build the solution and then apply for the funds. It basically takes out the risk of not getting to implementation success and yet allows for improvements to be built into the project as issues come to light. The team deserves to be commended and certainly deserves your vote.     ", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "the proposal aims to provide more information about the future proposals and provide the access to the voters.\r\n\r\nI agree that if voters have more information,  it can help them to decide better and more accurate, therefore we increase decision making on the lowest level of the Cardano community, but proposals should be designed the way, that a common mortal can assess them without reviewing multiple sources (that is what I think should be) \r\n\r\nOverall, increasing the way, how a voter can access and process the information (more simple way, or more detailed if requested) is something that I consider as a good point. Nevertheless, a standard voter just uses catalyst voting app, and if he would like to use this VT (voter tool) he would need to go to another page - where I see a risk, that voters might perceive it as \"another step - a longer time to decide; rather than - it will help me out-. \r\n\r\nI am not sure if this will be as effective as planned, therefore I put 4 stars.\r\n", "q0r": 4, "q1": "the team provided relevant information, I have used CAtool myself, so it is running, no doubt they will deliver.", "q1r": 5, "q2": "the proposers provided KPI which is considered as suitable to measure and audit the progress. Also, git repository.\r\n", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses an important issue within this challenge - if voters are put off by the interface they have to use, they won't take part in decisionmaking. It's great that this proposal is giving ongoing attention to this, offering a friendlier alternative, and that the tool has been improved and iterated in response to users. \r\n\r\nI particularly  like that the tool gives voters access to info like the CAs' rationale – this is great for transparency, which obviously improves distributed decisionmaking.  Also very pleased to see multilingual localisation is coming; that feels important in addressing this challenge.\r\n\r\nBut there are a couple of details that don't help – and when i think about those, they actually feel like they reveal a more deep-rooted issue. I mean the way that this tool (and all the AIM tools) are so completely separate from each other, so users don't get an overall sense of what they're part of. Sure, some users of this tool are probably not at all interested in the rest of Catalyst – but some might be, and when you've got 'em there, it feels like a missed opportunity not to point them to other aspects of Catalyst. Even if it was just a links page signposting voters to Town Halls / how to make a proposal / how to become a CA, etc. Doing something as simple as this would address, in a small way, the lack of \"joined-up-ness\" in Catalyst, and the way that the different groups (voters, CAs, proposers, SPOs, etc)  are pretty separate and siloed. That's the main thing that leaps out at me when I look at the tool  and how it's designed (or even, when I try to actually find it from elsewhere in Catalyst.) It's like the tool (and therefore the voters) are in their own separate universe, which I feel runs counter to addressing the challenge – distributed decisionmaking means participants know about the whole system, not just their corner of it. This does feel symptomatic of a wider issue in Catalyst as a whole, and that's not really this proposal's fault; but it does mean that for me, the proposal doesn't address the challenge quite as effectively as it might\r\n", "q0r": 4, "q1": "Clearly yes, as the work has mostly already been done, the tool clearly works, and people are using it successfully.\r\nThe budget and work hours breakdown for the future are completely realistic too, so there's little doubt the project will be implemented successfully.\r\n\r\nBut it's striking how there's no plans for any features development for F6 and F7. Maybe the team are busy elsewhere and don't have the capacity – but it seems a pity that there won't be that ongoing process of getting feedback from the users and developing the tool.\r\n", "q1r": 5, "q2": "The KPIs suggested are plenty to audit the progress of the project in the sense of \"are people using it\". But to be able to audit the actual *success* of the project, we probably need to know not just if people use the tool, but if they find it helpful. It's completely fair enough if there's not capacity to do any full-on qualitative evaluation in the future; but maybe simply looking at what percentage of F5 users come back and use it again in F6 and F7, would give an idea? (if people find that the tool helps, they'll come back and use it again, so...)", "q2r": 4, "assessor": "z_assessor_540", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This proposal fully aligns with a clear need within the voter participants. From my point of view, this is a real headache during voting stage and that was identified and the proposal addresses it with an adequate solution. Voters finding it difficult to access information about proposers and assessments usually would create a negative influence on decision making.\r\nTherefore implementation of this proposal will help improve the positive influence of decision making.", "q0r": 5, "q1": "This is a team that has a good track record of implementing the Voter tool, CA tool, vCA tool, Community Landing page. At least over the past Funds, Community Advisors have utilised these tools and testified already that this team did a great work of which I personally testify too. The team is good enough to implement this proposal.\r\nA tangible budget has also been provided.", "q1r": 5, "q2": "A clear Roadmap has been laid out in the proposal and it is clearly understandable that the solution in this proposal addresses the problem at hand.\r\nKPIs provided in the proposal can also help define success. \r\nDeveloping a tool to deal with the limit of information accessible to voters about proposers and assessments is potentially a great idea that can be audited.", "q2r": 5, "assessor": "z_assessor_565", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The problem is clearly stated and having voted in previous funds I can tell that it is important for the community to have a convenient voting tool with an easy access to information about proposals. This proposal does match the objectives of the challenge as it has a strong effect on the decision making process.", "q0r": 5, "q1": "The tool is already developed, and the proposal is about adding new features to have a more user-friendly interface. The proposal includes an extensive list of the features that will be developped The team provides reference of a large experience in computing science, various languages and frameworks. Two members are experimented Vca. Based on this information, I expect a successful development of the new features.", "q1r": 5, "q2": "The technical aspects of the project are clearly explained, and a clear budget breakdown is provided. \r\nAppropriate KPis are listed to monitor the success. The proposers might consider precising the goal for theses Kpis: what increase in terms of unique users for example?\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "プロポーザル、CA評価、追加情報などを公開する、有権者向けのシンプルで便利なツールを構築する。", "experience": "AIMのメンバーは、voter-tool、CA-tool、vCA-Tool、Community Landing Pageを支えるチームです。開発者、デザイナー、そしてデータの専門家です。"}