{"id": 380924, "author": "mikolaj.glinka", "title": "Frictionless document verification", "url": "https://cardano.ideascale.com/a/dtd/380924-48088", "category": 26240, "amount": 30000, "description": "Фишинг и подлог приводят к потере данных, денег и времени. Для восстановления доверия к транзакциям и защиты всех участников необходимы бесконтактные инструменты.", "funded": 1, "upvotes": 46138003, "downvotes": 13842871, "votes_result": 32295132, "votes_cast": 214, "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Автор предложения хочет сделать возможным легкую загрузку документов и проверку подлинности и целостности документов. Такое решение принесет больше доверия в экосистему кардано. Несколько предложений работают над этим, потому что это важный вопрос и болевая точка, которую может решить блокчейн. Проект утверждает, что сможет уменьшить ущерб от подделки документов, который является значительным. KPIs для проекта актуальны, поскольку они касаются предоставления бета-версии приложения для тестирования сообществом, чтобы впоследствии его можно было коммерциализировать.  На данный момент есть несколько моментов, которых, на мой взгляд, не хватает этому предложению, но я расскажу о них в соответствующих разделах обзора. Это предложение, безусловно, добавит что-то в экосистему, но уже есть несколько похожих решений, которые могут конкурировать с этим. Как у разработчика у меня есть пара вопросов по поводу реализации предложения, например, отсутствие данных о членах команды. Упоминается только один человек. В целом, если предложение будет реализовано, оно будет полезным для сообщества.", "q0r": 4, "q1": "Одна вещь, которая меня беспокоит, это то, что только один человек связан со всем этим предложением. Это не простой dapp, который должен быть сделан одним человеком. Не то чтобы я сомневался в его навыках, так как он является пионером Plutus, но в предложении упоминается еще пара членов команды, но ссылки на имена или полномочия не предоставлены, поэтому я не могу проверить их и их навыки. Очевидно, что автор предложения имеет представление о том, что потребуется более одного члена команды, и включил этот факт в бюджет, но в нем не сказано, знают ли эти люди или будут наняты. Это уточнение необходимо внести в предложение, поскольку его отсутствие порождает дополнительные вопросы, например: откуда берется расчет заработной платы других членов команды? Бюджет указан, но, по моему опыту, этого недостаточно. Одно несоответствие я обнаружил в том, что в предложении говорится, что фаза 3 не будет финансироваться в этом предложении, но в запрашиваемых средствах упоминается 3000 долларов на тестирование, которое входит в фазу 3. Никаких источников или расчетов для подтверждения запрашиваемой суммы не предлагается. Я бы рекомендовал автору предложения посмотреть другие предложения и проверить их разбивку затрат, которые чаще всего делаются почасово и по месяцам. График выполнения всех работ, содержащихся в фазе 7 фонда, кажется выполнимым и реалистичным. Есть разумная дорожная карта, описывающая реализацию и возможное будущее проекта, что замечательно. В плане подробно описано, почему необходимо внедрить такое решение, ведь каждый год из-за мошенничества при проверке документов теряется много денег. Можно было бы упомянуть технические детали, потому что многие члены сообщества являются инженерами и могли бы оказать большую помощь в решении любых проблем и деталей реализации.  Я не уверен, видели ли авторы предложений другие подобные проекты, но я бы предложил некий вид сотрудничества, чтобы построить его на основе усилий сообщества, чтобы не делать что-то дважды. В целом, для меня это было бы более осуществимым решением, если бы были упомянуты все члены команды или точная ситуация с их приобретением. Более точная разбивка бюджета также принесла бы больше доверия к проекту.  Удачи!", "q1r": 4, "q2": "Ничего не было сказано об информировании общественности о статусе разработки предложения. Получение обратной связи от сообщества кажется упущением в предложении. Упомянутые KPI кажутся адекватными и предполагают одобрение проекта пользователями.  Есть четкая проблема и четкое решение для нее, так что не стоит беспокоиться о том, что люди поймут, о чем этот проект.  Я бы предложил автору проекта поставить себя на место избирателей и посмотреть, как заинтересованный избиратель и сторонник проекта сможет представить какую-либо помощь или обратную связь на основе содержания проекта. В настоящее время я не вижу простого способа, но это важная часть любого предложения. В целом, я думаю, что проверяемость этого проекта будет труднодоступной для сообщества. Это не считая необходимых обновлений разработки, предоставляемых катализатору проекта.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Эта идея хорошо согласуется с целью конкурса, и ее можно резюмировать следующим предложением: \"Прозрачность для всех сторон при обмене цифровыми активами\". Авторы намерены создать продукт, в котором люди, непосвященные в криптографические вопросы, смогут загружать документы в блокчейн, что, безусловно, повысит ценность экосистемы Cardano, поскольку больше людей смогут принять наш блокчейн. Авторы также утверждают, что такой проект принесет пользу компаниям и потребителям одновременно, то есть это идея, рассчитанная на широкую аудиторию и обещающая охватить большое количество пользователей, что вполне соответствует тому, что ищется в данной задаче. Если идея окажется успешной, можно будет майнить документы в блокчейне, чтобы повысить их надежность и оригинальность, что принесет пользу экосистеме, в которую войдут новые пользователи и население, которое не понимает, как на практике работает эта практика. Очень важно, что авторы с самого начала хорошо понимали важность UX-дизайна для проекта, который, на мой взгляд, здесь так же важен, как и стоящее за ним программирование, потому что он позволит простое и эргономичное использование для людей, не имеющих контакта с криптовалютой. Авторы объясняют, какую пользу получат различные сферы бизнеса, такие как фармацевт, банк, брокеры и т.д., помимо обычного пользователя, тем самым передавая очень солидное представление о том, как сервис может быть хорошо использован в каждом конкретном случае.", "q0r": 5, "q1": "Авторы прекрасно объяснили, что будет сделано, основные фазы проекта и небольшие действия, которые в совокупности приведут к таким фазам, сколько времени (в днях) примерно будет длиться каждая фаза и цель, которая должна быть достигнута на них. Для меня это идеальный пример того, как следует представлять практическую часть предложения, поскольку, по моим наблюдениям, авторы часто стремятся раскрыть фазы, из которых состоит весь проект, но не детализировать их, объясняя, что именно будет происходить на каждой из них. Что касается финансовой суммы, то мы знаем, сколько денег пойдет на каждую фазу проекта, что крайне необходимо, но было бы очень позитивно найти здесь же детализацию ранее проанализированного пункта. Например, в парке \"вывод на рынок и мероприятия по продвижению и запуску\", как будет происходить этот запуск, через какую платформу будет происходить раскрытие информации? Я считаю, что это очень важная деталь для данного предложения, поскольку оно также направлено на охват аудитории, которая не привыкла к экосистеме Cardano, поэтому необходимо иметь представление о том, как идея может дойти до них. Что касается команды, составляющей проект, то они, безусловно, способны, но я бы хотел увидеть больше объяснений о них: кто они, их имена, примеры предыдущих работ, какова будет конкретная роль каждого из них в проекте... Хотя они утверждают, что являются компьютерными учеными с большим опытом, нам нужно понимать, с кем конкретно мы имеем дело.", "q1r": 4, "q2": "Команда раскрывает здесь то, чего она намерена достичь очень точным образом, а также то, к каким результатам она стремится по прошествии месяцев, что делает возможной проверку со стороны сообщества. Поскольку проект уже имеет прототип, было бы интересно посмотреть, как этот продукт трансформируется в бета-версию, а затем в окончательную версию, авторы могли бы также показать эти результаты какой-нибудь команде профессионалов в сообществе, чтобы обеспечить еще большую безопасность того, что делается. Тем не менее, я считаю, что все согласны с возможностью мониторинга хода проекта, эта идея - просто дополнение, которое сделает сценарий еще более надежным.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This product is much needed. I work with immigration documents often, and see this as assisting a need of verification of documents that are not related to immigration concerns (college transcripts for example). The immigration industry needs more tools like this for future implementations.", "q0r": 4, "q1": "With all of the documentation provided and then with \"A team of computer scientists with decades of experience combined\" listed at the front: I would have expected more team members to have more details on their qualifications. I can assume this team has them, but would like to *know*.", "q1r": 3, "q2": "Lot of information provided that gives me confidence in this team's abilities. They have listed their KPIs, and they seem easy enough to track and confirm. If this team does obtain two enterprise clients it would be a good success.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This team wants to make a system to protect consumers and document providers out of phishing & forgery result in data, money, and time loss. In my point, this will help a lot in the development of DeFi. And as the team described in the proposal, their system will be based on Cardano metadata and has a strong impact on the development of Cardano ecosystem. Throughout their KPIs, I think that this team is really concerned about what this challenge wants to point. ", "q0r": 5, "q1": "The team makes a very detailed plan and technical explanation to help everyone understands what they want to do, the team also includes use cases and scenarios in many industries including banking, insurance, education... to show how this system will affect the current world. \r\nMore than that, they make a very detailed roadmap of what the whole team will do in 4 development phases. And that help clear the budget they required is sufficient and reasonable.\r\nIn addition, we can find a lot of evidence and also an MVP of their system in the proposal. So, this project will definitely have high feasibility to success. .", "q1r": 5, "q2": "They have a detailed roadmap and promising KPIs. Those are completely enough to help to audit easily this project. \r\nThe team didn't explain the problem in detail, but I think their solution made sense and in each sentence, they explain how their features or mechanic to solve some cases that belong to the problem. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Project like this is something the Cardano ecosystem must have. Having all the documents in one place on blockchain and on Cardano is simply wow! The whole project can come to life both locally and globally. It could include individuals but also cities, schools, colleges, todays and tomorrows governments. All documents could be saved to the blockchain wow! In the proposal we can clearly see what the problems are and what solutions the team offers. The proposal states the positive impact for the Cardano ecosystem and it is clear how it will add value to the Cardano ecosystem. KPIs indicated in the proposal match the ones indicated in the challenge and proposal is able to scale and address future challenges.", "q0r": 5, "q1": "There is a website in the proposal where we can get information about what the people behind this project are doing but there are no informations about the team. We do not have a clear insight into the experience and skill that will be necessary for realization. We have information about Team Leader as evidenced by the link via LinkedIn but it would be good to have a clear insight into the relevant skills and experience needed to implement the proposal. The proposal states that Plutus Pioneers will work on this project, but we have no evidence that this is the case. In the proposal as I stated we have Team Leader but we do not have clear information on the number of other team members and whether they exist. The budget is reasonable and clearly presented but it would be good to have within the budget broken down better specified in more detail on what all the money will be allocated. An additional funding is not required and a detailed implementing plan is clearly presented in the proposal. The proposal provides details of actionable tasks and an order of execution with realistic time frames within which the work could be done. The plan does not describe the resources required but the proposal clearly explains the technical aspects such as architecture, language and technologies required for implementation. The proposal lists certain problems in the industry, but does not specify the possible risks that may occur during the implementation of this project, so that solutions to possible risks are missing.", "q1r": 3, "q2": "Proposal provide an excellent roadmap with milestones and a time horizon for achievement. KPIs are not best presented in a way to define the success of the project and KPIs provided cannot be used to quantify the success of the project. Therefore, the community will not be able to follow the development of this project.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on a system allowing even non-technical/crypto users to 1) upload documents to blockchain and 2) verify document authenticity and integrity. This is a meaningful idea. The problem is clearly described, explained in detail, which fits this challenge. The solution is clearly defined, fits the challenge, shows a clear impact on the ecosystem as a whole in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided and described enough for understanding, with skill, experiences is suitable for implementation, but NO reference/proof (documents/links,...) for verifying. There is no information on demo/pilot. The budget explanations of the calculation base are not provided. The roadmap is clearly described, with measurable and logical KPI/ metrics. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided, however, there is a lack of the following components: (1) Team profile reference/proof (documents/links,...) for verifying; (2) Budget explanations of calculation base; (3) Risk and mitigation. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal deals with an area of structural preservation and general document storage. It's relevance to the Cardano functional utility may enhance the designation of some related use documents in a verifiable manner. The conversion from a non blockchain model to a verifiable model needs to be expressly described rather than assumed. \r\nThe proposers have limited themselves to a set of documents which would comfortably be linked to documents presented online so my question is about the specifics of verification as to how the document has been acquired by the consumer for which it is being verified?", "q0r": 3, "q1": "The conversion from an off chain to on chain modality seems to have a workable model and logical deployment. It does seem to need some tightening of the \"raison d'etre\" which is not a large modification. Given the plan it should be implemented successfully for the parts described. ", "q1r": 3, "q2": "This proposal has reasonably sound structure to the development and hence would be auditable for progress. There should be a clearer definition of the value add provided by their model.", "q2r": 3, "assessor": "z_assessor_691", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal would do a great service to the Cardano blockchain by helping non-technical users take advantage of the immutability and trustlessness of blockchain technology to prevent phishing and forgery. It is a relatively straightforward project with potentially high impact, both for Cardano adoption and the track record of Project Catalyst. ", "q0r": 5, "q1": "The team consists of Plutus Pioneers and crypto veterans who provide their linkedin profile and company website. The portfolio and experience presented are suitable for the proposal roadmap and give the proposal a high chance of success.  ", "q1r": 5, "q2": "The granularity of timeline and cost breakdown are highly useful for auditing the proposal during implementation. All the information required for understanding and evaluating the proposal are there. It is also casting a good light on the proposal that so much understanding of the target demographic and market dynamics are presented.", "q2r": 5, "assessor": "z_assessor_692", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Система, позволяющая даже нетехническим/крипто-пользователям 1) загружать документы в блокчейн и 2) проверять подлинность и целостность документа.", "experience": "* Команда компьютерных ученых с десятилетиями совместного опыта.\n* В криптовалюте с 2017 года\n* Пионеры Плутуса\n* Имеют связанный прототип"}