{"id": 381003, "author": "dwayne", "title": "DAO-NET: Voting DApp", "url": "https://cardano.ideascale.com/a/dtd/381003-48088", "category": 26240, "amount": 49000, "description": "DAO Net обеспечивает значимое стимулированное участие в экосистеме Cardano, однако для этого требуется простой в использовании кошелек для голосования Dapp.", "funded": 1, "upvotes": 84377037, "downvotes": 9211936, "votes_result": 75165101, "votes_cast": 329, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Предложение хочет иметь Dapp, который позволяет полноценно участвовать в процессе DAO-сети - то есть голосовать и работать с токенами. Предложение содержит несколько интересных предложений в фонде 7, которые хорошо сочетаются друг с другом, но могут быть рассмотрены как отдельные предложения в случае, если не все из них будут проголосованы. Предложение отлично объясняет, каким образом оно принесет пользу экосистеме кардано, обеспечивая объединение многих людей с одинаковыми целями для совместной работы, сохраняя их личности в тайне. Ключевые показатели предложения соответствуют условиям задачи. В предложении есть отдельный раздел о том, как оно сможет решать будущие задачи и масштабироваться. Он очень подробный и выглядит как пример для подражания другим предложениям. Currentyl Я не вижу, чтобы в предложении отсутствовали важные детали, но есть пара областей, которые нужно улучшить, например, разбивка бюджета. Это предложение не похоже ни на одно другое, которое я видел, учитывая, что я просмотрел более 50 проектов и прочитал названия почти всех из них. Это очень интересная и новаторская идея. Как разработчику мне очень интересно это предложение, и я буду ждать этапа голосования, чтобы отдать свой голос. Желаю удачи участникам этого замечательного проекта.\r\n", "q0r": 5, "q1": "Предложения предоставили профили, связанные с ними, и у них есть весь необходимый опыт, чтобы охватить то, что необходимо для этой реализации и даже больше. Количество членов команды определено, но есть возможность роста и масштабирования при необходимости. Также перечислены конкретные люди и навыки, которыми они должны обладать, чтобы присоединиться к проекту. Это повышает доверие к проекту. Бюджет четко очерчен и разбит на надежные статьи, которые необходимо выполнить. Существует реалистичный и подробный график успешного завершения проекта, хотя я не верю, что он когда-нибудь закончится, скорее, он будет продолжать расти.  Предложение показывает очень подробный план выполнения, а также очень специфический раздел, касающийся управления рисками для многих деликатных случаев, например, как сохранить анонимность в DAO. План предложения и его реализация являются разумными, учитывая временные рамки и цели. Предложение могло бы лучше объяснить технические аспекты, но это не так важно.  Самое главное, что проект провел исследование того, что уже было сделано, и будет развиваться дальше. В целом, хорошее реализуемое предложение.", "q1r": 5, "q2": "В Project catalyst уже есть требования по аудиту достижения этапов до выделения средств, но я надеялся на аудит со стороны сообщества, а не только катализаторов проекта. В связи с этим, на github есть репозиторий, так что любой заинтересованный может заглянуть внутрь и проследить за ходом реализации предложения. Отслеживаемость хороша, так как будет происходить взаимодействие в telegram и discord. Упомянутые метрики имеют отношение к конечной цели и успеху проекта. Дорожная карта и этапы также хорошо разбиты и представляют собой подробный пошаговый план достижения успеха. Представлено четкое и понятное описание, а также очень подробное и наиболее применимое и практичное объяснение.  Очевидно, что авторы предложения поставили себя на место избирателей и прислушались к комментариям членов сообщества, поскольку это улучшенная версия первоначального предложения. Удачи Дуэйну и Джуд!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Представленный манифест четко понимает поставленную задачу и предлагает практическое решение проблемы отсутствия надежного Dapp для голосования. Это решение лучше всего подходит для кампании. Кроме того, автор ясно дал понять, что долгосрочной целью будет реализация кошелька для токенов DAO. Таким образом, увеличивается принятие и интеграция Cardano, что является одним из основных требований задачи. Предложение в целом может оказать космическое влияние на экосистему Cardano и ее калибр. Поэтому я оцениваю предложение с точки зрения его влияния.", "q0r": 5, "q1": "Тонкая детализация плана действий и возможных проблем, с которыми может столкнуться команда, интригует и соответствует предложенной идее. Запрашиваемые средства также выглядят практичными и разумными, если проанализировать их разбивку. Этапы и сроки, в которые их планируется достичь, также выглядят разумными. Единственная причина, по которой я бы поставил 4 из 5 за осуществимость, заключается в том, что, несмотря на то, что менеджер и руководитель продукта очень талантливы и способны продвинуть предложение к успеху, нерешительность участников, которые должны занять место разработчиков внешнего интерфейса и вкладчиков кошелька с открытым исходным кодом, оставляет чувство сомнения в 100% успешной реализации предложения в намеченные сроки.", "q1r": 4, "q2": "Несмотря на неуверенность членов команды, автор предложения не допускает ошибок при предоставлении метрик, которые аудиторы могли бы использовать для мониторинга прогресса. Четкое определение успеха и дорожная карта вселяют доверие в сообщество в отношении успеха предложения. Автор предложения также демонстрирует свое намерение, волю и страсть в достижении цели, предоставляя небольшую информацию о возможных потребностях в средствах во время последующих раундов. Три основных KPI, представленные в предложении, соответствуют ожидаемым показателям кампании. То, что DAO имеет открытый исходный код и лицензию, делает процесс аудита более простым и распространенным. Я твердо уверен, что это предложение имеет все признаки тяжеловеса в этом испытании, если они соберут сильную команду, чтобы заполнить все пробелы.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is about creating a voting DApp that incentivizes meaningful participation in DAO Net processes, including a wallet for DAO token awards. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, suitable for the challenge, shows a clear impact on the Cardano ecosystem as a whole in the short term and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team consists of very active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. However, some members [Atala Prism Developer] and partners [Legal Firm, Tax Accountant] are not defined. After all, in my opinion, this is proof of feasibility from the team profile. The budget is clear and logical. Risk is very clearly defined with mitigation, and further analysis [this is very convincing, I think]. After all, based on the given information, I still strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links [profiles, resources, documents] for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "Integration and/or stand alone voting apps for DAO's if a need not yet filled. ", "q0r": 4, "q1": "The proposers however look to bolt this on to their own product and dont describe solution that could work with ANY DAO. I would however be a step in the right direction if a codebase was made for DAO voting and integrated with wallets (as they suggest), but would be better if it could be used by any DAO or easily modifiable to work on custom DAO's. The proposers have proposed DAO NET in another proposal however, so what happens if they dont build DAO NET? does DAO voting (this proposal) not work at all?, or can they adjust it to be less DAO contract specific, i.e., not only work with their DAO product? ", "q1r": 4, "q2": "I agree that this team has a good understanding and sets goals that can be measured, however my concern still lies in their budget for DAO contract code development. This particular proposal would be a good if it wasn't so DAO NET specific and made a suggestion to layer to improvements (if possible)", "q2r": 4, "assessor": "z_assessor_750", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "Создать DApp для голосования, стимулирующий значимое участие в процессах DAO Net, включая кошелек для вознаграждения токенами DAO.", "experience": "Опытная команда разработчиков блокчейна, пионеров Plutus, операторов SPO, консультантов сообщества и аналитиков решений."}