{"id": 381107, "author": "joe.l.ga", "title": "Galaxy Art DeFi Art Gallery", "url": "https://cardano.ideascale.com/a/dtd/381107-48088", "category": 26240, "amount": 30000, "description": "NFT Art - это новое увлечение в этом году.  Как сделать NFT Art доступным, безопасным и прибыльным для энтузиастов искусства, инвесторов и творцов?", "funded": 0, "upvotes": 16022392, "downvotes": 15799632, "votes_result": 222760, "votes_cast": 142, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is in alignment with the challenge, however, DeFi for NFT and art investment theory needs more development and clarity and sustainable models. The proposal is more or less silent on the protocol that will be used for DeFi and the mechanics for implementing it. ", "q0r": 3, "q1": "The information regarding the proposer is limited to enable evaluation. Assuming that the identity is verified, the project is ambitious and the budget of 30 thousand looks like a severe constraint. The proposer claims No development or project management experience and is not claiming any onboarded team member.  There is a need to develop the proposal in steps if the proposer is not experienced in starting a DiFi platform. The proposal has value and NFT based Defi market is a requirement. ", "q1r": 4, "q2": "The proposal has a wide list of deliverables and they are ambitious. The use of AI for copyrighting of Digital NFT needs clarification and similarly, a few other deliverables need clarifications/further development. The proposal needs improvement and more information to become auditable. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "This proposal addresses the main objectives of the challenge, by proposing to Develop and integrate DeFi for NFT and art investments using integrated platform to facilitate transactions and liquidity to make NFT Art accessible, secure, and profitable for art enthusiasts, Investors, and creators. I agree with the problem statement about NFT being un accessible. NFT also still has lot of room to grow its profitability should it has direct access to DeFi. This project offer solution to that problem and has significant potential for massive NFT usage in DeFi or another financial practise.\r\n", "q0r": 4, "q1": "As experienced developer with 6+ years of exp as a full-stack engineer with HTML5/CSS/javascript and 5 Year Front-end Developer, the project founder has relevant knowledge and significant expertise that could boost the likelihood of project success. They also provide details about how to execute the project by providing milestones and detailed roadmap for three, six, and twelve months and breakdown of budget. However, they didn't address the Risk of their project and therefore no mitigation plan provided. As a rapidly dynamic new idea in NFT, this project can add Risk assessment and mitigation plan or potential solution to ensure the success of project execution.", "q1r": 4, "q2": "The project will have multiple code audit to ensure its security. The community can monitor the progress through their platform and audit reports. The team set up a reasonable success target of for the first three, six, and twelve months of this project. However, I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Just because NFT Art is \"the craze this year: does not mean it will provide the most value for end users in 2022. This proposal seems to combine catchy name-dropping (NFT, DeFi etc) with a solid development background, but lacks any detail about how to bring it together to a finished DApp product people can actually get value from.", "q0r": 1, "q1": "Given the complexity and difficulty of the proposal not enough information is shared why the proposer is uniquely qualified to achieve success. No linkedin or portfolio are shared. 6 years of full-stack experience and knowledge of Solidity will not be sufficient to make this a success on Cardano.", "q1r": 2, "q2": "This proposal provides a lot of detail on KPI and milestones. My problem is that I find it hard to believe that any of them can be achieved.", "q2r": 3, "assessor": "z_assessor_696", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Разработать и интегрировать DeFi для НФТ и инвестиций в искусство с использованием этой платформы для облегчения транзакций и ликвидности. Повысить стоимость НФТ.", "experience": "NFT Games/DeFi/Solidity/web3.js и reactJS.\n6+ лет опыта работы в качестве full-stack инженера с HTML5/CSS/javascript.\n5 лет работы в качестве Front-end Develope"}