{"id": 382035, "author": "jcaso", "title": "C64 Extension Wallet", "url": "https://cardano.ideascale.com/a/dtd/382035-48088", "category": 26240, "amount": 19660, "description": "Расширение кошелька, которое обеспечивает суверенный, индивидуальный опыт для пользователей и разработчиков, поддерживая P2P, NFT, Identity, Voting в качестве плагинов.", "funded": 1, "upvotes": 77413110, "downvotes": 12201552, "votes_result": 65211558, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Я являюсь советником сообщества с Фонда 2 и vCA с тех пор, как себя помню (ладно, не совсем так, с Фонда 3, если быть точным). Я также выступал в качестве инициатора в некоторых фондах Challenge Setting (я достаточно стар, чтобы помнить, когда они назывались Community Choice - да, название было отстойным). Но я начинаю увлекаться. Это предложение практично для конечного пользователя. Его цель - разработать кроссбраузерный легкий кошелек сообщества с всплывающим форматом, который поддерживает переключение сетей (Testnet - Mainnet - Yeah!!!) и объединение их всех в рамках одного инструмента с одного аккаунта. Что делает его еще лучше, так это то, что пользователи смогут сами выбирать доверенные конечные точки. Кроссбраузерный легкий кошелек может оказать большое влияние, если он будет успешным - особенно в связи с тем, что пользователи Cardano все больше разочаровываются в использовании полного кошелька ноды (да, мы смотрим на вас, Daedalus!). Идея использования кошелька с прогрессивным модульным расширением, которое облегчает добавление новых вариантов использования в виде плагинов (кто-нибудь сказал P2P, NFT, Identity, голосование и т.д.?), великолепна и очень эффективна. Если вы избиратель и еще не заглянули на https://c64.app/ (сайт кошелька C64), сделайте это. Я даже не знал о его существовании. Это и есть децентрализация. Больше кошельков, больше подходов, больше устойчивости. Все заинтересованные стороны получают выгоду.", "q0r": 5, "q1": "За проектом стоит очень компетентная команда. В нее входит бывший руководитель DevOps компании Emurgo. соучредитель Gimbalabs, full-stack Developer, Cardano ambassador, SPO, а также экс-Emurgo Yoroi-mobile, советник R&D Engineer... Команда состоит из трех человек, которые явно обладают техническими знаниями для достижения результата. Меня часто беспокоят некоторые предложения - которые могут умереть медленной (или быстрой) смертью после доставки, но что действительно обнадеживает в отношении осуществимости и продолжительного роста этого проекта, так это то, что команда уже разработала будущие функции, которые они намерены создать и добавить с будущим финансированием от Catalyst (в будущих раундах). Кошелек C64 представляется идеей с большим потенциалом роста, что признано командой, предложившей проект. Они включили реалистичный график, разбитый на три ключевых этапа завершения проекта, а бюджет был разложен на составляющие, что позволяет более детально проанализировать работу. Авторы предложения включили и подробно описали ключевые технические компоненты, на которые они будут опираться - и мне нравится, что это будет кроссбраузерный Chrome, Brave, Edge и Firefox (предварительно). Идея включить в предложение демонстрационные материалы была отличной, плюс спасибо за включение профилей Linkedin.\r\n\r\n\r\n", "q1r": 5, "q2": "У предлагающей команды есть четкое видение того, что они хотят достичь, и четкий путь к этому. Они включили четкое и понятное эпланирование того, чего они хотят достичь, а их предлагаемое решение рационально и имеет большой смысл. Команда включила 6-месячный график с 14 KPI, которые они хотят использовать для аудита и развития. Разработка была разделена на три больших этапа, а благодаря подробной разбивке бюджета будет легко проводить аудит. Это пример четкого и хорошо представленного предложения.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Автор проекта хочет создать кошелек расширения и его функциональность может быть расширена с помощью плагинов. Таким образом, в зависимости от того, что вам нужно, вы можете расширить свой кошелек. Это очень интересное и интуитивно понятное предложение, которое соответствует поставленной задаче. Мне также нравится, что автор приложил усилия для снижения стоимости этого предложения путем объединения усилий между предложением фонда 5 и текущим предложением. Если это предложение будет профинансировано и реализовано, то экосистема получит неявную ценность, но, судя по предыдущему опыту этого автора, я не беспокоюсь. KPI будут сообщаться каждые две недели, как это делалось до сих пор. Эффект всегда связан с масштабированием решения, и в данном случае у меня нет никаких опасений, что команда сможет справиться с описанными проблемами. В решение этого проекта вложено много усилий, и это видно, поскольку в предложении нет ни одного пробела. Этот проект принесет значительную пользу сообществу и экосистеме, если будет реализован так, как описано, но я считаю, что он будет еще более полезным, если это будет сотрудничество между несколькими проектами с одинаковыми идеями. Как у разработчика у меня нет никаких опасений по поводу реализации этого предложения.", "q0r": 5, "q1": "Автор предложения добавил профили linkedin членов команды, что говорит о двух вещах. 1. Предлагающие готовы подкрепить свой проект своими именами. 2. Это позволяет проверить заявленные навыки, перечисленные в предложении. 3. (бонус) приносит доверие к проекту. Количество и тип членов команды, очевидно, обсуждались и присутствуют в предложении. Бюджет обработан прекрасно, есть вариант, представленный авторами предложения, использовать средства из предыдущего финансирования более оптимальным образом, и это предложение также получит финансирование, и я поражен тем, насколько четко сгруппированы задачи проекта, если это произойдет. Есть реалистичный график выполнения всех заявленных необходимых работ. В проекте определено, как он будет выполняться и какая реализация будет использована.  Имеется большое описание будущих элементов, которые должны быть поддержаны, что имеет смысл, например (поддержка трезора, ставки и прочее). В предложении рассматриваются некоторые проблемы и риски. Еще одна вещь, которая мне очень понравилась, это список демонстраций, но я коснусь этого в разделе проверяемости. Я не уверен, что проект синхронизирован с другими подобными предложениями, которые хотят создавать отдельные плагины по представленному standad и быть в состоянии реализовать друг с другом на модульном уровне, и мое предложение как разработчика было бы взглянуть на подобные предложения и посмотреть, не могут ли они сотрудничать по некоторым функциям и плагинам. В целом, отличное предложение с большим потенциалом.\r\n", "q1r": 5, "q2": "Я не беспокоюсь об отслеживаемости проекта, так как автор обещал предоставлять обновления о ходе решения в течение 2 недель. Что я бы порекомендовал, так это завести канал discord или telegram для получения обратной связи непосредственно от сообщества, если это необходимо, но это ни в коем случае не является обязательным. Мне очень нравится длинный список KPI, упомянутый в тексте предложения. Они придают обоснованность прилагаемым усилиям, поскольку имеют большое значение для успеха проекта. Дорожная карта и основные этапы также присутствуют и будут видны сообществу, которое хочет следовать им. Я вижу четкое определение проблемы и действительно техническое и глубокое понимание предлагаемого решения.   Я желаю автору удачи на этапе голосования. Это хорошее предложение!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "There is a need for lite wallets to provide more options to end users and developers for experimentation. The proposal will also provide Cardano Backend tools for the community to use and will decrease the dependency on a single entity for providing backend for lite wallets. ", "q0r": 4, "q1": "The team C64 which is proposing this project was funded for a desktop wallet which can mint NFTs. The same team is proposing to create a cross browser wallet in Typescript which is considered better for security than the javascript. The team also proposes hosting of Cardano Backend suites for the lite wallets. Based on the experience and the demonstrated capability it is likely that the team will be able to complete the project successfully. ", "q1r": 5, "q2": "The proposal is detailed with clear risk analysis. The dcSparks connector has been released and is successful therefore the proposal should not be facing any technical blocks. The proposal has a clear roadmap and it is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This is one of the Cardano wallets that was funded in fund 5 and they still keep developing that proposal. This proposal is an additional part that I think they need to do for more convenience to end-users, increase the user experience is what can increase the results of their KPIs that include both in the old one and this proposal. Therefore, this small project will help the whole bigger project better impact on Cardano ecosystem ", "q0r": 5, "q1": "As I mention, this proposal is an expanding fund for developing their browser extensions, which means that they're running this project and have some results on it. We can check the product through the main website of the project. \r\nAnd the team filled this proposal with the whole project implementation plan that all is clear. Therefore, I absolutely believe that they're doing well and will make this proposal good as they did with the other parts of the project. ", "q1r": 5, "q2": "Info in the proposal is completely enough to help auditing works in this scope of the proposal. They pointed the specific outline in the general roadmap that relates to this proposal clearly and all make sense. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "It's great idea to build an extension wallet by adopting the Connector standard from dcSpark for interaction with dapps and Defi services which increases users and devs' experience and the Cardano applicability. Also, this dapps helps Cardano to communicate with other blockchains. The proposer shows a clear roadmap and solutions to build the wallet. This project will definitely help the growth of Cardano community. ", "q0r": 4, "q1": "The proposal has qualified team with experience in developing Cardano, Ermugo and Ardana project which make me believe in the success of implementing this project. The team has a deep understanding of Cardano and their project. They give a clear road map and detailed KPI. Also, I find the requested fund is suitable for their proposal at this stage. ", "q1r": 4, "q2": "It's easy to audit this project as every information related to the implementation of the proposal is clearly stated. They give a detailed timeline for the roadmap,KPI which can be checked on their website and github source. The proposal also gives evidence behind the team backgroud as they are well-known in Cardano community which make this proposal gain more trust. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Разработать и внедрить прогрессивный модульный кошелек расширения, который облегчает добавление новых вариантов использования в виде плагинов.", "experience": "Команда имеет большой профессиональный опыт работы в качестве full stack разработчика, обработки данных в реальном времени, мобильных приложений, системного администратора, devOps и SPO."}