{"id": 382488, "author": "michiel", "title": "Anonymity & data control online ZKT", "url": "https://cardano.ideascale.com/a/dtd/382488-48088", "category": 26240, "amount": 25050, "description": "Сегодня компании отслеживают вас, собирают ваши данные и (неправильно) используют их в коммерческих целях. Вы не можете контролировать/получать выгоду от этого, хотя ваши данные принадлежат вам.", "funded": 2, "upvotes": 167266392, "downvotes": 4282581, "votes_result": 162983811, "votes_cast": 620, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Насколько я понимаю, план разработчиков заключается в том, чтобы переосмыслить опыт использования брендов для людей. Объединив бренды и пользователей на одной платформе, бренды платят за информацию, которую вы решили предоставить на основе нулевых знаний. То есть вы делитесь только актуальной информацией. Классная идея! Эта проблема, решенная здесь, полностью соответствует задаче и нескольким другим задачам, хорошая работа над предложением. Оно довольно подробное. Автор предложения более чем ясно и подробно объясняет ценность уже принесенную, а также ценность, которую он принесет в ходе успешной реализации этого предложения. Есть много ключевых показателей, все они относятся к задаче, которую решает данное предложение, все они связаны с влиянием на общество. В большинстве случаев, когда я делаю обзор, мне очень трудно понять, как авторы предложения будут масштабироваться, если это необходимо. В данном случае мне не нужно беспокоиться об этом, поскольку у них не только есть план масштабирования, но они также его выполняют. Они уже работают с некоторыми брендами и сообществами и не так уж медленно развиваются. Я буквально не вижу и не могу найти ничего недостающего в этом предложении. Это очень трудно сделать, поскольку оно такое длинное и конкретное, и это здорово! Больше предложений должны быть такими.  Как у разработчика у меня нет абсолютно никаких опасений по поводу этого предложения! Отличная работа!", "q0r": 5, "q1": "В предложении перечислено более чем достаточно ссылок. Проверка большинства из них заняла около 20 минут, но все они хорошо подтвердились. Люди, стоящие за предложением, - профессионалы, и именно так выглядит бизнес-план, если вы не видели его раньше. Относиться к сообществу как к будущим заинтересованным сторонам - это действительно крутой способ ведения дел. Больше сил вам. Бюджет изложен четко и разумно. Есть конкретный раздел, в котором конкретно обсуждается разбивка бюджета по времени и затратам. Как разработчик, хотя и не такой опытный, как люди, которые будут работать над этим, график кажется разумным и определенно выполнимым. План внедрения совсем не прост и переплетается с предыдущими уже профинансированными предложениями, которые являются частью собственной экосистемы. Если вы готовы прочитать так много, вы узнаете точную взаимосвязь между каждым предложением и то, как оно является лишь кусочком головоломки в общей картине. Перечислены необходимые ресурсы для реализации предложения, а также для уже реализованных предложений, и я рекомендую ознакомиться с ними. Что мне действительно нравится, так это две вещи: Открытый исходный код части уже реализованных предложений и планы по открытому исходному коду еще большего количества кода. У меня, как у разработчика, аж рот разинулся. Вторая вещь, которую я не вижу во многих предложениях, - это планирование финансирования для себя и запрос только того, что необходимо или минимально необходимого, что очень смело, так что КУДОС за это.  Проект абсолютно синхронизирован с тем, что уже сделано и как это предложение будет улучшено.", "q1r": 5, "q2": "Для всех, кто интересуется проверяемостью и отслеживаемостью проекта, у них есть все необходимое. Каналы Discord, телеграмм-каналы, социальные сети, статьи в СМИ... у них есть все. Вы можете стать частью прогресса, если захотите, но также можете достаточно легко следить за ним. Метрики и KPI актуальны, подробно описаны и, самое главное, присутствуют. Многие разработчики предложений не уделяют слишком много времени размышлениям о KPI, но они являются неотъемлемой частью любого развивающегося проекта. А без метрик вы не сможете оптимизировать процесс, потому что не будете знать, делаете ли вы лучше или нет. Дорожная карта и этапы понятны и разумны для реализации, распределенной по комфортному временному горизонту.  Проблема ясна, решение понятно и читаемо как для технических, так и для нетехнических специалистов. Я просто хочу призвать людей, читающих этот обзор, проголосовать за этот проект, так как он очень важен и полезен не только для всего сообщества, но и для брендов и предприятий, которые присоединятся к нему. Удачи вам!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The crypto and Cardano aim to empower the end-user in all respects. This proposal to aims to empower the end-users to manage the distribution of personal preferences for targeted advertising in a safe manner. The business model makes sense and is achievable. Thus the project is highly in alignment with the challenge. ", "q0r": 5, "q1": "The team is delivering value to the Cardano ecosystem and therefore it is likely to complete the proposal in a good manner. The team has members with more than 10 years of experience and impressive track records in project implementation. The task to be carried out in this phase is reasonable and therefore very likely to be successful. ", "q1r": 5, "q2": "The proposal has many common aims with Brave however with identity and user willingness to share details it may lead to better earning potential for the user and for the company. On the face, the business looks promising. The company has a detailed road map and a viable business model. With AralaPrism in advanced stages, it is highly likely that the project will be successful. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Being very much in line with the crypto folklore of privacy, anonymity and sovereignty, Profila will attract a lot of users from the wider crypto community if they fulfill their goals successfully.", "q0r": 5, "q1": "Team is highly experienced and transparent - all the profiles are publicly visible. The proposal is written with a lot of attention to detail and shows deep understanding of the matter at hand. Also, team was funded in Funds 5 and 6 which shows the trust the community has already given them.", "q1r": 5, "q2": "The budget is broken down clearly, but the success metrics seem vague and not detailed enoguh. It would be great to see month-to-month an operational plan and measures of success on a monthly basis just to track progress. It would be helpful for auditing as well as for the team themselves.", "q2r": 3, "assessor": "z_assessor_65", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Protecting personal data in this digital era is the thing that everyone nowadays cares about. In the open world that every app, the website always want to take our information then use it for commercial purpose, this idea of proposing a team will help to protect us from that problem. It will help us manage our digital life in one location via an app that shows which organizations have access to (certain parts of) our personal data. I believe that the success of this app will drive a lot of adoption to Cardano ecosystem because it's necessary for everyone.", "q0r": 5, "q1": "This proposal is a part of their big vision that has many proposals were funded in fund 5 and 6. Moreover, that bigger project is running and we can check their info in the website and social links. \r\nMoreover, the team showed a very detailed implementation plan and explanation about what has in their (D)app. We can understand how this app work, which part of the problem that the feature is solving... \r\nThey also show a reasonable budget breakdown of the plan. \r\nSo I think I can believe this team 100%", "q1r": 5, "q2": "The team has a great detailed roadmap and promising key metrics, some of these steps were finished and some ongoing.\r\nThey also have very detailed info about the problem to show how much they get it, that's the reason why they have a great solution explanation that easy to understand. It's appreciated when they include a lot of case studies to explain how a feature will work and help users. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "Tmr, используйте наше приложение для работы с данными на основе согласия (D)app, контролируйте, кто может получить доступ к вашим данным, и получайте компенсацию за ваше внимание в виде токенов с нулевым знанием (ZKT).", "experience": "Юрист в области конфиденциальности/технологий и предприниматель - 10 лет XP в (соответствующих) юридических вопросах - конфиденциальность; цифровой маркетинг; права на данные и виртуальные валюты."}