{"id": 384071, "author": "keith", "title": "Music NFT Launchpad", "url": "https://cardano.ideascale.com/a/dtd/384071-48088", "category": 26240, "amount": 20500, "description": "Музыканты не могут эффективно диверсифицировать и монетизировать свою музыку, используя существующие платформы, возглавляемые доминирующими корпорациями.", "funded": 1, "upvotes": 47129533, "downvotes": 9794957, "votes_result": 37334576, "votes_cast": 183, "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Это предложение направлено на решение проблемы, связанной с тем, что музыканты не могут монетизировать свою музыку, используя существующие платформы в музыкальной индустрии. Будучи сам музыкантом, я знаю это слишком хорошо. Решение проблемы не содержит фактического решения, но, к счастью, оно содержится как в названии проблемы, так и в дорожной карте. Команда стремится создать для музыкантов способ узнать о Music NFT и выпустить их как таковые, наряду с релизом на платформе потокового вещания. Учитывая, что музыкальная индустрия довольно сложна, мне бы хотелось немного больше подробного объяснения того, как будет работать их платформа, но я перейду к этому позже. Эффективная интеграция музыки и артистов в пространство NFT уже много раз предлагалась и пробовалась (потому что это очень нужно), но до сих пор не было запущено действительно надежной платформы. Основная идея очень актуальна и замечательна, и в случае успеха и правильного развития она может стать огромным событием как для экосистемы Cardano, так и для музыкальной индустрии в целом. Я согласен, что данное предложение решает поставленную задачу, хотя и неясно, как оно направлено на реализацию этого плана.", "q0r": 4, "q1": "Команда обладает большим опытом в области маркетинга, дизайна, проектирования и консалтинга. Ведущий основатель является оператором пула колов, что доказывает глубокую вовлеченность и понимание экосистемы Cardano. Одним из дополнений, которое еще больше укрепило бы доверие к команде, является включение некоторых других источников, которые могут подтвердить опыт и компетентность команды. Есть ссылка на бета-версию продукта (что хорошо), но я прошу представить самих членов команды. В предложении запрашивается менее 10% от общего бюджета, но было бы неплохо увидеть оценку рабочего времени, включенную в часть предложения по распределению финансирования. Например, сколько часов означает выделение 5000 долларов США на веб-разработчика, и на какой период времени? Очень многообещающе, что стартовая площадка (artistdrop.io) уже работает, это говорит о будущем проекта. Если я правильно понимаю предложение, команда будет сама майнить оригинальные работы художников в NFT, которые, вероятно, будут как оценены, так и раскритикованы художниками. Простой пример описания процесса использования платформы с точки зрения как художника, так и покупателя внес бы много ясности в это предложение.  В целом, я согласен, что есть хорошие шансы на успешную реализацию этого предложения.", "q1r": 4, "q2": "Предложение включает дорожную карту, охватывающую период с 4 квартала 2021 года до 2 квартала 2022 года. Чтобы еще больше повысить прозрачность предложения, на мой взгляд (как опытного консультанта сообщества), было бы полезно включить в дорожную карту некоторые KPI. Например, с какого момента начнется \"включение 4 музыкантов в месяц для NFT дропа каждую неделю\"? Началось ли оно уже? Кроме того, объяснение процесса устранения посредника в майнинговом сервисе и возможных трудностей, связанных с этим, поскольку многие люди не знакомы с тонкостями майнинга NFT.\r\nЧто действительно повысило бы доверие к команде и предложению, так это некоторые размышления о потенциальных рисках и проблемах, связанных с развитием этого проекта. Как активному музыканту, имеющему опыт работы по контракту со звукозаписывающими лейблами, мне интересно, как команда будет обращаться с правами на музыку, если она будет выпущена на других платформах, но в то же время будет майниться на artistdrop.io? Будет ли это происходить в сотрудничестве с потоковыми платформами и звукозаписывающими лейблами или без их ведома? Или предложение будет ориентировано на независимых артистов? В музыкальной индустрии очень много контрактов и подводных камней, и я считаю, что самая большая сложность в создании надежной NFT-платформы для артистов кроется именно там. Объяснение того, как команда стремится преодолеть эту проблему, пропорционально повысило бы доверие к предложению. Ввиду ограниченности информации, представленной в данном предложении, я не согласен и не согласен с тем, что данное предложение предоставляет мне достаточно информации для оценки прогресса в достижении заявленных целей.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal defines a problem and introduces a solution to tackle it. It could have been made clearer what exactly makes this marketplace special in comparison to other marketplaces. ", "q0r": 4, "q1": "The proposal is already in the works which shows the commitment of the team. The team has a wide experience in tech and blockchain and the lead founder is already involved in the cardano community since several years. They could have added some more technical aspects to the proposal in my opinion, why I will rate this with a four.", "q1r": 4, "q2": "The proposal provides information about the team, the roadmap and how they will use the budget. In my opinion the roadmap could be more detailed. Also the key-succes metrics could be explained a bit more in detail. Overall the proposal provided more than enough information to asses it and get an idea of the product", "q2r": 4, "assessor": "z_assessor_41", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The problem in the proposal is within this challenge. Their success metrics also fit with the challenge direction. But the team should provide more info about how their event will impact the Cardano ecosystem. ", "q0r": 4, "q1": "The team doesn't have a clear implementation plan that helps to understand what they will do. This project is not simple and they need to think more about the plan to add to the proposal instead of only brief info for each field of activity. \r\nAfter that, they should make a more detailed roadmap. And some relevant risks, that the team doesn't mention here. \r\nAt last, the budget that the team required is suitable with the provided roadmap, but as I mentioned above, they should make a better plan, then a better roadmap to help CA assess it. ", "q1r": 3, "q2": "For the idea of this project, my advice to the team is that they should make a better roadmap. The current roadmap and key metrics are close enough to audit what they will do in the future. \r\nThey don't have any content to show about the well-acknowledgment about problem context and clarify how their solution can address it. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The music NFT launchpad proposal fits well with dApp & integrations by allowing the artist to launch their singles or albums using a NFT along with a release to their streaming platform. This will encourage more artists to use the platform and lead to increasing adoption on Cardano.", "q0r": 5, "q1": "Although the proposer team has no direct experience in music, their technical background (engineer, consultant, and designer) will help them to implement this proposal. It would be quite good for them to locate someone who could look into smart contract development as they will work closely with smart contract developer and it will be a smooth operation when the team can communicate which feature is necessary for the future launchpad.", "q1r": 4, "q2": "The funding allocation looks plausible but the community would appreciate more elaborate response for this part. To create the launchpad ready in 6months is quite an impressive task in itself. Anyhow the community can assess the fund flow as well as monitor the project progress anytime at ease with the mentioned KPIs. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "I see value in creating a platform where creators/musicians can sell their music NFT(s) in the Cardano ecosystem. This will in fact benefit the current users and attract new users, as the problem has been clearly  stated, that musicians in the traditional schemes of this business are being monetized by corporations and not having the true value of their own crafts. ", "q0r": 4, "q1": "The team members are clearly stated, and I have looked up to the website. I am not sure what the proposer means as live, as the current website have only few information about the proposal. Moreover, I have tried joining the discord server but was unable to as the invitation was expired. In addition to this, as a UI/UX designer that uses Figma, the prototype on the given link is only half way done. This gives a lack of confidence for both CA(s)  - to understand clearly the proposer's idea, and voters - to have confidence in which how the technical development of the idea. Though the roadmap has been defined, but vision of expansion, milestones to develop, and risks to be taken are not well delivered. ", "q1r": 2, "q2": "The required funding must be broken down in a detailed manner and take account of risks that will be addressed, as to have better auditability. What's lacking is the milestones and management on the KPI(s) given. For example, how do the proposer intend to increase musician revenue by 20% by Q2 2022. What steps should be taken to put importance and protect/avoid musicians from scammers in the platform? What are the UX features that enables users to adopt the platform easily? ", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Onboarding musicians to distribute their work through NFTs on Cardano, has the potential to greatly popularise the platform. However, after reading the proposal I'm not convinced that the team behind it is the right candidate for the job. On the other hand, this may be the result of a rushed proposal due to lack of time.\r\nThe idea has a lot of potential, and it would be great to see a CNFT \"record label\" be born, that's why I would hope that the team resubmits a more complete and thought out version of the proposal in the future.", "q0r": 2, "q1": "The description of the proposers' experience is very promising at first glance, but no credentials or links to previous works are given to allow the community to verify and better judge for themselves.\r\nGiven that their landing page is presented as a working platform I have my doubts about the standards of the team at the moment.\r\nI would advise filling in the gaps in the gaps in the proposal, elaborating on the promising concept and resubmitting it to a future fund.", "q1r": 3, "q2": "Not a lot of thought seems to have been given to the KPIs of the proposal, they are present, but are very shallow. I would suggest further elaborating on them in a future iteration of the proposal.\r\nThe proposers are keen to point out that their service is already live, however on inspection of their website I discovered that it is little more than a landing page with a brief FAQs section.\r\nThe budget is broken down, but the figures seem a bit generic, particularly the sum allocated to the smart contract developer. The roadmap is brief and introduces elements not detailed elsewhere in the proposal.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Музыканты смогут выпустить свой сингл или альбом как NFT вместе с релизом на стриминговых платформах.", "experience": "В настоящее время наша команда состоит из трех человек с разнообразным опытом работы в сфере технологий, блокчейн-финансов и маркетинга."}