{"id": 384143, "author": "sikaffy27", "title": "Blockchain based insurance pool", "url": "https://cardano.ideascale.com/a/dtd/384143-48088", "category": 26240, "amount": 29000, "description": "Страховые компании устанавливают правила удовлетворения претензий и имеют полный контроль над ценой/услугами. У них слишком много рычагов влияния на людей.", "funded": 0, "upvotes": 15105787, "downvotes": 15942734, "votes_result": 836947, "votes_cast": 143, "f6_no_assessments": 5, "f6_rating": 2.4, "videos": [], "media": [], "f6_assessments": [{"q0": "The team demonstrates limited understanding of the insurance industry, and is heavily mis-focused on tech. Had they worked with serious insurance industry players- at the level of syndicates and major wholesale firms like AON or others they would have a greater chance of making an impact on this industry. Right now, as is this proposal seems to just be throwing rocks at a behemoth that will not change anything.", "q0r": 2, "q1": "I see no experience in the greater insurance industry for a proposal which wants to change that massive, well established industry. Will not work as outsiders", "q1r": 1, "q2": "Can not audit how these proposers will progress towards changing an industry", "q2r": 2, "assessor": "z_assessor_251", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The idea of using \"blockchain to create a pool of shared risk and eliminate the need for an insurance company\" is a recorded use case of blockchain and is known. However there are sill procole and implementation level issues to overcome the problem of transporting the insurance to Block chain. THere is a need for a detailed paper on how the proposal will be implemented. ", "q0r": 3, "q1": "The proposal list a balanced team of four persons who will implement the proposal. Inclution of refencces and listing past work would have made the assessment easier. There is a limitation in information regarding how the protocol is actually tranfering the risk. The explanation is not bringing out the actual insurance dynamics for common understanding. ", "q1r": 3, "q2": "There is a need for a detailed road map for building the system. It is difficult to appreciate that a decentralized insurance platform can be built in less than 20 K USD by a single blockchain developer.  Any prototype build in the past or the other past work of developers will add value to the proposal. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This is a strong idea that identifies an industry that requires blockchain to improve the incentivisation mechanics. Furthermore, there is a strong understanding behind the tokenomics that will drive this idea. \r\nIn order to improve this proposal going forward it would be beneficial to have a deep-dive into how the proposal aims to improve the existing system and how it works in practice.  This would potentially look like unpacking the comment around 'democratising healthcare' [insurance] and how you plan to do this. The practicalities around \"is this parametric\" or \"what type of data sources from oracles will you use\" are some important questions that have not been answered and doesn't allow the community have confidence that this doesn't just remain as an idea.  Finally, you would benefit from providing tangible goals/targets/metrics in order to align further with the challenge criteria. This would make it easier for assessors and voters to ensure that proposal is in scope of what the challenge is trying to achieve.  ", "q0r": 2, "q1": "The proposal would benefit from further outlining the experience of each team member. Providing links to portfolios or LinkedIn profiles would give further confidence to voters.  Especially, for building an insurance protocol, would it be beneficial to have an adviser from the insurance space at all? If not, unpacking why would have been helpful.   Further, the proposal would also benefit from having a clearer budget breakdown in terms of why the figures amount to what is requested and how it plans to achieve the set goals. \r\n\r\nAnother aspect of the proposal that appears to be lacking is a breakdown of the risks associated to the project. Are there any tokenomic risks such as incentivising agents to provide liqudity or selling insurance policies? Any development risks using the new smart contract functionalities? Any risks associated to sourcing the right data oracles? Unpacking even a few of these emerging risks would have highlighted a deeper recognition and maturity of the project difficulties and challenges. ", "q1r": 2, "q2": "The proposal would be benefit from outlining important information such as a roadmap, estimates of key activities to be delivered, details on budget allocation and details about the proposers. For future proposals, ensuring you are able to align proposal metrics against some of the challenge metrics would be ideal. Forming a view of a roadmap against these metrics would have been a great opportunity of showcasing the linkage to the challenge in an auditable way. ", "q2r": 1, "assessor": "z_assessor_586", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "I feel that this proposal is within the challenge of does add value to the Cardano ecosystem. I assume that this is very much align as how Olympus DAO; creating a reserve for the holders of Cardano based on its tokenomics. However, there are no attached or additional information on how the application would be visually, or any links for prototype of the application. This make the proposal remain abstract. ", "q0r": 4, "q1": "The team mentioned claims they are able to build the product, but it would be great if there are links of references and the proposer(s) budget breakdown should be more detailed in terms on hiring for front-end development/back-end development/marketing plans/tokens auditability. Given that amount, I would expect an appropriate level of depth when addressing how this budget is going to be spent. The proposer lack of major information to provide to the voters to achieve success. Moreover, without the success of the proposer actions and proper key metrics/milestones - I am unable to establish the validity of claims/experience of the proposer. The proposal is more than a concept rather than an execution.  Therefore, I don't think this proposal will be implemented successfully and will give a rating of 2.", "q1r": 2, "q2": "The proposal lacks some important information, such as roadmap, estimates of content to be produced, details on budget allocation. Key metrics and what success looks like within the timeframe are not mentioned too. To CA(s), and to the voters, these key factors are important not to only back the proposer's idea but to have better understanding on what the proposer wants to achieve, be it short term and long term vision. I feel that, this is only a brief of the proposer idea with much information on what their solution is without its in-depth analysis and technicality research. Possible challenges are not considered, thus voters and CA(s) are unable to define the alignment of the proposal with the challenge fully. Therefore I am rating this a 2, as it will be difficult for further auditability.", "q2r": 2, "assessor": "z_assessor_669", "no_vca": 15, "ne": 5, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This is a great idea - an insurance pool with membership represented by tokens. This will create great utility for Cardano, and solve a real life problem. The idea is set out in detail.", "q0r": 5, "q1": "The proposal names four team members but does not lay out what their roles will be and there is no links to proof their skills and education. The budget is given very basically. The plan is set out with a lot of detail, but I would have liked to see them separate the milestones, road map and KPI's as well as risk. Everything is just mixed together with a lot of other details. ", "q1r": 3, "q2": "It wont be possible to track this project, there are no timeline with goals, and no KPI's. There is also no mention of how they plan to keep the community up to date with their progress.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Используйте блокчейн для создания пула совместного риска и устранения необходимости в страховой компании. членство будет представлено токенами.", "experience": "Марио Мураллес - экономист\nДаниш Хамид - Full Stack разработчик\nДэниел Голман - разработчик javascript\nСтивен Кларк - разработчик Rust"}