{"id": 384826, "author": "albert.feghaly", "title": "OpenScienceNFT Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384826-48088", "category": 26240, "amount": 23700, "description": "Научные знания часто оказываются запертыми за платными стенами, несмотря на то, что они в основном финансируются обществом. Наука должна быть более доступной.", "funded": 2, "upvotes": 229711277, "downvotes": 6106817, "votes_result": 223604460, "votes_cast": 1322, "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Очень хорошо сформулированное и представленное предложение, которое идеально соответствует условиям задачи.  Постановка проблемы проста для понимания, и, будучи инженером-программистом, я не понаслышке знаком с ситуациями, когда много хорошего контента/научной работы недоступно широкой публике, несмотря на то, что финансирование идет из государственных источников.\r\n\r\nДанное предложение, в случае успешной реализации, пытается решить такую проблему и обеспечивает глубокий взгляд на многовариантность этой проблемы.  В предложении уже рассмотрена правовая база, которая будет важна для успешной реализации данного предложения. Поэтому, по моему мнению, данное предложение имеет хороший потенциал не только для улучшения прочности сети cardano, но и соответствует видению и цели cardano, то есть миру равных возможностей в будущем.", "q0r": 5, "q1": "Команда из этого предложения уже получила успешное финансирование в предыдущем раунде, и это предложение основывается на работе, которая была обещана/нацелена в предложении Фонда 6.\r\n\r\nОпыт команды находится в открытом доступе, и последняя информация от команды регулярно обновляется по ссылке, указанной в заявке.\r\n\r\nПлан очень амбициозный, и подробная схема была представлена как с высоты птичьего полета (чтобы всегда видеть общую картину), так и с подробным описанием стратегий монетизации osNFT. Очевидно, что команда продумала дорожную карту и этапы, а также влияние этих дорожных карт, с этапами выполнения в 3-6-12 месяцев.\r\n\r\nЛогично, что хотя команда позволила сообществу получить предварительную информацию о долгосрочной дорожной карте, она также ограничила себя в этом раунде финансирования в плане запрашиваемого бюджета. Разбивка бюджета мне кажется оправданной, и я уверен, что команда будет иметь большой успех и положительную обратную связь с сообществом, что приведет к успеху этого предложения.\r\n", "q1r": 5, "q2": "Я полностью согласен с тем, что представленной здесь информации достаточно для проверки хода и успеха данного предложения. Команда является публичной, и ссылка на их веб-сайт, где они еженедельно публикуют информацию о ходе работ, является хорошим способом для сообщества следить за ходом работ.\r\n\r\nКроме того, на сайте подробно описаны различные этапы, на каждом из которых ожидается набор функций и предполагаемые сроки их реализации. Это в сочетании с еженедельными обновлениями обеспечивает хорошую положительную обратную связь с сообществом, так что любые изменения в прогнозируемой дорожной карте быстро распространяются среди сообщества.\r\n\r\nВ целом, очень подробное и хорошее описание этого предложения и, следовательно, полные баллы с моей стороны.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Авторы предложения хотят создать академический рынок для доступных исследований, которые можно будет ставить, продавать или заимствовать. В предложении упоминается проблема того, что академические исследования не так легко доступны, хотя они в основном публичны. Я не знал этого, но после небольшого исследования я понял, что проблема существует, и она соответствует условиям задачи. Предложение добавляет исчерпывающее объяснение того, какую ценность оно принесет системе cardano, привлекая больше ученых в сообщество cardano. Цели предложения - это именно то, к чему стремится каждое сообщество: больше образованных людей, людей действия на борту. После прочтения предложения я не сомневаюсь, что авторы без проблем масштабируют свое решение, чтобы справиться с проблемами масштабирования, с которыми они столкнутся. Я прочитал довольно много предложений, число которых перевалило за 40, и я не вижу, чтобы в этом предложении отсутствовали какие-либо ключевые пункты. Предложение включает академическую сферу и создает рынок, который поможет некоторым обездоленным академикам, что действительно благородно.  Это отличное предложение, я буду голосовать и болеть за них!", "q0r": 5, "q1": "Со времени последнего раунда финансирования авторы увеличили свою команду, что стало для меня приятным сюрпризом. Это означает две вещи: 1. Они успешно прошли голосование и уже работают над предложением. 2. Их идея достаточно хороша, чтобы привлечь других ученых. Их полномочия можно проверить, поскольку авторы связали аккаунты в linkedin всех членов команды. Команда формируется, чтобы быть подходящей, так как она сформирована из членов по всему миру. Бюджет описан и подробно расписан. Есть разумные и достижимые цели. Я ни в коем случае не эксперт в академической среде, но что касается кодирования и разработки, то мне, как разработчику, их дорожная карта и график кажутся разумными и вполне выполнимыми. План реализации кажется последовательным и логичным. Все ресурсы, необходимые для реализации предложения, перечислены, и довольно много сценариев, таких как децентрализация, будущее управление, а также привлечение большего количества людей, хорошо продуманы и подробно описаны. Упоминаются и технические аспекты предложения. Языки и технологии, которые будут использоваться, а также причины, по которым они будут использоваться. Авторы предложения рассмотрели проблемы и риски, связанные с реализацией и поставленной целью. Мне особенно понравился тот факт, что они продумали различные способы использования токена osNFT. Эти ученые провели исследование того, что уже доступно, и будут строить на основе кирпичиков других членов сообщества, что является правильным способом разработки с открытым исходным кодом. В целом, это вполне осуществимое решение, и я не могу дождаться, когда оно станет реальностью.", "q1r": 5, "q2": "В отличие от многих других предложений, я не беспокоюсь о возможности отслеживания. На своем связанном сайте авторы создали раздел под названием \"Еженедельные обновления\", где они общаются со всеми людьми, заинтересованными в их проекте, и сообщают о ходе работы. В дальнейшем они планируют создать раздел со статьями в блогах о том, что делается и как продвигается проект. Это отличный канал для вовлечения и вовлечения сообщества. Упоминаются соответствующие метрики и KPI, которые, по мнению ИМХО, соответствуют успеху проекта. Есть обзор пути с высоты птичьего полета, а также вехи, все в выполнимых временных рамках. Четкое понятное описание целевой проблемы и подробное, хорошо продуманное академическое описание решения.   Я желаю вам всего наилучшего. Продолжайте делать то, что вы делаете!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims for a continuing of the funding after the project received funding in the previous round. The team has been spending time and funds to research and set up a framework, deal with copyright issues and other relevant topics around creating a science marketplace in combination with an NFT model. One of the objectives is to get rid of paywalls so that more people have access to scientific papers - another objective is to reward scientists and give the opportunity for them to receive funding for future work.", "q0r": 5, "q1": "The team is multi-disciplinary and does include academics as well as developers - so the necessary skillset of the team matches the objectives and enhances the likelyhood of this proposal being implemented successfully. The prior work and the references provided are very positive and on task and it is nice to see how excited the team is about their project, I like it. I think the proposing team has done good work at looking at the necessary issues that come with creating such a marketplace, which is good. I´m an academic researcher with more than 7 years of experience both as a peer reviewer as well as a published academic in peer reviewed academic journals. While I think that the process of reviewing the quality of a paper or a study could be improved, I do not believe that the peer review process is meaningless, I find it important that internal and external validity of a research design is monitored to ensure that . The way that this group of people are brainstorming and creating a framework to include researchers with less access to funding is great and could contribute widely to a fairer system of how science and scientists can use their research. ", "q1r": 5, "q2": "The team is a prior funded team that is now seeking additional funding to continue their work. They are providing several very thorough ways of auditing their progress, the team is very transparent, the roadmap and the goals are realistic and the budget makes sense. The skillset of the team matches the task, the work they have been doing since they got funded is very goal oriented and the project is taking shape while the team seems to be very excited about this project. Overall great.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal spells out a useful tool for the scientific community and a powerful draw for ADA adoption through NFTs.", "q0r": 5, "q1": "The team has made good headway and clearly considered many of the potential stumbling blocks for their ambitious set of goals. This is an already funded proposal that has done good work. The budget and roadmap are transparent and feasible.", "q1r": 5, "q2": "The team's credentials, a plethora of readily available resources such as github, and the well-defined roadmap all point to a transparent and auditable product.", "q2r": 5, "assessor": "z_assessor_501", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "In academic world, we didn't realize how much scientists' hard-work could be overlooked and under appreciated inside this multi-billion dollar industry (scientific publishing). This proposal deliver a solution to give that ownership back to them, the scientist, with building an OpenScienceNFT Marketplace. This project will help the academic world become decentralized and independent from the middleman (that is the publishing firm), and get royalties paid directly to the scientists. This will help not only the adoption of Cardano, but the independent scientific academy to self sustain itself without the need of publishing industries. ", "q0r": 5, "q1": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q1r": 5, "q2": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 18, "ne": 6, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by implementing NFT for researchers can publish, retain ownership of their work and distribute it to the general population in a marketable fashion. The science innovation often not available for public, despite it being mostly funded by the public. This project will be a solution to make science and knowledge more accessible for the non-scientific community. The use of NFT as main source of ownership is already common and widely accepted in the world. Should this project able to convince science community to join, it could bring more credible credential to Blockchain especially Cardano. ", "q0r": 5, "q1": "Team consist of multiple individuals with significant credential who hold PHD and Post Doc. Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides clear roadmap and requests a reasonable budget with detailed breakdown. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable, and team has explained clearly their step-by-step execution plan. This proposal is one of the best in Fund 7 and should be voted by the community.", "q1r": 5, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. Team does not mention where they will publish the progress of project execution making their web as the only source of monitor or audit the project. So, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member. This project is the one holding most potential in Fund 7 and should be voted by the community.", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Publishing scientific research is necessary for the development of human beings, it will help people to learn - understand - develop this world better and faster. And one of the big values that bring to the digital world is preventing info manipulation or fake info that is happening every day. \r\nThis project will have a huge impact on the Cardano ecosystem, not by just its idea that can drive and keep sustainable users, but also as the team points out in the proposal. ", "q0r": 5, "q1": "A part of this project was funded in the fund6 and the team finished it well, now they made this proposal for the next step of their roadmap. There, I absolutely support them in this proposal. \r\nThey have a good vision and detailed info that can help us well know about what the team will do to make the idea come true. For this fund, they have a reasonably required budget that fits with the plan in the scope of 6 weeks. ", "q1r": 5, "q2": "The team provides various ways to track and audit their project. Their roadmap and key results also are clear and detailed, which makes the auditing process easier. \r\nSure that they have a good acknowledgment about the problem context that is detailed in the referral proposal in fund 6, and that helps to better understand their solution explanation. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1}], "solution": "С помощью osNFT исследователи могут публиковать, сохранять право собственности на свою работу и распространять ее среди населения в товарном виде.", "experience": "Биоинформатика, Python, JS, Big Data, ML, AI, Blockchain.\nКоманда = 5 + 3 советника -> https://intellart.ca/#/team\nУровень PhD, уровень Post-doc."}