{"id": 381338, "author": "tim.heidfeld", "title": "Global Identity and Authentication", "url": "https://cardano.ideascale.com/a/dtd/381338-48088", "category": 26254, "amount": 93000, "description": "Sans identité, il n'y a pas de propriété, pas de progrès économique, pas de prospérité, pas d'actions juridiquement contraignantes.", "funded": 1, "upvotes": 23090674, "downvotes": 14098296, "votes_result": 8992378, "votes_cast": 155, "f6_no_assessments": 4, "f6_rating": 2.9166666666666665, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=1860"], "media": [], "f6_assessments": [{"q0": "Le problème et la solution présentés par cette proposition la placent certainement dans le bon défi. L'identité numérique sera primordiale dans les futures transactions économiques et les solutions qui mettent l'accent sur la propriété personnelle des données seront probablement l'aspect le plus souhaité pour une adoption réussie. Cette proposition vise à contribuer à l'accélération de ce défi, d'où mon accord sur son impact et son alignement. Là où la proposition n'a pas obtenu le meilleur score, c'est dans son incapacité à expliquer clairement comment cela sera accompli. Il y a beaucoup de déclarations de haut niveau, mais pas assez de détails granulaires pour expliquer ce qui est en train d'être construit, comment la collecte des données personnelles sera effectuée (en particulier les données biométriques), quelles sont les ramifications juridiques de la collecte des empreintes digitales, des scans du visage, des scans de l'iris, etc. et comment toutes ces informations personnelles collectées sont liées à l'exécution en 1-Click (et à qui ?).", "q0r": 4, "q1": "Alors que les membres de l'équipe sont nommés dans la proposition et que leurs qualifications respectives sont publiées dans LinkedIn et accessibles via le site web iamx.com, je ne suis pas sûr de la faisabilité de ce projet car il n'y a aucune forme de plan établi. Il y a des \"résumés\" des objectifs et des avantages qui sont décrits à un haut niveau et sous forme de points. Si cela convient pour un bref résumé, ce n'est pas bien présenté dans une proposition où 93 000 dollars sont demandés. Afin d'augmenter la faisabilité, je suggère que cette proposition soit réécrite avec un calendrier clair d'un plan exécutable. Cela donnera aux électeurs l'assurance qu'il y a un début et une fin et que chacune des étapes intermédiaires a un coût clairement expliqué. La proposition énumère les résultats et les avantages pour l'individu, l'État (Ghana) et l'écosystème, mais elle va trop loin sans fournir d'informations substantielles sur la manière dont elle va y parvenir. Elle pourrait également bénéficier d'une explication sur la raison d'être du Ghana. D'après ce que je sais, l'équipe d'iamx est basée en Allemagne. Quelles sont les relations existantes avec les entités ghanéennes qui rendent ce pays idéal pour le pilote ?", "q1r": 2, "q2": "Le fonds de 93 000 dollars demandé n'a pas de ventilation claire de ce qui compose ce montant, ce qui est essentiel pour tout audit et examen de tout projet. En outre, aucun plan n'a été établi pour expliquer comment l'équipe lancera les activités, qui et quels rôles y participeront et où/quand cela se terminera. Ces aspects manquants et très critiques sont les raisons pour lesquelles j'ai donné une note si faible pour l'auditabilité. Je suggère que l'ensemble de la proposition soit réécrite avec une clarté permettant d'informer facilement un électeur qui ne fait que parcourir rapidement une proposition avant de voter pour ou contre. Il pourrait également être utile à l'équipe de proposition de consulter d'autres proposants ayant obtenu des résultats positifs ou d'examiner des propositions antérieures afin de se faire une idée des éléments obligatoires pour avoir un certain succès dans les demandes de financement. Le site web d'iamx affiche une association avec l'Alliance AMA, je suggère donc de s'engager avec leurs équipes qui ont été financées avec succès. Elles sauront certainement quels sont les détails pertinents nécessaires pour obtenir une place dans Catalyst. Je suis presque insulté par cette proposition étant donné le statut que IAMX a reçu de IOHK lui-même, étant 1/3 des équipes listées dans la section Identity Ecosystem de IOG. Les membres du personnel de IAMX sont des personnes accréditées, mais aucun effort ne semble avoir été fait pour préparer cette proposition, car la plupart du contenu a été repris de leur site Web. IAMX dispose d'un pool actif et est actif sur twitter, donc en ce sens, il existe des canaux à partir desquels ils peuvent être tenus responsables par la communauté.", "q2r": 2, "assessor": "z_assessor_42", "no_vca": 23, "ne": 12, "ng": 7, "nfo": 4, "vca_o": 2}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies a very important problem regarding DID: the lack off accessibility of identity itself and the cosequencies from it. It approaches this problem with a valid solution that will both benefit the Cardano ecosystem and the people that suffer from a lack of identity. The solution provided is very detailed and well-made. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they and their project partners will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 6, "nfo": 8, "vca_o": 1}, {"q0": "I disagree that this proposal aligns with the objectives of the challenge. The idea can be defined by the following passage: \"provide free and solid biometric identity, owned and controlled by the holder\". In theory this is great, but where does Cardano come in, where does Atala Prism fit in? Unfortunately, during the description of this project, the proponents focused on explaining the product but not on making us understand how it would benefit the Cardano ecosystem. At no point is it said that the decentralized identity would be stored on our blockchain. There's not much else to say, unfortunately. There is no point in offering so many advantages to the final customer, who would have these services free of charge, from what can be inferred, and not benefit those who would be financially supporting the idea... I suggest that the proponents clarify this issue better, because I have read the proposal completely and it is still not clear to me how this bridge would take place.", "q0r": 1, "q1": "We have and do not have information about the team here. I'm gonna explain. Are some companies mentioned that would be part of the project (IAMX AG, Zug, CH), would the executive board be the leaders of these organizations? Would a total of 25 people be involved in the project? It would be essential to know who they are, individually. Names, positions, how they would work on the project, professional training, who would be responsible for the development in Cardano... It is positive that they clarify the industry sector and the business model, but at the same time, some information is somewhat loose, such as for example, we only have contact information for these companies (IAMX). It is very positive that they anticipate the risk of so many different aspects, such as software risk, product risk and so on. This demonstrates a lot of experience in the development of this project. However, it is essential, in my opinion, that we know the characteristics of the members individually, this is what builds greater trust in the team: a more humanized notion about who we are dealing with. About the script: totally absent. The team provides us with a lot of relevant information about the project, such as benefits for customers, risks, objectives, etc., but at no time are phases and activities to be carried out to achieve the goals determined. It is not possible to understand how the development process of this project would take place. And finally, in terms of funding, nothing is said about how the 93k orders would be used! It is essential to share the money, how much would go for each thing and because, it is a very high value and without any explanation that justifies it, it is very difficult for the community to judge if it is a fair or exaggerated amount...", "q1r": 2, "q2": "The best part of the proposal. The team is willing to provide some very relevant information that would serve as a way of auditing the project, even though they have not traced a roadmap (through which we could monitor whether the activities were being carried out as promised) and KPIs. This information is: the objectives (indirectly, I would say they are the KPIs of the proposal); the results (they could also be called KPIs!); the benefits (through them, we can monitor if what was planned for the client was actually carried out, in addition to conducting a direct survey with the public to understand their degree of satisfaction) and risk analysis (here we have an idea of ​​the problems that would be faced and you can monitor whether they were avoided and/or resolved). It's the part that became clearest in my view, both the team could gather such data and wash it to the rest of the community; how much a local resident who was already part of the Cardano community could make contact with the team and take the information to the rest of us.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 27, "ne": 11, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This proposal includes some technical jargon but is severely lacking in real substance. Too few specific details are provided to judge the impact. Of course, we are all excited about the possibilities of digital identity, but this this proposal doesn't really offer a detailed solution to any problem and does not communicate any technical nuance. The project summary includes many commendable goals that are appropriate for the challenge but doesn't go into detail about how these goals will be achieved. ", "q0r": 1, "q1": "Frankly I'm confused by this proposal because the quality of the the team as listed on the website is very high, but the content on the website and in the proposal are severely lacking in detail and not convincing. The proposers do go into some detail in the comments section of ideascale when responding to questions, but these responses are similar to the proposal body in their tone. Their ISPO stake pool has 4M in delegation so they must have some trust from the community. I'm going to give them the benefit of the doubt that this is a language/communications issue rather than a scam, but I can't give more than two stars considering the quality of the information presented in the proposal and on the website. ", "q1r": 2, "q2": "No KPIs or auditability points are provided. No detailed road map/calendar.  no budget breakdown for the 93k requested. ", "q2r": 1, "assessor": "z_assessor_67", "no_vca": 23, "ne": 3, "ng": 17, "nfo": 3, "vca_o": 1}], "solution": "Fournir une identité biométrique libre et solide, détenue et contrôlée par le titulaire, et des justificatifs vérifiables, acceptés par le vérificateur.", "experience": "Expérience des fondateurs de commerce électronique dans les secteurs des télécommunications, du commerce électronique, des marchés électroniques, de la mode écologique, de l'automobile et du conseil."}