{"id": 381570, "author": "swong", "title": "Bottom-up land registration(Zambia)", "url": "https://cardano.ideascale.com/a/dtd/381570-48088", "category": 26254, "amount": 42000, "description": "Plus d'un milliard de pauvres dans le monde n'ont pas de droits fonciers légalement reconnus, ce qui les empêche d'accéder au système financier.", "funded": 1, "upvotes": 34090478, "downvotes": 11304721, "votes_result": 22785757, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=6980"], "media": [], "f6_assessments": [{"q0": "Du point de vue de l'impact, cette proposition remplit toutes les conditions. Le problème de la propriété foncière dans le monde en développement est important et délicat. L'utilisation de la technologie PRISM de Cardano pour fournir des références vérifiables pour les titres fonciers aurait un impact énorme pour les propriétaires fonciers eux-mêmes, et est également étroitement liée à la mission plus large de Cardano de devenir le système d'exploitation financière du monde. La proposition relève clairement le défi de promouvoir l'adoption généralisée des solutions DID de Cardano.", "q0r": 5, "q1": "La proposition fait un travail fantastique en reliant un objectif global et de grandes ambitions à une preuve de concept très réalisable et mesurable. La proposition décrit le processus de création des éléments de base nécessaires - portefeuilles pour les émetteurs, les détenteurs et les vérificateurs et un moyen d'accéder au logiciel DID. La mention d'une solution DID sur papier suggère une bonne connaissance du paysage local. Il aurait été utile que le proposant fournisse plus d'informations sur ses antécédents et ses qualifications afin d'étayer sa capacité à mener à bien le projet. En recherchant le nom du proposant sur Google, j'ai trouvé son profil LinkedIn qui suggère qu'il a les compétences nécessaires en gestion et en affaires. Le partenaire lié (Medeem) semble également avoir une forte présence sur le marché cible de la Zambie.  Bien que le proposant ne semble pas avoir les compétences nécessaires en matière de programmation PRISM, la nécessité d'engager un développeur est clairement mentionnée, et des fonds du budget demandé sont alloués pour cette dépense. Il est important de noter que la proposition démontre une bonne compréhension des concepts de DID et du besoin de registres de confiance, ce qui rend possible l'embauche et la direction d'un développeur pour construire la preuve de concept envisagée. La proposition fournit les prémices d'un modèle de revenus qui soutiendrait le projet une fois que les fonds initiaux de Catalyst auront été dépensés.", "q1r": 5, "q2": "La feuille de route est très claire et explique étape par étape comment le projet va progresser. Les indicateurs clés de performance sont également clairs et fournissent des objectifs numériques faciles à mesurer pour les différentes étapes du projet. Le budget est divisé en plusieurs postes qui sont clairement liés au plan et aux objectifs du projet. Le montant du budget est très raisonnable et l'idée de construire une première preuve de concept à partager avec le partenaire identifié semble une excellente première étape. Le problème est bien décrit et compréhensible, et la solution décrite répond clairement au problème. Je souhaite à ce projet beaucoup de succès !", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "L'idée correspond partiellement aux objectifs du défi, à mon avis. Je pense que parce que le projet est basé sur le fait d'emmener les propriétaires terriens vers l'économie numérique, une identité discréditée pour chacun d'entre eux. En théorie, la proposition correspondrait aux objectifs du défi, car elle générerait de nouveaux utilisateurs pour Atala Prism, je pense. Cependant, quelques doutes sont apparus à la fin de la lecture de cette proposition. Le premier est le suivant : quel est le public cible de ce projet ? Au début, le promoteur cite les personnes à faibles revenus, qui n'ont pas de droits fonciers. Mais au fil de la proposition, plus précisément sur le sujet \"démographique\", il précise que l'objectif est d'atteindre 10 000 propriétaires fonciers. Étaient-ils tous à faible revenu ? Étaient-ils tous originaires de Zambie ? Si le public est la population nécessiteuse, à qui seraient facturés les frais d'adhésion mentionnés dans le \"modèle commercial\" ? Après tout, laquelle des 3 façons serait abordée, la microfinance traditionnelle, DeFi ou GameFi ? A quoi ressembleraient les mêmes identifiants pour les propriétaires, comment connaîtraient-ils, comprendraient-ils et croiraient-ils à ceux proposés par l'identité décentralisée de Cardano ? Comment s'assurer que ces nouveaux utilisateurs resteraient dans le système ? Je crois qu'il y a confusion quant aux avantages que l'on peut voir ici, tant pour l'écosystème Cardano. Ce n'est pas une idée confuse, je suis confus sur cette proposition : ce n'est pas une idée confuse, un peu prudent sur la proposition de la plus petite estimation.", "q0r": 3, "q1": "L'équipe est sans aucun doute prête à exécuter le projet afin de donner du pouvoir et du contrôle aux propriétaires fonciers. Bien qu'il n'y ait pas beaucoup de détails dans la proposition elle-même, sur le site web ci-joint il y a un onglet écrit \"à propos de nous\", où nous pouvons avoir une connaissance plus approfondie de chacun des membres. Nous pouvons voir leurs photos, leurs noms et leurs rôles respectifs. Cependant, il n'est pas très clair qui a des connaissances liées à l'écosystème Cardano, qui travaillera directement avec Atala Prism ? Dans la proposition elle-même, dans la section des compétences requises, il y a le sujet suivant : \"connaissances pour le développement d'Atala Prism\". Cela signifie-t-il qu'ils reconnaissent cette lacune et qu'ils engageraient quelqu'un pour effectuer ce service ? Malheureusement, sans cette clarification, il est difficile d'avoir confiance à 100% dans la capacité de l'équipe à réaliser le projet, car une bonne partie (18k) du financement irait au développeur d'Atala Prism. En ce qui concerne le scénario, la détermination des phases est faite de manière très large, à mon avis. Certaines phases sont plus détaillées, tandis que d'autres (comme la dernière : \" 12-24 mois : début du déploiement pilote et déploiement progressif \") sont très désordonnées. Au cours de la période 1, ils mettraient en œuvre le pilote, mais que se passerait-il au cours de chaque semestre ? Quelles activations mineures seraient effectuées pour ce déploiement ? En ce qui concerne le financement, l'argent est divisé entre les salaires des professionnels. Il serait nécessaire qu'ils indiquent qui seraient ces personnes, car même si l'équipe est bien préparée pour faire face à ce type de projet, il n'est pas déterminé quelles personnes parmi les options présentes sur le site travailleraient ici. Je n'ai pas non plus compris, les 42k ne seraient suffisants que pour 3 mois de travail de ces professionnels alors que dans le script ils calculent ce qui se passerait jusqu'à 24 mois. Un financement supplémentaire serait-il demandé ?", "q1r": 3, "q2": "La proposition n'est pas si vérifiable, malheureusement. Les indicateurs clés de performance fournis sont assez superficiels et épars, et la feuille de route, comme je l'ai expliqué, manque de détails. Ainsi, nous disposons d'informations très basiques pour analyser à la fois les résultats et le développement de ce projet. Je suggère aux auteurs de reformuler cette partie de la proposition pour inclure plus d'informations qui pourraient servir à un suivi précis de l'ensemble. Comme, d'après ce que l'on peut déduire, le projet serait entièrement développé en Afrique, il serait intéressant qu'un résident local puisse suivre de près le développement des choses, et apporter ce suivi au reste de la communauté Cardano. En d'autres termes, mon opinion finale est que l'équipe rend même un peu de contenu disponible pour un audit futur, mais pas assez pour le faire avec la profondeur que je considère adéquate.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 21, "ne": 13, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": " It sounds like a great idea for the landowners. Everything that gives them their rights and decisions is empowering and necessary.\r\nIt will also ask honest people who want the best for the landowners and less for their own sake, although of course they also have to ask about the project.\r\n", "q0r": 4, "q1": "The proposal may still include how the users are informed and motivated for the project. Do they see an obvious added value and growth potential for their work, and how much time should they invest in this system? It's a very promising project, it will take time to get to the final product, but the submitter is working out all the parts well.", "q1r": 3, "q2": "The roadmap is available and transparent, perhaps the training for the user can also be included here. KPIs are briefly described and can be worked out even better, what have you achieved when you achieve success? How many people do you want to reach with your project?", "q2r": 4, "assessor": "z_assessor_667", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Utiliser les enregistrements fonciers basés sur le capital-risque pour amener les propriétaires fonciers à l'économie numérique.", "experience": "Mon équipe (et mon partenaire) ont répertorié plus de 10 000 parcelles de terre en Zambie. Nous pouvons rapidement intégrer les propriétaires fonciers dans le monde des SSI."}