{"id": 381642, "author": "pace", "title": "PACE: Community credentials 2", "url": "https://cardano.ideascale.com/a/dtd/381642-48088", "category": 26254, "amount": 18200, "description": "Il y a un manque d'accréditations centrées sur la communauté qui aident à l'adoption et à l'éducation d'Atala PRISM.", "funded": 2, "upvotes": 158968316, "downvotes": 2019465, "votes_result": 156948851, "votes_cast": 658, "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "On ne peut pas sous-estimer la valeur et l'échelle qui pourraient être fournies en adoptant DID et VC dans la communauté Catalyst.  La grande quantité d'informations que l'on rencontre lorsqu'on découvre le projet Catalyst dans la nature peut être écrasante, et depuis sa création, ce sont les membres de la communauté qui ont fait la différence entre être déconcerté et intimidé ou être responsabilisé et orienté.  L'ajout de DID et de VC à la communauté crée à la fois un élément de curation (quels CA donnent d'excellentes évaluations, quels mentors de proposition aident le plus de propositions à être financées, qui accueille les essaims les plus réguliers, ou est le plus actif au sein de la communauté ?) mais commence le processus d'implication directe de la communauté dans la technologie qui sous-tend une grande partie de la croissance qui attend Cardano.  Cette implication permet une meilleure compréhension, qui se traduit par de meilleures propositions, de meilleures évaluations et, en fin de compte, de meilleurs projets dans l'ensemble de l'écosystème.  Les objectifs finaux, qui incluent les portefeuilles DID de la communauté Catalyst et les systèmes de récompenses natifs, offrent un aperçu du type de systèmes que nous aimerions voir fonctionner sur Ada dans le monde entier.  Ils peuvent et doivent naître ici.", "q0r": 5, "q1": "L'équipe réunie pour cette proposition ne pourrait pas être mieux placée pour l'assumer : elle est composée de développeurs financés par deux initiatives (PACE et Gimbalabs) et fait partie du programme pionnier d'AtalaPRISM, un effort de collaboration pour rassembler les ressources, accélérer le développement et réduire le gaspillage parmi les développeurs actifs de PA.  Le budget envisagé présente des taux horaires raisonnables et un nombre d'heures raisonnable à réaliser.  Cependant, la feuille de route telle qu'elle est présentée pourrait être plus granulaire en ce qui concerne les mesures prises pour fournir les indicateurs clés de performance suggérés (titres de compétences émis/identifications uniques), comme le nombre de DID souhaités pour le groupe de test, et les évaluations qui déterminent le déploiement éventuel dans la communauté.  La livraison des outils précédents est un bon indicateur de la capacité d'exécution de cette équipe à fort coefficient de développement.", "q1r": 5, "q2": "L'équipe donne des détails complets concernant l'auditabilité, y compris les liens déjà existants vers leur github et l'avancement des projets qui y sont lancés. Ils maintiennent également une page Notions qui suit les développements hebdomadaires et ont suggéré d'enregistrer leurs réunions de développement et de les présenter au public (est-ce une menace ?).  La nature Opensource du projet ajoute un niveau de confiance supplémentaire, car toute bifurcation de code peut également être suivie, mesurant ainsi son impact sur l'écosystème global d'AtalaPRISM DID.  Si vous passez du temps dans l'écosystème des développeurs ou sur les canaux médiatiques de Catalyst, vous rencontrerez un ou plusieurs membres de l'équipe, qui sont amicaux, accessibles et très enthousiastes à propos de Cardano.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Yes! Hits the nail on the head solving the challenge! Provides huge value-addition to the Catalyst Community and fulfills the promise of Atala PRISM.", "q0r": 5, "q1": "Looking forward to see the PACE / Gimbalabs collaboration - both consisting of amazing individuals who are known as pillars of success in the community.\r\n\r\nThe plan is just amazing! I love the way how the deliverable is not decided by the team but there are use case options that the community can then choose from. Brilliant!", "q1r": 5, "q2": "The proposers have identified important issue(s) and created a clear solution to bring Atala PRISM to benefit the Catalyst community.\r\n\r\nSuperb ways to increase auditability and transparency. Well done!", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 24, "ne": 3, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. With the lack of community credentials the proposal identifies an important problem in the challenge that needs to be adressed. The solution seems beneficial to the Cardano ecosystem and to Project catalyst and the DID specifically. It is explained comprehensibly and matches the Key Metrics of the challenge well. Scalability should be provided considering the makeup of the system planned.", "q0r": 5, "q1": "Gimbalabs are well-known and networked in the community and the plan shows they are up for the challenge. The proposers know the type of partners required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every relevant detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics, KPIs and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 6, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Exercices d'apprentissage basés sur des projets communautaires pour une approche ascendante de la mise en œuvre, de l'apprentissage et de l'utilisation des références vérifiables.", "experience": "L'équipe PACE est financée par le fonds 6 Atala PRISM challenge, la communauté Gimbalabs pour l'apprentissage par projet et les contributeurs pionniers d'Atala PRISM."}