{"id": 381639, "author": "tiago", "title": "Pioneer Program Kick-Off In Person", "url": "https://cardano.ideascale.com/a/dtd/381639-48088", "category": 26254, "amount": 25000, "description": "Les communautés ont besoin d'interactions en face à face pour établir des relations solides, élaborer des plans et jeter les bases du succès.", "funded": 0, "upvotes": 15704372, "downvotes": 16158165, "votes_result": 453793, "votes_cast": 94, "f6_no_assessments": 4, "f6_rating": 3.2499999999999996, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal identifies the problem of people in the community to develop and grow trust in each other. They will ad value to the Cardano ecosystem by bringing funded projects and key contributors together to discuss and create synergies. Therefore boosting  innovation in Cardano. They haven't provided any clear metrics, so its hard to compare them to the Challenge setting's metrics. We can always assume these metrics, but it would be beneficial in the future to provide these metrics so that the voter can see what you are aiming for. The project will be able to scale if it proves to be a worthy affair.", "q0r": 4, "q1": "The relevant skills and team have been provided, but no links to prove it. Providing these links in the proposal will save the community the responsibility to do their own research and not just assume you are who you claim to be. The budget is reasonable and will be distributed evenly amongst all attendees. The time to launch this makes sense as it is at the end of Fund 7 when the results are known. They explain what the intention of this event is, but not much detail is provided on how it will be organized. Surely there will be other expenses to take into account like venue, food, equipment, staff. If you provide these details the voters will see how you approach this and could boost confidence in your abilities. They haven't considered any risks/challenges and how they will address them. Not being aware or prepared for future risks will slow you down when they surface.", "q1r": 3, "q2": "The roadmap is short and sweet and is basically broken down into organizing the meeting and hosting the meeting. No KPIs were provided, but they will de-brief after the meeting which in turn will provide some form of measuring success. They address the problem of needing a face to face interaction to establish trust and potential collaboration between funded projects. They solve this by organizing an event to bring them all together.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "This is a very good proposal as it aims to boost the development of solutions with Atala PRISM and Cardano, but also to build community and foster the creation of new synergies and links. The proposal could easily end up improving most if not all Fund 7 winning proposals through the person-to-person meet up - and could potentially lead to the development of new projects - or creating bridges between projects. The project is not just a gathering. It will provide new opportunities to the participants in the Pioneer Program kick-off. The proposing team - which includes IOG members - will ask IOG for matching funds to support the Kick-Off and to bring members of the Atala PRISM product, engineering, Professional Services, and Commercial organization to participate. Spot on. ", "q0r": 5, "q1": "The proposing team members include Tony: Head of Product, Atala PRISM at IOG and Lena: Community Researcher. The total (from the Catalyst component) budget of $25,000 will be divided equally between winning proposals to support one representative, per proposal travel and lodging expenses reimbursement... The funding will be used for the Fund 7 Winners Announce, organizing the 4-day kick-off meeting in Half Moon Bay, California, flights, accommodation and hosting the meeting. With the IOG support - the feasibility of implementation is not questionable. ", "q1r": 5, "q2": "This is a pretty straightforward proposal that will be easy to audit, as it involves travel to the Pioneer Program kick-off in Half Moon Bay, California in Mar/Apr 2022. The metrics and milestones are simple, straightforward and the time horizon for achievement has been set by in accordance with the requirements. What I think is missing in this proposal is a component that would produce a brief video or a report summarizing the event and the new links that were created among the Pioneer participants and between the participants and key customers and ecosystem partners who will be invited to participate as well. ", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 17, "ne": 4, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies a good approach: Providing a kickoff event for funded projects in the DID category. Bringing together the relevant actors might sure benefit the Cardano ecosystem if executed correctly. However this proposal does not seem planned properly. It is too brief and missing too many points.  The key metrics and goals of the challenge are not adressed explicitly, since the proposal itself does not have any key metrics. Also, scalability is not adressed. Feedback: Please formulate explicit metrics, make your proposal in general more detailed and adress things like scalability.", "q0r": 3, "q1": "Judging from their social media, at least one of the proposers seems to work for IOG in some capacity, so it seems he might bring certain competencies for the challenge. Other than that, they don't present any verifiable credentials. The proposers do not explicitly define the type and number of team members other than themselves they plan on using to implement the proposal, they only bring about a list of different areas fromwhich they want to invite people . \r\nThe budget is not broken down into identifiable items, but only summed up and said to cover expenses and prizes, thus it is difficult to assess whether itis reasonable to achieve the set goals.\r\nThe proposal does not offer more than a very brief timetable and roadmap and no implementation plan apart from that. The resources used are not described and no exact plan of what is going to be done on the meeting is presented either. No risk assessment has been done regarding general challenges. Feedback: Make a detailed implementation plan, link some verifiable personal information, and break down your budget.", "q1r": 2, "q2": "No metrics, KPIs or milestones besides the very coarse-grained timeline are presented. The problem statement and the solution however are clear. Feedback: Make some detailed, comprehensible metrics and KPIs to increase auditability.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 16, "ne": 6, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well.\r\nThe problem statement is clearly formulated and easy to understand. I think most people would agree it is true that face to face interaction helps build stronger relationships.\r\nThe solution, however, is not clear enough in my opinion. Reading it alone, a voter has no idea what would be kicked off and who the meeting is for. I think the solution should have sounded something like \"We propose having a 4-day event in California, where people from this challenge who get funded this round would meet to kick things off.\" It is very important that the problem statement and the solution be very clear and convincing, so that voters get gripped instantly.\r\nWhen having statements like \"Research has shown that…\", it would be very useful to have a reference to the mentioned paper or article. The part where members of IOG would be invited sounds exciting, but have these discussions been started? Having people miss a week of work is a big deal for a software company working at the rhythm IOG is working at. I do not know how I'd accomplish this, but before having this proposal, I feel like IOG's participation should already be agreed upon, or at least some confirmation of their willingness to do this should be shown here. The proposers also mention that key  customers and ecosystem partners would be invited to participate as well. It would again be useful to have some names here.\r\nI also think the proposal could have expanded more on what would be done in these 4 days (that's a lot of time, remember the Cardano summit was just 2 days long). At the moment, it sounds to me like people would network, but without any details on what \"coordinate support for the fund 7 winning projects\" means, it's not very clear to me what would be done at this event. Getting introduced to the Atala PRISM pioneer program sounds good, but again, this would require IOG to confirm their involvement and I would like to see better planning of what would be done every day. Due to my perceived lack of clarity in this plan and the lack of metrics for success, I disagree this proposal effectively addresses the challenge.", "q0r": 2, "q1": "Unfortunately, there is very little information at all about the team who would work on this proposal. If Tony is the head of Product for Atala PRISM, then he probably works for IOG. This is very valuable information which needs to be stated clearly, along with its significance for the proposal. Aside from this, more details on who Lena is would have helped as well. A LinkedIn page or any type of credentials have become a standard of every good Project catalyst proposal. \r\nAnother important aspect that is missing is that of risk analysis. These being unstable times, it is not unlikely that new lockdowns or travel restrictions could be imposed next spring. The proposers should be aware of this and they should present their approach to dealing with any such potential risks, so as to show they are planning this properly. Next, the budget should have been broken down into separate components (for example: an estimation of attendees, cost of transport and accommodations per person, cost of renting the meet-up space, cost of food and beverages etc). I would also have wanted to hear a detailed analysis of what is feasible here. We will quite likely have upwards of 20 funded proposals, many with teams outside of the USA. Is it realistic to expect to be able to cover the costs for people coming in from Asia or Africa? If not, then maybe a certain reimbursement amount should have been considered.\r\nDue to the missing information above, I do not feel very confident that this proposal will be implemented successfully.", "q1r": 2, "q2": "While there is a timeline here, it is very sparse in my opinion. I mostly feel like we should have been able to see an agenda proposal for this event and the possible outcomes of it. That would have also helped the proposers add some KPI's here, which are currently missing. As a result, I do not feel this proposal is either clear or auditable, in its current form.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 19, "ne": 9, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Une réunion de lancement de 4 jours à Half Moon Bay, en Californie, pour se connecter, discuter et créer des synergies.", "experience": "Lena : Chercheur communautaire\nTony : Chef de produit, Atala PRISM"}