{"id": 381953, "author": "rodolfo.miranda", "title": "Hyperledger-Prism Interoperability", "url": "https://cardano.ideascale.com/a/dtd/381953-48088", "category": 26254, "amount": 30000, "description": "Comment Atala Prism peut-il échanger des informations d'identification avec Hyperledger Indy, où résident la plupart des informations d'identification ?", "funded": 2, "upvotes": 119806113, "downvotes": 2515121, "votes_result": 117290992, "votes_cast": 426, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "Wow, quelle proposition bien écrite. Cela en dit long sur le proposant, sa vision et sa capacité à conceptualiser le problème et la solution. En parlant de l'énoncé du problème - bang ! Cette proposition vise directement l'interopérabilité avec Hyperledger Indy afin d'ouvrir des portes pour l'expansion du réseau Cardano en termes d'interaction avec l'écosystème Hyperledger Indy. Ce défi demande aux proposants de réfléchir à la manière dont Atala Prism peut échanger des informations d'identification avec Hyperledger Indy (en raison de son importance en termes d'utilisation des informations d'identification) - et le proposant fournit une solution qui fournira un code open-source pour donner à Atala Prism deux couches d'interopérabilité avec ce cadre. En termes d'impact, c'est très bien. En termes de vision de la mise en œuvre de la proposition - encore mieux. Le plan est détaillé, la solution semble parfaite, les mesures clés de la proposition s'alignent sur les paramètres du défi décrit. Je suis un CA et un vCA depuis le début de Catalyst et je n'ai jamais hésité à donner mes 5 centimes dans un cycle de financement. Cette proposition est l'une des mieux rédigées et ses résultats (la couche de communication DIDComm v1 et le mécanisme de mappage pour convertir les informations d'identification vérifiables dans les deux sens) sont bien définis et permettront l'échange d'informations d'identification entre Atala Prism et Hyperledger Indy, tout en restant flexibles pour les utilisateurs.", "q0r": 5, "q1": "En termes de faisabilité, ce proposant ne laisse rien à l'imagination. Je veux dire que les compétences sont là et documentées, l'expérience est là et documentée, le budget est raisonnable et décomposé en éléments, un calendrier de mise en œuvre des solutions proposées est donné. Le proposant entre dans les détails pour clarifier les aspects techniques de sa proposition et le fait de façon remarquable. Je commente en particulier le fait que le proposant ait procédé à une évaluation des risques et l'ait rendue publique. L'auteur déclare qu'au cours de l'élaboration de cette proposition, deux préoccupations/risques (1. le temps alloué au développement est-il suffisant ? et 2. le défi technologique peut-il être relevé ?) ont été identifiés et des plans d'atténuation ont été élaborés en cas de besoin. En dehors de ces deux risques, j'en vois un troisième : la proposition pourrait passer sous le radar et ne pas être financée. Bon, la légèreté mise à part, c'est une proposition cinq étoiles.\r\n", "q1r": 5, "q2": "Audit et clarté. Les \"jumeaux de la transparence\". Cette proposition leur plaira-t-elle ? Le proposant suggère d'utiliser la gestion agile basée sur les outils Jira Cloud pour la mise en œuvre, et il déclare qu'en outre, un rapport bihebdomadaire sera publié avec l'avancement du projet, les principales étapes et l'évaluation des risques. Risque pour la communauté - abordé. L'équipe propose que \"comme un engagement à la transparence des fonds alloués, nous attendons des paiements basés sur les livrables ci-dessus sans la nécessité de paiements anticipés.\" De plus, les progrès intermédiaires seront rapportés sous forme de Sprint Burndown, une mesure KPI qui montre les progrès de chaque sprint de développement. De plus, le développement sera géré dans un dépôt github public où des commits périodiques seront poussés et qui permettront à la communauté de vérifier et de valider le travail. OK, je n'ai rien à ajouter. Les jumeaux de la transparence adorent ça.\r\n", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identify the problem of Atala Prism adoption and interoperability. They will ad value to the Cardano ecosystem by making Atala Prism interoperable with Hyperledger Indy which in turn will connect Atala and Cardano to an already huge existing working product. The metrics of the proposal is aligned with the challenge in the sense of onboarding more people to build on Atala Prism. This project is able to scale well, because it will be open source.", "q0r": 5, "q1": "The relevant experience is provided via LinkedIn page. The budget is broken down into 2 parts of the project that needs to be finished with reasonable time dedicated to each part. He explains in detail how the product will be interoperable with Hyperledger and even goes into some technical details explaining how different parts of the product will function. He considered risks and provided ways to mitigate them. ", "q1r": 5, "q2": "Th roadmap provided is split into  2 items that needs to  be built. Each one with their own timeslot.  Tracking the progress of this project will be easy as he states he will provide weekly reports. There is no user based KPIs so it will be hard to track the performance of this project. You can ad Github downloads as a KPI, that way people can see if your product  is being used. He identifies the problem of Atala Prism needing adoption and interoperability with existing products and solves this by providing open-source code to give Atala Prism two layers of interoperability with Hyperledger Indy. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 3, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "Hyperledger Indy's importance is outlined in the proposer's problem statement. It is the work of the the Linux Foundation and as such has proven history of quality open development. Bring interoperability between Hyperledger Indy and Atala Prism is the goal and the problem this proposal is looking to solve.\r\n\r\nThe project, if successful, will certainly help Accelerate Decentralized Identity by offering the opportunity to communicate with existing Hyperledger interactivity deployed on Sovrin, a well established service allowing used by companies and government departments.\r\n\r\nThey propose to bring a layer 1 solution by offering communication by porting the existing open source tool Hyperledger Aries into an Atala Prism Agent.\r\n\r\nThey are further offering a Layer 2 solution in the form of two way communication that will map credentials on the two platforms, Atala Prism and Hyperledger Aries.\r\n\r\nAll development will be open source allowing others to build on and further develop the solutions. \r\n\r\n", "q0r": 5, "q1": "The proposer clearly has deep knowledge and the skills required to execute this project. They have indicated that additional developmental resource can be included if required. A more detailed split of the budget would be helpful, it is given as estimate $10k per month and three months of work. The developer knows his costs and as it's a personal project is able to budget the time and cost effectively.\r\n\r\nTechnical details have been provided with reference to the existing technologies that the project plans to connect with. Potential risks have been identified.\r\n", "q1r": 4, "q2": "Github will be used as a repository so interested parties will be able to track and inspect commits through out the development of this project. Further, Jira Cloud tools will be used and an Agile workflow tracked using this tool. Although a the details have not been broken down the use of Sprint Burndowns is a well known development process and able to be easily tracked once the project starts.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_209", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Fournir à Atala Prism deux couches d'interopérabilité avec Hyperledger Aries : le protocole de communication DIDComm et le mappage des justificatifs d'identité.", "experience": "De solides connaissances universitaires et plus de 25 ans d'expérience avérée dans l'architecture et le développement de solutions logicielles. Développé sidetree-cardano dans le fonds 6"}