{"id": 382078, "author": "megrimlance", "title": "Open Source Credential Wallet", "url": "https://cardano.ideascale.com/a/dtd/382078-48088", "category": 26254, "amount": 39000, "description": "Il n'y a pas de portefeuille d'identité Atala Prism disponible pour stocker et utiliser des justificatifs vérifiables.", "funded": 2, "upvotes": 135993505, "downvotes": 2692183, "votes_result": 133301322, "votes_cast": 593, "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=22010"], "media": [], "f6_assessments": [{"q0": "Il s'agit d'une proposition qui a identifié une niche (importante d'ailleurs) et qui propose une excellente solution open source. La création d'un portefeuille d'identité open source opérationnel avec les identifiants décentralisés Atala Prism et les informations d'identification vérifiables serait un moyen extraordinaire d'accélérer l'identité décentralisée sur la blockchain Cardano. Le fait que l'équipe comprenne quatre membres de la première cohorte du programme Atala Prism Pioneer rend la chose encore meilleure. Que préparent les pionniers du programme Atala Prism, sinon des projets communautaires comme celui-ci ? L'équipe a bien fait de mettre en valeur les mots OPEN SOURCE dans la solution qu'elle propose. C'est une contribution essentielle qui rendra l'impact encore plus grand. Dans un premier temps, l'équipe va créer un cadre modulaire avec les éléments de base d'un portefeuille d'identité pour les utilisateurs individuels. Ce qui veut dire que n'importe qui pourra le construire et l'exécuter sur un appareil mobile. J'apprécie particulièrement le fait qu'ils envisagent déjà de mettre à jour leur plan de développement afin d'obtenir de futurs fonds.\r\n", "q0r": 5, "q1": "Bravo pour la présentation des compétences, de l'expérience et du savoir-faire technique. Si vous aimez connaître votre équipe de développeurs, c'est ainsi qu'il faut le présenter. Je n'entrerai pas dans les détails, mais comme ils le disent eux-mêmes, ils ont un total cumulé de 100 ans d'expérience en développement de logiciels. La ventilation du budget comprend également des estimations de la vélocité des développeurs (pic et moyenne), ainsi qu'un taux de développement pour le budget et une ventilation précise en 7 composants (de la conception de l'architecture au test global et au débogage). Oui, le budget est clairement décrit et ventilé en éléments identifiables et semble approprié. Les références de l'équipe semblent être irréprochables pour un projet de cette envergure, il y a un total de 390 heures de travail évoquées avec une durée totale de 13 semaines. Le projet est non seulement raisonnable, mais l'équipe assurera la transparence des opérations pendant la mise en œuvre grâce à la composante intégrée de suivi du projet. C'est un feu vert de ma part.", "q1r": 5, "q2": "C'est vraiment un plaisir d'examiner des propositions qui sont capables de faire un zoom arrière et de fournir aux personnes extérieures - non seulement un moyen de comprendre ce que l'équipe vise à réaliser, mais aussi de vérifier ce qu'elle s'est fixée comme objectif. Cette équipe a fait un travail énorme - penser, écrire, contacter d'autres équipes et distiller sa vision pour assurer une clarté maximale sur les détails et sur la contribution globale. Le portefeuille d'identité open source proposé n'est pas seulement un \"portefeuille\". L'équipe a expliqué les fonctionnalités prévues et ce que la conception va supporter : Caractéristiques du portefeuille d'identité personnalisables et extensibles, caractéristiques de confidentialité et de sécurité, caractéristiques de l'interface utilisateur et de la convivialité. L'équipe a énuméré les partenaires avec lesquels elle s'est associée pour que la solution de portefeuille puisse servir leurs communautés, leurs clients et leurs développeurs. Elle a inclus une évaluation des risques et, en termes de clarté et d'auditabilité, des indicateurs clés de performance ont été fournis. En outre, des utilisateurs Jira peuvent être créés pour le suivi et la capacité d'audit. En outre, des rapports bihebdomadaires seront publiés avec l'avancement du projet, les principaux jalons et l'évaluation des risques. Les progrès intermédiaires seront rapportés sous forme de Sprint Burndown, un indicateur clé de performance qui montre la progression de chaque sprint de développement. En outre, le développement sera géré dans un dépôt Github public où des commits périodiques seront poussés et qui permettront à la communauté de vérifier et de valider le travail. Ce que je peux dire. Wow.\r\n", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Your idea proposal was interesting to read. Thank you for sharing. To make this proposal more relevant to the Cardano community, please consider the following suggestions: I suggest changing the idea description because it is essentially not clear and adds too much value to readers who are attempting to grasp its scope and purpose. It is not meant to be taken the wrong way, but clarifying the applicable use cases or giving more practical examples of what is the main value of an open-source credential wallet to different industries or to the overall Cardano community will be beneficial. Some ideas get into the execution phase if are more concentrated on adding value and value streams. Overall the idea is very good and the level of details shared was extremely positive and that's why the score will be high. Well done!\r\n", "q0r": 5, "q1": "This proposal will be implemented successfully based on the experience and plans of the proposing team, though I suggest more information be included within the proposal regarding the relevant experience of the proposer in managing initiatives of this nature, as well as a more detailed plan and budget for the different tasks and activities described.", "q1r": 4, "q2": "This proposal has value, and its implementation would have great benefits. If an open-source identity wallet that operates with Atala and verifiable credentials improves over time, more thought might need to be given to verifying ROI. I understand we need to work with these changes but also identify the life cycle of each technology implementation and the returns. In 5 years there may be a better deal in terms of power and performance than the current one. For the community to be educated about the use of funds in a sustainable, reasonable, and practical manner, both the advantages and disadvantages may need to be stated more clearly. But overall congratulations and well done with the idea proposed.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 18, "ne": 5, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal creates an open source identity wallet, which interoperates with Atala PRISM and Verifiable Credentials.  While the campaign brief doesn't mention wallets or open source directly, it does mention key success metrics of production pilots and launches in 2022 and number of verifications performed.  The problem (a needed tool for DID development, the identity wallet) has a clear solution, to create the wallet.  If funded and completed, it will improve the metrics in the challenge.", "q0r": 5, "q1": "The team reads like a world championship of cardano DID. They have credentials and skills and present themselves professionally. The proposal is very clear, detailed and written for non-technical people to understand - while not leaving out the technical details.  The budget is clear and reasonable with a realistic timetable.  One highlight is the partnerships with the other DID proposers who would benefit from the open source wallet created.", "q1r": 5, "q2": "The team will follow an industry standard management system for software development, Agile, which includes reporting progress, milestones and risk assessments.  This is a textbook 5 star proposal in my opinion. Godspeed, friends!", "q2r": 5, "assessor": "z_assessor_56", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "In order to be useful and accessible, the Verified Credentials issued using the Atala PRISM technology need to be stored, displayed, and verified using a wallet. This proposal therefore fills an important gap by outlining the creation of a wallet. All developers seeking to build solutions using PRISM technology would benefit from the implementation of this proposal. Furthermore, by ensuring that the code is open source, many others with complementary projects would benefit from the project as well. Providing open-source code also allows the project to scale even more easily. ", "q0r": 5, "q1": "The team clearly has extensive experience both in development and in the Cardano ecosystem. The fact that the team has a cumulative 100 years of software development experience is both impressive and easy for the reviewer to understand. In general, I commend the team for the very clear way this proposal was structured and written.  Additionally, the team has done a lot of groundwork to partner with other proposers in the challenge, who would clearly benefit from (and in fact require) this wallet in order for their projects to success.  The team has also had significant success with having past proposals funded, and experience developing large-scale collaborations with IOG. It is also highly relevant that the entire team has participated in the Atala PRISM pioneer program. The plan and budget seem well-thought out and reasonable. ", "q1r": 5, "q2": "The team provides a good outline for auditability metrics. They will use Sprint Burndown which will allow KPI-tracking for each development Sprint. Managing the development in a public Github repository also facilitates auditing. The team acknowledges the risk that the SDK is not yet public or final, and seems to have mitigated that risk appropriately through ongoing communications with the PRISM team.  The Roadmap (described as the Project Plan) is clear and the team has a clear and compelling vision for tying future phases of the project to the next Catalyst funding rounds. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 16, "ne": 8, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Great initiative and approach to go for \"The code will be open-source, and anyone will be able to build and run it on a mobile device.\" Cardano and wallet development community would re-cycle your team's open-source codes and packages output. ", "q0r": 5, "q1": "With your \"Planed functionalities\\Privacy / Security Features\", it would be great if your team could add on one crucial security feature, whereas in a scenario if the smartphone-like device (phone/tablet or any device with SIM or E-SIM cards) being cloned or hacked, the wallet owner should be alert and disable or any type of hand-break to be activated to project any process requires DID's authorisation/authentication.", "q1r": 5, "q2": "I believe in your team to deliver the project and possibly release the code design or detail comments of the code design along with the actual code, so any Cardano Atala PRISM enthusiastic developers make an accelerated start to drive on fast-paced cryptocurrency. This would be a massive credit to your four team members contribution.   ", "q2r": 5, "assessor": "z_assessor_726", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The proposers wants to develop an Open Source identity wallet that operates with Atala Prism identity wallet available to store and operate with verifiable credentials. This falls within the Challenge Brief, to achieve full interoperability. This proposal will have a positive impact on the Cardano/Catalyst ecosystem.\r\n\r\n", "q0r": 5, "q1": "The team's credentials are given, and explained. There is also links to their LinkedIn Accounts. They have extensive experience and will add great skills to the project. The Budget is set out and worked at an 100 USD/Hr rate. This seems reasonable. The proposer will need additional funding and will make use of future funds. They have a project plan set out with all the activities that needs attention and states that it will be over a period of 13 weeks. The resources and skills needed are discussed, and they have done a risk assessment.", "q1r": 4, "q2": "The proposers will submit a bi-weekly report that will be published with project progress, major milestones and risk assessment.\r\nProgress and success is measured when the wallet is complete.\r\nDevelopment will be managed in a public Github, that will allow the community to audit and validate progress. KPI's have also been listed and can also be used to track progress.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "Nous allons construire un portefeuille d'identité Open Source qui fonctionne avec les identifiants décentralisés et les justificatifs vérifiables d'Atala Prism.", "experience": "L'équipe est composée de quatre membres de la première cohorte du programme Atala Prism Pioneer ayant une solide expérience du développement de logiciels."}