{"id": 382697, "author": "tefera", "title": "Port BrightID", "url": "https://cardano.ideascale.com/a/dtd/382697-48088", "category": 26254, "amount": 9000, "description": "Malgré la promesse d'une identité autonome, la plupart des mises en œuvre dépendent d'une vérification centralisée et ne sont pas conviviales.", "funded": 0, "upvotes": 15406791, "downvotes": 13080562, "votes_result": 2326229, "votes_cast": 96, "f6_no_assessments": 4, "f6_rating": 2.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "L'idée de cette proposition est un peu confuse... mais si je comprends bien, elle se résume à ajouter Atala Prism à un système de reconnaissance décentralisé existant appelé BrightID. Ce système est basé sur une reconnaissance familière, qui analyse l'interaction des utilisateurs en ligne et hors ligne. Comment cela est-il possible ? J'aimerais que les promoteurs définissent mieux le fonctionnement de cet outil et en des termes compréhensibles pour tous les lecteurs. Le système BrightID est censé être basé sur Etherioum (s'agit-il d'une crypto-monnaie transformée en Ethereum ?). Une chose qui m'inquiète un peu ici est la suivante : \"la seule chose nécessaire pour authentifier l'unicité d'une personne est une image et un nom qui peuvent être modifiés à tout moment\". Comment ce système garantit-il l'inviolabilité de vos informations, puisqu'il est si simple de définir l'identité de ses utilisateurs ? Je pense également ne pas être très clair sur la manière dont se ferait cette jonction entre BrightID et DID. Les personnes utilisant BrightID se verraient-elles automatiquement générer des DID ? Il ne peut s'agir d'un processus involontaire, n'est-ce pas ? Comment cette adoption se ferait-elle, comment expliquer ce qu'est Atala Prism, comment convaincre ces personnes des avantages d'avoir une identité décentralisée également dans Cardano, puisqu'elles en auraient déjà une autre ? Les auteurs de la proposition justifient que cette solution serait intéressante pour les cas où les populations ont subi des catastrophes (générées par des causes naturelles ou humaines). Mais pourquoi, exactement ? Les auteurs présentent un de ces exemples (https://cardano.ideascale.com/a/dtd/Decentralized-Autonomous-Iddir/381135-48088), ce qui est très positif, mais même en lisant cette proposition, je ne comprends pas comment cette nouvelle fonctionnalité BrightID + Atala Prism serait utilisée. En général : plusieurs doutes ont surgi lorsque j'ai lu la proposition, je ne pense pas qu'il ait été possible de comprendre pleinement son impact sur l'écosystème Cardano. Cependant, je pense que oui, cela pourrait être quelque chose de très intéressant et qui s'alignerait bien avec les objectifs du défi si la proposition était décrite de manière plus simple et en répondant aux doutes que j'ai signalés ici (peut-être que d'autres AC ont d'autres questions ou même les mêmes).", "q0r": 2, "q1": "Peu de choses sont dites sur l'équipe qui compose ce projet. Il y a 3 auteurs, mais les informations mentionnées dans \"expérience pertinente\" me semblent ne parler que d'une seule personne... J'aimerais savoir ce qu'est l'ITN (dans \"Run ITN\"). Je pense que cette proposition manque d'une présentation plus adéquate des membres, comprenant : leurs noms, ce qu'ils ont fait jusqu'à présent, leurs domaines de formation académique et de performance professionnelle et surtout comment ils se rapportent à l'écosystème Cardano et à Atala Prism. L'équipe qui a proposé cette idée est la même que celle qui a développé la plateforme BrightID, n'est-ce pas ? Cela nous donne une certaine sécurité quant à la capacité de leur travail, mais ne nous garantit en aucun cas, malheureusement, qu'ils ont des connaissances et de l'expérience dans Cardano et qu'ils comprennent bien Atala Prism. Par conséquent, je ne pense pas qu'une grande confiance soit accordée à l'équipe pour exécuter correctement la proposition. A propos d'une feuille de route, elle n'existe pas ici, malheureusement, les auteurs ont été négligents et n'ont à aucun moment expliqué quelles activités seraient développées afin d'atteindre le résultat final (l'intégration entre leur plateforme et Atala Prism). Il est essentiel d'avoir une chronologie des activités pour comprendre le processus de développement, qui ferait quoi et ainsi de suite. Et pour ce qui est du financement, tout est orienté vers la rémunération des professionnels impliqués, à un coût de 30 USD par heure (un montant très juste, à mon avis). Est-il possible de comprendre partiellement où va l'argent, puisqu'il n'est pas défini combien d'heures chaque professionnel travaillerait (ce serait 100 heures pour chacun, puisqu'il y a 3 personnes) ? Quand ils disent que la valeur changerait avec l'apport des développeurs, pourquoi, et de combien serait-elle ? Je pense que nous avons encore un certain nombre de questions ouvertes sur la façon dont l'argent serait utilisé, c'est-à-dire qu'il est nécessaire de donner une explication plus détaillée à ce sujet. Malheureusement, donc, tant en termes de personnel que de scénario et de budget, le projet est superficiel et nécessite beaucoup d'améliorations.", "q1r": 2, "q2": "Malheureusement, c'est la partie la plus incomplète de la proposition. Les auteurs passent la plupart de leur temps à décrire ce qu'est BrightID, mais ils n'établissent pas de feuille de route, comme je l'ai mentionné dans le sujet précédent, et ils ne définissent pas non plus d'indicateurs clés de performance. Ainsi, aucune information n'est fournie sur la façon dont nous pourrions suivre le processus de développement de ce projet ; de plus, avec l'absence de KPI, rien n'est défini qui puisse être suivi en tant que résultats partiels/finaux. Sans ces informations, la proposition n'est pas vérifiable. Je suggère que les auteurs développent ces deux éléments (une feuille de route détaillée et des KPI) et, à partir de là, établissent un contact direct et fréquent avec la communauté Cardano, afin qu'il soit possible de vérifier si ce qui a été promis se réalise. Je pense qu'il serait également intéressant de réaliser une enquête auprès des utilisateurs. Ceux qui utilisent déjà la plateforme BrightID ont-ils réalisé leurs DID dans Atala Prism, et si oui, qu'en avez-vous pensé ? Leurs attentes ont-elles été satisfaites, ont-ils été intéressés par notre blockchain au point de s'impliquer dans d'autres activités de l'écosystème ? Il ne s'agit que d'une suggestion qualitative. En outre, vous devez définir des chiffres : combien de personnes ont acquis des DID, comment ce nombre augmente, en fonction du temps qui passe, etc etc.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 23, "ne": 13, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of depending on centralized entities to create identity for oneself. Porting BrightID with the Cardano ecosystem will ad value by bringing a lot of new identities to the ecosystem. They haven't provided any metrics so it's hard to see if they align with the Challenge. The metrics for this kind of project is not hard to imagine and they may very well be much aligned with the challenge. In order to win the trust of voters you need to provide all the info that is expected of you. This kind of project will be able to scale well as identity is an absolute must going forward. ", "q0r": 4, "q1": "No proof of relevant skills or team is given. The voters need to know your background and abilities in order to trust you with this project. The budget is still unclear as they  mention it will change with input from developers. Right now it only states 300 hours of work needs to be compensated. No launch date has been provided. A Launch date is essential, because it shows commitment and aim. They have explained how BrightID works, but not how they will port it. No technical details are provided. This info is needed to show voters how you  plan to approach this problem. It also reveals your technical abilities and can boost voter trust. They haven't considered any risks. Not being aware and prepared for future risks will slow you down.", "q1r": 1, "q2": "No roadmap with milestones or KPIs have been provided. Without this info it is very hard to track the progress and performance of this project. You have to show how you plan to execute this project on a timetable and provide KPIs so that the community can track your project. They identify the problem of going through centralized entities to create identity for oneself and they plan to solve it by porting an existing product to the Cardano blockchain. The way it will be ported is still very unclear.", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 21, "ne": 10, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This is a nice and possible solution because BrightID is already based on Etherium and has proven its success. So porting this tool to Cardano not only would complement Atala Prism and accelerate mass decentralized identity (DID) adoption but also promises to be successful.", "q0r": 5, "q1": "The relavant experience is poor demontrated (there is no attachment to prove or no more demonstrate than just listing). There is also no detail plan that what he/she will do (in phases/milestones).", "q1r": 1, "q2": "We can see if they complete porting BrightID to Cardano or not but the proposal still need to have key metrics/ KPIs to measure the expected outcome.", "q2r": 2, "assessor": "z_assessor_809", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "While BrightID might look like a promising start in the DID process, I find their concept raises too many questions that I haven’t been able to find the answers to, neither on their website nor on their other social platforms. Building a DID technology based on a zoom conference meeting and selection of connections is very intrusive and inefficient.\nPorting successful platforms from ETH to speed up the development of ATALA Prism and DID on Cardano is a very good idea if well implemented, though I’m not sure if this one is suitable and no other better tool will come along in the near future.", "q0r": 3, "q1": "The proposers have not provided any external links or description of their prior experience and skills, so it’s hard to assess their capabilities in implementing this proposal, especially since they write “This will change with input from developers” meaning they are not the ones developing the port.\nThe plan lacks many details, it contains a lot of copy-pasted information from the BrightID website, but not much about the process of porting it from ETH to Cardano.", "q1r": 2, "q2": "As I have stated in the above assessments, the proposal lacks a lot of information, like an estimated launch date, a roadmap, KPIs and all the other items from the self-assessment checklist, that are not needed to be listed here again. Without these, the community cannot properly evaluate the process and success of the project.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 22, "ne": 3, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "BrightID permet aux individus de prouver leur unicité grâce à leurs connexions sociales, à commencer par leur famille, sans avoir besoin d'un service centralisé.", "experience": "Initiateur, coordinateur et traducteur de la localisation Opensource. Organisateur communautaire. Run ITN, membre de Catalyst depuis Fund1, CA, vCA"}