{"id": 383039, "author": "nathan.bogale", "title": "Agricultural Marketplace + Atala", "url": "https://cardano.ideascale.com/a/dtd/383039-48088", "category": 26254, "amount": 80000, "description": "Ironiquement, dans le secteur de l'agriculture, estimé à 8 milliards de dollars par an, les agriculteurs ne décident pas du prix de leurs récoltes lorsqu'elles sont vendues.", "funded": 0, "upvotes": 21094227, "downvotes": 12290195, "votes_result": 8804032, "votes_cast": 124, "f6_no_assessments": 7, "f6_rating": 3.4761904761904767, "videos": [], "media": [], "f6_assessments": [{"q0": "Oui, cette proposition relève efficacement le défi et, si elle est acceptée, elle aura un impact considérable sur les agriculteurs des pays en développement et sur l'écosystème Cardano. L'auteur de la proposition fait un excellent travail en exposant le problème (les intermédiaires manipulent et faussent les marchés au détriment des agriculteurs) et la solution qu'il propose (système d'achat/vente en P2P) qui élimine essentiellement le problème. J'aurais aimé voir des indications de la part des proposants sur l'endroit exact où ils prévoient de lancer leur initiative, mais en se concentrant sur les \"pays sub-sahariens\", l'impact sera probablement grand, quoi qu'il en soit. En apportant également la preuve que les agriculteurs se regroupent pour lutter contre ce problème, le proposant justifie davantage l'adoption probable de cette solution par la population cible. L'absence de soutien gouvernemental direct suscite une légère inquiétude, mais je respecte l'approche \"construisez-le et ils viendront\" des proposants, et les inquiétudes sont quelque peu atténuées par les avantages attendus pour les agriculteurs eux-mêmes grâce à l'application. L'intégration d'Atala Prism dans un tel programme est une excellente idée afin de fournir un niveau de sécurité et de transparence, et les heures supplémentaires deviendront compatibles avec d'autres projets et produits liés à Prism.", "q0r": 5, "q1": "Oui, étant donné l'expérience et le plan présenté, il est très probable que cette proposition soit mise en œuvre avec succès. Le proposant démontre très bien le problème et offre une solution solide qui remet le pouvoir entre les mains de l'individu, fidèle à la forme de Cardano. J'apprécie le lien vers le compte Github de l'auteur de la proposition afin que les électeurs intéressés puissent accéder au dépôt de code et confirmer la capacité de l'auteur de la proposition à tenir ses promesses. D'après un premier examen, le proposant est très compétent. Le plan tel qu'il est présenté est très bon et il est évident que le proposant a une bonne compréhension des hypothèses, des contraintes et des risques auxquels le projet est confronté, et qu'il a un plan préliminaire pour y faire face. La feuille de route et le calendrier sont bien présentés et la ventilation en phases distinctes (y compris les demandes de budget pour chaque phase) peut donner aux électeurs l'assurance supplémentaire que le proposant a réfléchi aux étapes nécessaires pour atteindre son objectif. La raison pour laquelle j'attribue un 4/5 et non un 5 est qu'une hypothèse majeure qui n'est pas abordée est l'acceptation par les gouvernements d'adopter cette solution en cas de succès. Il est dit que les gouvernements seront intégrés dans la phase 1, mais la manière dont cela sera fait n'est pas claire. Y a-t-il déjà des pistes dans certains gouvernements que vous avez identifiés ? Avez-vous reçu un soutien de principe ? Quelle est l'éventualité s'ils ne l'acceptent pas et se rangent du côté des courtiers ? Bien que je ne suggère pas que ces questions n'aient pas été prises en compte, les votants prendraient un certain risque et exigeraient probablement des réponses avant d'attribuer des notes complètes.", "q1r": 4, "q2": "Oui, les informations fournies sont suffisantes pour vérifier l'avancement et le succès de la proposition. Le proposant fait un excellent travail en expliquant clairement aux électeurs ce qu'ils peuvent attendre de l'argent, s'il est financé. La description détaillée du problème, la solution innovante et les grandes lignes de la manière de la réaliser sont faciles à suivre et claires. La ventilation du budget évite aux électeurs de se perdre en conjectures, car ils peuvent voir quelles activités et quels résultats attendus nécessitent quelles ressources. J'aurais aimé voir des indicateurs clés de performance plus explicites pour que les électeurs sachent comment le succès du projet sera mesuré. La réussite du projet consiste-t-elle à le mener à bien ou à obtenir l'adhésion d'un nombre x d'agriculteurs ? Ou un nombre y de juridictions intégrées ? Ces types de détails sont importants pour que les électeurs sachent quand le succès peut être considéré comme atteint. Dans l'ensemble, un excellent travail.", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement and solution describe a marketplace, I would like the team to rework the problem statement and solution to show how Atala Prism is used to accelerate DID. ", "q0r": 2, "q1": "The team gave work experience of the lead team member, it would be good to see details about the other team members. Furthermore, it will be good if the proposal expanded on the go to market strategy to acquire customers for the marketplace. Lastly, I would like the proposal to expand on the backend tie in with cardano ", "q1r": 2, "q2": "The project has a high level roadmap with milestones. i would like if the team developed the roadmap further by adding KPIs (sign 15 farmers by month 3, sign up 60 farmers by month 6, etc) to the milestones, in this way you can track performance over time. I would like the team to further breakdown the budget, at the moment the budget is a high level 3 line item. As the project stands at the moment I believe it will be challenging to audit the proposal.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 0, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "Great and brilliant idea by the proposer. This proposal addressess the challenge and has the potential of bringing value to the cardano ecosystem. It will really be exciting to see the execution of this project where power is given back to the farmer to be able to directly deal with the consumers", "q0r": 5, "q1": "The proposer possess the required experience to execute the project. However the proposer failed to provide the details of team members who will help in the execution of the project when funded this i think doesn't make the proposal complete. Furthermore the budget looks a bit high and not broken down into sub components. This i think is not enough to help assessors make or pass a conclusive judgement.", "q1r": 2, "q2": "Great job done by the proposer by providing a roadmap for project execution, he has also clearly stated the risk associated with the project but has not provided a measure to address the risk. Key deliverables are also captured in the proposal which makes it possible to track the progress and success of the  project.", "q2r": 3, "assessor": "z_assessor_420", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "The use of Atala Prism and DIDs to connect farmers and merchants is a good idea, and fits within the scope of this category. The general idea is clear, but more information on the technological side would greatly enhance the quality of this proposal. For example, what organism would issue the identification and how would the DIDs be managed, and by whom ? Does it involve a DAO ? Will there be a pilot program to try and gauge the farmers' willingness to participate ? Answering some of these questions would better position this project in the Accelerate Decentralized Identity category.", "q0r": 4, "q1": "The scope of this project is big enough, but there is too little information about the team that will be executing the necessary steps. The requested funds are not small, and the expertise needed is vast. Including information about team members and how will the different components of this projects be distributed would add a lot of value to this proposal. There seems to be a lot of ideas but few technical descriptions to aspire confidence, detailing the execution steps would make this proposal more appealing. The idea is great, it just lacks some important details. If the proposal can fix these, they would have much higher chances of attracting voters.", "q1r": 3, "q2": "This proposal contains a roadmap that describes the general evolution of the project, but it is too broad. Having clear goals and metrics for evaluating progress would make it easier for the community to follow it. For example, specifying the number of farmers who would be participating or simply contacted would help a little. The proposer could also detail the steps for DID generation and what progress looks like with regard to the establishment and development of a DID framework for farmers.", "q2r": 3, "assessor": "z_assessor_663", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This project can have a huge impact and is the interest and benefit of the small farmers. Farmers need to get a better price for their products, but the final product for the consumer must also remain affordable, this needs to be considered. ", "q0r": 4, "q1": "The proposal concerns sub-Saharan farmers, do these farmers have access to the internet and digital devices? This also means extra administrative burdens for them, do they have the time and space for this? Good to see that these farmers are being trained to use the platform, this is necessary.", "q1r": 2, "q2": "A good roadmap has been made, but it is completely focused on the development of the platform. The intermediary must also be very reliable and extremely well screened and possibly monitored from 'higher up' as well. KPIs to measure success are still a bit lacking. The budget is divided transparently.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "A blockchain based digital agricultural marketplace, where parties directly buy produces from small holder farmers, cutting middlemen out is a great way to address the challenge since it can affect many people and give them better life. This proposal can also bring the use of Cardano or blockchain in general to be more community focus and become valuable as bring more the good thing to the market by making free and fair.", "q0r": 5, "q1": "The proposal said he has designed & implemented the first digital agricultural platform in Ethiopia but it's better to include evident/demonstration of this information. He seems understand the problem and was able to explain the plan step by step clearly, although still not very detailed. But the proposal shows that he's been thinking hard about how to turn the idea into reality. The strategic and context analysis is very well done. In addition, the Phases of project are planned logically.", "q1r": 4, "q2": "The proposal has milestones but doesn't have key metrics/KPIs to measure the success.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This is a high quality, noble proposal with leveraging Atal PRISM DIDs, to help improve a struggling AG and Farmer's world. In current times, the Farmers need someone supporting them. I personally know many small farmers, and run a small farm myself. The small farmers I know, make barely enough profit to pay for the year's requirements, leaving virtually no profit. This idea will help give the farmers a voice and a chance to improve their market. I wish the best of luck educating the farmers!", "q0r": 5, "q1": "The relative experience is limited specifically in the proposal, related to familiarization of the agriculture industry. However, with the information and details provided, it is apparent that the proposer does have a good understanding of agriculture and farmer struggles. In addition, in viewing the proposer's GitHub, there is at least a foundational knowledge of Atala PRISM.\r\nThe plan is well thought out. And a reasonable time frame of 12 months. It is always important to be aware the amount of time involved in such an effort.", "q1r": 4, "q2": "The metrics to measure the success here are easily extrapolated. They will broadly and certainly begin with demonstrating successful farmer education and their desire to use the platform (in various ways). Then the issuance of the DIDs. Finally, the marketplace.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Une place de marché agricole numérique basée sur la blockchain, où les parties achètent directement des produits aux petits exploitants agricoles, en supprimant les intermédiaires.", "experience": "Nathan Bogale, est un architecte de solutions et un entrepreneur. Il a conçu et mis en œuvre la première plateforme agricole numérique en Éthiopie."}