{"id": 383348, "author": "jochen.leinberger", "title": "Open Source Identity Wallet", "url": "https://cardano.ideascale.com/a/dtd/383348-48088", "category": 26254, "amount": 47500, "description": "Il manque à l'écosystème Cardano un porte-monnaie open source capable de gérer les identités numériques.", "funded": 1, "upvotes": 29852643, "downvotes": 10779773, "votes_result": 19072870, "votes_cast": 176, "f6_no_assessments": 4, "f6_rating": 3.9166666666666665, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=14930"], "media": [], "f6_assessments": [{"q0": "Impact :\r\nL'énoncé du problème :\r\nLe portefeuille d'identité open source offre un moyen d'accélérer le paysage de l'identité décentralisée de Cardano en résolvant le problème de l'absence d'un portefeuille open source capable de gérer les identifiants décentralisés (DID) et les justificatifs d'identité vérifiables.\r\nUn objectif clairement défini :\r\nLes proposants prévoient de développer des bibliothèques Open-Source pour les composants nécessaires au développement de portefeuilles d'identité sur les principales plateformes.  Ils prévoient de développer ces bibliothèques pour les navigateurs Web via des plugins, la plateforme iOS et la plateforme Android.  Il est prévu d'utiliser le langage C pour Android et iOS ainsi que la machine virtuelle Web Assembly (WASM).  L'implémentation de bibliothèques C pour une utilisation dans WASM présente un intérêt particulier en raison de sa fonctionnalité. Les machines à pile WASM sont efficaces et rapides car elles peuvent potentiellement s'exécuter à la graine native en tirant parti des capacités matérielles communes de la plate-forme.  Elles sont sûres dans la mesure où elles peuvent être mises en œuvre dans un environnement sandboxed à l'intérieur des machines virtuelles JavaScript existantes.  Les bibliothèques WASM peuvent appliquer les politiques de sécurité de même origine et de permission du navigateur lorsqu'elles sont intégrées dans le Web.\r\nAvec chaque mise en œuvre couvrant le côté client, les données cryptées en lecture/écriture, la couche d'agent et une couche d'interface utilisateur mince, cette proposition semble prête à créer une solution indispensable à l'un des plus grands problèmes de l'écosystème de l'adoption de masse.  La création d'un backend robuste qui permettra une couche UX solide, sûre et facile à utiliser, contribuera grandement à l'adoption massive de l'écosystème Cardano.\r\nLe projet est positionné pour créer des blocs de construction et des bibliothèques enveloppés ensemble sous une couche d'interface utilisateur légère en utilisant les composants de porte-monnaie Hyperledger Indy comme référence et, en tant que tel, réalisera l'interopérabilité.  Cette interopérabilité permettra à Cardano et Atala PRISM d'interagir avec d'autres éco-systèmes.  Les principales caractéristiques de l'Hyperledger Indy sont les suivantes :\r\n1. des DIDs qui sont uniques au monde et résolvables (via un ledger) sans nécessiter d'autorité de résolution centralisée.\r\n2. des identifiants par paire qui peuvent créer des relations 1:1 sécurisées entre deux entités.\r\n3. des preuves de connaissance nulle qui prouvent que tout ou partie des données d'un ensemble de revendications sont vraies sans révéler d'informations supplémentaires, y compris l'identité du vérificateur.\r\nLe projet de porte-monnaie électronique à code source ouvert semble avoir atteint son objectif.  Il apporte une solution à une partie très critique de l'adoption de masse en construisant le cadre sur lequel des applications d'identification faciles à utiliser, sécurisées et décentralisées peuvent amener le grand public dans l'écosystème Cardano.  Je suis tout à fait d'accord que cette proposition répond à l'impact du défi. SCORE D'ÉVALUATION 5\r\n", "q0r": 5, "q1": "Faisabilité :\r\nLes idées fondamentales qui sous-tendent le portefeuille d'identité à code source ouvert semblent être soutenues par des ressources solides, développées et réelles.  \r\nUn plan d'action :\r\nLe projet prévoit de réussir selon une feuille de route de 3, 6 et 12 mois.  Le jalon de 3 mois indique une spécification détaillée et une définition de l'API pour les composants du porte-monnaie, y compris des maquettes filaires comme produit livrable.  Il est à noter que l'API et les maquettes pour le portefeuille semblent complètes et sont liées à https://github.com/IAMXID. L'équipe de développement fait preuve d'une forte crédibilité en arrivant à la table avec le jalon de 3 mois déjà réalisé.\r\nElle prévoit que la mise en œuvre de référence pour le Web, Android et iOS sera prête au bout de 6 mois.  \r\nL'étape de 12 mois pour la mise en œuvre d'iOS/Android, la documentation du code source et la date de lancement prévue du 1/6/2022 illustrent bien la marche puissante de cette équipe vers son objectif ultime. Le projet fait référence à l'utilisation de technologies multiplateformes comme Flutter.  Flutter est une plateforme de développement d'applications basée sur Google, robuste et réaliste, qui donne des résultats et est bien adaptée au développement frontal avec des liens impressionnants avec le back-end.\r\nIllustration des compétences requises pour mener à bien le projet :\r\nL'équipe de développement est composée de :\r\nJochen Leinberger :\r\nSpécialiste du développement de produits numériques allégés et centrés sur l'utilisateur. Conception UX et développement de logiciels, développement de produits numériques et développement de produits numériques et de logiciels chez un constructeur automobile allemand. Ancien projet avancé au département des nouveaux produits et des innovations de Deutsche Telekom à Bonn (Smart Home, Entertain, Retail Solutions, Payment). Co-auteur du livre \"Prototyping Interfaces\".\r\n\r\nDennis Mittmann :\r\nPlus de 20 ans d'expérience dans les services web à fort trafic dans des environnements à haute disponibilité et les services de données en temps réel évolutifs. Architecte de base de données, systèmes de paiement, statistiques\r\n5+ ans Tech Lead Database Developer, 8+ ans Team Lead Web Developer, Blockchain depuis 2011\r\nJoseph Frankiewicz\r\nArchitecte logiciel et développeur d'applications mobiles avec ~20 ans d'expérience en développement, en se concentrant sur les applications frontales. Cofondateur du pool Cardano EAGLE. Développeur de l'application mobile Pool Peek, qui permet aux utilisateurs d'afficher et de sélectionner les pools d'enjeux Cardano.\r\nTim Brückmann :\r\nArchitecte de l'équipe, MBA (marketing, contrôle de gestion, économie de l'Asie de l'Est), CMO handy.de, cofondateur et opérateur de pool de StakeforFuture.org [AZUL], cofondateur et ancien PDG de wunderwerk eco fashion & wunderwerk e-commerce, 25 ans d'expertise en marketing et ventes, expert en produits de style de vie durable, 10 ans partenaire de Jochen CTO, 25 ans de coopération avec Tim CEO, PADI Divemaster, gagnant du Bundespreis ECOdesign, gagnant du prix PETA.\r\nTim Heidfeld\r\npossède un savoir-faire opérationnel et une expertise stratégique issus du commerce électronique et des places de marché électroniques Scout24, Allianz24, moneysupermarket.com, preis24.de, handy.de. Tim a une connexion personnelle directe avec les cas d'affaires et les telcos sur la base de son travail opérationnel. Sa compétence principale est le développement commercial.\r\nL'équipe du portefeuille Open-Source est composée de plusieurs membres hautement qualifiés ayant chacun plusieurs années d'expérience dans le développement web, l'architecture de bases de données, les systèmes de paiement et le développement de logiciels.  \r\nUne répartition du budget :\r\nLe projet semble avoir fait des progrès réels avec des solutions définies au problème énoncé et dispose d'une ventilation des besoins budgétaires qui délimite clairement ce qui est nécessaire pour faire passer le projet à l'étape suivante.\r\nAvec son équipe hautement qualifiée de développeurs et de chefs d'entreprise, ce projet semble capable et positionné pour accomplir sa tâche de fournir un véritable portefeuille d'identité open-source.  SCORE D'ÉVALUATION 5\r\n", "q1r": 5, "q2": "Auditabilité :\r\nLe fait d'avoir accompli une partie de ce qu'ils s'étaient fixés comme objectif témoigne de la réussite de cette équipe.  \r\nJe suis convaincu que cette équipe sait ce qu'elle fait et peut apporter une valeur ajoutée à l'écosystème Cardano. Les indicateurs de performance clés de ce projet se trouvent dans leur code, accessible sur Github.com/IAMXID.  Pour les personnes/votants qui ne sont pas versés dans le codage, il pourrait être difficile de dire quels sont les progrès réalisés par cette équipe. Je n'ai aucun doute sur le fait que le projet atteindra les objectifs qu'il s'est fixés. Cependant, un plus grand nombre d'outils utilisés et une meilleure description du processus de développement du logiciel pourraient donner un meilleur aperçu de la progression du programme, ce qui rendrait le projet plus facile à suivre en dehors des cercles de développement.  Le projet manque d'une bonne auditabilité et est un peu court en ce qui concerne les indicateurs clés de performance spécifiques qui pourraient aider à suivre les progrès de ce projet et ajouter à sa transparence globale. SCORE D'ÉVALUATION 3.\r\n", "q2r": 3, "assessor": "z_assessor_479", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Proposal identifies the problem of Cardano ecosystem needing an open source wallet that can handle DIDs. They will ad value to the Cardano ecosystem by encouraging the integration of DID functionality in wallets. Paving the way for Dapps that needs DIDs. The metrics of this proposal is aligned with the Challenge in the sense of onboarding more DID use cases and users. The project is able to scale well because it will be an open source library.", "q0r": 5, "q1": "The relevant skills and team has been provided with a link to github page and links to other projects. The budget is broken down into identifiable items. Including the hours and rates per hour would be very informative instead of just one big amount for one task. The timetable of 12 months to complete this seems reasonable.  They explain all the functions this wallet will have and explains all the technical details on how they will build this in great detail. They haven't considered any risks or challenges. Not being aware  or prepared for risks can slow you down when they do surface.", "q1r": 4, "q2": "It is quite easy to track the progress of this project as the roadmap they provided shows different parts of the project being completed as milestones. They also consider this as their KPIs. They should ad more user based KPIs like pull requests or downloads to track the performance of the project post launch. They identify the problem of wallets needed to handle DIDs and they solve this by creating an open source library specifically for creating these kind of wallets.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to fill in a gap in the Atalia PRISM ecosystem by creating an open-source web based, Android and IOS wallet that supports DIDs and VCs. \tIf successful it should aid evolution of mass decentralized identity (DID) adoption specifically with Atalia PRISM.  However one comment pointed out it is nearly identical to https://cardano.ideascale.com/a/dtd/Open-Source-Credential-Wallet/382078-48088.  That proposal proposes a cross-platform wallet but it isn't clear it is Android / IOS so conceivably both projects can be useful additions. \r\n", "q0r": 4, "q1": "The expected launch date is listed as 1.6.2022 but this must be a typo given the 12 month development plan.  I suspect they meant 1.6.2023.  The team look like qualified application developers, yet don't mention the Alalia PRISM pioneer program participation.  The competing proposal listed in the Impact section has more breadth in demonstrating connections to the Atalia PRISM community and documentations.  The budget seems a little high but still within the realm of reason.  ", "q1r": 4, "q2": "The proposal lists milestones at 3, 6 and 12 months, however they are somewhat high-level.  More specifics would help the proposal.  Specific reporting on progress would be helpful.  \r\n", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal effectively responds to the challenge and is addressing a clear need in the ecosystem as DIDs cannot be used without the existence of a wallet to hold the issued Verified Credentials. The field is so broad, and there are so many different use cases, that the team's proposal to build a flexible and general tool that could be adapted by specific projects also makes sense. However, I am a bit confused regarding whether this proposal seeks to build a wallet that would for end-users (as seems to be implied in some sections) or a tool that would be used by other developers of wallets (as is implied in other sections).  As a result of this lack of clarity, I am struggling to identify the target audience for this wallet, and therefore to assess which community would benefit from its creation. Similarly, the proposal would be strengthened by references to other projects in the ecosystem, to give a clearer view of where this proposal would fit in. ", "q0r": 3, "q1": "The detailed experience listed for the team members is impressive, and clearly supports their ability to build the proposed software. While the introduction references experience in the Atala Prism Pioneer program, it is not clear which of the team members participated in the course. As participation in the course is essential in order to access the Atala PRISM SDK, more detail on this point would be useful. Additionally, while the proposal states that Joseph Frankeiewicz is a co-founder of the EAGLE pool and the developer of the Pool Peek app, none of the other team members appears to have experience in the Cardano ecosystem, as detailed in the proposal. Additionally, no links are available to public information about the team. From googling, I was able to find relatively clear evidence substantiating their experience, but next time around it might be helpful to make that info more explicit. Similarly, IAMX is sort-of referenced in the proposal, but not explained. By googling I was able to find the company's website and they appear to be engaged in very interesting work in the Carano ecosystem, and to be partnered with WADA, which is also a strong community within the eocosystem. More detail about IAMX, and particularly whether this wallet is directly related to that company would be very helpful. If the company is not at all related to the wallet project, then I would suggest removing the references to IAMX completely. ", "q1r": 4, "q2": "The proposal provides a roadmap, although the milestones are a bit vague and would benefit from more detail. There aren't any KPI metrics described. A glaring miss in the proposal is any reference to the fact that the Atala PRISM SDK is not yet final or public. It is not clear how they intend to build an Open-Source wallet when the SDK is not yet available to the public. Other proposers in this challenge have highlighted the PRISM SDK as a risk, and documented their plans to address. The team does reference the Hyperledger Indy SDK. While their familiarity with that material is good to know, it is even more confusing that the Hyperledger SDK's is cited while the proposal is completely silent on the PRISM SDK. It would also be very useful to understand why exactly the Indy SDK is a point of reference, and how it compares and contrasts to the approach taken by Cardano. ", "q2r": 2, "assessor": "z_assessor_662", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1, "reply": "As Open Spource Project the KPI is in adoption of the proposed Wallet framework, something hard to measure in KPIs, as it might be in the Time beyond Wallet development.\n\nThe Scope of the project ist to deliver the main Buidling Blocks to develop an Identity Wallet. The Connectors to specific DID Methods as PRISM will be implmented when ready. \n\nBut Elemnts for storage, Key handling & communication etc. can allready be implemented - anyway it's better to start as people are teaming up to develop Identity Projects on Cardano, but are missing an Identity Wallet.\n\nIn my presentation I mentioned as well that IAMX will build a Wallet on top of the Open Source Wallet. But won't brand the open Source Wallet as it is meant to be a Boilerplate Identity Wallet for all Teams looking for a springboard to push the SSI ecosystem on Cardano forward."}], "solution": "Développer un porte-monnaie open source capable de gérer les DID et les VC et fournir une mise en œuvre de référence comme tremplin pour de nouveaux projets.", "experience": "Développement de logiciels (Frontend & Backend) & Design UX (20+ ans). Pionnier de Plutus et pionnier d'Atala Prism."}