{"id": 383996, "author": "chris42", "title": "Cardano for Global Health Supply", "url": "https://cardano.ideascale.com/a/dtd/383996-48088", "category": 26254, "amount": 50000, "description": "Le problème du \"dernier kilomètre\" dans le dossier de campagne bloque la fourniture de diagnostics pour prévenir la transmission du VIH, de la tuberculose et d'autres maladies en Afrique.", "funded": 0, "upvotes": 16501536, "downvotes": 18597526, "votes_result": 2095990, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "Oui, cette proposition relève efficacement le défi et, si elle est financée, elle aura un impact massif sur la communauté Cardano. Comme le système Kountable est déjà opérationnel dans six grands pays africains, cette intégration pourrait être rapide et apporter immédiatement de la valeur à l'écosystème Cardano et à ses utilisateurs. La confiance établie par les proposants dans toute la région réduira les obstacles à l'adoption et augmentera la portée d'Atala Prism en apportant de nouveaux secteurs. J'apprécie l'inclusion par les proposants des travaux antérieurs qu'ils ont effectués dans cet espace, y compris leur succès, ainsi que leur identification des ODD qui seront abordés par leur solution. Ces preuves de l'impact antérieur et de l'attention portée aux problèmes mondiaux auront probablement un bon écho auprès des électeurs.", "q0r": 5, "q1": "Compte tenu de l'expérience et du plan présentés, il est difficile de dire définitivement si la proposition sera mise en œuvre avec succès. Le produit existant montre que la société à l'origine de la proposition a de l'expérience et a réussi à résoudre le problème du \"dernier kilomètre\" pour atteindre les communautés rurales et en développement avec les ressources nécessaires. Cependant, le plan présenté, bien que passionnant, doit être développé davantage et mieux expliquer comment l'intégration d'Atala Prism sera menée. Il n'est pas clair ce qu'implique l'intégration d'Atala Prism dans le programme existant ou combien de temps cela prendra. Malheureusement, il n'y a pas non plus de véritable calendrier pour le travail, ni de ventilation du budget. Pour 50 000 dollars, les électeurs méritent plus qu'une somme forfaitaire sans aucune indication sur la façon dont ce chiffre a été atteint ou comment il sera dépensé. Étant donné le manque d'informations essentielles sur ces questions, je ne suis ni d'accord ni en désaccord avec l'idée que la mise en œuvre de ce projet pourrait être réussie.", "q1r": 3, "q2": "Malheureusement, les électeurs ne disposent d'aucune information réelle leur permettant de vérifier la progression ou le succès de la proposition. Alors que l'idée est clairement présente et que les antécédents de l'entreprise suggèrent que les proposants seraient capables de la résoudre, il n'y a aucun moyen pour la communauté Cardano d'identifier ou de suivre les résultats. J'apprécie les indicateurs clés de performance (KPI) fournis dans le cadre des ODD, mais cela n'explique pas comment l'intégration d'Atala Prism pourrait aider à les atteindre. Comme l'entreprise met clairement en avant son succès dans le problème du \"dernier kilomètre\", on peut en déduire que beaucoup de ces indicateurs ne sont pas spécifiques à ce projet mais plutôt aux opérations de l'entreprise dans son ensemble. De plus, comme nous l'avons souligné plus haut, l'absence d'indication sur la manière dont le budget sera dépensé et sur quoi, me préoccupe, les électeurs étant susceptibles de se méfier de cette approche. Afin d'augmenter le score, j'encouragerais les proposants à articuler plus clairement la manière dont la communauté peut être impliquée ou informée de l'avancement et du succès du projet.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This team wants to use distributed network and to match diagnostics supply transactions, local distributors, and capital with Cardano tools to unlock access to help prevent transmission of HIV, TB, and other diseases in Africa. This project and its problem are fit with what the challenge wants to address. And their KPIs can be fit with the challenge.", "q0r": 4, "q1": "The team doesn't have a plan to show what they will do with this proposal. They're a great team that helps a lot of people, especially helped deliver 14M diagnostics to 3 African countries cloud tech, treasury, KYC/AML platform and digitized 3K trades $1.25B in value. \r\nTo me, I have no doubt about their ability to deploy this project.\r\nBy for CA and vCA assess and fund, the team should have a plan to go and a detailed roadmap. That's basic!\r\nThe good thing is that the team attached a video of them, some images, and a website that we can visualize what they're doing and support. .", "q1r": 3, "q2": "The basic thing in a proposal the team should have for helping to audit it is the roadmap with a realistic timeline inspired key metrics/ KPIs - they had their goals very clear but lacked roadmap. \r\nMoreover, we want to know what big picture that your team wants to get with your project/ idea by clarifying that you have a well acknowledge of the problem context and have the solution with detail to solve it. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly explains how UN SDG Goal 3 is addressed via an innovative implementation of the Atala family of technologies. ", "q0r": 5, "q1": "The experience of the proposers appears very appropriate - yet there is no actual plan presented with clear milestones and budget assigned to milestones by which progress can be tracked. We encourage the proposers to resubmit with a comprehensive plan detailing how the proposed work will unfold and how the budget requested will be spent at various stages of the plan.", "q1r": 3, "q2": "The KPI presented are very generic and cannot be measured at this stage of the project because their accomplishment require a long time to determine (e.g under 5 mortality rate, etc). We encourage the proposers to resubmit including shorter term measures of success, or at least mention what they achieved in the long run along the respective KPIs so we get confidence in their estimate. ", "q2r": 1, "assessor": "z_assessor_721", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Utiliser un réseau distribué et faire correspondre les transactions de fourniture de diagnostics, les distributeurs locaux et les capitaux avec les outils Cardano pour débloquer l'accès.", "experience": "L'équipe a fourni 14 millions de diagnostics à trois pays africains par le biais de la technologie en nuage, de la trésorerie, de la plateforme KYC/AML et a numérisé 3 000 transactions d'une valeur de 1,25 milliard de dollars."}