{"id": 384273, "author": "pxpepex", "title": "Verifiable Credentials Tree", "url": "https://cardano.ideascale.com/a/dtd/384273-48088", "category": 26254, "amount": 50000, "description": "La distribution et l'évaluation des fonds portugais est un processus compliqué et manque de transparence de la part du gouvernement et des entreprises.", "funded": 0, "upvotes": 23310698, "downvotes": 7716414, "votes_result": 15594284, "votes_cast": 109, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "Le problème décrit est réel, et n'est pas spécifique au pays choisi. Il semble également constituer une bonne application des DID.\r\nLes dépenses publiques au Portugal sont légèrement inférieures à 50 % du PIB, donc si une petite partie de ces dépenses pouvait être canalisée à travers le système, la population cible potentielle serait très importante. Bien sûr, si un produit fonctionnel est livré, il devrait être facile de l'étendre à d'autres pays.", "q0r": 5, "q1": "Le projet global du proposant semble être un effort pluriannuel, et il n'est pas immédiatement clair pour quelle partie les fonds sont demandés.  À en juger par les activités de la feuille de route qui ne sont PAS étiquetées comme \"partiellement financées par le Fonds 7\", et les produits livrables, il semble que les fonds sont principalement destinés à la construction d'un MVP.\r\n\r\nJe dirais que la faisabilité de l'ensemble du projet est très faible, en raison des réglementations du gouvernement et des institutions financières, que les proposants ne semblent pas identifier ou avoir l'expérience de traiter. Cependant, les objectifs de ce fonds devraient être réalisables, car ils utilisent une pile technologique raisonnablement commune (c'est-à-dire qu'il est possible de trouver et d'engager des développeurs) et demandent un budget approprié pour cela. J'aurais aimé voir une meilleure description du MVP, le type de mécanismes de déblocage de fonds qui seraient disponibles, etc. Mon impression personnelle est que les proposants n'ont pas encore une idée claire de cela, car cela sera défini dans la première phase du projet, mais cela affecte finalement la faisabilité.\r\n", "q1r": 3, "q2": "Il y a trois livrables :\r\n* Un cadre pour la vérification d'un arbre de créance.\r\n* Un backend pour les données hors chaîne : distribution des fonds et émetteurs.\r\n* Un \"frontend [...] qui permettra à tous les utilisateurs [...] d'interagir avec notre solution\".\r\nLe frontend est ce qui serait en fin de compte la meilleure mesure du progrès, mais la description est assez vague, s'agira-t-il simplement d'un outil pour visualiser l'arbre des lettres de créance ? gérer les données hors-chaîne ? permettre aux utilisateurs d'émettre des lettres de créance ? permettre le déblocage des fonds ?\r\n\r\nSi la proposition n'est pas retenue, pour les futurs fonds catalytiques, je suggérerais de se concentrer sur les parties pour lesquelles le financement est demandé, et de fournir une description plus détaillée des fonctionnalités qui seront effectivement fournies.", "q2r": 3, "assessor": "z_assessor_941", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Great proposal. Excellent idea. Especially with your intention to open source the code, a verifiable credential tree/graph has implement in a wide range of top down or waterfall information or value flow context. On that specific point, this should perhaps have been the entire proposal, posted in the \"Open Source Developer Ecosystem\" challenge. As a candidate in the Accelerate Decentralized Identity challenge, the proposal does not speak concretely about how their codebase will perpetuate acceleration. More details about existing connections within the Portuguese government would go a long way convincing the voter that a high ROI (return on intention) for this proposal. IOG and the Cardano foundation have spent years lobbying and negotiating with government and financial entities with mixed results (although increasing successes). What clout does the team possess to cut through the bureaucracies? How does the team plan to set traditional banker fears about crypto at ease? What incentives does the bank have to make switch? I know the english adage of if you build it they will come have proven to be true more times than false, in the niche of legacy bank and governing structures however, this adage quickly loses most if not all mass.", "q0r": 3, "q1": "Given experience and plan presented it is highly likely this proposal will produce a codebase. Given the lack of financial (neither team member have worked at a bank) and governing experience, it seems less likely the product of this proposal will implemented by banks or adopted by Government Departments. As Talkdesk is a not a blockchain company, it's unclear how the team is planning acquire the skills needed to later move the \"legacy part to Cardano smart contracts and side-chains to keep all the information trackable.\" Is this perhaps a different proposal? Will the neccessary skills be developed? Is there a plan to hire smart contract skillspeople? The budget plan to hire 2x Software engineer for six months it seems would only cover the offchain kotlin and mobile apps work.", "q1r": 3, "q2": "the roadmap, public launch date, and budget are all working in concert to provide the community plenty of metrics to audit the progress of the proposal. Adoption and usage metrics however is lacking. It seems like the definition of success usage metrics only come into play in Q3 and Q4, both eras of the projects only partially covered by this proposal with Q4 not being covered at all, another support the suggestion that this should be in the Open Source Developer Ecosystem challenge. ", "q2r": 3, "assessor": "z_assessor_336", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "A working proof of concept (and planned to be open sourced) with the university partner would be a great building block for success for the application of this idea in many similar use cases. \r\nThe planed use case with the Portuguese government, could bring high volume/value of transactions to the Cardano ecosystem when funds are distributed. \r\nProject milestones are sensible but specific KPIs are not given or linked to campaign KPIs.", "q0r": 4, "q1": "Team has relevant technical experience and experience of financial management in large companies, likely to have the connections required to run a successful pilot and propose project to Governmental organisations.\r\nEffort planned and budgeted seem sensible for the planned outcome.  \r\nAdditional staff needed, presumably recruitment is required so possible risk to timescales due to that.", "q1r": 4, "q2": "Milestones and roadmap defined and capture success of the project. Audit may be improved if more granular milestones are added.", "q2r": 4, "assessor": "z_assessor_902", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "Création d'un arbre d'identification vérifiable pour la distribution des fonds du gouvernement portugais afin de garantir le droit de racheter les fonds.", "experience": "Ingénieur logiciel principal, pionnier de Plutus, pionnier d'Atala PRISM, développeur professionnel de l'architecture et de la conception d'Emurgo Cardano"}