{"id": 384283, "author": "alexp7", "title": "DWill - Cardanos Digital Testament", "url": "https://cardano.ideascale.com/a/dtd/384283-48088", "category": 26254, "amount": 5000, "description": "L'héritage des actifs numériques est une souffrance croissante et très difficile à gérer.", "funded": 2, "upvotes": 80241117, "downvotes": 3493135, "votes_result": 76747982, "votes_cast": 147, "f6_no_assessments": 4, "f6_rating": 4.083333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Oui, la proposition répond efficacement au défi. J'apprécie vraiment le problème identifié par l'auteur de la proposition, car le transfert d'actifs numériques en cas de décès ou d'incapacité va probablement continuer à croître et devenir un problème sérieux dans l'espace cryptographique. En cas de succès, une telle plateforme (testaments soutenus par DID) apporterait probablement des avantages massifs à la communauté, mais ce qui est moins clair, c'est l'impact de ce projet sur la communauté au sens large. Oui, la collecte et l'analyse d'informations est une bonne chose, mais j'aurais aimé voir une meilleure justification de ce projet de cette manière. Je me demande quel autre type de travail est déjà en cours dans la communauté en ce qui concerne cette question exacte, et comment le projet va accélérer l'adoption des DID ? Tel qu'il est rédigé, il semble que le projet explorerait l'option des DID dans un tel système mais ne conduirait pas nécessairement à leur adoption, par exemple si certaines questions juridiques se posent. À cette fin, est-ce qu'une certaine juridiction est examinée en premier ? Comment les différents régimes juridiques seraient-ils pris en compte ? Afin d'obtenir une note complète pour l'impact, j'aurais aimé voir une section explorant/expliquant ce type de considérations.", "q0r": 4, "q1": "Oui, étant donné l'expérience et le plan présentés, il est très probable que cette proposition soit mise en œuvre avec succès. J'apprécie que le proposant ait partagé un lien vers ses références afin que les électeurs puissent les consulter s'ils le souhaitent. Le proposant a également de bons antécédents de réussite au sein de la communauté Cardano, ce qui renforce la confiance dans sa capacité à mener à bien le projet. Je ne comprends cependant pas pourquoi le proposant n'a pas ajouté les références du chercheur UX identifié, puisqu'il fait déjà partie de l'équipe et sera responsable de la moitié du travail. Ce qui manque également pour moi, c'est un calendrier clair ou une feuille de route pour savoir quand ce travail sera terminé. Les éléments livrables sont bien présentés et les indicateurs clés de performance semblent réalisables, mais je ne sais pas exactement à quel moment. Si l'on se base sur le budget, il semble que ce projet ne dure que 2 mois, mais pour ce qui est suggéré, c'est probablement insuffisant. Pour obtenir la note maximale ici, j'aurais aimé voir ce calendrier et savoir à quels intervalles les mesures seraient prises. Le budget est tout à fait raisonnable et, en cas de succès, il pourrait rapporter des dividendes à la communauté pour un si petit montant, mais pour les raisons mentionnées ci-dessus, il faut plus de détails pour obtenir la note maximale.", "q1r": 4, "q2": "La proposition n'indique pas clairement comment elle serait auditée de manière appropriée. Bien que j'apprécie l'expérience du proposant telle qu'elle est présentée dans la proposition, il n'est pas clair comment la communauté serait en mesure de suivre et de s'engager avec les proposants. En ouvrant les enquêtes aux \"volontaires\", le proposant pourrait intrinsèquement fausser les résultats, car les volontaires sont souvent ceux qui ont le plus à dire, et peuvent ne pas refléter fidèlement la situation. Quels critères seraient utilisés pour sélectionner ces personnes, comment seraient-elles contrôlées une fois identifiées, et quelles garanties, le cas échéant, sont en place pour assurer l'exactitude et la clarté du projet ? Si les indicateurs clés de performance et les résultats attendus sont clairs, ce qui l'est moins, c'est la manière dont le proposant présentera ses conclusions à la communauté ou exploitera les connaissances de celle-ci pour l'améliorer. Je donne à cette proposition un 3/5 (ni d'accord ni pas d'accord) parce que plus de détails sont nécessaires pour que les électeurs se sentent confiants dans le fait que cela pourrait être audité de manière appropriée. En cas d'échec dans ce fonds, l'ajout de ces éléments à la prochaine soumission entraînerait sûrement des notes complètes.", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of finding real use cases for DIDs. They will ad value to the Cardano ecosystem by bringing more use cases to  DIDs, driving more transactions and users. The metrics of this proposal is on doing research and not necessarily aligned with the challenge, but the long term metrics of creating a digital testament/will that makes use of DIDs are aligned with the challenge. The end project will be able to scale as it is an existing model that is already used offchain.", "q0r": 4, "q1": "Relevant skills for this proposal have been proved with LinkedIn page. The budget is reasonable and broken down into 2 items. UX and Lead researcher. They will complete their research in 2 months, which is very reasonable.  They explain in detail how they will do the research and break it down into different parts.  Also providing items that will be constructed with the research. They haven't considered any risks. Not being aware or prepared for risks, will slow you down.", "q1r": 4, "q2": "They provided a project progress indicators section that indicates a roadmap with milestones and KPIs all in one. They also provided a list of deliverables when the research is complete. This will make measuring the progress and performance of the project very easy. They identify the need for creating Digital wills and they intend to solve this by first doing research on the topic to discover the best way to approach building this product.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "`the subject (inheritance of digital assets) is ne that affects every crypto owner. So potential impact is as great as can be imagined. And even if only for ADA holders, that's already massive. ", "q0r": 5, "q1": "The plan is for research into a topic that is broad ranging. The background of the proposer, and his analysis of the domain suggests he can conduct the research .", "q1r": 5, "q2": "the topic is huge, the domain of information is broad. The proposer has given tangible metrics by which to audit performance. Not too much to think about. And finally, the budget is quite reasonable.", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 21, "ne": 1, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "Connecting smart contracts and wills to smart contracts is a great idea. If the proposal is implemented and developed to full potential, it will increase accelerate DID adoption and increase Cardano utility.", "q0r": 3, "q1": "The team provided work history and experience with links to LinkedIn and the work previously done in the Cardano community. Considering the plan is not complicated to execute, I believe that the proposal will be implemented sucessfully. ", "q1r": 4, "q2": "The budget is small, simple and self-explanatory. The team created milestones and created KPIs to measure performance over time. I believe the proposal will be easy to audit.", "q2r": 4, "assessor": "z_assessor_358", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Les SmartContracts de Cardano peuvent fournir la base d'une automatisation sécurisée des testaments et les identités décentralisées peuvent permettre le cas d'utilisation.", "experience": "Pionnier de la première cohorte d'ATALA Prism. Plus de 20 ans de création de produits numériques et d'entreprises technologiques. Membre actif de Catalyst, CA, proposant financé."}