{"id": 384375, "author": "heinz.gassner", "title": "DID Application Blueprint", "url": "https://cardano.ideascale.com/a/dtd/384375-48088", "category": 26254, "amount": 25000, "description": "Les projets DID se lancent souvent très tôt dans la programmation de solutions, sans s'être suffisamment concentrés sur une architecture sous-jacente solide comme le roc.", "funded": 2, "upvotes": 89464602, "downvotes": 1829672, "votes_result": 87634930, "votes_cast": 334, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "Oui, la proposition répond efficacement au défi. J'apprécie que, comme pour Cardano, l'équipe adopte une approche lente et fondatrice pour accélérer l'adoption des DID. Un modèle d'utilisation commune qui est ouvert pour être adapté à un large éventail d'applications et de produits pourrait fournir un excellent outil pour les développeurs nouveaux et expérimentés. Les proposants ont également fait cette danse auparavant ; la proposition est rédigée de manière à identifier clairement les critères de notation et coche toutes les cases. En décomposant les sections en impact, faisabilité et vérifiabilité, les AC et les électeurs n'ont pas à déterminer quels seront les résultats attendus. Cela me donne une assurance supplémentaire que l'impact correspondra à ce qui est écrit, car l'équipe montre qu'elle a réfléchi à ses problèmes, aux défis possibles et qu'elle a identifié des mesures d'atténuation.", "q0r": 5, "q1": "Oui, compte tenu de l'expérience et du plan présenté, il est très probable que cette proposition soit mise en œuvre avec succès. Ce que j'apprécie le plus dans cette proposition, c'est son intégration avec plusieurs autres composants de la communauté Cardano. Le plan est très bien présenté et les attentes et les résultats attendus sont clairs. En prenant le temps de positionner cette proposition par rapport à la proposition fund6 de l'équipe, et aux autres travaux en cours dans l'espace Atala Prism, l'équipe identifie clairement pourquoi elle est différente et comment elle comblera un vide dans l'écosystème. La feuille de route, le calendrier et les résultats attendus semblent tous raisonnables et s'intègrent parfaitement au projet DLT-360. En tant que CA, je suis reconnaissant à l'équipe d'avoir inclus des détails et des liens vers leurs références, puisque la communauté peut les vérifier avant de voter. C'est quelque chose que toutes les propositions devraient faire et c'est de bon augure pour la mise en œuvre compte tenu de leurs antécédents.", "q1r": 5, "q2": "Oui, les informations fournies sont suffisantes pour vérifier l'avancement et le succès de la proposition. L'équipe fait un excellent travail en exposant le problème actuel, en présentant sa solution et en précisant les étapes et les intervalles auxquels le travail sera effectué. En outre, l'équipe mentionne explicitement ses \"plongées approfondies Miro à la demande\" qui peuvent être demandées par n'importe quel membre de la communauté afin d'obtenir une compréhension plus approfondie du projet, des progrès et des prochaines étapes. Personnellement, ce type d'ouverture peut donner aux électeurs l'assurance qu'il existe des possibilités de participation de la communauté. De plus, en tant que membres de la cohorte des coordinateurs Catalyst qui aident les proposants financés à rendre compte et à assurer le suivi des progrès, les membres de la communauté peuvent également être assurés qu'ils seront en mesure de suivre et de s'engager dans le projet de manière ouverte et transparente. Félicitations à l'équipe et j'attends avec impatience les résultats.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Relation to personal qualifications:  in my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I can bring in some competencies in evaluating the budgets in this category on their credibility and accountability. In addition to this, I'm a catalyst member and CA for quite some while and have generally a good understanding of the different topics of the ecosystem and of how the proposal process works and what good proposals need. The proposal identifies a valid problem regarding DID: the fact that ist underlying architecture needs both a more solid foundation and understanding among developers. I think this is a very valid critique that needs to be adressed, which is done so with this proposal in a competent and beneficial manner. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 5, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The proposal aims to build a blueprint for DID application, which is perfectly in accordance with the challenge and has a large impact potential. It will definitely speed up and accelerate the DID adaptation and having such a feature for other new projects can increase the overall quality of the future DID projects. ", "q0r": 5, "q1": "The information in the proposal is sufficient to assess, that the team poses the required skill and experience relevant to their goal. The linked in links are provided, and they are previously funded team, which increases their creditability. The roadmap is provided in a very detailed way along with the cost breakdown supporting the total amount, which is reasonable. ", "q1r": 5, "q2": "Even tough the first KPI seems hard to measure, the rest is very well described, along with the problem-solution. The roadmap would require a more detail e.g. terms such as \"basic research\" can cover a lot, and it is estimated for three months. Overall, these are just tiny parts that seems slightly off, but I do not find it enough for a lower score. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 20, "ne": 0, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "The proposal hopes to build a DID blueprint that will aid in interoperability between DID projects. This fits well into the goals of the challenge. ", "q0r": 5, "q1": "The team received funding in fund6 and have a wide range of experience, although not specific to blockchain. They will outsource expertise on DID from IOHK and other experienced groups. Because this is a highly technical subject I find it difficult to estimate their ability to succeed and have given a neutral rating. ", "q1r": 3, "q2": "Road map and KPIs are somewhat subjective but do provide measurable metrics. Funds are not broken down but the amount is modest.", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 23, "ne": 1, "ng": 16, "nfo": 6, "vca_o": 1}], "solution": "Avec cette proposition, nous voulons approfondir et établir une architecture interopérable solide pour les DApps, basée sur Atala PRISM DID.", "experience": "Plus de 30 ans d'expérience en tant que leader du secteur, combinés à un accès direct à des experts dans des domaines spécifiques."}