{"id": 384436, "author": "reshm", "title": "Win-Win Prism DID Integration", "url": "https://cardano.ideascale.com/a/dtd/384436-48088", "category": 26254, "amount": 20000, "description": "Win-Win, un nouveau marché de règlement extrajudiciaire des litiges alimenté par Cardano, a besoin d'un mécanisme pour mettre en relation, en toute confiance, les médiateurs et les clients.", "funded": 2, "upvotes": 72492506, "downvotes": 3416410, "votes_result": 69076096, "votes_cast": 192, "f6_no_assessments": 8, "f6_rating": 4.458333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Oui, cette proposition relève efficacement le défi et constitue un cas d'utilisation unique pour l'inclusion des DID. L'augmentation de la résolution des conflits deviendra importante dans l'espace en ligne, car les individus auront besoin d'un recours si un accord échoue, et leur application win-win est une excellente solution, comme en témoignent les meilleures notes et les meilleurs votes dans Fund6. Maintenant, l'intégration de l'Atala Prism DID dans le win-win semble être une évolution évidente. En intégrant les DID dans l'application de résolution des conflits, les utilisateurs pourront identifier et sélectionner en toute confiance un médiateur qui répond à leurs besoins, et permettra également aux professionnels de commencer à construire leur système de réputation qui peut être utilisé pour acquérir plus de travail sur la base de leur travail passé. Cela semble être une prochaine étape évidente dans le déploiement de l'application et je pense que la communauté en bénéficierait grandement.", "q0r": 5, "q1": "Avec l'expérience et le plan présentés ci-dessus, il est extrêmement probable que la proposition sera mise en œuvre avec succès. L'équipe a déjà fait ses preuves, non seulement dans le fonds 6, mais aussi par les nombreuses façons dont elle participe à la communauté, ce qui devrait donner aux électeurs un sentiment de confiance très élevé dans leurs capacités. Une autre raison pour laquelle je pense que ce projet est susceptible d'être un succès est que l'application gagnant-gagnant est déjà en cours de développement et est prête à être testée et intégrée. Cela inspire confiance car une grande partie du travail est achevée et l'intégration restante apparaît comme une optimisation supplémentaire. J'ai également confiance dans le fait que les proposants soulignent comment ils ont l'intention de faire évoluer l'application après l'intégration d'Atala Prism et énumèrent les partenaires qui feront progresser l'adoption. Le calendrier, la feuille de route et le budget semblent tous plus que raisonnables pour ce que le résultat potentiel pourrait être.", "q1r": 5, "q2": "Oui, les informations fournies sont suffisantes pour vérifier l'avancement et le succès de la proposition. L'équipe fait un bon travail en identifiant le problème, en présentant sa solution et en expliquant comment l'introduction des DIDs aidera à atteindre ses objectifs. J'aurais aimé voir les proposants s'étendre un peu plus sur leur processus autour de \"l'audit des contrats intelligents par une tierce partie\" ou plutôt une articulation plus claire des possibilités pour la communauté d'être informée sur les progrès. Cela dit, étant donné la visibilité de l'équipe à travers l'écosystème et dans une variété de forums différents, il y a probablement de nombreuses possibilités de contribution de la communauté. Dans l'ensemble, un projet génial et bonne chance.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 21, "ne": 13, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "La proposition correspond très bien aux objectifs du défi et apportera probablement de grands résultats à l'écosystème Cardano. L'idée est d'intégrer un projet qui existe déjà, la plateforme Win Win, construite en Cardano et visant à résoudre les conflits en dehors du système judiciaire, avec les DID d'Atala Prism. Note : point pour les auteurs en expliquant ce qu'est Win Win, en donnant un bref résumé du projet et en joignant une conférence de plus d'une heure sur la proposition f6, qui a été financée. La proposition sera certainement un succès et augmentera le nombre de DID en circulation parce que : la plateforme est déjà utilisée, elle a déjà quelques utilisateurs et avec les investissements demandés (les promoteurs cherchent à l'étendre et à l'améliorer, j'ai déjà évalué d'autres propositions concernant Win Win dans ce fonds) va certainement s'améliorer et devenir plus populaire. Cela signifie plus d'utilisateurs, et en promouvant cette intégration avec Atala Prism, de nouveaux DIDs seraient générés, et sans avoir besoin de \"convaincre\" qui que ce soit des avantages et de la nécessité d'avoir une identité décentralisée. Je pense que l'une des choses les plus compliquées est d'attirer l'attention, de captiver de nouveaux utilisateurs, l'univers Cardano est assez nouveau, qui dira Atala Prism, souvent les membres de la communauté eux-mêmes n'ont pas beaucoup de connaissances sur cette nouvelle forme d'identité, donc lier un projet qui existe déjà, j'ai déjà des utilisateurs et les amener à acquérir le DID sans commencer \"à partir de zéro\" est un excellent moyen de générer de nouveaux DID. Par conséquent, je pense qu'il s'agit d'une proposition à forte valeur ajoutée et qu'elle s'aligne très bien avec les objectifs poursuivis ici.", "q0r": 5, "q1": "L'équipe est certainement capable de réaliser ce projet. Nous disposons d'une description individuelle de chaque membre, ce qui nous permet de connaître leurs spécialisations formelles et les projets antérieurs qu'ils ont menés à bien en dehors et au sein de l'écosystème Cardano. Comme ils ont déjà fondé la plateforme Win Win (en plus d'autres projets, tels que les outils CA/vCA, etc.), nous avons des exemples pratiques de leurs capacités à transformer des idées en réalité. ), nous disposons d'exemples concrets de leurs capacités à transformer des idées en réalité. Il est impossible de ne pas faire confiance à la préparation de ceux qui ont déjà fourni d'aussi bons résultats et qui ont un parcours académique et une spécialisation aussi riches. Par conséquent, lorsqu'il s'agit de l'équipe, la confiance est de 100%. Ils ont également une feuille de route très détaillée sur ce qu'il faudrait faire pour aboutir au produit final, avec des subdivisions dans chaque phase, c'est-à-dire les tâches qui constitueraient l'ensemble. Certaines d'entre elles ont déjà été réalisées, comme l'indique le symbole du crochet, et nous savons quand et dans quel ordre les autres se dérouleront (elles les divisent en trimestres et classent chronologiquement ce qui se passe dans chaque période). De la manière dont il nous est présenté, il est possible d'avoir une pleine compréhension du processus à effectuer. Et enfin, en parlant de budget, l'argent demandé est très juste pour le niveau de complexité du projet, divisé en deux blocs : 18k pour les salaires, avec une moyenne de 2k par mois pour chaque professionnel impliqué, ce qui est une valeur cohérente, et 2k pour la diffusion. Il serait très intéressant qu'ils aient clarifié comment cette commercialisation se ferait. Je pense qu'il s'agirait d'un travail de diffusion de l'idée en interne, c'est-à-dire pour que les utilisateurs de Win Win, les médiateurs et les clients fassent leurs DID. J'aimerais comprendre comment ce processus se déroulerait. Mais c'est la seule observation que j'ai à faire. En ce qui concerne l'équipe, le scénario et le budget, nous sommes très bien informés, la proposition sera certainement bien gérée et nous avons un développement visible et financièrement équitable.", "q1r": 5, "q2": "Malheureusement, l'équipe a oublié de définir les indicateurs clés de performance. Nous n'avons pas d'informations directes ici sur la façon de mesurer les résultats, de contrôler si le projet a été développé comme promis. Cependant, il est possible de le vérifier par le biais du développement des étapes. Comme vous savez quelles étapes seront réalisées et de quelles tâches ces phases seront composées, il est possible de contrôler si les activités sont réalisées dans le bon ordre, de la bonne manière et si elles obtiennent les résultats souhaités. Dans ce sens, l'équipe pourrait préparer un rapport contenant des données de chacune des phases, des données partielles de l'ensemble, et les présenter à la communauté. Une façon très logique de vérifier si ce projet fonctionne est de contrôler le nombre de personnes qui utilisent la plateforme Win Win et qui ont fait des DID. Ce pourcentage indiquerait certainement si ce que nous recherchons a été atteint. L'équipe devrait également nous fournir de telles données. Enfin, je conclus : bien que nous n'ayons pas de KPIs directs tracés, en surveillant les phases et en contrôlant combien de DIDs sont générés à partir de Win Win, il est tout à fait possible d'auditer cette proposition.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 27, "ne": 15, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement chosen targets at creating a marketplace with provision for trustfull mechanism and dispute resolution to connect mediators to clients. The solution suggests integration of Atala prits being (a decentralized identity solution built on the Cardano blockchain), this way the the Decentralized IDs of the moderators can be verified by the concerned client this way there is lesser scope for fraudulent moderators in the marketplace. Also they have mentioned provisions for opportunity where organizations and universities and also certify people on the same this way it effectively addresses the issue. ", "q0r": 5, "q1": "The team has good number of software engineer who can get this proposal to reality as most of them have multiple years of experience in the relevant field, including experince in negotiation, Conflict Resolution dispute resolution domains adding better oversight over building such a marketplace they have also provided a well segregated phase wise plan of execution and corresponding timeline so the proposal likely to be completed and delivered efficiently.", "q1r": 5, "q2": "The proposal has detailed phase wise plan along with corresponding timeline for the same, so the progress of the project can be well monitored and funded based on pace with wich things progress. Also they have provided a decent fund breakdown yet a phase wise fund breakdown as a success measure wrt fund against work would have been great to audit the same, since they also have  a VCA in the team the proposal looks good for most of the part to understand and audit the same  ", "q2r": 4, "assessor": "z_assessor_16", "no_vca": 28, "ne": 2, "ng": 16, "nfo": 10, "vca_o": 1, "reply": "The rationale provided doesn't seem to match the scores given."}, {"q0": "The proposal is in the accordance with the challenge because it aims to implement DID with Atala prism on their platform (which is currently under development), and therefore contribute to its adaptibility. The goal is to connect mediators with their clients using the verified system of DID, which sounds nice, but there is no proof of demand (how many people would be interested in such a service) and it aims only to US marketplace. The impact of the proposal is lacking more supporting evidence. ", "q0r": 4, "q1": "The proposal contains a very detailed information of each team member which is sufficient to reach the desired goal. The budget seems reasonable - 2k / month / developers and project manager and the roadmap is set quarterly describing planned tasks to be done. From the proposal it is not clear whether they already have the required \"labor\" or they plan to hire them. ", "q1r": 4, "q2": "The key metrics are stated within the roadmap, and the solution is clear. Nevertheless, I am missing a rationale of why it is required. According to the guidelines, a clear problem description is required, but the proposal is rather describing what is going to be done, not what is wrong and needs to be fixed/corrected. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 27, "ne": 3, "ng": 24, "nfo": 0, "vca_o": 1}, {"q0": "These proposers want to build a plateform that will help resolve disputes before it reaches the legal system. This will be done by using DID. I think that the proposal has successfully identified a problem within the challenge. However, the proposal can be improved by adding more details such as examples and practical cases that can help us better understant the concept. All in all the proposal has given enough details to get a positive for the impact.", "q0r": 5, "q1": "This proposal has been funded in fund 6. This means that the proposal has been adopted by the community. The team seems on point but the linkedin profile is only available in an external link. Why not add it within the proposal?. This should be added to improve the feasability score of this proposal. Luckily for them I know a member of the team from the community. That's why I can give it a rating of 4. I would also like to see the progress of the team since the previous fund. To sum it up, I recommend to the proposers to add linkedin profile of the team members in the proposal. ", "q1r": 4, "q2": "The proposers have added a detailed roadmap that can help track the progress of the project. However I didn't see strong KPIs. They should be added in order to improve the proposal. Other than that, I think that the proposal can be audited easily.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 29, "ne": 2, "ng": 26, "nfo": 1, "vca_o": 1}, {"q0": "The proposal makes a lot of sense. It hopes to integrate DID into a mediation platform already under development. This will certainly give win-win a greater impact. In my opinion it is not an exact fit for the challenge brief but falls best under the \"Self-governance of Emergent Communities\" suggestion. ", "q0r": 4, "q1": "The team is highly qualified and was previously funded by catalyst. The team includes plutus and prism pioneers, and have been winners of multiple hackathons. The proposal itself seems like a straightforward prism integration (as straightforward as that can be) and I believe they have what it takes to be successful. ", "q1r": 5, "q2": "There is a clear roadmap that provides auditable milestones. Funding is not broken down but the total requested funds are modest and seem realistic. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 27, "ne": 1, "ng": 23, "nfo": 3, "vca_o": 1}, {"q0": "This product would definitely add value to the Cardano Ecosystem. The only issue is that this same team is present in so many proposals. If they can spread themselves so much the project will be effective. But this should be carefully considered. This proposal falls within the scope of the challenge brief .No key metrics and goals of the proposal have been stated clearly.   ", "q0r": 4, "q1": "The team is experienced and recognized in the Cardano Community.  Therefore they could have the skillset to do the project. The budget is also reasonable and the cost factors have been clearly laid out.", "q1r": 3, "q2": "There is a clear Roadmap and well laid out path to achievement.  the proposal provides a sensible and conductible plan for implementation. the proposal clearly explains  technical aspects like architecture, language and technologies if they are crucial for implementation. the proposer has not considered challenges and risks relevant to a successful implementation. ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 27, "ne": 1, "ng": 19, "nfo": 7, "vca_o": 1}, {"q0": "Decentralized economy need to evolve a reliable dispute resolution mechanism. Arbitration using Atala based identity is an unique proposal and there is a need to have such a mechanism. There might be arguments on usefulness of the same since in the face of it it looks as if both parties have to respect the decision of the arbitrator for this to be effective. However i feel that there is need to have this in the ecosystem. ", "q0r": 4, "q1": "The proposers have impeccable credentials and are pioneers in Cardano Ecosystem. The technical capability of the proposers have been demonstrated in the capstone projects during Cardano Summit.", "q1r": 5, "q2": "The cost is for hiring of developers. The project is expected to be developed in open source format. The arbitration code is likely to have associated benefits in terms of helping other projects in use of Atala. Therefore the progress and success of the project is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 24, "ne": 0, "ng": 18, "nfo": 6, "vca_o": 1}], "solution": "Intégrer Win-Win à Atala Prism afin que les médiateurs puissent être vérifiés par les DID et que les universités puissent délivrer des titres de compétences à leurs diplômés.", "experience": "L'équipe de Loxe Inc., groupe expérimenté et gagnant de hackathon des pionniers de Plutus et Atala PRISM, participants du programme PPBL de Gimbalabs."}