{"id": 384620, "author": "chrisr", "title": "Cardano Interop NOW", "url": "https://cardano.ideascale.com/a/dtd/384620-48088", "category": 26254, "amount": 28000, "description": "L'identité numérique décentralisée utilisant les VC et les DID est en plein essor mais fait face à des goulots d'étranglement au niveau de l'infrastructure. L'interopérabilité de Cardano va accélérer l'adoption.", "funded": 2, "upvotes": 65612281, "downvotes": 2169764, "votes_result": 63442517, "votes_cast": 240, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Wow. Permettez-moi de commencer par féliciter l'équipe pour cette idée extraordinaire. Non seulement cette proposition répond efficacement au défi, mais elle a le potentiel de permettre une adoption massive dans des marchés qui sont apparemment opaques et bureaucratiques. L'intégration des DID Cardano dans un portefeuille de confiance déjà utilisé par le gouvernement canadien changerait la donne pour l'écosystème. Comme le mentionnent les proposants, l'intégration de la blockchain Cardano dans les portefeuilles fiduciaires existants sera nécessaire pour accélérer l'adoption de masse. En ciblant un pays comme le Canada, et en rendant le système existant interopérable avec la nouvelle blockchain du futur, les proposants créent la confiance pour que d'autres pays occidentaux soient embarqués plus rapidement. Je ne doute pas qu'en cas de succès, ce projet pourrait changer la donne.", "q0r": 5, "q1": "Sur la base du plan présenté et des références de l'équipe, les électeurs peuvent être très confiants que ce projet sera mis en œuvre avec succès. La raison principale pour laquelle je suis hyper confiant est que le porte-monnaie existe déjà et est utilisé par le gouvernement canadien. L'intégration des DID Atala Prism dans ce portefeuille offrira une expérience transparente à l'utilisateur tout en améliorant l'accessibilité, la fonctionnalité et l'interopérabilité. Les utilisateurs (au Canada pour commencer) seront en mesure d'utiliser leur DID sur plusieurs plates-formes, contrairement à aujourd'hui où les DID hyperledger n'offrent essentiellement qu'une ou deux options (sites gouvernementaux). En créant un DID plus portable qui peut fonctionner entre les systèmes, le même identifiant utilisé pour les services gouvernementaux ou l'emploi pourrait également être utilisé dans d'autres secteurs comme le logement ou l'assurance. Les références de l'équipe sont très bien présentées et, en tant que CA, j'apprécie vraiment l'identification transparente des membres de l'équipe et de leur expérience. Les électeurs peuvent avoir confiance dans la capacité de l'équipe à tenir ses engagements et ce projet semble donc réalisable à 100%.", "q1r": 5, "q2": "Oui, les informations fournies sont suffisantes pour vérifier l'avancement et le succès de la proposition. Le fait que l'équipe se soit engagée à fournir un portefeuille numérique gratuit, open source, qui sera interopérable avec un portefeuille de confiance existant et la blockchain Cardano peut donner aux électeurs un très haut niveau de confiance dans le fait que le projet peut être suivi et audité de manière appropriée. En créant le porte-monnaie open-source, les membres de la communauté auront la possibilité d'interagir, de critiquer et d'engager le matériel avant son utilisation et d'aider l'équipe à réaliser sa vision. Les étapes claires et la livraison du produit fournissent également des mesures identifiables par lesquelles la communauté peut évaluer son processus et s'assurer qu'elle est sur la bonne voie pour réaliser ce qu'elle a prévu. Je vais certainement suivre ce projet et je suis impatient de voir où il va. Je vous tire mon chapeau.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This looks like a great project to bring an established, government approved DiD solution to Cardano. The costs is relatively low, seem like the sort of project we should be funding.", "q0r": 5, "q1": "The proposer already have this project working. This is about porting it over to a Cardano Wallet. They have the experience and should be able to deliver their plan. My biggest worry there is not marketing plan. How will they drive adoption? It is not enough to just build the technical solution.", "q1r": 4, "q2": "The proposal has clear deliverables against which progress can be audited. Whilst they have set the ambitious goal of enabling Cardano to compete as the preferred distributed ledger for adoption of decentralized digital identity globally, they have not set any specific metrics with goals against which success of this project can be measured. How many user in how many jurisdictions over what time frames? What about goals for government of corporate clients?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "I am huge on these kinds of projects because I work in immigration compliance and want to see passports, visas, and other compliance materials on a blockchain. It has to happen, and these projects are in roads toward those goals.", "q0r": 5, "q1": "Looks like a decent team! Love they provided LinkedIn links to their qualifications. A six person team with good qualifications is what I see from their links. Seems like a good mixture of experience.", "q1r": 5, "q2": "I think this team may be in the process of providing more material as time progresses according to the comment section from one of the project members, yet, the LinkedIn links and others seems to already provide enough KPIs and other variables to look for.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This proposal highlights the important problem of interoperability between Cardano and other providers of DIDs. Since the Hyperledger Indy network, based on the Sovrin Ledger, is already a trusted leader, a proposal to develop one wallet providing access to both networks would be extremely valuable.  Providing a gateway or link between DIDs issued on Cardano and verifiers on Sovrin, or vice-versa would encourage adoption and be extremely valuable to the Cardano community. The proposal emphasizes many times that the wallet would be freely available for users to download, which would aid with scalability. On the other hand, the repeated mentions of making the wallet free made me wonder about the long-term business model. Who will pay for the ongoing maintenance and development of a free wallet? This would be a question applicable to anyone with a wallet development proposal, but the frequent reminder that this particular wallet would be free prompted me to ask the question. ", "q0r": 5, "q1": "The proposal provides nice links to the profiles of the Team, who clearly have significant experience in the SSI industry, and have deep connections to the Cardano community. Chris Raczkowski provided a compelling fireside chat during the Atala PRISM pioneers program.  The budget is very moderate, particularly given the enormous benefit that such a wallet would provide. Since Chris was involved with the Pioneers program, he must be aware that the SDK is not yet public. However, there is no mention of this risk in the proposal, or how they would mitigate it in order to provide an open-source wallet. This gap is the only factor keeping me from rating this section with five stars. The clear links between the proposal team and IOG, and Chris's role in the PRISM pioneer program, are what is keeping me from giving an even lower rating, due to the importance of the SDK. ", "q1r": 4, "q2": "There is a road map provided, but the details are more aspirational statements than measurable KPIs. While inspiring, those statements do not provide a detailed plan for implementation.  It is not clear how someone could measure whether or not the wallet has succeeded in becoming \"the most trusted digital identity wallet\" or how they would assess whether or not the wallet has enabled \"Cardano to compete as the preferred distributed ledger.\" These are worthwhile goals, but they would be tough to use as auditing criteria.  It is also worth noting that someone had left a comment asking for these additional details during the feedback phase. ", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks to integrate Cardano into a proven SSI wallet - DIT. The problem being solved is the lack of interopability between established ID solutions and Atala Prism. The outcome of this project is a free, open source wallet built ontop of the DIT wallet that supports VC's anchored on Hyperledger Indy and Cardano Blockchains. This brings awareness and acceptence from the wider community. The project aligns nicely with this challenge to increase growth of the Cardano network. In terms of scalability the interopability and accpetance of this wallet will help it to scale beyond the reach of the average Cardano user. ", "q0r": 5, "q1": "The project team have a great deal of expertise and experience in this space which would lend to the success of the project. There's a team of 6 highly skilled people involved with experience in blockchain consulting, web developent and SSI integration. \r\n\r\nThe timeframe for the wallet integration is 3 months which is very reasonable as is the budget for this proposal with clear justification for each budget item. There might be argument for inclusion of more cost breakdown as there are some larger items in the budget. ", "q1r": 5, "q2": "The wallet will be avaialbe after three months via the google and apple app store. Community will clearly have the opportunity to audit this outcome via those platforms. However there are also really clear KPI's included in the project milestones and roadmap. It enables Cardano to compete as the preferred distributed ledger for adoption of DID globally and is well planned with clear delivery and outcomes. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 15, "ne": 5, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Portefeuille numérique open-source gratuit interopérable avec Hyperledger Indy et Cardano. Sans interopérabilité, il n'y a pas d'avenir pour l'identification numérique basée sur Cardano.", "experience": "La coopération stratégique entre IDLynx.com, AyanWorks.com et DigitalIdentityTrust.org offre une expertise de classe mondiale en matière de technologie, de gouvernance et de cas d'utilisation des SSI."}