{"id": 384835, "author": "mavster04", "title": "Health DAO", "url": "https://cardano.ideascale.com/a/dtd/384835-48088", "category": 26254, "amount": 28000, "description": "Les données relatives aux soins de santé sont la cible la plus populaire des pirates. Elles coûtent le plus cher, soit 408 dollars par enregistrement. Comment Atala PRISM peut-il aider à cet égard ?", "funded": 2, "upvotes": 110259046, "downvotes": 2081673, "votes_result": 108177373, "votes_cast": 285, "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Votre proposition d'idée était intéressante à lire. Merci de l'avoir partagée. Félicitations également pour les progrès réalisés jusqu'à présent\r\n\r\nJ'ai aimé l'idée générale, la proposition de projet, et l'ensemble des activités et des étapes définies m'ont semblé être une idée rationnelle, non seulement pour la valeur d'investissement demandée mais aussi pour la proposition de projet globale. De plus, l'idée et les structures du projet semblent bien conçues, et je serai également disponible en tant qu'expert dans ce domaine pour soutenir l'idée et l'exécution du projet. Il y a plusieurs cas d'utilisation différents liés à cette idée qui pourraient valoir la peine d'être considérés dans des étapes à plus long terme : les contrats de résultats pour les patients, les programmes d'éducation médicale certifiée, la gestion des contrats de pharmacoéconomie de la santé, et le traitement de l'inscription des données des patients dans les essais cliniques.\r\n\r\nMalgré tout, comme décrit précédemment, les hypothèses générales ont été prises en compte ainsi que les constructions de notion - je pense également que plus de détails devraient être partagés autour des principes de conception de l'interopérabilité des échanges d'informations de santé alimentés par la blockchain. Je suggère également que pour les prochaines phases, il faudrait accorder une attention supplémentaire à la confidentialité des données HIE, à la sécurité des données des dossiers médicaux électroniques et à leur stockage, ainsi qu'à tous les principes et concepts sous-jacents de la conformité réglementaire, de l'assurance qualité dans le contrôle des produits et des mécanismes de surveillance efficaces.\r\n\r\nVous trouverez ci-dessous quelques recommandations pour toutes les équipes de proposition, ainsi qu'une partie de ce cycle d'évaluation.\r\n\r\n Décrivez le problème avec des exemples plus concrets (en particulier dans les domaines des défis et des limitations du pdf présenté), si possible, et donnez un bref aperçu de la raison pour laquelle il s'agit d'un problème qui doit être résolu.\r\n\r\n Imaginez comment l'entreprise fonctionnera à l'avenir afin que vos utilisateurs ou vos futurs partenaires aient une meilleure compréhension de votre plan d'exécution futur.\r\n\r\n Fournissez des détails plus concrets afin que tous les lecteurs puissent le comprendre, même s'il est déjà à un bon stade.\r\n\r\n Comme moi, beaucoup de futurs partenaires et de sociétés de capital-risque supposeront qu'il existe un outil pour chaque cas d'utilisation, et que le problème est donc déjà résolu. Beaucoup de gens ne travaillent pas dans ce secteur et le perçoivent comme un défi mineur. Vous devez expliquer pourquoi il y a une opportunité, pourquoi le problème existe, avoir une ventilation des coûts et une conception de l'architecture efficaces et claires (y compris les protocoles cryptographiques à l'épreuve des zéros).", "q0r": 5, "q1": "Cette proposition sera mise en œuvre avec succès sur la base de l'expérience et des plans de l'équipe qui la propose, mais je suggère d'inclure plus d'informations dans la proposition concernant l'expérience pertinente du proposant dans la gestion d'initiatives de cette nature, ainsi qu'un plan et un budget plus détaillés pour la tâche décrite.", "q1r": 4, "q2": "En lisant la proposition, j'ai eu une autre question : Quelle est l'ampleur réelle de l'amélioration de l'efficacité et à quoi ressembleraient les futurs cycles d'investissement ?\r\n\r\nJe suggère une approche plus concrète pour comprendre le problème, pas une approche complexe et profonde, mais une approche ancrée dans la réalité. J'aimerais entendre des exemples de ce qui est bon dans le produit. Incluez plus de détails sur ce que fait la technologie, ainsi que des considérations concernant la gestion de l'identité, le consentement, l'exécution des contrats intelligents et tout modèle de gouvernance possible pour la phase d'exécution.\r\n\r\n- Considérations pour le marché américain, comprendre les entités couvertes (EC) qui peuvent utiliser ou divulguer les informations de santé protégées (PHI) d'un individu. La loi HIPAA prévoit de nombreuses façons d'utiliser et de divulguer les informations médicales protégées, également connues sous le nom d'utilisations et de divulgations autorisées par la loi HIPAA. Dans ce cas, une équipe juridique spécialisée doit être impliquée ou une représentation juridique spécifique des États-Unis. Évaluation globale de la gestion des risques en termes de GDPR et de HIPAA, car leurs objectifs sont fondamentalement différents (GDPR vise à protéger les PII des citoyens de l'UE et HIPAA, d'autre part, se concentre sur les organisations basées aux États-Unis qui traitent les PHI).\r\n\r\n- Pour l'avenir, le projet sera-t-il proposé dans le cadre d'un processus naturel de perfectionnement et de croissance par le biais d'un programme d'accélération ou en faisant appel à des experts de l'industrie qui peuvent atteindre des réseaux de contacts valables et former de futurs partenariats potentiels dans le domaine des produits pharmaceutiques et des sciences de la vie ? Je crois que l'équipe proposée possède déjà de très solides connaissances en matière de développement technique, mais je pense que le projet devrait avoir un expert interne en Product Owner/Business Development/ProductDesign.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 18, "ne": 12, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Cette proposition répond parfaitement à ce défi et accélérerait certainement l'adoption des DID via Atala Prism, ce qui aurait un impact significatif sur l'écosystème Cardano. La numérisation des dossiers médicaux continue d'être un cas d'utilisation souvent cité comme un excellent exemple de la façon dont les DID peuvent être mis en œuvre, et j'attendais avec impatience un projet comme celui-ci. Les informations médicales sont intrinsèquement personnelles et les fuites peuvent causer des dommages émotionnels et parfois physiques importants. La protection de ces informations personnelles est essentielle à tout déploiement et cette proposition a tout pour plaire. Je suis particulièrement impressionné par l'intégration des preuves de connaissance zéro, qui permettent de confirmer ou d'infirmer une information sans que les données réelles ne soient jamais partagées entre les parties, car nous devons veiller à ce que l'individu soit protégé et reste maître de son identité. Un autre aspect qui renforcera l'impact de la proposition est l'interopérabilité avec les systèmes médicaux existants, qui sera nécessaire pour une adoption massive. Un travail étonnant.", "q0r": 5, "q1": "L'expérience et le plan présentés me donnent une confiance totale dans la réussite de la mise en œuvre de cette proposition. Le livre blanc ci-joint est un trésor d'informations et tient la main du lecteur car il expose non seulement le problème et la solution mais fournit d'excellents exemples et graphiques pour expliquer comment ils vont atteindre leurs objectifs. Les votants peuvent se sentir très confiants dans le succès probable de la proposition étant donné le niveau de détail fourni pour chaque étape de l'élaboration de la solution, et les mesures identifiées pour aider à atténuer les risques potentiels. Aucune pierre n'est négligée et des contingences sont prévues pour permettre aux proposants de s'adapter à l'évolution du paysage juridique et réglementaire. L'équipe illustre également ses antécédents en faisant référence à des travaux déjà réalisés, sans oublier que l'outil qu'elle propose est déjà utilisé. Le budget semble également très raisonnable compte tenu du potentiel de ce projet.", "q1r": 5, "q2": "Oui, les informations fournies sont suffisantes pour vérifier l'avancement et le succès de la proposition, en particulier parce que la proposition se concentre simplement sur l'intégration d'Atala Prism dans la plate-forme Hippocrades existante. La proposition offre un calendrier et une feuille de route décents avec des livrables à chaque étape. Puisque le produit final serait l'intégration d'Atala Prism dans leur plateforme, il s'agit d'une mesure de succès oui/non qui est facile à mesurer pour la communauté. De plus, le court délai de 3 mois offre un retour rapide sur l'investissement, mais il peut continuer à porter ses fruits pendant longtemps en cas de succès. Un autre élément intéressant qui contribue à l'auditabilité est le composant DAO, car la communauté qui utilisera la plate-forme participera également à sa gouvernance et à ses opérations, ce qui offre des possibilités supplémentaires aux membres intéressés de la communauté de se joindre au projet et de façonner son avenir.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 13, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The project team is proposing to address the challenge of security risks involved in handling health care data. The sensitivity and risk of health care data being stolen by hackers is increasingly prevalent as healthcare is digitised globally and the value of this data increases. The proposal is to solve this through implementing atala prism DID and Zero knowledge proofs. The funding from Catalyst will allow them to implement DID into their suite of applications called curie. The suite includes a front facing set of applications, DID solution and healthcare API's. \r\n\r\nThe project aligns with this challengy by making use of Atala prism and establishing a DAO as a legal entity, facing growing problems with identity risk globally. The team demonstrates they have the requisite skill sets and have been working in healthcare since 2016 on a plethora of projects. Given the system is agnostic other health providers that already have systems can easily integrate into this one. Countries can instantly set up thier own decentralized Health Information Exchange since both Atala PRISM and Hippocrades are already in place. ", "q0r": 5, "q1": "Given the combination of skills and how established this team is in Healthcare it is highly likely this project will see succeed. They have already built a suite of healthcare applications that are being used by thousands of healthcare providers. Hippocrades will tie these platforms together. \r\n\r\nA relatively fast roll out given the scope, the team have projected to have their platform integrated within 3 months and have requested a reasonable amount of funding in their budget most of which is apportioned to wages and DAO registration. ", "q1r": 5, "q2": "The delivery dates are clearly defined and the community will be able to audit the use of Atala Prism in Hippocrades although it would be nice to see the progress through a public presentation. There is a clear roadmap and success can be measured through the uptake of the project and the legal registration of the DAO.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies and addresses a problem within the proposal but aiming to aid in acceleration of DID adoption within the healthcare sector.", "q0r": 5, "q1": "The proposers appear to have the requisite knowledge and skillsets required however it would be could to see references to specific team members already within the ecosystem. The requested funds are reasonable for the time frame allocated.", "q1r": 4, "q2": "The roadmap and KPIs whilst listed are rather vague and do not have any small clearly defined measurable goals therefore it is difficult to determine audibility.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Nos API de soins de santé peuvent compléter la puissance d'Atala PRISM afin que davantage de prestataires de soins de santé puissent facilement y adhérer.", "experience": "Nous travaillons actuellement sur une infrastructure de santé pour le Web 3.0 et il est prévu qu'elle soit mise en place comme une DAO. Nous travaillons sur la santé depuis 2016."}