{"id": 385057, "author": "elementarysoftware", "title": "Visual DID & Credential Builder", "url": "https://cardano.ideascale.com/a/dtd/385057-48088", "category": 26254, "amount": 47000, "description": "Tous les utilisateurs ne sont pas des développeurs et l'absence d'outils d'interface utilisateur intuitive empêche les non-développeurs de créer et de délivrer des accréditations aux propriétaires de DID.", "funded": 1, "upvotes": 48092443, "downvotes": 8330935, "votes_result": 39761508, "votes_cast": 150, "f6_no_assessments": 4, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Cette proposition ne se contente pas de relever efficacement le défi, elle le propulse à un tout autre niveau. La plupart des gens ont peur de la technologie blockchain parce qu'elle est trop difficile à comprendre, trop technique et trop écrasante. En supprimant cet aspect de la technologie blockchain tout en maximisant l'expérience utilisateur, c'est exactement le type d'actions qui accélérera l'adoption massive. En créant un outil qui permet aux non-développeurs (profanes) de tirer parti de ce que la blockchain offre (données sécurisées, auto-souveraines) par le biais d'une application Web, les auteurs de la proposition pourraient introduire une application majeure qui change la donne. Le fait que cet outil soit quelque peu générique augmente également son score d'impact car de nombreux groupes, secteurs et entités différents seront en mesure d'adapter le système à leurs propres besoins sans avoir à engager des développeurs supplémentaires. Cela devrait séduire de nombreuses entreprises et sociétés qui n'ont peut-être pas la capacité ou le désir de le faire, mais cet outil leur permet de participer. C'est génial !", "q0r": 5, "q1": "Oui, compte tenu de l'expérience et du plan présenté, la proposition a des chances d'aboutir. J'ai confiance dans le fait que le principal proposant est un pionnier d'Atala Prism et qu'il a une expérience directe du travail sur la blockchain Cardano. La description du problème et le plan présenté pour le résoudre montrent que l'équipe a une vision claire et qu'elle est capable de tenir ses promesses. J'aurais aimé voir des références plus explicites fournies par l'équipe, comme des comptes linkedin, des sites Web ou d'autres moyens, pour les électeurs. Bien que cela ne signifie pas que l'équipe n'a pas les qualifications requises, il peut être difficile pour certains électeurs d'accepter leur parole sans preuve.", "q1r": 4, "q2": "Oui, les informations fournies sont suffisantes pour vérifier l'avancement et le succès de la proposition, avec une feuille de route et une liste d'indicateurs clés de performance qui sont objectivement mesurables. Les proposants indiquent clairement dès le départ qu'il s'agit d'un projet communautaire et qu'il sera ouvert et disponible à de nombreux intervalles pour l'engagement et la critique de la communauté. Cela peut inspirer une confiance supplémentaire aux électeurs car il y a une transparence totale et une volonté d'apprendre et de s'adapter. C'est une indication forte que l'équipe prend au sérieux ce qu'elle promet et qu'elle est prête à chercher du soutien pour l'améliorer. Pour moi, c'est ce qu'est Catalyst et cela représente nos principes d'ouverture, de communauté et de progrès.", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Project would utilise and exponent Atala PRISM market share existing in the foreseeable future. Since listed 15 year+ old experience in software Dev and have been on the first course of Atala PRISM pioneer program, several critical areas should be included in your first six months delivery, for example: to work around and address if the end-user lost seed phrases or mnemonic or alternative KYC to support end-users. There are three parties in your entire vision - your team <---> me – a non-coder to use your project to issue DID types <---> end-users, as the project has mentioned, the project's success is laying at the end-user side. Therefore, it should explain how end-user data would be stored, and level of enforced encryption etc. ", "q0r": 4, "q1": "As mentioned in impact: your team <---> me – a non-coder to use your project to issue DID types <---> end-users. The project should have provided and explained most of the risk factors, any tangible and intangible elements that may hold back your project not deliverable per highlighted features in \"Main features of application\".", "q1r": 4, "q2": "I believe the Accelerate Decentralized Identity challenge and Atala PRISM would be a lot of interested parties will get involved in the next 6 and 12 months since everyone wanted to be first. The team promised it was Open-Source at the end, so the Cardano and Atala PRISM community would benefit a lot from the next six months of development. Assume 47k project does not address all proposed elements the community would learn from team or project mistake (if any) and moving on as Atala PRISM is up-and-coming areas to be accelerated.", "q2r": 5, "assessor": "z_assessor_661", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal attacks a critical problem – for DIDs to gain mainstream adoption, users need an easy way to access the technology. If the user interface described in the proposal is built, it would be a huge benefit to the Cardano ecosystem, as it would provide an easy way for people with use-cases to begin building their own prototypes, thus furthering the adoption of the Cardano technology. By creating an open source repository would allow the tool to scale further. It would be interesting to know the business model envisioned by the proposer. Who will pay to use the GUI or will it be made freely accessible to the community? ", "q0r": 5, "q1": "The proposer has had some experience with the Atala PRISM course. The proposal identifies the long wait time for credential issuance as an obstacle to user adoption, and proposes a solution.  However, there is absolutely no information given about the proposer, so it is impossible to assess whether or not she/he has the ability to build the tool described. Before providing 47,000 in funds, I would want to know more about the background, skills, and abilities of the proposer to assess the likelihood that they can complete the project. Creating a good user-interface is very hard, and it would be helpful to know how likely the proposal is to be able to deliver.  I tried googling the proposer's handle, \"Elementary Software,\" but the name is so vague that I couldn't find a clear hit. It would also be useful to know how this tool will interact with a DID wallet. Will it serve as a wallet to hold credentials? Or will it need to be interoperable with a wallet. In the latter case, which wallets are (or, more accurately, will be once they are built) compatible? ", "q1r": 2, "q2": "The KPIs are very specific and would be easy to measure. They are appropriate for measuring the success of the project, and also relate directly to the challenge brief. The roadmap is a bit vague, but conveys a high level plan. The Roadmap acknowledges that PRISM is not yet on the Cardano mainnet and links the publication of this project to that date that PRISM itself moves to mainnet. ", "q2r": 4, "assessor": "z_assessor_662", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal for providing a user friendly GUI and abstracting away the technical requirements of DIDs and Prism accurately identifies a problem and solution within the challenge and is very well aligned. ", "q0r": 5, "q1": "Whilst the team stated seems to hold the necessary experience to inact this task it is impossible to tell as no external links are given. I understand previous projects are not able to be mentioned due to NDAs but it would be good to see linkein or githubs handles for the team members in question. The funds requested seem accurate for 6 months work but once again it is impossible to tell as the number of team members is not mentioned and neither is the breakdown of labour. ", "q1r": 3, "q2": "The KPIs listed are well chosen and the roadmap is defined with the goal of an MVP by June 2022. As the first milestone is 6 months away it would be nice to see some form of monthly progress report to keep track of the project. ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Application de bureau permettant aux non-développeurs de créer et d'émettre (envoyer) des identifiants aux contacts DID avec une interface utilisateur graphique intuitive", "experience": "Pionnier de la première cohorte d'Atala PRISM, développeur ayant plus de 15 ans d'expérience professionnelle dans le domaine des applications client IU et des applications serveur."}