{"id": 340138, "author": "WADA(West Africa Decentralized Alliance) ", "title": "DeFi and Microlending for Africa", "url": "https://app.ideascale.com/t/UM5UZBfaC", "category": 25874, "amount": 90000, "description": "", "no_assessments": 31, "rating": 3.774193548387097, "assessments": [{"question": 4, "note": "I think this project expands on the overarching goals set up by Charles Hoskinson and the twam at IOG vision of improving the lives of the underbanked.  There are some other considerations needed like how this proposal affects their security and the access to these platforms. Mobile phone is clear point but if a phone is stolen, hacked or lost how can that affect the user.", "rating": 4}, {"question": 4, "note": "Micro loans and DeFi are niches aligned with Cardano's mission, but technically I see no sense in limiting the scope of the challenge for Africa. The needs for financial services in Africa are largely due to the large number of unbanked and exploratory lines of credit. DeFi solutions for this type of problem require dapps and undercolateralized loans and to obtain these types of loans, decentralized credit score projects are required. The point is that the solutions to this problem are not geographically restricted, so limiting the scope of the idea to the African continent doesn't make sense. DeFi has no geographical boundaries. What prevents the use of DeFi for unbanked people and people with less purchasing power is the lack of undercolateralized loans and this will only happen with credit scores and preferably with the help of DIDs.", "rating": 3}, {"question": 4, "note": "There is a high demand for microlending solutions on the African continent.\r\nIt would significantly improve users' chances of becoming economically independent.\r\nThe potential impact of this is extremely large for both users and the community, who would be enabled to create these DeFi and microlending solutions. ", "rating": 5}, {"question": 4, "note": "The documentation attached demonstrates how Cardano can solve real problems in the daily life in African countries like Kenya. ", "rating": 5}, {"question": 4, "note": "Helping developing countries find better financial solutions is one of Cardano's core missions, and this challenge obviously addresses that ", "rating": 3}, {"question": 4, "note": "It is not critical, although the idea is very good.", "rating": 2}, {"question": 4, "note": "I strongly support this as a Challenge Setting. Driving this together with competent global and local experts can be a powerful trigger for seeing Cardano-based applications emerging in Africa. The USD 90.000 looks reasonable, even though I am not sure how this Challenge Setting would be approached in a more detailed view.", "rating": 5}, {"question": 4, "note": "Here is the framework for how I estimate the level of IMPACT for the new Challenge for Fund6:\r\n1) Is this a wicked problem that has not been addressed in previous challenges?\r\n\r\nAfrican countries are uniquely positioned to take advantage of digital fintech solutions because so much of the financial infrastructure is build across the mobile networks. This is a huge area of opportunity and is a unique focus that would set Cardano apart.\r\n\r\n2) Is this addressing a \"green pasture\" opportunity that could improve the well-being across a major region or globally?\r\n\r\nYES! See previous comment.\r\n\r\n3) How much will the requested funds catalyze this effort and produce a meaningful result over the next few years?\r\n\r\nThe funds requested are modest. It would be a good place to start as a \"seed round\" to see what kind of projects come as a result. ", "rating": 5}, {"question": 4, "note": "Micro-lending is really a good opportunity but you should target mobile phone markets. ", "rating": 5}, {"question": 4, "note": "Really interested in seeing how this project turns out. The need for people in Africa to rise from the shackles of poverty can not be overstated. This is a huge problem that Cardano is trying to solve. ", "rating": 5}, {"question": 5, "note": "I think the proposer set up multiple links and reference to understand the difference in dynamics between different countries and in particular the region. I think this project can be feasible.", "rating": 5}, {"question": 5, "note": "I don't believe in the feasibility of the challenge at the moment, because in order for Cardano to have DeFi dapps that can provide undercolateralized loans, profile assessment / credit scores projects are necessary. In addition, in order to have functional dapps, some basic blocks in DeFi still need to be created, such as oracles. Liqwid itself is a possible solution to this problem, but it is still in development and it should still take a few months for its first version to be ready. So, for this challenge to be feasible, we need Goguen's delivery, money market dapps operating (Liqwid for example), functional oracles and credit score projects. It may be that these projects exist during the implementation of the proposals arising from this challenge, but it is an uncertainty that compromises the viability of the challenge.", "rating": 2}, {"question": 5, "note": "As you have relevant experience and a team already in place, I see no issues with the feasibility that this proposed project would be implemented. ", "rating": 5}, {"question": 5, "note": "DeFi dApp solution can now be developed by Cardano users with programming skills. I believe that potential support could come directly by IOHK if the project is really worth. ", "rating": 5}, {"question": 5, "note": "it is a big mission and needs a huge budget and native token to get to a level to achieve this scale best to either migrate existing platforms or focus resources on liqwid mission ", "rating": 1}, {"question": 5, "note": "I believe that there is a significant and engaged Africa based Cardano community, which is essential to address this challenge", "rating": 5}, {"question": 5, "note": "The community has the capacity to address technical side of the proposal. However, a much more difficult legal aspect of the idea has not been mentioned in the proposal. As loans must be repaid, there needs to exist a way of carrying it out within the local legal framework. To put it simply, the repayment obligation must be enforceable. This is well beyond the scope mentioned in the proposal.", "rating": 1}, {"question": 5, "note": "I think that it will be very important to bring the right people together during such a Challenge Setting. Before creating any kind of dApps, I would expect a short-, mid- and long-term Masterplan as goal for this activity. Otherwise we might just jump on creating some kind of applications, which do not meet the complex technical economic, political and social requirements. I think that the involved proponents of this idea are well aware of that, therefore my Yes.", "rating": 4}, {"question": 5, "note": "My framework for this assessment for how suitable this challenge is as follows:\r\n1) Product-market fit: is this a wicked problem that is has a lot of demand, is uniquely suited to Cardano or if done successfully will really set Cardano apart?\r\n\r\nAs stated before there is tremendous synergy between the technology that Cardano provides, the existing mobile banking infrastructure, and the work that IOG is doing in various countries. This is a great area of opportunity that intersects in multiple areas to achieve Cardano's vision to bring more and more\r\n2) Circle of competence: is there enough competence and passion in the ecosystem so proposals will have great leadership and synergy between team, partners and/or community?\r\n\r\nYes, Cardano is already attracting talent, building capacity and collaborating with various communities in Africa. This is at the heart of what Cardano is aiming to achieve and is a great community focus.\r\n\r\n3) Accelerators: Are there clear network effects or other advantages that will drive success?\r\n\r\nThere might be some headwinds as right now the Africa focused initiatives keep getting passed over for more global solutions. I think a small challenge towards Africa-centric implementation would help create inertia in this area. ", "rating": 5}, {"question": 5, "note": "We probably have the skll to address the challenge but you should aim at mobile phone développement. ", "rating": 3}, {"question": 5, "note": "The community is always trying to help as much as possible and this would be a great avenue to do so. I believe this project, given the people behind it can soar. ", "rating": 4}, {"question": 6, "note": "There are clear delineated metrics, more emphasis on how can these assets can be protected from the shortcoming of the method of access which can be dangerous. Holding your personal banking on your phone may not be as protected and vulnerabilities could be exploited.", "rating": 4}, {"question": 6, "note": "I don't think the metrics presented and the definition of success are clear. The metric for launching 3 projects in the next 3 fundind rounds seems to be unrealistic, because if the challenge is accepted, it will only enter the second funding round and would have only 6 weeks to be delivered, remembering that there are several obstacles to the implementation of micro lendind in DeFi and these obstacles can delay those proposals.", "rating": 2}, {"question": 6, "note": "I'd like to see an adapted roadmap for this.\r\nOther than that, the proposal was well substantiated and the requested funds is reasonable for a project of this magnitude. ", "rating": 4}, {"question": 6, "note": "Key metrics are clear in both timings and quantities. ", "rating": 5}, {"question": 6, "note": "dApp creation and user adoptance are appropriate success criteria for this challenge", "rating": 4}, {"question": 6, "note": "The success criteria and metrics do not mention the effort of making the solution feasible within the existing legal framework.", "rating": 1}, {"question": 6, "note": "More work needs to be done here. This needs a real MASTERPLAN and then consequently aligned activities, which can be measured. Trusting that this is clear to everyone, I suggest a Yes also here.", "rating": 4}, {"question": 6, "note": "My framework for how measurable this challenge is as follows:\r\n1) Is the wicked problem described with clear intent so that the community is inspired and challenged to bring their best ideas?\r\n\r\nYes, this is a wicked opportunity with very large upside.\r\n\r\n2) Are there clear goals and metrics that guide proposals towards meaningful results?\r\n\r\nThe metrics are a little sparse and restrictive. Rather than setting limits (like the 50% user adoption), I would prefer to see metrics that focus more on transformative results (like # of users adopted, # of users that have financial access where they previously did not have access (first loan, first investment, first savings account)\r\n\r\n3) Are the requested treasury funds well matched to support multiple game-changing proposals within the scope of the challenge?\r\n\r\nYes. I think the smaller amount is a good idea to start getting the flywheel going without committing too much of the community pot. ", "rating": 4}, {"question": 6, "note": "The problem i have with this propsal is that there is the WADA proposal that is closely linked to it. It seems to me you are doubling the funds request (though to be fair they are not on the same level or same application). HOWEVER, you should add or clearly state what your link between your proposal and the WADA proposal is linked.", "rating": 3}, {"question": 6, "note": "Fortunately we are able to monitor the project's progress with the transparency that is being provided through the network. ", "rating": 4}], "videos": [], "media": [], "importance": "Microlending and DeFi dApps targeted specifically to the African context & based on historical cultural norms will accelerate user adoption", "success": "Businesses are confident to submit well-researched proposals that address the African micro-lending and decentralized finance context"}