{"id": 340258, "author": "Ronin", "title": "Cardano Web Hub", "url": "https://app.ideascale.com/t/UM5UZBfcA", "category": 25874, "amount": 25000, "description": "", "no_assessments": 24, "rating": 2.9583333333333335, "assessments": [{"question": 4, "note": "I think the challenge is really good and the incentive is a good way to promote someones time in the task at hand. I think for long term I could imagine sort of a Cardano AI cortana type that answers all of the relevant Q&As, expanding on any and all possible questions and new questions are added and answer by the experts in IOG which would go onto the AI own library of knowldge.", "rating": 4}, {"question": 4, "note": "This will be absolutely necessary to inform new users that are unfamiliar with decentralised system mechanics.\r\n\r\nBy translating such a landing website in several languages, it would be more accessible but also more familiar. ", "rating": 5}, {"question": 4, "note": "Long term strategy: as Cardano community expands, the ability to reach non-english speakers is fundamental. ", "rating": 4}, {"question": 4, "note": "I believe that the challenge is in line with Cardano's mission, but there are already websites that are references and serve as onboard channels for the general public, to understand the importance of this challenge I think it is important to describe where current websites are \"failing\" and where they could improve, because opening a challenge without specifying what the improvement needs are makes the idea less solid. Cardano.org recently underwent an update due to the Renovare project, which dealt with a branding refresh made by Mccan.", "rating": 3}, {"question": 4, "note": "There are already some inputs going in similar direction, other inputs also call for a marketing Challenge Setting. I would see this as part of such a bigger Challenge Setting. Creating a WEB HUB and/or main landing page is useful, but needs to be handled in context and orchestration with other activities. ", "rating": 3}, {"question": 4, "note": "it makes a worthy point, in which i can agree on having a more dedicated 'portal' designated as entrance to the cardano community. If well executed could have a major impact on Cardano Adoption going forward.", "rating": 4}, {"question": 4, "note": "Here is the framework for how I estimate the level of IMPACT for the new Challenge for Fund6:\r\n1) Is this a wicked problem that has not been addressed in previous challenges?\r\n\r\nThis is kind of a narrow challenge seems self-contradictory. A hub is a form of centralization and generally requires coordinated architecture.\r\n\r\n2) Is this addressing a \"green pasture\" opportunity that could improve the well-being across a major region or globally?\r\n\r\nI think it is important to provide high quality, accessible resources to communicate the work and value of Cardano. However, this challenge seems a little fragmented so it may be difficult to inspire coordinated, synergistic projects.\r\n\r\n3) How much will the requested funds catalyze this effort and produce a meaningful result over the next few years?\r\n\r\nFor the target number of proposals (10), the funds requested seem very low. ", "rating": 1}, {"question": 4, "note": "This project seems simple enough to execute but the problem here is the lack of information on how this project will be executed. ", "rating": 3}, {"question": 5, "note": "I believe the community at large has the full resource to make a project like this work for the betterment of the network.", "rating": 5}, {"question": 5, "note": "Given that the community is of a global nature and previous calls to create a web hub like this, it is very feasible to get community backing for this challenge proposal.\r\nThe requested funding is modest. Will this cover everything to develop? ", "rating": 4}, {"question": 5, "note": "I doubt that the effort of the community can be focused right now on creating a web hub, differentiating the reach, while we already have several channels (telegram, discord...) to reach people, in different languages. The capacity to reach people is already in place. the issue is (maybe) to find volunteers to translate in less-used languages ?", "rating": 2}, {"question": 5, "note": "Recently the Cardano brand underwent a branding refresh, through the Renovare Project carried out together with Mccan, with which the community now has access to a new Cardano.org. It is not clear that it is feasible to have a challenge with this relatively low budget. We need to better understand what improvements this new Web Hub could have over current options to understand whether the budget fits the idea.", "rating": 2}, {"question": 5, "note": "For the described limited scope (which sounds to me more like an application proposal), we definitely have all the required capabilities in the Cardano community. I see this only useful in a bigger context.", "rating": 3}, {"question": 5, "note": "It should be fairly doable by the developers in our community! If they are well coordinated. ", "rating": 5}, {"question": 5, "note": "My framework for this assessment for how suitable this challenge is as follows:\r\n1) Product-market fit: is this a wicked problem that is has a lot of demand, is uniquely suited to Cardano or if done successfully will really set Cardano apart?\r\n\r\nIOG is heavily focused on good documentation, so I'm not sure what the value-add of this challenge would be. I think multi-language could be valuable, but there is already another challenge specifically focused in that area.\r\n\r\n2) Circle of competence: is there enough competence and passion in the ecosystem so proposals will have great leadership and synergy between team, partners and/or community?\r\n\r\nWe have great communicators in the Cardano community. I just am concerned that the challenge is too fragmented to coordinate positive action and talent in this area.\r\n\r\n3) Accelerators: Are there clear network effects or other advantages that will drive success?\r\n\r\nSee previous comment", "rating": 2}, {"question": 5, "note": "Lack of information is the bane of this project's existence. Please provide a landing page or a github repo for us to look at.\r\n", "rating": 2}, {"question": 6, "note": "A more defined metrics as to the type of portal in mind or technology deployed, is it a chatbot, video presentations, documents or a social network and how can these promoters validate that their approach has gained traction as well as data collected to reward the incentives.", "rating": 3}, {"question": 6, "note": "A clear roadmap will be needed to build this.\r\nThe metrics are set correctly with concrete figures. ", "rating": 4}, {"question": 6, "note": "The objective is clear, but the fastness of the creator(s) might have a negative impact on the final quality of the Hub", "rating": 3}, {"question": 6, "note": "The definition of success and key metrics are not sufficient to assess the success of the challenge. In reality, no metrics have been described to indicate whether the new Web Hub would be an effective option.", "rating": 1}, {"question": 6, "note": "A simple metrics for a simple scope is proposed. Not at all described is the governance of all this. Who will select the 'winner' ? More details required. No clear Yes or No from my side. ", "rating": 3}, {"question": 6, "note": "Although a very nice idea, I think it's a very specific fund where it's just basically itself almost a proposal. In my opinion we shouldn't overload the google browser with all these kinds of entry points for Cardano. I think it would be a better fund to upgrade/Revamp the 'portals' we already have. ", "rating": 2}, {"question": 6, "note": "My framework for how measurable this challenge is as follows:\r\n1) Is the wicked problem described with clear intent so that the community is inspired and challenged to bring their best ideas?\r\n\r\nAs stated previously, the challenge is a little narrow and fragmented.\r\n\r\n2) Are there clear goals and metrics that guide proposals towards meaningful results?\r\n\r\nThe metrics do not clearly outline meaningful results that would set Cardano apart. Number of proposals and quick funding does not necessarily indicate a good or meaningful impact.\r\n\r\n3) Are the requested treasury funds well matched to support multiple game-changing proposals within the scope of the challenge?\r\n\r\nThe funds are really almost enough for a few projects. It seems better suited for an individual proposal rather than an entire challenge. ", "rating": 1}, {"question": 6, "note": "No credentials provided to know if you are capable of executing this project. Would love to see more. ", "rating": 2}], "videos": [], "media": [], "importance": "A global multilingual Cardano Web Hub is critical for an easy introduction and access to the ecosystem´s online resources.", "success": "Web designers submit proposals for Web Hub in visual /interactive mode, addressing challenge brief."}