{"id": 340273, "author": "Carlos Hernandez", "title": "Success Tracking", "url": "https://app.ideascale.com/t/UM5UZBfcP", "category": 25874, "amount": 100000, "description": "", "no_assessments": 23, "rating": 3.9565217391304346, "assessments": [{"question": 4, "note": "Open accountability of funds spend will potentially keep proposal winners more on task with successful completion, and in the future allow new proposers the opportunity so see what funds are spent on what aspects of projects they are setting up themselves. (accurate budget preparation)", "rating": 5}, {"question": 4, "note": "This challenge is crucial to Cardano's mission. Currently the IOG is in charge of \"auditing\" the funded proposals and disseminating information about the progress of these proposals, but in the future we will need to decentralize the audit process, since the aim of Catalyst is for the community to guide the process, in addition to the number proposals will increase significantly and we will need tools and people to develop solutions.", "rating": 5}, {"question": 4, "note": "It is essential for a community to have a decent view on the return of investment (ROI).\r\nHaving a web based dashboard like this would stimulate better proposal formats and idea quality, as successful investments would be taken as examples. ", "rating": 5}, {"question": 4, "note": "I believe this is a critical mission to improve the visibility and accountability of projects ", "rating": 5}, {"question": 4, "note": "I think this is important topic but not as much as to set it as separate challenge. A solution for this might be just a project submitted to more general category.", "rating": 2}, {"question": 4, "note": "I like the idea as currently it is hard to track funded projects. We need some sort of system to hold people accountable with the community's  money.", "rating": 3}, {"question": 4, "note": "I do support this idea. Instead of calling it 'Success Tracking', our innovative start-up projects might also need coaching and guardian angles. Book-keeping and success tracking is too passive an approach for me. Such an coaching/auditing setup could become another valuable part of our emerging self-governance structures. Nevertheless, I support this idea.", "rating": 4}, {"question": 4, "note": "Here is the framework for how I estimate the level of IMPACT for the new Challenge for Fund6:\r\n1) Is this a wicked problem that has not been addressed in previous challenges?\r\n\r\nNICE! An evidenced based blockchain needs an evidence based treasury. Catalyst is a great starting point, but I think focused work in this area is a great idea and vital to the long term success of the Catalyst.\r\n2) Is this addressing a \"green pasture\" opportunity that could improve the well-being across a major region or globally?\r\n\r\nClear informatics, tracking and communication of success are what set the great projects apart from the rest.\r\n3) How much will the requested funds catalyze this effort and produce a meaningful result over the next few years?\r\n\r\n100K seems like a fair use of funds. It is a meaningful amount to inspire serious proposals while also allowing room for other meaningful challenges in Fund6", "rating": 5}, {"question": 5, "note": "This will be up to the community to determine the areas that are requested for accountability, and up to the winners to fill in accurate accounting reports (honor system, for a while)", "rating": 4}, {"question": 5, "note": "Some initial audit discussions have already started among Catalyst members. I believe that the feasibility of this challenge is more linked to hard work and commitment than technical barriers, so I think the challenge is feasible.", "rating": 4}, {"question": 5, "note": "Given there is a high demand in the community to track investments, I foresee no problems finding support to implement this challenge.\r\nThe 100000 USD pricerange is too steep. ", "rating": 4}, {"question": 5, "note": "it is hard to tell if the will exists as I have been using IdeaScale and involved in catalyst since fund 1 and it is not very easy to get accountability or track deliverables of funded projects also alot of projects ask for large funding so the ability to pay in installments as these projects achieve there goals makes alot of sense and would add a layer of protection for treasury funds ", "rating": 4}, {"question": 5, "note": "Definitely, this is well within the capacity of the community.", "rating": 5}, {"question": 5, "note": "A clear focus on quality over quantity is required and any founder or founders of submissions I believe should first be completing an online Project Management course ran by the CF and teaching or using existing online infrastructure to propagate the skills set required to manage a grant funding proposal ", "rating": 3}, {"question": 5, "note": "Knowing this from many years of professional experience, this is a very important success-factor. Again, I promote to combine success tracking with active coaching. It might be rather easy to  find the right experts fro the technicalities of such a controlling system, the real challenging part will be to grow this from controlling to active success-maximizing.", "rating": 3}, {"question": 5, "note": "My framework for this assessment for how suitable this challenge is as follows:\r\n1) Product-market fit: is this a wicked problem that is has a lot of demand, is uniquely suited to Cardano or if done successfully will really set Cardano apart?\r\n\r\nGiven the great amount of interest and participation in Catalyst already, I think there will be high interest and activity on this challenge. It is also very clearly articulated and opens the door to a lot of creativity and energy.\r\n\r\n2) Circle of competence: is there enough competence and passion in the ecosystem so proposals will have great leadership and synergy between team, partners and/or community?\r\n\r\nAs this naturally builds on the work that Catalyst is already doing, I think there should be a lot of support and synergy.\r\n\r\n3) Accelerators: Are there clear network effects or other advantages that will drive success?\r\n\r\nSee previous comments. ", "rating": 5}, {"question": 6, "note": "See above, Some good ideas will certainly crop up from the population on what and how to address accountability, but once developed and agreed upon, allow for awesome returns.", "rating": 4}, {"question": 6, "note": "The definition of success and the metrics described are reasonable and would help the community to get feedback on the funded proposals, but due to the lack of numerical metrics, the evaluation could be subjective.", "rating": 4}, {"question": 6, "note": "A general roadmap of this web based software development would both serve as an example of what you mean with success tracking and as a means to assess progress. ", "rating": 3}, {"question": 6, "note": "yes but more input is needed depending on the final product which will not happen overnight it will evolve over time I think the amount requested is high and should be broken down into 3-5 payments as concrete and measurable deliverables are met by the project ", "rating": 3}, {"question": 6, "note": "I have an impression the goals indicate spending too much effort on monitoring Catalyst itself. Seems to me like a gateway to inbred solutions. Having multiple self-monitoring tools and experts on what is the Catalyst projects' status looks like building excessive bureaucracy instead of creating projects that reach outside our community.", "rating": 2}, {"question": 6, "note": "Some success criteria are outlined and examples for metrics are given. I think that much more thought needs to go into this. I nevertheless support this idea.", "rating": 4}, {"question": 6, "note": "My framework for how measurable this challenge is as follows:\r\n1) Is the wicked problem described with clear intent so that the community is inspired and challenged to bring their best ideas?\r\n\r\nThis is a very well framed challenge. I would really like to see what comes of it!\r\n\r\n2) Are there clear goals and metrics that guide proposals towards meaningful results?\r\n\r\nThere are two metrics that are simple, meaningful and challenging. Very good job at focusing efforts towards a common purpose.\r\n3) Are the requested treasury funds well matched to support multiple game-changing proposals within the scope of the challenge?\r\n\r\nYes. I think it is a very well balanced request. Enough to signal serious intent and catalyze activity without taking over the entire treasury with important but more \"navel gazing\" type of work.  ", "rating": 5}], "videos": [], "media": [], "importance": "Knowledge of the progress on funded proposals can serve useful as a community reference, help determine ROI, and help with adoption.", "success": "A thriving ecosystem of well-informed community members ready to answer any questions they may receive about a catalyst funded project."}