{"id": 340594, "author": "Ronin", "title": "Nation Building Dapps ", "url": "https://app.ideascale.com/t/UM5UZBfhg", "category": 25874, "amount": 240000, "description": "", "no_assessments": 14, "rating": 3.857142857142857, "assessments": [{"question": 4, "note": "The proposed challenge is aligned with Cardano's mission, as Cardano has been looking for this type of solution for a few years through integrations with governments from different countries.", "rating": 5}, {"question": 4, "note": "It's a great way to incentivize opportunities in the space for developing nations to establish a foundation to a system interconnected in the blockchain. It is a great way to approach the challenge of building right from the ground the layers needed for the rest to be built on. The challenge is quite critical in the community goals to becoming more thna just a cryptocurrency but a holistic network where assets, identity and information is decentralized for the betterment of all.", "rating": 5}, {"question": 4, "note": "This proposal connects wonderfuly to utilising Atala PRISM. Blockchain technology excells at data management. ", "rating": 5}, {"question": 4, "note": "little optimistic considering what IOHK has come up against in Africa doing just this exact same game ", "rating": 3}, {"question": 4, "note": "Provided that this starts out with creating a clear MASTERPLAN (not just listing a bunch of dApps), I strongly support this proposal. Supporting the building and re-building of governmental systems in emerging countries is definitely easier than pushing this into US or EU. The amount outlined here USD 240.000 is rather high, but under the condition that we make a careful setup for this Challenge Setting, it is definitely worth doing it.", "rating": 5}, {"question": 5, "note": "As can be seen from Cardano's negotiations with different governments in different jurisdictions, the implementation of blockchains takes a relatively long time due to the bureaucracy involved. This is one of the reasons that makes me skeptical about the feasibility of this being achieved in the time proposed in the challenge and the possibility of implementing it in 20 different countries.", "rating": 2}, {"question": 5, "note": "The community has the capacity and connections present to build upon an initiative. This solution could be structured in a way that it can be deployed within a short timeframe.", "rating": 5}, {"question": 5, "note": "Given the size of the proposed challenge, the funding amount is justified.\r\nI expect a lot of community enthusiasm involving this challenge. Especially since the recent 'birds' hype. ", "rating": 4}, {"question": 5, "note": "I dont think you would get even close on that budget maybe I am wrong just trying to be realistic here millions of USDs would be required for state level lobbying and over a long arc of time assuming u has a direct family connection to the elite so that you could bribe them ", "rating": 2}, {"question": 5, "note": "Quite a challenge to find the right people here, but the Cardano community has such a diversity, that I see this rather positive. There are also strong synergies with other ideas such a the one of engaging with UN and other Important governing bodies. We can definitely handle this, even though it is not simple and easy.", "rating": 4}, {"question": 6, "note": "The definition of success and metrics presented have the full capacity to indicate the success of the challenge, however I believe that the metrics presented are extremely ambitious and difficult to be achieved, given Cardano's difficulty in establishing partnerships with local governments in years of work.", "rating": 2}, {"question": 6, "note": "Key metrics are quite interesting and the incentive would aid in the deployment of such projects. Good luck its a good strategy.", "rating": 5}, {"question": 6, "note": "There are clear metric goals set, yet there is room for improvement if these metrics are also converted in a general roadmap. ", "rating": 3}, {"question": 6, "note": "The author has invested some thought, even though some adoption-oriented metrics might be achievable only in the longer term. I think that this is important and I support this idea.", "rating": 4}], "videos": [], "media": [], "importance": "For the poor nations with no foundations to stand on, Government Dapp solutions will be the building blocks enabling sustainable prosperity", "success": "Wide spread adoption of Dapps by dozens of governments across developing nations, in collaboration with LCCs and International Partnerships"}