{"id": 340587, "author": "Leonardo koshoni", "title": "Credit unions and co-operatives ", "url": "https://app.ideascale.com/t/UM5UZBfhY", "category": 25874, "amount": 50000, "description": "", "no_assessments": 13, "rating": 3.0, "assessments": [{"question": 4, "note": "I see that one of Cardano's missions is to offer banking services to unbanked people, but it is not clear in the description of the challenge what the importance / relevance of credit unions would be, since DeFi would be used as a \"back-end\". DeFi alone means unearthing, cutting red tape financial services through decentralized protocols and dapps, inserting credit unions in the middle would increase friction / decrease productivity, no matter how much it is claimed that credit unions have no interest in profit, maintaining this structure involves costs that could be passed on to the consumer or absorbed by the credit union, which makes me question the need to insert them in this medium. I recommend that the proposer explain the importance of having a credit union in the process, starting from the point of view that DeFi only requires a smartphone and perhaps a DID registration for a decentralized credit score.", "rating": 2}, {"question": 4, "note": "It is a great initiative and pivotal to achieve Cardano's vision for underbanked nations and individuals. It's very important to create this type of developments for less tech savvy parties involved. I can see the need for such a challenge to be a topic of address for the wider community.", "rating": 5}, {"question": 4, "note": "This is not about providing access to a lending service, but to maximise profit in a shift from the providing institution to the lender.\r\n\r\nAs I understand the proposal, it is not about a shift in equal share, but to overhaul all profit. This is not in the vision of Cardano as it strifes for a win-win situation at all times.\r\n\r\nThis proposal could be improved by reformatting it to a profit model of equal share for all parties. ", "rating": 2}, {"question": 4, "note": "very big mission and very small budget not possible to achieve the required scale this is more for established players and they will migrate to cardano ", "rating": 1}, {"question": 4, "note": "Here is the framework for how I estimate the level of IMPACT for the new Challenge for Fund6:\r\n1) Is this a wicked problem that has not been addressed in previous challenges?\r\n\r\nYes. This is a unique challenge that seems like it would be an important \"lego\" in the Cardano toolkit.\r\n\r\n2) Is this addressing a \"green pasture\" opportunity that could improve the well-being across a major region or globally?\r\n\r\nCredit unions and coops are typically a great part of their communities, so building bridges to those financial institutions seems like a great challenge that would yield interesting collaborations.\r\n\r\n3) How much will the requested funds catalyze this effort and produce a meaningful result over the next few years?\r\n\r\n50K seems a little low. But could be good for some initial seed money. This is a challenge that will probably become more relevant in a 3-5 years as digital identity and blockchain matures. ", "rating": 5}, {"question": 5, "note": "For credit unions to establish a model that uses DeFi as a back end, we need functional DeFi protocols at Cardano, today this is still being developed, it is still premature, in addition, regulatory obstacles need to be assessed for each jurisdiction, the viability of challenge would depend on these two complex aspects, in addition the very existence of a credit union needs to be more detailed, as in theory DeFi removes the need for this type of intermediary. I recommend that the proposer clarify the points mentioned so that we can better understand the feasiability of the challenge.", "rating": 2}, {"question": 5, "note": "There is widespread passion and interest in the community to kickstart an initiative that delivers such solution to this challenge. I believe passive income of staking adas provide a type of return for investors, how we educate the mass on how to understand this value can provide an interesting approach.", "rating": 5}, {"question": 5, "note": "I do not see any relevant experience for this in the proposal. I have doubts about community willingness to implement this form of DeFi lending.\r\n\r\nAdd previous experience and accentuate why it would be benevolent for the community. ", "rating": 2}, {"question": 5, "note": "My framework for this assessment for how suitable this challenge is as follows:\r\n1) Product-market fit: is this a wicked problem that is has a lot of demand, is uniquely suited to Cardano or if done successfully will really set Cardano apart?\r\n\r\nI think Cardano needs to mature more before this will have a high amount of synergy with the current roadmap. There is a lot of fundamental work to be done before interfacing with credit unions. That said, the work does need to start now to be available in a few years as the technology matures.\r\n\r\n2) Circle of competence: is there enough competence and passion in the ecosystem so proposals will have great leadership and synergy between team, partners and/or community?\r\n\r\nWith the influx of interest in Cardano, it could be the community is growing to include people that are experts in this space. It seems like pretty specialized work though, so I'm not sure.\r\n\r\n3) Accelerators: Are there clear network effects or other advantages that will drive success?\r\n\r\nBy the time Fund6 arrives, smart contracts will barely be released (or maybe not even released yet). This challenge is important, but seems a little premature at this time. ", "rating": 3}, {"question": 6, "note": "Some reasonable metrics have been described for counting numbers of credit unions / organizations that have decided to participate or onboard the Cardano blockchain, but the definition of success is vague and there is no deadline for verifying the success of the challenge and the metrics described .", "rating": 2}, {"question": 6, "note": "The metrics seams great point to start and the benefits of such a solution could impact millions to reach a new potential. ", "rating": 4}, {"question": 6, "note": "A clear roadmap of how this should be implemented and a short recapitulation of both of the attached papers is advised.\r\nThe requested funds is realistic. ", "rating": 2}, {"question": 6, "note": "I think the metrics are good and inspiring. I typically have a longer rubric to walk through this section, but the main comment I have is that it is set of social and consensus technologies that seem worth working towards. The funds requested are decent as an initial \"seed\" effort, to start work in this area. ", "rating": 4}], "videos": [], "media": [], "importance": "The biggest problem with the financial system today is that the banks which constitute the majority of this system are profit based.", "success": "Credit unions/co-operatives focusing on returning value to stakeholders are enabled to flourish in competition to profit focused banks."}