{"id": 340968, "author": "newmindflow", "title": "Decentralised Storage Solutions", "url": "https://app.ideascale.com/t/UM5UZBfno", "category": 25874, "amount": 250000, "description": "", "no_assessments": 25, "rating": 3.92, "assessments": [{"question": 4, "note": "The idea is good however as the author mentioned honestly that there are already existing platform out there, I am not sure if a targeted brief such as this will be a good one to use for funding proposal, I predict a limited submission where the funds might need better off for another challenge.", "rating": 3}, {"question": 4, "note": "This is as critical as a challenge can get IMO. Especially with regard to document retention, let alone NFT's. Someone who stores their land deed where it cannot be touched, especially where the mission is to bank and unbanked and develop underdeveloped nations, this is far more valuable. If Cardano can claim and prove that \"if you store it here, it is yours and yours alone\" the mission is almost accomplished. ", "rating": 5}, {"question": 4, "note": "Decentralised storage is one of the key aspects of blockchain technology. It is important that this gets addressed early on so that things are already set in place when they are needed. ", "rating": 5}, {"question": 4, "note": "It is a great proposal and challenge for Cardano, especially on how to we protect sensitive assets in the blockchain as well as how is access authenticated in the network. A phone can be stolen, hacked or pass keys can be taken by someone and with hat all of their assets and identity. It is of utmost important that a native system within Cardano focuses on such security and possible before smart contracts begin as by then a slight mess without protocol in place could damage multiple users and with that Cardano's effective process and confidence as a platform.", "rating": 5}, {"question": 4, "note": "going up against file coin with 250k does not seem realistic not much about the talent required in regards to a team ", "rating": 3}, {"question": 4, "note": "I checked all the mentioned examples and they are application that use a blockchain, or in case of holo, a holochain to facilitate a desired functionality. For me, this is something for the existing challenge  \"Dapps & Integrationen\". The suggested combination with the stake-pool operators makes no sense too. Depending on the solution, you need specialiced hardware to provide the kind of service that is needed. Current stake-pool operation have hardware that work well for cardano-nodes but this is a totally different use case. ", "rating": 2}, {"question": 4, "note": "This is very interesting idea and may lead to a broad choice of solutions. I guess IPFS storage would be currently the best possible solution anyway, but I'm eager to see other proposals.", "rating": 4}, {"question": 4, "note": "With the success of other blockchains decentralised storage offerings, Cardano risks losing legitimacy by not having a decentralised storage solution. Cardano's mission to become a decentralised financial system that still relies on centralised databases (for dApps, signed agreements for insurance, storing identity documents among other things) for file storage will inarguablely be a mission critical component of the Cardano network and its goal of true decentralisation with no centralised components of dApps.\r\n\r\nAlthough Cardano does support metadata, it will never have the capacity to support actual file storage on chain as the ledger is only equipped to store a small amount of metadata. As the Cardano ecosystem grows, the importance of having an affordable storage solution for Cardano developers to build on, where proper incentive structures are in place to ensure permanence and security simply cannot be overstated.", "rating": 4}, {"question": 4, "note": "I find this important and view it as a good idea. Especially since Cardano is entering the NFT market. Creating a decentralized and secure cloud storage solution can be another possibility for Cardano to demonstrate carefulness. We just need to be sure that this is designed as Challenge Setting and not as focused application development of an already existing solution.", "rating": 5}, {"question": 5, "note": "I believe a concentrated effort can make it into reality but again my question remain in the priority of this topic.", "rating": 4}, {"question": 5, "note": "From what I have seen so far, this is exactly what this community is building up to be, and by Fund 6 with this challenge in from of them, there will be a groundswell of activity.", "rating": 5}, {"question": 5, "note": "As the proposal stated, it will be a lot of work that should happen in stages. I deem it feasible in the long run as there is an option for stake pool operators to store data on their already existing infrastructures.\r\n\r\nIt is not clarified if the 250K USD is meant for the entire project or just this first stage. ", "rating": 4}, {"question": 5, "note": "Because is of utmost importance that the community seek to resolve this issue preferably before smart contracts are deployed. The community has the drive, expertise and imperative to work on this challenge.  ", "rating": 5}, {"question": 5, "note": "not very likely it has taken a very very long time for file coin or Sia coin to bootstrap a community and get traction probably easier to bridge or wrap ada and be interoperable ", "rating": 2}, {"question": 5, "note": "From what I saw, the implementation of filecoin is very sophisticated. Storing a large amount of data in a blockchain simply does not make any sense. the size of the chain would explose. filecoin uses the chain for payment an \"contracting\". order the storage of data, ensure that the data is still there and recover it. Many challenges are outside of the blockchain. I would say most. It would need a huge effort to get a similar solution that filecoin.", "rating": 2}, {"question": 5, "note": "Definitely, the community may bring very interesting solutions.", "rating": 5}, {"question": 5, "note": "This might be a tricky field, requiring very special  expert knowledge. I am afraid that this topic can turn out to be more complex than initially estimated, but nevertheless, ago I'd to give it a try.", "rating": 4}, {"question": 5, "note": "The success of the IPFS protocol has proven the concept of decentralised file storage and through this proven concept combined with various Cardano APIs, the Cardano developer community will be well equipped to implement a decentralised storage solution providing immutability and security. In addition, We can also provide privacy through the encrypting then hashing of the encrypted content for sensitive personal user data.\r\n\r\nFor example: someone purchasing an insurance policy through a future web3 dApp accessed through a smart contract deployed on the Cardano blockchain would have the ability to store the file immutably by first encrypting the content, then hashing the encrypted content proving that the signed agreement has not been tampered with by either party.", "rating": 4}, {"question": 6, "note": "Given the assigned tasks and challenge I do believe the criteria is an adequate measuring factor.", "rating": 4}, {"question": 6, "note": "The proposal is well substantiated.\r\nFurther elaboration of the prospected stages is still needed. ", "rating": 4}, {"question": 6, "note": "The metrics are well detailed and the question raised are great starting point. More emphasis on security, authentication and security  metrics could put this project on the priority.  ", "rating": 4}, {"question": 6, "note": "I also don't like the metrics to evaluate the progress. The proposed metrics measure how wide spread the final solution is adopted. It is a wide way to have a working solution. There needs to be more steps inbetween.", "rating": 2}, {"question": 6, "note": "They seem to be good, although the mention of incentive native token seems to be excess limitation.", "rating": 4}, {"question": 6, "note": "Well, first solutions are around, so this should be a 'mission possible'. Nevertheless, not a simple topic. I support this idea, since TRUST is everything when we enter the stage and promote Cardano as THE new global 'trust platform'.", "rating": 4}, {"question": 6, "note": "The KPI's for a storage solution are obvious and measurable, as they are all in some way related to the actual usage of a decentralised storage solution.\r\n\r\nThe successful implementation of a decentralised storage solution on Cardano would be to provide an affordable, secure immutable data storage solution. All the key metrics listed are easily verifiable and relevant.\r\n\r\nThe metric which would be most interesting however, is an intangible which is of course the value added to the entire Cardano ecosystem by unlocking Cardano development teams ability to reliable store and access data securely and affordably, using on-chain transactions to power their applications and provide a immutable and if need be completely private personal data.", "rating": 5}], "videos": [], "media": [], "importance": "The world relies more than ever on cloud storage. The need will only increase. Yet a few corporations currently host most of that data.", "success": "The creation of a decentralised storage solution that makes use of the Cardano blockchain, incentivised by a native token."}