{"id": 340949, "author": "SofiH", "title": "Propose, build & deliver in 6 weeks", "url": "https://app.ideascale.com/t/UM5UZBfnU", "category": 25874, "amount": 50000, "description": "", "no_assessments": 13, "rating": 3.230769230769231, "assessments": [{"question": 4, "note": "I believe that the idea is in line with the interests of Cardano and Catalyst. By allowing teams to showcase their work and link that work to a reward is a different model that should encourage good execution if there are a considerable number of proposals.\r\n\r\nIn Catalyst, proposals are funded before their execution, the idea here is to reverse this order and reward good implementations, I see this idea more as a reward than funding. In fact, several Catalyst proposals are already being implemented before they are even approved and financed by the community, which has shown its impetus and dedication, this gives confidence to the community.\r\n\r\nI think this challenge is an interesting way to test a different funding model.\r\n\r\nThe idea presented can be difficult to understand, I recommend that the proposer simplify the description for easier understanding by the community. I say this because I had to read it 3 times to understand the concept.\r\n\r\n", "rating": 4}, {"question": 4, "note": "The challenge is well presented and intentioned in regards of protecting the community from Entrepreneurs and investors for taking the audience in what gets the biggest attention and therefore funding. Unfortunately most of the ideas dont have teams or would have time to build a team fast enough to deliver on the solution in 6 weeks. ", "rating": 2}, {"question": 4, "note": "This proposal creates an incentive to get things done. It also increases the chance of ROI.\r\n\r\nAlthough, for some proposals, it should leave the exceptional option to ask for more funding in one go. ", "rating": 4}, {"question": 4, "note": "good concept and can help get grass roots projects boot strapped and rolled up into bigger initiatives ", "rating": 3}, {"question": 4, "note": "definitely something has to be done to build the entrepreneural skill set required to submit a quality proposal and build it over time while being managed by the community and accountable for the scope/ deliverables / budget in the plan", "rating": 4}, {"question": 5, "note": "In general, I don't see any technical complexities that compromise the viability of the challenge, but defining the budget distribution in at least 10 proposals can result in a relatively large number of smaller proposals and this will be a considerable workload for community advisors, this can compromise the evaluation of these proposals and Catalyst proposals in general.", "rating": 3}, {"question": 5, "note": "The community has the ability to come up with a better structure should there was a need to do so. The current one in itself is going through experimental changes and new talent coming in to build it up for future engagement efforts. ", "rating": 4}, {"question": 5, "note": "It is up to the community to vote for or against this as it would mean a crossroads in the way things are funded. ", "rating": 3}, {"question": 5, "note": "management of project deliverables and scope is very difficult and the weakest point of this whole catalyst scheme I get that the momentum will likely over come this but if the process was more based around breaking down grants and managing deliverables with reporting of progress it would protect treasury funds this is why this appeals to me we should Never dump 50k USD in someones lap and hope they will do a good job they need to have accountability and reporting and controls ", "rating": 3}, {"question": 6, "note": "The definition of success is clear and objective, as are the metrics presented. The metrics presented would allow a good analysis of the performance of the challenge relatively easily.", "rating": 5}, {"question": 6, "note": "The idea is quite noble in approach but some proposals could take years to achieve based on developments, technology involved, legacy organisational building and some of the teams could be in different parts of the world with different responsibilities to maintain their own lives. Perhaps exploring how can the proposal gain enough community commentary to be able to build strong solution that can be tracked for success is an approach or more education for proposer showing examples of the community interest in proposals and their metrics. A completely different incentived system where Ideas that meet a certain scaling are given a reward for future challenge setting on future fund rounds can incentivize quality in proposals where the challenge can be separated from the solution.", "rating": 2}, {"question": 6, "note": "This proposal would force the creation of a roadmap. Proposers would file for funding for each milestone.\r\n\r\nReading the proposal, I was kind of hoping you'd set an example and ask for 5K USD yourself. ", "rating": 2}, {"question": 6, "note": "it is well presented and given the smaller amounts there is less risk if their is someone giving out the funds and managing the process of getting the grant receivers to report on the promised deliverables ", "rating": 3}], "videos": [], "media": [], "importance": "Large projects come with a lot of risk, both for the executors and the funders. Working in small increments mitigates risks and is flexible", "success": "New small teams are formed that propose and deliver all within F6, so the deliverables should be done before voting."}