{"id": 341065, "author": "Kemal Sirin", "title": "Framework for non-tech entrepreneur", "url": "https://app.ideascale.com/t/UM5UZBfpO", "category": 25874, "amount": 45000, "description": "", "no_assessments": 19, "rating": 3.210526315789474, "assessments": [{"question": 4, "note": "The idea of integrating Cardano with governments is a concrete aspiration, as Cardano's interest in partnerships and integration with governments in different jurisdictions is notorious, especially in places where there may be a technology leapfrog, as in the case of underdeveloped countries, so I see alignment with the challenge and Cardano.\r\n\r\nThe challenge brief was relatively confusing, as the proposer used the first person in the description and hinted that the proposed challenge is being created for his future proposal. I recommend that this be clarified, as the Challenge Setting challenge must allow for multiple proposals to compete and this wasn't made clear by the description of the challenge brief.", "rating": 4}, {"question": 4, "note": "I like this if it means \"How might we involve 'normie' entrepreneurs outside crypto economy?\".", "rating": 4}, {"question": 4, "note": "It is hard to ask for multiple frameworks and there are diminishing returns if there are too many. ", "rating": 2}, {"question": 4, "note": "A fluent network to easily reach the right people is essential for project Catalyst, which aims to be the pinacle of human collaboration. ", "rating": 4}, {"question": 4, "note": "An advisory segment of catalyst should be good as a resource center to instruct others about the questions raised. There is something like this in the Cardano main forums where individuals can raise and attain information but its not in a clear format that perhaps this challenge can achieve with the solution presented here.", "rating": 4}, {"question": 4, "note": "This is a good start for reaching out to people who are necessary to settle our highly sophisticated technical solutions within real life environment. For example, preparing legal framework to start Cardano loans. Or just explaining them in layman terms and marketing to the people.", "rating": 5}, {"question": 4, "note": "no we are organically attracting entrepreneurs to the space we need quality not quantity ", "rating": 1}, {"question": 5, "note": "The integration of public blockchains with governments is a complex task, Cardano has been negotiating partnerships for years in Africa and is only now close to being realized. Bureaucracy and corruption are two complex elements that exemplify the difficulty in integrating blockchains with governments and as a window of time wasn't specified to assess the success of the challenge, it's difficult to assess the feasibility of the idea.", "rating": 2}, {"question": 5, "note": "Totally doable challenge that could invite very good and inclusive innovations.\r\n\r\nAs for the \"landing page\", check this: https://cardano.ideascale.com/a/dtd/Project-Catalyst-Landing-Page/341718-48088", "rating": 4}, {"question": 5, "note": "It is very easy for the Community to align on landing pages for non-technical entrepreneurs.", "rating": 5}, {"question": 5, "note": "Similar projects are already in the works. I suggest that you make contact and merge to guarantee an efficient outcome. ", "rating": 2}, {"question": 5, "note": "The community has the tools to assist in this regards, and the veteran advisors are working on how best to improve the process. ", "rating": 5}, {"question": 5, "note": "I'm not sure but I express cautious hope.", "rating": 4}, {"question": 6, "note": "It seems that instead of defining success, the proposal describes metrics. The metrics presented are relevant, but without specifying a window of time for their evaluation, the verifiability becomes compromised.", "rating": 2}, {"question": 6, "note": "No rocket science here. Basic \"marketing funnel metrics\" apply: views, conversion, leads, deals, projects etc.", "rating": 3}, {"question": 6, "note": "Metrics like successful collaborations initiated, or breadth of industries onboarded.", "rating": 5}, {"question": 6, "note": "The diversification criteria are not clearly set. With suggesting a division based on age, this tends more to a social network that would discourage multilayered collaboration. ", "rating": 2}, {"question": 6, "note": "Need more information and metrics on how the challenge can be solved and what steps are needed to resolved the challenge for this proposal. Where could this resource be deployed, what medium is best to capture the Entrepreneurs and how to establish more transparency regarding these soon to be Dapps deployed in the network with the community knowledge. At the moment information is drip fed through youtube announcements made by Charles Hoskinson but that is the extent of the community knowledge about the projects in the pipelines and the talks.", "rating": 2}, {"question": 6, "note": "I see them unclear and would like to see them rewritten again. Success criteria should IMO base on the number of clearly defined and well written descriptions of legal or business proceedings necessary to carry out the idea.", "rating": 1}], "videos": [], "media": [], "importance": "Helping non-tech entrepreneurs understand the opportunities and provide a framework", "success": "Landing Page:\n- Cardano regional or per vertical contact people\n- Example of opportunities (real or potential)\n- Process\n- match making"}