{"id": 341809, "author": "Kriss", "title": "DLT Entrepreneurship Toolbox", "url": "https://app.ideascale.com/t/UM5UZBf1b", "category": 25874, "amount": 150000, "description": "", "no_assessments": 12, "rating": 4.166666666666667, "assessments": [{"question": 4, "note": "This challenge is fully aligned with the objective of Cardano and also of Catalyst, which I consider an additional important factor. Creating tools to improve the presentation/communication of proposals is a necessity and a welcome implementation for Catalyst, especially thinking about the future of Funds that will have millionaire budgets and will attract more ambitious entrepreneurs.", "rating": 5}, {"question": 4, "note": "Yes! Entrepreneurs are the vision and their vision drives the leadership and passion needed to see them come into fruition. The challenge is critical for helping this group develop key points needed to close a deal and make changes in the projects future dissemination of technologies and applications.  ", "rating": 5}, {"question": 4, "note": "A quality increase of proposals is vital to the ecosystem. This proposal is mission critical as, if implemented, it has a lasting impact on Project Catalyst.\r\nThis challenge should be tackled early on to maximise the impact. ", "rating": 5}, {"question": 4, "note": "Yes, I think that this is important. I make the same remark as I made under 'Success Tracking'. Combining these 2 Challenge Settings into one would be great. It would then be about how to optimize for success. Independent from this suggestion, I support this idea.", "rating": 4}, {"question": 5, "note": "The possible proposals resulting from this challenge wouldn't need technically complex solutions, but critical thinking and education initiatives, so the challenge presented is feasible and tangible, there is already a demand to improve the presentation of proposals in Catalyst and this challenge would open the possibility for us(Catalyst community) to attack that need.", "rating": 5}, {"question": 5, "note": "The community has the tools, knowledge and passion to actuate this solution. Emphasis in developers, entrepreneurs and organizations are required to develop new ideas on the blockchain.", "rating": 5}, {"question": 5, "note": "The community will fill in its own needs as to what this toolbox should contain.\r\nThe pricetag is nothing compared to the potential ROI.\r\nThis is one of the few challenge proposals that actually used the tags.\r\n\r\nTo improve this proposal, add a mention of the proposer's experience as an entrepreneur and motivate why these tools would be deemed important. This way the voterbase can acknowledge the proposer's expertise. ", "rating": 3}, {"question": 5, "note": "I think that the Cardano community has the capacity to address this challenge. We have a great diversity of experiences and skills. Again, I suggest to join forces with 'success tracking'.", "rating": 3}, {"question": 6, "note": "I believe that the definition of success and the metrics presented were satisfactory, the comparison of scores of proposals that used the proposed tools / models against the proposals that didn't use them seems to be an efficient way to measure success.", "rating": 5}, {"question": 6, "note": "The metrics and ideas to tackle the challenge and deploy solutions are sound. Perhaps a roadmap, stages and clear platform used can polish this proposal forward.", "rating": 4}, {"question": 6, "note": "Plenty of information provided.\r\n\r\nI'm struggling to assess the key metrics. Some factors seem extremely hard to measure and rely on perception. Try to make this more concrete. ", "rating": 3}, {"question": 6, "note": "The author(s) show that they have been investigating this carefully. Nevertheless, I do not think that this will fly with just providing tools. I think that we will need to see a coaching & auditing expert team over time for really helping the proposer-teams to prosper. ", "rating": 3}], "videos": [], "media": [], "importance": "Entrepreneurs strengths are ambition and vision but often lack structure to communicate ideas clearly enough to win voter hearts & minds", "success": "Higher quality of proposal submitted to Catalyst so entrepreneurs become confident presenting project principles, USP, strategy, objectives"}