{"id": 342043, "author": "ewmsteinebach", "title": "Lobbying team", "url": "https://app.ideascale.com/t/UM5UZBf5Q", "category": 25874, "amount": 2000, "description": "", "no_assessments": 24, "rating": 1.75, "assessments": [{"question": 4, "note": "It is not clear why Catalyst should fund a team to lobby, especially when it doesn't specify what kind of people we are talking about (Celebrities? Artists? Scientists? Investors? Developers?) And how will there be a lobby with a budget of just $ 2000?\r\n\r\nThe proposal seems to be a draft and needs more details so that we can understand its alignment and importance for Cardano.", "rating": 1}, {"question": 4, "note": "Yes, this is indeed needed. The only part I would challenge is to what ends we should \"lobby Cardano\"? What kind of help do we want from these influencers? Do we want their money, their networks, their ideas, their skills, their means of production/delivery... what?", "rating": 4}, {"question": 4, "note": "The idea is fairly sound, but not critical and there appears to be no follow up from the originator to continue", "rating": 1}, {"question": 4, "note": "You've got a good idea, but the challenge question seems a bit vague. Try to formulate it more specific and elaborate it more in the challenge brief. ", "rating": 2}, {"question": 4, "note": "The reach of various organizations, think tanks and hiw the project reach the general masses is a critical challenge that the community will face. The idea is very interesting in the sense that the technology has found ways to bridge the art world, finances and other forms of applications but the challenge is on hkw it can seamingly be easily deployed on the masses in a way that fits to alreadt existing technologies without having to do extensive research as to how do i copy ny wallet address the right way how do I get the tokens again? how do I put my art for sale and tokenize it again? what is this 12 phrase word and what I do with it? Deffinitly an evolution of how these cane be solved is a beautiful challenge and it's value and mass adoption lies with a simple solution to these question that may appear cryptic to an \"average joe\" who has all to gain from its opportunities.", "rating": 4}, {"question": 4, "note": "lobbying needs more deep strategy, cardano needs concretes real world applications first.", "rating": 2}, {"question": 4, "note": "Idea is overly broad. Would be better if it was narrowed down to a particular region and task to accomplish", "rating": 1}, {"question": 4, "note": "If your title would be 'How to onboard highly influential people, fitting to the Cardano brand reputation ?', I would support your Challenge Setting. Please also check with the Celebrity Marketing Proposal within this campaign, there might be a possibility to join forces. ", "rating": 3}, {"question": 4, "note": "Refine it, add more detail, tell us the structure of your think tank and so on... but lobbying is very dangerous, it's actually a plague on democracy. ", "rating": 1}, {"question": 5, "note": "Some points need to be clarified in order to assess the feasibility. The main point is how can a team lobby highly influential people for as little as $ 2000? As we do not know what kind of influential people the challenge refers to, it is difficult to understand the relevance of the budget in this. Besides, what is the feasibility of having a challenge for such a small amount?", "rating": 1}, {"question": 5, "note": "We have at least one NBA player and I'm sure there are many other potential influencers out there. Perhaps we should first have a solution to map and make visible every community member's profile / interests / competence / network / influence.", "rating": 3}, {"question": 5, "note": "I have seen similar proposals. I believe that if you guys merge together and create one great proposal, it would increase your chances.\r\nYou will need networking skills in your team. Use the tags and check out the Discord to find people to help you with this. ", "rating": 2}, {"question": 5, "note": "I believe the community has the tools to solve this challenge a lobbying team that  comes up with the challenges and seek to produce the solutions needed to bridge the resources needed could develop great change and mainstream adoption.", "rating": 4}, {"question": 5, "note": "lobbying need AMHA a more centralised control", "rating": 1}, {"question": 5, "note": "More definitions on where the team would come from, what sort of tasks they would perform and how much they would be paid would be appreciated. The asking amount of 2000 seems small to hire a team.", "rating": 1}, {"question": 5, "note": "Well, the community can for sure address this. We have many creative and also well-networked people here. I do not support your built-in limitation of forming a 'lobbying team', there might be many more possibilities for achieving your intention. With USD 2.000, we will not get very far. I think that this is not well-analyzed. ", "rating": 2}, {"question": 6, "note": "No metrics have been described for assessing success.", "rating": 1}, {"question": 6, "note": "Nothing in the metrics section. Please include.", "rating": 1}, {"question": 6, "note": "Would be hard to say that so and so did whatever based on the \"team\" built by a 2,000 fund.", "rating": 2}, {"question": 6, "note": "The success condition is a monumental task. How are you going to fund all this with just 2000 USD?\r\n\r\nThe sheer scale of this proposal requires it to implement milestones to be able to monitor its progress. Try and create a clear roadmap. ", "rating": 1}, {"question": 6, "note": "Great idea, more clarity and defined risks, shkrt comings and roadmap to establish those bridges need to be laid out. What strategies can be used to get there and who are specifically the best groups to welcone to the conversations are needed to verify the success of this proposal. A little refining as to the metrics to get there can provide confidence in this proposal.", "rating": 1}, {"question": 6, "note": "just a fast idea launched without any  real reflexion", "rating": 1}, {"question": 6, "note": "There are no metrics listed. Please consider things such as number of people on-boarded, number of new wallets, transactions created from efforts of team. ", "rating": 1}, {"question": 6, "note": "You should have invested some time to outline some measurable elements, this is not too difficult here. On the other hand, with a requested funding of USD 2.000 we will not be able to move a lot anyway. Please try to find alliances or elaborate a bit more carefully in the future.", "rating": 1}], "videos": [], "media": [], "importance": "Because a focus on institutional involvevement, involvement of celebrities etc. will lead others to bridge the gap to accepting Cardano.", "success": "A dedicated lobbying team with connections to think tanks and governments, tech pioneers, and corporations around the world."}