{"id": 342170, "author": "Dave Crossland", "title": "More wood behind fewer arrows", "url": "https://app.ideascale.com/t/UM5UZBf7V", "category": 25874, "amount": 250000, "description": "", "no_assessments": 20, "rating": 1.8, "assessments": [{"question": 4, "note": "To say that there are not a number of strong proposals is relative, this statement needs to be based on data and not statements. We are currently using the average assessments scores for each challenge as feedback to understand whether the proposals of each challenge are strong or not.\r\n\r\nAs long as we do not have appropriate feedback on the scores for each challenge, I think it is premature to propose a unique challenge by Fund. In addition, a single challenge would limit the funding possibilities for the community too much and I do not see this in a positive way for Cardano's ecosystem. A challenge cannot be too broad or too specific, so restricting a Fund to a single challenge would greatly limit the scope of funding.\r\n\r\nMy recommendation is that data be obtained to support the proposal.", "rating": 1}, {"question": 4, "note": "Rather than a challenge, you are outlining a solution. \"How might we increase the quality of proposals?\" would be an example of a challenge.", "rating": 1}, {"question": 4, "note": "It appears to me that the idea of focussing on just one challenge is counterproductive to the vision of Cardano.\r\nI do understand that 6 different challenges (as is the case now) can be a bit overwhelming.\r\n\r\nThe way I see it, this is being done to attempt to create order as the number of proposals is expected to rise significantly and to enable a multilateral workflow. ", "rating": 2}, {"question": 4, "note": "The idea highlights a good point to make it easier to narrow down the focus to a big challenge for the community that intensifies the focus to an overarching point of interest with each fund. I think Charles has highlighted that the focus on this fund was to deploy new dapps idea and that its why it has more focus this round. you are onto something good with this idea,  the top-down process could be created by community advisors from both community and the veterans of IOG. Perhaps a focus from the VCAs then challenge ideas from CAs and then it boils down to proposers to follow the challenge in their focus for a fund cycle. The other areas could still be open for ideas to previpitate and be polished through community input with a minor reward to contributors to incentivize it, perhaps like 10 adas per contribution. That would entail everyone part of catalyst to add a wallet into their portal.", "rating": 3}, {"question": 4, "note": "This project is vague with it's description and the problem it is trying to solve seems to be non existent. I don't think it is critical in achieving Cardano's mission. ", "rating": 1}, {"question": 4, "note": "I dont think the idea is \"critical\" to achieve Cardanos mission, however I agree with you too many challenges can be confusing for many people.", "rating": 1}, {"question": 4, "note": "You are making a valid point here, but this 'meta suggestion' is therefore not proposing a new Challenge Setting - the opposite: You are suggesting to refrain from setting new challenges again and again, rather continue the valuable existing ones. Valid input, but probably more suitable for a discussion forum ?", "rating": 3}, {"question": 5, "note": "It is not clear why this idea requires a challenge, because from what has been described it would just be a conceptual change in the Catalyst model that would not involve costs and a budget, even more a budget of $250,000.", "rating": 2}, {"question": 5, "note": "Yes, the Catalyst community is able to come up with ideas to increase the quality of the proposals. But that's not what is being proposed here.", "rating": 1}, {"question": 5, "note": "The community has the resources to address this problem with more input from VCAs and CAs and I believe in the town halls they are talking about ways of incentivizing an its ever changing to polish that goal as we speak.", "rating": 1}, {"question": 5, "note": "I don't see this implemented when the number of challenges is reduced to one.\r\n\r\nThis does not mean that there is no room to propose making other changes to the current challenge format. ", "rating": 1}, {"question": 5, "note": "This project has no future unless there's a pressing need to revisit the way Catalyst runs it's operations . ", "rating": 1}, {"question": 5, "note": "I disagree at this early stage of the journey. Asking the community for Challenge Setting ideas is definitely valuable. We need to be open for expecting the unexpected. Great new ideas can be born this way. Definitely challenging to handle the resulting diversity of ideas, but the pros are outweighing the cons in my view.", "rating": 2}, {"question": 6, "note": "The proposed metrics do not make sense, the proposer is considering the absolute number of proposals per challenge as metrics without considering the ratio of proposals / budget and their relative ROI.\r\n\r\nI think it's important to evaluate the number of proposals in relation to the available budget and the average score of them to establish more plausible metrics,", "rating": 1}, {"question": 6, "note": "This is suggesting the same metrics that are in use already: number of proposals, number of votes, kudos, and comments.", "rating": 2}, {"question": 6, "note": "There is a lack of clear roadmap or metrics of progress delineated in this entry, but the core idea is interesting. I think you should become a community advisor or visit the town hall and review the second week presentation for more information on how to bring ideas for challenges and priorities on proposals. If you have not done so yet. Good luck is a good idea.", "rating": 3}, {"question": 6, "note": "250K USD seems like a lot to me to make a relatively simple 'meta' change. There is no specification as to why you've asked for this amount.\r\n\r\n", "rating": 2}, {"question": 6, "note": "Fortunately, we can see a glimmer of hope here. What can change here is transparency. What is being proposed is a change that would affect everyone directly. We will be able to see the impact but I don't believe we need to spare our precious time doing something that isn't a pressing need. ", "rating": 2}, {"question": 6, "note": "I think you explained the idea in simple and understandable way. And I somewhat agree with you that too many challenges at the same time can be confusing.", "rating": 4}, {"question": 6, "note": "Well, your Challenge Setting already provides the answer based on the assumption that 'less is more'. As you state yourself: This is a kind of 'meta input', no direct measurable, and I do not agree with your posited assumption (at least not at this early stage of the Cardano/Catalyst journey).", "rating": 2}], "videos": [], "media": [], "importance": "I saw many good challenges set, but they did not get enough strong proposals. Attention needs to be focused! F3 set 3 challenges, F4 had 6…", "success": "F3 and F4 Dapps challenges got over 100 proposals each, while most others got 1-3 dozen. A single F6 challenge will be successful with 200+."}