{"id": 383551, "author": "victorcorcino", "title": "Gaming & Artificial Brains", "url": "https://cardano.ideascale.com/a/dtd/383551-48088", "category": 26247, "amount": 24000, "description": "As técnicas de IA e ML ainda não estão bem integradas e utilizadas nos projetos de jogos em cadeia de blocos.", "funded": 1, "upvotes": 52637973, "downvotes": 4379475, "votes_result": 48258498, "votes_cast": 163, "f6_no_assessments": 4, "f6_rating": 3.7499999999999996, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal to do some more AI work on a gaming proposal in another category. Obviously if that doesn't get funded then this cannot really go ahead (unless they use the money to try and do some of the other project instead). Whilst I love the idea of the main proposal, there is not a lot of detail in this proposal in what is actually going to be done.", "q0r": 4, "q1": "The proposers have the skills to do something along what the idea of this proposal is. As stated above this proposal is lacking in details of what will be done. All we have to go on is it will be used to hire 4 back-end developers and bring forward from Q3 in the original proposal to Q2 the AI Model to anticipate improvement in the Character's AI, and deliver a final model of the characters AI in Q3. It would be nice to have some details as to what these two things are in terms of AI given this is an AI challenge. Without those details it makes it hard to give a high likelihood they will be successfully delivered.", "q1r": 3, "q2": "As with the above point, we are not given much details on what is being delivered specifically under this proposal which makes auditing of progress hard. I have a PhD in ML and have worked in academia and industry as a researcher in ML. However I struggle to understand what their proposed success metric is. What does it mean to \"anticipate the original back-end/AI development plan in X months.\"? How do you measure if you have done it well? If I can't measure it then I can't audit it. If you can measure it (some sort of accuracy?), what is the goal value you would consider for success?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 23, "ne": 2, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "Projects like this easily gain traction as people do it for fun. This accelerates adoption significantly, especially if it brings about an innovation, like in this case an (almost) new genre of gaming. Rather than being in complete control of a character, the player has to teach the AI-brain of their character how to behave. The player has to accept the fact that he is not in total control and that brings a new facet to the entire experience. ", "q0r": 5, "q1": "The proposing team are prominent members of the Project Catalyst community. They have already delivered on previous projects, creating tools which most of us are utilising right now. So they have already established a certain level of trust. This proposal is meant to cover the AI-aspect of the blockchain game they are trying to build and by doing so, expand their team with 4 developers. The main proposal requests 54K USD, which combined add up to 78K USD. ", "q1r": 4, "q2": "The proposal contains a lot of detailed information, especially on the team members to determine a representative idea of the auditability of the project. Unfortunately, at the time of this assessment the website was offline, so there was no opportunity to audit the information found there. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 25, "ne": 1, "ng": 22, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is about accelerating the development of the game Terra Cognita. A game about developing the brain of your character. A project like this will effortlessly be integrated into the community because people will play it for fun. By integrating AI into the game where you develop your NFT-character is a feast for both sides of this challenge.", "q0r": 5, "q1": "Seeing some familiar names among the team members is a good sight. They are well known within the community and have already proven their worth. The goal of this proposal is to give a boost to the challenge in Gamers on Chained so that the development of the AI system is boosted. The roadmap provided and budget breakdown confirm this. It would've been nice to see what would happen with the funding if the main challenge doesn't get the funding? Will they develop the AI system nonetheless or will the funding be used for the main proposal?", "q1r": 4, "q2": "Audit-wise this proposal includes all the details needed, especially if you check the main proposal as well. We get a well-explained roadmap and budget.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "The idea of RPG game players driven by \"artificial brains\" based on reinforcement learning is an interesting one. I do not know enough about gaming to predict whether this is likely to be of interest to gamers, but it is certainly innovative.\r\n\r\nHowever, the challenge brief relates specifically to creating engagement between Cardano and SingularityNet, and this proposal does not mention SingularityNet at all. There may be good connections to SingularityNet in this innovative idea, but the proposal does not mention them. The proposal also does not address the alternative guiding question of the challenge of how AI can benefit society.\r\n\r\nIn summary, I like the idea, but because of the lack of connection to the challenge brief I neither agree nor disagree that the proposal effectively addresses the challenge.", "q0r": 3, "q1": "Victor Corcino appears to have AI-related expertise sufficient to manage this project, and the explicit goal of the project is to hire additional people who can deliver the AI / \"artificial brains\" functions.\r\n\r\nHowever, the proposal is not very specific about what these functions will be (the only description is \"fighting and advanced surviving mechanisms\"). Therefore, it is difficult to tell what specifically would be implemented and I neither agree nor disagree that it is highly likely that the proposal will be implemented successfully.\r\n\r\nTaking another angle on the same point, AI is challenging for this type of application (I lead an AI start-up), and very clear goals are needed to achieve success. Given that the budget here is only $24,000, there should be narrower and more specific goals about what is intended to be achieved.", "q1r": 3, "q2": "Given the lack of detail on specific AI capabilities being built (as noted in the above \"feasibility\" comments), it appears very difficult to audit the success of this proposal. The only metrics provided are to make a 6-month plan at 3 months, and a 12-month plan at 6 months. ", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 18, "ne": 5, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "Desenvolver 'cérebros artificiais' para serem usados no jogo Terra Cognita, que será aberto após o jogo estar completamente desenvolvido.", "experience": "Experientes Full Stack Devs, Plutus & AtalaPRISM Pioneiros, Pesquisadores de Aprendizagem de Máquinas, Designers, Entusiastas de Cardano e Jogos, equipe AIM."}