{"id": 383254, "author": "sidney", "title": "Detroit + Wada Diaspora Hub", "url": "https://cardano.ideascale.com/a/dtd/383254-48088", "category": 26244, "amount": 20000, "description": "Detroit é uma grande cidade americana que se deteriorou.  O crime, os baixos salários, a falta de assistência médica e a educação precária têm sido devastadores.", "funded": 1, "upvotes": 27897779, "downvotes": 19250253, "votes_result": 8647526, "votes_cast": 119, "f6_no_assessments": 3, "f6_rating": 3.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "The team discusses a major social problem that occurs in Detroit. High crime rates, low wages, poor sanitation, among other things. For which they propose a series of solutions intended to bring new opportunities associated with the blockchain to the community. As for the alignment with this challenge, I can see the connection, and I believe if implemented well, we can begin to take advantage of the city's potential that has not yet been explored. Furthermore, I also find the metrics of success to be well defined and aligned with the challenge's mission. An element that I found to be lacking in the proposal's description is the analysis and consideration of the possibility of scaling and sustainability of the hub.\r\n", "q0r": 4, "q1": "There is a brief description of Sidney's skills and experiences, however, no references are presented that would allow me to validate them. Wada is a well known organization within the community, so I see it positively to be included as a partner. However, I believe it is necessary to describe the people from Wada who will lead or support this proposal. Some of the actions are briefly described, but I would have liked a more detailed explanation of the initiatives being contemplated. The requested budget is divided into four identifiable areas, however, I believe it is necessary to provide more information in order to make an accurate assessment, for example, \"Marketing and community outreach,\" which represents 75% of the total budget requested without any explanation as to what actions they plan to take.  \r\n", "q1r": 3, "q2": "There is a statement from the team that the project will be implemented in 18 months, and 9 milestones are listed. Here I also find opportunities for improvement. For example, instead of describing \"crypto buy back guns scheme\" I would recommend something like \"XX amount of guns bought by XXXX (timeline)\". Of course this is an estimate, but it is necessary for the advisory community not only to be able to audit but to measure the impact. I congratulate the team on presenting a set of simple success metrics in line with what they are seeking. However, to make a thorough assessment it is necessary to identify objectives for each metric. This is the best way to assure the community that it will be audited during the implementation period. \r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 21, "ne": 10, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment. This knowledge gives me the skills to assessproposals in this challenge. The proposal identifies an important problem within the challenge which by adressing it, will provide a new perspective to the West African Diaspora in Detroit and establish them on Cardano. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 21, "ne": 3, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The proposal is more a \"Renaissance\" plan for Detroit rather than scale up Cardano's community plan. The Cardano related part is lacking. However this plan actually can broaden the community to Cardano by adopt Cardano as a currency to do activities such as buying gun or engineer training... ", "q0r": 3, "q1": "He/she has long experience (Solutions architecture: 20yrs, Public policy: 20yrs, Art and culture initiatives: 15yrs, Education: 35yrs) but not detail what he/she have been doing on these fields. The plan is still general and not detail enough. The team seems quite ambitious that the goal is big and hard to achieve but there is not enough plan or idea about how to bring the goal into real action. Big project need more detail plan to become persuasive!\r\n", "q1r": 2, "q2": "The metrics need to have quantity of each KPIs to ensure the transparent of progress and to be sufficient to audit.", "q2r": 2, "assessor": "z_assessor_809", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "A Blockchain e a tecnologia emergente oferecem novas oportunidades para Detroiters. Um Wada Hub trará exposição ao DLT e ao ecossistema Cardano.", "experience": "Arquitetura de soluções: 20 anos\nPolíticas públicas: 20 anos\nIniciativas de arte e cultura: 15yrs\nEducação: 35 anos"}