{"id": 384221, "author": "yogo", "title": "Geneva Business Development Hub", "url": "https://cardano.ideascale.com/a/dtd/384221-48088", "category": 26244, "amount": 5850, "description": "Financiamento de impacto e empreendedorismo de impacto são fortes em Genebra, como melhorar a colaboração catalisador/Cardano?", "funded": 2, "upvotes": 80451561, "downvotes": 686282, "votes_result": 79765279, "votes_cast": 218, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal has identified a problem related to local community integration in the cardano ecosystem. In fact, building a community hub in Geneva is an interesting idea. Furthermore the proposers want to collaborate with local established businesses, which adds a positive note on this proposal. This will definitely add value to the cardano ecosystem as local businesses get introduced to the cardano ecosystem where they can add their own proposals. However I don't see this proposal, any mention of risk or challenges the proposer may face in the execution of the project. I think that it is wise for the proposer to consider the risks for instance of not being able to convince local businesses to join the project. For the scaling part, the proposer has already figured out that it's a matter of replicating the same model in different areas. (Rating 5)\r\n", "q0r": 5, "q1": "I think there is not enough evidence on the skills of the proposer or any of the eventual team to successfully carry out this project. The proposer could  share links to his github or linkedin profile, in order for us to be able to verify his claims. That's definitely a point that weakens the feasibility of the project that can be easily fixed. However the budget has been broken down, but it is a little bit vague in my opinion. For instance: 1200 usd for hub activities - could be broken down further. \r\nI also didn't find the mention of a plan if additional funding is needed. However, the proposer has provided a timetable to complete the work. I also think that the proposer should focus more on providing more details on the actual hub creation, the activities and the user acquisition. I think that will add more confidence in the feasibility of the project. (Rating 4)\r\n", "q1r": 4, "q2": "This project has enough informations including a roadmap and the milestones needed to be audited successfully. The proposer has also provided some metrics and KPIs we can use to track the progress of this project. To sum it up, the project has good chances to be successful. The problem has been described clearly. However the description of the solution, although good, can be improved.\r\n", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposition is fascinating. The proposal raised the issue to improve cooperation for financing and impact on Catalyst and Cardano in Geneva. There is clarity in the problem description and the proposed solution. The idea is to build a model for local hubs, based on business developments and partnerships with local companies that share value with Catalyst and Cardano.", "q0r": 4, "q1": "There is a proposal of this project that has been funded from previous funds, and this proposal has been requested for part of the project.\r\nThe team consists of 2 members who are fully described with their experience, abilities as well as the process of their participation and positive contributions to Catalyst. The proponent presented several potential challenges and risks and the proponent has a solution to address all of them. The proponent has done a lot of background work and thought through the ideas that underlie the proposal, which adds to the feasibility of the proposal.", "q1r": 5, "q2": "Based on my experience, I agree that this recommendation provides me with sufficient information to gauge progress in achieving the stated goals.\r\nBoth the plan and the budget are very well thought out. I love the level of detail mentioned in this proposal, it gives me reassurance that the people behind the proposal know what they are doing.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "I strongly agree that this proposal addresses the challenge as it wants to create new hubs with local entrepreneurs in Geneva. The target demographic is ideal for the proposal.", "q0r": 5, "q1": "I rate 5 for the feasibility and strongly agree this proposal will implemented successfully. I think the team has sufficient skills and experience to run this project since they had a project of creating partnerships with UN-related organisations and was funded in F6. Development plan is coherent with timeline, resources.\r\nThe only thing I want to advice is that the budget should be broken down more/ or added more specific costs for each activity.", "q1r": 5, "q2": "This proposal provides me enough information to audit its progress and success. It is well presented with clear roadmap, milestone, key metrics to success (at the beginning of proposal) and possible KPIs. Kudos to the team and goodluck!", "q2r": 5, "assessor": "z_assessor_836", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Colaborar com os atores locais (ou seja, sfgeneva.org, Seedstars, Impacthub) para promover as finanças e o impacto no Catalyst e Cardano", "experience": "Empresário de Genebra, empreendedor, 20 anos de atividades de desenvolvimento de negócios, membro ativo da comunidade"}