{"id": 384774, "author": "azlankonma", "title": "Cardano ♥ YouTube ♥ Permaculture", "url": "https://cardano.ideascale.com/a/dtd/384774-48088", "category": 26244, "amount": 7000, "description": "A adoção em massa de soluções de pagamento descentralizadas ainda não é uma realidade devido à falta de compreensão básica e de confiança na sociedade.", "funded": 0, "upvotes": 21045020, "downvotes": 18567704, "votes_result": 2477316, "votes_cast": 101, "f6_no_assessments": 5, "f6_rating": 3.2, "videos": [], "media": [], "f6_assessments": [{"q0": "The proponent claims that the lack of mass decentralized payment solutions is due to a lack of basic understanding; to address this, he proposes a noble cause: sharing his knowledge of sustainability techniques so that an approach can be made as to why it is important that we evolve to a society with ethical payment solutions. How? By starting a YouTube channel, he can share his knowledge and establish a community. It appears to me that the problem is oversimplified, that the lack of widespread adoption of these measures is multi-factorial, and that, while I understand your mission and find a partial alignment with what this challenge seeks. It also appears to me that the solution is still \"raw\"; perhaps if you told us about the demographic profile of your target audience and your strategy to capture it, I would be in favor of resource allocation; however, at this time, I recommend the author take as references other similar proposals in the community and material in the community portals so that in future Catalyst cycles, I can come back with a more robust proposal. \r\n", "q0r": 2, "q1": "From the perspective of feasibility, it is not a difficult proposal to implement; however, it would have been interesting if the proponent presented at least a syllabus of the topics to be addressed, as well as a brief description of how you intend to present decentralized payment solutions to the general public who is interested in permaculture (this is not explained, but by the profile that I understand would be your target audience, at least initially). While the proposal does not provide the proposal leader's name, I was able to identify his qualifications and experience through the link tree. The requested budget is for the purchase of recording equipment as well as the hiring of video editing professionals. I'd just like to point out that having high-quality videos and material isn't enough to guarantee community building; currently, YouTube is a fiercely competitive environment in which you must discover ways to stand out.\r\n", "q1r": 3, "q2": "Finally, the author provides a 12-week weekly roadmap with a brief discussion of what will occur over the implementation time; nevertheless, there are no obvious milestones in the description. For example, \"audience demographics defined\" should be used instead of \"Finetune demographic promotion.\" Another example: instead of saying \"Build relationships with the community,\" say \" an average of XX number of views was reached.\" Similarly, success metrics must be defined; this is the only way for the community to assess success or failure during the implementation time. I'm going to give it a 3 because, despite the fact that no necessary information was provided, auditing the project is not difficult due to its characteristics.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The idea in this proposal is not bad but I notice there is a lack of precision of what the proposer wants to build. It's not clear if the youtube channel that the proposer wants to create will be about permaculture or about blockchain technology. I would suggest to the proposer to proposer to resolve that as it's crucial for the evaluation of this proposal. Also, I didn't find anything about the value that this project will add to the ecosystem. I think that this is an important point that can be improved in this proposal. Furthermore, If the youtube channel will be created in english, I will not see a high value for the local community as it'll compete with other bigger and already established channels. All in all I think that there is enough room for improvement of this proposal.(Rating 3)", "q0r": 3, "q1": "The proposer has not specified his knowledge on blockchain technology. Since the proposer wants to create a youtube channel, I think that a minimum of blockchain know-how is required. There is also not enough informations about the team needed to carry out this project successfully. However, the budget is broken down into identifiable items which is positive for the proposal. Now, I think that 4000 $ to buy starting equipment for the youtube channel is too much. I'd rather allocate more funds to the video production instead, which will add more value to the project. In addition to that, there is only a milestone of 3 months which, to me, is a window too narrow to measure success. Based on all these details, I don't have a positive vote on the feasibility of this project. However, the proposer can turn this around by implementing the advice made above. (Rating 3)", "q1r": 3, "q2": "This project can definitely be auditable, but it won't be an easy task. The roadmap is broken down by weekly items which are too narrow of a window. I think that the proposer should focus on a larger window frame: for instance 12 months. Furthermore there is a lack of precision on the metrics that the proposer defines as success. Also, the description of the problem and the description of the solution are not clear. I think that the proposer can improve this proposal a lot by understanding the challenge and better identify the problem that the proposal needs to solve.(Rating 3)\r\n", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Based on the previous funds, where there was a mass on ytb proposals, I am not sure if this one would succeed either. \r\n\r\nNevertheless, the proposal is in accordance with the challenge goal, is nicely put, and is well designed. \r\n\r\nOutreach to people via ytb is always a possibility to educate, spread the word and possibly attract new people.\r\n\r\nRating given 4. ", "q0r": 4, "q1": "The experience stated seems to be sufficient but more information is required in this regard.\r\n\r\n1000 subscribers as a successful goal seems also attainable. \r\n\r\nRating given 4. ", "q1r": 4, "q2": "The budget is described in a required detail and a roadmap with a weekly detail is provided. Both of these provide a solid basis for auditing.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses the challenge and aims in growing the Cardano community through eductatio in sustainable development with a focus on blockchain technologies. It would be great to hear how you intend to integrate these 2 topics in future proposals", "q0r": 4, "q1": "Whilst the proposer has the requisite knowledge with regards to permaculture and sustainable design it is unclear wether the proposer has the relevant experience in blockchain and video content creation to execute the project and the fund request is vague therefore I am unable to determine feasibility of the project.", "q1r": 3, "q2": "The roadmap is detailed and well laid out however there needs to be KPIs referenced that would allow for a clear path to audibility. and how this has a positive impact on the ecosystem as a whole. The goal of 1000 subscribers is a great start but what other value does it bring?", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This proposal touches the challenge as it builds a Youtube channel about sustainable eco-systems called Permaculture to spread information about Cardano. It matches the idea of Cardano at the point they both want to build a decentralised and sustainable community. Although after the proposer upload videos about Permaculture living on Youtube, he/she will post videos about Cardano, I think the impact of it on the Cardano system is not clear and difficult to measure. Since Cardano has its presence on official and non-official channels, open one more Youtube channel about it will make what more different and to what extent?", "q0r": 2, "q1": "I have checked the website about Permaculture and its works, I think the proposer is capable of leading this project. The development plan is detailed. However, it's about the impact that makes me think feasibility to run this proposal is not enough. ", "q1r": 3, "q2": "This proposal provides insufficient information to assess its progress. It would be better if the proposer added more information about what the Youtube channel stands out other Youtube/platforms available out there.", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "Ensinar Sustentabilidade faz com que você questione práticas insustentáveis em larga escala. Isto dá espaço para discutir por que os criptos são essenciais.", "experience": "Ensinar Práticas Sustentáveis como a Permacultura me dá a oportunidade de propor a adoção em massa de soluções de pagamento éticas aos profissionais."}