{"id": 366753, "author": "", "title": "Collude: Empowering Artists In Film", "url": "https://cardano.ideascale.com/a/dtd/366753-48088", "category": 26103, "amount": 90000, "description": "映画業界は100年以上にわたり、中間業者や代理店によって運営されてきました。そのため、アーティストの賃金は低く抑えられ、投資家のリターンも低く抑えられてきました。", "f6_no_assessments": 2, "f6_rating": 2.5, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=0"], "media": [], "f6_assessments": [{"q0": "(I have experience from crowdfunding in the film industry and I have written a script that never got produced so the proposal did hit home).\r\n\r\nAs I read through the proposal I kept asking myself: what does this have to do with Cardano or blockchain in general? I was genuinely waiting for something awesome. Then I reached the \"Why Cardano?\" section. The answer was underwhelming:\r\n\r\n\"Collude's mission statement is 'We listen'. Listening is the major part of our strategy and market approach. It's crucial to create a safe domain in which the community can easily & safely communicate their hardships and pains. Through listening, it's possible to create an environment in which knowledge is shared with the possibility to collaborate toward a common purpose or even creating ​​ a sense of urgency to help others to get involved and attain meaningful goals. Listening is the first stage in building a collective identity that is distinctive throughout the market. The Cardano Ecosystem has a lot of parallels with the goals we want to achieve and the technology stack fits perfectly to the platform.\"\r\n\r\nThis is an example of what shines through the entire proposal: the two full-time team members are very deep in the idea. They believe in what they do and they have put countless hours in planning this. That's all commendable, but the Cardano part feels pasted on. This proposal is not about a dApp per se but the idea behind it.", "q0r": 2, "q1": "This plan is huge. Any amount of money requested would not be enough. In the comments section it's mentioned that main funding comes from big production companies... but that funding is not yet secured. Therefore this proposal runs the risk of pouring money into well (or into a machine like on that fantastic introduction video). The first commentator suggested scaling the proposal down but I don't see the feedback incorporated here. It's still massive. Desmond Tutu said: \"There's only one way to eat an elephant, one bite at a time.\" You need to define the first few bites and then come back with a very Cardano-specific proposal. Or perhaps you could collaborate with these guys: https://cardano.ideascale.com/a/dtd/369424-48088", "q1r": 3, "q2": "If I understood correctly the proposal is asking $30K to hire one or more Community Ambassadors (this is not outlined before in the proposal, so it remains unclear). The remaining $60K is earmarked for to-be-hired developers and technology partners (based on the green checkmarks I'm assuming nft-maker, mirqur.io, mukn.io and clearcontracts). It would be much easier to say \"yes\" if those developers were already part of the team. I encourage you to go back to the drawing board, focus on the blockchain / decentralized app aspect of this and make a kick-ass proposal for Fund7.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 11, "ne": 3, "ng": 4, "nfo": 4, "vca_o": 1, "reply": "The Elephant in  4 Parts\nThere are 4 different stages to bring a movie to market:  Aquisition, Production, Licensing & Distribution.\n\nour Project is focusted on Aquisition - our future goal is to go down the rest of the value chain once aquisition is perfect in a decentralized way.\n\n\nREGARDING 30K\nYes,e the 30K is for building the community. As seen in the roadmap we want to creat a discord community and individual Surveys - Actors, Writers, Screenplay Writers, Directors (around - 500 participants)\n🏁 Creating Community Platform (Discord - around 500 active participants)\n\nChannel for listening to the Community\nIdea Creation - Solutions\nCollude Platform Feature Channels\nCommunity Feedback Channels\nInformational Content Creation\n🏁 Audio & Video Information Channels:\n\nFilm Industry How to's Guide and first (Audio & Video)\nRecorded 1hour Interviews (around 50 - 100 ) Young Talents (day to day life - understanding & addressing problems)\nActors, Screenplay Writers, Directors, Producers, etc\nInterviews with Professionals (around 50 - 100):\nActors, Screenplay Writers, Directors, Producers, etc\n\nan Ambassador is just one small part. \n\nRegarding 60K\nand yes the ones with the check marks are are the potencial partners we are talking to. They are not part of the team but collaborators. As example Nft-maker.io  is will to let us use its api witch will enable us to create a Market plase for screenplays as NFT's \n\nRequested Amount:\nYes the requested amount of money will not be enough for the scope of the project. However, it will be enough for the milestones we set up. "}, {"q0": "I really love this idea and is something desperately needed in the film industry to protect all key players and roles. Although there are many risks, losses and financial liabilities involved in such a process. Although the prospect of a project like this significally enhances that industry the risks are greated than the solutions. There needs to be more work to build this up but the business plan is there and the passion is present.", "q0r": 3, "q1": "The experience is shown by the wide composition of the team. More information regarding how funding for a conceptual model like this would ensue. What are the contracts and the difference is distribution of wages per role and who decides these. What if the role is not fulfilled as envision who has the central authority on the matter and how will this process ensure quality in the film industry.", "q1r": 3, "q2": "The information provided Is quite detailed but no detail roadmap, stages/timelines and how the technology AI/Blockchain is being built for the purposes of the solution. The proposal requires more developers and the funds requested are not clear on how they are itemized.", "q2r": 2, "assessor": "z_assessor_594", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "Contracst & Compensation\n\nThis will we be done through the community by using surveys and other methods of data aggregation we \"Listen\" to the community and react to their needs. This is the main reason whey its crucial to  build a community. The community can take action throught  main interface which is the  wallet that enables the community to vote on the direction the platform should be developed (governance)"}], "solution": "Colludeは、すべての映画業界のプロフェッショナルが、公正で透明性のある条件と取り決めのもとで共に働くためのプラットフォームを提供します。", "experience": "10人のチームは、デザイン、ソフトウェア開発（例：NLP-トランスフォーマー・アーキテクチャ＆フルスタック）、メディアビジネスの経験を持っています。"}