{"id": 366731, "author": "", "title": "Cardano features for everyone", "url": "https://cardano.ideascale.com/a/dtd/366731-48088", "category": 26103, "amount": 50000, "description": "トークンの鋳造、燃焼、トークンの追跡、トークンの登録などの作業は、技術者でないユーザーにはアクセスできません。", "f6_no_assessments": 2, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "- This is an incredible idea. I have a full-time job and one of my nightmares is that almost nothing is user friendly, almost nothing is intuitive and easy to understand. This will definitively create value to the Cardano community. As the community grow bigger, it will be mandatory to create some user-friendly platform in order to make it popular and allow common people (not technical) to enter in this universe. ", "q0r": 5, "q1": "- The fact that the link provided (cardano-tools) is already working is a good proof that the proposer is able to make it happen.\r\n- One point that could be better explained is the budget. There are lots of things and some of them with great value, however it's not well defined where or how it is going to be used. Because I'm not a developer it's quite hard to understand why would you spend $20K in 'userinterface for smart contract', e.g.. Besides that, it could be included all the resources needed to develop everything that you're intending.", "q1r": 4, "q2": "- It's missing a good roadmap with milestones in which we could expect to follow and see the development of each step.\r\n- There are no metrics and KPI (written) defining success (such as # of NFT added, burned, cash flow, etc). Moreover, it would be good to create a range expectation in different time frame and somewhere to display all these infos allowing us to keep track of the success of the platform.\r\n- Would be great to have a more explanatory budget – since you're asking 50K (20% of the fund)", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": " i agree, there needs to be more ease of use and accessability features if mass adoption is the end goal. Most of the average person are not aware of things that are not part of their educational structure. So easy of use is of paramount importance and this challenge addresses in part what can be done to improve aspects of Cardano ecosystem.", "q0r": 5, "q1": "The experience and the detail plan shown in the roadmap gives confidence in its inplementation. Also the fact that the proposer is a Plutus pioneer.", "q1r": 5, "q2": "There is no timeline as to the first, second and third step of how success is achieved. Perhaps more detail ad to the metrics after funding could help audit the progress along a set timeline.", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Webアプリケーション https://cardano-tools.io は複数のワークフローをカバーしていますが、最新の状態に保ち、さらに機能を拡張したいと考えています。", "experience": "約10年間のフルスタック・デベロッパー\n\ncardano-tools.ioのクリエーター\n\nPlutusのパイオニア"}