{"id": 366766, "author": "", "title": "NFT Business lessons", "url": "https://cardano.ideascale.com/a/dtd/366766-48088", "category": 26103, "amount": 21000, "description": "問題提起\n\nNFT Artを作ったことで得られた教訓を、他のビジネス分野にどうやってアピールするか。", "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal has value, and its implementation would have great benefits. If technology improves over time, more thought might need to be given to verifying ROI. I understand we need to work with these changes but also identify the life cycle of each of that implementation phases and the returns. Overall was not completely clear to me the benefits and value to the entire community and the long-term vision with structure from a business plan or activities mapping.", "q0r": 4, "q1": "If the correct team is put together to develop improvements to the website, this could have a lot of success and create a lot of adoption in the crypto space. This proposal is great because it helps address the challenge, is a great concept for the NFT space, and is a good way to put Cardano to use.", "q1r": 4, "q2": "This proposal will be implemented successfully based on the experience and plans of the proposing team, though I suggest more information be included within the proposal regarding the relevant experience of the proposer in managing initiatives of this nature, as well as a more detailed plan and budget for the tasks described. Overall the videos were great and the general idea and enthusiasm we can see from the videos are extremely positive.", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "- I really enjoyed the idea, however I think of it more as a `proposer outreach' challenge than a dapp, since you're creating a series of videos (content) creating awareness of this world to artists, taking your experience and teaching others.\r\n- However, I think this have a great impact on the artist lives, since it enables their art to reach the entire world.\r\n", "q0r": 3, "q1": "- The proposal would gain if the budget and the timeline of creation were more well defined. E.g., why do you need 7K/month to create videos and adds? In which frequency could we expect a new video release? Which platform it would be used to marketing?\r\n- If I understand right, the money is only for advertising, therefore, I imagine that some percentage of the transactions happening inside the platform will be your revenue and, part of this will be used to reinvest and keep things running, right? \r\n", "q1r": 4, "q2": "- The lack of a roadmap (how many videos per week, e.g.) and a clear budget (how it will be spent, in which platform, etc) troubles me, because I really don't know what to expect, therefore it is quite difficult to audit the proposal.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I feel this proposal should have been entered into the \"NFT Business Model\" fund category since the proposal has NFTs at the core of the business model proposed. For this reason, I believe the proposal did not effectively address the challenge", "q0r": 2, "q1": "Although the team provided a links to a website and youtube, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\" ", "q1r": 3, "q2": "The team provided a minimal roadmap (timeline) and a single line budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond a single line entry and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal meets the objectives of the challenge well, because, as noted in the passage \"The crypto space is an intimidating world to many and needs a large amount of demystification\", the authors intend to demystify the use of NFT to different types of business. The authors already have experience with the creation and transaction of NFT, as we can see from their previous works, which involve the creation of NFT for drawings and paintings (they can be verified through the attached website, madinart). Therefore, it is positive that they intend to expand the use of NFT to other fields, as mentioned, for example, in sports and literature, attracting new users to the Cardano ecosystem. The authors are also aware that NFT transactions are complex for most people, as can be seen from the passage quoted here). It is also extremely relevant, because facilitating and getting this information to more people is certainly a powerful way to attract new users. In addition, we can be sure how the work done so far, NFT in fine arts, was useful and successful, through the artists' testimonials, which were attached.", "q0r": 5, "q1": "The team involved in the proposal is very confident in terms of technical preparation to execute the project. In addition to having access to the work they have done so far, through the attached website and the included videos as well, there is a particular description of who they are, what each member does. It is a very complete team, which has people for the most diverse functions. Although we know who they are, it would be even better if we could have access to the linkedin of each involved, or even social networks, some place where we could get to know each one's particular work. However, due to the fact that they already have successful activities using NFT and a ready and functional platform, the credibility of the team is solid.", "q1r": 5, "q2": "Regarding the proposal's applicability, we have several positive points and some details to improve. The authors clearly specify what their main goals are, which are to create videos and short documents on topics relevant to the Cardano community, such as the importance of cryptocurrencies, digital wallets, NFT, and so on. They also explain where the financing money would go, rather superficially. We are told what the spending needs would be, but not how much each would require. ? They also claim to have the intention to monitor activities over time, but do not say how often this monitoring would take place or where the data would be provided to the community. In fact, it is not at all clear where the content created would be published, it is always good to make it clear how this contact would be established between the public and the project. Another detail I missed was setting dates, a temporal sense of how things would happen. The authors explain how much money would be needed per month, but they do not say how long the content would be created, when they would be released, how much time each would receive to promote the next content. For these reasons, I believe we have a good, but not complete, notion of how this project would happen in practice.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "It is a magneficent idea and the team appears to have the passion for it. The testimonials speak volume as to the potential reach of this business in the NFT space.", "q0r": 4, "q1": "The plan and the objective is quite noble and the reach ha sa potebtial to expand Cardano native assets and grow the NFT market to compete with existing alternatives in the market. The team is vast and ecompasses many areas required to achieve their goal. The plan has no key metrics tho to detail how the project is measured in terms of progress and funds used.", "q1r": 4, "q2": "There is no timeline present to detail the projects besides some KPIs to measure deliverables. No 1 , 3 or 6 month progress report or how the funds are distributed in reaching the end goals arent a clear definition. The testimonails show great results and the money raised from only 3 artist reveal a great potential team .", "q2r": 4, "assessor": "z_assessor_594", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "ソリューション\n\nNFTアートで多くの人を惹きつけ、その経験を生かして他分野のビジネスソリューションを作る。", "experience": "私たちのチームには、40年以上のセールスとマーケティングの経験を持つビジネスマン、プログラマー、グラフィックデザイナー、ビデオグラファー、アーティストがいます。"}