{"id": 366914, "author": "", "title": "Planet Cardano - Gamification", "url": "https://cardano.ideascale.com/a/dtd/366914-48088", "category": 26103, "amount": 70000, "description": "現在、カルダノとNFTにはエキサイティングな使用例がありません。ある口座から別の口座にNFTやADAを送るのはとても退屈です。", "f6_no_assessments": 4, "f6_rating": 2.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "- I understand what the proposer means by the problem statement, however I disagree. We cannot think in Cardano only as a method to transmit and receive funds. More than that, it's another level of network in which the validation (to not extend that much) is much more efficient than the others (more scalable, etc), and with several other world solutions.\r\n- What I do agree is that having more ways to use the network and it's capabilities is good and the gaming world is enormous and growing bigger each year.\r\n- One thing that should be more well defined is how much people you're willing to engage, how much interaction it would generate, and the target of the game. More than that, how are we going to reach them.\r\n", "q0r": 3, "q1": "- One aspect is that there are some need of budget (of course), however the spent are not very much detailed – it would be great if there were more explanations in this.\r\n- About the target players: Who are we expecting to play? How is the NFT be bought and spent (spent in the game or between users)? How are the marketing being done in order to give visibility to the game and who is the target?\r\n- I really think that game is an awesome way to make Cardano shine, however I expect a bit more of details.", "q1r": 3, "q2": "- Since there isn't a well defined timetable, detailing of budget required, there's no much room to audit. \r\n- Since it's a game, I imagine that is not that difficult to add some milestones for us to expect while playing  (day X will be implemented the dungeon, e.g.)\r\n- Other aspect that makes it richer is to add the number of players registered and playing .", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "this is an idea, not a proposal. the challenge is not effectively addressed.", "q0r": 2, "q1": "the existing experience is clearly shown in the video. many details that characterize a good mmorpg are not present. the product has no unique selling point. NFT`s in games are already used. a precise schedule with deadlines is not defined.", "q1r": 3, "q2": "in my experience, mmorpgs are not a single or team project, but require a high number of employees and an already existing infrastructure to cope with today's challenges of mmorpgs. even if it becomes a browser game, a comparatively low to very low number of players can be expected. risks were not considered.", "q2r": 1, "assessor": "z_assessor_260", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The idea meets the objectives of the challenge well, as it proposes to use ADA and NFT in a more playful and desirable way for a public that is not necessarily intending to invest and carry out contracts involving the Cardano ecosystem. In that sense, it's a relevant app; the problem I noticed here is that everything is still very abstract, mainly in relation to how the game would be organized (lots of element ideas, but I wouldn't say they are very well organized and connected). We have a general notion of how the game would be built, even because we are provided with a video with a teaser and an interactive link for the future game, but I didn't think this was necessary to produce a strong notion of the game, so that we can visualize it . I've seen some similar proposals in f5, which aim to unite the gaming world with our ecosystem. This union is undoubtedly a big bet, however, the idea needs to be more detailed, the game needs to be more forwarded to match the funding money that was requested.", "q0r": 2, "q1": "The author claims to be a developer with good experience with creating tools and with programming languages ​​that are pertinent to the Cardano ecosystem, which is very positive, but not enough to make this idea happen. Unfortunately, we don't have a linkedin link or even a more detailed description of the author's trajectory, nor do we see here a list of future professionals who would be involved in creating the game. In the part where the author talks about the division of expenses, he mentions that some professionals would be hired, such as graphic designers and artists to create the visual effects, but it would be more interesting if he had given more precise information about the team. With the requested financial amount, how many people would be hired, for example? These and other questions left me a little confused as to how the author and his team would work, compromising the trust that everything goes well and is a little shaken.", "q1r": 2, "q2": "We have a fair amount of detail here, however, I found them a bit loose. I'm gonna explain. We have information that the game would be ready in about 6 months; but within that time, what would be done, and in what order? It would be good if the author created an action plan based on weeks or months, for example. The author talks about various elements that he wants to include in the game, such as different scenarios, missions, customizations and so on. It gives me the impression that it would be an RPG universe. But just as it is not very clear how ADA would be used (I believe for the sale of objects in the game, for example), we also do not have an established connection between these elements. For example: caves and cemeteries, buildings with various props, such as chairs and tables... what is the connection? I thought, unfortunately, the vision became too abstract. Therefore, I couldn't think of how the game would be created, which phases, if there would be a beta version, who would be the audience that would test it... I think it was very important that the author also clarify how he intends to promote the game in the gamer community, it would be on which platform? The intention is to attract another type of audience to our ecosystem, but we need to understand how. Finally, although the author gives us a general idea of ​​how the financial amount would be used, these divisions are not very detailed. For example: paying employees (which, exactly?), setting up an infrastructure (what do you mean? a work environment?), etc. Unfortunately, how this project was to become a reality was very confusing to me.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "It is a great idea to expand the ecosystem into gaming and the solution os quite interesting, but more details in regard to the planning behind delivering the solution needs to be clear. Chapter 1 delivered as a testbed in first 6 months? What are the funds used for particualrly and how will it be connected in the blockchain.", "q0r": 3, "q1": "There is a video to highlight experience in this space and great start. Hard to assess the level of experience as we can only see a map and some basic animation. There is no clear definition what employees are doing and what their expertise in the project is.", "q1r": 3, "q2": "There is no breakdown on how the funds are used or a roadmap detailed as per delivery of progress nor kpis to assess where the project is up to. There is items to tackle explained but more information regarding delivery of the solution and execution needs to be made clear.", "q2r": 2, "assessor": "z_assessor_594", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "カルダノを使ったMMORPGを作る", "experience": "約10年間のフルスタック・デベロッパー\n\ncardano-tools.ioのクリエーター\n\nPlutusのパイオニア"}