{"id": 366908, "author": "", "title": "Dapp to control/monetize your data", "url": "https://cardano.ideascale.com/a/dtd/366908-48088", "category": 26103, "amount": 46850, "description": "今日、企業はあなたのデータを持っており、それを自分たちの利益のために（誤って）使用しています。人々は、自分の個人データの使用をコントロールし、そこから利益を得るべきです。", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"q0": "'- This proposal is amazing. I remember the fund5 proposal and assessed and voted positively. I really thing that the world is changing towards these kinds of policies. Since the appearance of some data leakage scandals, and use of personal data to even manipulate elections around the world, this is a huge think to start addressing. \r\n- Implementing this solution in Cardano world is amazing, meaning that it can mint hundreds of thousands of users and business.", "q0r": 5, "q1": "- This proposal is sorted out, knowing how to start, where it want to reach and how you`re going to get there.\r\n- Plenty evidence about the capabilities of the team.\r\n- I've seen that you state about talk about 'pressure regulation', and I imagine that the law of each country may differ a bit. That being said, How are you going to address this scalability problem?", "q1r": 5, "q2": "- The proposal would gain if you could add some milestones in order to allow us to verify how is the implementation going.\r\n- Another point is to add, in the app, some place that we could see how many active brands and users it has, it gives authority.", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This Dapp proposal focuses on privacy and being able to be in control of any profits made from your data. It looks strong on the integrations front where the company is looking to have integrations into PRISM also. To be able to control your own data, prevent it from being misused and also comply with regulatory bodies with issues such as GDPR it looks like this Dapp will add real value to the Dapp marketspace. ", "q0r": 5, "q1": "The plan clearly addresses areas of fees-ability, cost and mitigations. It covers crucial stages that will make the proposal successful, such as development and marketing and adoption to get the right product market fit. Additionally it would be useful to see some graphics highlighting the utility of being able to monetise ones own data. And draw comparison against existing models such as how does it compare to Braves ad model?, maybe they don't match but a SWOT analysis into the market place may help make for a more favourable outcome when finding the correct market.  I do question whether or not 20-25 days of developer time is not a long period of time to build a good proof of concept, so it could be difficult to get something good out the door in time, despite this current team look capable and will have a proof of concept that will spark interest from the stakeholders involved. ", "q1r": 4, "q2": "Given they have defined what a successful outcome will be, the proof of concept will be adopted by the signed up SME's and integrated into their app and have good integration into Ada wallets. However there will be greater accountability if there was more detail in the public roadmap found on their website https://profila.com/catalyst/ and regular reports and updates showing if they were on schedule or not. ", "q2r": 4, "assessor": "z_assessor_332", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The dapp suggested here is extremely relevant and meets the objectives of the challenge very well, because it promises to give people back control over their data, often \"stolen\" by unfairly by websites, applications, etc. in Internet. In fact, this is a very current problem, which despite the fact that many people are out of it, affects basically everyone who has access to the internet these days. And if this application really fulfills what it proposes, it would be a great revolution of users for the websites/applications, and it would still greatly benefit the Cardano community, since the use of smart contracts would be present. It is also positive the fact that this proposal is already present in fund 5, and also that the application is not just a theory, but exists in practice. The author explains well about how dapp works, that, for example, users can have better control over how companies and brands use their personal data through direct monitoring. Furthermore, according to the author, Profila selects some crucial information from the contract between brands and users, such as what data will be made available and for how long the use will be allowed. In fact, these are variables that most of us (myself included) have no idea how they operate, and it's super beneficial for the consumer to have a handle on such information. After a long detail of how dapp works, the author of the proposal explains how the Cardano ecosystem technology would be used, which is basically to make the contracts accessible to everyone and better manage the payment rates that involve the case transactions. This is really useful, as the author explained, because once your contract is in blockchain the user can file a complaint against the brand, and prove through the smart contract what he is complaining about.", "q0r": 5, "q1": "The author of the proposal has the necessary technical knowledge to carry out your project, according to what we are told. He is a lawyer, privacy oriented, understanding marketing and virtual currencies. It would be important to see some examples of their previous work in order to increase reliability. Despite this, the author provided us with numerous extra information about dapp, such as the target audience, marketplace, number of brands and active users at the time, why brands would participate in dapp and many more, which demonstrates broad domain over all fronts of your project. And as a lawyer, he demonstrates complete ownership of intellectual property assets. I had the opportunity to take an online course on this offered by the world intellectual property organization, and I know how extensive and detailed the subject is, so I believe that an expert on this issue is more than necessary for the proposal to succeed. Although this project needs other types of professionals to fully occur, we see that the author has this intention, to form a team, as stated in the comment below.", "q1r": 5, "q2": "At a certain point in the proposal, the author explains how the funds would be used, and which professionals would be involved in each step. That way, it's pretty clear that he has a solid plan for what's going to happen next, what steps to take, and in what order. It would have been even more interesting if he had provided us with two things: 1) a better temporal sense of how these steps would take place, that is, in which months of the year 2) it would be perfect if there was some notion of which professionals would be involved in each part of the project , however, this is still open from what I understand (no problem, but it would be even better if we already had this knowledge). Furthermore, I believe the auditability of the project is well understood, as well as the success metrics, as detailed at the end of the proposal.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "This is trully an innovative idea and one with the potential of having real life application and changes to individual rights and privacy features. The team is lretty solid and the roadmap is heading towards great results.", "q0r": 5, "q1": "The team is very solid and The track record shows great progress in the deployment of the plan through various funds.", "q1r": 5, "q2": "There is an excellent plan, and detailed stages of the projecr to audit the progress. The fund allocations are reasonable in funding their work. Great work keep it up guys.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "This proposal wlll 100% add value to the end user, and add value in more ways than just monetary. People will be able to create another stream of income, as well as have peace of mind as to how and where their data is being used.", "q0r": 5, "q1": "The team has an \"inside man\" with a privacy tech lawyer on the team. They have a well rounded team along with a detailed roadmap as to when they can bring their POC to work. They have also been working on this project and funding it themselves before catalyst which shows dedication and personal investment.", "q1r": 5, "q2": "The proposer provides more than enough information for us to audit their progress and success. They have laid out what success looks like to them and at what intervals they expect to meet those goals. We have specific geographical goals to reference along with community concerns being direcctly addressed to measure success.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "合意に基づく顧客データ（D）アプリ、スマートコントラクトを利用して個人データのライセンスを記録、データ＆注意力を補償する", "experience": "消費者のプライバシー、デジタルマーケティング、データの権利、仮想通貨など、（プロジェクトに関連する）法的問題において10年以上の経験を持つプライバシー/ハイテク弁護士。"}