{"id": 367129, "author": "", "title": "projectNEWM: Fair music ecosystem", "url": "https://cardano.ideascale.com/a/dtd/367129-48088", "category": 26103, "amount": 60000, "description": "ロイヤルティ分配システムが崩壊し、音楽そのものが集団としての性格を失っている。レーベルが力を持ち、アーティストは苦戦しています。", "f6_no_assessments": 2, "f6_rating": 2.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "At first glance, this proposal and problem statement seemed a bit lackluster in its information. However, I found that it was much clearer explained in the attachments. Just something to bear in mind. \r\n\r\nFrom my understanding of it, the proposer is looking to create more balance in the royalty distribution of original music created by artists by creating a music streaming (and eventually royalty-auctioning) platform on the Cardano Blockchain. \r\n\r\nThe music industry does have a huge user base both from artist and consumer point of view, and the product provides an incentive for both artists and consumers who wants to support them. Although there are some applications on other blockchain that adress similar problems, not many are currently specializing in focusing on the music industry, which might provide additional incentive for artists to migrate or use the platform. This might serve the awareness and adoption of Cardano well, since it is targeting such a large and broad user base. \r\n\r\nThe allocation of the desired treasury funds are clearly stated in the proposal, and includes a scaling plan for the future development of the project. \r\n\r\nI agree that this proposal effectively adress this challenge, although there is a case to be made if this proposal would be a better fit under 'NFT Business Models'. ", "q0r": 4, "q1": "The team seems to have broad expertise to work on the project (along with a set of advisors to further strengthen the needs of the project), but the credentials and expertise of most team members cannot be validated unless you do a lot of research. The tokenomics points to a long term engagement from the team (5 years+), along with a somewhat detailed plan for the funds applied for during Fund6. \r\nConsidering that the projects growth initially is highly dependent on marketing and artist outreach, I would've liked a more detailed explanation of the process of how that process is handled. From my experience as an active musician, developing an active ecosystem where artists, labels and consumers are involved requires either a long amount of time or key contacts in the industry. The incentive as to why artists choose to use the platform is clearly stated, but what would the incentive for smaller music labels be, in order to put their artists music up on NEWM?  \r\nThe idea that the artist and its fanbase drives the marketing of the platform is a good one, but how does it work if the artist has his/her music on several different platforms? EspecialIy when implementing the auctions for royalties. \r\nI would like the proposal to further describe solutions these potential problems, because they might influence the growth or development of the platform. \r\n\r\nAll in all, I agree that there is a high chance that this proposal will be implemented successfully. Although the long term development is dependent on several key development factors earlier mentioned in this section. \r\n", "q1r": 4, "q2": "The proposer provides a roadmap with an estimated time frame attached, spanning up til mid 2022. We are also given a list of deliverables connected to the fund allocations from Fund6, but without time frame. I would have liked to see a more detailed road map including this set of deliverables, so that the progress and intended development can be followed and measured more clearly by the community. The proposal adress the first product development of the platform, but it is unclear if they would require further funding or if they expect their ecosystem to be self-sufficient after mid 2022. I recommend a more detailed short term roadmap (as mentioned before) and a less detailed but more long-term roadmap for the future to help the community feasibly assess and follow the impact and development of the project. \r\n\r\nWith this in mind, I neither agree or disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "While this proposal at first glance looks to be promise to onboard the user, it is rather onboarding ICO of a new project. Not sure why a catalyst funds are asked for when they plan to submit a token sale.", "q0r": 3, "q1": "The experience of this team within the specified industry is not mentioned in the slide desk. Given previous technical projects, it is fair to say this lacks the confidence in completing it.", "q1r": 2, "q2": "Sadly, there is almost no details about how the process or the success will be measured.", "q2r": 1, "assessor": "z_assessor_490", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "私たちのストリーミングサービスは、すべてのロイヤリティを公正に分配し、すべての人に公平な競争環境を提供します...。ロイヤリティの証券化...", "experience": "ITアーキテクチャー、マーケティング、プロジェクト、パートナーシップ管理などに深い知識を持つ、経験豊富な7名のチーム。"}