{"id": 367132, "author": "", "title": "Connect discord with cardano", "url": "https://cardano.ideascale.com/a/dtd/367132-48088", "category": 26103, "amount": 4500, "description": "ソーシャルメディアチャンネルをコミュニケーションだけでなく、オンチェーンツールのブリッジングメディアとして使用する可能性はまだ検討されていません。", "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "Wow, it's truly amazing what you've done here on your own. Integrating with other apps is a huge plus for Cardano. Discord has a huge community. Getting more wallets to support this functionality would be great.", "q0r": 5, "q1": "Given the work that was already done and the commitment to upgrade and improve,  this looks like a success already. The budget allocation is clear and very considerate. This project is already busy succeeding and these funds will make it pounce to it's desired state.", "q1r": 5, "q2": "Best proposal I've read ever and definitely leads by example. The problems and solutions are stated very well in detail. The project is already running successfully it just needs an upgrade, so in a sense, success has already been defined. The fact that you can already test the product makes it easy to assess progress.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Integration between Discord and a member's wallet would allow several ways to increase accountability and certainty about who is engaging in our community server.", "q0r": 5, "q1": "Since this is an existing product that is being extended, it is reasonable to expect successful completion. \r\nThe Proposer has a good track record of delivering updates to the Product.", "q1r": 5, "q2": "The addition of Smart Contracts into the interface is no trivial matter, and one line is devoted to this topic in the proposal.\r\nThe proposal has no timeline shown for the proposed work effort. \r\nWhile the proposer has done well in the past on the development of the product, We do not see a link to a github repo, or any other such link to audit development.", "q2r": 3, "assessor": "z_assessor_593", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal increases transactional connectivity between social tools. I like the synchronicity feature, this is an extraordinary ability to show and give access using Discord servers.\r\nI see a potential of greater adoption in short amount of time for Nami wallets if the products is marketed to Discord Servers where the showcasing of who owns what tokens has great value or access tokens are used for unlocking channels.", "q0r": 5, "q1": "We already see a working application and through a brief discussion with the owner, I can tell he knows what he's doing.\r\nHowever, I would suggest you be more specific in the relevant experience section, what you learned and what skills you acquired, and how.\r\nYou can expand the experience in detailed information.\r\n\r\nIn addition, there is no information about the strategy and timeline to actually convert the features into smart contracts.", "q1r": 3, "q2": "Overall I'm quite pleased with the requested amount and information provided. The service page is quite well designed to understand what solutions you are providing.\r\nOnly the strategy and timeline missing to get the 5th star from me.\r\n\r\nBtw, next time try to answer what are the risks of failing with the project even if you get funded.", "q2r": 4, "assessor": "z_assessor_600", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "ウォレットとソーシャルメディアのプラットフォームを簡単に接続する方法を見つけ、その上にサービスを構築して、便利で速くて安全なユーティリティを提供します。", "experience": "学校（ドイツ）を卒業したばかりで、ブロックチェーン開発のスキルを独学で学び、カルダノの進化と並行して成長することを楽しみにしています。"}