{"id": 367183, "author": "", "title": "IGIVIT Phase2: Beyond the Prototype", "url": "https://cardano.ideascale.com/a/dtd/367183-48088", "category": 26103, "amount": 57440, "description": "慈善団体への寄付は透明性の高いものでなければならず、一般の人々は自分の寄付がどのように使われているかを正確に知ることができます。", "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": ["https://youtu.be/p3VmzNnVbuY", "https://youtu.be/rEmp6_9W3uY", "https://www.youtube.com/watch?v=AftfAbJMxQE&start=6445"], "media": [{"url": "https://drive.google.com/file/d/1GipDW9nFp2wdOhCfsxjOw3sgmdmKSCAY/view?usp=sharing", "title": "Cardano Summit 2021 video"}], "f6_assessments": [{"q0": "- I'm thrilled with the widely adoption possibility. It's great to see blockchain, moreover, Cardano being used and thought in projects which aims to help people around the world.\r\n- One point that I've not understand is that in this proposal is mandatory the presence of an auditor, which is going to verify if that certain charity is converting the ADA (e.g.) to fiat and using to buy or building the thing it was supposed to. Therefore, isn't it a problem for scalability?", "q0r": 4, "q1": "- It is noticeable, and was proved by you, that the project is feasible, however I have some points:\r\na) it seems to me that if you don't get funded the project will stop – or there is another method to capitalize and make it continue?\r\nb) how the auditors are going to be selected?", "q1r": 4, "q2": "- The transparency given until now is amazing.\r\n- How will be chosen a trustful auditor? How is he going to be rewarded?", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Providing a DApp that will bring transparency to the charity supply chain and donation flow will attract users to the platform. Thus I agree that the proposal met the challenge of creating an integration to pull in more adoption.", "q0r": 3, "q1": "Although the team provided a link to LindedIn and other websites, I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. ", "q1r": 3, "q2": "The team provided a roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The project aims to provide a tool for organisations/donors and aid-givers to have transparency throughout their operations, I strongly agree such a tool has not yet been implemented on the cardano blockchain and this project addresses such donor issues by leveraging implementations and ideas of blockchain.", "q0r": 5, "q1": "The team is has a wide range of talent, specifically from the data science field that will bring the edge and advantage that this solution will have over other previous similar solutions on the market. The time over which tasks have been spread clearly show that the team will most definitely finish the project with exquisite user interfaces, experience, security and using the best practices!  The budget was well crafted too.", "q1r": 5, "q2": "The project documentation is thorough, the progress of this project can be easily tracked and the code base readily available for the community to audit it.", "q2r": 5, "assessor": "z_assessor_468", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Increasing trust in a transactional process is the one the purpose of blockchain, providing trust into gift giving transactions is a great use case for Cardano. The fact that there is not a lot of identified competitors (but one big Binance) make me think that this is a problem that is worth receiving a solution. \r\nThis project does address the Dapps challenge. \r\n", "q0r": 5, "q1": "This project was elected in F5, and it results in a running prototype and progress can be verified. One of two teammates followed the first cohort of the plutus pioneer program. It will be an asset to manage the devs that will be hired. \r\nThe proposer has discussions with people who works/worked for charity organizations, meaning that he will have useful feedback.\r\nThe budget is detailed and there is a gool level of depth on how money will be spent. \r\n", "q1r": 5, "q2": "The project has a roadmap up to Q3 2022. 3 success milestones are listed, with a clear title but they would need to be more detailed.\r\n9 challenges are listed, and there is a good transparency on the level of threat on the project and how they will be addressed. Also, the high level of details of the budget sheet offers a good way to assess the progress of the project.\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "IGIVITを使えば、簡単に寄付をすることができ、すべての寄付を記録しながらチャリティキャンペーンを管理することができます。", "experience": "私たちは、経験豊富なデータエンジニア/PM/Plutus Pioneerと、フィランソロピーの改善方法を想像する先見性のある個人の組み合わせです。"}