{"id": 367402, "author": "", "title": "Dapp market for tickets and events", "url": "https://cardano.ideascale.com/a/dtd/367402-48088", "category": 26103, "amount": 62000, "description": "従来のチケットマーケットプレイスは、高額な手数料やダフ屋など、ユーザーの利便性やアクセス性に影響を与える欠点や障害がありました。", "f6_no_assessments": 4, "f6_rating": 2.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "There is a need for fair ticket distribution and cutting out the middlemen makes for better rewards for \r\nthe creators of the event and a better experience for ticket buyers. It's a much needed win win situation.\r\nYou have addressed the scalpers issue and a few other issues that are ticket related. Keep a lookout for future challenges in the blockchain environment as well. Example -  There will be other Dapps on other blockchains who will do the same. Will you eventually evolve to adopt support for other blockchains? If Cardano tickets are cheaper they will sell out first and the other blockchain tickets end up going on auction for higher because they have different systems in place. How will you get events to use only your dapp for ticket sales? and not include other dapps. It's possible someone will offer them higher returns than you... in the future.", "q0r": 4, "q1": "More info and evidence regarding the experience of current team is needed to gain trust from CAs and voters. Maybe links to past projects or Profile websites can help with this. A prototype design of user interface can also show commitment and Experience.  The budget and roles for the project seems reasonable. Already having those roles onboard will help alot. Getting funded and still looking for people to fill those roles will stun\r\nproject growth. I know it's not easy to find the right people in a short amount of time, but it would be beneficial for your project and for the trust of the community.", "q1r": 2, "q2": "This proposal provided a detailed roadmap with key performance indicators along the way. Success has been defined by providing the right solutions to the legacy ticket marketplace problems. Some risks still need to be considered as I mentioned in the impact section, although they have paid attention to the most viable risks.\r\n", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal wants to build an application for a decentralized ticket and event market maker. As this solution could attract users to Cardano, this proposals lays within in the challenge. However, the provided plan (technical and go-to-market strategy) are vague. Therefore the intended impact and outcome of this proposal are not clear.", "q0r": 3, "q1": "The teams start with an description of the relevance of the project and the market size. They also present idea about the interface, front- and back-end. However, no technical details are presented, which should make the largest part of the provided plan. To see that this project is not just an idea, but a ready-to-go project, they could also provide some mock-ups and architecture plans. In addition, the team does not provide any references, links or some kind of proof-of-life. Therefore, the given information is not sufficient to expect a successful implementation.", "q1r": 2, "q2": "The team defined a clear date of delivery. However, the presented KPIs are more deliverables instead of measure to assess success (like number of users, number of ticket sales, revenue) in relation to a specific timeframe. Furthermore, we as the community need some documentation sources to track the progress of the project. With the given information auditability is hard for the community. ", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is matching the challenge as it aims to be a decentralized application/platform. I like the proposal because it has some clear goals set. There sure is a need for such a service and the sooner it's implemented the better.", "q0r": 5, "q1": "Although there are really specific plans for what skills and developers the proposer is planning on hiring, I'm missing a few facts. At some points of the proposal, I was left with the impression that the team was already established, but at other parts, it feels like the team is not created yet and it's yet to be formed. For example when you say \"we will finalize our agreements with the talent required\" it feels like you haven't hired them yet, which is ok, given you don't have funding yet. Later on, you say:  \"The founding team...\" which leads me to believe you already have people working on something which is kind of confusing TBH. Maybe you were talking about the mobile devs who have submitted their own proposal, but I'm not sure as you haven't linked their proposal. Just food for thought ... it's not very clear what you mean and I'd suggest proofreading before you make a proposal final.\r\nA thing I very much like is that you have a self-sustaining business model covering your future funding! A bonus is that you're planning on working on top of already working solutions, which is a big bonus for me and every open-sourced project should do that.\r\nOverall I like the proposal, and I think it will have a great impact for the community and will bring adoption.\r\nSuggestion: a few articles can't be considered proof. I easily can find articles saying the opposite!\r\n", "q1r": 4, "q2": "You have provided a good roadmap for your project, and that is a thing I like and expect in every proposal. I think you might have misunderstood what KPIs mean though. Let me elaborate: the goal of creating a working proof of concept can be considered a goal, roadmap, an actionable item alongside many other things. A KPI in the context of your proposal would be: \"we plan to have X number of active users on our platform..\" or \"we plan on bringing X revenue increase over X time\". Even though you don't have proper KPIs I still believe this is just a misunderstanding since not everyone might be familiar with the term.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "There idea is right and most of the proposal is explainig why. however, there's not enough details on addressing it, what is the current competition and state as this is not an original idea.  Wallet integration would be necessary and not mentioned. ", "q0r": 2, "q1": "Market maker or someone that understands the industry would be needed and should be mentioed. Missing details on proposer team. Budget not explained and fairly high.", "q1r": 1, "q2": "While some kpi provided,  they are high level and seem unachievable (android and ios and smart contracts as initial milestone...)", "q2r": 2, "assessor": "z_assessor_562", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "チケットの直接販売、分割払い、スマートコントラクトによる自動再販オークションを実現するdappマーケットプレイスを構築します。", "experience": "オープンソースに貢献し、音楽業界のプロデューサー、レーベル、パフォーマーとのつながりを持つエンタープライズグレードのアプリケーション開発者"}