{"id": 367441, "author": "", "title": "Unique Digital Identity for KYC", "url": "https://cardano.ideascale.com/a/dtd/367441-48088", "category": 26103, "amount": 20000, "description": "多くのサービスで実際に必要とされている、ブロックチェーンの世界における相互運用可能でスケーラブルなデジタル・アイデンティティ・ソリューションの欠如。", "f6_no_assessments": 3, "f6_rating": 3.1111111111111107, "videos": [], "media": [], "f6_assessments": [{"q0": "While a digital identity system is certainly of interest, I feel like this proposal does not take into account , or at least this is not explained, the existence of Atala PRISM (with its dedicated challenge) and how it compares to that.\r\nAs a suggestion, I would like to see a section on the differences between this and Atala PRISM and why there's the need for another identity system in the Cardano ecosystem, and why it would bring in more users and drive adoption.", "q0r": 2, "q1": "As a developer myself, the technical plan seems a bit tight, especially since there are no mentions of how many people are in the team.\r\n\r\nAs a suggestion, I would add the composition of the team as well as previous projects the teams has worked on, to make it easier to judge relevant experience and work force.\r\nIn addition, a more itemized budget could help in judging its feasibility, and it's something you could add next time.", "q1r": 2, "q2": "While the success metrics mention the system to be completed within the first 3 months, the exact requirements are not laid out nor it's clear whether this process will involve the community and how.\r\nIn addition, I would like to see some metrics that reflect how used the application is (like number of id requests), so that we can evaluate the impact on the broader ecosystem and community.\r\nHowever, other metrics are sensible and after addressing the aforementioned concerns the proposal could receive a better score in this regard\r\n", "q2r": 3, "assessor": "z_assessor_131", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has certainly raised a suitable problem that voters should be well aware of if they have ever had to undergo KYC validation. The solution provided seems straightforward enough although I expect there may be some negotiables along the way to complicate the process. In the end if the outcomes suggested can be delivered I see this project as having great  potential for the Cardano ecosystem. I like that the team have chosen a small scale testing metric that will allow for expansion once the kinks are ironed out. ", "q0r": 5, "q1": "The proposer has obvious high level knowledge of the processes involved but I could not verify experience based on the proposal put forward. With such a complex project I feel that an author/team bio is necessary to allow voters to know whom is undertaking such a significant project. The plan is reasonable although the onboarding of a local municipal government may prove difficult with the timeline suggested.    ", "q1r": 4, "q2": "The information provided is sufficient to give reasonable confidence that this is a worthwhile proposal for the Catalyst community to entertain funding. The sensitive nature of identity and the KYC process may have some bearing on implementation of this project. having said that the budget is not extreme and the process may yield high impact knowledge to the Cardano community suggesting that this sort of proposal can add value beyond the obvious outcomes proposed. I would encourage further collaboration with the Catalyst community to seek ways forward and with the ATALA prism feature already in existence, feel there may be common ground there that is useful to the proposer. ", "q2r": 4, "assessor": "z_assessor_53", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal feels more like it should be part of the Atala PRISM which is Cardano's decentralized identity solution.\r\n\r\nCA Background so voters can have a stronger view on the provided assessment: Finance and ML academic background and currently senior associate at an early stage B2B Venture Capital fund", "q0r": 3, "q1": "The problem I see with the solution is that even if successfully built, the adoption and impact on the cardano ecosystem is heavily dependent on external factors such as the adoption the issuance of digital identities by governments. While I fully agree that this is the future, I am also aware at the speed of which government entities decide on such drastic changes. The project might be too early, and the Catalyst F6 funds might have a bigger impact with other DApps for now. Moreover the budget is not very detailed. Based on my experience as venture capitalist i.e. having worked with multiple startups, I am of the opinion that both the budget and plan are too optimistic", "q1r": 2, "q2": "The proposers have provided a quarterly plan, however the milestones could be more quantitative in order to have a more objective assessment of progress and success", "q2r": 3, "assessor": "z_assessor_576", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "DEXなどのブロックチェーンサービスにおけるKYCのために簡単に統合できる、プライバシーを重視した安全なデジタル・アイデンティティ・ソリューションです。", "experience": "ブロックチェーンとスマートコントラクトの開発者、修士研究生、これまでのプロジェクトは分散型マーケットプレイスと電子投票など"}