{"id": 368301, "author": "", "title": "Dolos: dVPN", "url": "https://cardano.ideascale.com/a/dtd/368301-48088", "category": 26103, "amount": 30000, "description": "従来のVPNサービスには、何の気なしに多くの信頼が寄せられています。しかし、歴史を振り返ると、VPNは悪用されやすいことがわかっています。", "f6_no_assessments": 2, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer has identified a problem but the solution to solve the problem is unclear in its presentation: how the Cardano ecosystem could benefit from this proposal? How the Cardano blockchain is used as a back end and for what purpose. The Key Features sections provides some technical aspects, but is hard to find the place where the Cardano blockchain fits well.\r\nNo KPIs/metrics to align with the outlined challenge settings. The proposal isn't able to scale to address the future challenges. A viable applications get built on top of Cardano attracting users. There is no specification about how the users will be attracted by promoting/developing this app. (users' feedback is crucial in the development/testing stage - metrics should be defined)", "q0r": 1, "q1": "No team and team mates roles are defined. No info about experience/skill of the developing team (Plutus Pioneer is vague, the proposer should add experience in the domains on which the team members excel and the relevant skills should be sustained with info/links about the projects that they are/were working for, and relevant info about the programming language they master). The budget is not outlined clearly and and is not broken down into identifiable items. The amount requested is not detailed on what it will be spent. No timetable and milestones/goals to achieve. The proposal is more like a concept than a viable project. The plan doesn't describe the resources necessary to implement the proposal. No clear aspects about what architecture, language and technologies will be used and are crucial for implementation. No risks associated with the proposal's implementation.", "q1r": 1, "q2": "No roadmap and milestones are defined and a time frame is not set for achievement. No KPIs/metrics, that define the success of the proposal, are provided. (i.e.: users attracted to test a module of the app - 500, number of users that provide feedback about the module's functionality - 400, users ' proposals for improvements of the module - 25 etc.). \r\nThere is no clear and understandable solution that addresses the problem.  Is not clear who is the target audience and how Cardano ecosystem will benefit from implementing this proposal..", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Tor does not incentivize running of tor relay and exit nodes resulting in chocking and easy identification of exit nodes. WIth proper monitory reward and a provision for selecting a number of hops the proposed network has potential for large-scale adoption and cryptocurrency plays a crucial role in monetising  the system. This is a unique proposal and all efforts should be made to create such a system on Cardano. ", "q0r": 5, "q1": "The proposer has not enclosed any references to the proposal. However, the proposal is clear in the technical research and explains the process in a great manner. This comes only with a deep understanding of the subject and the proposal is unique with the potential to provide a real impact. With all these facts it can be assumed that the proposal will be implemented successfully. ", "q1r": 5, "q2": "The features to be developed are clearly mentioned in the proposal and the budget is reasonable. The time frame and the open-source nature of the project are not explicitly stated in the proposal. However, it is an important proposal to leave out even with these shortcomings. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Dolosは、Cardanoネットワークをバックエンドとして利用する、分散型の仮想プライベートネットワークサービスとなります。", "experience": "プルス・パイオニア"}