{"id": 368410, "author": "", "title": "ALLIN Betting Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/368410-48088", "category": 26103, "amount": 67000, "description": "現在のアプリは、オールインワンのベッティング体験を提供するものではありません。人々は完璧な賭けを見つけるために複数のアプリを必要としています。ハウスはその中間業者です。", "f6_no_assessments": 4, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a traditional 'wagering' application that is built on the blockchain so that token holders can participate as they would take the place of a traditional casino. The proposal does a good job of effectively addressing this challenge, but there doesn't appear to be a large market for this type of application and a lot of competition in this space.", "q0r": 4, "q1": "This team of 4 individuals is well underway to successfully implementing this application. There is a high probability of success.", "q1r": 4, "q2": "The milestones are clearly defined, but the development will be difficult to audit. Also, the team places a lot of emphasis on social media engagement while the most prominent KPI will be the number of users and the total amount wagered.", "q2r": 3, "assessor": "z_assessor_449", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "The concept of using blockchain to record bets and automatic payout based on the result published through Oracles is an implementable use case. There is an ethical angle of argument against the app. However, anything which is not illegal in a country should be experimented with if technically feasible. The proposal addresses a technology that can spin off other similar possibilities. ", "q0r": 5, "q1": "The proposing team has representation from a wide spectrum of areas and have almost all have experience of working in big houses. It is likely that they have expertise and experience in handling large projects and will be able to handle this project successfully. ", "q1r": 5, "q2": "The proposal is detailed with a clear time plan and a reasonable budget, and The proposal does not include any commitment that the codebase to be built will be open source.  The progress otherwise is likely to be based on reports from the proposers and needs another manner of monitoring. The success of the project is measurable based on the number of the transaction the dApp is registering. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This will have a great impact on the community so I'm all for it. I like the details provided by the proposer, which is more than I can say for 90% of other proposals I've read through so good job on that.\r\nThis application/platform surely fits in this challenge setting.", "q0r": 5, "q1": "I would have liked if there are a bit more credentials to check for the team you have mentioned in the proposal, because as an assessor that would give me more assurance that there are real people who stand behind this proposal and not just an anonymous team. As a suggestion for your next proposals, I'd say put your LinkedIn and Github profiles in the proposal.\r\nI love the idea, I love the detailed description and thought that was put into this proposal and I believe this proposal can reach its potential and get funded.\r\nI really like the roadmap you have set up for yourselves along with the budget breakdown which seems reasonable.", "q1r": 5, "q2": "One of the few projects that have adequate KPIs and a good well-defined roadmap. Having said that I'd suggest for a blogpost or some other way of keeping your community members in the loop of what you're currently working on and how are you progressing with the work in the proposal in general. \r\nReally great idea and proposal. Good luck!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very relevant and directly relates to the main objective of this challenge: to create a dapp that is popular among users and brings positive feedback to the Cardano community. This is because the idea here is to create a place where people can bet, through tokens, and using various betting modalities, as the authors cite, whether person-to-person, sports betting, etc. And they would use blockchain and smart contracts to record their actions, preventing fraud. For these reasons, I believe that the proposal perfectly meets what is sought in this challenge, and if executed correctly and well publicized, it can bring many benefits to the community, especially new members who would adopt blockchain and use smart contracts to promote their bets.", "q0r": 5, "q1": "As far as the team is concerned, I believe that they are well qualified to execute the proposal, however it would be beneficial if there were more details about who they are. In the proposal, we are only mentioned that they are a team that includes developers, blockchain specialists, gambling, etc., that is, everything the proposal needs. And we can see in a more individual way who they are, their names, photos and a very short description about their professional activities. My suggestion is that this description be further elaborated and attached to the proposal itself (not just on the website), so that we could get to know the team members more intimately. It would also be interesting if they demonstrate through examples some of their projects already launched, for example, people who work with games of chance. What games are these, were they successful, and if not, why? What would you change in this game? After all, the world of betting is very widespread and I've seen several proposals that address this; it would be important to know the differentials of this proposal, in addition to the fact that it brings together several types of bets in one place. We have an overview of the roadmap, what would happen over the months and how the funding money would be used, providing a solid idea of ​​what's to come.", "q1r": 4, "q2": "Regarding auditability, the team provides us with a satisfactory amount of information, however, there could still be more details, especially in the financial division. I'll explain. Here we have the objectives for this funding round (would others be needed for the project to be carried through to the end? It was necessary for the authors to clarify this issue); through such objectives, the community could monitor whether the funding money was being used correctly. The team also sets the milestones achieved so far, which is very positive because it demonstrates that work is already being done, regardless of the funding round. About the roadmap itself: I found it a bit superficial. As it is a complex and long proposal, the authors divided the stages based on quarters, but for each quarter the activities are only mentioned in topics. It would be better if they were more detailed, as well as the metrics said right after. And finally, about the funding money, there was also a lack of detail, I will mention 3 examples: in the design part, it would be interesting to understand if there would be just one professional or another working and how the results would be delivered. In marketing we would also need more information, it is not mentioned at any time how the advertising campaign would be carried out, that is, through what type of media, channel and target audience. And finally, I would like to comment on legal expenses, it would be important to define what kind of expenses would be, who would be responsible for this part, etc.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 9, "ng": 0, "nfo": 0, "vca_o": 2}], "solution": "最も多くのベッティングオプションを提供する使いやすいアプリ。従来のハウスからトークンホルダーにパワーバランスをシフト。", "experience": "アプリ開発、devops、フィンテック、ブロックチェーン、ギャンブル業界での経験を持つ開発者や専門家からなるグローバルチーム。"}