{"id": 368533, "author": "", "title": "DOOH media meets decentralized tech", "url": "https://cardano.ideascale.com/a/dtd/368533-48088", "category": 26103, "amount": 200000, "description": "ブロックチェーン技術を活用してプログラマティックなDOOH広告を販売することは新しいことではありませんが、既存のソリューションは広く利用されていません。", "f6_no_assessments": 4, "f6_rating": 3.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "While the proposal problem statement suggests a cooperation with an existing company that manages billboards for high profile clients, the solution does not indicate clearly enough how the team plans to utilize the Cardano network. Challengewise this proposalwould integrate or migrate the existing Gotiger tool to the Cardano network. Since the team has prior experience and clients and gives success criteria of migrating the three clients to the network, it would be important to add some numbers of expected value to the roadmap and information as well as how transactions would be facilitated before smart contracts will be integrated to estimate the value of this proposal for the Network, especially seeing that it requires 20 percent of the budget for this challenge.", "q0r": 4, "q1": "The company is already operating and will be migrating or integrating an existing tool so implementation is highly likely. However, the team does not provide information about how they plan to utilize ADA and transactions in general. The budget is about 1/5th of the challenge fund so careful consideration of the future value of the proposal is recommended. I looked at the first provided article and it seems that \"ravepub\" is a marketing and strategy agency so I do not see much value in an article that was written for marketing purposes. It would be good if the team would provide more insights on the experiences of the team. Additionally, since the 3 clients that are mentioned as success criteria are already clients of this company, it would be useful to give an estimated output value. Afterall, without smartcontracts (they are not part of the roadmap and are mentioned as \"could be used\"), tokens or other profit-related measurements, this project should specify how they would enhance value for the network. ", "q1r": 3, "q2": "Roadmap and milestones are rather broad and do not provide information on how outcome and success would contribute to the network - how are transactions managed? However, success criteria of integrating an existing tool is auditable and 3 clients will still be clients, so this is auditable. Public launch date is set and therefore auditable but again, the team does not provide an estimated amount of value, of transactions, of how ADA would be utilized. Since the budget is very high, the plan should contain additional information related to actionable steps that would enhance auditability. Additionally, information about documentation should be provided. ", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal did highlighted a problem and offered a solution but the solution lacks a clear detail on how they will go about integrating the Solution to cardano especially considering that the DOOH system is external to the blockchain.\r\nThe requested funds ($200000) for the proposal is very high considering that it is more than half of the funding pot size of $250000.A more detailed breakdown of the cost and how it is utilised would further help in getting the proposal funded , It will also be better if the initial phases of the project funding is requested then subsequent requests are made in future funding rounds\r\nThe proposal has a real world impact to the cardano community if funded but more implementation details will help in the chances that the proposal get funded.\r\nConsidering the above , i can neither Agree or Disagree.", "q0r": 3, "q1": "The proposal provided verifiable experience with links but the implementation plan is lacking details.\r\nConsidering the above, i can neither Agree nor disagree.", "q1r": 3, "q2": "This is a good Solution with a real world impact to the Cardano community but unfortunately, Sufficient information to audit the progress or success of the proposal solution.\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I agree that  this proposal, if implemented, will help grow Cardanos network.  \r\n\r\nPros \r\n\r\n1) The company is well established and have running products as SaaS on cloud.\r\n2) Since they already know their business and also have running product, it means they already have team of developers who built these solutions.\r\n\r\nCons\r\n\r\nMy concern is with following statement\r\n- \"The network provides full transparency in terms of sales information. There is an immutable record of time, location, and length of campaigns. And, eventually, smart contracts could be used to automate the various stages of an ad campaign.\" -\r\n\r\ni would love to see some more detailed explanation and examples of why and how cardano will help this company grow and have an competitive edge. This will allow community to better understand motivation of proposer, Since the budget asked is quite high, it would be great to have this proposal split more into details. Moreover, i do not see any details on if they have developers who have knowledge of Plutus/hsakell ? ", "q0r": 3, "q1": "I disagree with the given outline for this plan. IMHO since the amount of funding is quite high, the proposer  must give a very detailed explanation of each and every stage to the community. The text that is mentioned here is quite abstract, and the premise is just that since this is an established company we can just trust that product managers, devs and others will just do their job.\r\n\r\nAdditionally, IMHO as a developer myself and with many years of enterprise software buidling experience, and being involved with cardano community, i would like to see a more serious proposal from proposer. The team information is missing, and to me it is not clear the skill set of developers they have. \r\n\r\nI would suggest to have a look at funded proposals from previous rounds such as liqwid or gimbalabs proposals, and how detailed their plan was. \r\n\r\nLast but not least, if you are looking for 200k funding then your motivation should be reflected by the amount of time you spend in proposal :) ", "q1r": 2, "q2": "i disagree that information here is sufficient to audit the progress and the success of this proposal, I think if proposer puts in the missing pieces such as detailed motivation on integrating with cardano, then it would be much easier also to review the auditability and progress of this proposal. e.g. 1) how it will help their business grow, how it will help cardano eco system.\r\n2) Detailed explanation for the implementation plan, Skill set of developers (atleast lead developers with plutus/haskell knowledge)\r\n\r\n\r\nIn my experience i have seen many times that management decides to opt for latest technology because its cool and try to fit into their businesses, however IMHO this is a wrong approach. The approach should be that what problems i have and how can i solve this problem ? Does blockchain (cardano in thiscase) helps me solve N problems with low cost and maintenance in longer run ? There goes the motivation and must have been the premise of this proposal. ", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "Direct out-of-home advertising has an established used case in smart contract enabled blockchain. Blockchain opens up the potential for reliable feedback from consumers of the advertisement in terms of interaction. There is a need to showcase the superior capability of Cardano in processing such distributed networks as DOOH. This proposal has the potential for that. ", "q0r": 5, "q1": "The proposing firm has not provided their current market share and the number of clients they are handling to evaluate the proposal. Based on the review sites (https://www.g2.com/products/gotiger/reviews) it can be inferred that the market share is not comparable to the market leaders in the same business. However, there is may also give an additional incentive to adopt Blockchain and change the business model being followed in the industry. ", "q1r": 4, "q2": "The budget is sketchy and technical details need improvement. The effort required for development is also not explicit. The ownership of the resulting codebase is also not explicitly stated. If there is an assurance of open-source, it is possible to monitor the project's progress on a very close basis reliability. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "当社のデジタルサイネージ管理プラットフォームであるGOTIGERをカルダノのエコシステムと統合し、分散型のDOOHキャンペーンを実現します。", "experience": "技術に精通した革新的なチームは、15年以上にわたりタイムズスクエアのビルボードオーナーにハイエンドでインタラクティブなDOOHソリューションを提供してきました。"}