{"id": 369308, "author": "", "title": "NFTree: regenerating the planet", "url": "https://cardano.ideascale.com/a/dtd/369308-48088", "category": 26103, "amount": 50000, "description": "気候破壊は、洪水、暴風雨、未曾有の熱波、致命的な大気汚染など、気象条件の深刻さを増しています。", "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, this proposal addresses the challenge in that it is planning to build a themed NFT Marketplace that connects smaller tree-planting-initiatives with people who would pay these initiatives for their efforts in exchange for an NFT-ownership of a tree. Obviously climate change is a relevant topic that this proposal addresses in their problem statement and the suggested solution is feasable. The proposer give an example how other blockchains integrated projects on this topic and provided information how and why they would approach this differently. It would have been interesting if they would have provided some data on the existing project to be able to see how much traction it received.", "q0r": 5, "q1": "While the two proposers have both developer skills (plutus pioneer) as well as connections to forrestry projects, the team is at the moment not complete since a front end and back end developer and a data scientist is missing and implementation is not guaranteed. The roadmap does not provide information about how these position will be filled - especially with the first milestone being one month after funding. While I think implementation is likely if the proposers can set up a team, it would have been relevant information to include in the roadmap as a first milestone (complete team with data scientist, front end/ back end dev)....", "q1r": 3, "q2": "While the roadmap is auditable on the technical side as well as how to connect trees with the NFTs through the provided roadmap, there is not much information about outreach to possible partners that would sell their trees through the marketplace. If this proposal would work together mostly through the company that Jeremy works at, maybe this would provide an outreach on this topic. Clarification on possible outreach/marketing/social media would have been relevant, not only for auditability. Auditability could be improved by adding a number of either initiatives that the team will be reaching out to or a number of sellers that they plan to onboard to their marketplace. The team should also add documentation via github or set up a discord/telegram or any other channel that could be used to provide information to the community and maybe connect with people in the community that would be able to support with outreach. If outreach will be done through Terraformation, the proposers should be transparent how the cooperation would look like. The roadmap is missing important information about onboarding a front end dev/ back end dev and a data scientist. While the project is still auditable, the proposal does not give any information if the team would be able to complete the task if they cannot fill the three positions.", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Regenerating the planet is a noble cause, however, I feel this proposal should have been entered into the \"NFT Business Model\" fund category since the proposal has NFTs at the core of the business model proposed. For this reason, I believe the proposal did not effectively address the challenge.", "q0r": 2, "q1": "Although the team provided a links to websites, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team's work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight into whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\"", "q1r": 3, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The proposal offers a naive solution to a complex problem. The major concern is how the Minting of treeNFT and actual planting of tree will be confirmed. Who will recognize the NFT as the a value for carbon credit? A regulatorry framework with a possibility of penal prosecution for cheating the system will be required to ensure value for the Carbon tokens. ", "q0r": 3, "q1": "The proposing team has the necessary experience and qualifications in the related field. ", "q1r": 5, "q2": "Token sales and DAO are not likely to solve the real issue of accountability. It the critically to ensure the value of the Carbon token or a Tree token to reliably tie a value to a planted tree and prevent someone from cutting it for the next 30-50 years; therefore, the model has to pay the tree planter continuously for 30-50 years after ensuring that tree is still alive. This needs complex accountability and innovative remote monitoring capability that can be scaled and deployed in any area. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Given the challenge aims to increase the amount of DAAPs and integrations to Cardano, this would directly benefit the ecosystem. As well as supporting the brand of Cardano and catalyst, this is an opportunity to create a new use case for NFTs and a more useful one than crypto kitties (though they are cute). \r\nThe problem and solution statements are provided however, I would have liked to understand the problem better when it comes to actually understand why no one validates small farmers. I would recommend maybe doing a 5WHY model to dig deeper.", "q0r": 4, "q1": "The experience of the team is very good and one of the founders is part of the Plutus pioneer program. This is a good first step towards feasibility, however, it would have helped to have links or references to their professional profiles to understand the specifics.\r\nA white paper has already been drafted, however, there are some missing parts in it as well as the proposal. The breakdown of milestones and costs seems reasonable, however, the first step is to build an MVP but there are no mentions of trying the validate the problem/solution with the market. \r\nAdditionally, the logistics of having cameras and drones to track trees or areas is very high, and not many details on how they plan to do this are given. ", "q1r": 3, "q2": "The roadmap, milestones, and budget are not very detailed and do not provide the community with enough items to audit the success of the project. I would recommend adding some KPIs to the project next time and a brief explanation of how you plan to track the success of the project. An example of this is \"+1000 people signed up to the newsletter by [DATE]\". \r\nAlso, not many details are provided in regards to the potential risks and challenges of the project. All of this makes it difficult to audit this proposal later on.", "q2r": 2, "assessor": "z_assessor_473", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is absolutely in the right category, as it's a great idea and not only that but the impact not only for the Cardano community but for the whole world would be enormous. To think that we can finally reach a point where technology and mankind can go hand in hand and work towards such an important goal is amazing. To be honest, at first, I was skeptical because most proposals (outside of the Cardano ecosystem as well) are kind of idealistic. We all want a better world, but this proposal has not only the way to do it but the economic incentive as well. To all reading this review, I really believe this proposal has to be supported, not only because it has a nice idea and implementation, but the proposal is given in a simple and understandable manner, but no detail is spared.", "q0r": 5, "q1": "I have great confidence that this proposal can be implemented successfully by the team mentioned. Unlike many other proposals, there is no lack of credentials that can be checked online and companies whose work can be proven and related to the people mentioned in the proposal. This is one of the best proposals I've seen idea-wise, structured, and detailed as well. I think it can be given as an example that, a proposal doesn't need to be 3 pages long to be meaningful and yet not lack any important details like timetable breakdown alongside finance tables and breakdowns.\r\nThere are clear KPIs to be followed unlike many other proposals, and the only thing I might suggest to the proposers is to put a GitHub repo or a link to a place where the progress could be followed by anyone because that might bring in useful people and expertise to the project in the future.\r\nI really like the solution section because it's just as complicated as it needs to be. It explains why just planting a tree is not enough without having the economic balance in mind. It paints a picture of both producer and consumer or CO2 emissions.\r\nSimple yet understandable timeframes and goals. As a developer myself, I think their timetable concerning the application development is doable.\r\nThis project utilizes all strengths of the Cardano ecosystem (tokens, decentralization as well as the use of smart contracts).\r\nThe proposal gives a lot of useful information that can be used to educate oneself about the current state of the environment as well as what organizations are doing about it. It's a beautiful idea to build on top of someone's work to further the end result. Recognizing that this is not a zero-sum game makes this project extremely valuable.\r\n", "q1r": 5, "q2": "This is one of the sections where I rarely can give the maximum points based on lack of explanation and education on where the money is going and why. Fortunately, this is a proposal that gives all the right answers to all the right questions. Where is the money going and WHY? This is overlooked by a lot of other proposals and it's an integral part in my opinion of any excellent proposal. The sums can be divided easily using the project phases and timetable and the resulting sums per month are more than acceptable. I hope you make it, I'm rooting for you and will be glad to be one of your future users!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "NFTを介して森林再生プロジェクトに資金を提供するためのマーケットプレイス、これらのNFTはCO2マーケットプレイスに接続され、投資家に報酬を与える。", "experience": "アルトゥール・パニャックソフトウェアエンジニア、Plutus パイオニアプログラム\nジェレミー・アグニュー：Terraformation forest accelerator\nSpace4GoodGIS衛星データ"}