{"id": 369713, "author": "", "title": "Decentralized Content Network", "url": "https://cardano.ideascale.com/a/dtd/369713-48088", "category": 26103, "amount": 75000, "description": "オープンアクセスライブラリに欠けているのは、著者への資金提供、利用統計、効果的な分散化、コンテンツの整理とライセンスの施行です。", "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "In my opinion this proposal is within the challenge goal, because could improve adoption of Crdano blockchain from several cultural institutions around thw world. At the same time I think is more related about business (virtual economy)  and related services.\r\nFurthermore the relation with Cardano blockchain services (eg. Smart contracts) it is not deep specified, so I suggest to better introduce and explain HOW Cardano services were used, through use cases related to user's operations (es. how ATALA prism functionalities were implemented to develop marketplace…).\r\nThis proposal is well written and clearly demonstrate  the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.\r\nThe proposal clearly articulates the contest, the problem (new developer ecosystem to write and test smart contracts) and how it will add value to the Cardano ecosystem and for all of the stakeholders.", "q0r": 4, "q1": "The proposer team (Ferdon company ) is very well skilled about the whole context of the proposal, but it's seems that doesn't know the Haskell language very well because they work on other technical environment.\r\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it's convincing.\r\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon, also in technical realization. The only thing I think see is related to the complexity of the implementation roadmap and higher costs; furthermore ther isn't business case related to the potential revenue of the proposal.", "q1r": 3, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, but no  KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge. ", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The amount of open-source training material available free of cost on the Internet is quite substantial. It is difficult to argue from the Student's point of view, however, there is an issue of monetizing quality research. Sci-hub has pioneered the piracy of research papers and made it free of cost for students. The proposed model has a potential to provide a very low-cost solution so that outright piracy is not attempted at the same time the consumer of the material is not made to pay an unreasonable amount. The potential to create a new fair model of knowledge market using blockchain is huge and the proposal has the potential to unlock this feature. ", "q0r": 5, "q1": "The referenced Github profile has had reasonable development activity in the last two years. Details of other proposers are not explicit. However, the proposers have claimed substantial experience. Assuming the best possible scenario it can be said that the proposers do have the ability to implement the proposal. ", "q1r": 4, "q2": "The proposal claims that the webcomponet and LMS is currently ready and they will be able to migrate about 5000 assets to the dApp in three months and scale up the solution in 6 months. There is a need for extensive smart contracts to achieve the intended goal. The poposaal progress is observable and it will be possible evaluate the progress and the success can be accurately measured based on the number of assets in the dApp and the number of user registers in the system. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal fits very well with the main objective of the challenge, because it intends to create a kind of virtual library, through DApp, where both students, professors and universities can access educational content. The justification for this project is the fact that the physical content of education is very expensive and has only increased in price (these are facts; I am a university student and I can see that). There is also the ecological issue that could be added as an argument here. According to the team, the base they created is already used by some educational institutions in Canada and the United States, which is extremely positive because it shows that the project is already happening. One observation I would like to make is, it would be beneficial if the authors would detail what \"The WeBWorK Project7 (TWP)\" is, where they would donate part of the proceeds from this project.", "q0r": 5, "q1": "In relation to the team, unfortunately, it is the weak point of the proposal when it comes to detail. We are told very briefly what types of professionals make up the team, but important information is not provided such as their names, places they worked, projects they developed or even profiles of social networks such as linkedin, where we can get to know each more individually. one of them. Without such information, it is difficult to know who they are and to have complete confidence in their ability to carry out the project. Despite this, the description of the proposal is quite technical, thus demonstrating that they really understand the issues addressed here, in addition to the fact that some universities are already using their services, some confidence is passed on. One suggestion I can make is: why not demonstrate which universities are using the services and provide brief feedback on each? Regarding the roadmap and financial division, we know what will happen, but there is a lack of detail.", "q1r": 3, "q2": "The project will last a total of 1 year, and we know which activities will be done according to 3, 6 and 12 months. However, the actions are mentioned in a very superficial way, lacking in detail. For example: in the first 3 months it is said to \"Migrate more than 50,000 existing assets to the blockchain\", in which case I had assets, and where would they come from? Likewise, the financial division was just over the top, when they say that 48k will be allocated to pay the founders, it would be interesting if they would receive equal or variable amounts. I am concerned here that there are no success metrics, so the community cannot simply monitor the progress of the project, and a marketing plan is also not established with which the project can be publicized and reach the maximum number of users possible. Another point is that it might be interesting to include a brief and accessible guide on how to use blockchain assets, since most people don't know how to do this. And for me, I would like to emphasize the importance of the care that the authors had with intellectual property, if the project was all elaborated without considering this variable, the chances of going all the way down would be real.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "私たちのdAppは、教育者、学生、コンテンツ配信者に新しい仮想経済を提供します。私たちのdAppは、クリエイターのファンディング/ロイヤリティを高めます。", "experience": "私たちのチームには以下のような経験があります。15年以上のオープンソース経験、20年以上の高等教育/研究経験、7年以上のソフトウェア開発経験、4年以上のスタートアップ経験。"}