{"id": 369996, "author": "", "title": "M2 Realfi openhardware", "url": "https://cardano.ideascale.com/a/dtd/369996-48088", "category": 26103, "amount": 5000, "description": "現実世界（店舗）での支払いのためのハードウェア・プラットフォームが存在しない", "f6_no_assessments": 4, "f6_rating": 3.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal would be within the challenge goal, the idea is very good (open hardware payment system), but it's difficult to imagine that this proposal will increase utility & adoption of Cardano challenge. The context is specified but I'm not sure if a new physical device is needed in the real world for the development of blockchain payments ... in my opinion other initiatives could be more useful (e.g. payment gateway, ...).\r\nAt the same time the statement of how problem is to be solved is  only specified with study research proposal and remain vague the implementation.\r\nHowever the objective of the proposal is interesting, but I think it's important to improve details about the solution for the challenge (eg. with business case support), so it's difficult to assess.", "q0r": 3, "q1": "It's not simple to define if the proposer team states has the necessary experience, because it's clear the experience of the proposer and his well done last projects (I love Raspberry Pi paypad…) but I don't discover team member details and professional experience to imagine the project's success. \r\nFurthermore then plan proposed is only research plan as a startup phase, so it's good as approach, but not completed with enough details.\r\nThe metrics for the assessment isn't given, so it's impossible to assess what the proposer wants to do, but the success of his actions is poor defined. ", "q1r": 3, "q2": "Roadmap and milestones (incl. time horizon) are weakly described. The budget provided is very general and therefore I cannot say whether it is appropriate or not. There aren't more details how the budget is going to be spent, also Ther aren't attachment to deep dive the solution. Furthermore there aren't a lot of information about how manufacturers will be engaged and usable for the different touchpoints. Futhermore there aren't basic information to asses.", "q2r": 2, "assessor": "z_assessor_114", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal highlighted a real world problem and offered a clear solution. \r\nThe proposal did a great job of clearly highlighting that this is a subsequent fund request to further work on the pre-funded proposal in Fund 5 with verifiable ilestones.\r\nGreat work to the team.\r\n\r\nI Agree.", "q0r": 4, "q1": "The proposal presented verifiable experience and links with a clear implementation plan alongside cost implications.\r\nI agree.", "q1r": 4, "q2": "The proposal provided sufficient information to help audit the progress and success of the Solution.\r\nI agree.", "q2r": 4, "assessor": "z_assessor_331", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "Open standards for ADA-capable ATM machines will enable manufacturers better starting boilerplates and will lead to compatible systems. They will also be auditable for security issues. ATMs for crypto have not gained much traction due to their limited circulation however it always a requirement.", "q0r": 5, "q1": "The proposal claims that the proposal has the backing of m2tec.nl which has a professional reference in the development of designs and has extensive references. Therefore it is highly likely that the proposal will be implemented successfully. ", "q1r": 5, "q2": "The quoted development cost is reasonable. The proposal also includes a forum for sharing ideas and has included 6 months for idea formulation, which can gather and incorporate all community ideas.  Therefore the progress is auditable in a open manner, and success can be measured accurately. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is the second application for this project, after having been elected in Fund5. The proposal is about promoting the paper wallet terminal that has been developped and on boarding manufacturers.  The idea of an open hardware payment system is great and does meet the challenge criteria: by facilitating ADA payment, this idea could have a big positive impact on adoption. ", "q0r": 5, "q1": "The design of the paper wallet terminal is available on GitHub, and the application in Fund6 is made to promote the solution using a web page and to on board manufacturers.\r\nThe proposer claims that a technical solution is already developed and that a paper wallet terminal is available on GitHub, but I do not have the technical skills to verify this statement. \r\nTo add confidence for the community in the chances of success of the project, I recommend making an actual prototype based on this design and showing it is functional in real world.\r\n", "q1r": 3, "q2": "Making a promotion web page is a progress that can be tracked by the community. The proposal lacks details on how budget will be used regarding onboarding of manufacturers, or manufacturing of prototypes. ", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "ハードウェアの仕様が開発されるプラットフォームを構築する。決済システムを大規模に構築するためのデザインをコミュニティに提供する。", "experience": "デルフト工科大学でインダストリアルデザインの修士号取得 https://www.tudelft.nl/io (2005)"}