{"id": 370128, "author": "", "title": "Cardano based trading card game TCG", "url": "https://cardano.ideascale.com/a/dtd/370128-48088", "category": 26103, "amount": 100000, "description": "技術的に優れているにもかかわらず、先行するブロックチェーンTCGはmagic the gatheringのような従来のTCGのように広く普及していない", "f6_no_assessments": 7, "f6_rating": 1.2857142857142858, "videos": [], "media": [], "f6_assessments": [{"q0": "A really good card game can have a massive impact on the NFT space and Cardano.\r\nThere is a huge community ready for this type of game. These type of games have great potential to scale and evolve over time. Designing the game mechanics for these games to scale can be quite tricky. If there is thousands of cards then strategizing your match goes out the window, because you don't know what to expect. ", "q0r": 4, "q1": "No allocation or plan for the budget and needs more team members. Getting more people onboard with the relevant experience, will bring about a more detailed plan and possible prototypes for CAs and voters to look at. Boosting your rating and Voter confidence.", "q1r": 1, "q2": "No roadmap or milestones. \r\nNot defining success.\r\nNeeds dedicated team members that can help with identifying risks and challenges and \r\nbuild a better proposal. If this is something you are passionate about, don't give up.\r\nKeep looking for people with the relevant experience and same passion for these type of games.\r\nThey are out there, you just need to find them.", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "While the proposal addresses an idea, it does not provide a solution to the proposed problem that there are not enough high quality card games available on blockchains right now (although I like gods unchained). Without an actionable proposal but instead only a problem statement and the general call for \"improvement\" this proposal does not add value at the moment. It could be an idea for this proposer, to set this idea up as a challenge for a future fund. ", "q0r": 1, "q1": "No. The proposer says that he or she does not have the relevant qualification to provide a solution for the problem. General information about a \"strong team\" does not provide any actionable steps, plans, milestones or any other hint how this proposal could be implemented.", "q1r": 1, "q2": "No. Without any information provided in this draft it is not possible to audit this project. The proposer should edit, refine or put together a team before putting the proposal up in a future fund. ", "q2r": 1, "assessor": "z_assessor_19", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "A trading card game on the Cardano blockchain would definitely encourage adoption and bring new users to it. That being said that is where this proposal stops. There is unfortunately no information as to what this trading card game would look, act, or play like. The problem statement speaks to the fact that blockchain could create an even more impactful gaming environment than popular TCGs like Magic the Gathering. That's a good start of a proposal but the solution statement does not speak to how that problem will be solved. Further more, no information is provided in the \"Detailed Plan\" section. This makes it difficult to understand how the proposal could be impactful in the Dapps & Integrations challenge and therefore effects its capacity to drive users. I would highly recommend trying to submit a proposal in the next fund after doing a deep dive into what your TCG will be. I am a huge gamer myself and would love to encourage proposals in the gaming space! It is just a necessity to have a detailed and exciting plan in place first, especially for a larger budgetary ask. Because there isn't a plan in place and therefore no way to assess its impact on the challenge I have given a 1 star review.", "q0r": 1, "q1": "Because there are only 59 words in the whole proposal it is very hard to understand what the plan is and how it would be implemented. Gaming is exciting and there's lots of opportunity for a quality proposal! If you are to submit a proposal in the future here are some good things to include:\r\n- Detailed explanation of product that will be produced with funds. This includes all features and the user experience of them \r\n- Roadmap and budget that shows how funds will be spent and at what time. Roadmap should display timeline of project with specifics on what the development steps are and how long it will take to complete each one\r\n- Further explanation of the team involved with details on exactly what they bring to the table\r\n- Go to Market Strategy that shows how you will bring in users and retain them\r\n- Metrics you can measure to determine success of the project along with predictions for 3 month, 6 month, and 12 months for each metric\r\nAgain I really wanna encourage you to submit a proposal in Fund7 that is well thought out and contains the recommendations I provided! Trading card games are awesome and from your \"Relevant Experience\" it seems like they are something you are really passionate about. That passion will translate into a quality product! Unfortunately because none of the above mentioned recommendations are listed I am giving a 1 star review. \r\n", "q1r": 1, "q2": "Due to the lack of information as to what this Trading Card Game would be it's very hard to audit the progress and success of it. Please please don't give up here! There are lots of gamers out there that would love to have a Trading Card Game on Cardano that has unique gameplay and use cases. Check the recommendations I provided in my other assessments of your proposal for when you hopefully submit a proposal next fund! Unfortunately because there is a lack of information provided, and therefore no way to audit the proposal I am providing a 1 star review. ", "q2r": 1, "assessor": "z_assessor_302", "no_vca": 10, "ne": 10, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "I believe the idea of a cardano based trading card game is great. It helps to bring new people to the ecosystem and there are already games on other networks that are doing well. The execution part could definetely be a little bit more detailed as described down below. ", "q0r": 4, "q1": "Even tough I believe the idea is great it is hard for me to imagine that this proposal would get finished. A blockchain trading game needs strong devs and since there is no clear whitepaper or roadmap or at least a long description of the idea it will be hard to attract any devs. Unfortunately the proposer didn't write about his skills or any team members. A well layed-out budget is not to be found. The proposal misses any technical aspects and didn't consider the possible challenges that could show up.", "q1r": 1, "q2": "There is no future roadmap or milestones and also no budget or time horizon. The problem and the solution could be described more in detail. Since the proposal almost contains no informations it is really hard to assess.", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Draft proposal. The problem statement is reasonable but it is important to provide information about the context of the problem in the proposal.\r\nThere is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The definition of the solution to this proposal does not effective address the challenge. I think the the acronym TCG is too ambiguous , I would recommend the proposer should check the challenge brief and the guideline to improve the proposal . creating a Cardano trading card game might have a positive impact to the ecosystem but  I am not sure how he will do that, for that i score 1  ", "q0r": 1, "q1": "The Proposer seem to be a junior Developer at the moment, from the information provided , there is no way he had mention that he will hiring an experience team to work on his proposer , no partnership whatsoever.. so for that I strongly disagree that this proposal will be implemented successfully , for that I score 1", "q1r": 1, "q2": "The amount requested seem to be too high given that there is no budget breakdown , no KPI or metrics to audit the progress and the success of the proposal. I would recommend resubmitting it in the next fund with clear and improve detail plan. for that i score 1", "q2r": 1, "assessor": "z_assessor_430", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Gaming DApps have a high potential of adoption in the Cardano ecosystem. Although the idea for developing trading card games based on Cardano blockchain looks good, the problem statement of this proposal remains unclear and it does not provide a good reasoning of the requirement to build such DApp in Cardano. Additionally, the proposed solution is missing totally as it only describes generic and undocumented facts about trading card games instead of describing how the problem will be addressed and resolved. The whole proposal is written very poorly, therefore I strongly disagree that it addresses the challenge.  (Score: 1)", "q0r": 1, "q1": "This proposal misses key elements for assessing its feasibility. There is no roadmap, no details about the development team, no technical details, no task description, no time plan and no risk considerations. It asks for an unreasonable amount of money without providing any details on where and how this money will be spent. For these reasons I strongly disagree that this proposal will be implemented successfully. (Score: 1)", "q1r": 1, "q2": "The proposal does not suggest any means that the project will be auditable during execution. With the lack of plan, milestones, time horizon, metrics and KPIs it is not possible to measure the success of this project. In addition to the lack of a well defined and described solution I strongly disagree that the proposal can be auditable. (Score: 1)", "q2r": 1, "assessor": "z_assessor_614", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "ブロックチェーンTCGは、私たちが改善を目指すべき、ぎこちないアートワーク、手間のかかるゲームプレイ、高額な手数料の取引オプションに悩まされています。", "experience": "私は、平凡な開発経験しかないTCGマニアです。チーム編成には強力な開発者が必要ですが、強力なクリエイティブ部門も必要です。"}