{"id": 382150, "author": "tobrien", "title": "Paperless Cross-Border Trade", "url": "https://cardano.ideascale.com/a/dtd/382150-48088", "category": 26249, "amount": 146960, "description": "Les pays en développement ont du mal à tirer parti des avantages considérables du commerce sans papier en raison du prix élevé des logiciels et de l'expertise.", "funded": 2, "upvotes": 163935684, "downvotes": 4395870, "votes_result": 159539814, "votes_cast": 665, "f6_no_assessments": 6, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Les ramifications que la proposition ci-dessus pourrait apporter sont nombreuses. Il s'agit d'une idée brillante, présentée de manière simple mais élaborée. La solution proposée mentionne clairement le registre ciblé, le \"contrôle des douanes et des frontières\", qui est l'une des conditions requises dans le briefing de la campagne. La base d'utilisateurs visée est le Kenya et le Ghana, qui sont encore des pays en développement et ont besoin de telles solutions pour une prospérité prévisible et durable. L'auteur de la proposition mentionne également que la solution a déjà été mise en œuvre sur la chaîne Ethereum, mais qu'il souhaite la transférer sur la chaîne Cardano. Par conséquent, en cas de mise en œuvre réussie, la proposition n'aurait pas seulement une influence mondiale en attirant de nouveaux acteurs, mais inciterait également de nombreux acteurs existants à passer à Cardano, afin de surmonter les vulnérabilités auxquelles ils pourraient être confrontés dans leurs chaînes actuelles respectives.", "q0r": 5, "q1": "Les proposants, Tim et Jonathan, sont des visages connus de la communauté et leur expertise ne fait aucun doute. Et la quantité d'efforts déployés pour détailler le plan doit certainement être appréciée. Le proposant fournit à la communauté et aux lecteurs une feuille de route claire qui comprend des objectifs par phase, des besoins en ressources, des risques encourus et des mesures mesurables. L'équipe fournit une très brève description de l'équipe et de l'expérience qu'elle pourrait apporter à l'écosystème. Cependant, les fonds demandés représentent jusqu'à 25 % des fonds alloués pour le défi. Même si ce montant semble rendre justice à la charge de travail considérable que l'équipe propose, il serait injuste pour les autres idées du défi. Je recommanderais à l'équipe de proposer une partie du fonds lors des tours de financement suivants en montrant une certaine progression par rapport à l'allocation du fonds 7. Ayant donné mon avis, je pense qu'un score de 4 sur 5 pour la faisabilité rendrait une grande justice à la proposition.", "q1r": 4, "q2": "L'équipe, cependant, ne fait aucune réserve en fournissant les métriques pour le processus d'audit. Le proposant mentionne les résultats souhaités pour chaque étape et les mesures de réussite respectives. La proposition inclut toutes les mesures requises que l'on devrait attendre après avoir parcouru le dossier de campagne, qu'il s'agisse de l'augmentation du nombre de cas d'utilisation et de transactions de Dapp, du partenariat avec les organisations internationales, de l'impact sur l'inclusion financière et de la portée mondiale, qui sont tous les paramètres clés du défi à relever. De plus, le projet de l'équipe de rendre l'application disponible en open-source et de fournir une démonstration de l'application sur des canaux catalytiques rend la proposition plus viable et plus fiable. Avec tous les faits ci-dessus en main, il est très clair que la proposition vient avec suffisamment de bons KPIs pour suivre ses progrès et son succès éventuel. Ainsi, j'obtiens un score complet pour cette proposition.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of high cost of customs paperwork in cross-border trace by moving the TradeTrust framework of electronic trade documents to Cardano which aligns exceptionally well with the challenge goal of foundational Customs & Border Control registry.  \r\nThe proposal is an excellent example of articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that closely align with the challenge.", "q0r": 5, "q1": "The proposal's feasibility could be improved by a challenges and risks section however given that the application is currently functioning the risks are likely minimal.\r\nThe proposal's feasibility is excellently demonstrated by evidence of experience (existing application), team composition, budget is broken down and reasonable, realistic timetable and plan, resources required, detailed technical explanation of the solution.\r\n", "q1r": 5, "q2": "The proposal includes excellent examples of a roadmap, milestones, time horizon, metrics/KPIs to measure proposal success, a clear understandable description of the targeted problem, a detailed description of the solution that addresses the problem. Overall the proposal is an excellent example for future proposers to follow.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 21, "ne": 3, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The use case of this proposal is very interesting as it is designed to improve the current way of using trading documents. It's clear that paper based trading systems can be daunting, heavy and not optimized. The proposer has brought a solution that will use the cardano network to verify documents and enable rapide trading execution between parties. From the video published in the proposal, the proposer explained that the product was running on the ethereum network but the gas fees made them switch to cardano. Altogether, this proposal fits really well into the challenge.", "q0r": 5, "q1": "Since the project is already up and running, with a working website on mainet, I think that it's feasibility is a matter of continuing. Furthermore, the proposer has added all the information and details needed to achieve a positive note on a successful implementation of the project. Linkedin profile links have been added as well as team members and resources needed to complete the project. The budget has been broken and seems reasonable based on my intuition. Since I'm not a technical guy, I can't judge the reasonableness of the prices. Altogether, I have  confidence in the successful implementation  of this project.", "q1r": 5, "q2": "The proposer has added a roadmap with milestones that can help track its progress. Metrics and KPIs that define success are also included in the proposal. The proposer has clearly, described the problem and the solution.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The project aims to eliminate complicated paperwork in the process of transporting goods across borders, saving costs and time for paperwork. Currently this technology is also greatly supported in developed countries. The application is highly practical. The team has professional experience and good relationship with many government agencies.", "q0r": 5, "q1": "The project clearly outlines the project goals, barriers, challenges, and how technology connects to achieve them. With the experience of the team and the solutions they offer are objective and feasible. But it requires a lot of time to implement as well as educate the market on the new method to be accepted for paperless cross-border freight.", "q1r": 4, "q2": "It is possible to check the progress of the KPIs in each stage and verify with the documentation they have done through the information provided about the results of the practical application of the countries implementing this technology.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "this proposal effectively addresses the Brief by working to place blockchain built paperless trade onto the Cardano blockchain. This is a fundamental governmental registry that is well suited for blockchains strengths.", "q0r": 5, "q1": "This team has already built the solution and has demonstrated value. The propsoal simply seeks to move the existing solution to the Cardano chain, the team has experience and the plan is sound.", "q1r": 5, "q2": "The plan presents operational auditable, measurable, specifc time-fenced milestones allowing the community the ability to audit this proposal's progress and success. it is nicely presented.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Brilliant. I recall the Government of Ghana tries to move port activities online, the initiative had a challenge integrating the process and rather cost delay. I think this proposal would be helpful, the educative component is important to integrating shipping agents and stakeholders for easy usage. ", "q0r": 5, "q1": "The team has proven evidence to ensure delivery successfully. Great team experience and I think the community should support and help the migration to Cardano blockchain.  ", "q1r": 5, "q2": "great cost breakdown. I think it would be easy to audit and trace activities. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Déplacement du cadre d'interopérabilité TradeTrust vers Cardano pour faciliter l'interopérabilité de confiance à faible coût des documents commerciaux électroniques.", "experience": "Notre équipe compte 30 ans de leadership éclairé en matière de commerce transfrontalier et de conception de blockchain, avec une équipe de 15 ingénieurs blockchain expérimentés."}