{"id": 382500, "author": "pia.c.andrews", "title": "Regulation/legislation as code repo", "url": "https://cardano.ideascale.com/a/dtd/382500-48088", "category": 26249, "amount": 90000, "description": "Le libre accès aux règles n'est actuellement pas universel. Nous pensons que cela entrave la construction démocratique des nations, la transparence des gouvernements et l'accès à la justice.", "funded": 1, "upvotes": 55815538, "downvotes": 25435893, "votes_result": 30379645, "votes_cast": 164, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "L'énoncé de la solution est raisonnable à la lumière de l'énoncé du problème et les deux sont clairement rédigés. Le défi vise à accélérer le développement de dApps qui \"couvrent les solutions fondamentales du registre\", en mettant l'accent sur le stockage/la récupération des registres d'état civil sur la blockchain. L'application open-source proposée n'est pas une application décentralisée en soi, mais elle est conçue pour extraire des données juridiques et réglementaires d'une blockchain (c'est-à-dire la \"législation en tant que code\") et déterminer la conformité réglementaire ou l'éligibilité des utilisateurs. En tant qu'économiste du développement, je reconnais qu'il existe un réel besoin mondial pour de tels systèmes, car ils permettraient d'accélérer l'accès aux services essentiels et d'atténuer l'impact de la corruption (en particulier dans les pays en développement). Ces systèmes peuvent également être utilisés pour tirer parti de la valeur des registres de propriété, car les règlements de zonage et de construction pourraient être appliqués à des parcelles de terrain spécifiques stockées sur une blockchain. Ma principale préoccupation est la taille du budget de la proposition par rapport à l'allocation totale de fonds pour ce défi (90 000 dollars sur les 600 000 dollars disponibles). Cela dit, il n'est peut-être pas possible de diviser le projet en deux phases distinctes (développement du MVP et tests ultérieurs). Dans l'ensemble, je suis tout à fait d'accord que cette proposition relève efficacement le défi.", "q0r": 5, "q1": "L'équipe est assez importante et ses membres possèdent une vaste expérience dans les domaines du droit, de la réglementation, des normes gouvernementales ouvertes et du développement de logiciels. Le plan fourni par l'équipe est très détaillé et clair, et compte tenu de mon expérience de travail avec diverses startups, le budget (bien qu'important) semble raisonnable compte tenu du temps et des autres ressources nécessaires pour mener à bien ce projet. Il aurait été intéressant que l'équipe fournisse une estimation du nombre total d'heures nécessaires pour mener à bien les deux phases du projet (ainsi que le taux de rémunération horaire implicite), mais étant donné l'ampleur du travail à accomplir, il serait difficile de l'estimer avec précision. Dans l'ensemble, il est très probable que cette équipe réussisse à développer les produits livrables du projet proposé.", "q1r": 5, "q2": "Les livrables proposés sont très clairs, tout comme les indicateurs clés de performance fournis par l'équipe. L'équipe n'aborde pas les risques potentiels, mais étant donné la construction préalable de la base de données juridiques de la Nouvelle-Zélande et l'expérience de l'équipe dans l'utilisation de ces données et du projet BetterRules, il est peu probable qu'un produit fonctionnel ne soit pas livré. Cela dit, il existe une plus grande incertitude quant à la réalisation des indicateurs clés de performance, pour lesquels les risques de perte ne sont pas pris en compte. Dans l'ensemble, je conviens que cette proposition fournit suffisamment d'informations pour évaluer son état d'avancement.", "q2r": 4, "assessor": "z_assessor_914", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of lack of open access to government regulations and legislation by coding government rules into an open platform which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge.   \r\nThe proposal does a good job of articulating the value to Cardano ecosystem, and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that closely align with the challenge, and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.\r\n", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of team composition, budget is broken down and reasonable (more detail would improve), realistic timetable and plan, and detailed technical explanation of the solution.\r\n\r\nThe proposal's feasibility could be improved by evidence of experience (twitter accounts and proposal blurbs are insufficient), and a challenges and risks section.\r\n", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon (very rough), a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is precisely the kind of thing we need, not just on Cardano but in this whole space. The more public goods, the better. Making regulation and legislation clear to those that wish to integrate their Dapps into the world and making the rules clear and open for all is a must-have to take advantage of our existing legal systems. ", "q0r": 5, "q1": "The team has in-depth experience and understanding of the problem and current systems we have in place; with that in mind, I have high confidence that we will see this implemented successfully.", "q1r": 5, "q2": "There is a clear description of the problem and solution here with identifiable measures of success based on the milestones. Key performance indicator's and what needs to be done is laid out clearly and on understandable grounds.", "q2r": 5, "assessor": "z_assessor_903", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "Une plateforme open source gérée par la communauté pour le leg/reg en tant que code auquel tout le monde peut contribuer et sur lequel il est possible de construire + un outil d'éligibilité légale pour aider les gens.", "experience": "Une équipe de 8 personnes ayant plus de 5 ans d'expérience dans le domaine des règles de codage, de la conception, du développement, des plateformes gouvernementales, des lois et règlements et des pratiques interculturelles."}