{"id": 384301, "author": "njsteele", "title": "Corruption discovery + remediation", "url": "https://cardano.ideascale.com/a/dtd/384301-48088", "category": 26249, "amount": 62046, "description": "La corruption est la force la plus destructrice du gouvernement. Elle peut briser les gouvernements nouveaux et en développement malgré tous les autres efforts.", "funded": 1, "upvotes": 59968851, "downvotes": 4928753, "votes_result": 55040098, "votes_cast": 152, "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition soumise vise à éradiquer l'un des plus grands problèmes qui entravent la prospérité de tout pays, à savoir la corruption. La solution proposée, à savoir le développement d'une plate-forme décentralisée pour le signalement anonyme de la corruption, est unique en son genre. L'équipe propose également d'impliquer un grand nombre d'entités locales et de volontaires à travers des campagnes et des événements qui rendront certainement le Cardano populaire parmi la foule et augmenteront également la résilience de l'écosystème. Cependant, le manifeste ne mentionne pas les groupes démographiques qu'il prévoit de cibler ni la manière dont l'équipe propose d'atténuer la corruption en cas de signalement réussi par les utilisateurs. Puisque le plan inclut le fait de rendre l'application indépendante des autorités gouvernementales, la crédibilité de l'application augmente parmi les gens. Ainsi, je donnerais un score de 4 sur 5 à l'impact, car il manque des détails plus fins sur l'efficacité de l'application et la façon dont l'équipe prévoit de tirer parti de la chaîne Cardano.", "q0r": 4, "q1": "L'équipe a déjà effectué un travail considérable dans le sens de la solution proposée et fournit également à la communauté une ventilation détaillée du budget ainsi que sa définition du succès. Cependant, la proposition manque d'informations dans d'autres sections. La proposition ne donne pas une idée de l'équipe qui travaillera sur ce projet et de l'expérience qu'elle apportera. Bien qu'il soit mentionné que l'application sera développée, la proposition ne contient aucun détail technique à ce sujet. Les jalons, même s'ils semblent pratiques par nature, le proposant n'a pas mentionné les défis qui se trouvent sur son chemin et comment il prévoit de les atténuer.\r\nEn dehors de la définition du succès trimestriel, il n'y a pas d'autre plan de jeu détaillé étape par étape disponible pour les lecteurs. Avec tous ces faits, je crois qu'une quantité modérée de détails est nécessaire pour gagner la confiance de la communauté pour financer leur entreprise.", "q1r": 3, "q2": "Je pense qu'il n'y a pas assez d'informations disponibles pour que les auditeurs puissent faire des dérivations concluantes concernant le succès de la proposition. Le proposant prévoit initialement de développer l'application sans exploiter la chaîne Cardano et ne prévoit de passer à l'écosystème qu'après 6 mois. L'absence de détails sur le public cible et de mesures rend la proposition encore plus incomplète par nature. Bien que le proposant ait une grande expertise dans l'idée qu'il propose, l'absence de détails sur l'équipe rend la proposition moins crédible. Aucun indicateur clé de performance (KPI) distinct n'est disponible pour les auditeurs afin de suivre le nombre d'utilisateurs qui s'inscrivent sur la Dapp, les volumes de transactions et l'efficacité de la réception et de l'utilisation de l'application, qui est l'un des principaux critères de la campagne. Même s'il est tout à fait compréhensible que l'idée n'en soit qu'à ses débuts, un peu plus de spécifications sur l'application proposée et les chiffres permettant de suivre son utilisation et son succès aideront l'audit facilement et aideront également la communauté à suivre son efficacité.", "q2r": 3, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of discovering corruption in organizations and governments by an application facilitating anonymous crowd-source organized campaigns which partially aligns with the challenge goal but is not a foundational registry solution listed in the challenge.\r\nThe proposal does a good job of articulating the value to Cardano and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that more closely align with the challenge and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of experience (linkedin profile in the comments section), team composition, budget is broken down and reasonable, additional funding plan, realistic timetable and plan, resources required, \r\nThe proposal's feasibility could be improved by a more detailed technical explanation of the solution and including a challenges and risks section. The $9K budget to have grant writers submit a grant request seems like it might be a potentially questionable use of Cardano funds for some community voters.", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon,, clear understandable description of the targeted problem, and a clear understandable solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The proposal does not effectively address the challenge, while coordinating anti-corruption activities are laudable and important, they are not the stated goal and intent of the Brief: \"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 2, "q1": "The proposer is competent and has a good handle on the material. The proposer is affiliated with a top US university. Go Owls!", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, auditable, and time fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "Great idea and detailed proposal. I did love to see that the proposal commences from a specific region. I think this is great and addresses the challenge. This would generate more community engagement and the name and shame component would tackle corruption.", "q0r": 5, "q1": "Excellent to experience. I like the commitment of the team lead. This Dapp is practical and the NGOs set up to secure funding would help the longevity of the idea. ", "q1r": 5, "q2": "Detailed but breakdown. The proposal has shown commitment to transparency and openness. The Dapp and its campaigns are people-driven. This is great.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "735 / 5000\r\nResultados de traducción\r\nThis proposal impacts the center of the challenge, working on the most complex problem that exists in the construction of nations. The thing that destroys them: Corruption. One of the clearest reasons to explain the problem of poverty. In this way it raises a problem that clearly must be solved. It is also clearly observed how this proposal would add value to the Cardano ecosystem, since it is an instrument in all aspects of the proposal. Work, smart contracts, identity secrecy, protection among other relevant aspects. I have the feeling that you could have given us more information. Perhaps more work needs to be done on the challenge metrics to ensure its total adequacy. ", "q0r": 4, "q1": "The proposal is interesting and important, however the most difficult thing is its implementation. I am Latin American and I know first-hand the problems of corruption. In this regard, I consider that the proponent did not provide sufficient evidence of his abilities to implement the proposal, apart from being a very relevant academic project at a prestigious university. Iguylamente is not clear the team that will develop the proposal, because there are some external payments that are not clear in its development. Although there are identifiable elements in the budget, this aspect could be improved. The budget is reasonable to complete the work, however it would be good to have the best-developed profiles that allow them to be supported. The timetable is a bit optimistic, however it is achievable if properly incorporated into the university's programs. By the way, it is not clear what role university students will play. I think the proponent could have shown more about the project and maybe reserved. The technical processes must be explained more thoroughly, especially because of their cost.", "q1r": 3, "q2": "This is a roadmap for achievement, but for a technical process it is necessary to strengthen it. The metrics could have been strengthened to more clearly define the success of the proposal. On the other hand, if there is a clear and understandable description of the objective problem and it is adequately addressed, perhaps we expect more information given the academic origin of the proposal.", "q2r": 3, "assessor": "z_assessor_778", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Permettre le signalement anonyme, l'élection, l'organisation et la direction de campagnes pour éradiquer la corruption grâce à des tâches organisées par la foule.", "experience": "Directeur de la technologie au Centre de recherche sur la santé publique et le droit de l'Université Temple, qui travaille avec l'ONU et d'autres universités sur la politique et la corruption."}