{"id": 384395, "author": "smarlex", "title": "AVOUM on Cardano", "url": "https://cardano.ideascale.com/a/dtd/384395-48088", "category": 26243, "amount": 26500, "description": "La concurrence des contrats intelligents sur les blockchains eUTxO est sévèrement limitée.", "funded": 2, "upvotes": 113784230, "downvotes": 3750169, "votes_result": 110034061, "votes_cast": 234, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement focuses on higher limited concurrencies wrt smart contract on extended utxo blockchains, to which the proposal mentions \"account view\" setup with an indication of malleable transactions. The team proposes to safely deploy system of open contracts on the blockchain in account/balance fashion. They also have setup a POC of malleability on plutus. The funcding requested is mostly for RnD for the proposed solution but a little more detail on bigger execution picture would have been great.", "q0r": 4, "q1": "The team mentioned AVOUM mentions having prior experience of working on a different blockchain building and integrating the same solution platform but the phase chosen in this fund being only RnD on in depth cardano blockchain A little more detail on experince relevant on cardano blockchain if mentioned would have been great.", "q1r": 3, "q2": "The proposal mentions  Bigger picture on what is missing feature now and what can be implemented in future phases yet somehow is missing the technical details on current phase with a trackable sub phase wise timeline. Also there is missing details on fund breakdown for this phase. The proposal could have been great if the above points were filled in by the proposer", "q2r": 2, "assessor": "z_assessor_16", "no_vca": 18, "ne": 2, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "The account view of eUTXO has been technically established and the proposal aims to build the same in Glow. This is a much-requested feature and will open up a wide variety of innovative dApps in Cardano. The is an urgent need to develop such core technologies. ", "q0r": 5, "q1": "MuKu has been demonstrating the capability of GLow for almost a year now and has a substantial development capability. The account view model is also a peer-reviewed technology; therefore, it may be no technical risk in implementation. ", "q1r": 5, "q2": "The end state is apparent, and the budget looks reasonable for the task involved. This project, if implemented correctly, will have substantial ROI. MuKu is hosting most of their software are in opensource hence highly auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The proposal accurately addresses a problem within the challenge by drawing on the AVOUM model pioneered on the nervos blockchain to bring Account based transactions to the UTXO model and addressing the concurrency around such. If the implementation is successful it will bring value to the Cardano ecosystem and the challenge goals of raising Cardano's defi ", "q0r": 5, "q1": "MuKn is well known within the community and as this protocol has been implemented successfully on Nervos already has a high probability of success. It would be great if a couple of pitfalls, challenges of implenting it specifically on the Cardano network could be discussed in future. The Funds requested seem reasonable and a clear roadmap to future funds required is provided.", "q1r": 4, "q2": "The deliverables have been laid out but where and how these will be published could be explained better.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal sets out to provide account style views on top of Cardano as a eUTXO blockchain. It aims to achieve this with an approach already explored by Nervos with the idea of malleable transactions where the UTXO can be swapped in and out. The concurrency issue has been a previously known issue with many solutions that DeFi protocols have been exploring. Providing a different design model for helping with concurrency could have a great positive impact on the ecosystem and enable more developers in DeFi to easily create applications with the solution being suggested. ", "q0r": 5, "q1": "The team MuKn is mentioned which has been developing the Glow language within the community. Team members and their code can be seen on the Gitlab repository mentioned or on their website https://mukn.io/our-team/ The proposal has shown their understanding and experience of this problem area in the Nervos network and provided a simple budget breakdown. An 8 page paper is provided that breaks down the need for the AVOUM solution with the comparisons between the account model and eUTXO with more information on their suggested solution. The only thing lacking in this proposal is a clear explanation of where their solution fits in with the other concurrency solutions being suggested by DeFi protocols. What are the trade offs between these different solutions and what are the main uses cases that their solution would be preferred? ", "q1r": 4, "q2": "The proposal provides a roadmap and breakdown of the tasks needed to complete the proposal execution. Clarity is provided on the reasons the solution is needed along with the paper that effectively details out why this solution provides value. No KPIs or key success objectives were added which would be needed for a better rating. As well as this it would be good to know if there are any partnerships or any key initial use cases where people would be looking to use the AVOUM solution. This would give more confidence that it will be easy to audit whether this solution executed is effective under that use case with relevant metrics being analysed.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is effective in addressing the goals of the DeFi grassroots challenge as an accounts based view of the UTXO model could allow a smoother onboarding from EVM developers who wish to keep their same design patterns while building in Cardano.", "q0r": 5, "q1": "The MuKn team has already built the AVOUM on another UTXO blockchain, Nervos. The plan presented has been extended from their submission in previous fund rounds and the MuKn team made significant progress on their plans with this Nervos partnership. The team is working closely with IOG on this solution as well, chances of success are exceedingly high.", "q1r": 5, "q2": "The information included is sufficient to audit the progress and success of the proposal. The team behind this proposal has built the AVOUM on another chain and have IOGs support to built this capability on Cardano for Plutus DeFi teams to leverage in their apps.", "q2r": 5, "assessor": "z_assessor_971", "no_vca": 26, "ne": 3, "ng": 15, "nfo": 8, "vca_o": 1}], "solution": "AVOUM présente une vue de compte sur les blockchains eUTxO, ainsi qu'une notion de transactions malléables, qui permettent une concurrence beaucoup plus élevée.", "experience": "MuKn (Mutual Knowledge Systems, Inc.) a déjà réalisé un prototype d'AVOUM sur le CKB de Nervos."}