{"id": 397710, "author": "iliarashev", "title": "Visualized Cardano Structure", "url": "https://cardano.ideascale.com/a/dtd/397710-48088", "category": 26450, "amount": 9832, "description": "We should SEE where we fit in a structure to integrate faster. New members don’t SEE it and feel lost. They take average 8 weeks to onboard.", "f6_no_assessments": 20, "f6_rating": 4.4333333333333345, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal poses the problem of how to faster integrate new members into Catalyst. The solution to this problem was to create visualizations of the Cardano and Project Catalyst ecosystems with diagrams and charts through a contest. (The proposer provides research evidence on the ability to learn faster, better with pictures, visual diagrams). to make it easier for newcomers from other communities to learn about Cardano. The suggestion perfectly fits the challenge, I agree with this solution. The proposer poses the problem, is written and presented clearly and coherently, and so does the solution. The proposal also addresses possible risks such as whether the rewards are attractive enough to attract participants, I completely agree with the proposer of a possible challenge as Cardano is a large platform, has a lot of specialized knowledge, to systematize the knowledge of the entire platform with diagrams and graphs is a huge amount of knowledge. The proponent also offered a solution to this problem, calling for third parties to sponsor and advertise to get more funding for the contest. I suggest adding sponsors to clarify the feasibility of the solution. The Cardano and Catalyst communities provide participants with enough background knowledge and skills to create images, the solution is to be able to compete in groups, which I think is a good solution. The proponent also recognizes that the project may be behind schedule if the number of participants is large with one person doing the work with all the contestants. The topic is expected to expand the size of the contest in the next 5 funds. I therefore completely agree that this recommendation will have a positive impact on Cardano", "q0r": 5, "q1": "The proposer provides references for his skills and experience as an electrical engineer and participated in the establishment of 3 cooperatives on food, young people set up in rural areas, able to read and understand drawing. already CA, vCA for fund 6 and fund 7. To provide feasibility The Proposer has also come up with a clear action plan, which plans to contact Catalyst School, Catalyst Circle, IOG, Catalyst Foundation, EMURGO. However, I found that he was not clear about his ability to organize competitions, and with the action plan outlined in the proposal, I saw a huge amount of work. I think it will be better if the proposer provides a more specific plan of what goals are achieved with the above plan and adds some members with communication skills, event organization to make it more convincing about the feasibility of this proposal.\nThe stated budget is largely for the winner of the contest. However, 4th and 5th prizes with the same number of prizes. if possible, the proponent can convert to a prize for two different people. The proposer has provided a plan in case more funding is needed to implement this proposal in the impact section, however, I have not been able to verify this. With the given information, I evaluate the feasibility of the proposal with a score of 4.", "q1r": 4, "q2": "The proposer provides a step-by-step plan for implementation with timelines defining what the proposal hopes to achieve, an easy-to-follow roadmap, with numerically specific KPI goals. The number of times the website is visited, the minimum number of registered contestants that the community can track and measure. The product is a visual document that is considered by the majority of the community as a useful time-saving tool to better understand Cardano. In addition, the Proposer also provides a plan for the future development of the proposal. I have enough information to evaluate the progress of the proposal to achieve the stated goals so I completely agree with the absolute score.", "q2r": 5, "assessor": "z_assessor_706", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Very good proposal that precisely meets the objectives of the challenge. This challenge aims to encourage new people to become a member of the Cardano community, often Ada holders do not know Catalyst or make use of other technologies in our ecosystem, as well as increase the engagement of those who are already part of the community. Despite being a very incredible universe and full of opportunities, the Cardano ecosystem is extremely complex, I say this because I am already in Catalyst for 4 funds and to this day I have difficulty understanding how some things work and how I could participate more actively in the ecosystem, in addition to being CA and vCA. Therefore, the creation of a visual map will, in my view, be a very big step for us to facilitate the entry of new people, and for them to understand in a simpler and more organic way in which part of the ecosystem they fit. It's great how the author of the proposal presents a research to justify the relevance of the project; it is often much easier to learn through pictures than through massive participation in events, workshops, meetings or through reading a variety of long and often complicated documents. I believe so, it is a proposal that interacts directly with the objectives of the challenge, mainly in terms of locating people. Maybe it's not one of the proposals that attracts people the most, but it's certainly one that has a fantastic idea of ​​how to help people orient themselves. If it's already a challenge for young people (I say this because I'm from that part of the population), I imagine it can be even more confusing for people who grew up in the age of technology, don't know very well how to use online tools and so on. It is also very positive as the author seems to be aware of the possible problems to be faced, and with that, he starts to outline solutions, demonstrating practicality and maturity. Therefore, I believe that this proposal will have maximum impact if funded and done well. \n", "q0r": 5, "q1": "The roadmap is very detailed, we understand the phases of the project and what small tasks each would consist of, forming a very clear and explored chronological order. The only thing that was lacking was the notion of time, unfortunately the proponent does not say how long on average each of these activities will last, in which months it is expected to obtain such partial results, etc. This would be important for us to have 100% understanding of the process, because we understand very well what will happen and how (for example, he explains in great detail about the contest, what would happen before, during and after, and what requirements would be necessary for participation and etc, as well as possible project extensions); if this were combined with a monthly or even weekly notion, it would be perfect. Regarding the budget, I think it is a very fair value for the project, and it is perfectly explained; we know how much of the money would go to contest participants, for marketing, for documentation and so on. It would be interesting if the proponent explained their marketing strategies in more depth, as people are the basis of the success of this project, and it is necessary to attract them. Regarding the team, I think we would need to understand who the bidder is. He doesn't introduce himself, doesn't claim how he got involved with the Cardano ecosystem, what is his current relationship with it, that is, is he a developer, designer...? It would be important for such information to be included in the proposal, as well as a means of proving it (such as your linkedin profile). The rest of the members would be the winners of the contest, in fact, there is no way to introduce them at this point in the project. But I wish the author had at least taken the time to present himself in great detail. Therefore, the two suggestions I make are: the proponent could situate the script in relation to time and present itself better. \n", "q1r": 4, "q2": "Incredible. The bidder auditability is actually very good, one of the most detailed parts of the project. It gives us several KPIs that can be measured as time passes. It is a very qualitative analysis, that is, we know what we are expecting and the impacts that this will have on several fronts of the Cardano ecosystem, especially the human one, which is the focus of the project. I believe that this is in fact the best way to audit the proposal, it would be useless to set several numerical goals without understanding how this project would be unfolding for people and what paths it would be tracing. As we have a lot of information provided, I think that if financed, the proposal would be ready to be audited from the first moment, it is enough for us as a community to perform this role. Some members could be chosen to closely follow the project, they could participate in the contest phases and the unfolding of the phases and bring the information to the rest of the community. I think that a partial delivery of results would also be interesting, that is, if we could see how this graph would be born, as the parts were increasing and developing. Finally, everything the author says would greatly facilitate follow-up, enough information is provided to seriously and continuously monitor this project. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is aligned with the goals of the challenge setting. By creating a well thought out and researched visual of the Cardano/Catalyst structure completion of this proposal should provide an additional tool that can enhance the ability for new community members to be educated and have a clear understanding of how the system operates. With many new member overwhelmed by the seemingly complicated and busy structure of project catalyst, this visualization can prove to be a valuable tool in onboarding new members. By allowing many different community groups with a deep understanding of the ecosystem have a hand in creating this visualization, it should serve as a comprehensive visual to help new members capture an understanding more quickly than currently possible. \n\nOverall, by enabling new members to view a comprehensive, yet simple visualization, they should more quickly know where to start when wanting to be part of the community. ", "q0r": 5, "q1": "By providing a well thought out plan involving collaboration and implementation, the community can be confident that if this proposal is funded, the proposer should be able to deliver on the promises within the proposal. According to the plan proposed this will be a community effort to create a comprehensive, yet simple visualization to get new members up to speed on the ecosystem as efficiently as possible. The deliverables promised within this proposal are feasible to create in the allotted time frame. With many community members collaborating to create this visual it seems highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "While the suggestion of a survey after completion of the deliverable outlined in the proposal will provide good insight, it will be hard to formally audit the impact of this proposal against key metrics for the challenge. While the visual may result in the increases in the following:\nWeekly sign ups to Cardano Ideascale\nTownhall attendance\nCatalyst School session attendance\nSwarm session attendance\nApplications to leadership positions (e.g. Circle)\nit will be hard to understand if the cause of the increase can be attributed back to the visual. While this visual will be a valuable tool for community onboarding it will be hard to audit its actual effect.", "q2r": 3, "assessor": "z_assessor_1087", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Given the increasing amount of information that exists in the Cardano ecosystem, we noticed that a new user can feel greatly benefited by a visual flow that introduces them to the initial concepts. It is a relatively simple proposal, but we noticed that the author was also concerned to defend his point of view by providing links that prove the efficiency of this visual form to promote learning. With the success of this project, the expectation is that engagement around Cardano will grow, which will have a positive impact in the short term, once the visual map is complete. The budget being requested of $9,832 is also consistent with the contest being held, and being well executed, the potential benefits created by this proposal are considerably greater than the amount being asked for.", "q0r": 5, "q1": "During the feasibility plan, we noticed that several points were considered so that the rules of the contest were clear, showing that the author of the proposal was concerned with not only making the idea available, but also structuring it already considering its possible adoption by several participants. One of the most positive aspects of the proposal is also the clear objective of constantly consulting other projects aimed at education that already exist at Cardano, showing that the goal of this project is to be a way of complementing these already existing actions. Still in this context, we realized that the contest participants will also, primarily, be members of the community, a very positive factor because these are the ones who best understand the benefits that the project can bring.\n\nRegarding the budget details, the capital allocations are well defined and it is noted that not only the allocations for the awards were indicated, but also with all the expenses for complementary activities that make the project work in a cohesive way. It is even interesting to see that the payment of prizes will be made in ADA, and it also takes into account possible fluctuations when considering the concept of percentage of the total collected to promote the distribution of prizes.", "q1r": 5, "q2": "Regarding the ways that were defined to establish the success of the project, we were able to find good parameters that quantitatively indicate the adoption around the project, including an expected number of visualizations to be performed. Additionally, the existence of an expected percentage of participants who found the project useful indicates that it is well understood what the impact of the proposal should be.\n\nHowever, as a negative point of this part of the proposal, I think it is necessary to point out that too much information was made available, which left the general organization of auditability a little confusing. Thus, the understanding of how the monitoring of the project will be carried out is not so clear at first. But even so, we have that in general terms this is a great proposal.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aims to provide a visual representation of the complex, ever changing Cardano ecosystem. As someone with 15+ years of expereience in training and development, I know this is a very powerful tool to accelerate understanding of complex matters. The approach of crowdsourcing with a contest adds power to the objective by taping into the collective mind of the community for the best solution.\nI followed the proposer's process of building this proposal consulting with the community every step of the way.", "q0r": 5, "q1": "The proposer has done a detailed work plan that make sense, providing all the information about how the resources that will be used, a credible timeline for execution, KPIs for every stage and more importantly impact focused metrics for the outcome of the whole exercise. He also designed this to capture lessons learned for a next iteration of the same exercise in the future as this is a fluid environment and it will require constant updating.\nThe proposer clearly identifies the risks, especially the amount of workload involved for a single person, I suggest in future iterations to include in the budget some funds for additional team collaborators.\n", "q1r": 5, "q2": "The community will easily be able to track progress of the implementation, the results are very tangible and easy to track and the KPIs and timetable are specific, quantifiable, and verifiable.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": " New members to Catalyst don't see the structure of Project Catalyst.  They feel lost and it takes months to fully participate.       \n\nThis fits the challenge and has the potential to increase most, if not all of the success metrics.  Attendance to events, like townhall and Swarm, could be increased because new members would be quickly and visually be aware of them and how they relate to each other.       \n\nThis would reduce the time to feel comfortable with participating in catalyst, especially for visual learners referenced in the proposal.", "q0r": 5, "q1": "The project is innovative and works from a systems dynamics perspective on several levels.  Most importantly, it creates \"visual maps of the ecosystem\".  Secondly, it creates these maps in a decentralized way by creating a contest to incentivize diverse participation and perspective.  This matches the goals and principles of Catalyst - collaboration, inclusivity, and innovation, to name a few.       \n\nThe key deliverables are visual representations of the catalyst ecosystem in form of diagrams and charts.  Proposer includes links to research on visual learning and comprehension.   \n\nThe risks to success listed are reasonable but don't pose a block to success.\n\nThe project is led by one person who is new to Catalyst, but active in Townhall and other channels.  He is qualified because he understands clearly the perspective of the new user. Based on the linked short biography (link to discord post) and active participation in the comment section, he is industrious, design-oriented, and collaborative in nature.\n\n", "q1r": 5, "q2": "Gets good marks for audibility because the focus is on decreasing the time for onboarding.  The proposer surveyed the community to establish a baseline. While this is not scientifically rigorous, it is better than nothing and shows the mindset of the proposer.       \n\nThere is a very detailed action plan and clear timeline with enough specifics for auditors to easily track the project.     \n\nKPIs are clear and measurable.  A survey of participants and the number of times the visualizations are viewed are the measures of success.  \n\nThe problem is well aligned with the challenge and the solution fit with the goals and principles of Catalyst / Cardano", "q2r": 5, "assessor": "z_assessor_56", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal offers another option nfor people tolearn about Cardano and Catalyst.\nMany people are visual and learn better and fast by using images (chart, drawing, pictures...).This is an opportunity for that type of possibility for people who have interest to the ecosystem to onboard butt also play some key roles from within.\nThe proposal is aligned with the challenge goal and should have an impact to Cardano.", "q0r": 5, "q1": "Well established budget with enough details to be understandable. \nThe challenges raised by the Proposer may be serious  as it may an impact on the timeline, since it needs a selection among ideas that different teams and individuals will be submitting to the proposer, which could lead to various rounds of picks on  different period of time.\nThe proposer hasn't revealed much about them selves, except some of their achievements, which is not bad, but it would have been better to describe who you are for any proposal reader, who may not necessarily wouldn't be accessing the share links.", "q1r": 4, "q2": "The community nay be able to follow the implementation of this project as each step will be published online as promised by the  Proposer", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The proposal addresses the challenge from two angles: increase meaningful participation and encourage new members to utilize tools and services available. Actually, the problem statement is focusing on new members, nevertheless, the solution planned to be built also has the potential to help existing members to further explore the Catalyst ecosystem.", "q0r": 3, "q1": "The implementation will take place as a contest, to find the best team to implement the solution proposed. To ensure quality outcome a defined plan on requests and different work streams are essential. For example, the design of such a structure – what sub-elements need to be covered in the design (process, roles, groups, community driven catalyst functions, etc.), furthermore I would have liked to see more detail on maintenance of such a visualized catalyst structure, since evolution is our status-quo.\nA crucial aspect is early involvement of IOG, CF, DCF to involve them to the process – may it be as jury or other feedback giving role within the contest itself. Said that the assessment of the submitted visualization should been given more importance regarding the details given in the proposal.\n\nHigh emphasis is given to visualization, which in fact is a main driver, nevertheless, accompanied information, and how this is communicated, what additional features will the visualization (interactive?) provide (e.g., suggesting actions for engagement, specific entry points to different profiles of new members), will also impact onboarding experience. I suggest adding those details to the “request for interactive Visualization of Project Catalyst”. The aspiration of the guideline for contest participants can determine the quality of output, ensure setting the bar to engage different profiles of the community working together on this.\n", "q1r": 3, "q2": "Roadmap is in place although I am not sure if it is listed as it will happen, e.g. I would strongly recommend before talking to key stakeholders having concluded a robust guideline for the contest to capture valuable feedback at once from those stakeholders. The potential output of this project could have an importance in view of Marketing initiatives and ensuring it is well reflected. Mitigate the risk of creating outputs that could confuse members and new members (you may consider calling out “insiders” or OGs of Catalyst to participate and collaborate).\nKPIs are set, here I would like to encourage target setting. A valuable imput for this could be the status of sign-ups in IDEASCALE for example. \n", "q2r": 4, "assessor": "z_assessor_433", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Ever since I joined Project Catalyst in Fund 3, I've been wrestling with the perceptively slow participation rate from the Community whom I would have thought would all been jumping in given the relative successes of funded proposals throughout 2021. We are not short of winning stories. The number being reported are growing from fund to fund to be sure but they are not keeping in pace with the growth of wallet addresses meaning there's a large number who are very passive ADA holders. I've seen everyone in Catalyst make an effort to bump the numbers higher but we haven't seem to have locked onto the winning formulae. Which is why I agree that this proposal addresses the challenge criteria in its own novel way. We need to start thinking outside of the box and try every way possible to rope people into participation and if it will take a visual contest to do so, then why not give it a try. The approach and the trajectory of the proposal is all towards greater participation. The budget is not only small enough to warrant the effort but that the majority of it comes in the form of prizes for the visual entries indicates the trustful intention of the proposer. To improve this proposal further, I suggest to include the fact that this is a contest on the title itself. This will clearly state the intent of the proposal even without having read any further details. ", "q0r": 5, "q1": "I am sitting on the fence in terms of successful implementation of this proposal due to the difficulty in assessing the proposer's bona fides. Not everyone has Discord so having the CV on that channel will be a struggle for some. Also the websites included are not in English (Bulgarian?) which would mean another step for readers to validate past experiences. It's a tad ironic a proposal that's intending to make it easier to get into Catalyst does not itself abide by the same principles in its presentation. That said, the plan as described seems to be what you would expect when establishing a contest. This logical presentation coupled with the proposer's miro documents show an understanding of the process, what's involved and the content the visuals are meant to represent. As a former assessor for tenders to a university, this proposal is almost there but just falls a little short in making it easier for the audience to confirm details. I suggest that next time, redirect the reader to an English website and create a profile in Linkedin which has become the standard for proposers to publish their credentials. ", "q1r": 3, "q2": "The process after receiving funding is described very well and should make this project very auditable. The fact Catalyst and prominent personalities will be engaged with to come to a quorum of the contest's boundaries means there's a good chance for success as I have always observed Catalyst, its various entity groups, IOG, etc are open to any level of engagement. Where this proposal could further improve is with an early determination on how and where the contest will be hosted. To state it will be 'co-hosted or hosted' throws uncertainty wherein either options carry different financial impacts, which could affect the budget itself. That said, the final outcome of the project being a survey and the percentage of people who agreed to the visual contest being effective, is the ultimate audit point for this proposal and depending on the result, could may well lead to more visual-centric campaigns that could help drive further participation in Catalyst, whether by this proposer submitting another in a future funding round or by Catalyst itself. Good luck ", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The problem that needs to be solved with the proposal is how to get new members to join Catalyst faster. The team's solution is to create images of Project Catalys and the Cardano ecosystem through diagrams and charts by going through a drawing contest. They also give convincing evidence for the use of this diagram such as: \"\"Creating visual explanations improves learning https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5256450\nThe Role of Visual Learning in Improving Students’ High-Order Thinking Skills https://files.eric.ed.gov/fulltext/EJ1112894.pdf\nDo You Get the Picture? A Meta-Analysis of the Effect of Graphics on Reading Comprehension https://journals.sagepub.com/doi/10.1177/2332858420901696\"\n\nWith this solution, the time to introduce new members will be significantly reduced. Time to take on new positions in Catalyst (referrer, voter, CA, VCA) will be reduced due to faster membership orientation and deeper understanding of the system. The form that the proposal offers makes it easy for new members to understand the whole ecosystem, find their own position on the Catalyst-Cardano platform. The proposed team has also introduced risks such as low-budget rewards that don't create motivation for contest participants, so in my opinion, the team needs to apply for more funding and advertising. I completely agree with this project.\n", "q0r": 5, "q1": "The plan of the proposal is very detailed, including 12 tasks, these tasks are clear and can be done. Additionally, they plan to contact Catalyst School, Catalyst Circle, IOG, Catalyst Foundation, EMURGO for information and support for the competition judges.\n•\t- The project's budget focuses on the prize for 01 contest which is 7,000 USD. The other parts of the budget are very detailed, however, the unit price per working hour is a bit low ($20/hour) so it may affect the quality of the project.\nThe proponent has experience in establishing 3 cooperatives, one of which is a food cooperative, the other a rural youth cooperative, the other has no information. The proponent is an electrical engineer and has been CA and vCA in fund 6 and fund 7. The team has only 1 member, however, there is no information regarding his experience in organizing competitions but I saw that he was a builder of 3 cooperatives so he should be able to organize this contest.\n", "q1r": 4, "q2": "The proposal has a roadmap, clear timelines for delivering product, clear and measurable KPIs. The proposal clearly describes the objectives to be achieved at the end of the project such as: 60% of survey respondents consider visualizations to be a useful tool; - 60% of survey respondents agree that visuals have helped or will save them time; the number of hits the visuals. The target is 5,000 unique expressions per Fund for the next 5 or more funds. This proposal is a completely new project, not a continuation of previous projects. I agree with this proposal.", "q2r": 5, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal impacts greatly in the challenge of building alternative documentation to onboard new members, and it is well structured in its objectives. The creation of visual maps is something new in Catalyst, and the approach used in the proposal (a contest) has good potential to bring even better solutions to the challenge. ", "q0r": 5, "q1": "Proposer has given evidence of technical abilities and the action plan is convincing enough with is guiding questions. The proposal could be improved if the proposer had stated experience in the Catalyst community, however, given the current plan, the lack of this information does necessarily the proposal weaker. ", "q1r": 5, "q2": "Deliverables, a roadmap and a detailed action plan were given. As the project consists of a concrete and tangible product, auditability is also achievable. Description of budget is clear and reasonable.", "q2r": 5, "assessor": "z_assessor_386", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "I really liked the idea of having a visual way to see Cardano ecosystem and iteract with this map, having the possibility to go deeper in each topic via hyperlinks. Having a rewarded contest to choose the best visualization may also help to increase the variety of ideas and incentive the best out of the community. Proposer also brings links to articles highlighting the imporantce of visual maps on learning, which helps to build the appeal for this project. Proposal is aligned with challenge as it will help to increase the number \"proposers, advisors, mentors and voters who are both eager and capable to fulfill their roles and understand their responsibilities\" and potentially address kpis as \"Growth in the number of Community Advisors and Veteran Community Advisors\", \"Growth in the number of voters\" and others. risks mapped here are fair and there is a mitigation strategy for them. Also appreciated that feedback from community is part of the scope of this project amd that exapmples developed the proposer in Miro is brought here to help illustrate what is in its mind; \nOne imporant thing to consider is that it is essential that these visualizations stays up to date, as community grows in strucutre. it could be explict in the proposal who will be the responsible for these updates whenever there's a change. Communication plan is not explicitedly detailed here but it it is considered in project, so I wouldnt worry much about it. Last, I guess contest evaluation criteria could also be clearer here. Will the proposer evaluate it by himself or will it have the aid from the community?", "q0r": 5, "q1": "The project Plan is really well described and the to roadmap in auditability is time-framed. It would be imporant also to add the times in the action plan in the feasibility part.\nBudget breakdown is fair and sensible and accounts for only 5% of total challenge budget. I appreaciate there's a dedicated contigency line in it to help mitigate unexpected costs, which is essential in all projects. Imporant also to highlight that 70% of requested budget will go to reward contest winners, which is fair from my point of view.\nFinally, 1 person seems enough to run the project and the contest. there are links to verify its CV and its previous work, making it easier to attest project feasibility.", "q1r": 5, "q2": "There are very good milestones listed and they are time-framed, using the funding receiving as a reference. The proposed kpis also make sense and have target, which makes the auditability and defitinion success clear. I particularly liked that there's a kpi for measuring positive feedback, via a survey  (60% of participants in the survey are finding the visualizations a useful tool) and that the the number of views the final visualization will have after a certain amount of time once project is conclude is also taken into account (with a bold target).\nAll in all, the project is auditable both from a development perspective (milestones and kpis while project on going) and from a final successful perpescrtive (once completed).", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Creating a simple and clear map of the entire Cardano eco-system for a first glance when entering the space can facilitate the understanding to all newcomers and help them overcome the feeling of overwhelming, that many seem to have and at the same time, increasing long-term memory through visual information. What is even better about this proposal, is the fact that the proposer does not wish to come up with the diagram by himself, but let the community work on it together through a contest with prizes included in the budget.\nAs such, I conclude that this proposal can help more passive ADA holders become active in the Cardano/Catalyst eco-system faster, by mitigating the feeling of being overloaded with too much information at once. Having a simple diagram will cement the feeling that it is a simple process and that getting involved doesn’t require extensive reading on a very long period of time, the community is welcoming and everyone is learning together.", "q0r": 5, "q1": "The timeline presented is very detailed, the proposer has given a lot of thought into the entire process, from start to finish, and every detail has been carefully laid out. \nThe budget is also very carefully broken down into all necessary parts, there is nothing that I find to be lacking or to be out of place. \nAs for the required team members, the proposer will be the one organising the contest in (possible) collaboration with Swarm and Catalyst School, and the contest is open to everyone who has ideas and wishes to submit a work. He is already an active community member and has provided several links to his work in the community.", "q1r": 5, "q2": "Just like the rest of the proposal, the KPIs and the roadmap are extremely detailed, and thought out for all steps, not just to the launch of the contest, but also for afterwards, with the planning of surveys and the publication of their results.\nThe success is well defined, with clear milestones accessible to everyone. As such, based on the information provided, the proposal is easy to assess.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The project proposal offers to speed up the time for onboading new members by creating a graphical visualization of the structure of the Cardano ecosystem.\nThe choice of solution (visual interactive map) is supported by publications proving the value of visual representation in the process of accelerating learning and perception. The creation of the most appropriate visualization will take the form of a public competition aimed at the Cardano community.\n\nThe project is entirely focused at the community and its involvement in the creation of this solution - a visualization of Cardano ecosystem. The main amount of the funding will be distributed as a prize fund (and not fully utilized by the applicant) in a competition held among community members, in order to select the best solution. I lack an explanation of how community members will be involved in the voting and if not who will vote and evaluate the quality of the visualizations. An added value to the project would be the provision of examples of criteria that could be used to vote in such a competition.\n\nAccording to the applicant, the implementation of the project will significantly accelerate the time for orientation of the new members and their meaningful occupation of positions - referrer, voter, CA, vCA.\n\nAccording to the above, the proposal is specific and linked to the objectives of this Challenge. Its focus on providing an easy way to onboarding new members and accelerating their responsible assumption of roles in Cardano's ecosystem.\n\nThe applicant has identified three risks for the implementation of the project - the amount of the rewards; number of proficient in the visual community members; unrealistic evaluation of the work load in the project - proposing concrete measures to overcome them in case of manifestation.\n\nAccording to the described benefits, the project has a great chance to benefit the community and to serve for the further development and evolution of the ecosystem.\n\nWhat I would like to see is a clearer description of the ideas for sustainability, adaptability and plans for future development and evolution of the visualization map so that it can be updated according to future changes in the structure or environment of Cardano ecosystem.", "q0r": 4, "q1": "The project activities are clearly described and detailed. The performance time frame is added in the next section - AUDITABILITY. The plan also provides ways for future development and upgrading of project results. This will be done by receiving feedback on the use of visualization by the community, verifying the content by higher structures (CC, IOG, Catalyst Foundation and EMURGO) and creating customised visual materials for different ages and categories of members. As I mentioned above, I do not find any plans here for further editing of the visualization in the future in order to bring and up to date picture in case of changes and evolution of the ecosystem itself.\n\nThe distribution of the budget is made in such a way that most of the funding will be awarded to the participants in the competition for the creation of a visual map of the ecosystem (at best, these will be active members of the community).\nThe budget for the remaining costs is detailed with the estimated duration and hourly pay for each work and task, corresponding to the proposed timeline of the project.\nWhen presenting the budget, the applicant also foresaw the possible changes in the ADA's exchange rate against the USD when calculating the value of the prize fund.\n\nThe applicant provided examples of his expertise in creating visuals. I lack information about his expertise in organizing competitions and project management. As the applicant is a single person, this requires the possession of a set of competencies that allow a wide variety of actions - project management, marketing, communication with partners, financial management. Providing such information would strengthen the quality of the project proposal.", "q1r": 4, "q2": "There is a clear timeline described with detailed activities in it. Each stage is supported by a measurable KPI, relevant to this application. The KPIs identified are not the same as those recommended in the challenge, but are in sync with them and are consistent with the current project.", "q2r": 4, "assessor": "z_assessor_1890", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is perfectly suited to the challenge by reducing the time it takes for newcomers to fill positions in Catalyst. Through holding a contest to create visuals\n knowledge about the Cardano and Project Catalyst ecosystems with diagrams and charts.", "q0r": 5, "q1": "The Proposer provide an action plan with 12 steps, It is better if definite timelines can be provided. The budget is presented in small, clear, logical sections with the majority of the money going to award winners in the competition. The proponent has a person with Catalyst related experience with a link to prove it. I advise the subject to add necessary positions to implement the project as well as the person in charge for these positions, the feasibility of the project will be more complete. From the above reasons I neither oppose nor agree the feasibility of this proposal.", "q1r": 3, "q2": "The proposal has a 12-week implementation schedule with the contents of the work to be done. The indicators to check the progress of the project are relatively clear. however if it is specific in numbers that would be even better.", "q2r": 4, "assessor": "z_assessor_1820", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposer mentioned so many links that could help guide on the website. With informative videos and visuals it can be easier for inexperienced new comers to become well informed and have them get onboard in the community. \nHaving a competition with winners winning a good percentage from the fund will attract creatives in the community", "q0r": 5, "q1": "The members participating in this project are well rounded with backgrounds that benefit this project. Some of the funding details dont seem realistic and shuffling the funding around within the same budget can make this project more achievable", "q1r": 4, "q2": "There doesn’t seem to be enough information on how this project can be audited. Neither on social media on their website", "q2r": 3, "assessor": "z_assessor_1660", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The idea itself is very good and unique, in my opinion. It is important to present information in a more visual and objective way. This could not only improve the knowledge of the existing members but also attract new ones since people might feel less intimidated knowing that information is easy to access. \nHowever, it is very risky to make a project that depends on people submitting their ideas. I understand it might have its benefits, like developing the members who will submit their proposals, and creating the best possible model. On the other hand, there might not be enough proposals, and even enough good proposals. I believe it would be more efficient to actually develop this visualization structure while collecting inputs from the community, so it wouldn't be so dependent on them.", "q0r": 4, "q1": "The timeline seems very detailed, but I would have like some more detail on how long each step will take. It should be considered some extra time in case there aren't enough proposals and there is the need of an extension, or an overall alternative to that.\nThe budget seems well-thought, and I like how it is considered the possibility of a change in the price and thought of a solution, and the aditttion of miscellaneous expenses is very positivo. \nI would like some details about the member of the proposal, with more information about their backgroung. But I like how there are links included to verify some of his work.", "q1r": 3, "q2": "The KPIs seem transparent and I like how there are KPIs for each phase. This will allow constant monitoring to ensure the project is on the right path.", "q2r": 5, "assessor": "z_assessor_1659", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "They proposal identifies that new members can feel “lost” and through provided documentation shows the advantages of strong visual representation, enhancing comprehension and engagement. If this was the main focus of the proposal it would definitely address the challenge well, however the main focus of the proposal is the running of a competition to achieve the desired info graphic.  \nAs the majority of the content of the proposed road map would be accessed through hyperlinks the information would be easily updated. The main graphic has a good chance of staying relevant in this quickly changing environment because of this, helping the impact of this proposal over time.", "q0r": 4, "q1": "My concerns regarding weather this proposal would be implemented successfully are as follows. To enter the competition would require a significant amount of time from any given entry. A lot of this skilled work would be in vain as only one design could be implemented. This could discourage enters. A significant proportion of the budget would be allocated to runners up. These funds would not be helping the final outcome of the chosen product/road map. I feel these funds would be better used refining and improving an identified visual. Therefore I feel the budget could be better used through collaboration to solve the identified problem. The solution to the problem is good and valid but the means of getting to that point seems waist full in both time and funds.", "q1r": 2, "q2": "There is a structured plan with detailed breakdown. As much of this project involves community participation it would be easy to track the projects progression and judge weather it was in line with the provided timeline. There are also measurable KPI,s with stated goals of success this would allow easy audibility of the project if funded.", "q2r": 5, "assessor": "z_assessor_1513", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This high-reward, low-risk proposal is fresh take on the classic Catalyst problem of creating and maintaining knowledge hubs.  The proposer first suggest a visual model rather than the usual data repository, something with minimal descriptive text, yet hyperlinked to all the relevant knowledge resources, but then takes it a step further by proposing to run a community contest for visual creatives to try and make the best visual map.  Since participation and engagement are two of the challenges of creating accurate, robust knowledge hubs, this project is getting off on the right foot.  Besides addressing the challenge setting eloquently, satisfying no less than 5 of the challenge setting goals, this project will obliquely approach an underrepresented group in Catalyst: the creatives and visual thinkers.  The proposer also makes a good case for the value of just such a visual representation to exist alongside the existing onboarding material by including research that shows strong links between good visual aides and better retention of information, better orientation within onboarding experiences, and more intuitive understanding of relationships between resources.  In the future the protocols established with this project could also help create other engaging resources, such as ELI5 and ELI65 visual explainers, or niche tutorials for finding ones way through communication channels.  All in all it is a refreshing idea for tackling a longstanding problem in Catalyst.", "q0r": 5, "q1": "The quality of this proposal, the organization, thoughtfulness for process, and clarity of expression are probably the best indicators of the proposer's ability to successfully deliver on it, but he provides many other concrete reasons to have confidence in this project.  His experience as both an organizer of information protocols as well as an electrical engineering background (apparent in the 'flow' of the proposal which reads much like a circuit map) indicate substantial strengths, with links to projects he has worked on as proof.  The budget almost seems like a typo, as in too-low, but when you see how thoughtfully it has been applied, it is clear it is adequate to deliver the stated results.  The proposer notes that there is some risk that the rewards suggested for the contest may not be enough incnetive to draw enough participation, but in my opinion the first place award of $3000 is very attractive, and the fact that the top 5 entries will all receive compensation means that the incentives should prove adequate.  The proposer even thought to include a way of calculating the rewards to take into account the moves of the underlying ADA asset, apportioning the rewards as a percentage of the budget, rather than a hard $ value.  On top of that, space has been provided in the budget for marketing and hosting, and despite the nature of the project as discovering emergent value, budget has also been wisely set aside to help participants gain access to some tools that may prove useful in establishing their visualizations, such as subscription Miro services.", "q1r": 5, "q2": "Of the hundreds of proposals I have read, this may be the finest version of a roadmap I have seen.  Everything is there:  all milestones appear in both the roadmap and budget, the timeline resolves to two-week sprints early, with the associated KPIs provided alongside the phases where those KPIs are measured or realized.  Catalyst projects need to have auditable reference points at least once a month:  this project provides 6 auditable events in the first 4 weeks, 4 in the next 4 weeks, and then a steady beat of two KPIs per month until the project is delivered.  Because the project requires masive community participation, there is no doubt that it will be easy to keep track of, and he indicates here several way of tracking and submitting communication regarding the project.  It is worth noting that among the KPIs provided, there is also the rarely seen in the wild KPI for measuring impact beyond the scope of the proposal, and in an otherwise humble proposal, the number almost seems incongruent.  The proposer would like to see 5000 unique views per fund, and would like to see that reached across all of the next 5 funds...  in other words, massive and lasting impact.  With a plan like what is presented here, I think he has a pretty good shot at realizing that ambitious goal.\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 17, "ne": 8, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Preparing interesting visuals for newcomers can help with the learning curve and direct them to onboard quickly. In addition the proposer mentions that many of the guides and tools are various links and websites. Some people do not absorb that information efficiency this way and need a more visual sense of direction. the impact of this project will help more people onboard with ease and allow existing members to reach out to their inner circles. \nFinally allowing 30% of the fund as a competition will bring more awareness and attract creativity around this project. ", "q0r": 5, "q1": "the project basis and teamembers fit well within the scope described. The themes and topics to aboard are well defined and very acheiveable. \n\nHowever I think that the competition bassis might be a wildcard and may hinder the progress if no adequate participants are inspired. In addition the marketing budget to circulate the competition and attract members is very small. \nI would recommend that this be reviewed and reach out to many creative centers with will be a double positive of newcomers and visual graphists. ", "q1r": 3, "q2": "Auditing is not clearly indicated if there is a website or social media presence to follow this competition and project. I would advise to find a better project closing KPIs. \nthe mention of a satisfaction survey is a good point that was brought up and can help gauge the impact of this project. ", "q2r": 3, "assessor": "z_assessor_785", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Create a clear VISUAL map of the ecosystem with less words but hyperlinked for detail. Use a contest to find the best visualization.", "experience": "I have been an active part of creating 3 cooperatives and the work on these projects brings me the relevant exp. for this proposal. As an Electrical engineer I eat drawings for breakfast;)\n\nhttps://www.hrankoop.com/hrankoop/sofia/\n\nhttps://www.facebook.com/livingvillagecommunity/"}