{"id": 397767, "author": "murdocisgod", "title": "member onboarding gamer recruitment", "url": "https://cardano.ideascale.com/a/dtd/397767-48088", "category": 26450, "amount": 50000, "description": "Cardano needs new members. A fun game game will onboard gamers as members.", "f6_no_assessments": 6, "f6_rating": 2.0000000000000004, "videos": [], "media": [], "f6_assessments": [{"id": 620, "q0": "I am having difficulty understanding where this proposal aligns with the challenge setting of bringing new members aboard Catalyst.  The suggestion seems to be to make a blockchain based game of some kind, and if good enough it will attract new members.  At first I thought it would be a suggestion to gameify the Catalyst onboarding experience, which would be awesome, but after several read throughs I have to conclude that is not what the proposer has in mind.  A far better choice would have been to submit this idea under the F8: Gamers On-Chained, and also to better articulate how it is adding value.  There is no real identification of any gameplay elements other than that they should be \"good\" and a general agreement that if players could make money playing it, that would also be good.  What is absolutely clear is that there is no way that what is laid out here could onboard new members to Catalyst, or create new resources to help with that onboarding, or to use existing resources in innovative way.", "q0r": 1, "q1": "The proposer has included a budget that adds up to 9x the funds they are asking for, while indicating that a risk of the project is that it won't receive enough funding to be completed, which is an odd approach.  The plan seems to be to pursue continued Catalyst funding to keep the project on track, however the plan as presented here doesn't even begin until November, a full two funds from now.  Why the delay, especially given that those funds are supposed to be used to keep the project on track?  The development plan that has been laid out indicates a basic lack of information regarding the nature of games on the blockchain, does not include any of the known gameification factors like NFTs or tokens, and certainly has no connection to the specifics of Cardano that make it a good option for developers (built in on-chain assets, for example, no L2 needed).  Indeed the timeline includes references to game development that are either fabulously outdated (graphics board evaluation?) or suspiciously naive about what is actually required to make a blockchain game.  The team list is extensive, much like a studio game developer might need, and the budget of $450,000 reflects that (though, again, the proposer is only asking for a portion of that...but it is unknown which part of the budget that is meant to fund).  It is recommended that the proposer reconsider the \"big game\" mindset, and consider instead the value of gameifying the onboarding process into Catalyst.  This would be a good way to apply some of the principles he is suggesting (you can find them typed out on the attached images) and perhaps even realize his note about using decentralized catalyst protocols to help direct where the game development goes.", "q1r": 1, "q2": "The included KPI of \"Honoring the cardano and game community\" will be a difficult one to measure, and I don't see a way to effectively report it.  The proposer here also says that they want the community to help create the KPIs, but I'm not following the line of reasoning here.  What the proposer should be including here are milestones that once reached can be successfully audited and reported on.  For a game, and assuming it matches the challenge setting, number of players onboarded through it, or daily engagements are the kinds of metrics that show impact.  If the game were to onboard members through \"playing\" educational scenarios regarding finding resources or making connections, then badges earned or courses completed could represent meaningful measures of interaction and engagement.  It is also recommended that the proposer think about what kind of communication with the community can be established in order to allow for better tracking of the progress.  For game development, opensource github commits are the gold standard, but even a social media channel or website can be useful.", "q2r": 1, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 1665, "q0": "The proposal doesn't seem to address the challenge goals directly to recruit and onboard more members to the Catalyst community to take on more roles (e.g., Voters, Proposers, CAs, ...).\n\nThe proposed idea would indeed increase the adoption of Cardano ADA, as gamers will have to own ADA to play and earn and potentially contribute to the Catalyst community; This is why I see it indirectly addresses the purpose of the challenge.\n\nI also think that GameFi (Play to Earn Games) could become an ideal channel to boost the awareness of the passive ADA holders about the community, which is also another way to look at how the proposed idea could indirectly meet the campaign's goals.", "q0r": 3, "q1": "The proposal listed the skill-set required to build the game, but it was unclear how the author would be able to create such a team (14 team members).\n\nHiring resources with the expertise listed in the proposal is infeasible, providing the timeline and milestones described in the proposal; the hiring process in a small to medium company could take months to build such a team.\n\nA team of Fourteen members is a very big team and, from my experience, tough to manage, and I think this is a considerable risk that would impact the delivery of the project.\n\nAdditionally, it may take considerable time and effort to settle and refine the idea of the game, which is a crucial milestone that was missing in the project development schedule section.", "q1r": 2, "q2": "The described development milestones weren't detailed enough to effectively measure the progress on the idea. The plan listed is broken down monthly with intangible and vaguely explained deliverables.\n\nThe proposal didn't list any success criteria or metrics to track, which would make it hard to assess both the progress and delivery of each milestone and the overall project.\n\nThe author promised quantitative indicators based on the roadmap but didn't adequately define or list the type or the format of those indicators.", "q2r": 1, "assessor": "z_assessor_1401", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4979, "q0": "In my understanding, the problem description is biased by limiting the main issue to the challenge of attracting new members to Cardano. This limitation ultimately affects the composition of the proposal as a whole.\n\nAn initial improvement would be (1) to better clarify the problem before proceeding with the solution; (2) adopt a problem that has a stronger correlation with the challenge, such as “Cardano needs to improve the new members onboarding and stimulate the engagement of all roles in the community”.\n\nThe proposal describes an initiative that is closer to the development of a product, a game, and that eventually can become a channel for attracting new members to the community.\n\nThe document presented lacks correlation with the objectives pursued by the challenge. With this, the author can explore the main aspect of the challenge, which is how this solution will contribute to (1) convert passive ADA holders into active Catalyst members (2) increase the participation of different community functions (3) improve the onboard process.", "q0r": 3, "q1": "The author mentions at the beginning of the proposal having experience in production, design and programming, however, evidence and references about his previous work were not presented.\n\nRegarding the composition of the team, the skills that the author intends to have in this project were presented along with the monthly cost of these professionals. However, it was not clear whether he intends to have these professionals part-time or full-time.\n\nFurthermore, details about the team members were not provided. In order to understand the feasibility of the project, it would be important to meet people involved who have the necessary experience for the development.\n\nAnother important detail would be to identify what other functions are needed in addition to the game's production. From my experience with this type of release, working in the last 7 years with digital marketing and product design, I understand that in addition to producing the game, it will be necessary to go through other steps until the project is successfully delivered. This was not clear.\n\nThe author presented us with information about the training he needs for the team and a schedule in macro stages, that is, without detail, which lasts approximately one year.\n\nThe annual cost, just for labor, would be 10x the budget requested in the proposal. This limits understanding of how the project is planned in detail, how the desired budget will be used, and, perhaps most importantly, whether it will be sufficient to implement the project.\n\nAs mentioned above, the main challenge pointed out in the project was not having enough resources to finalize the product. In addition to presenting an estimate that differs from the requested budget, the strategy to mitigate the risk lacks information.\n\nGiven that this is the main risk and that there is such a large divergence between the necessary and requested budget, a more detailed explanation of what we will be able to accomplish with the funds received by the proposal and what was the rationale for the division would be in order.", "q1r": 2, "q2": "No information was provided about the project progress audit process. The author can further detail this stage of the proposal by bringing to us (1) indicators of project progress (2) viable ways of monitoring by the community (3) metrics aligned with the objectives of the challenge.\n\nAnother problem in this outcome of the proposal is the author's view of the success of the project. The answer presented has nothing to do with the objectives of the challenge. It would be important that the challenge requirements were revisited and considered among the main deliverables of the project, that is, what will justify its implementation and translate into a successful conclusion.", "q2r": 1, "assessor": "z_assessor_1818", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5790, "q0": "First, this proposal should be on Gamers On - Chained. Although there are shared interests (and some results could be achieved) the point of this challenge differs enough that it is not an adequate proposal. In any case, I will do a complete analysis of the proposal and suggest some recommendations.\n\nThe intention of this proposal is to attract new users (transform them from lurkers to active members) through the gaming community. The market is large and Cardano is in a position to start taking advantage of it. Now, the results will not be different from any other game proposed and executed on Gamers On - Chained, why? because by sharing the same bases, the only thing that differentiates them is the direction, but giving them an direction focused on attracting new users to fulfill roles in Catalyst is far from an optimal idea (I'll elaborate later in this analysis). It is not mentioned in the proposal, but for example this proposal could create special events, if it is your first participation (presumably verified through DID Atala Prism) they award you with points in game, special events for CAs, VCAs (according to your reputation ), if more than 0 good or excellent reviews in last funds then equals bonus points in game, etc… but that the focus is on this dynamic does not seem optimal (although at first glance it does not seem obvious).\n\nSo how can we capitalize on the idea and make better use of Catalyst funds? This idea implemented as something complementary in a game would be excellent! Imagine playing Cornucopias (one of the best games in development for Cardano funded through Catalyst) and being a CA or vCA with a good reputation you are given a limited edition ship to travel the worlds with. Very good, now we would have interests to generate a reaction in the player and potentially occupy a role (and persist over time). It is a solution applicable to all games, relatively easy to implement, so it does not seem appropriate to dedicate the requested funds ($50,000 aiming at 500,000 in total) to a proposal of this style. Not to mention that due to what was stated by the proposer it would be a turbulent execution (No team, no dates, no demonstrable previous experience, ambiguous overall goals).\n\nFor these reasons my rating is a 3 in Impact.", "q0r": 3, "q1": "Although a certain flexibility in the schedule is acceptable, since there is no plan or team, there can only be tentative dates. That is exactly what you will find in the proposal, possible dates and no specific year.\n\nThe promise is to build an A list game, but there is no team, and the only person on the project (proposer) did not present any verifiable credentials of their expertise claiming to be capable of leading. This raises some doubts.\n\nRequesting $50,000 for this proposal, $46,400 would be spent per month (and the game in total would cost $489,984). High figures, without a plan and without an apparent method of support (he seems to be unaware that there are 4 Funds a year, 1 every 3 months, since he suggested continuing to finance the project through Catalyst as an option)\n\nIt is very difficult to think that this can be done. For what is mentioned, my note is a 2 in Feasibility.", "q1r": 2, "q2": "Due to the brief information presented, it is understood that the game will only be Auditable once it has been launched, that is, within 3 years (and with unspecified metrics). Nothing was mentioned about how one could be in contact with its development during all that time. I suggest the proposer create a Discord channel (take as a guide the organization from other Cardano game oriented Chanel’s) and Twitter account for these purposes.\n\nFor the degree of seriousness that a project of this caliber requires, I believe that it is necessary for Jonathan to present a clearer and more complete proposal for the next Fund.\n\nMy note in Auditability is a 2.", "q2r": 2, "assessor": "z_assessor_277", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6305, "q0": "In order to attract new members to join Cardano, the proposal will create a game play with the main feature of Blockchain gamefi feature. Features will be play for money, defi components and asset ownership intended for gamers. He thinks that a good game will attract more people to join. However, the proponent has not given a specific solution, just an idea. At the same time, he asked for a budget of up to $50,000. The risk he took from the tools to hiring the team, not enough money to complete the game with the quality expected, the solution offered is to maintain community connection and develop resources, find sponsor.", "q0r": 3, "q1": "The project has a detailed but unclear roadmap, implemented from November 20xx to the winter of 20xx. Thus, I think the proposed team needs to be more specific about the roadmap in this project. The funding part is relatively detailed, however, the total project is up to $489,984 but asking for a fund of $50,000 is not reasonable.\nThe team has only 1 person, he said he has experience in production, design and programming, has knowledge of games but does not have a link to check. The proponent identifies the type and number of members needed, has a plan, and works to be done on a monthly basis.\n", "q1r": 2, "q2": "The project has a monthly plan with tasks to be achieved, but the figures to determine the KPI are vague and not specific: To honor the ADA and game community in general quantitative indicators will be created and encouraging to be created and reputable by the community. The framework would be based off the roadmap.\nThe proponent did not say whether the project was new or continued in another project. The project that gives success is a blockchain game that is addicting to play. This criterion for the success of the project is not appropriate.\n", "q2r": 2, "assessor": "z_assessor_395", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8803, "q0": "Suggest setting up a challenge to get new members with a fun game to attract players as new members. This proposal will be more appropriate if the topic clarifies more clearly how gamers can participate in Project catalys with positions such as CAs, vCAs, proposers, voters.\nThe proposal is clearly written, the goal of the project is very ambitious with a class A game on cardano on par with a major game development company including monetization for the players. The proposal also outlines possible risks. unfortunately the Proposer has not mentioned the expected impact of the project on catalyst members. I think it would be more reasonable to put it in the Gamers on-chained challenge. From the above issues I neither agree nor disagree.", "q0r": 3, "q1": "The proposer is the sole person of this project, he provides the information that he is a cardano enthusiast and a gamer and has experience in design and programming. however I don't see any links or documentation to substantiate these experiences. So it has a bit of a feasibility risk. My advice is that the proposer  add this information so people can confirm it's true.\nThe proposal provides a specific plan with timelines to complete the works, but it is not clear yet. The proposer has identified the positions and number of members required to implement the proposal.\nThe budget items needed to execute the project clearly. However the cost as per the proposer explained is huge $489 984. equivalent to 46 400 dollars for a month. The proposer budget request from catalyst is $50 000 and has not yet provided a verifiable plan of missing funding information to execute the project feasibly. If this problem is improved then this proposal is more feasible. Based on the above information I rate the feasibility with a score of 2.", "q1r": 2, "q2": "As mentioned in feasibility The Proposal provided milestones to complete the work. But without KPIs, the KPI items in the proposal are milestones that you can hardly measure. It is suggested that the proposer provide more of this information and steps to get it working and assess the risks, for example \"analyzing the graphics board using cardano evaluation\" is a immeasurable. maybe \"create 2 reports on graphics boards using evaluation on cardano to apply to games\",... so I rate the auditability of the proposal with a score of 2", "q2r": 2, "assessor": "z_assessor_706", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "The plan is to build a fun high quality game with the perks of gamefi on the blockchain to onboard gamer audiences", "experience": "An avid Cardano enthusiast and old school gamer. With experience in production, design, and programming. I have the understanding of games and practicality of utility to fulfill this mission. Securing funding would allow me to work on this full time."}