{"id": 397962, "author": "headelf", "title": "CATS Community Advisor Triage Sys.", "url": "https://cardano.ideascale.com/a/dtd/397962-48088", "category": 26450, "amount": 6300, "description": "The current system is difficult to navigate & onboard for newbs and the system is not designed to quickly scale for an increase in proposals", "f6_no_assessments": 10, "f6_rating": 3.1, "videos": [], "media": [], "f6_assessments": [{"id": 443, "q0": "The proposal addresses the challenge well, as it seeks to make it easier for new people to enter the ecosystem meaningfully as part of the proposal-assessing process. It particularly addresses the suggested guiding question of \"What additional roles are needed?\", which not many proposals in this challenge are looking at; and it addresses the issue identified in the challenge-setting of ensuring that people are capaple to fulfil their roles, and filtering out bad actors and building reputation for CAs and the proposed new COs. It also indirectly addresses improvements to onboarding people as proposers, since it aims to look at the idea of making the CA role function more like a supportive mentor for proposers. I recognise that the proposal addresses all these things *indirectly* - this proposal is about doing research and community consultation into the feasibility of all these things - but I support this approach, and feel that the proposer has justified the idea that approaching things in this way would have the best impact.", "q0r": 5, "q1": "The project looks feasible in terms of budget; and I like the fact that although the ideas behind it are quite far-reaching, this actual proposal is simply a feasibility study to research it further and produce a whitepaper, and then survey the community on the results. This seems like a good approach to maximising the feasibility of big changes in Catalyst - research it first and secure community involvement. I also like that the first of the 3 surveys will be done before any research is begun, in order to establish a baseline. All this gives me confidence that the proposer knows how to do valid research. But one key thing missing is that no information is given about the proposer's background and skills. I would particularly want to see some evidence of skill and knowledge in survey design: we see a lot of surveys in Catalyst, and not all of them are well-designed (sometimes to the point that it would be problematic to draw any conclusions from them at all) - so given that this research is about the possibility of quite a major change to the Catalyst process, I would want to see some definite evidence that the proposer knows what they are doing, can write a survey without loaded or leading questions, etc. If the proposer doesn't have a relevant academic or research background, then writing a more detailed explanation of how they will approach both the research and the surveying of the community would have served the purpose. I also feel that given the research is going to cover quite a number of elements and will propose several changes to the current CA system )from the introduction of COs, to time limits and changes to pay), there would need to be some community outreach other than the surveys, to make sure people fully understand the contents of the white paper before responding to the survey. Maybe a couple of After Town Hall and/or Swarm sessions to explain? Also, I feel that allowing only 2 hours per survey to draft, issue, compile and report is too little for a survey on quite complex issues. Another more minor issue I see is, although the proposer has identified a couple of risks, they are not well elucidated, and there is no mitigation suggested. Taking all this into account, I can't fully agree or disagree that the project is feasible.", "q1r": 3, "q2": "The suggested audit metrics boil down to \"has the whitepaper been produced, and has a proposal been submitted in fund 9?\" which is certainly auditable as far as it goes, but is not really enough. I think a metric about the quality of the whitepaper should be included, even if it is only the number and range of the sources consulted; and, if the Fund 9 proposal to be worked on is going to be a \"community\" proposal, I'd like to see some additional metrics to measure who gets involved - how many people, geographical spread, from what sections of the Catalyst community, and particularly whether the CA community and CA subcircle have engaged with the process, as it is most relevant to them. Additionally, the Audit section mentions \"**Successfully** drafting a community Proposal\" - I would like to see the proposer define what \"successfully\" would mean here. Is it still successful if only a small amount of community engagement with the proposal-drafting is achieved? Or if the community rejects the proposer's ideas, and wants to draft a proposal with an entirely different approach? There is also an issue in that the \"What would success look like\" section does not relate to this proposal itself (i.e. the drafting of a whitepaper) but to the end result of a future proposal, and the adoption of the ideas that that the whitepaper will discuss. Measuring succcess for this project should not pre-suppose that the community, or in fact the proposer's research, will actually confirm/support the proposer's idea of how to modify the CA process; the measures of success for *this* proposal shouldn't be about the success of a putative *future* proposal. Overall there are some auditable elements, but I can't fully agree or disagree that the proposal is sufficiently auditable.", "q2r": 3, "assessor": "z_assessor_1157", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1273, "q0": "The proposal identified the problems that the current Project Catalyst system is “difficult to navigate”, “difficult to onboard” and “cannot scale for an increase in proposals”. These problems align with the challenge. \n\nThe solution proposed was to introduce a new role in Project Catalyst, a Catalyst Observer (CO). Where COs will do a first round filter of proposals based on a triage system and find Ready to Prime Time (RPT) proposals which will be assessed by the CAs. Moreover, there is a time frame of three cycles with increasing compensation. There is an attachment with details of how compensations can be calculated, which show the work and careful thoughts behind designing this solution. \n\nI am afraid the proposal did not manage to convince me that the proposed idea will solve the problem stated. Simply introducing a new role will not make onboarding easier. First of all, there need to be channels for new users to discover there is a CO role. I think having CO filtering out proposals can make the project catalyst platform more efficient, but I am doubtful as to how much CO can learn and develop from this process. The proposer have not identified the root cause of not having a clear path for onboarding. \n\nI want to also see justification of the design of the three cycle time frame. Three cycles might be too long a growth time. With an increasing number of proposals, Project Catalyst urgently needs new Catalyst members to take on suitable roles and responsibilities of CA and VCA. Having three cycle growth time might be too long and they cannot keep up with the fast evolving ecosystem. ", "q0r": 3, "q1": "There are some identification of challenges and risks. Indeed, the identified risks are really challenging and will cause huge issues if not carefully dealt with. For example, the acceptance by the community. The proposal did not mention how it wanted to overcome the challenges and risks. \n\nBrief mention of entrepreneur, risk management experience. Lack supporting evidence, for example LinkedIn profile. I am not sure if the team has the relevant skill and experience to put forward the proposed idea.\n\nThe budget is outlined clearly and broken down into different components that are closely related to the proposed idea. There is a realistic timetable to complete the research, drafting and re-editing of the white paper. The proposal mentions “how things will be done” including what the research will cover.", "q1r": 3, "q2": "The timeline was for future funds. It is nice that the proposer has a bigger picture in mind and has split the task into different stages. There is a lack of metrics to measure the progress of the action proposed in this round of the fund. \n\nThe Metrics/KPIs are rather qualitative and not quantitative. It is better to include some metrics that can in some sense measure the qualitative description of what success looks like. For example, easy onboarding could be measured by the number of newly registered Catalyst accounts. Although there might not be a direct causation, the number should say something. \n\nFinally, one of the goals of CA for unsuccessful proposals is to give advice on how the proposal can be successful in future Funds. Will CO be able to do the same. According to my understanding, there is a current system for filtering out incomplete proposals. How much more will CO do in addition to the existing filter? And most importantly: Does CO have enough knowledge to judge a proposal? Will the introduction of CO disincentive CAs and VCAs as they will inevitably receive less reward as a portion is given to the CO.  ", "q2r": 4, "assessor": "z_assessor_1334", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3514, "q0": "It s definitely an interesting idea and fits the campaign objective of engaging the existing members and it could potentially increase the quality of the proposals and decrease the number of unready proposals. It does worry me if this new filter could eliminate proposals that are not ready, but with the assessments could evolve to a more substantial proposal in subsequent funding. I have seen many excellent proposals that haven't obtained funding but have matured since then. An alternative for that is maybe expanding the CO role to some sort of consultancy to those proposals that are filtered out.\nWhile the risk is relevant, I would have liked to understand how they would mitigate it. Maybe there could be some sessions to explain the new role to the community and clarify any concerns.", "q0r": 3, "q1": "The timeline seems to be a plan to submit a proposal, rather than a timeline for the creation of the proposed role.\nI think it would be interesting to understand more of the feasibility of the implementation of the CO role, so I could see if the final product is actually feasible, and not just the preliminary research.\nThere isn't much information on the team, it could benefit from more details on their background and links to verify their credentials. From the information presented, it is hard to judge if the team member has the ability to conduct the project.\nI like the compensation method and I think it is well-thought.", "q1r": 2, "q2": "I understand the Whitepaper would be the main deliverable, but there could be more KPIs , for example, to measure the quality of the document, and to measure the process rather than just the final result. There could be some milestones. This would allow the proposer to assess the project during its execution to understand if it makes sense and if it on the right track.", "q2r": 2, "assessor": "z_assessor_1659", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5492, "q0": "This proposal would be a much better fit in the “Community Advisor Improvements” challenge, as the main purpose of this proposal is to change the current CA/vCA reviewing and integration process and apply new rules to “weed out any potentially nefarious players” and include new roles of “Catalyst Observer” in the community of CAs. At the same time, these rigid rules might create a restraint from potential Catalyst members who might wish to join the reviewing process, as such going against the criteria of the “New Member Onboarding” challenge, that has as a main purpose the attraction and conversion of passive Cardano community members to a more active role.", "q0r": 2, "q1": "For the detailed timeline the proposer states “The plan is to have this proposal accepted in F9/10”, then there are different steps described : research, survey and then proposal writing as the final one. In short, based on timeline and budget, this proposal is asking for money to be able to write another proposal for Fund9.\nThe budget is detailed, the proposer is asking for several amounts for the different tasks he sets out to do, in order to finalise the proposal for the future fund.\nAs for the team members, the proposer mentions himself as the main researcher and proposal writer and adds to that the multitude of circles formed around Catalyst: The Catalyst Swarm and Inner Circle as the ones to be surveyed. However, the community of CAs is much bigger than that, and basing the results of his surveys only on those two small groups will not reflect an accurate response.", "q1r": 3, "q2": "Some of the progress measurement for this project are very much dependent on having his proposals voted in by the Cardano community, as such these steps cannot accurately reflect the progress of the entire endeavour. \nAs for the success description, the descriptions are very utopian and have no clear milestones attached to them “Success will be the achievement of balance throughout the entire Catalyst Community” - that could be rewritten in such a way that would objectively describe a number of new CAs applying for the new role and a percentage of them becoming later CAs etc.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5630, "q0": "The problem statement does not directly address how to bring new members into catalyst, although the proposal suggest creating another entry level role below the CA position. It's not clear how this would incentivize new members to join, as most new participants would likely prefer to be compensated, and participate as a CA, not just as a lower level observer. However it does create a new role within catalyst, I believe this would add more confusion than clarity to the entire catalyst process. As the proposer seems to acknowledge in the risk section, this proposal is an experiment that may or may not add value to the catalyst process. ", "q0r": 3, "q1": "The proposer is an experienced entrepreneur, but it is not clear in the proposal how their experience is related to this proposal or their ability to implement it if funded. This proposals end goals would require broad support from the entire cardano community to implement successfully, and it is not clear how the proposer would reach a significant number of voters with this proposal. The funding of the proposal will enable the proposer to do the research, create surveys, and a white paper with the final deliverable being a proposal for the next fund. It is likely that the proposer can achieve these milestones with the detailed budget requested. The tasks required have been listed and detailed with timelines. The tasks are feasible, however the overall goal of creating a new Catalyst role, and changing all of the existing CA and VCA roles, is a large undertaking for a one man team. It is not clear how or if this transformation will be supported by the community, but it is an idea worth considering, and I believe with more community involvement this proposal could evolve. ", "q1r": 4, "q2": "The proposal does include some objective goals such as creating a proposal for next fund. However, it does not include specific guidelines for the community to decide if the proposal is successful or not. For example, if this proposal is funded, and the next proposal is funded for fund 9 or 10, but the community does not vote to implement that final fund 10 proposal, will this fund 8 proposal be considered a failure that should not have been funded, or should it be considered a successful experiment that was a valuable use of treasury funds? The proposer seems well aware of this and outlines the following risks: \"Acceptance by the community. Failure in the experiment to continue experimenting.\" However, there is no discussion on how to address these risks. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6279, "q0": "The proposal addresses the challenge by tackling the issue of onboarding new members that get lost often. It goes beyond that, by looking at the roles of vCAs. For this same reason, it's arguable if it's concentrating only in the new proposed role (Community Observer) with a triage system, or if it is going beyond its own scope. ", "q0r": 4, "q1": "There are other risks to be observed, such as (and not limited to this list) the connections with guidelines, current confusing documentation, and communication platforms, or the risk of not getting funded in F9 and F10 as it as stated.\nThe proposal could/should improve the articulation between the whitepaper, the new proposal in the next funds, and the uncertain acceptance of the CO.\nThe proposer's experience to help solve this issue is not clearly presented or not  evident enough.", "q1r": 3, "q2": "Deliverables are clear and the proposal is easy to audit in its short timeframe. However, apparently the proposal could only be considered successful after its approval in F9 and 10. In this case, it would be relevant if proposers could tell with strong rationale why it is being split into 3. And bring more details in the upcoming proposals.", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6306, "q0": "Proposal raises the problem that the current system is difficult to navigate & integrate for newbies. The system is not designed to scale rapidly to increase new proposals. They offer a solution to create a new community observer (Community Observer CO). Community Observe's mission is to categorize, sort, and remove incomplete and shoddy projects according to three criteria. With these criteria in mind, the CO will reject and categorize placeholder, incomplete, and poor-quality proposals. The proposal also provides a way to calculate the bonus for CO and has a bonus calculation formula according to the attached file. This method can be extended if the number of proposals becomes too much. CAs only focus on good proposals for evaluation. At the same time, the proposal also introduces some risks, but there is no solution for these risks. Therefore, I give good rating for this suggestion.", "q0r": 4, "q1": "The proposal has a clear roadmap. Step 1 is a survey process consisting of 3 surveys. Step 2 is to write a Whitepaper consisting of 3 clearly presented stages.\nThe proposed budget request is 6,300 USD. They have a detailed budget sheet. They divide the budget into clear sections and work out the amount by the hour. However, there is a slight deviation in the calculation: according to the cost calculation for each job, 118 hours for tasks such as initial survey, research, document translation, drafting... with unit price 50 USD/hour, the amount is 5,900 USD, plus 300 USD for 3 community surveys, the total budget will be 6,200 USD, but the project requires 6,300 USD.\nMembership of the proposal is 1 person. He is a businessman with many years of experience, a practice expert in the fields of risk management and farming. But there is no link to check.\n", "q1r": 3, "q2": "The proponent plans to release the Whitepaper in the 4th week after approval. However, KPI figures are not really specific, so it is difficult to verify. The proposed goals are easy to understand, specific and clear, but not in line with the implementation roadmap.", "q2r": 2, "assessor": "z_assessor_395", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7264, "q0": "This proposal aligns with the challenge very well and offers a unique and intriguing solution that has three main facets: create a new entry-level, catalyst community role called CO, Community Observer; train this role in the 'triage method', a business process for evaluating proposals; and develop a clear onboarding 'career path'.  \n\nThis proposal requests funds to research (conduct surveys and focus group discussions) and produces a whitepaper to describe the CATS role and catalyst system changes.\n\nI'm intrigued by this because the challenge brief mentions the creation of new roles and this is the first proposal I've seen to suggest it.  Also, I know the proposer and value his perspective and experience, which relates to risk management and the idea of triage.  And finally, the 'career path' or a clear process for interacting with the Catalyst ecosystem makes sense to me as a way to encourage new members to participate in Catalyst.\n\n\n", "q0r": 4, "q1": "This is a solo proposer, Tom Frey. He is a relatively new Catalyst community member and very active in the community.  Unfortunately, there is no link to a profile or portfolio of past work of this type.  The plan and budget seem reasonable but could be more detailed.   \n\nIf this proposal is not funded I would suggest finding partnerships.  A co-proposer with a research or facilitation background would be helpful.  ", "q1r": 4, "q2": "There is a roadmap, but there is no mention KPIs, of the challenge or specific to the proposal.  The guiding question this proposal relates to is: \"How might we increase more meaningful participation from challenge teams, proposers, advisors, mentors, and voters? What kind of additional roles are needed?\" \n\nI think the proposal does make an interesting case for restructuring the 'career path' of participation in the Catalyst ecosystem.  The research and analysis produced by this proposal could be very helpful to gather insights and analysis.\n  ", "q2r": 4, "assessor": "z_assessor_56", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7658, "q0": "Although I understand that this proposal is trying to tie into this Challenge by utilizing an onboarding method that eventually leads to a more clear and precise understanding the functions of a CA, with the hopes this will lead to an increase of CA's onboarding. This proposal is better suited for the \"Community Advisor Improvement\", for although this proposal seeks to onboard, it seeks to onboard a new position called the CO which acts as a pre-CA assessor. By having a CO, this proposers hopes the CA can now only focus on proposals that are more mature for the ill-willed or not ready proposal would have been rooted out. This then ties into a series of improvement to the existing process, from CA to vCA and additional positions.\n\nHaving a CO would be helpful, but there are too many roles at this current moment. The function of Catalyst Circle at this moment is being scrutinized and highly likely will go through a huge overhaul on how someone becomes a Catalyst Circle member. Rather than creating a new position, I would rather focus on the improvement ideas this proposer has brought up in regards towards the CA and vCA position.\n\nWhat would be more challenging to setup is the budget/compensation system this proposer has offered. For it will involve the creation of a reputation system which to my understanding is on the works. There is a danger that this proposal is taking on too much. There's this new position called CO, the retooling of the CA and vCA function, the addition of new roles and then there's the introduction of the new compensation system. Each role/topic this proposer will try to improve most likely will have a lot of pushback from the community. Hence an advisory word, would recommend to approach their solutions in phases, the increase the probability of this proposal achieving it's KPI.", "q0r": 2, "q1": "I am confused regarding the team in this proposal. There is only a mentioning of Tom Frey, who unfortunately I am not familiar with. Although I am involved in various Cardano communities also, I do not assume everyone would know me. I would advise the proposer in future efforts to provide more details about their background. Especially since they are trying to refine/retool the whole process of assessing a proposal. The proposal somehow incurs an assumption that the proposer is someone who is deeply engage in all the process. If that is the case, it would only prove helpful and add validity if the proposers background were available, when gauging the proposers capability to deliver on their solutions.\n\nIn regards towards the action plan, since it involves a lot of refining of the current assessment structure, this would mean the proposer would need to engage with a lot of people. Project Catalyst, Catalyst School, Community Advisors Group. Those are the three groups that pop into mind. This would mean their proposed timeline is highly unlikely. The budget though correlates well for coming up with an improvement in the assessing process, the whole effort would most likely need a lot of consideration, discussion, further consideration, further discussion, proposing, further discussions and so forth. The curse and beauty of decentralization.", "q1r": 3, "q2": "Seeing what the proposer seeks to build data through a series of interviews, that either source from their own personal view or surveys, with the final output being a Whitepaper is fitting and should be more than enough. It only depends on the quality of the Whitepaper itself, does it list all the surveys and sources the proposer uses to reach their conclusions.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8804, "q0": "The proposed subject matter is that the current System are difficult to navigate & integrate with newbies and the system is not designed to scale rapidly to increase the proposal. The solution is to create a new community observer (CO).\nthe work of the CO to sort, sort, and discard incomplete and poor-quality projects. The CO will have 3 levels.\nCA's role is also divided into 3 different levels to create a place for members to continue to stick together and train for a higher level.\nvCA's position is divided into 3 levels with mandatory deadlines to avoid potential complacency and collusion, in order to build trust and capacity to enhance the role in the Cardano ecosystem in the future. The topic suggested that\nwith the addition of the CO, role eases the referral processes by spreading the training over three cycles.\nThe CA role will now be able to focus on RFP proposals. The VCA position will become one with a higher purpose of advising and assisting CAs in the Advisory role as stronger RFP proposals. The whole system are scalable when there is a large number of proposals. I think this proposal will reduce the number of incomplete proposals; increasing the role of CA, vCA will have more members applying for leadership positions. I, therefore, agree that this proposal is suitable for the challenge.", "q0r": 4, "q1": "The $6,300 budget proposal is broken down into two main sections: the survey, the research, and the $6,000 white papers. This cost justification is unreasonable from the explanation of the proposer and at $50 per hour for 118 hours of work for 3 weeks would be $5900. 3 community surveys $300. So, I disagree with the feasibility of this proposal.", "q1r": 2, "q2": "The proposer has a 4-week roadmap to release the white papers to the public from the time the proposal is funded. Objectives of the project are stated in a specific, clear and easy to understand manner but as stated in terms of feasibility I do not see a direct impact of the roadmap on the problem and solution presented.", "q2r": 2, "assessor": "z_assessor_706", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Introduce an entry level Catalyst Observer role that onboards over three rounds, yet can be used to scale as needed. Use Business Processes.", "experience": "Entrepreneur of many years.  Best practice specialist in the Risk Management field. Farming."}