{"id": 398219, "author": "defidiscussions", "title": "Cardano Network Expansion in Brazil", "url": "https://cardano.ideascale.com/a/dtd/398219-48088", "category": 26450, "amount": 28800, "description": "Awareness of Cardano's projects and vision could stand to be improved among investors, young people, and community leaders in Brazil.", "f6_no_assessments": 10, "f6_rating": 3.7666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Despite being simple, this proposal serves well what the challenge seeks. Our objective here is to fund innovative proposals that would attract new members to the Cardano community, be they future proponents, CAs, community mentors, etc.; and also encourage passive Ada holders to be more active in the community. These indicators can be measured in several ways, such as the number of digital wallets created, votes in the governance phase, etc. The idea here is to promote some face-to-face events, which would be held in places such as hotel auditoriums and convention centers, from what I understand, that have as content subjects that address the Cardano ecosystem, the differential and advantages of our blockchain. These meetings would take place in Brazil, in the cities of Brasília, São Paulo and Rio de Janeiro. They are targeted because they are some of the largest cities in the country, with a high number of entrepreneurs, potential investors and Catalyst proponents. The problems I identified here were about the detail of the idea. It is not clear how many events would be held in all, how the organizers would be able to captivate the target audience to go to the face-to-face meetings, without necessarily knowing anything about Cardano; how many people are expected per event; where these events would be in each city (the bidder cites Rotary Club and Mason Lodge, but I searched and didn't find exact locations for this, Rotary Club seems to be an association and Mason Lodge I really couldn't figure out what it is); and, mainly, which themes within Cardano's universe would be addressed, in which order and by whom. Knowing who the speakers would be would be essential to guarantee the success of the proposal, because I believe that in order to captivate a lay audience on the subject, we need people who are both experts in Cardano and charismatic enough to hold the public's attention, in addition to having a good didactic to teach in an accessible way from a young computer engineer to an older investor. Therefore, the idea is good and aligns with the objectives of the challenge, but to receive a maximum grade it would need to be explained in more detail. \n", "q0r": 5, "q1": "I don't think that part is explained satisfactorily. Starting with the script, we are told that there would be 12 events (1 per month, then). But it is not said in which cities they would be in which months, for example, month 1 in Rio de Janeiro, month 2 in Brasília and so on. Nothing is said about the pre-production process of the events, and no type of script is established for each event, if it would only consist of the lecture followed by a networking session with drinks, from what is understood. We don't know the average duration of these events, if it would last an entire afternoon/night, how many hours, etc. And in terms of expenses, some things I found a little disproportionate, 1400 USD is requested just for the rent of spaces, and since one dollar is approximately 5 reais, that would be 7000 reais for just one shift of space use, I think which is a very high value and does not correspond to what is charged in practice (I say this because I am Brazilian so I know the average rental price). The price of 500 USD for the lecture is also high, but then I don't know whether or not it would be disproportionate. Regarding the rest of the expenses, I believe everything is ok, it is possible to understand clearly what the requested money would be used for. And finally, with regard to the team, we are shown who each team member is and their main professional attributions, but it is not specified what exactly they would do in the project. The description of each is, in my opinion, very short, they could have detailed more about their resumes, even if they have attached their linkedin profiles, the information about each involved is still very superficial in the proposal itself. In other words, in general, I think that the absence of a script itself, a very brief description of those involved and some doubts about the need for the budget (for example in the price of rents) make me think that the feasibility is ok, but There's a lot to improve too. \n", "q1r": 3, "q2": "I think measuring whether this project is being successful is even simple, as the proponent suggests, most of these results could be understood based on the number of event participants and creation of digital wallets. This is enough for us to understand if the event itself was a success, but it would be possible to go further in monitoring the proposal. Basic data from the participants could be collected, such as their email or telephone number, and the proponent could carry out a survey after the events, in order to find out how these people are in relation to Cardano. Have they become active participants in our community? Are you participating in Catalyst, whether as proponents, CAs, voters? Bought and delegated Adas? Did they somehow spread the knowledge obtained on the day of the event to third parties? I think that with a small questionnaire with those who participated, the impact of these events on our blockchain could be measured more deeply, we could understand if the impact had the desired depth. Other than that, I think that any member of the community, who lived in the cities that would host the events, should participate and provide feedback to the rest of us on how the day of the event itself went, if everything went as planned, if the people interacted well and made contacts, exchanging experiences and so on. In other words, according to the proponent, it is possible to audit the proposal, but this could be done with even more quality through other initiatives. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "1-looking into brazil population 214 million i can confirm that this proposal address the challenge\n\n\n\nhttps://worldpopulationreview.com/countries/brazil-population\n\n\n\n2- and looking in the news about Brazil i can see that authorities working on  regulating crypto and people have much interest in crypto is very positive for the success of this proposal .\n\nhttps://www.investopedia.com/brazil-moves-to-regulate-cryptocurrency-5219982\n\n\nhttps://www.coindesk.com/business/2022/01/12/why-brazilians-are-turning-to-stablecoins-like-tether/\n\n", "q0r": 5, "q1": "Looking on the team experience in crypto and economic and one of them being old winner of a proposal in fund 7 made me choose 5 stars , but i changed to 3 stars only after looking into Linkedin profiles and see that the whole team lives in USA and none lives in brazil which open an important inquiry not addressed in the budget of the feasibility study :\nhow would they connect with Brazilian coworker that will organize the event locally  especially that there is no mention in the budget for this part ", "q1r": 3, "q2": "i agree with auditability plan cause logically all events would be recorded and broadcast on social media ,,,   so views and comments and likes would be a clear auditable thing on the success on the proposal . ", "q2r": 4, "assessor": "z_assessor_1054", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "One issue with this challenge setting is that it must be read closely to understand that it is about onboarding and engaging community members to Project Catalyst, not Cardano.  Events like the one suggested in this proposal, while beautiful to behold, must make particular claims to align appropriately with the challenge setting.  It is not enough to say that the intention is to create a lot of new Catalyst members, the team must provide concrete ways that will happen, and by which that impact will be measured.  This Cardano event in Brazil makes the claim to onboarding Catalyst members, but unfortunately only provides a single metric (Project Catalyst accounts created...Do they mean Ideascale accts? Catalyst app installs?).  And while they indicate that hopefully it could lead to more proposals being submitted from Brazil, they lose sight of the fact that this challenge requires them to provision that hope!  If the proposal team were to include the details for dedicating a section of their proposed events to onboarding to Catalyst and how to make a proposal and how the funding mechanism works, it would immeasurably strengthen the alignment of this proposal to the challenge setting.", "q0r": 3, "q1": "If one only considers this proposal as an events proposal, rather than an onboarding one, it starts looking better.  The budget may seem large for an event budget, but it covers 12 events over 12 months, across 3 cities, which makes it exceptionally attractive.  The previously funded team are building identity around event management for Cardano and the team members indicate good experience for taking on these roles (need to update their website, tho...).  The budget breakdown is the strength of the proposal, with everything you could imagine for an event budget covered.  However the timeline just broadly says 12 events in 12 mos, without really breaking down how even a single month might be carried out.  Events can be tricky to logistically follow through on, and it would be nice to see a plan, even though event plans tend to do their own thing in the end.  Additionally there isn't a clear connect between the roles of the team and what they bring to the execution of the events.  They refer to their connections for venues and keynote speakers, and while the venues make sense, there is really no indication of what kind of keynotes they will be able to secure.  It would be useful to have more in depth information on the team, as that would settle many of the concerns here.", "q1r": 3, "q2": "Presumably every month is a deliverable, with a networking session being deliverd and reported on for auditing purposes.  From those events they intend to track wallets created and number of attendees, YTD, as well as tracking social media hits and engagements.  I'm firmly agnostic about that last metric there, but I get it.  What is disappointing is only learning about the number of Ideascale accounts created from these events.  Over 12 months you would hope the impact woud be there to be onboarding proposers and referrers, maybe CAs.  Distributing Catalyst material at these events and tracking that could be a useful metric. How about participants who successfully vote using the Catalyst app?  As far as the community keeping track, outside of social media, the main way to keep the project transparent will be staying up to date with the monthly reports to IOG.  Outside of wishing there more concrete examples of measuring up to the challenge setting, this proposal should be able to be tracked and stay on track.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Impact/ Alignment:\nWe understand your concern in this segment and are happy to provide ways to add clarification. You mentioned that this mainly focuses on the Project Catalyst aspect of the project, not Cardano. However, these two work in tandem because allowing Brazilians individual to enter Project Catalyst would diversify the pool of thinkers that further contribute to the Cardano ecosystem. Furthermore, it would be necessary for individuals to obtain Cardano wallet addresses, in order to interact with ideascale and project catalyst voting app. This would ultimately lead Brazilians to begin to create and submit catalyst proposals. Individuals will only be able to contribute to project Catalyst by having a deep and thorough understanding of the Cardano ecosystem which we will provide at these events.\nFeasibility:\nThe budget we have selected in not large when you take all the factors of having these events into consideration. Hosting one event per month in one of our cities has taken already immense planning and execution to fit the budget we have set. Things that need to be considered are venue rental, cost of speaker, security, media connection, NFC’s for direct wallet creation, catering, raffles, and marketing for our events. We also need to provide lodging and transportation for our guest speakers. As soon as we get funded, we will be posting our schedule for the next year in many different social medias including LATAM Townhouse, Discord and Telegram. We will do this in hope of having members globally join us for our events. However, I would be happy to share that our first event will be hosted in Sao Paulo, followed by Rio, and lastly Brasilia. This will be a quarterly cycle. As for our guest speaker, we have already secured Professora Gilvania da Silva Vilela who is Computer Science Professor who has focused on blockchain technology. Overall, it would also be premature to secure venues and more speakers without first receiving funding. We have allocated one month from our first event to finalize our venues and speakers. Please take a look at our updated website to see our first event that was held in Ecuador.\nhttps://defidiscussions.com\nAuditability:\nWe’re grateful for the feedback that you have given us, it allows us to improve. We think adding distribution of Catalyst material and tracking would actually be a great metric, we will implement this. By onboarding them to Project Catalyst, we intend on them having full access to proposals, voting and potentially becoming CA’s. Furthermore, we will be partnering with Merchify to closely track KPIs by using NFC to directly manage the flow of data. We will upload our data to LATAM TownHall Discord and Telegram so that we can have the community participate and verify our work. Additionally, you’ll also be able to track us through Facebook Live, Instagram live and photos on our website from our events. Please take a look at our first event at our website and the connections we made during our stay.\nhttps://defidiscussions.com\n"}, {"q0": "I like the idea of the proposal, which aims to bring knowledge to Brazilian community and strengthen the connection between Cardano community and newcomers. These meetups organized by Cardano members play an essential role in increasing awareness of Cardano in particular and blockchain in general to Brazilian community. As the host has strong relations with other Cardano industry professionals, I believe the event will conduct a good network and attract more people to attend their existing networking events", "q0r": 5, "q1": "Proposer provides a detailed plan with a specific timeline for each step. Money usage for each task is also listed clearly. The proposal also presents information, the personal background of each core team member as well as their LinkedIn profiles.\n\nHowever, I think more information about marketing strategy should be also delivered to better assessing with the proposed marketing budget. Also, I would love to know more about main topic of each event will be delivered to see whether the educational segment is adequate for attendees to grasp fundamental knowledge or not.", "q1r": 4, "q2": "The proposal outlines a clear method for measuring progress (through the Revelar dedicated domain) and defines a clear means of success (with specific metrics in the next 12 months). \n\nI would add one more metric to keep track, which is the rate between positive and negative comments from audience.", "q2r": 5, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The idea is strongly related to the problem statement. Hosting network events to garner interest in Cardano could create an extraordinary impact in many parties and is a project easily scalable.\nThe choice of the cities to host the events seems to be well planned but should be more explained to the public that has no awareness of the potential of each one.\nI agree that giving incentives to grow the attendance and also creating an ADA wallet was a smart idea and will increase the potential of the project impact.\nThe possible issues were listed and well addressed once the proposer thought about possibilities. Despite that, I recommend outlining backup options.", "q0r": 5, "q1": "The plan for project implementation seems to be very solid, but I recommend building a timeline for simply guiding and visualization. Besides that, this kind of organization gives credibility to investors.\nA notorious point of the proposal feasibility is that some KPIs were defined as part of the implementation plan showing clarity of the path that will be outlined.\nThe budget was well addressed and clearly explained.\nAlso, the team was presented properly with details and appeared to have the experience and potential to execute the project.", "q1r": 4, "q2": "The auditability part was well-considered but also needs little calibration to be sufficient.\nThe KPIs have already appeared on the feasibility part and seem to be appropriate to the context of the project.\nAs an important improvement, it should be accomplished by goals so the team and investors could evaluate the project progression.\nAs the last recommendation, the proposers must better support the goal of 50 guests per event and also plot the number of events to show the final number. Would be more legitimate.", "q2r": 4, "assessor": "z_assessor_1893", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "Hosting an in-person event doesn’t necessarily mean people will be attending it, especially with the current global situation. People’s time is valuable, and they need a lot of incentive to be compelled to change their plans and attend an event on a topic they know nothing or very little about. Unfortunately, the proposal does not address this problem, it only states that having these events in different cities in Brasil will contribute to a large number of attendees to create ADA wallets, become active Catalyst proposers and start participating in the eco-system, sometimes incentivised by a raffle with prizes in ADA, that are not counted in the budget.\nHowever, for being able to motivate people to join these events, the subject has to be compelling enough, the speakers need to be able to draw people to the events and for now, the proposal doesn’t offer any kind of details on these subjects, just a mention that “due to having an expansive networking connection, we would be able to get around these issues with ease”, but there are no further details that would enable the community to verify these claims.", "q0r": 1, "q1": "The plan is lacking many details: the theme of the events is not described, the names of any of the speakers is not known, the marketing of the event is not described, the sites where they would take place are not named. \nThe budget is broken down per event, each section having the same budget, no matter the location and speaker involved. Without having any of these details in a concrete form, how can the community trust its accuracy and practicality?\nThe team offers a short description for each involved member and an associated LinkedIn profile link for most of them for verification.\nHowever, because there are too many unknowns throughout the plan and budget, I find it hard to properly assess the viability of the proposal.", "q1r": 2, "q2": "The metrics of progress are not verifiable by the community. The number of attendees to the events, the number of wallets created, number of people onboarded to Project Catalyst. How can the community fact-check these numbers?\nThe success described is somewhat unrealistic, based on the information presented: having 50 attendees create Catalyst accounts is a big number and one that doesn’t offer a lot of value, as creating a Catalyst account necessitates only an email account. Having other success milestones offered would have been helpful and important, considering the team envision have a large group of people becoming interested in the Cardano/Catalyst community.\nThe proposal is a good starting point and could be resubmitted in a future fund with the missing details added.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Impact/ Alignment:\nWe understand your concern for our ability to host events and have the locals take time out of their busy schedules to attend and participate. However, to facilitate this part of our journey we have connected with local schools and businesses to integrate our plans with ease. In São Paulo, we have partnered with Faculdade de Tech São Paulo, Colegio America, UNINOVE, and with EAESP Business School. In Brasilia, we will partner with the Venancio Joias to use their clientele base to host our network events in tandem with their client events. In Rio, we will have a heavy presence due to our connection with the Rotary Club and Mason Lodge. Due to Richard’s close ties with these two groups, events will be easily conducted with members and their guests. As for your concern with the raffle of ADA and merchandise, that is something we are putting our own money into upfront in order to not pull more money from the budget. We have secured our main speaker; Professora Gilvania da Silva Vilela to assist us during our events. To expand on the incentives to attend our events, attendees will receive free internet at our venues to register for our wallets and gain full access to our schedule to attend future events and to the Cardano ecosystem. Secondly, attendees will be able to have dinner and refreshments while having the ability to network with local Cardano individuals in their community. Lastly, attendees will win prizes from Defi Discussions which include, apparel, prizes in ADA and other cryptos, and a free course in development by our partner Ayllu.\nFeasibility:\nThank you for sharing your concern with us, the feedback allows us to further improve and take more factors into consideration. We would be happy to clarify the feasibility of our events in this response. We have selected three different cities in Brazil to host events, Sao Paulo, Rio de Janeiro, and Brasilia. These cities have been specifically chosen based on our partner Richard’s network connection. In Sao Paulo, we will be working closely with Faculdade de Tech Sao Paulo, Colegio America, UNINOVE, and with EASP Business School. For Rio, we will be working in tandem with the Rotary Club and Mason Lodge which Richard is closely involved. These two clubs are heavily influential within the community and have agreed to assist with our events. In Brasilia, we have partnered with the Venancio family and Venancio Joias to host events with their large client base. As for your concern with the budget, an important thing to consider is the conversion rate from USD to Real which at the moment is: $1.00 = $4.74 real. This allows for immense flexibility with location selection. Lastly, we may not have a great presence on LinkedIn, but we are true to our word. We have already hosted our first event in Ecuador and Paraguay, please visit our website to see the events we hosted along with the gallery. Additionally, we also have hosted a Facebook live for our first event, please take a look! https://defidiscussions.com\nAuditability:\nWe have placed heavy emphasis on being completely transparent with the community that has funded and trusted us. While our base verification of attendees, wallet creation, and the number of people onboarded is crucial. We have also decided to provide the community access to our events by hosting Facebook Live videos, Instagram live, Youtube, and photos of our events as proof of our work. We are working on a partnership with Merchify to track the number of users using blockchain technologies. As for your remark relating to the creation of Catalyst accounts, this part is crucial because it works in tandem with our idea of allowing individuals to link their wallets to their Catalyst accounts allowing them to submit their own Project Catalyst Proposals under the guidance of Defi Discussion LLC. We mentioned in our proposal that individuals who attend our events would become recipients of Project Catalyst Proposals. Please look at our website for proof of our work so far in Ecuador and Paraguay. We will also post the link to our first event on Facebook live here for you.\nhttps://defidiscussions.com\n"}, {"q0": "Nice and well structured proposal. It clearly address the challenges as events in different of the main cities of Brazil might help to onboard new members and address challenegs kpis as Growth in the number of Community Advisors and Veteran Community Advisors, Swarm session attendance, Catalyst School session attendance and Weekly sign ups to Cardano Ideascale. I also appreciate the idea of having a dedicated time for networking. Now the pandemic has diminished, it is esserntial to resume face to face events and expand community outreach. Moreover, Brazilian community is huge and has a great potential of expansion, specially in these cities. Risk management seems also well done, with them properly mapped and with a mitigation strategy.\nThe only thing I missed here is a proper communication plan. How to really convince and bring people to attend the events when they dont even know that Cardano exist? What is the target audience here? Maybe it would be good to restrict, a least in the beggining, the target audience (let's say, for instance, for university students) to learn on this process, improve and then broaden it little by little. For me, communication is key here and is the only reason it didnt score 5.\nThe event could also be broadcasted online with breakout rooms for discussions and network but I understand that would make the project more expensive.\nLast, it is very important here to rcollect feedback throughout the year, to assess improvement, and run lessons learned in the end, for other people who wish to hold events in Brasil, so they have a starting point. In this sense, last fund a proposal for holding an event in Rio was funded, it would be interesting to get in touch with this team to also collect lessons learned.", "q0r": 4, "q1": "Overall, project seems feasible. The teams is experienced with competencies in the required areas (project management, marketing, Cardano/catalyst, content creation etc). The only thing here is that it would be good to have links or references to validate the information.\nPlan and timeline are sensible. As the main idea is just hosting events, it doesnt need much more details than what is provided in the proposal.\nLast, budget breakdown is clear and seems to list the main costs. The only one that I think should be a bit higher is the marketing one. I'd also add a contigency budget as events are really unpredictable. Imporant also to notice that proposal is quite expensive, representing 14% of challenge total budget.", "q1r": 4, "q2": "KPIs are clear and well selected. It's hard to set target at first but they a sense on it is provided in the \"What does success for this project look like?\" section ( e.g. 50 guests with most of them creating project catalyst accounts). I'd add here some kpis related to feedback (for example, number of positive feedbacks - could be used a survey/NPS).\nIt would be good however, as events are held, to have these targets set or at least an increase rate in relation to first events (like they would create a baseline). As the proposal is mainly about holding events, its hard to have milestones for the execution but maybe some could be listed here for the plannng phase. For instance, launching marketing campaighn, hiring security/cartering team, selecting the venues, and so on. Some intermediate management milestones could also be thought of. ", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The goal of the proposal is to expand the Cardano network in Brazil. The proposed solution is to set up events throughout the major cities of Brazil. The plan is to hold events in 3 major cities of Brazil: Brasilia, Rio de Janeiro and Sao Paulo. They will hold once a month to generate interest in the Cardano platform. It is proposed to require event attendees to create an ada wallet and play a lottery to receive gifts in ADA. This will increase interest in cardano. In addition, it also aims to introduce newcomers to Catalyst.\nIn addition, they were aware of some risks such as finding space to hold the event and had a plan to deal with it. This proposal is suitable for goal of the challenge of increasing the number of new people and the number of newly created ADA wallets.\n", "q0r": 5, "q1": "The proposal has a roadmap for implementation within 12 months, holding 1 event per month and 12 events in all. The first event was held one month after the project was approved. The project organizes rotating events in 3 major cities. The proposed team has a plan and solution to do the work clearly.\nThe budget of the project is divided into clear but not detailed items. The proposed team needs more details such as: how many people to rent a venue to hold the event; food service for how many people so that everyone can judge the reasonableness.\nThe core team consists of 10 members. They are experienced people in areas such as: Directing, management, marketing... The members of this group all have linkedin to introduce themselves.\n", "q1r": 4, "q2": "The proposal has clear KPIs such as the number of attendees, the number of people participating in Catalyst, the number of wallets created... The community can verify metrics such as: Number of proposals for Catalyst, number of wallet creators, the number of interactions on community media Websites.\nThe proposal has clearly described goals, easy to understand, suitable solutions, for example the goal of the project is that the first few events will have more than 50 guests with most of them creating project catalyst accounts.\nThis project is a continuation of F5 \"\"Networking Events\"\" in Ethiopia as well as F7 \"\"Networking/Education LATAM\"\".\n", "q2r": 3, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the problem of how to improve awareness and visibility of Cardano among investors, youth, and community leaders in Brazil. The solution to the above problem is to organize events in 3 major Brazilian cities of Brasilia, Rio de Janeiro, and Sao Paulo once a month to attract interest in Cardano.\nThey will instruct event attendees to create ada wallets and play the lottery to receive ADA and items. They explain that this solution will\nincrease interest in Cardano to introduce newcomers to the catalyst.\nThis proposal could extend over Brazil. I completely agree this proposal is suitable for solving the challenges.", "q0r": 5, "q1": "The key team consists of 10 members, many of whom have experience with Catalyst, project manager they also provided links to prove their experience and skills.\nThe total requested budget is $28,800 divided into 12 events corresponding to 12 months. $2400 per event will cover speakers, venue rental, catering, and marketing. The costs have been\n presented in clear items, however, it is necessary to be more detailed about the number of working hours and the area of ​​the conference room to be able to assess the reasonableness. The proposer has a roadmap for implementation within 12 months. begins one month after funding is approved. workshops will be held alternately in the three cities of Brasilia, Rio de Janeiro, and Sao Paulo.\nThe proposal is also aware of the risks that may be encountered when implementing and has a contingency plan and solutions to perform the work. However, I wonder with a budget of $1400 for a venue for a conference I don't think it's difficult. This is a minus.", "q1r": 4, "q2": "The project has a 12-month roadmap, implementing 12 events since receiving funding. However, I don't see a specific plan for these 12 months. I advise the proposer to add location plan information for each month, work content and measurable requirements for each month. They define project success as having 50 guests for the first few events, but there are no specific numbers for later events.\nthe number of proposals for catalyst, the number of wallet creators, the number of interactions on media and social Web sites from the participants are general, I cannot verify if it meets. I advise the thread to describe these well so that it can be better judged for later rounds. This is a continuation project of F5 \"Networking Events\" in Ethiopia as well as F7 \"Networking/Education LATAM\".", "q2r": 3, "assessor": "z_assessor_706", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "awareness creation is important to onboard new enthusiasts who could be CAs and VCAs. In this regard a small or mammoth gathering of youth, investors and students is an achievable milestone. The is denote that the proposal aligned and have the potential to onboard many more newcomers and to deepen interest of other that have heard or might of participated in similar events.\n\nNetworking events comes with referrals and the proposers must show how that can be done through incentives.\n", "q0r": 4, "q1": "The budget is quite and high and this events could have been organized in two parts - first half and second half. With this funding should be requested for the first 6 months and after successful implementation and evaluation funding is requested for the next 6 months. The team is quite experience and have the capacity ensure success.  They have provided links to verify their expertise and looked very determined for results and impact. However, being busy through out the year is quite a difficult but to do and demands more resources and energy. \n\n", "q1r": 3, "q2": "The KPIs are in tandem with the deliverables and can be measured. The KPIs should have the future pictured for successful onboarding. This is key measure outcomes and making evaluation easy by the community.", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "By establishing network events throughout Brazil's major cities and inviting speakers to networking events we can garner interest in Cardano", "experience": "Experience in international logistics and having well-established connections in Sao Paulo, Rio de Janeiro, and Brasilia. Antonio Adler is the head of the Rio Mason Lodge and the President of the Rotary club. A degree in Marketing Management will help me advertise Cardano events."}