{"id": 398875, "author": "ayaxlabombarda", "title": "Innovatio's Digital User Onboarding", "url": "https://cardano.ideascale.com/a/dtd/398875-48088", "category": 26450, "amount": 11400, "description": "There are no on-boarding methods for entrepreneurs or early-adopters accustomed to digital channels for successful Catalyst adoption.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1469, "q0": "The problem statement for the proposal is in harmony with the challenge.  A solution for this problem would align well with the guiding question of: How might we increase awareness of Project Catalyst as the most active open innovation platform?  Developing an on-boarding plan for those interested in entrepreneurship, work, or governance will help to make progress towards the key metrics of both the innovation process and general onboarding sections of the challenge.  The proposal is geared towards creating an onboarding process for a preexisting Cardano community, Innovatio.  The target audience is entrepreneurs, developers, and consumers all of which could lead to more quality proposals, community advisors, and voters.  The proposal seeks to address the challenge by increasing awareness and adoption of Project Catalyst, increasing engagement in the Innovatio community, and increasing awareness of different Project Catalyst communities, tools, and projects which align with the guiding questions.  It also indicates that it will reuse and leverage existing content and activities produced by other communities in the ecosystem which also aligns with the guiding questions.  \n", "q0r": 5, "q1": "The team has blockchain, finance, engineering, marketing, and legal expertise.  It appears to be more heavily weighted in engineering.  Part of the plan for funding is to hire a brand ambassador which will be helpful to achieving the goal of attracting entrepreneurs and early adopters.  \n\nPlan activities are listed as creating a weekly newsletter, creating infographics of the Catalyst ecosystem, and developing animated videos for an Instagram ad campaign.  What’s missing are the details on how many infographics and animated videos are to be produced and what the content will be about.  \n\nThe proposal indicates that we can expect to see infographics and videos beginning in week 3, but doesn’t provide any further details or timelines.  The budget is small, simple, and is very clear in what it will be used for.\n\nThe proposal indicates that there are no significant challenges that it faces, but this only raises questions to how deeply this was thought about.", "q1r": 3, "q2": "Auditability is weak.  The proposal indicates that it will evaluate interactions and impressions on social media posts though it doesn’t say how they will be evaluated and for what. It says that it will measure people actively talking about Catalyst or Cardano in the community, though it doesn’t indicate how that will be accomplished. It says that it will measure Catalyst community projects that are active within the Innovatio community, again it would be good to understand how this measurement will be made.  It says that it will measure the number of infographics and diagrams to understand the Catalyst ecosystem, it's not clear if this is measuring the new infographics that they plan to create or existing ones in circulation.  What's lacking here are clear metrics and KPIs.\n", "q2r": 2, "assessor": "z_assessor_1375", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2739, "q0": "This proposal has a primary goal of increasing awareness of Project Catalyst and promoting meaningful participation by exposing the Innovatio community to various media they will produce related to Project Catalyst.", "q0r": 4, "q1": "The proposers provided a clear plan including timelines for completion of this proposal.  The team provided bios that demonstrate a large team of specialists with expertise and experience in the related fields.  It seems highly likely this team can implement this proposal as they are currently working together on other projects in the Cardano ecosystem.", "q1r": 4, "q2": "The team plans to monitor social media engagement, new Catalyst proposals in the community and the amount of media produced as metrics to show the progress/success of the project.  These could be easily audited by the community and would provide useful information on the progress of this proposal.", "q2r": 4, "assessor": "z_assessor_1574", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5768, "q0": "I think that this type of proposal is perfect to attract new members to the community and allow them to start in it in the best way. Thanks to the newsletters, videos and content on social networks it will be very easy for new members to stay up to date and introduce themselves to the community.\n", "q0r": 5, "q1": "The strategy is planned and there are a series of steps to complete and tasks to perform during the course of the proposal if it is financed. For this reason and seeing the team behind it, I consider that it will be carried out.\n", "q1r": 5, "q2": "The auditability section is completely covered. Correct meters to use and control progress and a clear notion of what will be the correct result of having done everything successfully. This part also deserves 5 stars.\n", "q2r": 5, "assessor": "z_assessor_274", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6799, "q0": "This proposal is exactly what the challenge seeks. Thanks to a community already in development, new members will be helped to enter the Catalyst community, bringing them closer to the different projects, proposals and members of it while sharing content and activities from other communities within Project Catalyst.", "q0r": 5, "q1": "The plan is simple to fulfill that you will only need the people in charge of carrying it out to fulfill their function and carry out all the activities proposed here. In addition, since the Innovatio community has already been created thanks to other funds, I take it for granted that as they have people in charge of it, they will carry out all these activities mentioned in the proposal without problems.", "q1r": 5, "q2": "To monitor progress, the increase in social media interactions such as arrival to new members, activity of people around Catalyst or Cardano, Catalyst projects that are active in the Innovatio community and the number of schemes and infographics to teach the ecosystem to new members will be taken into account. For the success of the proposal the objectives are clear so it will also be possible to see if this proposal manages to be successful.", "q2r": 5, "assessor": "z_assessor_467", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10202, "q0": "I think it's a very good initiative to introduce new members to the community. Thanks to the fact that they are developing a community around cardano, a proposal of this type would be perfect to initiate new members.\n", "q0r": 5, "q1": "As I mentioned, the team is already developing a community and a platform in cardano so they have already started a lot of people in the ecosystem. That is why I think they are fully prepared to carry out such a proposal and plan a strategy to make it easier for them.\n", "q1r": 5, "q2": "At the end of the proposal they provide different ways to measure the progress of the proposal as well as how to identify the success of the proposal. This, together with the plan to be carried out, allows for a total follow-up of the proposal.\n", "q2r": 5, "assessor": "z_assessor_830", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}], "solution": "Develop an on-boarding plan for digital users who want to decide to get involved in entrepreneurship, work, or participate in governance.", "experience": "The Innovatio brand started in Fund 3 and consolidated since Fund 6 with 3 funded proposals, we are a team with experience and background in the Catalyst community and digital spaces, solid teamwork with work done, check external links and PDF."}