{"id": 398975, "author": "akyar.ozgur", "title": "Organised Linkedin of professionals", "url": "https://cardano.ideascale.com/a/dtd/398975-48088", "category": 26450, "amount": 100000, "description": "Lack of awareness of Cardano and Project Catalyst as the most active open innovation platform among professionals.", "f6_no_assessments": 13, "f6_rating": 1.4358974358974357, "videos": [], "media": [], "f6_assessments": [{"q0": "The author of the proposal raises an interesting idea, focusing on the promotion of Project Catalyst and Cardano in general in specific portals where professional profiles move can be of great benefit, this because, according to the author, there is a lack of awareness about everything related to Cardano. So he proposes to set up a team on linkedin where Cardano can be promoted in an organized way for the generation and publication of content and invites members of the community to join. Unfortunately it is clear that the author did not have the opportunity to complete this proposal, it is not possible to make an impact evaluation if you do not know the target population to be addressed through linkedin. This social network is very large and in order to have the best results it is necessary to define the target user and plan the content and outreach campaigns from there. It is also necessary to evaluate the appropriate impact by having well-defined metrics and, if possible, framed in a time range. I invite the author of the proposal to take my feedback and that of the rest of the community so that he can present a robust proposal for the next fund. ", "q0r": 2, "q1": "In terms of feasibility there is no information available to make a proper evaluation, so I recommend to the voters not to approve this proposal. Now in the spirit of inviting proposers to prepare for the next fund, here are some ideas (beyond those already in the proposer's guide) that I can think of in terms of feasibility to address this type of problem. First of all, have someone on the team with a marketing backgroung, if possible who knows everything that has to do with Facebook, Google and Linkedin adds and allocate a budget item not only for the cost of advertising, but for the planning and maintenance of the campaign. I would also recommend a member with a background in online content creation, the best way to do engagement is to create valuable content for the target audience, so with your knowledge of the ecosystem combined with a good professional in this area would be a good start. Talking a bit about the plan, it is necessary to create a funnel workflow thinking about the steps that this target user would have to go through to become part of the community. Now the team has to define what it would mean to be part of the community. Wallet creation? Registration in Project Catalyst? Active participation in Discord groups? This would have to be defined by you. It is also necessary to think what would be the main risks for the money invested in campaigns to be as profitable as possible, some risks are the clearest of course that the potential new risk does not complete the workflow funnel, from there you would have to think countermeasures to reduce that risk, and so for all the general risks that you identify.", "q1r": 1, "q2": "In the Auditability section there is also not enough information to make a complete assessment, so now I focus on presenting suggested metrics / KPIs for the proponent to consider for future funding. Beyond the obvious step of analyzing the metrics suggested in the challenge setting. I would recommend the following metrics: Number of user members in the linkedin group, level of user participation in the group, conversion rate, number of leads (define what a lead would be for the project), cost of acquiring new users, number of users that start the funnel workflow vs. users that finish, etc. There are many more but it will depend on the focus you want to give to your project. ", "q2r": 1, "assessor": "z_assessor_130", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "This proposal probably needed to be withdrawn, as it is not fully complete, but I wanted to give the proposer a thumbs up for the general idea of organizing Cardano enthusiast on LinkedIn in order to generate viable presence.  The issues with the idea are mostly in principle:  linkedIn is a centralized hub with legacy hierarchical threads in its DNA (think of things like the High-level connections) that could be doing a lot more, given its nature, to promote organic networks, emergent leadership, etc.", "q0r": 1, "q1": "The proposal is incomplete, and has not included its timeline, team members, budget breakdown, any actionable tasks or any resources required to complete the project.", "q1r": 1, "q2": "The proposal is incomplete and has not included a road map, milestones, any metrics or KPIs that could measure progress, or allow the proposal to be tracked.\n", "q2r": 1, "assessor": "z_assessor_1193", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal tries to introduce Catalys into LinkedIn through content sharing plus weekly meetings, thus bringing more professionals into Cardano Ecosystem. However, the proposal does not give any detail on how and what kind of content they want to create, they also do not provide in a big picture what will be discussed in the weekly meeting. Furthermore, the proposal also doesn't give information on the potential risks they may face, let alone how to overcome them.", "q0r": 2, "q1": "The proposal did not provide any information on the timeline or roadmap, number and qualification of team member(s) required, or even how the proposer will use the budget. For the budget, the proposal can state they need a zoom license for the weekly meeting, or to paid guest speaker, as an example.", "q1r": 1, "q2": "The proposal doesn't provide any metrics/KPI that define the success and state ‘Will be updated with team members’. They can metrics for success as the number of LinkedIn group members, the number of participants on each meeting, or the number of a meeting held successfully. For the indicators of success, they can add the number of LinkedIn members that actually joined Catalyst, for example.", "q2r": 1, "assessor": "z_assessor_1342", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "\nI find the proposed idea very exciting, as I think it's crucial to open new channels to recruit more contributors into the community. LinkedIn is one of the most popular channels to recruit professionals that the community needs to raise the bar of the Catalyst proposals and the ideas presented, which is one of the main objectives of the challenge.\n⁣\nThe problem perfectly aligns with the campaign's challenge; however, I found that the proposal lacks the solution's details that address the depicted problem; for example, the proposal doesn't state the type of content produced and the areas covered to effectively onboard passive ADA holders to contribute to the Catalyst community actively.", "q0r": 2, "q1": "The proposal doesn't have clear information about the plan or the team, and the solution was also very ambiguous with not enough details on the type and frequency of the content shared by the team members.\n\nAdditionally, the skill-set required to produce such high-quality content that would effectively spread the word about the Catalyst community and potentially recruit more professionals is hard to acquire by a single team member.", "q1r": 2, "q2": "The proposal didn't explain how to measure the progress or the set of metrics to track. However, LinkedIn provides high-level metrics for group admins to measure the reachability and effectiveness of the content posted, which can be helpful to measure the progress and success of the proposed solution.", "q2r": 1, "assessor": "z_assessor_1401", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This idea is entirely focused on Coordinated promotion of project catalyst through professional channels can bring more professionals on board to support development. As you've seen, the problem is straightforward and well-suited to this challenge. Furthermore, the solution is unclear, and it does not demonstrate a direct impact on the Cardano ecosystem. This proposed problem is very interesting and potential to solve, because Linkedin is a social networking platform favored by many organizations around the world to provide information about personal achievements as well as employment. can attract new people from here will stimulate future development. In Conclusion, I agree that this proposal effectively addresses the challenge", "q0r": 4, "q1": "Unfortunately, this proposal has not yet been finished, and we have been unable to uncover any general information on the proposer, making it difficult to assess its feasibility. In reality, we couldn't find any information regarding the demo that had been given to us. Furthermore, I don't see any goal/target, KPIs/metrics, roadmap, or budget breakdown - one of the most crucial things to evaluate from this side. There is no basis to agree on the practicality of this idea because many aspects have yet to be resolved. As a result, I strongly disagree that this suggestion is extremely likely to be executed successfully.", "q1r": 1, "q2": "As can be seen, there is little information about the proposers in this proposal, making it difficult to assess its viability. Second, there is no indication in this suggestion that a roadmap is needed. It's odd that there haven't been any Key Performance Indicators (KPIs) or Metrics (Metrics). This is uncommon in that we only learn about the entire budget. There is just too little information offered; everything comes to a halt at the concept level. This, though, I believe is a good concept. I'm hoping that the author will finish it in the next Fund, it can be Fund 9!. To sum up, I strongly oppose the auditability of this proposal.", "q2r": 1, "assessor": "z_assessor_1413", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "IMPACT:\nThe adoption and growth of Project Catalyst is a collective work effort between proposers, advisors, mentors, and voters. In this context, the proposer identifies a problem, by describing the lack of Cardano and Project Catalyst awareness among professionals. The solution he offers is the promote Project Catalyst content through professional channels to support development and generate adoption. The way the proposer communicates how this will add value to the Cardano ecosystem is by describing his collaboration and volunteering labor on promoting Cardano using his professional account for about a year. There are not metrics or goals specified in this proposal that are align with the challenge aspects. In addition, there is not explanation on how this proposal will be able to scale future challenges.  \nScore given: 2\n", "q0r": 2, "q1": "FEASIBILITY:\nThe only information that the proposer offers is the LinkedIn account, where we can observe his experience in Computer Engineering, Research Assistance in University facility, and IOHK freelance activity. In addition, he provides a GitHub repository link that does not connect to the actual repository. It needs to be updated. This proposal is incomplete. There are not budget details, timelines, process procedures, challenges or risks related to the implementation of the project.\nScore given: 1\n", "q1r": 1, "q2": "AUDITIBILITY:\nThere are uncompleted updates on this proposal. No roadmap or time horizon details, not metrics that can define the success of the proposal, he explains the need for Cardano and Catalyst educational tools, but not specific or details solution to the problem. The proposer mentions that he will try to assess and put up a better proposal for next fund. \nScore given: 1\n", "q2r": 1, "assessor": "z_assessor_1557", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is within the challenge, creating a profile on Linkedin will increase the number of contributors to Cardano, thus expanding the interest of visibility. But the proposal is incomplete, I recommend the proposer to follow the guidelines of the link provided below: https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true\n\nThere are no metrics to assess the impact of the proposal, thus making support difficult.", "q0r": 1, "q1": "Linkedin profile link was provided, where there are relevant experiences to implement the proposal, but the plan is not in great detail to indicate feasibility. Informed about a team, but vague on the number of people who will be part of that team and who they are, thus making it difficult to guarantee success.\nThere is no information on budget breakdown, implementation plan and schedule.", "q1r": 1, "q2": "There is no roadmap with milestones or timeline in the proposal, thus making auditability assessment difficult. The proposer did not provide metrics to be audited. There is clarity in the description of the problem, but not in the solution.", "q2r": 1, "assessor": "z_assessor_1828", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposer has identified a problem and a solution to the problem. Bringing more people on Cardano ecosystem and bringing even more professionals is always a good idea. But, the proposal, as it is presented, seems not to fit in the challenge brief and most important in its KPI/metrics. It needs to be rephrased for better auditability.", "q0r": 2, "q1": "The proposer has provided a link to its LinkedIn profile and it seems that it has the potential to conduct a campaign to attract more users into the Cardano ecosystem using the LinkedIn platform.\n\nThe requested budget, half the entire Challenge fund, seems to be disproportionate for the output the project could provide. The budget is not broken down into identifiable items (i.e.: running 5 promoting campaigns - $1000 x 5, hiring content creator - $2000 for 3 months etc.)\n\nThere is no timetable with achievable milestones defined. The proposal does not provide a sensible and conductible plan for implementation that shows not only what is being done but also how. (a target audience should be identified and address it accordingly).\n\nThe proposal looks more like a concept than as a working product.", "q1r": 2, "q2": "Unfortunately there is nothing to assess to this proposal as it lacks in providing relevant information about its implementation. (KPI/metrics and risk awareness, to name some of the relevant aspects)", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal identified an issue within the scope of the challenge. Creating a LinkedIn profile is a way to increase social media coverage and increase the visibility of Cardano and the project Catalyst. The proposal doesn't clearly articulate how it will add value to the ecosystem. The intention to create a LinkedIn profile to share information about Catalyst has been mentioned, but there is no clarity on how this will happen, there is no solid plan. The proposal is a draft, there are no metrics or targets that can help assess the impact of the proposal. I would recommend including metrics and goals that allow you to evaluate the performance of the profile created on Linkedin.", "q0r": 2, "q1": "This proposal is a draft. There is not enough information to assess whether the proposer is fit and there is no clarity on how many people are involved in the team. The proposer placed the Linkedin link, but as the plan/concept of the proposal is not well established, it is difficult to judge whether the proposer will be able to deliver.\n\nThere is no information about budget breakdown. There is no timetable or implementation plan. The proposer did not consider challenges. I would recommend that the proposer use the following document as a reference to write a new proposal: https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true", "q1r": 1, "q2": "The problem presented makes sense and is within the scope of this challenge, expanding the visibility of Cardano and Catalyst through Linkedin meets the objective of this challenge, but the proposal is a draft, there is not enough information to indicate auditability. I would recommend that the proposer follow the documentation below to define metrics/KPIs to make the proposal auditable.\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is an incomplete proposal. Please take out form compensation system. To proposer please attend Catalyst School sessions on how to submit a proposal.", "q0r": 1, "q1": "This is an incomplete proposal. Please take out form compensation system. To proposer please attend Catalyst School sessions on how to submit a proposal.", "q1r": 1, "q2": "This is an incomplete proposal. Please take out form compensation system. To proposer please attend Catalyst School sessions on how to submit a proposal.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposer's idea is good. LinkedIn is one of the important channels where professionals around the world are connected to each other. Unfortunately, I don't see any detailed plan mapped out by the proposer. It would also be great to have some explanation on types of content sharing that would be used to attract the professionals to Cardano with the massive potential that Cardano has.", "q0r": 2, "q1": "The proposer has written some research papers with his team, and I believe is an active contributor, great stuff! But, as for the proposal itself, it needs a clear budget breakdown with its dedicated timeline. How would you utilize the US$ 100k fund in phases during the project? Another thing to take into account is how to increase the engagement probability in LinkedIn. Not only respectful professionals, but the majority of us also tend not to care much about our LinkedIn pages from messages, invitations, events, etc.", "q1r": 2, "q2": "It's a pity that this proposal is not a detailed one. I believe this could be a great proposal if the proposer wants to put in an extra effort considering his and his team's background. There's no clear KPI and milestones to be achieved and any description about how the communities can see the project progress.", "q2r": 2, "assessor": "z_assessor_647", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a great proposal focused on the coordinated promotion of project catalyst through professional channels for bringing more professionals on board to support development. Regarding impact, some issues that should be noted are as follows:\nfirst, as can be seen, the problem statement is clear and suitable for the given challenge, solving this problem may have positive contributions for achieving this challenge's goals and KPIs. Indeed, the problem this proposal is interested in solving is very good and potential, because Linkedin is a popular social networking platform for office workers and experts from many different fields. If they are attracted to come on board, it will contribute to achieving the goals of this challenge in particular and of the Cardano ecosystem in general. However, it is very regrettable that the proposer has not been able to finalize the proposal, currently many details of the solution have not been described and clarified; this makes the proposed solution unclear due to lack of detail for supporting some important information (such as roadmap with timeline, KPIs/metrics for measuring the success,...) and it failed to show a clear positive impact on the Cardano ecosystem.\nIn conclusion, I disagree with the impact of this proposal.", "q0r": 2, "q1": "Regarding the possible, there are some issues that should be noted, including:\nIn general, this proposal has many potential impacts (as analyzed above), however, because many details have not been finalized, there is really no basis to agree on the feasibility of this proposal. Specifically, this proposal did not provide any meaningful information of team members and there is not any information that shows the proposer's demo/pilot/prototype/similar works completed in the past. Additionally, this proposal did not provide any goal/target, KPIs/metrics, roadmap, budget breakdown, and risk with mitigation, this shows that the proposer has not fully looked at what could happen during the implementation of this proposal.\nTherefore, based on the provided information, I strongly disagree with this proposal's feasibility", "q1r": 1, "q2": "Regarding this proposal's auditability, there are some issues that should be noted, including:\nIn general, there is too little information available, everything is just stopping at the concept. Specifically, there is no information of proposers in this proposal, no roadmap, not any KPIs/Metrics, budget breakdown provided (only the total budget of $100k - accounts for 50% of the challenge's total fund). In summary, of course, there is really no basis to agree on the auditability of this proposal, however, I think this is a very inspiring idea. I hope the author will improve this in the future.\nBased on the provided information, I strongly disagree with this proposal's auditability", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 11, "ne": 2, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Even though meetings with professionals  could help introduce the cardano blockchain to new members, the proposal fails to provide a detailed work structure and framework to effectively address the challenge.", "q0r": 2, "q1": "The absence of a detailed work experience of the team, the lack of a roadmap and a clear timeline for the project, implies that the team will likely not implement the project.", "q1r": 1, "q2": "The information for auditing the progress and success of the project is not sufficient. This because the team failed to provide any information for auditing the project", "q2r": 1, "assessor": "z_assessor_732", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "Coordinated promotion of project catalyst through professional channels can bring more professionals on board to support development", "experience": "I've been volunteering to promote Cardano through my professional profile for around a year. Besides we can be more effective in an organised way. Therefore, new members with higher connections are welcome to join. Let's team up!\nhttps://www.linkedin.com/in/ozguryasarakyar/"}