{"id": 398974, "author": "shirogat", "title": "Onboard New Eastern African Members", "url": "https://cardano.ideascale.com/a/dtd/398974-48088", "category": 26450, "amount": 2500, "description": "Much as catalyst is an active growing community more needs to be done to increase awareness of project Catalyst especially in East Africa", "f6_no_assessments": 8, "f6_rating": 3.291666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7353, "q0": "The theory of the proposal is great, adding 100 new members to the Cardano community, bringing them together and instructing them about what Cardano is, what are the opportunities offered by our blockchain, such as: programmers learn plutus and get employed in any of the Catalyst projects, where such labor is highly needed; advertisers and designers alike work for projects; people who do not have these more common formations of project team members, working as CAs and vCAs...). This proposal certainly meets in theory the objective of bringing new people into our ecosystem, as we know that in most cases Cardano is unknown (except in places where blockchain is already more widespread, such as the United States and Europe). This would certainly be beneficial for Cardano, since in addition to new workers in the projects, the investment in our blockchain would probably also grow, either by the increase in the purchase of Ada, Ada being delegated, CNFTs bought and sold, number of digital wallets created and etc. The problem is that it is not explained exactly how these 100 new members would be onboarded into the community, in the feasibility part there are several actions that would be taken, such as “active pre-onboarding campaigns and information about the value of the catalyst / welcome meeting”. must be powerful, share Cardano's vision” and many others. However, the problem I identify here is that these actions are not well located in time and space. We know which team involved would be the East African decentralized alliance, which leads us to believe that the project would be in that geographic region, but in which country? Who would be the target audience, that is, which people exactly are we targeting to create this group of 100 people? How long would each of these actions take and when are they planned to take place? In short, I think the idea is a good one, but putting it into practice is still a bit confusing through the information given. With that, I'll be neutral about the impact. This part of the proposal could give more confidence with the details I mentioned a little while ago. \n", "q0r": 3, "q1": "As I explained on impact, I think the script here is good in the sense of letting us know what is going to happen, but not in what way or how. It would be necessary to understand how long this project would take to happen. The explanations provided for each of the two months are very superficial, it would take more detailing of the activities, it would also be great to understand for weeks what actions would be developed. I would also like to know which alliance members would do which things, and where, for example, the meetings would take place. Since they will be face-to-face, where will they take place? And what group of people will you organize, with the aim of also receiving whom? How would the teachings on Cardano be transmitted? What topics would be covered and in what order? I believe we would start with the basics, such as what is blockchain, Cardano, NFT, digital wallet and other more primary technologies of our ecosystem. But unfortunately the bidder does not specify any of this information. Therefore, I believe that the roadmap should be reformulated, including deadlines and more detail on each of the actions. Regarding the budget, I also think that this part should be better explained, despite the fact that the money requested is very cheap compared to the other proposals, this does not exclude the need for detailing how much will be used. For example, most of that money would go to the host. He or she would receive 1600 USD. But why? What would that person do? What tasks would she be responsible for during the month? How many hours of work would she do a day? Would your journey be Monday through Friday? And finally, about the team, we are told that they would be the members of the East African decentralized alliance and that they have launched several proposals previously and some of them have already been funded. However, it would be necessary to know them individually, so that we have a real idea of ​​who we are dealing with and if they are qualified for the project. We would need to know their names, CVs, how they relate to Cardano (we know they are part of an active group in the community, but what are they doing?), what roles they would play here (from what I could understand it would be just one person from the group working on the project, but who, and what would she do?). That is, all the detail that is provided about team members Victor, Antony and Angela. Anyway, it's very complicated to trust a team that we don't fully know. Therefore, I think that in terms of feasibility, the proposal is not bad, but some things should be reviewed. \n", "q1r": 3, "q2": "Regarding the progress of the project, I think that auditability is possible, because the proponent lists several activities that must be fulfilled so that we can consider that the planned things are actually happening. As we have such activities in a linear order, it is easier to monitor this. What is really missing is the issue of dates and deadlines within the months. If we had an exact idea of ​​how long each thing would last, we could better understand the whole. It would be important for the proponent to define, for example, that by the 15th, half of the promised activities would have been fulfilled. It would be great to know the exact days the meetings would take place. Another suggestion I would like to make is that some member of the Cardano community, who was native to the place where the project would be focused, follow the entire process, both the online parts and the face-to-face meetings, and bring this feedback to the rest of the Cardano community. through any of the various communication channels that we have. And about the final results, unfortunately this part is very unspecific, we know that the goal is to ship 100 new members to the Cardano community, but how would we know that this result was achieved? It would be essential for the proponent to prepare a final report, when the project has been completed, gathering all the data that demonstrate that the goal has been met: how many digital wallets were created, how many people attended the meetings, if these people actually entered the Cardano ecosystem , and if so, in what way... Anyway, we need to know in detail how this all happened. Preferably, someone participating in the project also gives their opinion on everything, telling their account of how this initiative reached him and how it reached his colleagues, for example. Therefore, I think that auditability is good only in relation to the process, and even in this part it is not ideal because the dates are absent, the temporal notion given is a little vague. Unfortunately, about the end goal, not enough detail is given so that we could really safely monitor the consequences of this project. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 446, "q0": "The proposal addresses the challenge well in that it focuses on onboarding a significant number of new people (100) to Catalyst in an underrepresented part of the world, and it also focuses on the challenge-setting priorities of attracting quality people, and onboarding them to active participation in Catalyst as proposers, advisors and mentors, as well as simply ADA holders and voters.", "q0r": 5, "q1": "The \"describe your solution\" section doesn't explain what the proposal actually is and what it will do, so it's only by piecing scraps of information together from the other sections that I can begin to guess what's happening. From the timeplan, it seems people are to be onboarded mainly as proposers; and from the budget (Zoom licence; meeting venue costs) I can guess that some onboarding sessions will be on Zoom and others face-to-face; but it is not clear who the 100 people to be onboarded are, how they will be identified and reached, how many sessions in total there will be, whether they're all large meetings like a Town Hall, or some smaller sessions; etc. All this will affect feasibility, so a much clearer explanation is needed, and a reviewer should not need to guess by piecing information together. The time plan needs to be more specific in parts - e.g.\" Easing transition by being communicative and giving new members information and tools\", it would be helpful to know *which* tools, *what* information (I guess it must be resources that have already been created by others, since there is no budget for creating new material - but it would be good to specify where they will come from, and what experience the team has in using them and explaining them to others, because all this might help us understand the project's feasibility.) The budget (total $2,100) doesn't match the total requested ($2,500); but apart from that error, it is reasonably clear and well broken down. The team seem to have the skills and experience needed to achieve some kind of onboarding; but since we don't know what they will actually be expected to do, this is hard to assess. It would be good to include some information about the team's links to the communities they want to reach and how they will use these connections to attract people to the sessions. Overall, from what I can tell, the basic idea could be developed into a feasible proposal; but as it stands, it's not feasible. One big concern is that the core of it seems to be onboarding proposers; and because this proposal team do not demonstrate that they can write a good proposal themselves, I am not convinced they can train and support others to do so. But the project sounds like an important and valuable one, and it does address the challenge well, so I hope the proposers work on it and and resubmit in a future fund. If they could give themselves a \"crash course\" in proposal writing, then they would be in a very strong position to help others do so, because they would have a really good understanding, from experience, of the process of learning how to do it.", "q1r": 2, "q2": "No audit metrics have been defined; we don't know what will be measured or assessed, and the \"audit\" section is basically another version of the project timeline.  I'd like to see the proposers define 4 or 5 measurable things that would show whether or not they have achieved their \"what does success look like\" - so for example, the number of people attending, number of people actually submitting a proposal, number who say in an evaluation that they found the sessions easy to engage with, etc. But as the proposer hasn't included these metrics, and will not be measuring these things, the project isn't auditable.", "q2r": 2, "assessor": "z_assessor_1157", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 660, "q0": "This proposal is for a classic outreach campaign to spread word on Cardano in East African communities via...well, just about anything you can think of!  Online meetups, face to face sit downs, public venues, even phone calls are covered here in an attempt to reach as many people as possible over the course of 4 months.  They make specific mention of explaining the opportunities of Catalyst, especially the roles of proposers and CAs, and plan to use a catalog of past funded proposals to get their audiences thinking about specific ways they could be jumping in to submit proposals and jumpstart Cardano in their communities.  Through these 4 months they hope and expect to onboard one hundred new members to the Catalyst community from East Africa, with every Catalyst role under consideration.  Something to keep in mind is that the WMT project is starting in East Africa, so supporting initiatives through these regions can have synergistic effects on  Cardano.", "q0r": 4, "q1": "The EADA team has arrived on the scene in Catalyst in a big way, and their onboarding has had absolutely fantastic results, so far.  WIth four funded proposals out of the gate in Fund7, and many more teams developing and polishing their skills, there is no doubt that they know how to get the word out.  Modeled on the hyper successful WADA group in Catalyst they are quickly mastering the roles.  In fact the most disappointing thing about this proposal is not getting more information about the team behind this.  We have an idea of their results, which is good, but who are they and how do they see all this happening?  The timeline they have laid out has done a lot of the talking for them, rolling out ten key points, from principles they wish to uphold (high energy introductions, multiple and easy communications channels) to specific points they want to be sure to get across (in depth knowledge of the roles of Catalyst, up to date on important parts of the process like TownHalls and Swarm sessions).  There could be more details about what events they plan to do when, but given the multitude of types of connection they are seeking to form, a lot of what they do appears like it will be highly emergent.  They do indicate they will have a large introductory meeting to kick things off, so I imagine they envision a lot of the meetups and connections to be as a result of that initial networking.", "q1r": 4, "q2": "The main KPI the team has presented, the onboarding of 100 Project Catalyst members is short and to the point.  Other areas they will be covering that they would be remiss not to add to their reporting protocols would be tracking the challengefest participation of members they onboard, tracking and following up on the progress of any CAs, referrers or proposers they sign up, and noting participation rates in their hosted swarms and ATHs.  If the team has a dedicated communications channel, it would be helpful to include it, so that the community at large could support and help follow along with the progress of their proposal.  For the included and implicit KPIs, they should have no difficulty meeting the reporting requirements and staying on track.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3707, "q0": "Cardano is a growing community and the proposer suggests to add more members on board from the East african region which will inturn increase the cardano community and it is an advantage for both. The proposer has identified the need for onboarding the New eastern African members  and they have also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 4, "q1": "The proposer has a very innovative idea of Onboarding New Eastern African Members and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 2500 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6315, "q0": "The proposal is aimed at developing new members in East Africa to join the Catalyst. The solution was to build quality challenge teams, proposers, CAs, vCAs, and voters recruited from East Africa. The solution they offered was that 100 members would join Catalyst within 4 months. This is not a solution, this is just a goal. The team should give a strategy to achieve that goal such as: organizing events to share information about Cardano, opportunities about Catalyst ...In addition, they are also aware of the risk that participants have different free time and the solution is to conduct short meetings. With the above risk, this solution is reasonable. The idea of developing new members in East Africa is suitable for the Challenge but needs a more specific solution.", "q0r": 3, "q1": "It is proposed to provide a clear and specific roadmap. They implemented this proposal in two months, May and June, 2022.\nThe proposal provides a budget description of $2,500 for the rental of the venue for 2 face-to-face meetings, Zoom app accounts, phone calls, coffee shop meetings, etc. The proposal team needs more details for the success of the project.\nThe proposed team consists of 3 members. They have experience in education, computer technology, and are active members of catalyst, as well as co-hosts at Eastern town hall... They all have linkedin clearly attached.\n", "q1r": 3, "q2": "In this section, the proposed group again gives a 3-month roadmap with milestones in May, June, July, 2022 (adding work for July 2022). They have given specific figures and KPIs for each month, but they are presented in general and are not clear. The success of the project was to introduce and train 100 new active members to Catalyst from East Africa. This goal is clear and measurable.", "q2r": 3, "assessor": "z_assessor_395", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8812, "q0": "Proposer to raise the problem that Catalyst community is developing actively, need to further raise awareness about Catalyst in East Africa, the solution proposed to solve this problem is to Build quality challenge groups, CA, vCA and voter were recruited from East Africa. The proposer explains that the project will provide 100 more catalyst members of 4 months. Basically, the proposal meets the requirements of the challenge. However the solution description seems to be more of a goal than a solution, what I would expect is that the proposed topic will provide more specific information on how to achieve that goal than providing an objective with a timeline for implementation. Clarifying this problem with the solution description will increase the completeness of the solution", "q0r": 4, "q1": "The proposal team consists of 3 members, Victor, Antony, and Angela, they have a lot of experience in computer science, open-source solutions in which Angela is an active member of Catalyst and is a co-host at Eastern town hall, CA, vCA pioneer, and Haskell Plutus, instructor. They have provided links to substantiate their relevant experience. The proposer to define the plan in May and June 2022,When explaining the auditability they said it would be done in 3 months , suggested unifying this information , for me , this is a minus point. The total budget of the grant application are $ 2500, used to pay for the rental place of \n2 face-to-face meetings, purchase of online meeting accounts Zoom, phone calls, coffee shop meeting, salary for proposal team. I consider it quite reasonable but it would be more perfect to proposal provide a more detailed plan of this costing by working hours. The proposer has also identified the risks involved and has contingency plans to deal with those problems.", "q1r": 4, "q2": "The proposal provided a 3-month road map of May, June, and July to reach 100 new people from East Africa referred and trained to become active and productive members of the Cardano community. Work goals for each month are presented in the proposal however it does not provide specific numbers by which I can gauge whether it is making progress month by month. My advice for the proposer should include this information so that readers can easily gauge the progress of the project. For the above reasons, I do not agree, nor oppose the audibility of this proposal.", "q2r": 3, "assessor": "z_assessor_706", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9612, "q0": "This proposal announce the clear problem of the lack of knowledge of Catalyst and Cardano in East Africa, which is well connected with the needs of the challenge, as well as for its solution which aims to recruit new members within the community of East Africa and train them to participate in the ecosystem. The impact is not really explained, it appears of course in the main objective but is that enough? It would have been interesting to have more explanations on this subject, for example a little contextualization, details on what this project could bring both for the ecosystem but also for East Africa. Explain the local conditions, the issues...even if things seem obvious, it is still important to give as much information as possible to be credible and understood by all. Unless I am mistaken, I have not identified the KPIs and I can deduce that this proposal could address future challenges, but this is not really explained. Having information on the overall vision and the organization planned for the short, medium and long term often makes it possible to better capture the impact of a proposal according to its different stages of implementation. ", "q0r": 3, "q1": "It is quite easy to identify the different team members and their skills, which seems consistent with the needs of the project, supported by links to their profiles. The budget is understandable but seems really low compared to the main objective and could also have been a little more detailed (sometimes explaining the budget gives additional informations on the ethics of a team, the choice of its implementation process, or other). For example, unless I am mistaken, there is no additional information to develop the principle of coffee shop meetings ? \nBut the plan with the timeline makes it possible to better identify the objectives and stages of the project. As the impact and the solution is quite precise concerning the 100 new members, it would have been interesting for the team to specify how it decided to respond to this challenge and what the steps would be to achieve it. The technical aspects are not really developed, but a risk is evoked with a solution. \nMaybe would be great to find collaborations with project already well integret to support this initiative. \n \n", "q1r": 3, "q2": "Overall, it is a pity that this proposal is not more complete, with a developed roadmap, clear KPIs, good communication of the organization and the issues, because the problem statement and the proposed solution are really interesting and could have a definite impact. There is no doubt about the basis of this initiative but it is the wording of this proposal that does not play in favor of the project. No information is provided on how the team will share information about the progress of the project with the wider community. The same plan is repeated twice, which does not provide more explanation and does not allow us to have elements to hang on to attest to the progress of the project. The only information is that in 4 months the team will have onboarded and trained 100 new members from East Africa, in order to be active members within the ecosystem. which is a considerable objective that makes you want to better know why this number and how... ", "q2r": 2, "assessor": "z_assessor_739", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10172, "q0": "The proposal wants to create a sharing campaign about Catalyst, find and recruit people who want to become CA, vCA, and train them. The goal in 4 months will be to recruit and train 100 active members. This, if successful, will help increase the number of new CA and vCA members in East Africa, expanding the East African Cardano community. The idea is not new and special, but it is also an idea to help develop Cardano that deserves recognition. The proposal is oriented in accordance with the requirements of this Challenge.", "q0r": 4, "q1": "Plans are listed in detail by month. However, if possible, the proposer should present it in a more understandable and logical way. The contents are listed in detail but the steps to be taken in the plan are not clearly seen. It is difficult to imagine what the proposed team will do to achieve the set goals. As I envision, the proposed team will contact, call people interested in blockchain and meet, share information about Catalyst, and invite potential candidates to join as CA, vCA roles. The implementation period is 2 months (from May to June 2022). In the Impact section, target 100 new members in 4 months. Thus, there are still 2 months that have not been written into the plan.\nRegarding the budget, the proponent does list the budget but it is a bit confusing, and the connection between costs and performance items is not visible. The budget only accounts for about 1.25% of the total Challenge budget.\nRegarding project implementation members, there are 4 members with experience mainly in engineering, computer, and technology. There are members with experience in CA and vCA, Haskell. Information of 3 out of 4 members can be viewed in detail on Linkedin. The proposed plan is not clear, so it is not possible to make clear comments on the member's suitability with the project's content.", "q1r": 3, "q2": "The proposed team has not yet provided ways for Catalyst and the community to monitor, check and evaluate the project's progress. Indicators, KPIs to measure success are also not given specifically. The goal of the project is to reach 100 members, and assist them with information and preparation steps to register as a CA, thereby establishing regular East Africa Catalyst meetings. Perhaps this is what the project wants to achieve.\nI think the proposer should rearrange the proposal table so that it is easier to understand, clear, and detailed.", "q2r": 2, "assessor": "z_assessor_823", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We need to build quality challenge teams, proposers, advisors, mentors and voters recruited to perform from East Africca", "experience": "The team has mor than 20 years collective experience in the ICT education space and a reach with many teachers in the East African region\n\n"}