{"id": 398912, "author": "sustainableada", "title": "Onboarding Under-represented Youth", "url": "https://cardano.ideascale.com/a/dtd/398912-48088", "category": 26450, "amount": 30000, "description": "Absence of a Cardano youth program focused on transformative education in the community, equipping youth with 21st century skills", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"q0": "I really enjoyed learning about this initiative, and the team behind it.  For me, the key element (and this aspect is in excellent alignment with the challenge setting) is that of the Lead-->Mentor-->onboarding.  As they mention in the proposal, this isn't a new idea, as UNESCO and others have had a go at a blockchain based youth cohort.  What separates them from the rest is this onboarding protocol, very common in small local outreach efforts, here scaled up.  The beauty of scaling mentorship is that it never loses its effectiveness, that one to one relationship is always just as powerful of a force, whether you have 2 mentors or 20.  This component, with the oversight element provided by the lead, which will homogenize the services offered and make them transferable as mentors matriculate out of the program, will provide the support necessary to keep young mentees on track.  Typically in a youth program, when you lose track of someone, that is when the material passes them by or goes over their head, and they have no one to slow it down and tailor it to them, but with the mentor set up, this risk is averted.  Kids will stay with the concepts until they can master them, and in the process understand how they will be able to approach Catalyst with vigor and direction.", "q0r": 5, "q1": "The team thought of everything for this proposal, with a fantastic timeline and budget laid out that make clear the path to their goals.  In particular the breakdown around establishing the voting element for the youth to participate in is well thought out.  As I am reading through how they wish to build up the youth over time, establish respect for the governance protocols and then finally top it off with their own wallet and a chance to vote in Catalyst Governance, it occurs to me that they could very well set themselves up a DAO governance token at the root of their initiative.  It would give tremendous opportunity to do hands on teaching even if the wallet issues surrounding ADA price fluctuations end up being a burden.  They already have the team to build it out, and it is clear that they are thinking about all the right governance framework concepts to build something like that out.", "q1r": 5, "q2": "First, I love that they open with the idea of making all resources and presentations created opensource.  Lots of programs can do that, but few think to make it an essential part of their roadmap as opposed to an afterthought.  I would suggest they consider building a GitHub or Gitbook repo for all of the material, in addition to the existing google folders.  I really love their goal of creating a replicable model for onboarding youth, and nothing speaks to that more than the opensourcing.  Combine that with a timeline for a replicable DAO...  oh yeah.  They have many funded proposals, and checking the funded proposals reporting sheet, they are all up to date and current, so that gives me confidence that the KPIs they lay out (they are all in the Feasibility section...I would have liked to have seen them bulleted in auditability) will be no trouble to track.\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Youth are the most important and dynamic segment of the population in any country. It is believed that developing countries with large youth population could see tremendous growth, provided they invest in young people's education, health and protect and guarantee their rights. As mentioned by the proposer the youth are the future generations who are going use block chain and cryptocurrency. By enabling youth and blockchain professionals to connect meaningfully, access professional guidance and expert mentorship, new opportunities are created for synergies that lead to catalyzing collaborative positive feedback loops. \nThe proposer has uniquely identified the need for Onboarding Under-represented Youth and they have also worked towards the implementation which is impressive and it will attract a lot of youth to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing youth to the cardona system  and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 5, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 30000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more youth which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 5, "assessor": "z_assessor_1668", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The project concept is based on the belief that today's young people will be the engines of the future ecosystem. (Young, digital natives and those seeking to connect to the digital economy today are going to be the users of blockchain and crypto tomorrow).\nThere are sufficient evidence, facts and reference sources of information which describes the potential of investing in a youth program and youth focused activities. The need for meaningful involvement of young people is justified and the benefits of it are explained.\n\nThe team defends the need to create a systematic and comprehensive approach to involve young people in the Cardano community.\nThe project is developed in detail following the guidelines and framework of the current Challenge. It follows the guiding questions answering each one of them.\nThe team identifies meaningful new roles that young people can take on in the ecosystem. (Additional roles are roles young people can fulfill : that act as a bridge Youth Ambassador/ facilitator/coordinator for bringing the youth and the connected stakeholders into the ecosystem once an initial cohort ‘graduate’ from the pilot programme). The team also appreciates the benefits of involving young people in existing roles in the Catalyst project - proposer, advisor and voter.\n\nThe solution proposed is to create a Cardano youth program to empower youth with structured pathways to engage within the Cardano community. A wide range of Key metrics is listed to measure the impact of the project both proposed in the Challenge description and additional one (directly related to the project proposal and identified by the team).\n\nThe team shares the competitive advantages of the project but they do not describe any challenges or risks identified to deliver this project successfully. This does not show awareness of the risks for the project implementation.\nThe partnerships mentioned (The Commonwealth, UNESCAP, 1 Million Mentors, Catalyst School, Wada) provides confidence in the successful implementation of the project.\n\nThe team pays attention over sustainability for the future of the project “beyond Catalyst initial funding”. They also take into consideration the possible change in ADA price from the moment of project funding until the implementation of activities.", "q0r": 4, "q1": "The solution to the problem and the specific method the team offers to implement is not summarized at one place and the reader needs to look carefully for it. I will try to make it in a sentence. The team offers with the Catalyst funding to involve 10 young people and to guide and mentor them through the whole process of Project Catalyst with the aim to educate and “during Fund 10 to take cohort through a Fund moving from‘ lurkers ’to becoming active in Fund 11, as mentors, proposers, advisors, voters and more. ”\n\nDetailed plan and timeline for delivering the solution is provided, with deadlines and specific goals for each phase. However, the plan lacks described actionable tasks and resources needed to implement them.\n\nThe Youth Voting Power part of the budget is explained and justified.\nIn the budget there are no detailed breakdown of the 12000 USD asked for Program management and the 3000 USD for Promotion of program. This does not allow it to be assessed whether the budget is reasonable for achieving the set goals.\n\nThe profiles of the core team provides information about in-depth expertise and involvement in Cardano Ecosystem structures, Project Catalyst, as well as professional qualifications sufficient for the implementation of the project. Involvement in the project of Cardano4Climate.com (C4C), Cardashift communities and Catalyst School is a guarantee for its successful implementation. The profiles of other potential partners are also shown in the application (The Commonwealth, The United Nations Economic and Social Commission for Asia and the Pacific (UNESCAP), The ESCAP, Accelerate 2030)", "q1r": 3, "q2": "A complex process for monitoring the achieved results and sharing them with the community is described (presentations, leads database and progress reports; monthly summary, accessible for all, explaining the work done and deliverables and KPIs achieved during the month). In the proposal I miss a roadmap with milestones for measuring the progress/success of activities.\n\nAll KPIs are listed in the IMPACT section, but are not accompanied by specific numbers and metrics. The Audibility section only describes the way in which information is shared with the community, without summarizing the criteria and elements that will allow tracking of project activities.", "q2r": 2, "assessor": "z_assessor_1890", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"q0": "This proposal, aka youthblock.io, creates youth-focused, cohort-based educational material and outreach programs featuring a 'case study program', a mentorship, funding wallets with 500 ADA for at least 10 young people to vote with youth members on 6 continents. It will be funded by a stakepool, certifications and 'one-time membership fee for mentorship access'.\n\nThis is a big project with many parts and ideas, such as new roles like 'Youth ambassador', mentor, 'Youth Challenge team member', Youth circle rep.  Is it perhaps unfocused?  Is there a way to narrow the scope?  \n\nThe proposal feels like a conceptual design document.    The proposal lists answers to the challenge brief's guiding questions.  Some of the answers are very interesting, but will they be included in the proposal implementation?  These answers show that the proposing group is creative and focused on the problem.  But the proposal is not improved by a list of interesting ideas.  ", "q0r": 4, "q1": "This is a large team with several partnerships such as WADA and BeanChain coffee.  Identified some other projects with similar goals and highlighted advantages over these existing programs.       \n\nThe budget is present but vague. For example, \"Programme management 12 month = 12,000 USD\".        \n\nThat there are no community comments in IdeaScale is concerning to me because community support and traction is key to successful implementation.  \n\nThis program is in pre-launch and, in my opinion, is still in the ideation phase.  I feel that feasibility is lowered because of the enormous scope and early stage of development.  The plan can be improved by refining it into a clear actionable plan.  See my above comment about advice.   ", "q1r": 4, "q2": " The collection of KPIs is good.  Each of the criteria from the challenge is listed and additional KPIs are given.  However, several of the KPIs are listed twice, which is a simple mistake.  However, the important point is how to measure the KPI.  For instance, 'Partnership organization' is listed.  But how will the project measure the relationship?  Also, 'youth tech leaders' is listed, but how will you determine what a 'youth tech leader' is.  I expect a KPI to be measurable and specific.  I am only deducting one star because I truly believe in this proposal and the impact it can have. And, I believe in the organizations associated with this proposal.  If you aren't funded, please refine the proposal and resubmit.   \n\nThe roadmap seems incomplete, for example, \"Phase 4: 9-10 months Basho\".  I am unclear as to what this means. I assume that Basho refers to the cohort from phase 4.   The use of the Cardano phases names (Byron, Shelley, etc.) is a bit confusing to me because those are the phases of Cardano ecosystem development.  Perhaps some other naming convention for the cohorts would be better.        \n\n", "q2r": 4, "assessor": "z_assessor_56", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "A lot of effort went into this proposal which was done by a group of active and passionate Cardano community members. Simply put, their proposal seeks to specifically onboard the youth onto Cardano through a specific platform that seems to be a hybrid between a Town Hall with their After Town Hall events and Catalyst School workshop sessions, though this is not 100% correct for there are other things they seek to do. It almost seems the team are trying too much and lack focus what is their core solution. There is a lot of effort to explain their actions that coincide with key metrics of this Challenge such as; onboarding CA's, onboarding vCA's, onboarding proposers to increasing daily sign-ups, though it is unclear how they plan to achieve those key metrics. The team only mentions what they will do that align with those key metrics.\n\nBut what really confuses me is why are the only focusing on onboarding 10 individuals (please challenge my assessment if I read this incorrectly). Add to that, through their budget, they seem to want to groom these 10 individuals into some Youth Ambassadors. A great portion of their budget actually goes to giving those 10 youth voting power worth around 5000 ADA. Equivalent to $5,000 or potentially $15,000 ADA. It is unclear what happens to this fund after their initial batch of youth. Rather than $15,000 ADA sitting in wallet, unfortunately it would probably be used more effectively by proposals coming from Africa. Or by proposals that just seek to onboard the general masses.\n\nI do understand that there is a lack of youth in Cardano, but a simple tweak in every communities approach, offline or online would actually bring youth. One approach can be by collaborating with universities, which would perhaps yield more onboarding numbers, such as setting up a University \"X\" Cardano Hub. To attract them, we could collaborate with a Cardano base game or cross-chain with already established game from Ethereum. Or even perhaps just focus on the aspect that one can buy a new laptop from just participating in one round of a CA.\n\nThis proposal is not a cost effective approach to onboarding. Perhaps this proposal would be more suited into Miscl. Challenge. For what the seem to seek to do is create young Cardano influencers.", "q0r": 2, "q1": "The team are veterans of the community, and are active in various groups. Some have also received funding and to my understanding have consistently reported on their progress proving they have met their KPI's. Though for some reason in this proposal, the solution seems lost, it is not as concise as their previous works. A lot of this proposal is about answering questions that do not actually add further clarity to their solution. Their solution is as following ; Lowering the barriers of entry into the blockchain, onboarding youth into the Cardano Catalyst Community. How do they seek to do that? By enabling youth and blockchain professionals to connect meaningfully, access professional guidance and expert mentorship.\n\nUnder that simplified premise, they will deliver on their intent. That part was never in questioned, it is more towards how the seek to deliver that plan that is either not concise or too concise in areas that do not assist them. An example budget, they ask for S30,000 for 1 (one) year, yet how they breakdown this budget does not mirror well with their action plan. It is more of a lump sump budget and not a detailed budget.\n\nGoing further deeper into their budget, they state they would need $12,000 for program management, this is most likely the project/program manager aspect. Yet the do not mirror this budget to a set of task. Again there are action plans but only general ones, not detailed action plans.\n\nIrrespective of all the assessment above, based on reputation alone, the team will deliver.", "q1r": 4, "q2": "Base on the how they seek to report to the community is quite comprehensive. Rather than using GitHub, they are using Google folders, where in these folders will have all their progress reports. It is not fancy as using GitHub but it is more than enough.\n\nThey will also setup a dedicated Discord and Telegram channel which is key for their program to succeed. For it is basically a mentorship program, and key for a mentorship to be successful is continuous communication. Meetings will also be recorded. Knowing they are veterans of being funded proposer, there is little doubt they will adhere to the regular monthly progress report format from IOG.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal creates a platform dedicated to introducing youth to Cardano in search of roles and future-shaping as positive impact leaders. they will be connected and guided by experts to join. I agree that this proposal is challenging and will have a positive impact on the catalyst.", "q0r": 5, "q1": "The listed proposer has 3 main members, They are active members of the Cardano community, the fund 7 proposers. Provided links to credentials proving the experience of these 3 members.\nThey also list six organizations and explain what they are. But I don't understand the purpose of listing these organizations with the project. The proposal had 12-month implementation roadmap starting from March 2022 with the first purchase of the domain name Youthblock.io. The implementation plan is divided into 5 phases with specific work and results to be achieved for each stage presented in the proposal summary. The requested budget is 30000$ which 15000$ for 10 youths selected worldwide to vote for catalyst. $12000 for project management costs. I want to know what work is done, how much time it takes and how much to pay for 1 hour. remaining $3000 for the promotion. What is specific? With half of the funds being applied for sponsoring young people, I would like the Proposer to clarify the plan for selecting a sponsored person to ensure the greatest impact for the project. That would be a perfect proposition.", "q1r": 4, "q2": "The proposal provides a plan with clear, specific timelines. This project is open source so it will be transparent and public. The data and reports will show the progress of the project. However, if the KPIs can be measured, the project will be more perfect.", "q2r": 4, "assessor": "z_assessor_706", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal sets out the clear issue about young people who are underrepresented in Catalyst. Which is well connected with the needs of the challenge and its solution also, by allowing a new public to take roles and engage in the community. The positive impact is conscious and explained both at the community level and globally. The impact is also taken into account in a perinity and long-term vision which gives another dimension to this impact. The connection of this proposal with the needs of the challenge is really clear, explained and it is a plus that reinforces the understanding of its impact and its coherence with the challenge. The same goes for the KPIs, very well explained and precise. This project is also able to address future challenges.", "q0r": 5, "q1": "All members of this proposal are very easily identifiable, everything is clear and supported by links. As well as their collaboration with Catalyst school. The team seems to be solid, presenting sufficient and coherent skills and experiences to carry out this project. The budget is also detailed and linked with the different phases of implementation as well as the plan and the timeline. It seems consistent with the ambitions and the many participants. With a desire to ensure sustainability beyond Catalyst initial funding, which is a plus showing the anticipation of the team. The plan, tasks and timeline are detailed, well understood and realistic. The technical aspects are addressed with attached document. The risks could have been explained, links are given, but specifying the risks in addition to them in a short and clear way would have simplified the work of the readers to understand where the flaws are and how the team is considering alternatives.  ", "q1r": 5, "q2": "number of ways for the community to track the progress of this project. dedicated google folders, leads database, progress reports, dedicated discord channel and telegram group, monthly summary, record sessions. On the other hand, the success goals are well explained and make it easy for each member to base themselves on clear progression indices and values. Just like the roadmap with a time horizon of completion, KPIs that make sense, on which we can base ourselves both qualitatively and quantitatively. The overall clarity of this proposal and its communication effort is in itself a proof of the auditability effort of this initiative. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Empower youth with structured pathways to engage within the Cardano community, find a role + shape the future as a leader of positive impact", "experience": "Cardashift, Sustainable ADA"}