{"id": 400072, "author": "alexp7", "title": "New Members Engagement 2- AIM", "url": "https://cardano.ideascale.com/a/dtd/400072-48088", "category": 26450, "amount": 29000, "description": "New members/mentors wish to support Catalyst but it is time-consuming and complex to learn how to best engage.", "f6_no_assessments": 4, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "The aims of this proposal Include matching the skills of new members with already funded proposals allowing new members to be quickly on boarded and become active community members.\n\nThis coupled with an educational program will effectively address the onboarding challenge by helping new members find areas where they will feel useful to the community. \n\nTherefore increasing the likelihood of long-term participation within the catalyst project.\n\nThis approach will help drive projects forward and in turn add value to the Cardano ecosystem.", "q0r": 5, "q1": "This proposal is a continuation of work from a funded proposal in fund seven and part of a larger body of work. \n\nThe fund seven proposal is on track with KPIs being met and timescale adhered to. \n\nThe team has a breadth of experience both inside and outside of the Cardano ecosystem and are all active community members. \n\nA combination of past projects, ongoing work and community reputation Provides a proven track record and would suggest that if this proposal where funded the work required to fulfil this proposal would be undertaken and achieved within the laid out scedule.", "q1r": 5, "q2": "KPIs and deliverables are laid out clearly in this proposal. \n\nTo facilitate audibility of these goals there will be open meet ups that will be recorded, the technology platform will be available to the community with monthly usage reports provided and written resources will be available in the form of Google Docs.\n\nHaving this information available to the catalyst community will make this project easily auditable. \n\nThe proposal identifies the need to match new members skills with projects needing team members allowing fast and efficient on boarding. \n\nThis continuation proposal addresses the stated problem meaning the proposal meets the new member on boarding challenge well.", "q2r": 5, "assessor": "z_assessor_1513", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal will directly impact the challenge question and help onboard new users into Catalyst by connecting proposers with mentors to help them achieve success. The problem statement addresses a real problem outlined in the challenge: \"How might we increase more meaningful participation from challenge teams, proposers, advisors, mentors and voters? What kind of additional roles are needed? How might we encourage new members to utilize the tools and services available for onboarding?\" The proposal clearly outlines how it will contribute to project catalyst and will add value to the Cardano ecosystem by facilitating collaboration between proposers and catalyst mentors. The KPI's provided are specific and measurable as well as being easily auditable by the community. This proposal if funded will be relatively easy to scale up to any number of catalyst users, and will be a valuable resource for the Cardano community. ", "q0r": 5, "q1": "The proposing team is very knowledgeable and are \"CAs, vCAs, Plutus Pioneer, Atala Prism Pioneer & successful proposers,\" so they have relevant experience and proven track record of past work in Catalyst that they are capable of delivering on this proposal. \nThe budget is reasonable and a detailed breakdown is provided with a realistic timeline. The team has listed their qualifications in the proposal, and appear to be skilled, experienced and well suited to execute and deliver on the proposal. The proposal acknowledges and addressed some of the perceived risks and challenges including marketing, UI design, and ongoing funding. ", "q1r": 5, "q2": "The team plans to be transparent with the community, and the community will able to see their completed work and recorded meetings. They have also listed KPI's that were also included in their previously funded proposal. However, this proposal audit-ability section does not include clear KPI's with measurable targets that the community can easily understand and audit. While the team will be providing reports to the community, and their progress will be apparent, it's not clear what the specific targets are for success. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal matches the challenge objective to impulse more meaningful engagement of proposers mainly by new member onboarding (who might need to find their role) – who could offer support and/or talent to proposers needs. The proposal is also focusing to onboard network. It connects as well to: How might we encourage new members to utilize the tools and services available for onboarding?\n\nI believe this proposal is powerful to drive both: collaboration and attending specific needs from proposal teams. Connecting such a platform to IDEASCALE could be an efficient way to leverage on new members coming and proposals (tagging their needs) directly to IDEASCAEL – representing this another channel integration that could boost also your platform (vice-versa).\n\nIt is important to get a better understanding on HOW the team is planning to engage with new Members since it is open to everyone and not only larger mentor networks will be integrated. Since it is more difficult to onboard new members to catalyst – how are the plans regarding helping them to understand “just enough” about Catalyst to empower them to find their role?\nWhat kind of needs of funded proposals have you identified so far, does this give an indication of what are high demand services/capabilities – which could shape the proposals strategy and tactics?\n", "q0r": 4, "q1": "Roadmap and KPIs are in place, nevertheless, to sharpen focus of this new venture it is required to determine key success factors that are closely tight to the value proposition and the audience. I can identify several KPIs but most of them could mislead the steering of your actions (eg. growth in the number of voters – I see far from the core of this proposal – instead look at KPIs like needs of proposals declared (=use of the tool and countable activities coming from the proposal teams) or ration #Tasks being generated vs # of new members or # of members adding expertise and availability) – examining the relevance of your KPIs is determining your path forward, I recommend challenging those. Also look at aspirational targets, e.g.,6 months targeting 100 tasks been created vs. 150 members (new/qualifying their profile) – the equation comes down to 0,6 task per member in this context (break down to 1-month equals: 25 members and 16,6 tasks created). Also recommend challenging and/or adjust KPI targets as you go to ensure your operational impact.\nNevertheless – my perspective as from a very abstract way – whose purpose is to showcase effective impact and is looking to impulse your review – always with the best intentions and to make your project most successful ;o)\n", "q1r": 4, "q2": "Progress can be tracked due to detailed roadmap and development can be experienced by the community itself. Emphasis is given to share progress in an open manner.\n\nIn view of ensuring a consistent business model with focus on the right resource definition and allocation I encourage the team to reflect on the importance of HOW the project will engage with new members, lowering complexity, make it easy to find their role and engage. Throughout the proposal I could not identify a strong message or detailed plan on this aspect – which I believe is crucial to successfully onboard those new members (your target audience). Recommend looking beyond proposal team, e.g. establishes startups, challenge teams, etc. since mentorship is needed in a broad scope of project catalyst.", "q2r": 5, "assessor": "z_assessor_433", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This is a great proposal for it refines an existing tool that the AIM has initiated but have not been able to refine to an extent that is user friendly and automated. This tool will further enhance the decentralized aspect of Cardano. I would even say to an extent will play a huge role in onboarding a wider range of backgrounds. Simply put, what they are trying to achieve is a marketplace for task needed to be done that is open to the community. These task will have their own compensation units. This itself, first hand experience in my own community, will slowly attract engagement in whatever metrics one needs. The key aspect here has been identified, which is user experience journey. How does one easily interface with this solution? One other aspect to be considered is determining the amount of compensation for the completed task. Too little will equate to minimum engagement, too much to early, the quality of work will suffer. Highly reckon to have a policy that is similar to that of the CA compensation. That it grows overtime, over discussions and over engagement.\n\nIn regards towards how this solution addresses the Challenge setting. It's a mix of direct and indirect effect. The direct result of this proposal, is most likely in attendance in Town Halls, Catalyst School and Swarm Sessions. Indirect effects would be the increase of CA's and vCA's due to the potential of submitting CA as a task that needs to be done. Taking a departure from the key metrics and solely focusing on the Challenge headline itself, the proposals solution has the potential, in the long run, for massive onboarding.", "q0r": 5, "q1": "The proposer are veterans of the community, of the Project Catalyst process, of the funded proposers community. Add to that their own respective backgrounds, most specifically the lead, Alex, who has extensive experience as a developer and solutions architect. This is relevant for, this is I assume a dApp and as I previously mention UI/UX plays a crucial role in the adoption of this solution. What makes this proposal more effective is their effort to onboard Phil. One of the tools developer of the various products in the Catalyst AIM. One such product, as I previously mention, its functional intent is identical with the solution of this proposal. I assume this collaboration would be the perfect partner to invigorate that specific product of Catalyst AIM.\n\nTheir extensive combined experience translate into beautiful numeric metrics, perhaps this is a developer thing. Whether that be their \"Roadmap\", they have a clear timeline. Whether that be their \"KPI's\" are not vague and are numeric targets. Having numerical target act as a guideline to gauge their achievement from one milestone to another. It acts as a side note to the team whether they are on target or falling behind. Will not lie, this is a proper KPI and roadmap. Though this does not translate into their budget layout. It's as if another person was in charge of the budget. Especially since it involves developers, there should be some form of scrum system. What their doing might seem simple, as their budget portrays, but I guarantee it is far from that. So again, it confuses why would the team report their budget as is. It only invites critiques that should not even be allowed to happen. ", "q1r": 5, "q2": "Again it bit confuses me. It's like this proposal was made by two different individuals and in two different instances. I assume there would be the use of GitHub to assist the community in tracking their process. They instead choose to use Google Drive and Meet-Ups to be their report repositories, which entails a doc and video format. Which is all good but would have been great if they were to be more explicit on their reporting methods. Besides that, all the data provided are well thought out, of those that are not though out, does not totally hinder in auditing the proposers effort. Just wish they could have done more in terms of progress transparency, especially since there is a developer amongst them.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Phase 2 of a platform that matches between funded proposals’ needs and member expertise.", "experience": "Alex, Yoram & Phil are active community members, CAs, vCAs, Plutus Pioneer, Atala Prism Pioneer & successful proposers, participating in several initiatives and communities to make Catalyst better for all."}