{"id": 400367, "author": "gilvania", "title": "Evangelizing Catalyst to Academics", "url": "https://cardano.ideascale.com/a/dtd/400367-48088", "category": 26450, "amount": 8500, "description": "Professors, researchers, and students in Academia need to hear about Catalyst, and learn how to submit proposals and become an active member", "funded": 0, "upvotes": 18090503, "downvotes": 14166608, "votes_result": 3923895, "votes_cast": 88, "f6_no_assessments": 12, "f6_rating": 3.805555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 453, "q0": "It addresses the challenge well, in that it aims to onboard new people to Catalyst, as proposers, CAs and voters. By focusing on academics and students, who are assumed to be skilled, or at least able to learn the necessary skills, it addresses the challenge aim of increasing the \"availability of quality challenge teams, proposers, advisors, mentors and voters\". My only minor doubt is whether the proposed meetings really will engage people meaningfully, as the challenge setting hopes; or whether for most of them it will just be an interesting meeting that they attend and then take no further action.", "q0r": 4, "q1": "There are some elements of feasibility here that are unclear. Of course it is feasible for the proposer to attend academic conferences and organise meetings in her own academic field; but proposal  feasibility is more than this - it's also about whether the proposal's aim of onboarding attendees into Catalyst is likely to be achieved. This is somewhat difficult to assess, particularly without more information on what will be presented. Much of the effectiveness of this kind of engagement depends on the presenter's skills as a presenter, and we know nothing about this from the proposal - the proposer's LinkedIn doesn't particularly mention presenting or persuading skills or experience; and I'd also like to see some information about how the presentations will target the audience's specific interests. The timeplan has not identified how many conferences will be attended or how many meetings will be scheduled, over what time-period - I would like to at least see an idea of how long this proposal will run for. I would also like to see an estimate of what kinds of numbers might attend (in my field, it's not uncommon for side meetings at conferences, and meetings at universities, to be poorly attended - this might not be the case in physics and engineering, but it's not specified so I don't know); and/or a target of how many people might be reached and how many the proposer hopes to onboard. However, the budget is clear and well explained, and it's great that the proposer has considered, and budgeted for, creating materials that people can take away, and followup work with anyone who decides they want to know more. So on balance, given that the proposer is aiming to \"evangelise\" in her own milieu, and presumably knows how best to do that, I'm going to say that despite some reservations, the project is feasible.", "q1r": 4, "q2": "Auditability is very good, with several clear and measurable metrics, including one that actually addresses the ultimate aim of the proposal (numbers of new proposers, voters and CAs). I like that the project is quite simple, does not try to include too much, and measures things that are actually relevan", "q2r": 5, "assessor": "z_assessor_1157", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 697, "q0": "The proposer, a professor of physics with links in academia, proposes here to address academic conferences and meetings about the value of Cardano. As a physicist, I would assume her area of interest in blockchain is the scientific analogy:  scientific information in its essence is a large, dynamic body of information and data that is collaboratively created, altered, used and shared, which lends itself perfectly to the blockchain technology. But more broadly blockchain dovetails with the reality and logic of modern science, (especially the guarantee of trust in a trustless environment) -- it is international, decentralized-there is no governing body that decides everything -and it develops thanks to networks of trust within the academic community (peer review system and invisible colleges).  I would liked to have seen more specificity about the vector of description, whether it would be just a general understanding of crypto and Cardano, or if she desires to present more specific use cases like DLT for data trust, or DAOs for peer review governance.  Academia isn't known for rapid-fire ideation and development, but a Cardano use case developing out of a college or university has the potential to be a real draw.  Where this proposal shines most, in accordance with the challenge setting, is that academia runs on outside funding, so the ability to onboard research and projects to Catalyst, for a cohort that is already familiar with grant-writing, could have a multiplying effect.  However, there is reason for caution:  academics are already working on their own projects, as a general rule, and usually it is an outside intermediary that is able to bridge individual scientists to solutions to problems they face.  The target, then, is less likely to be academics as opposed to closely related fields in business (or students) who are able to listen to the academics and develop the solutions for the academics to adopt.", "q0r": 4, "q1": "It is hard to parse the budget when so few actual details of the project have been outlined.  Outside of presenting Catalyst as an opportunity for funding, there aren't any descriptions of the content expected from the presentations, and we have know way of gauging the proposer's knowledge or experience with Cardano.  The timeline doesn't suggest how many presentations might fit under this proposal, but rather suggests 2 possible venues and ideas for other types of venues that could be approached.  I know for conferences there can be highly competitive standards for speaking, including strict peer review, so there is significant risk that any conferences listed, unless evidence is provided to the contrary, will not be feasible.  However, some of the suggested venues seemed more like formal and informal meetings, where anyone can speak, sometimes after paying a fee.  The likelihood of being able to recruit Catalyst proposers, on this budget, from the academic cohort would be improved by 1) specifying the number, times and qualities of the meetings to be presented at, and 2) develop a more specific approach, with use cases to present to different disciplines, along with who the participants could approach to collaborate on Catalyst funding and development of blockchain tech for their sector.", "q1r": 3, "q2": "All of the KPIs suggested by the proposer are excellent except for one thing:  none of the numbers matter if we don't know how many were being targeted in the first place.  The number of conferences/meetings should be stipulated in the proposal so that progress towards the goal can be measured, otherwise funding locks up.  Similarly, it is a good idea to make an educated guess about (or better, establish a solid reasoning for) the number of participants expected to be approached, and expected to be onboarded.  These numbers help the voters to estimate the impact of their votes.  The KPIs are well identified, but more work needs to be done to pin them down and define their range.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1211, "q0": "The proposer wants to present Catalyst in scientific and academic meetings and events to professors, researchers and students in academia who need to hear about Catalyst. \nThe impact is to grow the number of high quality projects. It is stated that the proposal aims to disseminate the catalyst in scientific meetings and events in Brazil where the academia community will have the opportunity to learn how to submit proposals at catalyst and how to become an active member of the ecosystem. They will also get to know about the importance of blockchain and Cardano. \nTo address the challenge the catalyst project will be presented to the professors and students at events organized by the Physics professors. So the number of qualified people participating in the catalyst system will increase in the different levels of collaboration as Voters, advisors and proposers. \nThe proposer writes that the risk is minimal since the professors will attend scientific meetings and conferences. My rating is 4 because of the detailed meaningful information provided.", "q0r": 4, "q1": "The proposer writes that they will schedule scientific meetings in Universities and Research Centers. The proposers will search for scientific conferences,  mentioned that example of events and conferences with a great number of attendees are Campus Party Brazil, Congress of Engineering Education, among others. \nThe budget breakdown is detailed showing costs of conferences and events registration fees, travel and accommodation costs, work hours payment for speakers, etc. The total budget of $8500 is good. All the information will help successful implementation of the project so I rated 4 for this section.", "q1r": 4, "q2": "The information provided for auditing are the number of presentations in scientific meetings and conferences, the number of attendees to the talks, number of people who shared contact to be added for getting into catalyst, etc. \nSuccess in the project will be measured by the attending scientific meetings, craeting post -meeting connections with the academic people to discuss proposing projects in catalyst, and engaging academic people to the catalyst ecosystem to become voters, community advisors and proposers.\nThe information provided is sufficient for auditing the proposal. \nInformation as to whether it is a new proposal or a continuation is not given, and the SDG rating is also not chosen. I recommend to the proposer to add these information in their next proposal because they make more meaning to the project for future reference and sustainability.\nOverall, it is a useful proposal which can impact positively in the academia and students body. ", "q2r": 4, "assessor": "z_assessor_1315", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2742, "q0": "The proposal, as written, addresses the challenge by educating potential new participants in Project Catalyst at scientific meetings in Brazil.  The proposal will also create general awareness of the Cardano blockchain as a platform that can foster innovation in the scientific community.  Increasing participation in the Cardano ecosystem would benefit the community as a whole.", "q0r": 4, "q1": "The proposer has advanced education and is likely capable of creating quality presentations to present at scientific meetings.  Her experience in STEM education should provide a solid background to present the technical information of blockchain in general and Cardano specifically and her relationship with her audience as a peer should create trust.  I think it is likely the proposer and her potential team can implement this plan.  I would  have liked to see potential outlines of the material to be covered to better understand the content and how it may relate to the potential conferences.", "q1r": 4, "q2": "The proposer can report on meetings attended and attendance at the lectures to give some objective data on the success of the proposal.  It would be difficult to quantify post-presentation connections and potential new users without some formal method of data collection or survey.  This type of proposal, while potentially very beneficial, is difficult to quantify in a data set, but does have a few items that can be audited by the community.", "q2r": 4, "assessor": "z_assessor_1574", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3526, "q0": "The project fits the challenge well by introducing Catalyst to a well-defined target audience. By focusing on presenting Project Catalyst to qualified people,not only could the project attract new members to the community, but also attract qualified members.\nI wish there were more information on where the meetings would take place, for example: would it be private or public universities? Are the specific challenges of each of these being considered? I would also like to know if there are already any universities or institutions already mapped out. This previous study would help understand if there is a public willing to attend the meetings and if there are universities willing to host the events.", "q0r": 5, "q1": "It doesn't seem like a costly project, which is good, as it can have a big return with minimal investment. The budget is very reasonable. I would have liked a more detailed roadmap and a marketing strategy/communication plan to promote the events.\nThe project's found seems well equipped for the task and it seems like she is already inserted in the field, which might facilitate the entry in the universities and conferences", "q1r": 4, "q2": "The metrics are aligned with the project's objective. However I am not sure how ithe \"number of the new proposal, voters, and advisors\" as a result of this project would be measured.", "q2r": 4, "assessor": "z_assessor_1659", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5791, "q0": "Gilvânia wants to considerably increase the quality of the proposals presented in Catalyst in the next funds. Due to its long, meritorious and verifiable professional experience that includes the best universities in the world, Gilvânia (the proposer) has the necessary contacts and arrival to execute this proposal perfectly aligned with the Challenge (it simultaneously complies with the 12 parameters of the Challenge and in your best way, offering us quality)\n\nFor less than 1/20 of the funds available for this campaign we will obtain in return a direct contact with the professional academic circle of Brazil through conferences and meetings to attract and increase the number of qualified people in Catalyst participating in high-quality projects for the next Funds.\n\nThis is exactly what is sought for the success of Catalyst, the availability of quality challenge teams, proposers, advisors, mentors and voters (as expressed in the Campaign in a more datailed way).\n\nOne of the best proposals in this campaign. My note is a 5 in Impact.", "q0r": 5, "q1": "A well-defined budget breakdown and taking into account the dynamics of the presenters and their different topics, along with the way the public participates and interacts. In total, 8,500 USD is requested, an amount according to what will be done. In general, everything is well cared for and in order, my grade in Feasibility is a 4.", "q1r": 4, "q2": "Being quantifiable the number of presentations, academic presenters, (correlation of the people who assisted with the creation and direct participation), each section can be easily audited. In the event of possible irregularities, it is easy to contact educational entities and request information. Given the respect that the proposer earned, the correct thing is to think that each section will be well executed and we will obtain the desired outcome.\n\nMy note in Auditability is a 5.", "q2r": 5, "assessor": "z_assessor_277", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6291, "q0": "The proposal can have an impact by presenting Cardano in academic conferences and can contribute to the challenge. However, as it is going to be applied in a specific niche, the proposer could bring more convincing information about how she can successfully access the academic conferences and talk about Cardano in them. Also, information such as a roadmap, possible risks, or number of conferences could improve it as well. ", "q0r": 3, "q1": "The proposer gave enough evidence of her insertion in the academic field, but gave no information regarding experience with blockchain and, in especial, Cardano or Catalyst.\n\nMore risks could be considered. For example, if the proposer finds no or scarce opportunities to introduce the topic among academics, as their conferences and academic meetings are made to discuss other topics than blockchain and Cardano. For example, how can exist good entry points in the events attended by physics professors to talk about physics? ", "q1r": 3, "q2": "There's no roadmap with a timeline in the proposal, in a way that it's open to subjectivity about the milestones and deliverables.\nIn addition, there's no information about the number of conferences that the proposer expect to attend, neither a projection about which ones will accept the proposer as a presenter in the topic of Blockchain.\n\nThe budget lacks detailing, as it does not say which conferences and for how long the proposal will be working in the project. \nBringing more concrete terms, milestones, and timeline would improve greatly the ability to the community to audit the proposal.", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6319, "q0": "The proposal group raises the problem that professors, researchers, students at Academies do not know Catalyst, do not know how to submit proposals as well as CA members. To solve this, the proposed solution will present Catalyst in meetings, scientific and academic events to promote their active participation in the ecosystem. This proposal will be implemented in Brazil. Presentation of the Catalyst ecosystem in scientific meetings and events is done by Physics professors. The meeting's audience comprises undergrad students, masters, doctors, and professors in Engineering and Natural Sciences. They are highly educated people so good for Catalyst and Blockchain Cardano. I am a person working in the Academy of Vietnam, I find this proposal very practical and can attract a large number of scientists to participate in Catalyst.", "q0r": 5, "q1": "- The plan of the proposal has not been made clear. But the strategic proposed team is the presenters, who will schedule scientific meetings at universities and research centers. At these meetings, they will present Catalist, the importance of Blockchain and Cardano. In addition, professors will look for science conferences in STEM (Science, Technology, Engineering, and Mathematics). The proposed group also proposes a number of events and conferences with many attendees that can include content about Catalyst, such as: Campus Party Brazil, Congress of Engineering Education (COBENGE), Workshops at Universities and Research centers, Scientific meetings in Universities.\n- The given project budget includes main items with corresponding amounts. The total cost is $8,500.\n- The proposed team has one member, Gilvania Vilela, with experience in solid-state physics, computers and data analysis. She has experience in education for the STEM sciences. She is a researcher in spintronics and has worked in collaboration with the Massachusetts Institute of Technology in Cambridge, USA, since 2017. She has a clear and testable linkedin. Professors and Bachelors in science will be invited to compose the team. I assess the proposal can be successful when funded and should detail the budget section.\n", "q1r": 4, "q2": "The project has given indicators to measure clearly such as: Number of presentations, number of people attending seminars, number of people who have shared their contact address for advice to participate in Catalyst, especially increase the number of proposals, CAs and voters. These metrics are completely measurable, but commitment data that the project will gain have not been released by the proposed team. The team should clearly define this number for the project to be successful.", "q2r": 4, "assessor": "z_assessor_395", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7618, "q0": "Introducing project Catalyst to the academic community is a thoughtful proposal as it will facilitate innovation by onboarding intellectuals and thinkers in Catalyst. Although the initial idea behind this proposal looks good it lacks some reasoning why Academics need to hear about Catalyst and show interest to it. In other words, the problem statement is not so well defined although the proposal actually addresses the challenge. Additionally, the proposed solution does not explain how it will persuade Academics to join the Catalyst community so they become active members. By just performing a few presentations and explaining the proposal, assessment and voting process does not also mean that the community will grow. Adding some further actions like participating in live Townhall sessions and breakout rooms and demonstrating the benefits in return may be worth mentioned in the proposal. It is highly recommended to showcase the drivers that will attract scientists in Catalyst.\nI tend to be neutral that this proposal effectively addresses the challenge so I mark it with a score of 3.", "q0r": 3, "q1": "The proposer is currently a Professor in a University so her role will give her access to the academic community to perform the required presentations. However, it is not stated anywhere her experience in blockchain technology and more specific her involvement in project Catalyst. It would be also good to know her competencies as a lecturer or presenter. Also it is not clear how many persons will work in the team during the execution phase and what each role will do. The only information is that some Professors and BSc degree holders will be invited to the team.\n\nThere is an attempt in the proposal to break the budget into meaningful items but it misses a timeline and planning. Therefore it is not clear how many presentations sessions will be performed, how many people are expected to participate, what are the extra facilities required for the presentation and how long each presentation will last. It would be beneficial to have such a draft typical detailed schedule.\n\nThe proposer does not foresee any risks during execution, only unidentified minimal risks are referred . However, the risk of not persuading Academics to join project Catalyst is likely to happen. Identifying this risk and providing some mitigation actions would ensure a more successful outcome.\nBased on the above explanation I disagree that that this proposal will be implemented successfully. \n", "q1r": 2, "q2": "Contrary to the feasibility, the proposal provides much better information to audit its progress. Measuring the success of the project looks tangible and sensible. The point it looks unclear to me is the means to track the progress. For example, how the new members joining the Catalyst community will be measured? How the distribution of each role will be measured? \nI agree that the progress of the project is auditable.", "q2r": 4, "assessor": "z_assessor_614", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7678, "q0": "The credentials of this proposer and their social circle is something that we should explore. I do remember this proposal and still am a strong supporter of this proposer. What we should consider with this proposer is their access to \"distribution channels\" in the form of their academic colleagues. Having leaders in the academic community that supports Cardano, will provide us with an endless supply of future talent, future proposers, future CA's and vCA's and etc. The keyword here is endless. Every year, we will have a crop of students to influence to build on Cardano. This proposer potentially can open this channel, which indirectly means they meet all the key metrics of this Challenge.\n\nIf by working with an academic, the results pan out as I expected, we should highly consider duplicating this proposers effort into other various connecting regions, including the existing connections this proposer has made. And then we build from that, continuously connecting Cardano with all the top universities world wide. By doing so, we might even be able to leverage the use of Atala PRISM as the go to tech for student identity.", "q0r": 4, "q1": "Given the credentials provided by the proposer and comparing it to what they seek to deliver, which is educating the proposers colleagues on Cardano, in that sense the proposer will indeed achieve what they intend to.\n\nThough the budget asked, goes more towards supporting the proposers action as some form of brand ambassador, the numbers are low enough to justify taking a risk with this proposer.\n\nAlthough the proposer identify themselves as a low risk investment, the presented plan, timeline and numerical target wise is vague. Categorizing this proposer higher than low. The duration of this budget is unclear, the number of events this person seeks to attend is also unclear.", "q1r": 4, "q2": "There are many elements of this proposal that makes auditing it quite challenging. They seek to provide numerous targets without metrics. How can we gauge that? Would we accept only one person was onboarded to Catalyst from this proposer's networking and education solution? At the very least, one would expect the planned number of events the proposer seeks to attend. Which should be easy enough, is unfortunately not provided. Requesting documentation of the proposer as a speaker would be a challenge since this is an individual effort. It would take an enormous effort from the proposer to provide the community with their progress reports making it unlikely we will be getting sufficient data on their achievements and progress.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9087, "q0": "Cardano particularities and the blockchain in regular academic conversation is important to diversify the information and adoption processes in society.  Having professors and research assistance onboarding is a great milestone to measure success. It also means student will directly and indirectly benefit from the process thereby growing the blockchain ecosystem. \n\nThe proposal is fully aligned to the challenge with a well defined target group.", "q0r": 5, "q1": "The lead team member  is experienced and resourceful to ensure a successful implementation of the deliverables. Being part of academia gives the leverage to create a niche for cardano and this is an advantage to start academic conversation on cardano blockchain opportunities.\n\nThe budget breakdown is simple and requested amount is also reasonable. \n\nHowever, the deliverables have no clear timelines and that should be looked at, to ensure a successful proposal execution. ", "q1r": 4, "q2": "There are clear KPI but none of them is having projections. The metrics should X values of numbers projecting how the successful outcomes of the project would like. This will make auditing more easier for the community. \n\nThere should be a sustainability framework to guide and ensure the project stay relevant over a period of time. ", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10124, "q0": "Actively participating in workshops and events and presenting about the Cardano system is a good way to reach out more to academia. This is a viable and effective idea because academia will include people with the vision, beliefs, and knowledge to participate in the community and contribute to the community new ideas and quality projects. This is a traditional method, but its effectiveness can be trusted. However, since the method to evangelizing is not online, it can be just reach out to a limited quantity of people.", "q0r": 4, "q1": "The team members are all academics with relevant knowledge and experience, which will help them to present properly at conferences and events so as to attract the new commers to Cardano. However, the plan is still too general that make it lacks of assurance about how they will conduct their suggestion. For example, they can make it clearer by adding some details related to the conference or events that they will attend, and some information about their presentation in these events.", "q1r": 3, "q2": "The proposal need to be more details: it should includes the roadmap which stages and activities, key metrics in each stage. For example, they should set specific goal for these: \n\"Number of presentations in Scientific Meetings and Conferences.\nNumber of attendees to the talks.\nNumber of people who shared contact to be advised for getting into Catalyst.\nNumber of solid connections after the meetings for discussing about Catalyst.\nNumber of the new proposal, voters, and advisors.\" Plus, it hard to know who in new proposal, voters, and advisors is attracted from their activities. It's also hard to measure how many solid connections after the meetings for discussing about Catalyst. However, since the idea is simple, we might see how they conduct successfully by their records or renown.   ", "q2r": 2, "assessor": "z_assessor_809", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will present the Catalyst in scientific and academic meetings and events which will ignite their active engagement in the ecosystem.", "experience": "Gilvania has Ph.D. in Physics and is an Associate Professor at an Engineering College with 14 years of experience. She researches in collaboration with MIT, USA, since 2017, and has attended and presented many scientific works in meetings and conferences across Brazil and USA."}