{"id": 400597, "author": "fractalfuzion", "title": "Free CNFT Giveaway Bonanza - Get In", "url": "https://cardano.ideascale.com/a/dtd/400597-48088", "category": 26450, "amount": 10000, "description": "Cardano needs to onboard new users to the platform. The best way to achieve this is through a Giant CNFT giveaway bonanza. its Free CNFTs!", "f6_no_assessments": 6, "f6_rating": 2.2777777777777777, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal doesn’t address the challenge effectively. Giving away CNFTs might marginally increase some people's general awareness of Cardano, but the focus of this challenge is onboarding into *Catalyst*, not just Cardano. A free NFT will not onboard anyone meaningfully as proposers, CAs, or voters, which is what this challenge is meant to address. ", "q0r": 2, "q1": "The proposal has some positives on feasibility: the budget is reasonable, and the timeline is achievable in the sense that yes, it is possible to give away 20 NFTs a day for 4 months. But the problem is that the proposal is muddled on who it is aiming to give the CNFTs to. The proposal states \"people love free nft's and will definitely open a wallet if offered free stuff\" which suggests that it's aiming at people who don't have an ADA wallet yet; but on the other hand, it talks about hunting down \"new users\". But - new users of what?  If they are new to having a Cardano wallet, but they do actually have one, then this project won't onboard them any further than that anyway, so it wouldn't really achieve anything; and if they don't have an ADA wallet yet, then what are they a \"new user\" of, and how will the proposer find them? I feel unsure that the proposer will be able to give away enough NFT's to the people he says he's aiming at - those who do not yet have an ADA wallet - and that not many people would actually be \"onboarded\" in any sense. What I generally see is that if someone doesn't already have the relevant wallet, then they would say \"no thanks\" if approached. Obviously the proposer does not agree - but for me to think the project was feasible, I'd want to see some evidence or reason for the proposer's thinking on this point - even if it was only some anecdotal material, some Twitter comments from another CNFT giveaway where people have created their first ADA wallet in order to get a free CNFT. The risk-assessment is also poor - simply asserting \"this is a good idea\" and \"nothing can stop us\" doesn't sound like the proposer knows how to manage risk, or how to run a project, so this further damages how feasible the proposal looks. ", "q1r": 2, "q2": "Some of the proposal's activities can be tracked; but unfortunately, tracking them will not help us audit whether the project has succeeded. The transfer of CNFTs is intrinsically trackable, and it is of course good that a separate wallet will be used to make tracking possible; also social media engagement is trackable. But since the whole point of the proposal, and in fact the challenge, is to onboard new users, the proposal needs to find a way to track whether or not any new users are onboarded. It would be difficult to track whether anyone went on to become a CA or even go to a Town Hall as a direct result of this proposal; but I would at least like to see some process in place to track whether the people receiving a free CNFT are actually being onboarded into Cardano - i.e. whether they didn't already have an ADA wallet before, and created one for the first time because of this giveaway. Without this, the success or otherwise of the project is not auditable", "q2r": 2, "assessor": "z_assessor_1157", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Unfortunately this proposer appears to have also mistook this challenge setting as a call to onboard new members to Cardano, when it is actually a call for improvements to the Catalyst onboarding protocols.  Frankly, this has kind of been a thing (and I personally am not significantly penalizing proposers who are presenting good general onboarding ideas in this category, as a new Cardano member has a better shot than most in also becoming a new Catalyst member, no?).  Having said that, despite this proposal being framed as way to onboard new members with free NFT drops, there really isn't any explanation of the hows...  In particular, how do you know the NFT has been claimed by a new member?  I know of no tech solution that could isolate one wallet from another in that way (praise be) and the kind of KYC required to matriculate a new member through an old-school Web2 solution would never be a consideraion for this proposer (and rightly so).  While I would think a trust based model would work, or maybe some kind of verified whitelist (neither would be perfect, but as a fun community event, maybe), but you always kind of end up in the same place...not really sure what you just accomplished.  Running some kind of DAO for this is beyond the scope of the proposal, so what is to be done?  My suggestion would be for this experienced NFT dropper to partner with a Catalyst onboarding project, and figure out how to make an NFT drop to symbolize not only fresh interest in the chain, but perhaps a proof of having read the CA guide, or having been awarded for an excellent assessment on their first try, or something like that.  Bridge this proposal to the challenge setting and connect it provably to new members, and I'm in.", "q0r": 3, "q1": "No doubt Fractal Fuzion can run an NFT drop, but as discussed above that isn't really the issue when it comes to implementing this idea.  No part of the provided timeline identifies a process or protocol for identifying and onboarding a new member.  There is no allotment in the budget for technology or partnerships or consultancy that might relate to new members.  In fact, the included budget aims to acquire \"highly desirable popular Cardano NFTs\" which increases the likelihood that someone may try to game the process to acquire one.  All the actionable tasks included relate only to the acquisition, creation and distribution of the NFTs.  The 40 hrs estimated to distribute the NFTs is probably where the \"secret sauce\" of determining who is a new member and who isn't is, but again, there really needs to be an explicit protocol defined here, since it is critical to the purpose of the drop.  I like the confidence of the proposer, and would like to see it applied to helping with a partnership to strengthen a proposal that is looking for an onboarding incentive to go with their protocol.", "q1r": 2, "q2": "There is a need here for some kind of measurement or metric that can show how many new users were onboarded.  The proposer suggests tracking it with distro from a wallet, but, again, how do we know the addresses are new users?  If this were an NFT drop running alongside a protocol such as rewarding first time funded proposers with an artwork badge, the types of relevant KPIs that might apply would be the percentage of onboarded vs awarded, or the ability to tie it to a mentorship pyramid, with a royalty token, where funded proposers could sell it on to others who could award it anew and keep the cycle going while rewarding the original mentors at each step.  Would be an interesting way to make a map of the influence of mentorship as well...  Outside of the token drop, there doesn't seem to be a plan here to track and present this project for auditing purposes.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "While the proposal’s problem statement is not quite aligned with the objectives of the challenge, its ultimate objective,  “to onboard new users to the platform” is in harmony with one of the guiding questions: How might we increase awareness of Project Catalyst as the most active open innovation platform?  A close look at the challenge will reveal that it intends to specifically grow Project Catalyst vs. grow the number of participants in the Cardano ecosystem.  This proposal, as written, appears to seek to onboard new users to Cardano through the distribution of CNFTs.   Ultimately, it’s not difficult to see how a line can be drawn between the two, as new Cardano holders may eventually be exposed to Project Catalyst.  But the two are not automatically correlated.  The proposal could be improved by showing how it could help grow Project Catalyst specifically, which wouldn’t be hard to do.  The proposal needs only to make the jump between “ the incentive to get a wallet and learn how Cardano works” to a way to move the needle in one or more of the KPIs in the General onboarding and Innovation processes metrics of the challenge.  A little more creative thought about how to do this with the CNFT distribution would be an improvement.", "q0r": 4, "q1": "The team, as described, is composed of a single individual with experience in CNFTs and stake pool operations.  They also have experience as a Cardano community advisor and are an active member of the Cardano community.  These qualifications support the proposal, but I would encourage them to improve this by listing some achievements they have made in the space and how large of an audience they have.  While they have listed awards, it's unclear what these are and why they matter.  A little more detail would go a long way.  They could also indicate the number of NFTs that they have sold; this data is displayed on the Tokhun.io website.  Also, show the size of the audience they can reach—their Twitter following for example.\n\nAs to the specifics of the plan, it's not hard to see how the distribution of free CNFTs could grow the user base, but a little more clarity as to who would be targeted and how would help improve the proposal.  The statement “I will systematically hunt down new users and onboard them by offering free CNFT” should be accompanied by a plan of how specifically this would be accomplished.  Who are the prominent community members that distribution will be delegated to?  It would help to list who the determined Cardano trailblazers are and formalize their association to the team.  The statement “ This is a good idea and is likely to succeed” would hold more weight if it was accompanied by more specific timelines and metrics.  And also, give a little more thought as to the challenges or risks you face and how you will overcome them.\n\nThe budget indicates what the funds will be used for, but the reader has to refer to other sections of the proposal to see the number of CNFTs that would be purchased\n", "q1r": 4, "q2": "The proposal indicates how CNFTs will be tracked through a dedicated wallet and details how a policy ID can be used to see how many exist and how many wallets they are split between.  The proposal also indicates specific metrics for engagement to be tracked.  Success is measured as 2500 new users to the Cardano ecosystem", "q2r": 4, "assessor": "z_assessor_1375", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Campaign goals were misunderstood by the proposer. Campaign aims to onboard new Catalyst members to help them contribute in a fulfilling way, not to attract new members into Cardano ecosystem. Although that is an important goal as well, it is not under the scope of current campaign. ", "q0r": 1, "q1": "Budget is detailed, milestones and timeframe set. Plan covers the purchasing/creating part of the proposal but leaves out how people outside of Cardano ecosystem would be targeted with a promise of free cNFT and how potential abuse would be prevented which is a very big concern. Executing an airdrop based on off-chain data has a high chance of simply inviting bots and other types of abuses. Mechanisms explaining abuse prevention should be discussed as distribution is a significant part of the project.\n", "q1r": 2, "q2": "Milestones are set and auditability of the process should not be an issue. However, trying to figure out if cNFTs ended up in actual new users hands and not wallets created by malicious parties would be near impossible with the details provided. Hence, there would be no way of telling if a project was a success. ", "q2r": 1, "assessor": "z_assessor_1460", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The idea is to distribute CNFTs for free, according to the proponent, this will attract new members to the Cardano ecosystem, as according to them people love to receive free stuff and will open a digital wallet for that. I disagree that this is a good way to attract active members to the Cardano ecosystem, and I will do a comparison to explain my point of view. When people open online stores on Instagram, for example, they often hold sweepstakes to attract new followers. These people who participate in the sweepstakes will certainly follow the profile and rules that have been established so that participation can be valid. However, right after the draw, winning or losing, people tend to unfollow that profile, because the interest was never in the content/products advertised there, but in obtaining a certain product or service for free. I think this thought makes sense for this very case. People can even open their digital wallets, but in my opinion they would only be interested in making a profit, or they would sell the CNFTs received at the same time, or at most they would wait for them to appreciate, in order to profit even more. The chances of these people getting really involved with Cardano, that is, studying our blockchain, its features and advantages, buying and delegating Ada, participating in Catalyst, seeking to invest in ecosystem Dapps and using its technologies in practice, would be minimal. It is much more likely that they just want to make a profit and have no further interest in understanding and delving deeper into Cardano. So I don't think this is a smart way to attract active members (emphasis here!) to our community, it will most likely attract those looking for quick and easy profit. \n", "q0r": 1, "q1": "No roadmap is attached to the proposal. What is said about the development process is that “The team members and I will systematically hunt for new users and onboard them by offering free CNFT”. But how would that be done? We know that the whole process would take 4 months, but we have no idea 1) where the proponent and their working partners would go to look for these people 2) what criteria would be used to select who would receive the CNFTs 3) how follow-up would be done of the selected people, in order to understand how they would be using the benefit that was granted to them and if they are somehow integrating the Cardano ecosystem. So, in relation to the roadmap, I think the proposal doesn't make it clear how this process would be done, what is passed is just an idea of ​​what would be worked on after the funding, without a detail that allows the proposal's readers to visualize in a way solid work to come. Regarding the budget, all the money that is requested would be used in two parts: purchase of the CNFTs and time spent by the proponent when he was dedicated to this work. I think the monetary explanation is not good, for example these two parts: “$3750 = Buy highly desirable popular Cardano NFTs to include in Giveaway / $1000 = to make and purchase additional CNFTs to be given away in the initial 2500”. There is not a considerable difference between them, in my opinion, as one corresponds to the first CNFT purchases followed by later investment. I also think the asking price is quite high for something that is so poorly explained, so I also think that part of the proposal is inadequate. Regarding the analysis of the team, it is not shown who the members of this team are, we do not know the basic information that says about them. For this part to be adequate, it would be necessary for us to know the full names of all those involved, what their areas of professional training, what their previous experiences were (and that this was proven through, for example, a linkedin profile) and in what way they relate to the Cardano ecosystem. Without such information, it is really impossible to trust a team that we do not know. So, unfortunately, I think all parts of this proposal deserved a revamp, both the script and the budget explanation and team presentation. As it is presented to us, the feasibility of the project is very low. \n", "q1r": 1, "q2": "The project is not auditable because at no time does the proponent indicate how he will perceive if the project has indeed positively impacted the Cardano ecosystem. He says that “I can have a dedicated wallet that will track how many CNFTz have been donated”, which would be a way for us to understand where the CNFTs used in the project ended up, but it is not a concrete way for us to assess the development as a whole. As the project would last 4 months, the proponent should, at the end of each month, inform the Cardano community what progress he made in that period of time, which includes understanding how many people he donated the CNFTs to and also how these people were selected. Such information must arrive in a simple and accessible way to the members of our ecosystem, so that we can follow all updates. As the information is very succinct, I think it would be interesting to create an online document (it could be through google docs) in which all people with the link could have access. The tenderer could post all monthly information there. And in relation to the final results, it is necessary for us to understand if in fact the main objective of this project was achieved, which would be precisely to understand if new members were added to the Cardano community and how these people would be relating to our blockchain. In my view, the most appropriate way to do this is through a direct survey with those involved in the project: everyone who received the CNFTs should, after some time spent in the project, answer some questions such as: “how are you relating to the project? with Cardano? Did you research more on the subject? Invested in Ada? Have you acquired other CNFTs?” and etc. In this way, we could understand whether the people in question really became active members or were just looking to profit from the situation. If they don't answer the form, which is a possibility, we can consider this, that their positioning was only to sell to momentarily profit from the thing and they didn't actually become active members of the community. So I think the proposer doesn't give us good ways to audit the proposal, the suggestions I made could do that role, but this information should have been provided directly by the author of the proposal. \n\n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Although very exciting, this proposal does not align with any the key metrics of this Challenge. It seems the proposer was to spirited and did not have a good read of this Challenge and soleyl focused on the name, which is; New Member Onboarding. To assist the proposer, a number of key metrics that this Challenge seeks are; attendance in Town Halls, attendance in Swarm Sessions, weekly sign ups into Project Catalyst, increase the number of CA's and etc.\n\nThe proposer's idea do have merit to it, though it should be paired with the key metrics. For instance; \"For those who are active as a CA and vCA, there will be free CNFT's!\" or \"For those who mentors proposers to submit top quality proposals will get free CNFT's! and etc. Please do comeback in the next Fund. Cause we do need some giveaways that entices engagements, but of course in a way that ties in with the Challenge's key metrics.", "q0r": 1, "q1": "Other than the misunderstanding of the key metrics of this proposal, the proposers actually has given a lot of consideration into their action plan. Seeing that they themselves seems to be practitioners of these type of events that are giving away merchandises/NFTs, given the budget asked, they would indeed be able to distribute NFT's for free/as planned. Just wish it was tied into some of the key metrics.\n\nWhat's great about the proposer are that they actually also provide enough background on who they are. Making it easy to gauge their chances of implementing this giveaway highly probable.", "q1r": 4, "q2": "They actually did provide adequate metrics that can be measured. And they even took time to explain in detail how the CNFT will be tracked. What let them down in this section is that the proposer mentions the following, \"The project will document number of posts, likes, comments, video views, to track engagement and will make all data available to the public with full transparency.\"\n\nThis would entail that there are other action plans that have not explained or accounted for at all in the proposal. Such as social media tracking or management and content creation. All would have assisted in making this proposal more aligned with the Challenge's key metrics.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "This proposal will distribute free CNFTz using a variety of distribution methods, creating excitement to onboard new users to Cardano.", "experience": "I understand what needs to be done. Fractal Fuzion is a CNFT creator, stake pool operator, Shill-A-mania champion, Cardano Stonerz club OG, Tokhun premium partner artist, Tokhun Ambassador, active Cardano community member, Catalyst community advisor, 2500 club member."}