{"id": 400533, "author": "ldjatsa", "title": "French West Africa Outreach", "url": "https://cardano.ideascale.com/a/dtd/400533-48088", "category": 26450, "amount": 6000, "description": "There is no Cardano community in the French West Africa. People lack awareness of the blockchain solutions. Cardano could gain more grounds.", "f6_no_assessments": 11, "f6_rating": 4.2727272727272725, "videos": [], "media": [], "f6_assessments": [{"id": 391, "q0": "We realized that all the concepts of the project in question fit well with the goals of this challenge, since the main objective of the workshops that will be held in Africa is to promote knowledge about Cardano in a region with potential for growth, but with a language barrier. With the success of these events, we have the direct impact of local people learning more about Cardano's technologies and the indirect impact coming from these people's contact with other French speakers. Also, given the descriptions of what will be accomplished, we realize that the requested amount of $6,000 is doable.", "q0r": 5, "q1": "We see that the project's feasibility is quite convincing despite the fact that there is not a very complex plan behind the actions, which is normal given that the focus is on conducting face-to-face and online workshops focused on two main locations. In this way, the great differential would be the background of the creators of the project. In this regard, we see a previous experience on the part of professionals involved in promoting events that belong exactly to this niche, that is, the exhibition of Cardano materials for French speakers.\n\nIn addition, the number of events to be held has already been defined in advance, as well as the subjects that will be addressed in these events. Regarding the details of the budget, the amount spent on the organizers of the events and on logistics seems to be consistent, but it is worth noting that it would also be interesting to establish a cost in relation to the marketing of the project. It would also be nice if the CVs of the professionals involved in the project were made available.", "q1r": 4, "q2": "The metrics established to understand the success of the proposal are also very clear and direct. We know that the objective of the project is to generate engagement around Cardano, by disseminating knowledge about its ecosystem, and here exactly the consequence of this dissemination is measured. For this, it was established how many new members are planned to reach in the first and second quarters, in addition to a monthly average of new active members. Additionally, it seems aggregating if, after the event, the organizers asked the participants if other French-speaking people, but not necessarily residents of the target regions of the project, also contacted them to ask about the event. This would be another way of mapping the scope of the project.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 705, "q0": "This proposal intends to bridge a learning divide that is preventing French-speaking West African communities from adopting Cardano in meaningful ways.  If you search through twitter threads for influencers of Western Africa crypto adoption, you see a familiar paradigm:  price, price, price.  When Cardano is mentioned, it is FUD or worse, and the conversation only goes downhill from there.  The proposer seeks to continue their work to find a way across that divide and introduce the real crypto concepts that Cardano represents, and to measure their success by onboarding proposers, CAs and referrers into the Catalyst community.  The budget covers 6 months worth of outreach in the form of weekly workshops, both in person and virtual, across two cities in Western Africa (the cities have a combined population of over 3million), with a focus on how to participate via Catalyst in the Cardano blockchain, and on what that economic opportunity looks like.  ", "q0r": 4, "q1": "The team has the backing and experience of WADA behind them, so they have a good pool of resources and a solid knowledge base grounded in the fundamentals of Catalyst.  In addition, the team itself is both experienced in speaking knowledgably about Cardano and crypto, as a provided paper attests, and in holding workshops of this type, having already delivered 5 to the proposed region.  On that note, it would be nice to see the results and KPIs of those meetings.  They have included a presentation that shows a well organized workshop with well over half of it dedicated to the proposal process itself, along with plenty of advice and best practices for creating high quality proposals.  Again, knowing the results to date for any proposers they referred or influenced would probably be a feather in this team's cap, and it is unfortunate it hasn't been included here for easy access.  There is clear knowledge presented about the process and timeline that it needs to occur on, and the pace of delivery seems wisely considered:  four workshops per month gives plenty of time to gather participation, especially with a lot of the workshop content already well in hand, while the plan to move between the cities and between on and offline events gives lots of opportunities for different levels of participation with a real chance to onboard members over time, with regular, repeated exposure.  While they don't provide an estimate of the kind of particiaption levels they are targeting with the workshops, they do seek to be onboarding approximately 5 people to Catalyst on average from each workshop.  The budget is very economical, with the team betting on its experience delivering these workshops to keep all costs on track and the project sustained.  While I think this budget could have fairly asked for more, I applaud the proposers for pledging to do more with less.", "q1r": 5, "q2": "The provided timeline is easily auditable, with events occurring once a week, so progress reports on up to 4 events should be no problem to manage.  In addition to the included KPIs for onboarded member targets (100 over the course of the 6 months, on average, about 4-5/week), it would also be great just to track the total workshop participation and see if that increases or hold steady.  If the workshops have static limits, such as 10 participants, then perhaps the team could create a metric to track demand.  It would be interesting to see the ebbs and flows in this kind of demand to plan this type of outreach even better, and as communities begin to think of Catalyst Funding Cycles as growth cycles...a time to plant, a time to sow...  a time for outreach and onboarding, a time for mentoring.  Because of the connection to WADA, it is expected that the community will be kept abreast of the project, and that we will be alerted to any proposals resulting as the fruit of this grassroots work.  Good luck team!", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1770, "q0": "The team's proposal identified a problem of the challenge and had a large impact. They have proposed the idea of organizing weekly French-language events (including meet-ups and educational seminars) in person and online. This is a viable idea that any community can implement to grow their community. It solves the question: How do you disseminate Cardano platform value to people? In particular, this makes even more sense when in French West African countries that do not have Cardano communities, people lack awareness of blockchain solutions. Cardano can lay the groundwork for this problem. I'm excited to see the group's proposal come into practice, which will give the people here access to new technology, the Cardano community will also be expanded. \nAfter identifying the problem, they have solutions to solve the problem very simple but highly effective. They created Whatsaap and Telegram groups for members to discuss and stay in touch with each other. These are popular social applications so this tool is also close to each resident here, favorable for connecting and increasing the number of members. In addition, they have a very professional Youtube channel to share content about Cardano in French. With the above solutions, they aim to introduce the Cardano platform to new people, create a space for French-speaking Cardano members to socialize, discover competent people from the capital Ouagadougou and the city of Bobo Dioulasso in Burkina Faso, organize quality education seminar events,  introduce new members and submit proposals, and 12 events will be held in 6 months. The team's solution is clear, detailed, and the community has the ease of tracking and evaluating the results of their work when joining the community group they have created.\nI also empathize with the risks they have shown and I believe in their solution. The risks are identified in the proposal: many community participants think they urge people to invest in cryptocurrencies because most people here and I believe many parts of the world think blockchain technology is just a cryptocurrency investment and don't believe it has a huge practical application. Given this risk, there is no way to improve understanding of the field through the educational workshops they have given so that people have an accurate knowledge of the Blockchain industry, including the Cardano platform. \n* I rated: 5 points\n", "q0r": 5, "q1": "The team's proposal outlined the time to perform the work very reasonably and have detailed goals for each task. It offers to implement the project in 6 months and is divided into 2 phases. Specifically: 0-3 months of organizing 2 seminar events in Ouagadougou, 2 events in Bobo Diouolasso, and 2 online seminar events introducing the Cardano blockchain and its applicability, presenting financial opportunities, inspiring how to join Catalyst and start contributing; 3-6 months of 2 seminar events in Ouagadougou, 2 events in Bobo Diouolasso and 2 online seminar events on Cardano Blockchain, present financial opportunities, guide how to join Project Catalyst, and start contributing, supporting new Catalyst members as they interact with the community on Ideascale. These plans will be updated on Whatsaap and Telegram so that they can easily check and track the progress of the project.\nThe budget proposal of the $6000 group accounts for less than 20% of the global challenge budget, they already have a budget distribution for each job and department. Specifically allocate their budget: $2500 for event logistics, location costs, food, etc.; $3300 allocated to the salaries of local event organizers and workshop organizers; $ 200 - Ada give-away. However, I would like to see a more detailed budget distribution in each category so that everything is transparent, easier for the team to implement. In addition, to ensure the safety of the proposal during the implementation process, I want you to propose a contingency budget for economic instability, slippage, inflation ... It will be good for the team in the process.\nThe proposed group has two key members. They are competent, experienced, and reputable people capable of performing the work in the proposal successfully. They also introduced themselves in the proposal, however, I would like them to attach a personal account there to easily authenticate their identity. \n* I rated: 4 points\n", "q1r": 4, "q2": "In the proposal has provided indicators / KPIs measured and tested easily. Specifically, they provided a 6-month implementation plan with 2 phases, every 3 months. Each month will reach 20 active members, organize 12 seminars (8 live, 4 online)... These goals are verifiable on the group's Whatsaap and Telegram. However, I would like them to use many social networking apps and tools such as Facebook, Twitter, LinkedIn ... to increase engagement and engage a larger community. With the plan and goals already in place, I believe their proposal will be successful and achieve the same results as the goal. The team's proposal is a completely new project. * I rated: 3 points", "q2r": 3, "assessor": "z_assessor_1410", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 2435, "q0": "The goal of the New Member Onboarding challenge is to increase the number of qualified challenge teams, proposers, advisers, mentors, and voters available. This proposal aims to host French language events and conduct educational seminars to raise awareness of the Cardano blockchain solutions among the general public. The proposer intends to hold additional Cardano Project Catalyst workshops with French audiences, both in person and online, to assist new members in joining the catalyst community and hence this proposal adresses the challenge effectively.", "q0r": 5, "q1": "The proposer proves that he has the knowledge and skills to carry out the proposal. The proposer has clearly outlined the team members who will be required to carry out the plan, as well as a sufficient budget to achieve the goals. A realistic completion timeline is also included in the plan, as well as a clear and detailed implementation strategy that defines what will be done and how it will be done. The proposer has looked at potential implementation issues and proposed solutions. As a result, the proposal above has a good chance of being implemented sucessfully.", "q1r": 5, "q2": "•\tThe proposal offers enough information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the effect and feasibility categories", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 4573, "q0": "The proposer has clear idea of bringing idea of cardano to people of West Africa in their own native language, so that they can try to invest some of their saving into it.\nThe proposer even wants to have communication group among the people, so that he can clear doubts of people immediately , these groups can also communicate among them, by which proposer  get to know interested people towards block chain.", "q0r": 5, "q1": "The proposer has clear audience to capture hence their wont be much disturbance in making moves.\nSome incentives provided to people would have boosted the number of people showing interest towards cardano.\nWith the people like Laurentine Fouomene Djatsa and Kodjo Agzezoutsi who has great experience in this  field, project can implemented successfully without any difficulties.\n", "q1r": 4, "q2": "As proposer has given us clear idea on how he'll help the people to communicate about the block chain, he has also provided us clear road map in an organized manner.\nThe proposer has failed to explain how he'll be performing the task of give away of cardano, excluding that ,proposer is definitely trying to bring West African Community people interest in cardano ,which definitely shows a good future for cardano in upcoming years therefore ,The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6320, "q0": "The proposal raises the issue that there is currently no Cardano community in French-speaking West Africa and people's lack of awareness about Blockchain solutions. Their solution is to organize Blockchain Cardano events in French. The project will organize weekly events including online and offline, create WhatsApp groups and telegram for members to discuss and keep in touch. Besides, they have a youtube channel to share content about Cardano in French. The project aims to introduce the Cardano platform to newbies, create an interactive environment for French-speaking Cardano members and find new people for Catalyst from Ouagadougou and Bobo Dioulasso. These two cities are the capital and major city of Burkina Faso. The proposal will solve the issues of the challenge such as: Introduce new members and new proposal writers, organize 12 events in 6 months. In addition, the proposed team also identify some risks and solutions to overcome. This proposal partially will solve the challenge of adding new members and new proposals to Catalyst. I agree with this proposal.", "q0r": 5, "q1": " The proposal has a clear roadmap. They gave a project implementation plan for 6 months and divided it into two phases. Phase 1: The project was implemented in the first 3 months and organized 2 workshops in Ouagadougou, 2 workshops in Bobo Diouolasso and 2 Online workshops. Phase 2: The project runs from the 4th to the 6th month, they also organize 6 events like phase 1 but with different content about Cardano Blockchain.\n- The total application budget is $6,000 to cover event logistics, venue costs, food, conference organizer salaries, and a give away portion. The proposed team needs more detail on the budget for the success of the project.\n- The proposed group consists of two key members, the founder of the school (International Language Consult) and a university lecturer. They have a lot of organizational experience. They have held 5 Catalyst seminars and have attracted new members to the Catalyst community; Translated documents for Catalyst School and interpreted for Cardano online workshops. However, they do not provide a reference link for verification. I appreciate and believe that the project will be successful when funded.\n", "q1r": 4, "q2": "The proposal gives evaluation index of the number of new members joining Catalyst with an average goal of 20 members/month. The proposal provides an implementation plan in 2 phases of 3 months each. Organize a total of 12 seminars (8 face-to-face and 4 online). They commit to admit 60 new members to Catalyst in the first 3 months and after 3 months to reach 100 members. The proposal also provides a measure of the number of new members joining Catalyst, which is completely measurable and the project can be successful.", "q2r": 4, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6852, "q0": "Impact of the proposal:\n- attract new members to the project Catalyst : this may be possible through the in person and online events the proposers are planning on hosting\n- more peoplel take roles in the Catalyst : by having new members train, informed and join the project, the proposal plan to encourage them to play some roles within the ecosystem, to become proposers, voters, CA, VCA... as those roles would be presented to them during the workshops\n- organise events and offer workshops in French: this would allow community members to get on board as the materials, and info  resources are offered in the language they use.\nIt's starting from 2 cities in the Burkina Faso but may be expanded to others as the number of members grow.\nThe proposal aligns with the challenge and has an impact to the Cardano ecosystem.", "q0r": 5, "q1": "The proposers team is formed by people who are involved in the project Catalyst as translator, especially the Catalyst school, they are exposed to materials used for training of new members. It may be easy for them to use those resources to attract more members through various activties, including events as they are planning in this proposal.\nThis becomes an asset for the success on the current initiative, However in reading the proposal, its planned to get facilitators of workshops but these haven't been identified. When would this happen and who would be those?\nOne budget line is the giveaway, not much is said about the purpose of that giveaway and why $200 only for 12 sessions. I find very low amount ", "q1r": 4, "q2": "The project implementation audit by the community has not been revealed. Also risks  mentioned is to get many people than expected with high expectation, but I would like to learn/hear more about the outreach strategies used by proposera to promote this initiative in those cities.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7410, "q0": "The idea is good, the proponent suggests that a series of meetings be held, both face-to-face and online, to help French-speakers in Burkina Faso learn about Cardano. In theory, the proposal meets the objectives of the challenge well, because these meetings would basically be workshops that would address initial and in-depth topics about our blockchain in the future, with the intention that the premise that blockchain is just a way of investing in cryptocurrencies is undone. In fact, this prejudice is rooted in most people, except in places where blockchain is already a well-known and strong technology, such as the United States and Europe. In this African country, I believe that the level of prejudice is very high due to the lack of education of the population, so it is essential that this type of event is created and changes this reality. However, I think there was a lack of detail to better understand the idea, for example, we are told the thematic axes of the meetings. However, the specific issues are not mentioned. Within the introduction to blockchain, what specific topics would be covered? For example: what is blockchain, what is Cardano, what are cryptocurrencies, NFTs... And how will this information be taught in an accessible way to the target audience? I think in theory it is a proposal that perfectly fits the objective of bringing new members to the Cardano community, mainly because it is about a country where our blockchain is unknown and there is a lot of deep-rooted prejudice. However, in my opinion it would be important for us to know more details about how things would happen, how these teachings would be addressed, through which language would be passed on, who the speakers would be, how they would be able to draw the attention of the target audience and the like. In short, details about the project itself, as it would happen in practice, in everyday life. Therefore, I will give it 4 stars, because I trust the potential of this proposal and it is very much in line with the challenge in which it was launched, but it needs a more in-depth explanation. \n", "q0r": 4, "q1": "I do not agree that the feasibility of the project is very good, the information given is quite basic. As I said in Impact, not much detail is presented about the practice of the project. The script is quite superficial, dividing the tasks according to the passage of months. The problems are that both the time interval between the phases is very long and the explanation of what would happen in the phases is very superficial. For example in the first 3 months, we basically know that the workshops would be to introduce the blockchain, talk about the opportunities it presents and how to participate in Catalyst. But, as I mentioned before: how many meetings will there be, who will speak, what are the specific topics of these 3 thematic axes, what is the numerical expectation of audience, how to engage them, in which parts of the two cities these meetings would take place... And online dating, how could this be possible considering that the target audience does not have a good internet connection? As with phase 1, the following should be better explained. In phase two, the topic “more details on the Cardano blockchain” will be addressed. What details? What was not said in phase 1 that would be talked about now? On the budget, 6k USD is requested, which is a small amount compared to most proposals. But the splitting of parts could also be more specific, for example 2500 USD would go towards a number of things: “event logistics, venue costs, French materials, food etc”. Basically the production of events. But how much would every little thing like that be? What is the average rental for the place? The donations in Ada would go to who, the participants of the event? And finally, talking about the team, in fact it is a duo, we know their names and a small resume of each, but it was necessary to explain their individual role in the project (will they be the speakers?), how much each would commit to the project, it would also be interesting if profiles of their social networks were attached, with facebook or linkedin, where we could see their previous achievements in a practical way. With that, my conclusion is that the feasibility needs to be deepened, mainly in the script part. \n", "q1r": 3, "q2": "The auditability of the project is pretty superficial too. As a measure of progress, the goal is to add 20 participants to the Cardano community per month, and for final results it is expected that 12 workshops will be held with a total of 160 new participants in the community at the end of the events. However, these ways of measuring success are entirely numerical, quantitative. It would be more interesting if qualitative aspects were also analyzed. Auditability in my view should be divided into two parts: monitoring the process (partial results) + monitoring the goals (final results). About process monitoring, this is not so easy to do as we don't have a detailed roadmap. We only know what will happen, in a basic way, as I said, it would be necessary to establish some phases, with well-defined deadlines. With that, we would have more material to monitor, if what we want happened and in the right way and at the right time. The duo that promotes the events should prepare monthly reports, where at the end of each month the partial results are presented, and this should be very accessible to the entire Cardano community, either through online tools such as google docs or miro, or if the document sent directly to our Project Catalyst telegram group. The final results must be explored in a richer way, both in terms of numbers, which are indeed indispensable data to understand if they were achieved, but they must also be analyzed in a more humane way. Are meeting participants really active in the community? If yes, how? Have they learned enough about Catalyst to become CAs and vCAs? And those who study and work with technology, how are they associated with our projects, are they working on the technical parts? Seeing that it is the obligation of the proponents to update the Cardano community, I would like meetings to be held in order to analyze together the final results of this project. This has space to be done in the specific rooms after Town Hall, for example. It is not necessary for all participants of the weekly ecosystem meeting to participate in this, but at least some. In this way, I believe that auditability can be done in a more adequate and complete way. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Auditability: This CA is asking for something that is not required and at the same time disregarding the clear metrics for success outlined in the proposal. This Assessor has a biased opinion and assessing from his own personal opinion. His Impact note is also very unreasonable. His request for further market research is over the top. We have already organized very successful and highly attended Cardano awareness events with requests for more in neighbouring french speaking countries."}, {"id": 7679, "q0": "A simple, concise but impactful proposal. It meets numerous key metrics that this Challenge seek to achieve, from onboarding new users, educating those new users and they also seek to guide them into submitting a proposal. Education is key for the long-term goal of Cardano in Africa. Having Africans feel supported by Cardano through Catalyst although the impact is not felt yet, it will leave a lasting impression of Cardano. This is something that is overlooked, the feel good factor of providing opportunity to uplift people's livelihood. Which to put things in perspective, is what this proposal is basically doing. What's even greater is (although no link is provided) they have setup a Telegram and WhatsApp to maintain communications. This is great, for like any form of education, continuity and the freedom to ask questions at any given time will accelerate the speed of understanding, in this case, Cardano. ", "q0r": 4, "q1": "Based on what is stated, the team consist of a duo, whom the lead has achieve great accomplishments. Laurentine Fouomene Djatsa, is already involved in various Project Catalyst outreach efforts in the form of workshops and is an active supporting member of WADA through simultaneous interpretation. This correlates well with the solution this proposal seeks to provide. Her partner further adds weight into the potential format of the workshop for he is a lecturer of university. \n\nThey have also provided a general milestones that is very much achievable based on their combined skillset and experience. A great note to be known by the community is that there is a thought process that builds on one another. In this case their first 3 months batch of action plans, although is continued in the next 3 months, there is an important end note. Which is, participants will be guided throughout their journey into Project Catalyst/IdeaScale. This for me is huge, Project Catalyst/IdeaScale is a web of information and communities, not being guided extends the duration of getting a grasp on who's who, what's what and when's when.\n\nThere is a simple lump sum budget, which can be stretched out even further how they will use the budget in each phase, but looking at the amount in comparison of the duration of this event, I can understand if this is overlooked. I do hope also that the budget is enough for the team to deliver on all their KPI's.", "q1r": 4, "q2": "Unfortunately, although they provide clear metrics of what they will achieve, when they will achieve it, it is not mention how will this be documented. It might not seem important, but having clear documentation or just the effort to provide clear documentation is a compounding element in building reputation. It would be a crime, if the great work that they potentially will try to achieve is not documented.\n\nFor with documentation one can ask further funds more easily. Especially if all intended KPI's are achieved. I really wish some form of documentation is mentioned, for it seems they have already done it and they understand this. For we can see, they have attached a photo of one of their workshops. It might seem harsh but other proposals have put an effort to explain how they will report to IOG and the community.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8815, "q0": "Proposal to identify the problem of the West African community without the Cardano community, people here lack awareness of blockchain solutions. The proposer solves the problem by holding weekly French-language community education seminars both online and offline in Ouagadougou and Bobo Dioulasso, the capital and city of Burkina Faso. The team creates Whatsapp and telegram groups for members to discuss and stay in touch and has a youtube channel to share content about Cardano in french. The proposal says that it will add value to the Cardano ecosystem as well as the catalyst project by introducing Cardano to new members, creating a space for French-speaking Cardano members to exchange and study. Looking for new talent for Catalys from Ouagadougou and Bobo Dioulasso . Provide quality educational seminars from there. Introduce new members and new proposers. They plan to hold 12 events in 6 months. The proposed topic is aware of the risks and knows how to deal with them. I agree that this proposal effectively addresses the challenge ", "q0r": 5, "q1": "The group consists of two key members, Laurentine Fouomene Djatsa and Kodjo Agzezoutsi, They are the founders of the school and university lecturers. They have had experience in organizing 5 Catalyst workshops in 2 major cities of Burkina Faso in French, attracting new members to the community, translating documents for Catalyst School, assisting WADA with simultaneous translations in the project catalyst. The team provided a link to a video about PRESENTATION COMPLETE SUR CARDANO PROJECT CATALYST presented by Laurentine Fouomene Djatsa. However, the specific information that proves who he is and the rest of the members I don't see. I ask the proposer to provide this additional information to improve the feasibility of the project. The proposal provides a 6-month project implementation plan divided into 2 phases, each lasting 3 months, and outlines the work to be done in each of these phases. The budget applied for is $6,000 to use for event logistics, venue costs, food, conference organizer salaries, and give-away. In my opinion, this budget number is quite suitable. However, from the perspective of Catalyst Advisor, I feel that the explanation of the budget should be more detailed, if possible the proposer should clarify what the event logistics are, how many hours it is done, how much it costs per hour. That's the same for another category. If this is done, it will be easier for the reader to assess whether these costs are reasonable or not. Based on the reasons given, I believe this project can be successful", "q1r": 4, "q2": "The proposal presents a 6-month implementation plan divided into 2 phases, each of the 3 months. In general, the proposal to determine the success of the project is to achieve 12 seminars, of which 8 directly create 60 new members to join the catalogs in the first 3 months, after 6 months need to reach 100 members. Timelines and KPIs are specific and definable. The reason I don't give it a perfect score is that to my knowledge, Project Catalyst funds are given monthly, so my advice to the proposer to increase their chances of getting funding is to divide the timelines to complete work by a week or by 1 month. Quantify what needs to be done to be measurable for example \"in the first month a workshop will be held in Ouagadougou, the workshop will be videotaped and posted on the group's youtube page, giving 2 reports about the overview, development goals of the Cardano platform as well as catalyst, an article presenting financial opportunities, a tutorial on how to become a catalyst advisor, all shown on the website, ... the same for the next category I think it will be useful for other suggestions for the future.", "q2r": 4, "assessor": "z_assessor_706", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10674, "q0": "The proposal identifies that people in French West Africa lack the awareness of the blockchain solutions.  Therefore it plans to create a Cardano community by recruiting and educating new members via workshop in person as well as online. The medium of communication in the workshop will be in French to satisfy the needs of the local community. \n\nThe proposal also has an open social group via WhatsApp currently in place for members to interact.  It also plans a group in Telegram. \n\nCreating a community, educating and leading members to the Cardano Catalyst community and getting them involved (\"start contributing\") is in line with the campaign. Through education workshops produces quality active members. \n\nI strongly agree that this proposal effectively addresses the challenge. \n", "q0r": 5, "q1": "I strongly agree that it is highly likely that this proposal will be implemented successfully. \n\nThe proposal team comprises two key members. Mr Laurentine has conducted 5 Cardano Project Catalyst workshops and has recruited new members in the Catalyst community. Whilst Mr Kodjo, an entrepreneur, a network and security engineer and a lecture has authored an article on blockchain services. These two persons would definitely have key roles in bringing in quality members in the Cardano community. \n\nThey plan to hold 4 in-person  workshops for the first 3 months and 4 for the second 3 months  and 2 workshops online for each period. The 4 workshops will be held, 2 each in two cities. \n\nThe topics for discussion focus on uses and opportunities in the Cardano system, and about Catalyst and how to get involved and contribute. \n\nFor the activities, the proposal will spend for the cost venues, logistics and meals, the cost of event organizers and speakers. It also purposes a small amount for give away gifts in Ada. \n", "q1r": 5, "q2": "I strongly agree that this proposal provides me with sufficient informative to assess the progress attaining its stated goals. \n\nThe proposers aim to recruit 160 active Catalyst members at the end of 6 months (min. 20 for each month) through 8 in-person and 4 virtual workshops. I consider these are clear KPIs and goals. \n", "q2r": 5, "assessor": "z_assessor_968", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Host French language events and provide educational workshops to inform the communities about the Cardano blockchain solutions.", "experience": "hosting multiple in-person and online Cardano Project Catalyst workshops with French audiences\nAssisting new members in joining the catalyst community\nTranslating documents for Catalyst School\nAssisting WADA with simultaneous interpretation during Cardano online workshops"}