{"id": 403096, "author": "emeliasarfo2", "title": "Ghana Youth Onboarding Outreach", "url": "https://cardano.ideascale.com/a/dtd/403096-48088", "category": 26450, "amount": 4000, "description": "Most of the productive youth in Ghana are not aware of blockchain technology and its opportunities. Cardano can support their onboarding.", "funded": 2, "upvotes": 33694761, "downvotes": 3687701, "votes_result": 30007060, "votes_cast": 125, "f6_no_assessments": 9, "f6_rating": 4.2592592592592595, "videos": [], "media": [], "f6_assessments": [{"id": 408, "q0": "We know that Africa is a continent with many possibilities for growth, being one of the main emerging markets in the world. On the other hand, historically, it is also a place where there is still not so much technological innovation and one of the exponents for that, in the future, this reality will change, are the young people of today. The proposal in question focuses precisely on this youth so that they are taught concepts about Cardano's technologies and their benefits. We believe that this is a very sharp strategy, as local youth are the best understanding of how security and decentralization brought about by blockchain can solve local problems. With this, the proposal fits the goals of the challenge in question. And with the success of the project, a greater number of projects are also expected on Catalyst, we therefore see a positive impact on Cardano's ecosystem. In addition, according to what the project proposes, we see that the budget being requested of $4,000 seems reasonable.", "q0r": 5, "q1": "The way chosen to teach the youth of Ghana was through workshops, so in the feasibility plan we look for information that tells us how these events will be organized. And here we perceive the presence of this information, following a good organizational and logical structuring. In the organizational aspect, we noticed a structuring of the actions that will be carried out each month, demonstrating a clear path to be followed. And in terms of logic, we realize that the event will be publicized first, to generate engagement, and only then will the workshops be held. It is also worth noting the possibility of online participation in these workshops, a great initiative by the team that even helps to mitigate some local problems of locomotion due to infrastructure.\n\nAnd as for the team, we see that the professionals involved have very important attributes for carrying out the project, experiences with entrepreneurship, education and constant work with other people. Another positive feature is the existing connection between professionals and Cardano. Regarding the breakdown of the budget, we see that it makes sense, with the two biggest expenditures (approximately 77% of the budget) going to the location where the workshops will be held and the people in charge of teaching about blockchain. There remains, however, the observation that it seems important to have a part of the capital allocated to marketing, even if this would result in a slightly higher request for the amount to be financed. It would also be nice if the professionals involved in the proposal made their CVs available.", "q1r": 4, "q2": "The ways to follow the progress of the project are well explained and make sense in relation to what the proposal has explained so far. In this context, we see that the number of participants will be monitored, both physically and online in both workshops. A very interesting point is also that in the first workshop the number of volunteers interested in participating was documented, and in the second it was observed how many were integrated, showing that the project also takes into account whether the event reached people who were not initially the target audience. .\n\nThe metrics used as a perception of the project's success are very well defined, taking into account the consequences of the event, to verify if the objective was really achieved, through indicators such as the satisfaction of the people who participated and how many intend to present their ideas to receive funding. .", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 733, "q0": "This proposal is for 2 workshops to be held in Ghana with the intention of reaching at least 300 youth.  The focus of the workshops will be introducing Cardano and Catalyst, and exlpaining the roles and opportunities of Catalyst, with a focus on how to prepare a proposal.  The proposer notes the poverty of the region, and how difficult it is for these youth to reach adulthood with positive principles in place regarding health, peace and productivity.  Beyond just the suggestion of opening some new wallets, the purpose here is to use Cardano to reinforce the values mentioned and more, as a positive force that young lives can arrange themselves around.  This is exactly the kind of mission at the edge of the ecosystem that can bring the most positive change in individual lives versus what would happen if old ways are allowed to just clank along. I am always humbled by what small proposals like this have the potential to accomplish, while also trying to be reasonable about how difficult some things are to change.  One thing is for sure, the opportunity has to start somewhere.", "q0r": 4, "q1": "The 3 month timeline calls for the delivery of two workshops, following a brief period to publicize and arrange for participation.  The two summer workshops follow back to back in June and July, with a budget divided up in a balanced way between the team running the workshops, the logistics around the workshops and securing access to the venues.  The only concern they noted was the unreliability of power and internet in the areas they will be reaching, and they have included funds to make sure they have backup power.  The team members themselves are experienced in Catalyst roles, so they will be speaking to what they know.  With the help of WADA running in the background, they have a lot of experience and resources for carrying out these kind of workshops to draw from.", "q1r": 4, "q2": "The team has a clear vision of how to set up the events, and will be setting up social media channels primarily to subscribe participants and spin up interest.  The use of those channels, with impressions and engagements will give them material for the first month's progress report, which should reflect expected participation that they have got commitments for.  The two events themselves will be reported along with participation both in-person and online, which should include the number of wallets created as well as any requests for continued mentorship or sponsorship for the proposal process.  The teams ability to go through WADA to inform the community about how it is progressing gives a high level of assurance that they will be able to stay on track.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2367, "q0": "This proposal addresses the challenge by putting a solution to the problem that is started to increase the number of people in the community. There is the element of volunteering which also reduces cost but effectively increases the impact of its purpose. \nThis will boost the interest of the people in blockchain and Cardano as a whole. \n", "q0r": 4, "q1": "This proposal has a team of experienced personnel who will partake in the implementation. The budget of this is cost-effective and has been broken down to suit the two monthly project. The budget contains six elements which are all necessary for the implementation and as representation will bring this proposal to a success.\nThe time frame has also been well broken down and the allocation of activities is reasonable for the size of the project.", "q1r": 5, "q2": "There is much information in the proposal to track its progress. Within the two months setting, there are key achievement metrics to show the success of the proposal. this can be checked in the Auditability section which describes the necessary data represented to show the success of the propsal.", "q2r": 5, "assessor": "z_assessor_1478", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2408, "q0": "As we all know Ghana is a country with an underdeveloped economy, most young people and people in Ghana are not aware of Blockchain technology and its opportunities. For a lot of reasons. with the idea of ​​bringing Cardano technology to support youth referrals in Ghana is a very good idea. In the project I saw that the group raised issues such as Organizing outreach programs to safely attract more young people with ideas. Two-month workshop on proposals to catalyze the Cardano Blockchain project. Young people face a lot of difficulties as they grow up. The problem of food and money makes them have to travel everywhere to make ends meet, plus the language barrier makes them unable to contact and be aware of Blockchain technology. I find the issues mentioned very appropriate. fit the challenge. I think this proposal can be scaled up to deal with future challenges. Besides, the group also raised solutions such as: Will engage the participants by organizing volunteer classes to better understand the whole concept of Blockchain technology. Bringing together young people to learn about Blockchain and come up with great ideas like unique IT talents that they didn't know existed, Training youth in market access skills to increase the chances of escaping poverty. It is expected that in the 2 months after the session the youth will have in-depth knowledge and the Cardano blockchain from which they can turn them into solutions in life. Besides, the group also raised the risks that the project may face such as unstable internet, the promotion of the program may not reach some outstanding young people in remote areas of the country. country. However, the group has also outlined options to fully and reasonably address those risks. I would like to add, Without giving incentives for them to be motivated to study and learn about Blockchain, it is very difficult to convince them to study.", "q0r": 4, "q1": "About the detailed plan description and timing. I see the group has outlined four specific goals and also outlined certain milestones that are, will complete the process in about 3 months and have broken down the work for each month. I think the above timeline is reasonable to complete the set tasks. However, the progress of the project is not easy to check and track by the community. on the budget section, with almost 5% of the total challenge's budget and has been broken down into 6 different categories. I think with the above budget and it has been divided as in the above project, it is reasonable. However, the team needs to have an estimate in case additional budget is needed. with presentations about team members. I see that the group has mentioned 3 members and has assigned specific tasks to each member. When I researched, I found that the qualifications and experience of the members are quite good. However, their identities have not been verified, and have not attached references for the community to check and track. I need the team to come up with options so that the community can easily track the progress of the project.", "q1r": 4, "q2": "about the description of measuring the progress and development of the project. I found the team identified three metrics. specific goals have been identified. However, the measurement indicators are not easy for the community to track. on the success of the group project also identified five successes. as detailed in the project. I see these successes are very related to the challenges in the campaign, but this project is currently in the idea section, not in a test run. This is a new project that has not been funded, but I find in the proposal that all ideas have been given very fully and reasonably. I hope the project will receive a lot of support from the community and will be funded so that the project can be put into practice soon.", "q2r": 3, "assessor": "z_assessor_1486", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3942, "q0": "I appreciate the premise of the project, which wants to teach Ghanaian young about blockchain and the Cardano Project Catalyst. This two-month training will be critical in raising awareness of blockchain in general, as well as boosting the number of Cardano projects in the future. Blockchain education will reduce reliance on the government for career opportunities after high school.\n\nOne thing I would advise is that the proposer share additional information on how many individuals are currently interested in learning so that the community can better understand how the initiative will effect the 300 youth who are expected to participate.", "q0r": 4, "q1": "The proposal includes a timeframe for running the program for two months. The usage of the fund is clearly defined in terms of how it would be used. \n\nHowever, I believe that there could be more marketing efforts to expose the workshop to a wider audience, not simply public program details on social media platforms such as Twitter and Facebook. Furthermore, for greater credibility, team members' information should be accompanied by links and references.", "q1r": 3, "q2": "It's a good point that there will be multiple metrics recorded to track the progress of the project, but proposer should also provide a link or source that leads to that recorded document. The KPIs that the proposer provided to define success are good sources for judging whether the audience is engaged in and understands the course.", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4761, "q0": "The problem is that young Ghanaians are facing difficult challenges growing up. The question is how can they contribute their youth power to national development. They can participate in all fields such as healthcare, education, technology, business… Blockchain is a huge opportunity for them, but most of them are not aware of blockchain technology, Cardano, Catalyst. Volunteering opportunities will provide them with skills, helping them to develop their talents. When collaborating with Wada Ghana, volunteers learned about blockchain, understanding the whole concept of blockchain technology. The proposal raises idea to organize 2 seminars within 2 months to provide in-depth knowledge about Cardano, Catalyst including writing proposals, discussing ideas and how they can turn them into real life solutions through catalyst. The group says the proposal will positively impact about 300 young people in Ghana aged 17 to 25. They also outline some of the risks and how to deal with them. I find this is a good proposal and in line with the goal of the challenge.", "q0r": 5, "q1": "- The proposal has a clear roadmap, they will organize 2 seminars, conducted from May 2022 to July 2022: in May will announce the program on social networks (twitter, WhatsApp, telegram, Instagram, Facebook), hold the first workshop in June, and the second workshop in July.\n- The required budget to implement the proposal is 4,000 USD, in which details for each specific job such as: rent a conference center, rent equipment, stationery, logistics, Blockchain educator… I see this budget statement is reasonable.\n- The project implementation staff consists of 3 people, they are all CAs, vCAs, proponents, training consultants... have experience, so I believe the project can be successfully implemented if approved.\n", "q1r": 5, "q2": "The proposal has a specific roadmap so the community can easily track its progress. The team plans to hold a workshop at the 150-capacity convention center, they will also record the number of actual and online participants, the number of volunteers over the two seminars. And they will summarize at the end of the two seminars the number of participants, the number of people who want to become volunteers and are willing to contribute to the ecosystem, the number of people who want to include the idea in the funding proposal... Through the data that they summarize, the success of the project will be assessed.", "q2r": 4, "assessor": "z_assessor_1768", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5020, "q0": "This proposal is suitable for the challenge as it will help 300 young people from Ghana aged 17-25 to participate in Catalyst including the role of proposal writer. They are aware of the main risks that are unstable internet, or outstanding young people in remote and isolated areas with no access. They also provide solutions to reduce the risk but these solutions do not seem exhaustive to me.", "q0r": 5, "q1": "proposer to provide an implementation roadmap for May 3, June and July 2022, containing the work to be done for each month. The total requested budget of $4000 is explained with fairly specific and logical subsections. The proposer implementation team has 3 members, they are CA, VCA from fund 6, Cardano Ambassador. If they can provide evidence to prove it, it will be clearer.", "q1r": 4, "q2": "The project's roadmap is implemented in 3 months with specific milestones of May, June and July 2022. Indicators to measure the progress of the project are also provided by the people. offer a clear description. However, if there are specific numbers, the auditability of the project will be fully checked.", "q2r": 4, "assessor": "z_assessor_1820", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7686, "q0": "I remember something similar to this proposal but this by far is much better. Kudos for that, I was always for Africa but the proposal that was similar had to many \"guesstimate factors\". This squashes that. What makes this proposal easier to assess is their systematic and detailed approach. Starting from their solutions that are clear; workshops. Their duration; 2 (two) months down to the type of workshops; educating on methods to submit a proposal to Project Catalyst.\n\nThis continues onto their target, which are the youth of Africa. The strong numbers they seek to achieve and the demography of their targets. Although having knowledge where these potential targets specifically are in Ghana would have been perfect.\n\nAll of these stated missions correlate well with some of the metrics of this Challenge. What makes this more reassuring is continued deeper involvement in Project Catalyst over numerous funds. Add to that they are still coordinating with WADA, a trusted friend of Project Catalyst. Congratulations to this team of proposers for their continued and persistent effort to uplift the youth of Ghana through Cardano. I may not represent all of Cardano, but I am sure the majority of us acknowledge honest, hardworking individuals/communities that iterates themselves, listens and learns from the community. Good luck team!", "q0r": 4, "q1": "Although their plans, timeline and budget do not interconnect between all of them. They are detailed, and because they are verbally detailed, one can assess and make the connections by oneself. Not ideal but a great effort. Though the amount asked, it may seem to low and is a cause for concern whether it is enough to deliver on all their intent. There is their target of 300 individuals that will be divided into 2 (two) workshops, both being online and offline. I am not of this region and can only hope that the budget requested is sufficient. Africa is the smart long-term bet of a lot of business people, and I believe that is how Cardano should also approach Africa. Our expectations should be tempered and seeing the budget asked, these proposers should be given a chance for all their hard work and persistence in continuing to uplift their community.\n\nThis is proven by looking at the (perhaps) lead of this proposal, Emelia Sarfo, who has gone through 2 (two) funds, one as a CA, one as a CA and vCA. The commitment to their cause is commendable and should be noticed.", "q1r": 4, "q2": "Their method of reporting is quite simple, since it is a workshop format what they will do seems to be a mix of manually jotted down participants report, perhaps transferred inputs into digital docs also. Where they will also strengthen this by having video documentation of these workshops. More than enough to gauge on the traction of their intent. Though their end-goal are stated, all are loose numbers with no numeric targets. I believe by having numeric targets, one can gauge whether ones actions and understanding of the situation are aligned with the target. Having vague metrics does not help anyone. Not reaching a numeric goal, is also a form of education, that many find hard to understand. Hopefully, in the future iterations, targets will be numeric. Failure to achieve is not failure, again it is an opportunity to learn and gauge effectiveness of our solutions.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9104, "q0": "Educating the youth a Ghana is a great opportunity for them to explore to try their hands on new efforts. The proposal is aligned to the challenge to onboard Ghanaian youths to learn and participate in the catalyst ecosystem, activities that would being them endless opportunities blockchain present. \n\nThe youth bloc of very country is curious about new ideas and willing learn and unlearn to be relevant in the society.", "q0r": 5, "q1": "The budget is very realistic with activities intended to do to achieve impact. The timelines of the deliverables are well structured, making the project implementation very smooth. \n\nThe output of the team is a great sign that the project will be implemented without difficulties. The team looks be core members of WADA and the team is a strong one. With this capacity, the project would have good results to onboarding to expand and grow the blockchain ecosystem. ", "q1r": 5, "q2": "There are vivid and variables that could be used to measure success. The variable are not measured enough to allow for future outcomes of the project. Notwithstanding the project has the KPIs that could be assigned metrics if it is funded so that auditing will be doe with ease.", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Organize outreach programs to safely onboard more youth with ideas. Two months' Workshop on Cardano blockchain Project Catalyst proposals.", "experience": "Emelia Sarfo is a CA for Fund6, CA and vCA for Fund 7, CA and Voter for Fund 8, an Entrepreneur, a training consultant, Community worker, Human Resource Practitioner of over 20 years experience, Philanthropist, Marketer of over 10 years experience. Hotel Customer Service Trainer."}