{"id": 403244, "author": "cenkner", "title": "Cardano learning needs assessment", "url": "https://cardano.ideascale.com/a/dtd/403244-48088", "category": 26450, "amount": 980, "description": "New users in Cardano have trouble knowing what to learn and where to get help. Resource development and availability tend to be random.", "f6_no_assessments": 8, "f6_rating": 4.291666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 736, "q0": "I love the idea of a \"Things you need to know...\" community facing curation of resources and issues within Catalyst.  It would address many issues regarding onboarding new Catalyst members in a creative emergent way that could address things that maybe don't lend themselves to more direct solutions.  I do think that there needs to be some serious \"guard rails\" on a resource like this, as the nature of Catalyst is to have so many things you need to know as to be utterly overwhelming (thus the need for proposals like this and the whole reason the challenge setting was dreamt up in the first place).  But if the list is properly curated, delimited and maintained, I see it as a popular place for newcomers and oldtimers alike to get a sense of the hubs of interest and opportunity that are driving Catalyst forward at any given time.", "q0r": 4, "q1": "It should be understood that the goal here is not the imposition of any particular list, but to fund a process for discovering the nature and properties of such a list, and then to provide that discovery to the community as a v1.0 of the list.  Having said that, the version imagined as a starting point isn't going to work.  One of the risks of these kind of pathfinding/mapping resources is that it sprawls.  A map of the world doesn't possess the resolution to correctly inform decisions about how to get to a grocery store, and even the beta version of the list provided here is clearly infected with an advanced case of deadly sprawl.  To bring it into focus, it needs to be delimited, and my suggestion would be to make it more \"Ten things you have to learn in Catalyst....\".  Really dial it in and see what kind of resource that creates.  The second issue facing resources like this is stagnation.  Someone puts a lot of time and energy into capturing the network state for a brief moment, and then two weeks later it is out of date.  Two months later?  Two years later?  Perish the thought.  As important as curating the list and giving it visibility is having a clear protocol about how and when it is updated, and who does it.  Ideally you automate it somehow with all of those parameters (maybe tie a pool of guides and educational articles to a machine learning algo like the kind that senses what topics are most verbalized across multiple communication channels, which results in the guides associated with particular keywords to be linked up in order of their popularity.  And if a keyword has no guide?  maybe a flag to the community that they need a new resource), but within the scope of this proposal the proper tack is probably to create an incentivization scheme, such as a token that accrues to those who maintain it (and the work to design such a scheme would pay off by being horizontally applicable to any number of resources that need to be kept up to date.)  Without those elements clearly outlined (delimiting characteristics, maintenance protocol) this project is missing critical infrastructure to be executed.", "q1r": 3, "q2": "To the degree that the proposer has provided a process that can be seen through (though I don't believe it would have success, as noted above), there is definitely an auditable plan here.  Running the surveys results in implementable data (likely too much data, in fact, but I repeat myself) and reportable milestones as the list is built out and prototyped.  Creating a community facing hub (gitbook recommended, github highly recommended) is a critical step that can be reported in increments.  Because the data is being sourced directly from the Catalyst community, there is no doubt that the project can be held accountable and kept on track.  I really appreciate how the proposer envisions the \"success\" of a project like this:  though he includes some somewhat arbitrary KPIs, the real contribution is in the educational communities of Catalyst being able to refine their offerings, and to tune them to the emergent needs of the community.  I wish the proposer good luck in measuring such a qualitative measure, while saluting him on the worthiness of it.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1275, "q0": "“New users in Cardano have trouble knowing what to learn and where to get help.” The proposal has identified an important problem that I face myself when joining Cardano. The proposal suggests a solution would be to establish a list of competencies. This is closely aligned with the challenge. The process involves survey the community and reaching back to the respondents. There is a closed cycle, and one can obtain first-hand experience, different perspectives and collective knowledge. The proposal also mentioned creating living document periodically updated. This is important as Project Catalyst is constantly developing and changing. \n\nI appreciate the fact that the list is a guide for new users as well as a good source of information for content creators. And can help close the gap between learning resources and learners. \n\nThe proposal has described the initial steps of the project and also mentioned possible ways of development in the future. Future considerations can also include developing ways to incorporate existing materials, survey new users on what learning content they need to further inform content creators. \n\nLastly, I cannot see how the list will address the different roles available on Project Catalyst. Or will the list specifically target different roles? I would imagine that being quite important. One solution could be to create different lists. One that contains general knowledge that every role needs, and other lists for specific roles: challenge teams, proposers, advisors, mentors, voters.", "q0r": 4, "q1": "The team consists of members with a background in educational technology, course development can be helpful. There is a LinkIn profile and website to verify. Another member has a background in web development and law, which align with the actions described - creating a website. \n\nMy concerns are why a website is needed? I understood that you want the survey to be interactive, but can’t that be achieved with existing tools? Like Google Form or Survey Monkey? \n\nSimilarly, for publishing the list, why not use a platform with a Cardano community? Since that will bring more audience more easily.", "q1r": 4, "q2": "The proposal has set metrics for measuring performance in 6 months time. The metrics are clear, concise and measurable. Perhaps it is good to think about what will happen afterwards? I look forward to seeing a follow up proposal and seeing the list develop further into a tool that will really address the problem that new users don’t know what to learn and how to learn. I am willing to see this list appear in orientation documents for new members. This is very meaningful and important. \n\nAlso, perhaps you could research what similar resources are available at the moment. I have seen some lists on twitter and github. Why did they work, not work? And understand what you would have done differently to really solve the problem?", "q2r": 4, "assessor": "z_assessor_1334", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2744, "q0": "This proposal is generally applied to the Cardano ecosystem, but does have intentions of specifically addressing Project Catalyst, as well.  In this way, it does meet the challenge's focus of onboarding new Catalyst participants by providing good information about the educational needs of new users of the Cardano ecosystem.", "q0r": 4, "q1": "The proposer has previously conducted surveys and appears to have the ability and knowledge to complete the tasks outlined in this proposal.  The proposer does have an advanced degree in education suggesting he is well-suited to execute a survey with accurate and useable results.  The budget is thoughtfully presented with reasonable expectations for the workload required.", "q1r": 5, "q2": "I did not find a specific date of completion, but the budget attachment does have an estimate of the hours required to complete this project. Deliverables include the results of the survey distributed in multiple venues.   Completion of the survey and dissemination of information to key stakeholders will conclude this proposal and can be an easily audited.", "q2r": 4, "assessor": "z_assessor_1574", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3725, "q0": "The proposer is creating a guidebook of Cardona which tells the users things to do and things not to do through polls which will be very helpful for a lot of people getting introduced to Cardona. Since Cardona is growing potentially there will always be new people joining cardona and this proposal will help them understand about in and out's of Cardona in a very simple and easy way. The proposer has uniquely identified a need to establish a list of things a person needs to know to function in various roles in the Cardano ecosystem and they have also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of creating a guidebook of Cardona through polls and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 980 USD which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more users which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4995, "q0": "The proposal is well placed in terms of defining the problem.\n\nThe author has done an excellent job of focusing his idea on aspects that can generate value for the ecosystem by (1) facilitating and encouraging the reception of new members (2) engaging the community to develop a useful solution (3) directing the way. according to the interests of each participant (4) create a solution that serves different groups in the community.\n\nIt is also worth noting that the project has the potential to become an increasingly useful tool, shared among community members.", "q0r": 5, "q1": "The author brought evidence of his experience in implementing projects of this nature in the proposal. In addition, he presented a partner that has complementary and fundamental skills for the development of the proposal.\n\nRegarding the plan presented, we can clearly understand the stages from planning to deliverables. It was even presented what the deliverable will not meet, which enriches the assessment of those who need to scale the scope of the project. This is a senior researcher posture.\n\nI had the opportunity to work on market research projects for about 4 years, the beginning of my career, mainly understanding purchasing behavior, message absorption in different media and product usability. I would like to contribute with two points about the presentation of the plan. (1) I missed the presentation of a timeline, to understand the time and depth that the author intends to reach at each stage, as well as understanding the deadlines as a whole. (2) knowing that the author wants to serve different groups that work in the community, according to their particularities, I would like to have a view of how he intends to deal with these specificities in the research. Having an additional pre-step or research segmentation can enrich the deliverables for the community.\n\nFollowing the quality of the proposal presented, the budget was detailed and consisted of working hours at each stage. In it we have a complete view of how the fund resource will be used.\n\nIn a direct but clear way, the author presented potential risks that could compromise the project delivery. In addition, he indicated ways to mitigate the risks.", "q1r": 5, "q2": "The author points out some objectives that he intends to achieve as the project progresses. In this case, this description can be complemented with a more structured view of the monitoring of deliveries at each stage and evolution of the research.\n\nIt would be interesting for the community to have transparency with the volume and quality of data collected, as well as in the process of refinement and consolidation of the project. As the milestones have been clarified and the timeline has already been commented on above, this could be an improvement adopted for the proposal.\n\nFinally, the author demonstrated clarity about what he hopes to achieve with the project and how this solution makes sense for the challenge and generates value for the community.", "q2r": 4, "assessor": "z_assessor_1818", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5913, "q0": "Idea is really good, having a consolidated list of tasks and required competencies will habe newcomers to understand better how they can fit in cardano ecossystem and envision their future through how they need to educater themselves. Problem statement is clear and solution is simple (a list) but straight to the point in addessing the problem. It also does address the challenge potentially working with challenge kpis as \"Reduction in the number of unready proposals\", \"Percentage of proposals with Excellent assessments\" and \" increase more meaningful participation from challenge teams, proposers, advisors, mentors and voters\".\n\nI liked the list will be created alongside with community, in a iterative process, there's already a communication strategy defined, as not reaching its audience was mapped in the risks. Very imporant for this to be included in communication emails sent by catalyst and in channels like telegram, twitter and etc.\n\n\nTo make the list more robust, I'd even add definitions to the tasks and categories listed, with links and so on, as a form of a glossary, so it's possible to fully understand that. \n\nAll in all, it's a simple project but that address the chalenge and helps to solve one of the many pain points when onboarding new members.", "q0r": 5, "q1": "There's a good, staged plan. It would be imporant to know how many weeks each stage would take. It's possible to sse by the budget breakdown that the project consumes only 20h of work, but, as surveys need to stay open for a while, it would be nice to know for how much time and when its expected to be completely done.\nThe acitivites described here are detailed enough though.\n\nBudget breakdown is very well done, in a attached file, by hours, stage and acitivty which makes it very transparent. One of the main advantages of this project is that its really cheap, consuming only 0,5% of total challenge budget.\n\nRegarding the team, there are 2 committed people, 1 with experience in running surveys and other in web development. It seems enough to run this project, but it would be nice to also know what are proposers experience with Cardano, to understand if they can see survey results in a critical way and reflects about how to \"translate\" all the info they get into the final list here. How long have they been in contact with cardano? what are their interations with ecosystem? have they had any proposal funded already? This would help to understand better how capable they are on develiping the final list. \n\nIn general, proposal seems feasible, with a good plan, a very cheap and fair budget and people with at least nearly all required competencies.", "q1r": 4, "q2": "There are good kpis and all with target, which is awesome. Milestones can also be extracted from the plan but more information on how commyunity could follow up with them could be provided.\n\nAs suggestions, it would be good to understand how this list is helping newcomers. Maybe after some titime some extra survey could be done with them ,assessing whether they got in contact with it or not and, if so, if the list helped them, and possibly create a NPS score on it. it would also help to assess if communcation is being effective, in advertising the list, which is key in this project.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7271, "q0": "This proposal will survey the Catalyst community about the necessary information and skill to be onboarded.  The key deliverable is a public (non-commercial CC license) list of competencies that are available for building community educational projects. As an educational developer myself, this type of 'competency list' is a standard building block for educational material and could be foundational for system-wide instructional onboarding activities.  In other words, this project could scale to become an integral part of the community.  \n\n While it might be difficult to see the value of such a list, it directly relates to two of the guiding questions of this Challenge: \"How might we improve the use of existing text, video, and audio materials?\".   This list would provide clear direction on what to learn and help the new members self-assess their overall competency.  A lurker will be encouraged to participate after seeing this list.   \n\nAnd, \"How might we encourage new members to utilize the tools and services available for onboarding?\" This list would serve as a general map and overview of the entire educational system of Catalyst, helping the new members (and old) orient themselves.", "q0r": 5, "q1": "The proposer is active in the community. I believe this proposal will be a success because it is uncomplicated and the community will see the value and support it (by participating in the survey and using it to direct their educational activities).  The proposer has experience with survey administration and much experience with educational technology, as listed in his LinkedIn profile.   \n\nThe budget is clear, understandable, and reasonable.  The risks of failure are low and the value to new member onboarding is high.", "q1r": 5, "q2": " There is a clear roadmap with appropriate time allocations attached.  The KPIs are present, easily achievable, and auditable.  For example, marketing the list of competencies to 6 or more Discord Servers in the community and receiving more than 25 comments are listed at KPI can be simply measured.", "q2r": 5, "assessor": "z_assessor_56", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10101, "q0": "The Proposal will make it easier for passive and new ADA holders, to enter into the Cardano Community. By providing a list with learning resources it will motivate those that are reluctant to join the community because they think they lack understanding and skills.\nThis will be step one of the process though and I hope the proposer ensures that someone steps forward to take and grow it further. Maybe when the list is discussed in groups, a team can be put together that will ensure the list is populated with course material etc.\nI believe this proposal is in line with the challenge brief and will have a positive impact on the Cardano Eco-system.", "q0r": 4, "q1": "The proposer has experience in surveys and has provided us with links to his profiles. He is only asking for 0.5% of the Challenge's budget for something that could make a huge difference to the Catalyst system and onboarding new members , voters, proposers, advisors etc. A detailed implementation plan is provided with milestones and it is evident that the proposer has a clear vision of what and how he wants to accomplish in this project.", "q1r": 4, "q2": "Community members will be able to follow the progress via the Telegram, Discord and YouTube channels. The amount of comments, likes, followers and views will be an indication. The proposer wants to achieve at least 100 page views, 10 likes and 3 comments at six months. I believe due to the need, it might be more. There is a very clear road map with milestones and this can be compared to what is actually happening by following the groups and social platforms.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Poll groups and individuals to establish a list of things a person needs to know to function in various roles in the Cardano ecosystem.", "experience": "Collaborated on survey that went out to 1000+ health care professionals in Canada, created final version in SurveyMonkey. Experienced in project teams creating online courses and digital resources for post-secondary. Experience with DACUM, task analysis. Design thinking."}