{"id": 403785, "author": "sahyounk", "title": "Dubai Cardano Meetup", "url": "https://cardano.ideascale.com/a/dtd/403785-48088", "category": 26450, "amount": 5000, "description": "Dubai has a large number of young working professionals that are expatriates without pension investment options", "f6_no_assessments": 7, "f6_rating": 3.1904761904761902, "videos": [], "media": [], "f6_assessments": [{"q0": "As a meetup meant to increase awareness of Catalyst and Cardano, I would like to see more connection under the Impact to warrant the funding.  There isn't really any mention of Catalyst until the metrics at the end, which means there was no discussion about what materials or support would be available for potential Catalyst applicants.  As just a casual meet and greet, it is difficult to understand how there is the potential for ROI on this endeavor.  What would be good to see here is some kind of mission statement for the meeting, such as to onboard 5 proposals by the end of the night, or to sign up multiple Ideascale accounts because of material prepared to show evidence of economic opportunity for CA work.  Bottom line there needs to be clearer statement  of intent regarding the challenge setting, and even just in general with Cardano.", "q0r": 3, "q1": "There is no information provided for the teams qualifications or to give an idea of what kind of draw the event might have with them running it.  There is some logistical misunderstanding regarding the \"venue\" concerns, I believe.  I have never seen small event organizers get a free venue or to get hotels to distribute free food...why would they need exposure for themselves in their own hotel?  Because of this issue, I feel the budget simply isn't on target, as it has no funds allocated for the venues, and it is planning for 3-4 of these meetups.  The desire to start a Cardano Hub in Dubai is admirable, but this challenge really requires the focus to be set on Catalyst participation.", "q1r": 3, "q2": "There really needs to be more information in the proposal on the intent to capture the information they intend to provide here.  If Catalyst enrollees from Dubai is a measurable, how are we setting that target?  Do we have any idea how many people we might reach or plan for?  Aside from reporting the scheduling and execution of the events, there doesn't seem to be much of a plan presented here for establishing these metrics.  Even a small event has a lot of organization around it, and just seeing that plan would improve the ability to mark out auditable beats in this proposal.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Dubai is a city of skyscrapers, ports, and beaches, where big business takes place alongside sun-seeking tourism. Dubai is also well known for its business and the businessmen living in Dubai and by conducting Cardano meet in Dubai attract a lot of business people into getting to know more about Cardano and reaching it into greater fame. More people will be involved and by doing regular Cardano meetups, more people will get familiarized with it and gain updated knowledge from time to time. The proposer has identified the need for conducting Dubai Cardano Meetup and they have also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 4, "q1": "The proposer has a very innovative idea of introducing Dubai Cardano Meetup and they seem to be very well experienced in the field of arranging meetups in Dubai. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 5000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The cashflow and people investing in projects is very high in Dubai, People of Dubai always love to invest in some or other creative projects , that is the reason they have top infrastructures in the world.\nProvided very less people with pension scheme, it is a great idea to bring all the people, and help them in providing education over block chain , which has the very great future ahead , conducting events and even making people speak about their knowledge over cardano, helps in removing  more communication barrier set by the society over block chain hence proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The Proposer has 14 years of experience conducting events in Dubai with some of the influential peoples , which will definitely boost to complete the project, the proposed idea has minimal risk involved in it , where it just needs one excellent speaker,  which is the proposer by himself and a venue to conduct such events.\nGetting  social media influencers wont be hard to find these days, The main challenge is how many events can proposer conduct with 5000$ in the city like Dubai, will the provided budget sufficient to complete the task will be a challenge , hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposer has clearly mentioned about his experience and has introduced his team  with whom he'll working for this model.\nThe proposal has provided excellent goal such as making audience speak , which will definitely help in removing doubts on block chain, proposer has even mentioned about making social media groups which will boost among people to interact about the block chain and also clarify some of the doubts regarding block chain among them , With such groups proposer can monitor the changing ideas of people towards block chain, where he can use those points in next event to draw more attraction towards block chain hence ,the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Meet-up  events are one means to attract people to the Cardano and to inform and make aware about what are the ins and outs of it.\nHosting such activity and having a network well established willl surely increase the chances of impact of the hproposal to the Cardano", "q0r": 5, "q1": "The area (Dubai) where the proposed events will be taking placec is well known for its connection to the finances, including crypto currencies. Also, the Proposer is already involved in organizing previous meetups on various topics, so holding the one around Cardano would be easy for him, as they havev experiencec doing it, and also have developped a netwok of people to reach out to. All these elements contribute to the success of this proposal.\nAnother element of interest, almost twenty people have already joined the Cardano catalyst through the impulsion of the Proposers.\nThe budget is reasonable for the planned activity during the timeframe presented.", "q1r": 5, "q2": "Other than nall  the indicators mentioned by the Proposers, it would also be necessary to collect the number of Meetup participants. And the process by which the community will audit the success and implementation of the proposal hasn't been revealed.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposal starts with describing a fact in Dubai rather than stating a problem relevant to the challenge. It is unclear how the issue of missing retirement and investment options for expatriates will drive the expansion of the Catalyst community. The suggested solution of hosting meetups to introduce Cardano in Dubai venues has some potential to attract people and trigger them to bring new ideas and proposals in project Catalyst. However, the solution lacks clarity on how to achieve onboarding new members in Catalyst and it is too generic without focusing to the actual challenge. The proposal fails to suggest any clear KPIs to fulfill general onboarding and innovative processes as suggested in the challenge.\nI disagree that this proposal effectively addresses the challenge, therefore I rate it with a score of 2.", "q0r": 2, "q1": "The competencies, skills and knowledge required to run the meetups are not mentioned anywhere in the proposal. The only reference is that the proposer has experience on hosting similar events in private venues. This information is not enough to confirm the feasibility of the proposal so I would suggest that the roles and skillsets are clearly specified to run such activities. Also, the team members are mentioned by name and no roles are described.\nAlthough the budget is broken down in identifiable items, it misses a short analysis how the requested amount is derived. For example, what is the expected cost for hosting one meetup or how many meetups will be hosted in a month?\nThe proposal fails to provide a clear and detailed plan of the activities to be performed during the meetup. There is no timing, no reference on the contents of meetups and most important nothing is mentioned about project Catalyst throughout the proposal. The last point is the main reason that this proposal will not be implemented successfully. Therefore I rate it with a score of 1.", "q1r": 1, "q2": "The proposal fails to provide any KPIs or other metrics to audit the progress and the outcome of the meetups. The success is not clearly defined and there are no means to measure it. I see some questionable items that proposal does not answer: How is it possible to base the success on the number of hotels that wish to host venues? What does it mean well organized events in beautiful venues and how is this related to a success? Why a waiting list of attendees contributes to the success?\nBased on the above I strongly disagree that the proposal is auditable so I rate with a score of 1.", "q2r": 1, "assessor": "z_assessor_614", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "There are a lot of holes this proposer needs to address. First would be the problem statement, with emphasis on \"...without pension investment options.\" This in itself does not correlate with key metrics of this Challenge setting. This Challenge is not to create buzz for people to invest in Cardano. This Challenge setting is to activate lurkers and invigorate new members to join and be part of the Project Catalyst process. A process that is heavy on education and creating innovation, which is far from this being an pension investment option.\n\nThe solution though, does give hope for it states that there is an effort on introducing Cardano to the wider Dubai Cardano community (which would be helpful if there are data/links that supports this) through education and sharing knowledge on Cardano. The format though is highly debatable, 5 minute sessions to explain blockchain or crypto would be very hard to do, this is something the proposer needs to work on by doing further research on Cardano's ecosystem. Being a Community Advisor with all its functions, at the very least would take around 15 to 20 minutes to explain.\n\nThen there is a heavy emphasis on partnership with hotels as key on delivering this proposal's solution. Taking this statement and everything in, I would start all over and recommend the proposer to be more involved in Project Catalyst. Simply starting reading other proposals, then getting into various community Discords. From there try to join in on the main Town Hall and branching from there. Just to get the feel of the community. Eventually when Fund round is closing in, start to get deep with all the process of Catalyst School. It is a long laundry list, that might take this proposer 3 (three) months to go through, but coming from my personal experience, it is highly recommended to do.", "q0r": 2, "q1": "Although the proposer mentions they are quite experienced in hosting events of this nature, no database is provided to back those claims. Having some form of credentials would have help in gauging the capability of the proposer in delivering this event.\n\nThe budget is a source of confusion, $5K for 4 (four) events in Dubai seems quite challenging and raises questions whether the proposer would be able to deliver on their action plans and KPI's. There are even notions of flying in speakers, which further adds confusion on how will this amount cover all those costs. Again, I highly recommend this proposer to at this point, please do review similar proposals, and there are indeed similar proposals and try to learn from them. To see what can this proposer do to improve the likelihood of hosting offline events.", "q1r": 1, "q2": "There are metrics that would like to be achieved but there no leading action plans or budget use case that supports these claims. There is also no mentioning on the method they will report their progress to the larger community, let alone to IOG. Unfortunately a lot of work and studying needs to be done by this proposer. Recommendations I have already shared above. If the 3 (three) month period of understanding Project Catalyst might seem to long, than I would highly recommend to directly attend the workshops of Catalyst School on how to make and submit a proposal. Please do also consider taking the MIni Proposal workshop.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This project is a proposal to create monthly meetings in Dubai. The aim is to create the social connection of the Cardano Dubai community and help raise awareness about Cardano. The main content of the meetings revolved around the exchange between Cardano community members and the sharing of the speakers about cryptocurrency and blockchain. The meetups will help attract new members, helping more people to participate in the Cardano Dubai community. The project matches the requirements of the Challenge.", "q0r": 5, "q1": "The implementation plan for this project is not specifically written down. There are no steps, implementation time, work items to be done… The planning part only deals with the preparation of marketing through social media channels. Therefore, the reasonableness of the plan cannot be tested.\nRegarding the budget, the budget is calculated for the first 4 months of operation. The costs required for 1 month of operation are listed and multiplied by 4 months. Due to the lack of a detailed plan, it is not possible to assess with the costs listed whether the team will be able to carry out the proposed plan.\nRegarding the main members of the group, only names and positions are given, there is no explanation of roles and tasks in charge of this project. And there is no description of experience, proof of experience, skills. Therefore, I have no basis to consider whether the proposed team is qualified to take charge of this project.\nIn short, the proposed team has not released enough information and grounds for the CA to evaluate the feasibility of the project. The proposed team should have a detailed plan, a specific budget spreadsheet, and detailed membership information.", "q1r": 2, "q2": "The proposed team provides criteria to measure the development of the project. However, the proposed group only provided a description, there were no specific expected data for each indicator. And the way to check and measure progress is also not included in the proposal.\nRegarding the success of the future project of project, according to the information in the proposal, only a rough glimpse of future successes can be seen without specific predicted target numbers. The project needs to have the right KPIs to measure the project's success in terms of plan and reality.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "The solution is to host meetups monthly in a public venue to leverage the Dubai Cardano community's social connections and drive awareness ", "experience": "I have personally organised and hosted over a dozen successful events in private venues for the last 14 years in Dubai, gathering some of the most influential people from diverse backgrounds and segments of the economic landscape."}