{"id": 403911, "author": "rhysstoic", "title": "FreeLoaderz: Load Balancer", "url": "https://cardano.ideascale.com/a/dtd/403911-48088", "category": 26450, "amount": 5000, "description": "Running worldwide submit API services (for wallet custom node option) at scale requires adding to our existing routing infrastructure", "f6_no_assessments": 7, "f6_rating": 4.142857142857142, "videos": [], "media": [], "f6_assessments": [{"id": 124, "q0": "well ,,,  i sow the video and read the idea .  \nthe proposal can improve the Ecosystem very much reducing Tx cofirmation time for users on cardano network , espicially for users who use DeFi and need speed confirmation .\nit can solve the network bottle nick until Hydra applied , so i,m 100% with it and wishing it all the luck to win a fund this round.\n\ni like it when i see a team making a real proposal that benefit the Cardano ecosystem  and the community and as some one typed in the comments : \nHelping Cardano user helps the system as a whole and this proposal does it .", "q0r": 5, "q1": "the product is tested and wouldn't effect security if the team worked hand in hand with the Techs in IOG and every thing is open source for every Developer to audit code  .\nand lots of SPO would join and apply it as long as its authenticated from IOG .\n", "q1r": 5, "q2": "well ,,  the project exist already and tested on small scale ,,,   so when the fund is here i don,t see any problem finishing it in 4 weeks .\nThis proposal is from the community to the cummunity . ", "q2r": 5, "assessor": "z_assessor_1054", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 742, "q0": "Alignment with the challenge setting is low at best, nonexistent at worst.  Rather than onboarding to Catalyst, it is a more general Cardano onboarding proposal, and more specifically a new SPO onboarder, and more specifically not an onboarder at all, but an existing submit api infrastructure expansion to help nami and ccvault users (or any wallet that can choose a custom submit api endpoint presumably) bypass the api backends, like blockfrost.io to get onchain.  While a valuable scaling protocol, the service and suggestion here are for more advanced participation levels on Cardano, in particular for wallet users who want to speed up their transactions.  The average new member has no idea whether their txs are slow, and would be lost trying to change endpoints or messing with any parameters in their wallet.  As a scaling protocol, freeloaderz is an interesting module worth supporting imo, on the grounds that it comes at decentralization from a different way.  I have questions about the longterm scalability of the protocol for SPOS, but I do think there is long term potential here for wallet-developers (with end users not even aware of it in the long run).", "q0r": 4, "q1": "I would have liked to have seen team details for this proposal as, even though I know who the proposers are, that may not be the case for most voters.  What I can say is that they plan to spin up the node(s? it was unclear whether they were spinning up both usa1 AND europe1 OR just one of them...OR elsewhere they mention 3 servers) in 4 weeks and I have no doubts they can, as they are experienced SPO operators who help single pool operators with their setups all the time.  I am curious about whether this will be an aws or baremetal relay, which some voters may care about as well...  The budget doesn't clarify any of the issues, but we can expect the server setup to be $1k each which is borderline baremetal imo.  It would be good to see a roadmap here, breaking the serve setup into three parts, but as a 4 week project, it is understandable why they didn't feel the need to include it.", "q1r": 4, "q2": "Again, a roadmap with the deliverables would have paid dividends here, but the team is essentially looking to spinup and install the protocol, and then finalize in 4 weeks, so, unless there are blockers, there won't even be any progress reports!  The big issue here is the lack of any KPIs that could help tie this proposal to the challenge setting...but I don't think that is possible.  I would have liked to see something along the lines of a current adoption or use rate and a target for this going forward, but I'm not sure the available SPO metrics could capture this.  In the end I would have liked to see this proposal in another challenge setting, where the grades across the board would be better.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1295, "q0": "This proposal addresses the challenge specifically for Pool Operators, but not over all. It doesn't quite onboard new members, it doesn't lead to more meaningful participation within Catalyst, and it doesn't enhance contribution within Catalyst. But! There is a community building inside the project, which may be meaningful and helpful interaction - a lot of Staking Pools are collaborating already, as we can see on their website. Although this may not be the best fitting challenge for this proposal, the proposal clearly articulates how it adds value to the Cardano ecosystem.", "q0r": 3, "q1": "The budget is laid out very clear and it is clearly stated for what it will be used. The plan is very short, but as stated by the proposal, the money is used for buying infrastructure and the time managent is regarding setting up the infra. This does not require a very detailed plan - still, there is missing the \"how\".", "q1r": 4, "q2": "Although the roadmap is very short, it is clearly laid out. The success too. The problem and solution statements are again not truly addressing the challenge, but still, they are clearly articulated. As assessed before, the community inside the project seems to be onboarding in a nice and neat way, just for a specific kind of people (SPOs). The attached interview gives more insights into the vision of the proposal - it is a full hour of talk without timestamps and without summary, though. This raises barriers to the understanding of what this proposal is really trying to achieve. - In summary, I see the success of this proposal, but I wished it gave more insight into what will *actually* happen with the success of this proposal which is proposed to buy more infrastructure.", "q2r": 4, "assessor": "z_assessor_1337", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2745, "q0": "While this proposal will likely have a significant, positive impact on the Cardano Ecosystem, it does not address this particular challenge well and it would have minimal impact on Project Catalyst itself.  This may have been better categorized in the miscellaneous category for this fund.", "q0r": 3, "q1": "The proposers have demonstrated a high level technical knowledge and successful implementation of this technology.  FreeLoaderz is a technology already used by the community and supported by many notable SPOs.  I believe it highly likely the team can implement this proposal successfully and in a timely manner.", "q1r": 5, "q2": "The team is proposing a 4 week timeline for completion of this project.  This is a realistic amount of time given the proposer's experience and technical skill.  The Cardano community could could audit the installation of new hardware and it's effect on the scaling of the FreeLoaderz project.", "q2r": 5, "assessor": "z_assessor_1574", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5670, "q0": "This is a well written proposal with clear objective goal, and the team has proven they are capable of implementing the proposed solution, as they have already accomplished the task, and simply require funding to scale the solution. Although there is not a detailed discussion in the proposal about how this would bring new catalyst members on board, and there may be a misalignment with the proposal and the funding category. It may just requires more explanation, and they do mention creating a DAO to manage the infrastructure so I believe the proposer and spo's involved will become frequent catalyst users if this is funded. If this is funded and scaled up, more SPO's would likely get involved as well. More knowledgable SPO's getting involved with Catalyst will bring important technical skills into the governance system of Catalyst, and can have a valuable long term impact. ", "q0r": 5, "q1": "The team is capable of implementing this, as it appears to be an extension or duplication of previously completed work. The proposer is a successful stake pool operator with sufficient technical skills and knowledge of Cardano infrastructure and community. The member SPO's involved are not specifically mentioned by name in the proposal, however they are listed on the website provided via link in the proposal. The budget is clearly defined and reasonable, and the implementation plan is straightforward. They have provided a generous but reasonable timeline that will give them ample time to complete this work. They have acknowledged the risks around governance, and plan to use catalyst and their technical abilities to create a DAO structure to manage the decision making within the group. ", "q1r": 5, "q2": "This proposal will be Audited by the SPO's involved and the community to insure the deliverable is completed in the 4 week timeline. The proposer may wish to include instructions for how the larger community can audit and verify the success of this proposal, and include technical metrics regarding network load, decentralization, etc. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7865, "q0": "My first take of this proposal is this should be in the Cardano Scaling Solutions category. Besides that, what the proposer and his team offered (and have done) is very appreciated to help the Cardano network. The impact of this initiative has been felt already by the general ADA users. With the growing usage of Cardano recently, the more the load balancers are deployed in the network, the smoother the user experience will be.  ", "q0r": 5, "q1": "The proposer and his team will be definitely successful in deploying this project. Given the combined timeline and simple budget breakdown, the risk is only from the project team's commitment. I recommend adding an action plan for the next three years with some evaluation metrics, which indicators need to be looked at in the Live Dashboards for general ADA users to understand.", "q1r": 4, "q2": "In terms of Auditability, I believe the proposer and his team need to add evaluation metrics, which indicators need to be looked at in the Live Dashboards to measure the project's effectiveness and for general ADA users to understand. The team could also modify the website to include any information related to the project, such as development phases, periodical review schedules & results, etc.  ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9645, "q0": "This proposal is part of a 2 proposal project (suggestion for proposer: there is no mention on what the other proposal is, pls include it in future occasions ) aiming to solve a problem that seems to make sense and the solution they describe looks simple and effective, it has a technical component that I will not address since I do not have the knowledge to do so.\nOn the other hand, the proposal is very clearly participating in a challenge where it does not belong, nothing in the proposal mentions how it will help to onboard new members to catalyst. \nI suggest to the proposer to place this proposal in the correct challenge as it would be against the community’s voted intention to fund it with the resources assigned by the community new member onboarding.\n\n", "q0r": 1, "q1": "This is a highly feasible, simple action. Just purchasing some hardware and setting it up. A 4-week timeline to deploy and it should work for about 3 years. The requested funds are clearly assigned and are reasonable amounts.\nThe proposal mentions no KPIs and therefore the only way to measure success is if the thing is active in the time mentioned. I’d suggest to the proposer to include some metrics focusing on the outcome to provide some sense to the community of how success should be measured. If the intent is to increase the ability to balance the network load across all SPOs then some numbers regarding that should be mentioned and tracked to see how the proposed solution works. These are community’s funds and reporting back the outcome is important.\nThe proposer has a good reputation within the community and seems to have the necessary knowledge to make this happen.\n", "q1r": 4, "q2": "The actions and deliverables mentioned in the proposal are simple and easy for the community to audit. The outcomes of such actions should be easy to verify too but they are not included in the proposal. \n", "q2r": 4, "assessor": "z_assessor_740", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Deploy the infrastructure needed to continue providing a free service to the community\nExpanding on what is already in place.", "experience": "A Group of SPOs operating under FreeLoaderz.io with software, front-end and network admin experience, all working together by sharing skills and collaborating on this project. We have practical knowledge of Blockchain, Plutus & Haskell."}