{"id": 404182, "author": "easterntownhall", "title": "Connecting Asian Voter and Proposer", "url": "https://cardano.ideascale.com/a/dtd/404182-48088", "category": 26450, "amount": 15000, "description": "Language barriers and cultural differences creates a lack of trust on sources to rely on before and during the voting period.", "f6_no_assessments": 11, "f6_rating": 4.909090909090909, "videos": ["https://www.youtube.com/watch?v=t86e0M-262A&start=3561", "https://youtu.be/-YUu-k_KVUo"], "media": [], "f6_assessments": [{"id": 1373, "q0": "I am one of the proposers on Fund8 and I also meet the problem your team wants to solve that the proposer and the voter can not meet together before the voting round. This is the reason maybe affect the quality of the proposal because if the proposer can not interact with the voter who is a target customer of the project. The proposer can not understand the right paint points of them, so the proposal can far from reality. I very much appreciate your solution, such as your team will create content with suitable language for each community in Eastern Asia, because English is not a parent language of these countries, so this is one of the huge obstacles to make many the voter can understand what proposer wants to do in their project. In addition, we need proposers to appear in social channels more and more to talk about their plan, what are their proposal, so the voter can give them the advice to adjust the proposal and no need to wait for CA round to make an assessment, and I see your team have mentioned in this proposal, it is a good direction.", "q0r": 5, "q1": "I see your team member is quite talented and has a lot of experience in the Catalyst Project. This is the main factor that can make the project will be successful. Just the only small thing I am concerned about is your team comes from a lot of countries with different cultures and time-zone, and maybe a different job, so your team will build a general marketing channel for proposer and voter for all countries or make it, particularly for each language or each country, because this thing will affect the manpower or cost for the project. If your team makes it clear and in more detail, I think it is better. ", "q1r": 5, "q2": "In my opinion, I think your team's target is to increase 25% the Catalyst Proposals available in three languages (ID, JP, VN) for each Fund is quite optimistic. Because the total valid proposals submit for Fund8 still now is more than 1078 (source: https://docs.google.com/spreadsheets/d/14pk-FpIOph1WLkKybYGcqWLiUG5WpPJ59cLsMyYhueU/edit?fbclid=IwAR0E5N7DQGoRjutYpHRfvrY4vZg7tSEQKrk_q0xD5xD_3lkvPIp86xf0eHI#gid=837850503), and the total proposal of Fund7 is 936 (Souce: Catalyst), increase 15%, but I still believe your team can reach the number 25% because if your proposal is funded, you can do a lot of things to increase the number of proposals in Eastern Asia.", "q2r": 4, "assessor": "z_assessor_1344", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2505, "q0": "This proposal identifies the problem of language Barrier in respect to individuals feeling confident to both vote and propose in the Catalyst funding process. It meets the criteria of the challenge by providing spaces  and translations of documents to specifically support Asian community’s through the voting and proposing process. Along with providing a community base for specific language groups. This will promote onboarding and participation from individuals who previously may have felt excluded from the catalyst community. I see this proposal as having strong impact on the catalyst and larger Cardano community by opening up possibility’s to not English speaking groups. Thereby encouraging diversity and decentralisation within the ecosystem.", "q0r": 5, "q1": "This proposal is a continuation of work funded in previous funding rounds. The large and experienced community team have successfully implemented previous proposals. As the team is community-based And the roles overlap if an individual is unable to fulfil their obligations to proposal other team members would be able to easily step in to keep the project on track. The budget is well laid out and goals and timelines are clearly stated. The team acknowledges the requirement for accurate and understandable translation For certain aspects of this proposal to be successful.", "q1r": 5, "q2": "Within the proposal the team have laid out goals in a measurable way allowing the community to easily audit their progress. As the majority of the work produced in this proposal will be for the community by the community, it is by nature transparent. If this proposal is funded the community will easily be able to check the progress of the proposal and measure its performance and success simply by checking the content that has been created and monitoring the metrics provided as goals for success.", "q2r": 5, "assessor": "z_assessor_1513", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5024, "q0": "This proposal they say they will provide reliable information, before and during voting for the community in their local language and culture to help voters understand the proposal, to break the language barrier making it easy for ADA holders in Asia to participate in voting. So it perfectly fits the challenge.", "q0r": 5, "q1": "The proposed group provides a three-month operation roadmap, with the contents of the work to be done in each month listed in detail. The total amount applied for funding are $ 15000 divided into 6 categories with specific, detailed and reasonable amounts. The proposed group is quite large with 9 key members and 3 advisors. They are all experienced and active activity in Catalyst. I advise them to add proofs, links to prove their experience to make it more convenient for CAs, new voters joining Catalyst for the first time easier to check. Even though I already knew they were active members.", "q1r": 5, "q2": "The project has a roadmap with defined timelines in 3 months. Tools to measure performance are done regularly with constituencies, goals are clear, specific with KPI metrics defined as project progress.", "q2r": 5, "assessor": "z_assessor_1820", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6323, "q0": "The proposal raises the issue that language barriers and cultural differences create a lack of trust in sources of documents before and during voting. The project's solution to the problem is to provide reliable information in the local language and culture to help voters understand the proposals correctly. Their solution offers six mutually supportive areas such as: Producing Content production, organizing Eastern Hemisphere language-specific events, creating a language translation system for East Asian countries, offering language-specific Catalyst Swarm stories, social media marketing, conducting periodic surveys and user research. In addition, they have also presented the work that they have done successfully, which shows that the proposal needs to be supported by the community. They also introduce risks such as ensuring translation quality, interacting with votes and proposals, and also offering solutions to reduce risks. For the reasons above, I highly recommend this project.", "q0r": 5, "q1": "- The proposal provides implementation plan in 3 months and have specific tasks for each month such as: Producing voter educational videos, these videos have subtitles in three languages; Collaborate with Catalyst AIM to provide proposals with explaining videos to voters; Translating documents for Catalyst voter...\n- The budget that the proposal details compose of six parts. These sections correspond to specific funding.\n- The project's personnel is very large and has a lot of experience. I realize that with a clear plan, detailed budget and strong team like this, the project can be completely successful when funded.\n", "q1r": 5, "q2": "The proposal provides specific metrics such as increase in the number of voters in the Eastern Hemisphere, increase in the number of CAs, vCA in the Eastern Hemisphere... At the same time, they also give the success of the project by the indicators, such as: the number of City Hall meetings increased by 25% per Fund; Proposed Catalyst 25% increase in three languages (ID, JP, VN) ... They also provide a lot of information about related projects that have been funded in F6, F7 and F8. I believe the project will be successful when funded.", "q2r": 5, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6570, "q0": "The challenge exemplifies a important layer of onboarding different cultures/countries to the Catalyst project - making aware that major gaps exists in particular for Asian voters, who want to vote but are not fully equipped to perform an informed choice. The concept of interactive engagement is crucial to  \"make tangible\" a written document like a proposal and fully understand the magnitude of proposals and the decision taking around voting.", "q0r": 5, "q1": "All team members are already involved in Project Catalyst. It is a diverse group - fact that is important to realize and empower the connections that need to be build among voters and proposers - they can act both as bridging the conversation through facilitation, but also establish an \"go-to-anchor\" for the Asian community - positioning that way Catalyst project as a sophisticated global innovation platform. ", "q1r": 5, "q2": "The proposal gives a clear roadmap with specific measureable KPIs, as well as target state of explicit outcome aspired (e.g. 25% increase Easter TH participation, or Asian proposal presence increase by each fund). To even strengthen those goal setting and measurable impact, I recommend to look at nominal numbers for the KPIs established (e.g. number of participants for each Eastern TH as of today) since this can underpin the importance of \"25%\" to a more tangible number - eg is the base of measuring the goal 25 people, or is it 100? This detail might be more relevant once the team is expanding operations and might need to request more funds.", "q2r": 5, "assessor": "z_assessor_433", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7767, "q0": "This proposal addresses the problem within challenge, that is to onboard new member. This proposal is directed towards voter and proposer in Asia. By providing reliable information with content and events using specific language for each country, this proposal will able to scale and address future challenges by onboarding broad people who doesn’t speak english. They also able to explain why it is important to have diverse community and different language-speaking group to join the Cardano ecosystem. ", "q0r": 5, "q1": "They provide the team members, also with the consultant team. The team is proven to have a relevant work track record. They provide the team budget in detailed manner, as well as their realistic time table and milestones. Such as the goals for Month One, Month Two, and Month Three, it’s all clearly explained in detail. The budget have already broken down into allocation for different aspect, such as for video production, marketing communication, etc. Overall, this is a well made proposal that explains clearly about their plans, I’ll give it a 5 star.", "q1r": 5, "q2": "They’re able to explain the roadmap and their Metrics/KPIs. Such as the metrics for increase Eastern Hemisphere voter participation by 25% from the previous Fund, The Easter Town Hall average bi-weekly numbers increase 25% for each Fund, etc. We can track their progress and work from the website provided. I will give it a 5 star because it is clear and concise, and publicly available event that is easy to check and audit.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7866, "q0": "I fully support this proposal as an ongoing effort to increase Cardano inclusion, especially within the Eastern Hemisphere communities. However, in my opinion, one of the important points that needed more attention in this project is how to attract the voters to join and interact in IdeaFest and IdeaFest Reels. It is imperative that voters can have direct interactions with the proposers to establish feel & trust, either by giving verbal or written questions, with the possibility of using their own language. So, the focus is not only on the translated materials but also the 'emotional aspect' from diverse cultures.  ", "q0r": 5, "q1": "The proposer team consists of individuals who are active contributors to the communities. This proposal is a continuation proposal with a detailed budget breakdown and timeline. In addition, there are several aspects that need to be considered as well, such as the time and duration for IdeaFest and IdeaFest Reels. Would there be another IdeaFest that could match the Eastern Hemisphere timezone? Would it be good enough for voters to gain and shape their understanding from the proposers during the speed round? ", "q1r": 4, "q2": "From the Auditability view, the website is still not well maintained. But hopefully, it will be updated and maintained afterward. I would expect more articles, video links, social media links, and any survey results put into the website. Later, other communities can see clearly the growing progress of communities from the Eastern Hemisphere.", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8820, "q0": "proposer raises the problem that Language barriers and cultural differences create a lack of trust in the sources to rely on before and during voting, the solution to this problem is to provide reliable information. trust, before and while voting for the community in their local language and culture to help voters understand the proposition, they will produce content to help ADA holders understand the importance of the vote\nLanguage-specific events in the Eastern Hemisphere focused on voter education and discussion\nProposal to create a language translation system to help proposer reaches the wider East Asian community\nStory of Catalyst Swarm in language specific\nSocial Media Marketing: socializing voter content and messaging on our social media channels; and\nConduct periodic surveys and user research to help understand individual attitudes towards Catalyst and recommendation formats.I agree with Proposer that this project is perfectly suited to the challenge that once this projects is successful, it can be applied to other regions of the world. I understand the purpose of this proposal is to bring voters, proponents, and proposals closer together, the solution of this proposal may solve part of the problem. however, in my opinion, the core issue that voters are not interested in voting is economic benefits. voters get very low rewards so there is no incentive to dig deep into the projects, and when they vote wrong they don't lose anything so their votes, in my opinion, are more emotional or they will choose projects with more stars to vote for. To thoroughly solve the problem of Catalyst, we should focus on 2 main objects: voters and Proposer. I read this suggestion and I think it might work (https://cardano.ideascale.com/c/idea/400998.)", "q0r": 5, "q1": "The proposer says they represent the Eastern Town Hall (ETH) Initial seed of trust and new members are coming. The main team consist of 9 members and 3 advisors. they are all active in Catalyst and community groups in the ecosystem. The total budget applied for this project are $15000. be dedicated to producing voter education videos; Proposal presentation video production; marketing and communication; site maintenance; project management; project documents. The budget is divided into sections, with the content of work for each item, which I consider reasonable to achieve the set goals. The proposal has foreseen the risks that may be encountered and provided a plan to solve that problem.", "q1r": 5, "q2": "The proposer provides a three-month action planed that clearly outlines the work to be done. The main metric for measuring performance are the voter survey. The project defines success when the Easter Town Hall Biweekly Average increases 25% per Fund\nCatalyst Proposals available in three languages ​​(ID, JP, VN) increase by 25% per Fund\nProposals from the Eastern Hemisphere were widely voted on and received funding with 25% growth from the previous Fund.\nThe survey results show that the level of voter participation increased by 25% compared to the previous Fund\nEastern Townhall's social media account gained 250 new followers in three months. this project is a follow-up to the East City Hall proposal, which has been continuously funded from Funds 6, 7, and now 8. I have all the information and data to gauge the success of the project. this case.", "q2r": 5, "assessor": "z_assessor_706", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8962, "q0": "It is certainly that the project is a great idea and fits very well with the objective of the challenge. It aims to build an event stage, which is in bi-weekly Eastern Town Hall, to help voters understand proposals by providing reliable information in their mother languages and cultures and help to connect voters-proposers.\nThis project will help Asian voters as well as Asian Cardano community easy to understand proposals in a covenient way and saving time (to read by themselves and struggle to translate proposals). If this project is executed successfully, it will help voters to have reliable information to vote better and our community will have more quality projects which are capable to get fund. This is extremely important because increasing the quality of voting is rasing the growth of Cardano system and project Catalyst. I found so interesting with the “six mutually reinforcing areas” of the proposal, due to that section we are clear about the contents of the event stages, and the proposal addresses most of the challenge's Guiding Questions: - How might we convert passive ADA holders into active Catalyst members? - How might we increase more meaningful participation from challenge teams, proposers, advisors, mentors and voters? - How might we increase awareness of Project Catalyst as the most active open innovation platform?\n\n", "q0r": 5, "q1": "The proposal with all of team members are active fulltime Catalyst Community members: they are Cardano Foundation Ambassadors, Founder of Catalyst Swarm/School, Eastern Townhall Co-Organiser, Challenge Team members, ETH co-host, QA DAO Founder, developers, funded proposers, CAs, vCAs,… with rich experience and skills relevant to organizing and hosting Catalyst events. The social links which are included tell us more details about them, who they are, how to connect them, ect. Therefore, feasibility of the proposal should not be a problem.\nRegarding to financial amount, I think $15000 is quite fair and reasonable and it is broken down in details as we can see how the money asked would be use.\nThe team explains a plan, which is in a period of 3 months, in a very clear, understandable way, it helps readers be able to understand what would happen, how it would happen, in which order and vision. \nAll of them make the proposal is fully feasible.\n", "q1r": 5, "q2": "I strongly agree the proposal is fully auditable because they make it very clear what the success metrics and KPIs would be, moreover they will provide a transparent and understandable process by publishing documents in Eeastern Town Hall github. Information is provided with an excellent levelof detail, which allow us to understand what result would be expected, to consider the success achieved, and what are the specific goals in 3 months, and we see what the team’s ambitions are as 25% is not a small number, I still believe completely that the result will be reached in expert hands of the team.\n\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9624, "q0": "This proposal provide a clear problem of the lack of trust caused by the language and cultural barrier in the voting process. Which corresponds to the needs of the challenge, by proposing to bring voters, proposers, and proposals closer together. The positive impact is conscious and clearly explained by the desire to establish bonds of trust, better communication, and the development of a specifically designed program and finally Feeding their collective insights back into Project Catalyst. The KPIs are consistent with those of the challenge. This proposal is able to address future challenges, as part of a progression from fund 6 to fund 8. ", "q0r": 5, "q1": "All team members are easily identifiable, their contact details are given and their skills are consistent with the needs of this project, it seems like a strong team with most of the members already having good experience in the community.  \nThe collaborators are numerous and well established in the ecosystem, the fact that they support this project constitutes an additional index of confidence. The budget is very clear and detailed, linked to the different stages of implementation. It seems consistent. The technical aspects of setting up are also very clear. The clarity and all of the information given make it possible to envisage the success of the implementation of this proposal.\n", "q1r": 5, "q2": "The website link is given and provides a lot of information, as well as the attached videos. The roadmap is clear and detailed, it allows you to clearly identify the different stages of the project. KPIs make sense with both qualitative and quantitative success indices. It will be possible to follow the progress of the project thanks to their website and their GitHub admin across all communities. Finally they specify: “By close communication, coordination and collaboration with the Catalyst Swarm, The Catalyst School, the Ambassadors Guild and the Bridge Builders, we build a Network of Community initiatives”: the communication and transparency effort of this team is certain and also proved by this clear and complete proposition. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10723, "q0": "Voting also plays same vital role as CAs an VCAs , As Voting is a method for a group, such as a meeting  in order to make a collective decision or express an opinion usually following proposals , It must be given to much importance, \nFor this democratic process within the catalyst community it shouldn't be as lack of trust as proposer mentions, \nThere shouldn't any Language barriers and cultural differences creating lack of confidence on the process before and after voting,\nProviding all the information irrespective of  before & during voting to communities in their local language & culture to help voters to understand better,\n  This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The experience provided by proposer worked and being Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, Cardano Stake Pool Operators (SPO), IT & Software Engineering, Blockchain Devs, Plutus/Atala Prism Pioneers, Educators and Accountants all are impressive,\n\nWith increasing awareness of ADA holders voting importance,   building voter awareness, engagement and trust through Social media is great idea,\n\nAs example provided Japanese support in voting process is minimum, similar way many people doesn't,\nreaching them and making them vote is great idea,\nkeeping voters informed, engaged and encouraged and with constant communication will help users to vote  irespective community.  \nwith Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "By looking at given detailed plan and timeline,\nMonth one to three process is impressive,\nEvery month step is having given great importance to each step is good,\nfrom Continued production of our Voter Education videos to Brining voters from every language is notable work,\n\nWith budget provided from making video's, marketing it,  Website maintenance, Project Management, Project documentation and housekeeping every cost mentioned is reasonable and can be audited,\n\nThere team divided into Core team and consultant team every individual team member experience is satisfacorty,\n\naverage bi-weekly numbers increase 25% for each Fund which is remarkable,  it will bring enough new voters, Eastern Hemisphere  voting growth of 25% from the previous Fund, \nwith all the above information   provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Provide reliable information, before & during voting to communities in their local language & culture to help voter understand the proposal.", "experience": "Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, Cardano Stake Pool Operators (SPO), IT & Software Engineering, Blockchain Devs, Plutus/Atala Prism Pioneers, Educators and Accountants"}