{"id": 404177, "author": "easterntownhall", "title": "Onboarding East Asia Today", "url": "https://cardano.ideascale.com/a/dtd/404177-48088", "category": 26450, "amount": 15000, "description": "Despite a population of billions, East Asia is underrepresented in Catalyst due to a lack of localized content and Townhall participation.", "f6_no_assessments": 7, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"id": 2443, "q0": "The goal of the New Member Onboarding challenge is to increase the number of qualified challenge teams, proposers, advisers, mentors, and voters available. Despite having a population of billions, East Asia is underrepresented in Catalyst due to a lack of localized content and Townhall participation. This proposal aims to get existing Project Catalyst Fund series content translated into the respective local language of the communities represented in Eastern Town Hall. Passive ADA holders might become active Catalyst members as a result of increased awareness of Project Catalyst as the most active open innovation as a result of the introduction of many languages to the Catalyst ecosystem. In the Catalyst ecosystem, this idea will also encourage the usage of existing text, video, and audio assets. This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has demonstrated his knowledge and competence in block chain, especially Cardano, over time and has the essential skills to carry out the idea,   knows the right  team members required to carry out the plan, and creates a budget that is broken down in order to fulfill the goals. A realistic schedule for finishing the work is also included in the proposal, as well as a clear and actionable implementation plan that indicates what is being done and how it is being done. The proposer has considered the issues that may occur during implementation and has proposed solutions to these issues. As a result, the issue solution suggested stands a good possibility of being implemented.", "q1r": 5, "q2": "The proposal offers enough information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the effect and feasibility categories.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 6322, "q0": "The problem with this proposal is that East Asia is underrepresented in the Catalyst because of the lack of localized content and Townhall involvement. Their solution is to build a system to translate documents and proposals into different languages in East Asia. The goal is a streamlined process for translating the content and initially translating the content into the local language. They also tested a simple method using Git tools, GitLocalize, and GitHub Actions. The project announced that they have put the semi-automatic translation process to the test in Vietnam and Indonesia, the analysis data of the community translation team from Indonesia is very good. They give proof, which is completely verifiable. Besides, they also introduce some risks such as creating a system that balances community participation, high quality translation and translation speed. And the solution will be to create multiple iterations of trial and error. I find this solution reasonable and doable. Adding to the risk is that a reasonable reward/remuneration system needs to be gradually adjusted.", "q0r": 4, "q1": "- The project offers a clear roadmap. They do it for 3 months and have specific jobs like translating 4 topics per month at docs.cardano.org, expanding formats for translations to include video subtitles...\n- The project's budget is divided into 8 sections with specific and detailed works. I find this detailed budget breakdown to be perfectly reasonable. As for the 8th part, the provision of $1,000, equivalent to 6.7%, is a bit less than the risks mentioned in the previous section. The project when implemented should be cautious in spending.\n- The project implementation staff consists of many people, divided into two teams, the core team and the consultant Team. The core team consists of members who are fully qualified and experienced to implement the project such as: Andreas Sosilo - Cardano Foundation Ambassador in Indonesia, Cardano Indonesia Community Manager, Eastern Hemisphere City Hall Team; Angela - Haskell Plutus Instructor, Eastern Town Hall member, Gimbalabs PPBL, CA, VCA, Plutus Pioneer, Atala Prism Pioneer; Jack - Haskell Developer, Music & Video Producer…A 3-member consultant team, in which Andy Sibuea is an IT & Blockchain educator, Eastern Catalyst School member, Felix Weber is a Cardano Ambassador, founder Catalyst Swarm / School…With such a strong team, the project can easily succeed.\n", "q1r": 5, "q2": "Indicators are given very clearly such as main index, activity index, community index. These indicators all provide relevant links for detailed evaluation. The metrics that the project offers are consistent with the challenge. They also give very specific and detailed short-term, medium- and long-term goals. At the same time, they have a large team of human resources in many Eastern Hemisphere countries, who can speak and write their mother tongue well, this is the basis for the success of this project. They also have ongoing and ongoing proposals from F6, F7. I realize that this project will be successful when it is funded.", "q2r": 5, "assessor": "z_assessor_395", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6569, "q0": "Definitely, the proposal highlights the importance of Catalyst expansion in cultures/countries where an important ADA holder community is represented - nevertheless facing a language (Catalyst content mainly in English) barrier. With more content being available in languages relevant to the East Asian community - the higher the likelihood of active participation and engagement, as well as awareness of Project Catalyst in this region.", "q0r": 5, "q1": "The team and its members are already engaged in this project and thoughout the different proposal stages, evidence is given to  showcase ongoing work and outcomes so far. This makes a strong case for the likelyhood of implementation of this proposal. Regarding the budget break down, I recommend revise the assigment of budget to your \"core activities\", e.g. translation and review - as the foundation of all the work that follows. If you are to expand services, and scale as described - ensure a robust economic contribution model is in place to maintain the talent you have and to attract those you will need in the future.", "q1r": 5, "q2": "The team has outlined a clear roadmap provided by months of execution, including a set of actions they will focus on. Interesting KPI approach considering the ORBIT model - which is an adequate framework to measure attraction of new members and maintaining them - in view of building out strong community networks. It is clear that East Asian underrepresentation in Catalyst can be elevated by having access to translated, relevant material. I recommend to articulate a even more powerful solution statement to the problem, just because you are not \"only\" building a translation pipeline, but more important you actually translate the relevant content that empowers East Asian Community to engage with Catalyst more deeply and elevates representation in this space.", "q2r": 4, "assessor": "z_assessor_433", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6864, "q0": "Impact of this proposal:\n- facilitate access to information for people in the East Asia region: by translating the Cardano and Catalyst resources in languages spoken in that region will attract new people to join, and also to for the content to be more explanatory for those who are already part of the ecosystem.\n- expansion of the initiative: going from 4 languages as outcome of this proposal to 10 languages in the mid or long term period, this demonstrate the possibility of this project to be scalable.\nNew people, playing various roles is one the challenge goal, and there is an answer to that in this proposal.", "q0r": 5, "q1": "The budget in detailed and sellf explanatory as it is for the timeframe.\nThe examplel of the success in translation from Indonesia is revealing on feasibility of this type of initiative, but I would like to se proposers provide also examples of the other countries (Vietnam, Japan). this may help readers to assess whether similar or comparable resources may be available in the other regions/countries too.\nThe team is involved in the Catalyst and submitting this proposal as a phase of implementation of an initiative that has already started. What increases the chance of success for this phase too. However trhough my assessment work in thiis fund cycle, I ended up readind very similar or very close proposals to this one in the Grow East Asia, grow Cardano challenge. I would see a benefit on connecting with those teams and collaborate.", "q1r": 4, "q2": "The follow up is possible through the eastern town hall but also all the online platforms (Github...). The risk as assessor is to end up seeing similar initiatives for the same region around Cardano/Catalyst materials translatedwhat can be prevented by doing collaboration between proposera teams, even if it's in different challenges.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7766, "q0": "Majority of the world population are residing in Asia, is still underrepresented in Catalyst due to a lac of localized content and Town Hall participation. This is the problem that the proposal are trying to solve. They’re able to explain in details about the solution, which is to setup a pipeline to translate Catalyst documents & proposals to various languages in East Asia as accurately as possible. The key metrics and goals is aligned with the given challenge settings, which is to onboard new member and people into the Cardano ecosystem, especially Catalyst.", "q0r": 5, "q1": "Eastern Town Hall team member have a proven work track record, as they’re active in Town Hall meetings and Catalyst event. This proposal able to explain in details regarding their plans, e.g actively maintaining the translation material for GitHub and GitLocalize. This proposal also laid out the timeline details for each month. The budget is broken down clearly into identifiable manner, from hosting workshops, to website management and project documentation. Overall, this is a comprehensive and well written proposal, and everything is explained clearly in details.  ", "q1r": 5, "q2": "The roadmap, milestone, and KPIs are clearly explained in details, such as the project velocity key metrics, activity metric, and community metric. They also give a description of what their outcome would look like, regarding the solution for the targeted problem. The progress will be available on Github and GitLocalize, so it will be easy for community to track their progress.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8819, "q0": "The proposer raised the issue that East Asia was underrepresented in Catalyst due to the lack of localized content and Townhall involvement despite its population of billions. The solution they came up with was to Set up a translation system to translate Catalyst documents and proposals into different East Asian languages ​​as accurately as possible. They did this test in Indonesia at fund 7, fund 8, and the results were quite positive, the translations made significant progress 12 excellent translations in fund 8 compared to 4 in fund 7. with With these translations, the community started to understand more about Cardano as well as the catalyst, which spurred an increase in the number of proposals, members from the Indonesian, Vietnamese and Japanese communities This proposal fully met the challenge.", "q0r": 5, "q1": "The main group consist of 9 members, 3 members of the advisory board. They are all active and vocal in Catalyst as well as Cardano, they come from Indonesia, Vietnam, Japan. Although they are all active and vocal people in the community, in my opinion, they should provide more evidence to prove their personal capacity to match Catalyst's requirements as well as help other stakeholders. CA, new voters evaluate easier. they provided a roadmap with specific jobs by month. The total budget for the project are $15000, divided into clear specific items, I think with such work contents, the amount of funding is reasonable. The proposal identified the risks and had a plan to deal with it and they also described the resources needed to implement the proposal.", "q1r": 4, "q2": "The proposal provides a monthly implementation plan with specific work items to be performed. they say they are using Git and GitHub for East Town Hall planning, organization, documentation, metrics pulled from GitHub activity and engagement. so the progress of the project can be determined through updates on github. and measured by community interactions on the site.", "q2r": 4, "assessor": "z_assessor_706", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9623, "q0": "This proposal sets out a clear problem which is the under-representation of East Asia within the community. This corresponds to the needs of the challenge, especially since its solution could allow, thanks to the construction of a translation bridge, to open up and make the ecosystem more accessible to a population of billions of people. The positive impact is conscious and clearly expressed. The added value of this proposal is based on past and current concrete experiences, which is a plus because it is not just hypothetical, it can already be verified: “through the pipeline translation we have already developed, more and more individuals from those communities are starting to understand what drives Cardano and Project Catalyst”. The KPIs are consistent with those of the challenge, several times links are given and direct us to the Handbook, website and other, which allows us to understand more deeply the functioning and organization of this project. Being an initiative that started in fund 6, this proposal is a continuation and plans to address future challenges. ", "q0r": 5, "q1": "All the members of this team are well identifiable, their skills seem coherent with the needs of the project. As well as the many collaborations that support them. These collaborators like the Catalyst Swarm, The Catalyst School, the Ambassadors Guild and the Bridge Builders, are well integrated projects in the ecosystem which shows that the team has an important network within Catalyst but also a well developed network in East Asia, which demonstrates a good foundation in its desire to create a pipeline. The budget is well detailed, divided into different themes and in correlation with the timeline. The plan is well detailed, the tasks to be accomplished are understandable, the whole seems well constructed and realistic. The risks are discussed, but without explaining the possible solutions of the team to remedy them, which is a pity because it´s always appreciable cause it shows foresight and opens up alternatives. ", "q1r": 5, "q2": "The project itself is made to be truly transparent, from the community for the community. This initiative being a community effort, everything seems to be in place for the information to circulate. It will be possible to follow the progress thanks to Git and GitHub, the website, and their open source software. The links illustrating the text and directing us to the sites concerned are really a plus in this proposal and allow for detailed clarity. Suggestion: Why not have specified the dates and times of the Eastern townhall meetings, by way of invitation and possibility of getting in touch with the Asia network? \nThe plan is very detailed, first addressing the different stages of the project, then this in time and finally with the budget, which makes this proposal on the whole clear and allows anyone who wishes to be able to refer to specific elements to attest to its progress. \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Setup a translation pipeline to translate Catalyst documents & proposals to various languages in East Asia as accurately as possible.", "experience": "Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, Cardano Stake Pool Operators (SPO), IT & Software Engineering, Blockchain Devs, Plutus/Atala Prism Pioneers, Educators and Accountants"}