{"id": 405029, "author": "cardano4climate", "title": "The Impact Onboarding", "url": "https://cardano.ideascale.com/a/dtd/405029-48088", "category": 26450, "amount": 9400, "description": "It is difficult and overwhelming for newcomers to find their way within Catalyst. ", "funded": 2, "upvotes": 43048377, "downvotes": 6352800, "votes_result": 36695577, "votes_cast": 122, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"id": 5682, "q0": "This proposal aims to improve the onboarding process to catalyst, however it is not directly correlated to new users on catalyst. It aims to research and develop improved onboarding processes within the cardano for climate community. While this may eventually improve the experience of new users, the end results of the research will not directly affect number of new users in the near term. \n\n\"Purpose driven ADA holders will find their way to Cardano4Climate. This proposal will build a model to onboard them.\" \nThe proposal does not outline how new members will be reached, or what outreach will be done to attract people from outside cardano. It assumes that the new users will find the Cardano for climate community. ", "q0r": 3, "q1": "The proposal is rated high for feasibility, as it consists of delivering surveys, reports, and meetings, which the team is well qualified to produce. \n\nThe budget appears to be sufficient to achieve this goal.\n", "q1r": 5, "q2": "Deliverables are provided in the proposal, but not KPI's. Without clear KPI's and targets, it will be difficult to audit the success of this proposal. The proposers are transparent in their activities by recording meetings and making them available, but it is not clear how success of this research budget will be assessed. There needs to be a better description of how the budget will achieve the challenge goals of bringing new users into catalyst, and not just showing the proposals deliverables. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6574, "q0": "The proposal is looking to encourage new members to engage and proposes to develop an onboarding method driven by the active community. The work is essential – namely undertaking primary research / field work to capture diverse aspects from individual motivations to actual experiences.", "q0r": 4, "q1": "The team is already established and has executed other proposals. They have the right team and focus to implement the project. Since research and design are key to this proposal, I would have liked a deeper understanding of research aspects and criteria that will be implemented. The quality of such surveys and approaches will determine the quality of work (output) – which at that point can be only assumed. Nevertheless, seeding confidence starts with proper communication about those crucial aspects – especially being this (research/design/feedback/prototype) the core of the proposal. Public links of team members would have been appreciated, since newcomers might not be familiar with “familiar faces” ;o).", "q1r": 4, "q2": "Public GitHub is in place for transparent communication around progress and deliverables. Success metrics could have been more detailed – could have been an opportunity to showcase the evolvement of such an onboarding model (since it is so needed) or possibilities to leverage in other sub-communities (e.g. groups within Cardano network)", "q2r": 4, "assessor": "z_assessor_433", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7699, "q0": "This is a continuation of a funded proposal in Fund 7 with more emphasis on refining their onboarding process. Existing services that is provided in the Fund 7 such as media channels, info sharing and meetups are still being continued by this team. All are under the umbrella of Cardano4Climate, an impact group that have started great discussions on how Cardano can effect climate change. They already conducted various workshops with credible speakers from this field and are based worldwide, bringing a wealth of knowledge. All of these efforts can be seen through their well documented YouTube. All though viewership and engagement might not seem high, please take note they are very much in their baby steps as a community. They have started small and are slowly but surely gaining traction.\n\nThis proposal though has an emphasis on how to create an onboarding system that is more refined and based on surveys. From these surveys, they can adjust their onboarding methods, further increasing their onboarding numbers. Their choice to focus on the onboarding refinement process although indirectly answers the Challenge's key metrics, their existing services of providing a platform where like minded individuals can converge definitely answers the Challenge's key metrics. The rate of onboarding these like minded individuals though has not been provided but one can come to a conclusion by observing their various engagement platforms such as Discord and Telegram and see that they are indeed as mentioned growing steadily.", "q0r": 4, "q1": "This team although did not provide LinkedIn  links I see this as not an issue for almost each and every one of these individuals is widely known in the Cardano community. But what should the team take account is there might be a number of new CA's who might not know them yet. It is best practice to always coincide (if possible, some might want to stay anonymous) the proper write-up of a proposal. It would be such a shame if this proposal and team would receive negative impacts from newly engaged CA's.\n\nBesides that, the metrics that they already delivered from the previous Fund 7 proposal, where they achieve an onboarding total of 200+ members, various workshops and various involvement in other funded proposals gives total confidence that their refining onboarding efforts is definitely an additional task that they can take on and deliver. Especially if one does truly know the extent of experience that some of the member possess which crosses multiple international companies and NGO's, conducting surveys as they proposed is second nature.\n\n", "q1r": 5, "q2": "Great example of providing full transparency. Almost every single widely known platform to build and record engagement (e.g. Twitter, Discord, Telegram, YouTube) being used, couple that with the progress report documentation in GitHub and a website, there should be no issue at all in viewing each metric they have provided. How it is described in the proposal is also concise and systematic, really making assessment easy. Again, great example which I will copy and use on my future proposals.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9630, "q0": "This proposal sets out the clear problem of the difficulty for newcomers to find their way within the community. This problem is directly related to the needs of the challenge. The impact of this project is conscious and clearly described in many forms, both in terms of the actions already undertaken by the Cardano4climat community, but also in their active participation and supported by many links to the construction of the ecosystem and their services constant and diverse. It is clear that this proposal is capable of addressing future challenges in the sense that it is part of a research and aim to build a model approach for onboarding newcomers. The KPIs are consistent with those of the challenges with in particular a minimum of 10 members ongoing follow up. The set of annexed documents as well as the various links and proof of their previous actions allows an obvious understanding of the positive impact of this group with 200 members in its network.", "q0r": 5, "q1": "The team members are clearly identifiable, as well as their skills, additional links could have been given, on their profiles or their networks as proof for people just entering the community. But it is appreciable to see that this project seems to be supported by a large number of people and in particular in collaboration with other well-established projects in the community such as WADA, swarm… but also with the support of Cardano Foundation and IOG impact teams. The “references” part is a plus, explaining the experience and processes of the group, as well as its previous successes. The budget is well detailed and seems realistic, although it seems very reasonable for the number of people involved in the development of this project as well as its scope, which shows all the same the enthusiastic character of this proposal, supported by a feeling overall high spirits of the team. \nThe plan is clear, realistic and consistent with the approach and evolution over time. The risks are well detailed, as are the solutions provided by the team to respond to them. \n", "q1r": 5, "q2": "elaboration of this proposal as a whole shows a clear effort to be understood, clear and detailed. The roadmap and the chronology of the stages allow all the members to be able to identify the development and the success of this project. KPIs make sense and can be used as references. Transparency seems to be a very important value in the development of this initiative. The awareness of this team in the link it decides to maintain with the community seems to be beyond doubt. We will be able to follow the progress of this project thanks to, Telegram, On Discord, On GitHub, On Twitter, On YouTube, but also during their weekly sessions and even why not participate in the progress of the project by participating in the survey. ", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10251, "q0": "The deficiency considering the onboarding of new members to the whole Catalyst environment is indeed a problem we should consider. Sometimes, voters select not to vote as they are unaware of the deadlines, do not really know the whole procedure and basically they are not equipped with the knowledge needed. A solution to this problem would crucially have a positive impact on the Cardano ecosystem as well as the Project Catalyst project itself. The proposer gives a great overview of the problem and its solution as they have it in mind. Of course, the problem stated is within the challenge, as well as the KPIs indicated on the proposal. I believe that the project can scale up to address future challenges as the built in framework will also apply to other projects in the future outside Project Catalyst. ", "q0r": 5, "q1": "I really do think that the proposer provides some great rationale for the feasibility. First of all, the skills that will be necessary for the proposal have been pointed out first thing first with all the references for these skills and experience. The team members that are going to be a part of this project have been named one by one by the proposer, together with their role on this project and their relevant experience that could seem useful. The budget, also, has been identified clearly and been broken down in pieces for 3 months. It seems quite reasonable considering the number of team members taking part in this. The plan that has been provided is in full detail with all the KPIs and deliverables and gives a clear overview to what exactly is going to happen and who is going to take part in this apart from the mentioned above team members. I'm being skeptical about the amount of time theoretically given to complete this project. Have you considered how much time tacking a risk that \"came true\", is going to take? However, the proposer gives a great view of the risks of the project and how they will mitigate them, something very important to know for someone wanting to invest time and maybe money on this project. All in all, i find their overview of how this proposal is going to be implemented successfully very explaining and on point.", "q1r": 5, "q2": "The proposer has set a three month time as a time horizon for achievement of this proposal. Even though the KPIs have been mentioned above, i do not see a reference to quantify them in the auditability section but only in the impact section. The success of this proposal if up to its auditability and clarity, so i believe that it would be useful to bring all the metrics and KPIs in the auditability section. I noticed that you provided all the necessary links for a voter/user to track the progress of the proposal as well as to maybe take part of this, for sure in the survey part of the project, but also in the weekly meetups and all the surveys that are going to take place monthly.  All in all, the information that has been given is more than enough and i think is undoubtedly sufficient to audit the progress and the success of the proposal. ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}], "solution": "Build an onboarding model through an active catalyst community to welcome, connect, and support onboarding newcomers ", "experience": "Cardano4Climate is a community driven project which emerged itself through engagement in Project Catalyst. We proactively participate in building the Cardano Ecosystem and provide constant services to our Community"}