{"id": 405016, "author": "felixweber", "title": "After Town Hall by Catalyst Swarm", "url": "https://cardano.ideascale.com/a/dtd/405016-48088", "category": 26450, "amount": 22500, "description": "The Catalyst/Cardano Community needs open spaces to have fast and safe onboarding experiences and to encourage discourse and participation.", "funded": 2, "upvotes": 51556170, "downvotes": 3927301, "votes_result": 47628869, "votes_cast": 192, "f6_no_assessments": 13, "f6_rating": 4.538461538461538, "videos": [], "media": [], "f6_assessments": [{"id": 214, "q0": "This proposal directly aligns with the challenge by providing an inclusive and open space for new and existing community members to communicate, share knowledge and ask questions. \n\nAfter town hall breakout rooms have proved to be a valuable resource for educating and onboarding new members. With the intention of these spaces being to \"welcome new comers and get them quickly onboarded and engaged in the community where it best suits them.\" this proposal properly addresses new member onboarding.\n\nOverall, these inclusive breakout rooms immediately following town halls are valuable in the ecosystem and help to create \"A well-oiled open innovation platform where people fulfill roles that are meaningful for them and that contribute to shared success.\"", "q0r": 5, "q1": "The team has a well documented track record of providing this service to the community. The community should have great confidence that this proposal will be completed as detailed as they have done so for many funds already.\n\n", "q1r": 5, "q2": "This proposal is extremely easy to audit as the result of the proposal will occur on a weekly basis. Additionally, as shown by the proposer, all rooms hosted are documented and in most cases recorded for further audibility. ", "q2r": 5, "assessor": "z_assessor_1087", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 1477, "q0": "The problem statement is aligned with the challenge.  Encouraging discourse and participation through fast and safe onboarding experiences is vital to creating a process where newcomers can feel immediately welcome and accepted among strangers.  The more diverse these open spaces are, the more likely someone new to catalyst will find the right group for them.  Creating environments where new and existing members can meet and interact with one another allows relationships to be forged.  Newcomers may initially be attracted to Catalyst for the financial opportunity or the innovative technology, but the community keeps them coming back.  Having a place where they get access to community veterans allows them to get up to speed quickly and learn about the roles they can undertake and how to go about it.\n\nAn inclusive environment of smaller groups where people can mingle and meet new friends, where ideas can be shared, and knowledge exchanged, will help to increase attendance and grow the community and is clearly aligned with the key metrics of Town Hall attendance and Swarm session attendance.\n", "q0r": 5, "q1": "The team members are active participants in the community and Town Hall sessions, and they have experience executing the plan detailed in the proposal. This CA knows the team members of this proposal based on the CA's experience in the community. They might not be known to newer CAs, and it would be good to include more detail about their individual experience in the section.  \n\nThis proposal is for funding to continue an activity that appears to be working.  It makes sense to keep doing what works while improving it based on the lessons that have been learned.  However, the funds requested don’t match what is in the budget breakdown.  The budget breakdown appears to add up to 25,000, while the requested funds are $22,500.  This discrepancy is confusing and raises a red flag regarding the attention to detail implemented when disbursing funds.\n", "q1r": 4, "q2": "The tracking system in place documents the number of participants for each session. A google sheet is used so that anyone can view the sessions and the number of attendees. The system facilitates transparency so that anyone can view the sessions and the number of attendees. It would be better if some growth goals were set and measurable KPIs had been created. \n", "q2r": 4, "assessor": "z_assessor_1375", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2448, "q0": "New Member Onboarding challenge seeks to  increase the number of qualified challenge teams, proposers, advisers, mentors, and voters available. This proposal aims to provide venues where people may have quick and comfortable onboarding experiences while also encouraging discussion and engagement. The proposal intends to build a town hall with high-quality community assistance that will continue to welcome newcomers and swiftly onboard and engage them in the community where it is most appropriate for them. Passive ADA holders might become active Catalyst members as a result of this and Project Catalyst's reputation as the most active open innovation would improve.This proposal effectively addresses the challenge.", "q0r": 5, "q1": "• The proposer shows that he has skills as well as the ability to carry out the proposal. The proposer has clearly indicated  team members required to carry out the plan, and created a budget that is reasonable in order to fulfill the desired targets. In addition, the proposal provides a realistic schedule for finishing the work, as well as a clear and concrete implementation plan that indicates what is being done and how it is being done. The proposer has considered the challenges that may arise during implementation and offers potential solutions. As a result, the problem solution listed above has a good chance of being implemented.", "q1r": 5, "q2": "•\tThe proposal offers enough information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the effect and feasibility categories.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 2507, "q0": "This proposal identifies the need to have a fast and safe onboarding experience for new members. Through the After Town Hall proposal this can be achieved by providing a platform where new members can interact with experienced community members allowing a learning and idea sharing environment that will add value to the Cardano ecosystem by promoting discussion and participation there by strengthening the community and supporting the onboarding process.", "q0r": 5, "q1": "After Town Hall is an established project which can back up its ability to fulfil this proposal with historical data. The attendance of after town hall is shown for the first 3 months of 2022 identifying a consistent participation of over 100 individuals. This shows that the aim of the the proposal is likely to be met with various topics being covered and plenty of participants available to help support new community members. The team has a proven track record of successfully implementing After Town Hall. This gives confidence that if funded the proposal will be implemented successfully.", "q1r": 5, "q2": "The after town hall approach is very open. Details of attendance and discussion hosts are available to the community and as the sessions are open to all it is easy to check the quality of the sessions throughout the proposals funding duration simply by attending After Town Hall. \nThe need for open spaces to onboard new member quickly and in a safe environment is clearly stated and well addressed by this proposal.", "q2r": 5, "assessor": "z_assessor_1513", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4765, "q0": "This proposal is a follow-up to the After Town Hall proposal that was successfully funded in Funds 6 and 7. Catalyst is an experiment to explore the highest potential of human collaboration. Swarm supports this mission. The Catalyst Swarm After Town Hall provides a place for newcomers to receive guidance and mentoring from vCAs. After Town Hall is a component and extension of the Swarm Sessions, therefore the key metric of general onboarding to swarm sessions will be achieved. After Town Hall provides an open stage to the community for people to meet, connect and share ideas with each other. They hold weekly events to share on topics like blockchain, smartcontract, Catalyst, Catalyst funding rounds, how to write proposals, what is CA and Voter, how to do CA, vCA It has a quality community so it should continue to welcome new people and help them quickly join the community. Therefore, this proposal is consistent with the goal of the challenge: Growth in the number of Community Advisors and Veteran Community Advisors, Growth in the number of voters, Growth in the number of voters, Growth in total number of votes given…\nThe team also poses the risk that If townhalls fail to gather participants the growth and success of the swarm after town hall will also fall, and the participation in After Townhall directly relates to the attendance of Town Hall but they offer no solution.\n", "q0r": 4, "q1": "- This is a continuation of projects that have been successfully funded and implemented in Fund 6, Fund 7 and the team will continue to organize, run and present weekly After Town Hall sessions during 3 months from April 2022 to June 2022.\n- The proposal requires a budget of 22,500 USD, in which the detailed cost for the parts: organizing 4 events per month for 3 months is 12,000 USD (3 people), marketing 4,000 USD, Implementation & Experimentation on After Town Hall Reputation and rewarding systems 6,000 USD, consulting 3,000 USD. According to the detailed budget breakdown above, the total budget should be 25,000 USD, while the proposal requires a 22,500 USD fund. The team should consider the budget required for successful project implementation. Besides the team does not provide details of costs for each specific job such as event materials, speaker costs, online and offline meeting room rentals, advertising costs on channels (facebook, youtube, twitter...) so it is difficulty to evaluate the reasonably of the cost items.\n- The project team consists of 5 people who all are active, enthusiastic, knowledgeable about Cardano, Catalyst such as Felix Weber - Catalyst Circle v1 Member, Funded Proposer, Mentor & fulltime Catalyst Community Member, Nadim Karam - Catalyst Circle Facilitator, Funded Proposer and Business & Enterprise Consultant, Phil Khoo - vCA, co-creator of and project lead on the Community Tools…With such a team, the project can completely succeed in Fund 8.\n", "q1r": 4, "q2": "The proposal is a continuation of the previously funded and successful After Townhall proposals at Fund 6, Fund 7. They have provided a link where the community can check the implementation of the proposal at Fund 6, Fund 7. Therefore, the community can completely check the progress of the project. However, in my opinion, in addition to organizing weekly events with the participation of the community, the group can give specific numbers such as the number of people participating in the event, the number of voters, the number of proposals is funded through events, how many CAs, vCAs can be introduced by the team to Catalyst…after 2 times of funding at Fun 6, Fund 7, it will be more convincing.", "q2r": 4, "assessor": "z_assessor_1768", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4850, "q0": "The proposal is seeking to continue the Catalyst swarm sessions and therefore needs further funding to do so. The proposal  is a follow up proposal to thesuccessfully funded After Town Hall proposal in Fund 6 and 7. They aim to continue the After Town Hall and to increase the quality and improve the format. \nTo address the challenge, the format of the After Town Hall is one of inclusion. With quality community support, they will continue to welcome new comers and get them quickly on boarded and engaged in the community where it best suits them. Hosted sessions are uploaded to the catalyst swarm YouTube channel. \nThe main challenge cited is that increasing participation in After Town Hall directly relates to the attendance of Town Hall. If Town Hall increases, so will After Town Hall. The details effectively address the challenge. Hence my 4 star rating.", "q0r": 4, "q1": "This is a further funding of an already successfully implemented and ongoing process. After Town Halls are on weekly basis will continue in that same manner. \nThe budget is comprehensively broken down into various activities and costs such as marketing budget, advisory, events per month, to mention a few. \nThe team is made up of 5 highly experienced Catalyst members led by Felix Weber, a well known Coordinator of Catalyst Swarm Sessions. Implementation will be successfully done because they have already implemented successful After Town Hall. All the information here will lead to a successful implementation of the proposal. My rating is 4. ", "q1r": 4, "q2": "All documentation on Zoom meetups on After Town Hall are recorded on YouTube channel for all to see. \nSuccess is that they will continue to host the After Town Hall each week for the funding period. \nAfter Town Hall has always been well organized and I recommend they get funding to continue the good work. My rating here is 4.", "q2r": 4, "assessor": "z_assessor_1786", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6573, "q0": "Creating open and safe spaces to the community and newcommers to Catalyst is essential. Via interactive approach it is more likely to generate a lasting engagement and comprehension of Catalyst itself and its mission. The team highlighted a important risk - namely if Townhall fails to attract participants, so will After Townhall as well. I recommend taking this fact as a aspect of iteration and source of innovation - to outline a possible mitigation of what is in the hands of the team of After Townhall. For example could Swarm leverage its capacity to to mitigate the risk at some extend?", "q0r": 5, "q1": "The team is executing After Town Hall for almost over a year with great success, it is well established and acts highly professional. This being a recurring proposal for an ongoing service to the Catalyst community I resonate with a short proposal. Nevertheless, I recommend establish a best practice proposal blue print to mitigate the risk of lower ratings than 5 (since this enters in conflict with the CA guidance on the aspects of assessment required to be covered.", "q1r": 4, "q2": "Performance of the proposal is directly measurable by the community through participation and transparent shared documentation (links provided by the team). In view of aspiring increased quality and overall improvement I recommend to share details about possible improvement areas already identified and/or community feedback documentation (already given) or planes of such insight gathering.", "q2r": 5, "assessor": "z_assessor_433", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7698, "q0": "Undoubtedly this was and is and will continue to be a great addition and engagement tool for the Town Hall. Felix, the initiator together with the Swarm hit it spot on when they noticed, the Cardano community wanted to interact with one another. This skill of Felix, is uncanny in this aspect, he is very in-tune with what a community needs in order to galvanize and become an entity that can act on their own. After Town Hall to my recollection was the very first entity that allowed engagement and galvanizing towards creation of a specific community (more widely known as onboarding). I remember when I was involved in a round table discussions with the OG's; there was still Dyna Patel, Steve Aldrich and many more. After Town Hall was the embryo of a lot of communities, and there is no doubt it will continue to be so. 100% yes, After Town Hall meets all the key metrics in spades, albeit indirectly (which is more of a testament of the peculiarly written Challenge key metrics). Looking forward to more of the After Town Hall, which to be honest, is beyond me why do they still need to ask for funds. Something the community need to find a way to address.", "q0r": 5, "q1": "Although there are new names, the OG's are still there, OG's meaning Felix and Phil. First hand experience collaborating with Felix, there is no doubt this proposal will continue to deliver on their initial KPI's. One word of advice, although this indeed is a continuation of successfully funded proposals going back many rounds, it would be wise to also continue to practice the best proposal writing format. The rate of onboarding onto Project Catalyst to my understanding, never stops growing, which would mean there might be new people who are perhaps lurkers that have not known After Town Hall is actually a community thing.\n\nPerhaps their entry point was through Catalyst School and they focused on being a CA, and when coming across this proposal, they might assess it negatively, something that we all do not want to happen. With that said, the timeline and action plan are far from being detailed. This also carries onto the budget format, it takes time to digest where the funds are going. There is a notion of allocating the budget for something experimental, unfortunately the proposer did not go further into this. One can only guesstimate.", "q1r": 5, "q2": "Continuing on the simple yet proven report system, although is manual, is more than enough for anyone to gauge metrics such as; onboarding, growth and engagement through their Google Docs. This can be validated further by following their YouTube channel, where they actively and consistently upload sessions from the After Town Hall. Perhaps the proposers can explore the use of other innovative reporting tools, to further cement the value that After Town Hall brings through visually represented data.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8821, "q0": "This proposal raises the issue is Catalyst/Cardano community needs open spaces for a fast and secure engagement experience and encouraging discussion and participation. As a follow-up to the After Town Hall proposal successfully funded in Fund 6 and 7 this project has already been funded and is being successfully implemented this proposal is additional funding of a process so I agree with the idea.", "q0r": 4, "q1": " The team consists of 5 key members they have been running Swarm and related community events since fund 4. they say this is the extra funding of a process that has been and is being successfully implemented into the products. main will be kept as before. This is the organization, operation, and presentation of the weekly After Town Hall sessions.\nThe proposer offers a 3-month operational roadmap with a total budget request of $22500 for 12 events, with events each April. The budget is divided into $12000 for 12 events; Marketing $4000; Implemented & Tested the After Town Hall Reputation and Reward System $6000,consultation $3000. The total proposal budget and the explanatory budget are not the most appropriate. The cost of the event I question the explanation is that it is shared between 3 people and the group has 5 members. moreover the remaining budget items I don't have enough information to judge if it's reasonable because I don't know what its specific job is, how long it takes, and how the topic will work out. get this cost. The proposed topic of the risk is highly dependent on the Town Hall attendance but has not come up with a solution to deal with this risk. ", "q1r": 2, "q2": "The proposal offers a three-month roadmap with the main objective of having 12 events as the indicator to determine the success of the project that there will be and after townhall is done each week with community participation. people can observe the success of the project. as noted in the previous section This is a continuation of the successfully funded and implemented After Townhalls proposals and is intended to facilitate the continuing After Town Hall resources for the next round of funding.", "q2r": 4, "assessor": "z_assessor_706", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8967, "q0": "The proposal is a great idea, very impactful for the growth of Cardano ecosystem and Project Catalyst by organizing breakout rooms for participants of the Cardano community to discuss about current events after every Town Hall. This is the continuation of the success funded After Town Hall proposal in Fund6 and Fund7.\nIn my opinion, this is a necessity of Cardano community to have a place where we can discuss, share ideas about Cardano and Catalyst project weekly after every Town Hall, a place we connect to each others in the same way and toward the same direction: the growth of  Cardano ecosystem and Catalyst project. The project is absolutely within the challenge, helps to make it faster and easier for new Catalyst members to take on suitable roles and responsibilities.\n", "q0r": 5, "q1": "We do not have any reasons to doubt the feasibility of this proposal since it has been organized successfully with the expert team are Catalyst Community members (fulltime) and the same clearly broken down budget which is reasonable to achieve the set goals. The link about all the previous hosted rooms which is provided is the strongest evidence for the successfully implemented of the project. I was a newcomer joining a Town Hall and breakout room after Town Hall, and watched Swarm Youtube videos since I could not arrange the schedule to join live. So I completely agree the proposal is fully feasible. ", "q1r": 5, "q2": "Regarding to the authors’ explaination: Hosted sessions can be recorded and uploaded to the Catalyst Swarm Youtube channel and the community can check each week, it would be quite simple to monitor the project. The file After Townhall Pipeline.xlsx which is included all the information about participants facilitator, co-Host, date, room name, brief description, tracking, coordination, uploaded Youtube, slides, notes,…of all previous After Town Hall is the strongest evidence for the auditability of the project.\nTherefore, I strongly agree the proposal is fully auditable.\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9122, "q0": "An all inclusive catalyst approach to onboarding new members is welcoming and realistic. Open space for interaction is also important and looks the proposers want to onboard new and many people onto to catalyst ecosystem rapidly to ensure no one is left behind. This proposal is really aligned and delivering and engaging constructively for impact.", "q0r": 5, "q1": "The timelines on the deliverables seems to be a tight one. The cost of Advisory is way too high. What kind of advisory collaborations are going to be discussed at $3000 as part of the budget? May be if that cost component is well explained it would help to prevent doubt.\n\nRegardless, there is a great a team in place to ensure the task is delivered. The team is highly matured and experienced in the catalyst ecosystem and can implement the proposal with ease. ", "q1r": 4, "q2": "Even though the proposal has some form of indirect KPIs, they are projecting the outcomes of having Z number of new members onboarding in the first month or two. \nEven though the community will be following to evaluate the project, measurable variables would guide the evaluation and make it easier to predict the future outcomes.", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9629, "q0": "This proposal presents a clear problem by exposing the community's need for open spaces to quickly and securely welcome its members and encourage participation. This corresponds well to the needs that the challenge seeks to solve. And which is logically connected with the proposed solution. The positive impact of this proposal in the ecosystem has already been attested since fund 4 and the added value of this initiative for the community seems conscious and proven in various ways. Having succeeded in: “ establish an open and inclusive space for the community” they are now looking for: “continue the After Town Halls to increase the quality and improve the format”.\nThis proposal seems perfectly able to address future challenges in the sense that it is part of a continuity adapting to the evolving needs of the community to which it is intimately linked. \nOnly one thing could be raised is that personally I am part of the community and know the basics of how it works, but what about someone absolutely new? Would he or she fully understand the impact of this project without knowing its previous success? \n", "q0r": 5, "q1": "The descriptions for the team members are quite clear and their skills promptly detailed. Links to their profiles as proof could have been given, but a link to the swarm site is given and brings a lot of understanding on the philosophy and the commitment of this project within the community. Some of its members seem very active being fulltime Catalyst Community Member. The fact that this project attests to its success within the community since fund 4 seems to be a sure value of confidence, as does the fact that most of its members are well integrated into the ecosystem. The budget is detailed, it seems coherent and reasonable, as well as its simple plan is understandable: “Hosting weekly After Town Halls from April 2022 to June 2022”. In addition, links are provided as proof of their previous well-founded proposal. The risks are conscious, but it is a pity that the team did not specify its possible ways of remeding them. Aren't the risks possible challenges, possible innovations? Explaining the Swarm's solutions to this problem could have empowered this project from the community to the community. ", "q1r": 5, "q2": "this project seems elaborated in such a way that the whole community can at the same time attest to its development, but also even participate in it. A document is attached After Townhall Pipelineand allows to understand the organization in time and the calendar of the events with their facilitators. All data appears transparent and understandable. “As we track and document the After Town Halls breakout rooms and hosts, we provide a transparent and understandable process of this proposal.” This being proven by a link for all the previously hosted rooms tracked.", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9647, "q0": "This is a follow up of already funded proposals (Funds 6 and 7) that have been successfully implemented with a clear positive impact to the community by providing spaces where discussions lead to growth. The proposed plan is well structured and detailed, the budget disclosed provides information on how all funds will be used and seems to be a rational use of the resources since all of them go to pay for the work of full-time community members that have been very active since the beginning of project Catalyst.", "q0r": 5, "q1": "The proposing team is composed of highly engaged and trusted community members with a proven track record of implementing this same proposal previously. This being a continued effort, is budgeting 12 sessions (1 session per week) for April to June 2022, 4 weeks per month. The sessions are held on Wednesdays and in June 2022 there will be 5, not 4 of those in the month. Leaving 1 unfunded session. My suggestion for the proposing team is to either count the real number of sessions that will be held during the trimester, or structure the budget for a monthly execution regardless of the number of sessions each month.", "q1r": 4, "q2": "The implementation of this proposal is very easy for the community to verify and there is an excellent track record of well executed proposals in previous funds where not only implementation but also outcomes have been tangible.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Continue funding Catalyst Swarm After Town Hall provides open spaces to meet and connect with the Community.", "experience": "We have executed Swarm and associated community events since fund 4. The Catalyst Swarm is a group of dedicated and active community members taking initiative and responsibility to provide basic Community Infrastructure. "}