{"id": 405311, "author": "easterntownhall", "title": "Eastern Catalyst School", "url": "https://cardano.ideascale.com/a/dtd/405311-48088", "category": 26450, "amount": 27260, "description": "Eastern Hemisphere has many non-English speakers, to onboard Eastern Hemisphere to Catalyst we need a system that caters to their languages.", "f6_no_assessments": 15, "f6_rating": 4.6, "videos": ["https://www.youtube.com/watch?v=t86e0M-262A&start=4202"], "media": [], "f6_assessments": [{"id": 494, "q0": "This proposal enhances the impact of the Catalyst project by contributing to a variety of languages such as Japanese, Vietnamese and Indonesian. The English language is a barrier to accessing Catalyst projects in these countries. Therefore, providing content in the local language is a very effective way to help the local community understand more about the Catalyst project, more broadly the Cardano ecosystem. ", "q0r": 5, "q1": "The team has shown they have full skills and experience in this field to be able to successfully implement the project. With the experience of key team members, having directly participated in and supported many funds in the past and now support the community in the host country of Vietnam is very strong. There are now weekly meetings and community support at 16:00 (GMT+7) according to catalyst east meeting. The team also detailed the roadmap for each Fund, from Week 1 with the sharing of detailed information about Catalyst workshops to week 6 on how to be a Veteral CA. It’s all very clear.", "q1r": 5, "q2": "I'm excited that the team is interested in auditing. Not only are they careful to provide information that can reach the community to follow the project together, but they also outline a viable plan in which they track the success of the project according to the number of community members involved, the number of people attending the workshop sessions, and monitoring the number of new entrants to the community. In this way, we can track the work done monthly, controlling the progress and attractiveness of the project to the community. I believe the project will be successful.", "q2r": 4, "assessor": "z_assessor_1176", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2449, "q0": "The goal of the New Member Onboarding challenge is to increase the number of qualified challenge teams, proposers, advisers, mentors, and voters available. Because the Eastern Hemisphere includes many non-English speakers, this proposal intends to teach on Catalyst in East Asian local languages in order to onboard individuals into the ecosystem. This School will be a place created to improve Catalyst's overall impact by enhancing the contributions of all of its various players and roles in Japanese, Vietnamese, and Indonesian, as well as gradually adding more local languages by reaching out to other communities where English is not the primary communication tool. Passive ADA holders might become active Catalyst members as a result of increased awareness of Project Catalyst as the most active open innovation as a result of the introduction of many languages to the Catalyst ecosystem. This proposal's goal is to onboard new members and assist them develop their abilities along the journey, regardless of how they want to participate with Catalyst: as a Proposer, a Community Advisor, a Veteran Community Advisor, a Challenge participant, or without any defined position within the program. This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer is someone who has knowledge  in block chain, especially Cardano.  t heproposer also outlines team members required to carry out the strategy, resulting in a budget that is reasonable and meets the goals. A realistic deadline for finishing the task is also included, as well as a clear and actionable implementation plan that indicates what is being done and how it is being done. The proposer has considered the issues that may occur during implementation and has proposed potential solutions. As a result, the problem solution suggested is likely to be implemented.", "q1r": 5, "q2": "The proposal offers enough information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the effect and feasibility categories.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 4767, "q0": "The proposal raises the issue that Catalyst has its own protocol and method of operation, which is different from the traditional funding platform, so anyone who wants to participate must learn about it. The use of English is dominant in the Cardano ecosystem at the moment. Due to the language barrier when English is not widely spoken in the Eastern Hemisphere, the community here is not fully aware of Cardano and Catalyst. This proposal will establish the Eastern Catalyst School, which will be a decentralized community of educators, educating on Catalyst in East Asia local languages. The school will provide the same services as Catalyst School but in Japanese, Vietnamese and Indonesian, and will add more local languages.\nThe school will cover topics such as: Introduction to Catalyst, Proposing in Catalyst, How to be a Community Advisor, How to be a Veteran Community Advisor, Why do we need the Eastern Catalyst School, thereby improving the skills of the new members so they can engage with Catalyst as a Proposer, a Community Advisor, a Veteran Community Advisor, a Challenge member or without any specific role within the process. Therefore, it will increase the number of proposals, the number of CAs, vCAs for Catalyst and make Catalyst grow and play its full role.\nThe team also exposes the risk and takes measures to address it. I think this is a good proposal, suitable for the goal of the challenge: Growth in the number of CA, vCA, voter, proposals…\n", "q0r": 5, "q1": "The Eastern Catalyst School will include a basic website (in Japanese, Viet Nam and Indonesian) consisting of two main parts: GitBook and Landing page.\nThey set goals with specific figures: 3 months after funded or at the end of Fund 8 will create learning content, host 18 school sessions or workshops in three languages; 6 months after funded or at the end of Fund 9 will host 36 school sessions or workshops in three languages. This goal is very specific and the project is achievable.\nIn addition, they also track a number of quantitative indicators to evaluate the success of the project such as: Total number of community members who get involved with the Catalyst School, the number of proposers, CA, vCA joining the sessions and workshops, new referees, voters. These metrics can be tracked and verifiable.\n", "q1r": 5, "q2": "The Eastern Catalyst School will include a basic website (in Japanese, Viet Nam and Indonesian) consisting of two main parts: GitBook and Landing page.\nThey set goals with specific figures: 3 months after funded or at the end of Fund 8 will create learning content, host 18 school sessions or workshops in three languages; 6 months after funded or at the end of Fund 9 will host 36 school sessions or workshops in three languages. This goal is very specific and the project is achievable.\nIn addition, they also track a number of quantitative indicators to evaluate the success of the project such as: Total number of community members who get involved with the Catalyst School, the number of proposers, CA, vCA joining the sessions and workshops, new referees, voters. These metrics can be tracked and verifiable.\n", "q2r": 5, "assessor": "z_assessor_1768", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5026, "q0": "This proposal is for the organization to provide the same services as the Catalyst School, but in Japanese, Vietnamese and Indonesian and to steadily add more local languages ​​by reaching out to other communities where the English is not the main means of communication. To motivate people in the Eastern Hemisphere to participate in Catalyst. The proponent understands the proposal very well because he has identified the risks and has a plan to limit it. In summary I think this proposal will effectively solve the challenge.", "q0r": 5, "q1": "The proposal has an implementation roadmap in fund 8 and fund 9, the goal is to offer 18 sessions each in both Japanese, Vietnamese and Indonesian. The budget requested at the grant is explained in detail and reasonably. The project team has 5 main members and 2 consultants. To me, they are all experienced people because they are all active members of Eastern Townhall as well as Catalyst. However, I recommend that they add information that proves each member's experience so that newcomers can easily determine if they are a good fit.", "q1r": 5, "q2": "From the information provided this project promise to be transparent, and reports on the progress of the project will also be easily checked and evaluated. If it is possible to have specific minimum numbers to determine the success of the project, as well as it is defined for each saint's roadmap, then it will be better.", "q2r": 4, "assessor": "z_assessor_1820", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5187, "q0": "The team clearly defines a problem for the community - to onboard non-English speakers from Eastern Hemisphere. Based on the experience of Catalyst School, the decision to establish the Eastern Catalyst School offers a specific solution to this problem.\nAddressing the learning needs of non-English speaking members from Indonesia, Vietnam and Japan would ensure the popularity and visibility of the opportunities provided by Project Catalyst. Through the proposed topics covered by Eastern Catalyst School, non-English speaking new members of the community will be able to learn about the roles and responsibilities of Proposer, a Community Advisor, a Veteran Community Advisor and a Challenge member.\nThe idea presented offers a solution related to the rising awareness and training of new non-English speaking community members. However, it is not clear how these members would be effectively involved in the roles of Proposer, a Community Advisor, a Veteran Community Advisor and a Challenge member in the current English-based Project Catalyst environment.\nIt is not demonstrated with a described chain of evidence how the proposed way to address the challenge (by creating Eastern Catalyst School in Indonesian, Vietnamese and Japanese) will lead to the expected result - “This would potentially lead to more sign-ups to Cardano IdeaScale, more attendance in Town Halls and Swarm Sessions, more Catalyst School attendance ”.\nIn the part with the identification of possible risks, the team shows an understanding of the need to adapt the content to the respective languages (Indonesian, Vietnamese and Japanese) and cultural environment.", "q0r": 3, "q1": "The roadmap of the activities specifically and clearly defines the steps - number and sequence of sessions and workshops - that will lead to achieving the goal. The possibility to adapt the implementation of the sessions according to community feedback and needs is also recognized.\nIt is not supported by evidence of how the educational sessions conducted in the three languages (for non-English speaking participants) will increase their ability to submit proposals, participate as a CA and vCA based on the session topics (Proposing in Catalyst, How to be a Community Advisor (CA), How to be a Veteran CA).\nThe budget is broken down into identifiable items and specifically provides values for the planned activities. The team has also budgeted for possible contingencies.\nPrevious experience of the team members and their involvement in central structures and activities of the community (Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, Cardano Stake Pool Operators (SPO)) leaves no doubt about the capacity and ability to implement the proposed project.", "q1r": 4, "q2": "As a project which is \"proposal that continues the efforts of the Catalyst School\", it firmly proofs the team's commitment to expand and add value to Project Catalyst.\n\nCreating a website in the three languages (Indonesian, Vietnamese and Japanese) containing all the information and resources provided by Catalyst School will raise the awareness of non-English speaking members. However, it is not stated how this will lead to an increase in the proposed Success Metrics in particular -\n• Number of CA’s joining the sessions and workshops\n• The number of vCA’s joining the sessions and workshops\n• The number of 1-to-1 supports provided to community members\n• Number of new referees\n• Number of new voters\n\nThere are specific milestones determining the type and number of activities envisaged in the project (School sessions). However, there are no specific numbers and percentages set in Success Metrics (KPIs), which does not allow to quantify success of the project .", "q2r": 2, "assessor": "z_assessor_1890", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5687, "q0": "This proposal directly addresses the challenge of onboading new users to Catalyst. There is a very large community of non-english speaking people from East Asia, that would benefit from the translation of the Catalyst school materials. This proposal would positively impact Cardano and Catalyst by facilitating the onboarding of new users. The proposal clearly explains how the success of this proposal will benefit Catalyst and cardano ecosystem. ", "q0r": 5, "q1": "The Feasibility from this proposal is highly likely as they have provided a core team, a detailed budget breakdown, and a clear roadmap with measurable and auditable goals. However it is unclear how, if funded, the funds will be distributed among the team members, and how new contributors will be incentivized to participate and contribute. They have stated \"There are no roles, no leaders. Rather people establish themselves over time, through participation. We overlap and collaborate with Catalyst Swarm [ 2 ] and Catalyst School [ 3 ] and other community groups across Asia.\" While this is an admirable goal, it is not clear from the proposal how this collaboration will be incentivized. ", "q1r": 4, "q2": "The proposal includes measurable goals that include timelines for success. The success metrics are provided, (such as Total number of community members who get involved with the Catalyst School, The number of proposers joining the sessions and workshops, Number of CA’s joining the sessions and workshops... etc.) Unfortunately no specific target numbers for these metrics are provided. Specific quantifiable numbers added to each success metric would make this proposal easier to audit by the community. It is also not clear how these success metrics will be directly linked to this funded proposal.", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5874, "q0": "The Eastern Catalyst school aims to onboard new members and help improve their skills along the way in any way they decide to engage in Catalyst, either as a proposer, a community advisor, a vCA, or a challenge member within the process. In order for Catalyst to flourish and reach its full potential, all these roles need to give their best contribution within the process. To address the challenge, the Eastern Catalyst School will have leveraged the system and teaching of catalyst school onboarding which will be the key growth of attendance and proposal submission. The main risk to this proposal is language barrier and the proposal gives some ways by which they can overcome it.", "q0r": 5, "q1": "The roadmap to be adopted by this proposal is to provide The Catalyst School with sessions and workshops in some selected eastern languages, weekly. The proposal seeks to provide all of these services in the next two Funds, 8 and 9. Also, the proposers have decided to provide 18 sessions in a way that is synchronized with each phase of Project Catalyst so in order to increase the value delivered by them. Finally, the proposal gives details about the knowledge and expertise of the team to embark in the proposal. With this, this proposal is most likely to be implemented successfully.", "q1r": 5, "q2": "The proposal gives very transparent details about how the implementation of the proposal will be done and what they perceive to be success. The proposal’s success will also be measured with the attendance growth of participants, the growth of Community Advisors and Veteran Community advisors and eventually, actions that will lead to more proposal submission from the Eastern Hemisphere. With these metrics, the progress and the success of the proposal can be measured efficiently and effectively.", "q2r": 5, "assessor": "z_assessor_292", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 6579, "q0": "The proposal addresses the challenge to from different angles: awareness, increase meaningful participation and encourage to use established tools and services. The proposal leverages on existing structures, processes and reputation already established by the Catalyst School – which now expands its reach to onboard and cater the Eastern hemisphere community.", "q0r": 5, "q1": "It counts with a clear plan and milestones that need to be achieved. It also includes a call to action and possible contributors to the community, which underpins the need to acquire additional contributors to sustain operations of the new school. The team is already highly engaged in the Catalyst community and ensures implementation of the proposal. Besides that, the team also operates Eastern Town Hall – so activities can be leveraged in both projects. \nDue to possible shortage of bi-lingual contributors I suggest identifying the MUST content to be catered to the Eastern community; prioritization in that case makes sense to achieve best outcome.\n", "q1r": 5, "q2": "Roadmap is details and KPIs are adequate to service that will be provided. Notable is short-, mid- and long-term aspirations of the Eastern Catalyst School – it once more underpins the seriousness and professionalism that is leveraged from existing Catalyst School. If gradually be able to  onboard contributors – this will be another successful “community organ” that sustains Catalyst in a decentralized and autonomous way.", "q2r": 5, "assessor": "z_assessor_433", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7777, "q0": "The Catalyst School is a place for people to get to know about Catalyst, from onboarding new member to become a proposer, to become Community Advisors and contributing community member. This time, Eastern Catalyst School is meant for Eastern Hemisphere tailored for languages other than English such as Japanese, Vietnamese, and Indonesian, to introduce and educate new people to Project Catalyst. This proposal able to address the problem within the challenge, which is to onboard the new member especially non-english speaker into Catalyst. ", "q0r": 5, "q1": "The core team consists of active Eastern  Town Hall Trusted Seed and incoming new members, and they’re collaborating with Catalyst Swarm and Catalyst school. Their previous work can be tracked and verified from their past contribution within Eastern Town Hall weekly workshops and events. The proposer is able to identify the team’s need and able to allocate its budget in a detailed manner, e.g Sessions and workshop breakdowns, 1-to-1 sessions, materials / and resource translation budgets, etc. Their timeline and goals are clearly explained in detail, such as their goal for week 1, week 2, and week 6 for every Fund, for the next 6 months. Overall, this proposal is well written and could prove that the team knows about how and what they’re doing.", "q1r": 5, "q2": "The proposal is able to explain their roadmap and milestones, e.g number of workshops or sessions being held for 3 months. Other than metrics/KPIs that they’ve already provided, they also explained their short-term, mid-term, and long-term goals. We can track their progress on their publicly available GitBook repository, and their Landing page. I give it a 5 star because this proposal is transparent and could easily track their progress by the community and general public.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7975, "q0": "The language barrier for countries that rarely use English is a big problem in the eastern countries. Therefore, creating an environment for transferring knowledge entirely in local languages, helping them to more easily access Catalyst's programs, is a premise for software developers and the community to participate strongly. more powerful in Catalyst's programs.\nThese publications can be articles, videos, online and offline seminars that are saved and shared as learning materials for the community in the long run.", "q0r": 5, "q1": "I am impressed with the group by its members from many countries and mainly those who have experience in programming as well as organizing community activities. This shows that they have enough experience and enthusiasm to complete this proposal.\nTheir goal is to provide 18 meetings and training sessions each quarter, in order to attract the community to catalyst, understand the catalyst and promote participation in building projects on the cardano platform.\nThey have a weekly plan and report as well as a clear roadmap of community training and discussion content and are available in a variety of languages.", "q1r": 5, "q2": "They choose 2 main means of reporting:\n1. github page - a reputable and easily accessible code public site for the public\n2. Materials collected on the official website: videos of discussions, content of articles...\nThis form of organization is quite simple and has been maintained for about half a year, when catalyst was introduced from fund 5 to the eastern region.\nSo I think it's pretty easy to check the project progress.\nHowever, in the process of following up, I hope that your group will deploy more widely to local youth and student organizations at universities, instead of just organizing mainly online sessions today. .\nFurthermore, the communication plan should go into depth about quality and plan to increase the number of attendees. Currently, the number of people attending your meetings online is only a few dozen people and most of them are quite familiar people.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8824, "q0": "The proposal presents the problem that needs to be addressed that the Eastern Hemisphere has many people who do not speak English. The team's solution to this problem was to provide the same services as Catalyst School, but in Japanese, Vietnamese and Indonesian, and to add more local languages ​​by contacting the local schools. This proposal would make it easier for people in the Eastern Hemisphere to participate in the catalyst, which would break down the number one factor preventing broad participation by members in the Eastern Hemisphere. Proposal will help newcomers or veterans join the exchange of knowledge and help each other in their own languages. so I agree with the implications of the proposal.", "q0r": 5, "q1": "The group has 5 main members and 2 advisors. They have been involved in Catalyst for a long time, they are all active members at Catalyst community in their country as co-hosts of Eastern town hall, Catalyst School members, Cardano ambassadors. I know them, but with this proposal, I advise them to add more evidence to prove their experience to suit the requirements of catalyst, as well as to help newcomers easily assess their skills and abilities their experience. The team offers a roadmap for fund 8 and fund 9. Consisting of 18 sessions per fund, these sessions will introduce catalyst seminars; submit proposals, finalize proposals in catalyst; how to become CA, vCA. The information about the budget is also listed in clear and specific sections. In my opinion the budget is reasonable.", "q1r": 4, "q2": "The operational roadmap includes fund 8 and fund 9. there are 18 sessions for each fund. The content and resources are publicly available on gitbook. After the end of fund 8, there will be 18 lessons and seminars held in the local language, after fund 9, 36 lessons and seminars will be held in the local language. Cardano community can easily observe the progress of the proposal", "q2r": 5, "assessor": "z_assessor_706", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8969, "q0": "The idea is great, which aims to create a Catalyst shool for community in Japanese, Vietnamese, and Indonesian, it addresses well the objectives laid out in the challenge, I strongly agree the proposal is impactful because the proposal would onboard new members from Eastern Hemisphere for Project Catalyst and Cardano community and help new members improve their skills while engaging in Project Catalyst as proposers, CAs, vCAs (or without any specific roles).\nAs we have already known The Catalyst School is enhancing the impact of Catalyst completely by improving the contribution of all its players and roles, with the supporting from the main Catalyst School, Catalyst Swarm and Eastern Town Hall, this proposal’s success will be a big contribution to the growth of Cardano ecosystem in Eastern Hemisphere with a ‘similar services as The Catalyst School’ (as the proposal mentions). In my opinion, the main topics in the Eastern Catalyst School are fully information which will be a big help for all new onboarding members and exisiting community members. I think it would be greater if the School would add ‘Current news’ (based on the main Catalyst School) into the main topic (in Japanese, Vietnamese, and Indonesian of course) to update ‘news’ (from Town Hall for example). Moreover, I see in the references which are included the link of Catalyst School tree, I suggest the link of Catalyst School should be provided also (for new people who do not know about it yet). ", "q0r": 5, "q1": "The proposal is written very well in a clear way with information is provided in details consist of roadmap, milestone, budget, team members. The roadmap is very clear, allows readers see what will be executed in 6 weeks of each Fund and how many sessions and workshops will be provided in each Fund. About the team that build up the proposal, they are committed to Cardano system and Catalyst project with full experience and skills relevant to the successful conducting of the proposal, as they are ETH co-hosts, Cardano Ambassador, Challenge Team Members, developer, funded proposers,  Blockchain/Crypto educator, CAs, vCAs, and more.  \nAbout the budget, I think it is fair and reasonable, broken down very clear into items, we can see clearly what needs to pay for, how much cost for that, that helps us to understand the work that the team needs to do. The risk of the project and the solution are explained as well, that make the project more reliable of successful implementation. ", "q1r": 5, "q2": "Roadmap with milestone and time horizon are set clearly, make the proposal easy to be tracked the progress of the implementation. The targeted problem and solution are articulated clear understandable, the KPIs and success metrics are completely in detailed, and the plan in short term, middle term and long term provided, all of them are explained with a good level of detail, which helps us to understand what the result would be expected in general and have a vision of the project as a whole. Therefore, I strong agree the proposal is auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9127, "q0": "Language barrier has been a major issue anytime one wants to educate to onboard new members. It is a hug friction stagnating the take off to bring in new members in regions where English speaking is not dominating and because resources are written in English, it retrogresses all efforts in the ecosystem. \nThe proposal is meeting the challenge's quest to onboard ne members. This is consciously done by first removing language by educating the people in their native language and going full scale to deepen their understanding of the blockchain revolution.  ", "q0r": 5, "q1": "The roadmap and timelines are clear to know what will be weekly to educate the people in their native languages. The team is already part of the catalyst ecosystem and very familiar and experienced to deliver on the project. They have the capacity to navigate for results. \n\nThough the budget is detailed, the amount looks a bit huge in this regard. The contingency fees for example is quite high looking at the scale of work and there seems to be no risk involve in the execution of the project.", "q1r": 4, "q2": "Notwithstanding the fact that there are KPIs, these KPI are not well projected and measured to understand what the outcomes could be. The are realistic approaches to the auditing only that there are no metrics to make the auditing very easy. ", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9634, "q0": "This proposal spells out the clear problem of onboarding Eastern Hemisphere because of the language barrier. This corresponds in multiple ways to the needs of the challenge, as well as its proposed solution. The positive impact is conscious and clearly explained, making it possible to reproduce the Catalyst school model established within the municipality, for the Eastern Hemisphere. The KPIs are consistent with those of the challenge. This proposal is able to address future challenges, being part of a progression and a detailed and explained chronological construction. It is a plus to be able to have a global vision on the evolution of the project beyond the proposal, it allows to identify the impact in an evolutionary way. ", "q0r": 5, "q1": "All team members are easily identifiable, their contact details are given and their skills are consistent with the needs of this project. Many well-established collaborators in the community also support this project, which constitutes an additional sign of confidence. The budget is very clear and detailed, linked to the different stages of implementation. It seems consistent. It is planned and explained that sessions will be set up for the next fund, which also demonstrates a good organization and global vision of the project. Risks are addressed with solutions provided. The technical aspects of setting up are also very clear. The clarity and all of the information given make it possible to envisage the success of the implementation of this proposal. ", "q1r": 5, "q2": "\nThe roadmap is clear and detailed, it allows you to clearly identify the different stages of the project. KPIs make sense. With short term, medium term and long term objectives. The community will be able to rely on both qualitative and quantitative success indices. It will be possible to follow the progress of the project thanks to their website, their GitBook and their Landing page. Finally they specify: “By close communication, coordination and collaboration with the Catalyst Swarm, The Catalyst School, the Ambassadors Guild and the Bridge Builders, we build a Network of Community initiatives”: the communication and transparency effort of this team is certain and also proven by this clear, organized and complete proposal. \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10195, "q0": "This is the proposal to establish the Eastern Catalyst School with 3 main languages: Vietnamese, Japanese, and Indonesian. The school will impart knowledge about Catalyst to students who have an interest in Catalyst but are having problems with the language barrier. The idea is not new, but it is necessary for the development of Japanese, Vietnamese and Indonesian communities. The proposal meets the requirements of this Challenge.\nThe proposal does raise the risk of translation quality assurance and the way to deal with it is PDCA multiple times by surveys. This approach can take time but reflects the wishes of the community.", "q0r": 4, "q1": "Regarding the plan, the proposed team has come up with a specific plan on a weekly basis, the route corresponding to the schedule of Project Catalyst in the next funds. As such, the proposed team has also considered the implementation effectively and provided timely information to new participants in the following funds. I appreciate this thought. Classes and workshops will run for 6 months.\nRegarding the budget, the work items to be performed are listed in detail. The required cost for each work item is also specifically calculated. However, the budget applying for funding in this fund accounts for 13.63% of the total Challenge budget. This is a number that needs to be weighed against other proposals in the fund.\nRegarding project implementation members, the main team includes 1 Indonesian member, 1 Vietnamese Australian member, 2 Vietnamese members, and 1 Japanese member. These members are all experienced in Catalyst and blockchain. This project is mainly about Catalyst knowledge training in 3 languages ​​Vietnamese, Japanese and English, so the project can be done with such a team.\nHowever, I think the project will need more translation help from the community, this should be noted in the proposal.", "q1r": 3, "q2": "The community can see the team's work, project progress through the content published on the website.\nIndicators to measure the success of the project are given specifically. However, if possible, I think you should add in detail the expected number of your team's projections.\nFor example, what is the expected total number of community members participating in the Catalyst school? Approximately how many CAs participate in the sessions and workshops?...\nSpecific target indicators will help the team manage the plan better, and Catalyst, the community can check and compare the plan and the actual performance of the project.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Eastern Catalyst School will be a decentralized community of educators, educating on Catalyst in East Asia local languages.", "experience": "Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, Cardano Stake Pool Operators (SPO), IT & Software Engineering, Blockchain devs, Plutus/Atala Prism Pioneers, Educators and Accountants"}