{"id": 405429, "author": "daynavision", "title": "FIAT 1ST HOT WALLET Method", "url": "https://cardano.ideascale.com/a/dtd/405429-48088", "category": 26450, "amount": 10000, "description": "General public blockchain recruiting still has many barriers to entry. ", "f6_no_assessments": 7, "f6_rating": 2.904761904761905, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=0"], "media": [], "f6_assessments": [{"id": 461, "q0": "The proposal is an inventive idea for onboarding film merch buyers into creating Cardano wallets; but this challenge is about onboarding into *Catalyst*, so unfortunately the proposal is not relevant to the challenge. It is unlikely that simply creating a wallet and holding a free NFT will onboard people meaningfully into Catalyst, even with the educational material about Cardano that is to be included in the merch pack; meaningful onboarding into Catalyst itself would require much more targeted material, and probably more than a buyer of this kind would want to read. As an aside, it would have been useful if the proposal had included some sort of links to the \"Barracuda movie\" being referenced. I worked it out by googling, but this should not have been necessary. If its story (which is apparently about a crypto entrepreneur) somehow references Cardano in a way that might make viewers want to get more involved with Catalyst, or that would increase the proposal's impact in any other way, this should probably have been mentioned.", "q0r": 1, "q1": "On feasibility, the information given is vague. I would like to see the budget broken down in a little more detail, rather than having the developer's fee and the cost of the node server host lumped together, so we can assess if the costs are reasonable. I'd also like to see some milestones identified in the developer's work, so we can be assured that the proposer will be alerted to problems or delays; and some information on how the marketing budget will be used. Two risks have been identified, but no information is given on how the proposer will mitigate them. The team do seem to have the needed skills, which is good; but it's unclear what the proposer's role is and how she is involved. I assume, since she is from a sales background, that she is marketing the project; but if she is also managing the project, I'd like to see some resources (time and money) allocated to that, since at the moment there are none; and if she's not managing the project, then I'd want to know who does have oversight of it, and what safeguards there are and who will make decisions if problems occur. I'd also like to know how the project's completion date ties in with the release of the film, so I can understand how time-critical it is. Overall, with the information given, it's hard to be sure how likely the project is to be successfully implemented; so I can neither agree nor disagree.", "q1r": 3, "q2": "On the project's approach to audit - Asana (because it's private and not open-source) is not something that will enable the community to audit the project's progress; it would be great to use something non-proprietary for project tracking. And unless some record is kept and shared of the weekly Scrum meetings, the same is true of those - nobody can audit them. The only specific metric that has been identified is for at least 500 new wallets to be created this year, but it would be good to know how this information will be shared - how will we verify whether it has been achieved or not? I'd like to see the proposers record how many merch buyers actually decide *not* to go through this process and create a wallet - this would give an idea of whether the process is effective and does encourage people to create a wallet, or whether there are still too many barriers with it. The proposers could also track unique viewers of the online educational material about Cardano - comparing this against numbers of purchasers would give interesting detail on whether the information was being shared and passed on or not, which might indicate interest or enthusiasm.  But it's difficult to think of any way that we can audit whether or not the stated aim of the project - creation of someone's first wallet - has been achieved or not - we can't know if the purchaser actually already holds ADA and is therefore not being onboarded at all. And we cannot track whether purchasers do actually go on to hold ADA or even to be more involved, or if it is just something they do as a one-off and never touch again. Overall, I think the neither the proposal's progress nor its degree of success is sufficiently auditable.", "q2r": 2, "assessor": "z_assessor_1157", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 762, "q0": "This is another proposal in this challenge setting that misinterpreted the Challenge setting as being about onboarding to Cardano when it is actually for onboarding to Catalyst.  As purely a Cardano onboarding event, it is pretty unique in that it relies on things like pay-per-click ad campaigns, a webstore selling movie-themed merchandise, the post office, a scratch card with a code to be entered in a webstore login which --at that point-- creates a Cardano hotwallet with a cNFT inside it.  It kind of reminds me of the movie \"Back to the Future II\" where they travel to 2015 and the futuristic cellphones have long antennas.  In all seriousness, the idea here is that the movie \"Barracuda\" (which I couldn't find too many details on...but it is supposed to have blockchain references in it) which is supposed to be coming out at some point in the future, will get people who are curious about the movie or the blockchain references in the movie to check out the movie's website, where a purchase of physical merch will get the buyer a special card that helps them unlock a Cardano wallet and a movie NFT.  That sounds like a lot of work, to me.  Obviously, the intent of all that is not just to get a wallet/NFT made, that is just synergistically being added to an existing process, but I have to wonder if there isn't an easier way...", "q0r": 3, "q1": "As for the process they envision building out, they have two devs chomping at the bit to do a little Plutus scripting, and lets not forget setting up the Cardano nodes.  It wasn't completely explicit, but I don't think there is presently a node up and running, so the costs ($8k for the node, automation script) may be able to cover a bare metal node as well (side bonus, CCUDA SPO).   What I am really curious about is the target for this whole process.  They state it is for the general public, but the whole ordering merch thing seems like an odd \"general\" approach.  Why not a scannable QR code for an app that did the wallet/nft generation?  And if I am reading this workflow right, the wallet is generated from the website automatically...will there still be downloading/installing permissions to be answered by the user? What about the key generation...how will the user control their key or obtain their words?  This whole part seems really odd.  A basic skill of blockchain is creating and setting up wallets, so if the plan is to link them to Yoroi or something, and have plenty of educational material for that on the site and in the merch, I can dig it.  I would have liked to see more clarity on those points, though.", "q1r": 4, "q2": "They set a goal of 500 cardano wallets open by the end of the year, but what will they report on until then?  The obvious KPIs here are the setup of the server and probably testnet and mainnet deployment.  Maybe rolling out the educational material (design/create).  Then I suppose you wait for wallets to roll in...  Because the timeline isn't clear on this (30 days to set up node, integrated to website by July, or end of year for 500 wallets) we can maybe split the difference and suggest that the timeline be set at 3 months, which means the wallets won't be able to be used as a KPI.  But if they extend the timeline, it is going to split up the funding significantly, and since the first expense is also the biggest, the team may need to be prepared to raise their first disbursement to cover the costs.  This one won't be an easy project to report due to these logistical issues, although their use of a sprint burndown in asana should make keeping track of the node and script a breeze.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 940, "q0": "This proposal (intentionally or not) is likely to mislead voters. The problem statement and solution visible in the voting app will look like a solution is being created that addresses general lack of crypto adoption by linking fiat purchases with free NFTs to incentivize more people to \"get a crypto wallet\". This idea sounds great and very scalable if enough vendors can be recruited and the NFTs have broad enough appeal. The proposal does not meet the impression given by the problem and solution statements and we learn in the long form business plan that the project is limited to the proposer's own business and its merchandise.\nThe proposal was already fairly wide off the mark in meeting the challenge objective to make it easier or more attractive for developers or entrepreneurs to join Project Catalyst. In the light of the misleading pitch and short description of the solution,  I strongly disagree that this proposal effectively addresses the challenge setting. The goal of increasing Cardano wallets opened is also out of the scope of the challenge, which is specifically designed for Project Catalyst and should have included some potential benefit for Townhall attendance, Swarm attendance, IdeaScale usage etc. This is essentially a business proposal B2C in the wrong category.", "q0r": 1, "q1": "The technical team is credible and experienced for the task, and links have been provided to verify the identity of the developers. The proposer provides a LinkedIn profile and does seem to have the personality and experience necessary for creating \"buzz\" around this kind of NFT give-away. The timeline and budget seem realistic. Overall, despite shortcomings in impact and auditability, it is likely that the project can be implemented successfully.", "q1r": 4, "q2": "The Auditability section of this proposal is populated with 15 words and a number, which is a bit light if you are asking for $10,000 of other people's money in my opinion. There are no performance metrics or KPIs, and no reference is made to what success would look like. The only quantitative goal presented is \"new wallets opened this year\", which will be very difficult to link to the success of the proposal and not a commonly followed metric by any means to my knowledge. I have heard of Daily/Monthly Active Wallets used, but I am not sure this can be linked to the origination of the onboarding. Opening more wallets is also not very meaningful to the challenge setting. This metric is tracked over \"this year\" which is not in alignment with the timeline.", "q2r": 1, "assessor": "z_assessor_1243", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1546, "q0": "The proposer presents an interesting idea that have potential to be impactful for the cardano eco-system. However, this proposal is submitted in the \"New Member Onboarding\" category and I fail to see the connections between then the two. The campaign brief for \"New Member Onboarding\" focuses on the onboarding of new members to the Catalyst project, increasing activity on the platform as well as increasing the efficiency of voters/Ca's/vCA's etc. \nThis proposal fails to address how it will impact the new member onboarding issue. A suggestion is to resubmit this proposal in a more fitting category the next fund. If no other category is a good fit, there is always the option to submit it in the \"Miscellaneous\" category.\nIn terms of impact and alignment with the challenge, this proposal receives a 1-star.\n", "q0r": 1, "q1": "The proposer provides evidence of an experienced team with the right toolbox to implement the proposal, if funded. The budget is reasonable given the scope of the project. Overall, it is likely that the proposal is feasible. However, because of fundamental alignment issues mentioned in the impact section, 2 stars will be deducted. The motivation is that the proposer failed to address the fundamentals of the given challenge and their credibility should be questioned.\nScore given: 3-stars.\n", "q1r": 3, "q2": "The auditability section of the proposal is straight up too simple and short. Progress in measured in \"Asana project management\" and \"Weekly scrum meetings\". The proposal should give more details about what this means practically. It is not possible for an outsider to understand or audit the progress of the project in its current state.\nThe success metric is \"500 new cardano wallets\", how do you measure that a wallet have been created as a result of your project? Also, you should add more relevant KPI's for the project related to the challenge setting you decide to apply to in the future.\nBased on the arguments mentioned above, a score of 1-star is given.\n", "q2r": 1, "assessor": "z_assessor_139", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "In general, the New Member Onboarding Challenge was a little confusing as I had multiple Challenge Team Members from different Challenges tell me to submit this proposal in this challenge. The resources and education we will highlight on our website where people will be able to buy the Fiat First package will educate people about Catalyst.  This is stated in the body of the proposal: \n\nEducational material about Cardano, it's ecosystem, and how to be more involved will be included in the physical merch pack. "}, {"id": 2748, "q0": "This proposal does not address the challenge as it relates to onboarding new members to Project Catalyst.  It does address an important need of onboarding the general population to the Cardano ecosystem and in that way could provide a benefit to the community.", "q0r": 2, "q1": "The proposal has sufficient detail suggest that the proposer and proposed team can implement this project successfully.  The proposer and developer have relevant experience and impressive resumes.  I believe it highly likely this team can execute the proposal as described.", "q1r": 4, "q2": "The team plans to report on weekly meetings to update the community on progress and propose to monitor new wallets created with the goal of 500 in a year.  This could be easily tracked by the team and reported to the community.", "q2r": 4, "assessor": "z_assessor_1574", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5253, "q0": "This is a pretty easy vote for me. At $10k requested, this is not a huge risk of a proposal (especially in the hands of reputable developers that are known by the community). The impact of this proposal is driving forward the greater utility of NFTs in the Cardano ecosystem. This proposal seeks to integrate NFTs in ways that aren't being done AND it targets new people to drive forward adoption. Also, I like that this project is pretty clearly not a profit-driven proposal that just seeks to have the Cardano community pay for their business. Again, easy, low-risk, low-cost, and effective strategy. ", "q0r": 5, "q1": "This is a relatively lightweight roadmap/budget. This makes sense in a lot of ways because the proposal is relatively straightforward. I still give a positive score but I do think there could be some improvements made. I think there could be a little more detail in the budget breakdown. There may only be 2 categories but there could be more detail in sub-categories that could add more transparency to the overall plan. In this section, I like to see an outline of the marketing strategy and how efficiently the marketing funds are being spent. Especially since the real impact comes from people interacting with what is being created, I want to see what the plan is to get attention from people. ", "q1r": 4, "q2": "Despite the likelihood that this proposal is an easy approval, with a straightforward goal, and a lack of ways that success can be measured, I'm not letting you off easy for this section. There are always KPIs and quantifiable metrics that can measure success by. Here are my ideas: How many NFTs are minted? How many SKU slips are distributed? How are the social media engagement and marketing campaigns going? Milestone-based KPIs is a big win for me too, even if it's just on social media engagement. I also don't think 500 new wallets are ambitious enough (I'd also like to know how you plan on measuring that information). With a $10k budget, 500 wallets are $20 per new wallet (or new user). That's not terrible, but it's not really that impressive either. Remember, this is what happens when you don't put enough information in any section of your proposal. I'm forced to pull out a bunch of critical commentary on what could've been done. Overall, great proposal. Bad auditability. ", "q2r": 3, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5690, "q0": "The proposal addresses the challenge by onboarding new users, and providing incentive to create a cardano wallet by gifting a free NFT with the purchase of another item. The goals are measurable and achievable, however there are no details on the technical and logistical feasibility or what challenges the proposers may face in implementing them. It is not provided in this assessment how the proposers plan to scale the concept if successful. ", "q0r": 4, "q1": "The proposers are both experienced cardano developers that have provided websites and services for the cardano community. They have provided clear goals to pair NFT's with fiat purchases through the proposers website and online sales. \nThey have provided budget that is a reasonable amount for the proposal and it is clearly broken down into steps. The budget is very reasonable for this use case. \nThe proposers appear to have the technical ability to implement the proposal, however specific architectural/technical details are not included in this proposal. There is brief mention of risks involved, but not a detailed analysis of potential problems", "q1r": 4, "q2": "The auditability of the given end goal (500 new wallets, claiming the nfts) is easily trackable by the proposing team, however it is not clear how the community would audit this goal, or prove that each wallet is a new and unique user to cardano. \nMore information could be provided on how to audit the success of this project. ", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Utilize generated coupon codes to pair \"free\" NFT's with physical merchandise purchased w/ fiat that incentivizes new hot wallet creation ", "experience": "Dayna Kovacic - https://www.linkedin.com/in/dayna-kovacic-a0821365/\n\n14+ years sales experience, specializing in new product launches and stakeholder training"}