{"id": 380957, "author": "wvalthar", "title": "@chain-lib Documentation Website", "url": "https://cardano.ideascale.com/a/dtd/380957-48088", "category": 26251, "amount": 4211, "description": "La documentación actual de chain-lib está en github. Esto será para crear un sitio web docusaurus en el sitio web chain-lib.com que poseemos.", "funded": 2, "upvotes": 47396000, "downvotes": 6366578, "votes_result": 41029422, "votes_cast": 105, "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "El proponente quiere construir un sitio que contenga toda la documentación del desarrollo realizado en otras dos propuestas por él. Me encanta la definición de éxito que se hace en la propuesta, porque como desarrollador que ha probado nuevos frameworks y librerías, es importante tener una buena documentación. Esta idea es genial para este reto y creo que si las otras dos propuestas son votadas, esta tiene que serlo también.  Las métricas dejan algo que desear, aunque están en consonancia con el planteamiento del reto. Como dice el autor, la mayor parte del sitio se generará, así que eso haría que el soporte fuera relativamente fácil, y se puede traspasar cuando el proyecto crezca lo suficiente. Lo que me falta en la propuesta es un plan para cuando esta propuesta (la documentación) sea votada pero las bibliotecas reales para las que esta documentación está escrita no lo sean. Tal vez habría sido una mejor idea agrupar esta propuesta con una de las otras dos para evitar este escenario. Sólo una sugerencia para la próxima ronda de financiación.", "q0r": 5, "q1": "Aunque hay una extensa lista de habilidades relativas, no pude encontrar una manera de verificarlas buscando en Google o siguiendo los enlaces que se dejan en la propuesta, lo que me dejó un poco con ganas de más información sobre las credenciales de la persona o equipo u organización que planea hacer el trabajo. Como no se menciona ningún equipo, supongo que se trata de un proyecto individual.  El presupuesto es claro y se entiende a qué se destina el dinero y a qué se destina. El calendario previsto también me parece legítimo como desarrollador que ha hecho algo parecido. Hay una imagen clara que muestra el plan de implementación de la documentación y las herramientas que se van a utilizar.  Los aspectos técnicos de la arquitectura son bastante sencillos, pero sería una buena idea, en mi opinión, enumerarlos de todos modos en el futuro. No creo que haya ningún riesgo para la realización de este proyecto en particular, aparte de lo que ya he mencionado sobre la financiación de esta propuesta. Yo recomendaría al autor buscar desarrolladores afines en la comunidad y colaborar con ellos para futuros fondos.", "q1r": 5, "q2": "Hay un enlace al proyecto en github y eso es todo lo que se puede desear cuando se quiere seguir el progreso de la implementación de un proyecto. Los KPIs listados son relevantes y es un soplo de aire fresco ver por fin una propuesta con KPIs reales. Otras métricas que recomendaría utilizar son el embudo de usuarios activos y la tasa de abandono. La hoja de ruta es bastante sencilla y es un trabajo de unos 3 meses. Una vez que esté hecho, el sitio de documentos estará en línea y disponible para todos.  La descripción y la solución descritas en la propuesta son lo suficientemente claras como para ser entendidas por cualquiera.  ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The curse of open source is documentation since it takes a completely different skill set and developers are notorious for not creating proper documenting which limits the use and maintainability of the package. The proposer is nice in making an initiative to document the package and rightly address the challenge. ", "q0r": 5, "q1": "The proposer has published the code base of the library in Github and it is being used. The quality of the code is good. Based on this observation the proposed will be able to prepare the proper documentation and host it. The proposer seems to have the capability for this activity. \r\n", "q1r": 5, "q2": "The documentation for a library is the most important component for its sustenance and usefulness. The open-source project has a serious issue in this respect. The quality of the documentation can be a subjective assessment and the amount of work can vary widely. The progress and the quality can be monitored closely. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the challenge by building an API documentation website for developer to use. By creating a proper documentation website for @chain-lib library, it will make it easy for developers to navigate finding information for the library. Since this @chain-lib project is a work in progress, the impact of creating this documentation will depend on the success of @chain-lib project (which being proposed in this Fund 7).", "q0r": 4, "q1": "The proposer doesn't have any other information other than their short name and their past experience in working with Cardano, but they did provide a work poof on their GitHub repo. The proposer know what resources are needed to implement this proposal (using Docusaurus framework). It would be better if they also provide other information such as hosting platform will be used. This proposal provides budget details like working hours and domain cost. However, the proposer doesn't explain the taxes clearly. It would be better if the proposer also explain how those tax is calculated, so we could verify if the budget is honest and reasonable. All in all, creating a documentation website using a well known Docusaurus framework will make this proposal feasible to implement, however, the budget is still not clear regarding the taxes.", "q1r": 3, "q2": "The proposer doesn't have any other information other than their short name and their past experience in working with Cardano, but they did provide a work poof on their GitHub repo. The proposer know what resources are needed to implement this proposal (using Docusaurus framework). It would be better if they also provide other information such as hosting platform will be used. This proposal provides budget details like working hours and domain cost. However, the proposer doesn't explain the taxes clearly. It would be better if the proposer also explain how those tax is calculated, so we could verify if the budget is honest and reasonable. All in all, creating a documentation website using a well known Docusaurus framework will make this proposal feasible to implement, however, the budget is still not clear regarding the taxes.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 20, "ne": 6, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This idea will help everyone know that chain-lib helps and can accelerate the development of other projects by using chain-lib open sources. But the detail of this proposal says nothing about how their project impacts the ecosystem and which particular part of their system will be used in this project, all is common info.\r\nAnd the team doesn't identify any key metrics for this proposal, which confused me to assess their idea more. ", "q0r": 2, "q1": "There is no plan that is presented in the proposal, there is just only common introduction about their current Github and a short technology explanation about what they will deploy for this project form their source. Moreover, there is no roadmap. Therefore, the feasibility of this project can be assessed because of lacking these things. \r\nBy the way, their required budget also is not reasonable because everything is unclear", "q1r": 1, "q2": "The team lacks of: roadmap and key metrics. For helping Catalyst community audit the proposal, the team should give a detailed roadmap with a timeline that is realistic. \r\nOne more thing that the team doesn't have here is a detailed explanation about the problem, and their solution is just a brief in the overview, that all make sense how they will solve the problem or how hard they study about the problem to make a best solution. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is about creating a proper documentation website to make it easy for developers to use the API, and to ease the creation of plugins. The problem [of Current chain-lib documentation] is clearly described, and explained in detail. However, the solution is not clearly defined enough and remains quite abstract, as a result, no clear expected impact. Therefore, based on the given information, I am neutral with this proposal's impact, I can rate it with a score of 3", "q0r": 3, "q1": "The Chain-lib team's profile is provided and described enough for understanding with suitable skill and experiences for implementation. However, it's hard to verify the ability and experiences of each member. There is no information on demo/pilot/similar works done by this team. In similar, KPIs and Risk (and mitigation) were not provided. On the contrary, the budget is clearly provided with structure and explanations of calculation base. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of info on Chain-lib, however, there is a lack of: (1) Chain-lib's member's profile and external links for verification; (2) KPIs, (3) Risk (and mitigation). By the way, there is no information on similar works done by this team. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Crear un sitio web de documentación adecuado para facilitar a los desarrolladores el uso de la API y la creación de plugins.", "experience": "Desarrollador de Novella / Cardano Keys, SPO, Alanzo Purple tester, Plutus Pioneer 1, y ya ha construido varios componentes dentro del repo de github."}