{"id": 381012, "author": "matthiasksieber", "title": "Blace.io: Marketplace Creator ⚡", "url": "https://cardano.ideascale.com/a/dtd/381012-48088", "category": 26251, "amount": 97000, "description": "A medida que se construyen los mercados, se repite el trabajo, lo que reduce la eficiencia general de los desarrolladores.", "funded": 1, "upvotes": 51226590, "downvotes": 24056593, "votes_result": 27169997, "votes_cast": 209, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=18945"], "media": [], "f6_assessments": [{"q0": "Este proyecto será enorme si tiene éxito. La propuesta está tratando de eliminar la mayor parte del trabajo duplicado por los desarrolladores mediante la construcción de un mercado de herramientas en un lugar reutilizable. Esto permitirá a otros desarrolladores de Dapp centrarse sólo en las diferentes características y aspectos de su propia Dapp. Como desarrollador que soy, me encantaría contar con este tipo de herramientas. La configuración del reto está en línea con la propuesta. Este proyecto añadirá un enorme valor al ecosistema de cardano, debido a la velocidad y la actualización de la consistencia si todos los futuros mercados tienen los mismos huesos.  Este es un gran equipo, que será capaz de escalar con cualquier desafío futuro que pueda surgir. A diferencia de muchas otras propuestas similares que he visto, en esta no faltan elementos. Ahora mismo, el ecosistema de desarrollo carece de este tipo de herramientas, que desempeñarán un papel fundamental en el futuro.  ", "q0r": 5, "q1": "El equipo es bastante grande, lo que me asegura que el trabajo se hará tal y como se describe en la hoja de ruta. Tienen todos los conocimientos de software necesarios para llevar este proyecto a buen puerto. Han dejado sus perfiles de linkedin, y así aportan legitimidad a su trabajo. El presupuesto es bastante grande y habría sido bueno tener un desglose de los costes reales que están previstos en la hoja de ruta. Sugeriría a los proponentes de este proyecto que piensen realmente en una tabla de desglose del presupuesto. El hecho de que ya hayan identificado los números del equipo específico y el conjunto de habilidades es sorprendente, pero lo que es aún más sorprendente es que ya han formado un equipo listo para trabajar.  Hay un calendario razonable y realista para completar el trabajo. Los proponentes mostrarán no sólo cuándo, sino cómo se hace el trabajo, cuando abran los bloques de construcción.  Los aspectos técnicos de la propuesta son bastante sencillos... escribir código para que otros desarrolladores puedan utilizarlo. Como desarrollador, me impresionó el hecho de que la CLI (interfaz de línea de comandos) se realizará utilizando Haskel, que es la elección original del lenguaje para el ecosistema cardano. Los miembros del equipo tienen una gran mayoría de habilidades y destrezas, por lo que me siento confiado en su capacidad para enfrentar los desafíos en el futuro. Los futuros proyectos tendrían que estar sincronizados con este para promover un desarrollo más rápido.  ", "q1r": 5, "q2": "Cualquiera que esté interesado en el trabajo de código abierto podrá seguir el progreso de esta propuesta, excepto en el caso de la herramienta CLI, que será de código abierto una vez que se despliegue el proyecto. Esto hace que la auditabilidad de la propuesta sea bastante fácil. No hay KPIs listados, lo cual es un pequeño problema, yo recomendaría que se añadieran algunas métricas de adopción para futuros proyectos.  La hoja de ruta y los hitos del proyecto están claramente establecidos y son factibles. Hay una descripción clara y comprensible del problema que se pretende resolver, y los proponentes hacen todas las preguntas correctas. Es fácil ver que han pensado bien las cosas antes de hacer esta propuesta y que han profundizado en los problemas de negocio y de desarrollo del estado actual del ecosistema.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 4, "nfo": 2, "vca_o": 2}, {"q0": "The proposal is addressing one of the most critical requirements of the Cardano open source ecosystem. This proposal is an example of why this fund stream was created. This proposal has the potential to lower the entry-level for a large number of innovative market makers and boost the complete ecosystem in a substantial manner. ", "q0r": 5, "q1": "The proposal is being made by a strong team of innovators with established credentials in the Cardano community.  The project site list 9 international members. The countries that are represented in the team just exemplify the spirit of Cardano and the power of open source to bring people together. I would like to stick my head out and go on to say that it is one of the best teams we have seen in the Cardano proposals. ", "q1r": 5, "q2": "The proposal is clear and has a well-defined functional point that is aimed to be developed. Their output will be open domain and the progress can be monitored. The proposal is highly auditable and the success can be measured based on the number of forks/use of the web market. \r\n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal intention is to build infrastructure that makes it easier to create a marketplace within the Cardano ecosystem. The core components are listed that are common to a marketplace and that are often shared pieces of logic and functionality between systems. As identity and payments increasingly utilize blockchain we can expect to see an increasing demand for marketplaces for both services and products. Marketplaces represent some of the biggest companies in the world and due to that there is a big opportunity for this proposal to lead to high impact marketplaces if executed well.", "q0r": 5, "q1": "The proposal team are listed in a separate link with their LinkedIn profiles added. The team has a strong background in software development which will be important for feasibly executing this proposal. A budget breakdown is not provided which makes it difficult to know exactly where the funds will be used. The teams background makes this proposal feasible but to further improve the rating more information would be needed for a budget breakdown and also potentially more information on the core features and how they would be implemented as they are non trivial. Some of the features could have been marked as high priority and released in stages as they are completed.", "q1r": 4, "q2": "A roadmap is presented with the key areas of focus. No KPIs or success objectives have been added. As an area of improvement the core components listed are likely non trivial to implement, it would have been good to see some groupings to state which ones will be implemented first so they could be released and shown to the community, ideally open source. This would make it easier for the community to audit and provide feedback as the proposal progressed through the initial implementation. Better clarity on the budget break down would also be valuable so it's easier for the community to audit where the funding budget was spent.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Proporcionar a los desarrolladores una funcionalidad de mercado de capa base, para que puedan centrarse en los aspectos específicos de sus productos y servicios.", "experience": "Un equipo experimentado de desarrolladores, pioneros de Plutus, expertos jurídicos, gestores de proyectos y directores técnicos."}