{"id": 383426, "author": "juliane", "title": "GMBL Turning Dev > Blockchain Devs", "url": "https://cardano.ideascale.com/a/dtd/383426-48088", "category": 26251, "amount": 64000, "description": "No hay suficientes desarrolladores de la cadena de bloques de Cardano para hacer frente a la oleada de trabajo que se avecina.", "funded": 1, "upvotes": 52644389, "downvotes": 19749965, "votes_result": 32894424, "votes_cast": 269, "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Los proponentes quieren contratar a dos desarrolladores extremadamente hábiles y hacerlos expertos en cardano blockchain para que puedan traer y enseñar a su vez a más desarrolladores. Hay un gran problema, que debido al rápido crecimiento de la comunidad cardano hay una necesidad de aplicaciones, pero esas aplicaciones tiene que ser escrito por alguien. Este proyecto ayuda a enseñar a estos alguien a hacer grandes Dapps que harán crecer la comunidad en tern. Esto aporta un gran valor a todo el sistema cardano, porque introduce a los futuros constructores del ecosistema en el desarrollo del blockchain. Como desarrollador yo mismo, también me siento tentado. Hay métricas y objetivos claramente definidos para las propuestas, así como una relación muy bien pensada entre el planteamiento del reto y la propuesta. La propuesta está realmente enfocada a ser capaz de escalar, y ha demostrado su valía en fondos anteriores, que ya están cumpliendo. No veo que le falte nada a esta propuesta, y eso, por desgracia, no es un comentario que haga a menudo. El equipo aportará una gran parte que faltaba al ecosistema: un proceso de incorporación de desarrolladores experimentados al mundo del blockchain.  Seguramente seguiré de cerca este proyecto y su progreso.  ¡Buena suerte!", "q0r": 5, "q1": "Hay pruebas más que suficientes de las habilidades de las personas que se declaran en las propuestas. Sus nombres completos y sus perfiles se dan libremente, lo que aporta credibilidad a toda la propuesta y a la idea. El número exacto de personas y procesos se da de forma clara y no se desperdicia ninguna reflexión a la hora de descubrir la mejor forma de enfocar el problema. El presupuesto se expone con claridad y se desglosa de forma directa para que no haya confusión ni nada que induzca a error. El plan es sencillo: pagar sueldos a personas para que hagan un trabajo durante un tiempo determinado. La propuesta ofrece un calendario realista para completar el trabajo, e incentivos para hacer el mejor trabajo posible escribiendo documentos y formando a nuevas personas. Hay un plan sensato para la implementación de la propuesta y se proporcionan los pasos a seguir. Los recursos necesarios para la implementación son abundantes, ya que algunas de las herramientas ya están hechas, y se hizo un análisis profundo sobre lo que es necesario, así como lo que depende de qué desafío y retroalimentación.  Los retos que la propuesta puede tener en el futuro como la pérdida de personas por falta de un entorno estable es un problema serio, pero los proponentes no decepcionan. Han pensado en todo, me parece. El proyecto está en plena sintonía con lo que ya se ha hecho. Y quiere construir sobre ello como es debido.", "q1r": 5, "q2": "La trazabilidad del proyecto será fácil de seguir ya que los proponentes han mencionado varios lugares como discord que pueden ser utilizados no sólo para seguir sino para interactuar con diferentes miembros interesados de la misma comunidad. También se mencionan las métricas y los KPI y se les ha prestado una clara atención. Hay objetivos claros que son realistas y medibles como mantener a las personas con las que se trabaja proporcionándoles el ecosistema adecuado para que se queden. Hay una hoja de ruta con hitos que son simples pero fácilmente comprensibles y rastreables. Hay una descripción clara del problema que se resuelve y de la solución que se ofrece.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 11, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "Among the proposals in this challenge, this proposal is exemplary in its alignment with the mission of Challenge. The proposal aims to contribute to an open source ecosysteem as a whole, rather than proposing an open source solution to a single problem. Educating and onboarding new developers into the ecosystem while they help build on open source tools is a very direct and effective way of addressing the challenge. The efforts of the Gimbalabs team have been a cornerstone to the current Open Source Ecosystem in Catalyst", "q0r": 5, "q1": "This is a continuation of an ongoing effort and the team has shown capable of organising these efforts succesfully. Clear details are also provided in the proposal itself about the team.\r\nThe proposal includes a clear roadmap and achievable plan. The proposal could have included more details on the trajectory and expected activities of the 2 Developers.\r\nThe team has shown that this format is working so far, however success does rely on continued efforts from the 2 Developers being educated. Perhaps in the future the plan could include some details on contingency in case of a drop-out along the way and how funds are distributed (e.g. as montly salary or upon completion)\r\n\r\nThe budget will be used to provide a fair income for the 2 developers adn facilitation. The majority of the funds are destined for other people then the proposers. However the total funds are ~1/3 of the total budget in the challenge. This is not excessive but definitly on the high side. (This was weighted less in scoring due to the more altruistic nature of the proposal)", "q1r": 4, "q2": "Because the proposal focuses specifcally on two developers, the progress of proposal  should be clearly trackable through their contributions to open source projects and future continued efforts. \r\nThe efforts that are currently ongoing include 2 weekly public sessions where other people can observe. This makes the proposal transparent and auditable.\r\nFurthermore the Gimbalabs team has shown commitment over the past year to regularly provide updates through their social media channel on all their ongoing efforts.\r\nFor accountability some information could have been included in how the work will be the developers will be organised. For example, some indication of who/what will decide which projects or tools the developers will work on.", "q2r": 4, "assessor": "z_assessor_587", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "GMBL hopes to continue their work of engaging community development to solve the coming \"tidal wave\" of Cardano expansion. The proposal seeks funds to move 4 volunteer developers to full time paid positions for four months. This is an interesting request but I think that it is a logical step in the evolution of Gimbalabs and Catalyst. As Catalyst fund sizes grow, it makes sense that incubators like gimbal should be able to jump-start developers who have proven their potential through project based learning. This may be the capstone moment convincing junior developers to embrace Cardano full time, which is exactly what the ecosystem needs. ", "q0r": 5, "q1": "Gimbalabs have been around since the early days of Catalyst and grown into a valuable incuabator for new Catalyst developers. Interesting projects have emerged. This is a very straightforward proposal requesting funding to pay new junior developers. I have no doubt that gimbal has talent in their discord worthy of being paid full time, and valuable projects to which they can allocate those skills. ", "q1r": 5, "q2": "The success metrics are outlined for 3,6, and 12 months and it should be easy to track if these developers go on to add value to the ecosystem. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 23, "ne": 4, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Apoyar a los desarrolladores experimentados para que se conviertan en expertos en el desarrollo de la cadena de bloques de Cardano.", "experience": "Historial probado de incorporación de nuevos desarrolladores al ecosistema de Cardano, proporcionando herramientas esenciales y oportunidades de colaboración."}