{"id": 383580, "author": "game.changer.wallet", "title": "GameChanger CLI: ready2use outputs", "url": "https://cardano.ideascale.com/a/dtd/383580-48088", "category": 26251, "amount": 2000, "description": "La herramienta gamechanger-dapp-cli es capaz de generar códigos URL y QR, pero no proporciona fragmentos listos para integrar para HTML, react, node...", "funded": 2, "upvotes": 62183205, "downvotes": 6338755, "votes_result": 55844450, "votes_cast": 177, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "GameChanger CLI wants to provide a better integration for an already existing project to enable developers writing dapps. The proposal is just in the right challenge setting, growing the ecosystem already and with this change it would spread even more. There's an implicit certanty this project will add value to the cardano ecosystem, because they have an already working product and polishing it alongside growing their community.  The proposal is well thought out and the authors have considered time for unexpected hurdles and challenges in the comming development.  This proposal adds simplicity to the ecosystem which is very important in the begining of any growing community. ", "q0r": 5, "q1": "There's explicit evidence for the skills and people working on the project. This brings credibility in my eyes as a developer and in the eyes of the voters. The number of team members are known as well as the exact work they need to do to reach their goal. Ther budget is 2000 dollars which is next to nothing and it's clear it's going to be used for salary so it's a no brainer for me. There's a realistic timetable with work needing to be done described in steps.  The plan describes the resources that are going to be needed to implement the proposal like team members along with skills, software and hardware that's needed and already used. Good use caes on top of which to build and expand.  The authous thought about potential risks and have included time in the original timetable to fix anything that comes up.   ", "q1r": 5, "q2": "I wish there was more information shared on tracability by the community. I'd suggest for future proposals to give the community a way to easily interact and follow the progress of your project. A simple discord channel or a link to a github repository would be enough for anyone interested.  There's a clear roadmap with clear tasks to be done alongside a timetable, nothing to worry about here speaking from a dev's perspective. The problem and the solution statements could be more clear, because it took me a while to understand what's the purpose of this project in the first place. This should be clear in the first couple of sentences.   Good luck to you and your project!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 21, "ne": 0, "ng": 14, "nfo": 7, "vca_o": 1, "reply": "It is clear that the scoring criteria and assessment guidelines were not applied or understood by the CA, with personal bias included. "}, {"q0": "In its proposal, the team clearly and concisely points out the problem and offers an elaborate solution to the problem. This project, if implemented, would have a positive impact on the Cardano ecosystem. The proposal clearly represents how it will add value to the Cardano ecosystem. Unfortunately the team omits KPIs so it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "This team of three people definitely has the experience, knowledge and skills to realize this project. They prove this through transparency via the website and LinkedIn acc. The team clearly represents the realistic budget needed to complete the project but unfortunately omits the budget brake down into identifiable items. The team sets out a work plan and has details of actionable tasks and an order of execution. Maybe it would be a little better to work it all out but ok. The team in the proposal offers a realistic timetable to complete the work and lists the necessary resources together with the technical aspects needed for the implementation of this project. Unfortunately, the team does not take into account the possible risks, nor does it offer solutions if they appear.\r\n\r\n\r\n\r\n", "q1r": 3, "q2": "The team clearly explains the roadmap with milestones and a time horizon for achievement but unfortunately the KPIs are completely omitted. As KPIs are missing there is no way to measure the success of the proposal. Although KPIs are missing, the community can follow the development of the project, but the question is how will we know that the project has been successfully implemented?", "q2r": 3, "assessor": "z_assessor_656", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Gamechanger wallet continues to to develop novel features that streamline the creation of complex transactions for all users.  There approach has a lot of potential to make development of dapps more accessible. The proposed cli-tool will make it easy for users and developers to integrate gcscripts into websites in a way that will lower the barrier of entry to dapp development and payment tools. ", "q0r": 5, "q1": "The team has proven their ability to develop a novel wallet from scratch using catalyst funding. The timetable is short, focused, and realistic. I have no doubt that the team will be able to make this happen.", "q1r": 5, "q2": "Funds asked for are very modest, simply to pay a developer to complete the project. The end results are clear and will be very easy to audit for success/failure within the given time window. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 23, "ne": 3, "ng": 16, "nfo": 4, "vca_o": 1}], "solution": "Proponemos ampliar la actual generación de URLs y códigos QR desde GCScripts, con fragmentos de HTML plano, React y Nodejs.", "experience": "Hicimos de GameChanger un producto liberado y de larga duración, un monedero altamente humanizado y gamificado, comprometido con los recién llegados, los estudiantes y los constructores."}