{"id": 383625, "author": "raz", "title": "Fund7Proposals + SDGs - Cardano AIM", "url": "https://cardano.ideascale.com/a/dtd/383625-48088", "category": 26251, "amount": 5500, "description": "Conectar los ODS + las propuestas catalizadoras requiere análisis + evaluación.Pedimos apoyo para continuar el trabajo en el Fondo 7 como hemos hecho con el Fondo 6.", "funded": 2, "upvotes": 79246467, "downvotes": 9244837, "votes_result": 70001630, "votes_cast": 293, "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "As an active Catalyst member, a funded proposer and a conscious earth citizen, I think that the proposal helps to drive the Challenge goal forward, as it is creating a research with data about Proposals adherence or relevance to the SDGs, allowing for further creation of tools to drive proposers and proposals to show their impact on them.\r\nThat will drive more developers that are willing to create and impact, towards the cardano ecosystem and also organizations that can benefit for this great source of data and knowledge.\r\nThe proposers are stating clearly that they will publicize the results and make the data public. Though not so clear about which license they have choosen.\r\nThe KPIs are concrete and SMART, with clear outcomes that will be delivered during the timeframe of the project.\r\nAs a suggestion for improvement is to indicate how many more funds will be required to analyze as the proposers are indicating they plan to extend it to Fund 9, so at some point in time it will be relevant to understand how good is enough or how to make this research sustainable.", "q0r": 4, "q1": "All the proposers are well known Catalyst members, that have demonstrated enough skills to be up to the challenge, and they previously funded proposal is on track to deliver, so continuation of that effort seems reasonable.\r\nThe budget required is specific, well explained and reasonable for the stated effort.\r\nThey have also indicated a plan to apply to future funds (up to fund 9) which is ok, but in order to create less risks some alternative funding mechanism should be taking into account.\r\nHaving the AIM support is also a guarantee for the community that this proposal will reach its objective.", "q1r": 5, "q2": "All the milestones and KPIs are clear and SMART, with reasonable effort and time to be able to deliver them and also will generate enough evidence for the community to be able to track them.\r\n", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 19, "ne": 6, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposers want to analyze only the funded fund 6 and fund 7 and extract usefull information for the stakeholders and anyone interested. When there is rapid growth as there is in the cardano community, there's an abundance of data, but not of information. In order to extract information from the data tools and manpower is needed. This ties in with this proposal. Creating information from data. This information in turn will help them build better tools for CAs as well as Proposers which closes the circle nicely. The proposal is deffinately in the right challenge and clearely explains the value it will bring to the cardano ecosystem with numerous examples and power point presentations. Key metrics are valid and in line with the challenge settings. In order for this proposal to scale IMO as a developer an iterative approach has to be taken, and from what I'm seeing here, this is exactly what's being done. I see nothing missing or lacking from the proposal, because after all these are the people that help you with tooling to bring better proposals and it shows they know what they're doing. The authors bring tool evolution and missing tooling to the cardano community and they're being used and appreciated. I don't have any concerns whatsoever. The only thing left to do for me is to wish good luck to the authors which have helped me along the ropes in the telegram channel. \r\n", "q0r": 5, "q1": "Concrete evidence is provided in the form of verifiable (personal) infromation about peoples skills and name and I respect that immensly. The number and role of team members is clear and well defines so no unnecessary effort is made. The budget is not only negligible considering what is being delivered, but also very well defined and a clear rationale is given for the money requested. There's a realistic timetable (about 3 months) provided which is sensible considering the work that needs to be done. The implementation plan is sensible and well defined. The proposers plan on collecting data and presenting the consolidated information publicly. The resources included and necessary in order to bring this proposal to fruition are provided and anyone interested can visit the SDG (sustainable development goals) site and have a look.  Challenges taken directly from the challenge settings are taken and a pretty detailed and exhaustive answers are provided.", "q1r": 5, "q2": "I'm not worried about the community being able to track this projects progress. The authors of the proposers are very active community members sharing several different channels of communication like telegram, discord and social media with the community. There's also a very well defined plan on sharing the progress of the project with anyone interested. The metrics and KPIs are well defined (3 of them) and are as expected: a powerpoint presentation with conclusions about the gathered data and generated information which is the most valuable one in my oppinion. Roadmap with milestones and a sensible time for execution is provided as well. The description of the problem being described could be explained in a more impactfull way to engage the community even more, when they see a concrete benefit for them.   Good luck to all of you! I hove the vote goes in your favor!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 9, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The connection between Catalyst funded proposals and UN SDG is increasingly important and this proposal aims to assess how funded proposals in this and past fund relate to it.\nTherefore, this proposal has a major role in improving catalyst relevance. In addition, it is highly related to the challenge it is in (open source developer ecosystem), impacting questions like \"How can we ensure future developers benefit from the work that is funded today?\", \"How do we align between different open source community efforts?\" and challenge kpis like \"Usage of open source docker containers\". \n\nAs to proposal itself, a few considerations: it could be provided more information what \"sustainable theoretical framework lens\" is and how it works. Tried to google but couldnt find anything that seem to relate. It also says improvements on the SDG tool is within project scope but it could be said which improvements are these and why only in F9 it is intended to be integrated in idea scale.\n\nIdentifying how proposals link to UN SDG is a very good first step and this initiative should be congratulated. As a possible second step for medium-long term funds, is helping measuring this impact in a quantitative manner, instead of just in a qualitative way. I mean, if a project says, for instance, it will decrease gender inequality (UN SDG 5), some of its KPIs could be related to it (# of women contemplated in the project, taking part of the project, etc). If it says it will tackle climate action (SDG UN 13), it could be calculated how much GHG it is saving as one of its KPIs. A tool that helps to build these kind of metrics could be very helpful.\n", "q0r": 5, "q1": "The team is experienced, already implemented the tool in past funds and desires to keep working on it so the proposal seems very feasible. There are good descriptions on the indivduals of the team with linkedin links. 3 people already committed and their competence seem also enough.\n\nThere's a solid plan in place (summarized in the proposal but with more details in an online spreadsheet) and the results are quite fast. There's also a fair budget breakdown and project doesnt seem expensive. As suggestions, part of the budget breakdown could be splitted into working hours (I understand most of the budget is to pay for the teams hours worked).\n\n", "q1r": 5, "q2": "There are clear deliverables and milestones defined already. As this project is more of a research, it is hard to set KPIs. I only missed in the deliverables section the part of the tool improvement, that should be done in March, according to roadmap.\nIn general, the project is auditable.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 23, "ne": 10, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Analizar las propuestas financiadas por el Fondo 7 en busca de conexiones con los ODS. Presentar los datos y la información en una base de datos de libre acceso. Compartir con los medios de comunicación y los socios potenciales.", "experience": "Financiar a 6 proponentes financiados, al equipo de AIM de Cardano (herramienta de votantes, herramienta de CA, herramienta de vCA, herramienta de proponentes), a los educadores, a los investigadores, a la red de organizaciones relevantes"}