{"id": 383692, "author": "cole.vt", "title": "Proposal Framework Tool - AIM", "url": "https://cardano.ideascale.com/a/dtd/383692-48088", "category": 26251, "amount": 7400, "description": "Crear propuestas sólidas para Catalyst debería ser más fácil. +El 75% de las propuestas no obtienen fondos Catalyst, lo que cuesta tiempo y recursos a los evaluadores y proponentes.", "funded": 2, "upvotes": 93272288, "downvotes": 6320126, "votes_result": 86952162, "votes_cast": 269, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The succinct idea behind the proposal is to help standardize proposals so they bring more value to the community and be recognized in other organizations outside the cardano community. This is a problem I've recognized as well since I joined the cardano community about 6 months prior. I'm glad that someone is taking such a systematic and pinpoint approach to the matter. I have great confidence in the proposers. It's clear this proposal will add value to the cardano ecosystem but also help CAs not waste as much time with proposals that have key components missing because of lack of experience. The key metrics are directly related in the challenge setting and I thing the authors make a pretty good idea of describing why in the proposal so I deffer to their expertise. The proposal is not only able to scale and address future challenges, but also has done it already with previous tooling. I don't see anything missing from this proposal and it is my sincere hope that I'll be able to say that for all the proposals I read in Fund 8. This proposal adds standards to the proposal side of the process which is the most critical place IMHO. As a developer I don't have any concerns about the implementation of this proposal or the people doing it.", "q0r": 5, "q1": "There is plenty of references and links that allowed me to verify the listed skills and names of the people involved in the proposal. The numbers and type of team members is cleared. Unlike many other proposals the team members are already know and not to be searched for and hired. The budget is outlined clearly and broken down to understandable chunks along with a plan concrete and descriptive enough to make any doubter happy. I believe the timetable offered is clear and relatable since the team is going to dig deep into research from Fund 8 data.  The resources necessary are reported and relevant so anyone interested can read up. The technical aspects of the proposal are simple enough that they don't need to be explained as well as the whole idea and impact of the project. There are many challenges and risks that the proposers mentioned that I hadn't even thought about so it's clear that they know what they're doing and have already done research to enable their project future scaling and potential growth. The project is in sync with what's already been done, mostly because they alone have done it.", "q1r": 5, "q2": "A plethora of ways to trace the progress of the project, so no worries there. I personaly know them to be very active members of the telegram and discord channel. The key metrics are relevant and describe what the project has to strive for. Mainly adoption and recognition to help spread the word that the cardano project may be developed even with funding outside of the cardano ecosystem, because standartization would lead to recognition. Sensible roadmap - check. Relatable clear milestones - check. Time horizon to do the work - check!   The proposers are in the shoes of the voters as well and know what a voter or a CA or vCA or a proposer need, and they develop tooling to help along with the process realizing benefits and community growth along the way. I really respect what they're doing! Best of luck to you guys and I hope you get voted in! ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 8, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This framework brings value by saving time, and increasing the quality of tools for proposers. These will be open source and. be able to be used and improved by any developer.", "q0r": 5, "q1": "The team is heavily involved in the catalyst process, and has the experience to create tools per the CA tools we are using now. They have laid out their goals and KPIs, but it would be nice to have dated timeframes.", "q1r": 5, "q2": "The team has provided their goals and KPIs for the proposal, but there isn't specific timeframes to audit the process so it would be reliant on objectiveness. They are creating tools already so it may be a quick turn around and not something to worry about.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 21, "ne": 3, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "High impact and very well strcutured proposal. The 2 main goals of this project are clearly defined within its scope and are valid as it address chalenge KPIs (as Usage of open source docker containers) and help to increase \"collaborations/efforts on defining common standards\" and \"incentive system for developing & hosting common open source utility's\".\n\nGoing deeper in the proposal, expand the proposal tool is very imporant, specially thinking of including UN human rights charter, in addition to the SDGs. In addition, the data generated in next round with the use of the expanded tool certainly can lead to some good analysis and conclusions based on the research that is going to be made. It is also appreciated that it will be open access.\n\nAs further suggestions for proposers, it could be included here the number of people using the tool nowadays (or in past funds), to fully check its potential and how the addtion of new features in the past increased the quality or content of proposals, if this information is available, even in a qualitiative sense.", "q0r": 5, "q1": "The team has already put the tool to work in past funds and seems completely to conduct the proposed improvement. the team is well described individually - it could just have linkedin links or reference to all of the members. Their capabilities seems more than enough to implement this project.\n\n\nThere's a plan in place but the roadmap could be better organized (separated in months, for instance, describing the steps seprately). The way it is written is a bit confusing, as it is all mixed up. The budget breakdown is clear and well done; In addition, project is not expensive.", "q1r": 5, "q2": "There are very good KPIs but at least some of them could have some target, such as \"Number of users\", specially becuase the tool already exists. It could be measured how this improvement would increase tool usage. Also, some KPIs seem a bit subjective to measure (as \"Use their tool facilitated documentation to seek/secure funds external to Catalyst\") although the idea behind is good.\nit is also possible to extract some milestones or deliverables from roadmap but, if it were better organized, these milestones would be clearer. \n", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "Incluir un marco adicional a la Herramienta del Proponente, dando a los proponentes un menú de objetivos + métricas listo para ser usado en las propuestas.", "experience": "Los miembros de la AIM que están detrás de la herramienta para votar, la herramienta CA, la herramienta vCA, la herramienta para proponer (SDG), ADA sostenible, Cardano 4 Climate, desarrolladores, educadores"}