{"id": 384450, "author": "eli.j.selkin", "title": "PAB Container Log Processor", "url": "https://cardano.ideascale.com/a/dtd/384450-48088", "category": 26251, "amount": 3500, "description": "Actualmente, el PAB sólo tiene la unidad Haskell () (devuelta como [] en JSON). Este valor es irrelevante para cualquier frontend.", "funded": 2, "upvotes": 71945722, "downvotes": 9394903, "votes_result": 62550819, "votes_cast": 216, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "El proponente quiere añadir un procesador de registro al backend de la aplicación plutus, para poder leer el registro más fácilmente y ayudar a entender los problemas, y llevarlo a un formato json compatible. En mi opinión, como desarrollador, esta es una solución valiosa a un problema, tal vez no complicado, pero seguro que es necesario. Se centra en la practicidad del desarrollo con el PAB. Hay una explicación clara sobre el valor que aportará al ecosistema cardano. Acelerará el desarrollo a través de la comprensión de lo que está sucediendo en el PAB. Hay métricas clave en línea con el establecimiento del reto, que cualquiera podrá seguir públicamente. El proyecto estará listo para escalar, utilizando la infraestructura de docker y kubernetis fácilmente disponible, lo que aliviará la mayoría de los problemas a la hora de escalar este tipo de soluciones con búsqueda elástica. No veo que falte nada en esta propuesta. Hay una necesidad de una manera simple de entender lo que está sucediendo en el PAB sin mirar los enrevesados registros de haskel.   ", "q0r": 5, "q1": "El proponente tiene todas las habilidades necesarias para llevar el proyecto a su conclusión. Se ha adoptado un enfoque claramente esquientificado. El proponente tiene una cuenta de linkedin que dice mucho. Así que las credenciales se comprueban con éxito. No se menciona a ningún miembro del equipo, pero con el calendario dado, no serán necesarios para el éxito. El presupuesto está claramente definido y los pasos dados pueden ser seguidos públicamente por cualquier persona interesada. Los usuarios pueden seguir el progreso en el repo vinculado en la propuesta. Hay un calendario realista para completar el trabajo descrito y como desarrollador lo considero razonable. Hay una explicación muy detallada sobre cuáles serán las herramientas exactas utilizadas y la combinación de tecnologías para llevar el proyecto al éxito.  Los aspectos técnicos de la propuesta se explican de forma sencilla y clara, y ese es un paso importante que se pasa por alto en muchas otras propuestas. El proponente ha tenido en cuenta los retos y las soluciones similares y ha planificado los retos futuros dándose tiempo para hacer la investigación necesaria para no tener que retroceder. El proyecto está en sintonía con lo que ya se ha hecho y sería un gran bloque de construcción para el ecosistema cardano.  ", "q1r": 5, "q2": "Habrá un repo de github con todos los detalles de la implementación, para que cualquiera pueda seguir el progreso del proyecto. Hay métricas y KPIs establecidos y este es uno de los pocos proyectos que los tiene. Soy un firme creyente en que el proceso se optimiza mirando los datos anteriores. Y no se puede hacer eso sin métricas y una definición de éxito válida. Hay una hoja de ruta con hitos mensuales establecidos, que pueden ser seguidos por la comunidad. Hay un problema claro y sencillo descrito que tiene una solución clara y no tan sencilla. Bien pensado.  El proponente tiene claramente experiencia con el PAB y está tratando de ayudar a otros desarrolladores a no tener que pasar por los mismos problemas, por lo que ayudará al ecosistema de desarrollo, que es precisamente lo que la configuración del desafío establece.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The aim of the proposal is to log the diagnostic messages generated by PAB in a fast searchable manner without using the DB sync and other heavy tools. This can help in debugging code and also to see the state of execution of Plutus scripts. There are other ways currently to achieve the same result however this method is likely to result in few adoptions and might spinoff a few other useful tools for automatic deployment of PAB. ", "q0r": 5, "q1": "Gimbalabs PPBL developers are building an ecosystem in which a core group of Plutus developers is gaining valuable experience and producing code useful for the community. This initiative is also funded by the earlier Catalyst funding rounds. Therefore with the credentials and the work of the author as seen in Github it is likely they have the potential to complete the project. ", "q1r": 5, "q2": "The development will be hosted in opensource and the plan given by the team spans 6 months to be completed in Apr. The work can easily be audited based on the progress in the code repository. The amount of funds requested is very reasonable and the success can be measured based on the activity in the repository. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is adherent to the goals of the campaign. If the team is able to build a set of tools to parse logs from the FAB making them queriable then they are creating value to the Cardano environment because it is a common goal to lots of projects in the Cardano community. Later if they were used for a relevant number of projects, it would mean the Cardano environment is more resilient because its new Dapps will be less dependent on private SaaS solutions. One point the team could have further explored is the question of scalability their tools will be able to provide. This is extremely important because the robustness of the proposed solution is proportional to its scalability.", "q0r": 4, "q1": "The authors seem to have more than enough skills and experience to conduct the proposal successfully from what is outlined in the Relevant experience section, but they could have linked their Linkedin profiles or at least described their past project experiences in the proposal. Also, they haven't described how many team members or which positions will be required to perform the tasks of the project. As per the budget, the total amount is pretty reasonable, but it was not broken down into identifiable items other than the cluster costs. The timetable seems to be achievable if there is no setback along the way. To enrich the proposal and make it more solid the team could have not only stated what will be done each month but also how they are planning to do it.", "q1r": 2, "q2": "The roadmap proposed has clear milestones. The metrics defined are aligned with the milestones proposed and they represent a good way to check if every milestone was achieved with a success or not. The only drawback is the team could have used more objective and measurable KPIs. For example, they could have defined what they consider reliable enough for the April metric. Also, the time horizon proposed is realistic, but I believe they could have left more room for unforeseen circumstances. Finally, a fair description of the targeted problem was given in the beginning.", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 22, "ne": 5, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "Desarrollar un conjunto de herramientas para analizar los registros del PAB de manera que puedan consultarse desde el frontend para determinar el estado de las transacciones.", "experience": "Eli Selkin - PPP 2ª cohorte, desarrollador de Gimbalabs PPBL, usuario frecuente de PAB, CTO de Loxe inc. (numerosos proyectos financiados por el Fondo 6)."}