{"id": 385098, "author": "rcmorano", "title": "NFT-authorized NFT-minter contract", "url": "https://cardano.ideascale.com/a/dtd/385098-48088", "category": 26251, "amount": 7000, "description": "Actualmente no hay forma de realizar una acuñación de tokens descentralizada, autorizada y bajo demanda desde un smartcontract.", "funded": 1, "upvotes": 34256077, "downvotes": 19428368, "votes_result": 14827709, "votes_cast": 138, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "\r\nLa propuesta menciona que se encontraron con un problema durante el desarrollo de Dandelion (que es un proyecto apoyado por la comunidad y dirigido por GimbaLabs).\r\n\r\nEste problema, en mi opinión, será enfrentado una y otra vez por muchos proyectos que están construyendo sobre Cardano, y en general, como desarrollador senior, encontrar soluciones genéricas y reutilizables es clave a largo plazo.\r\n\r\nEl sistema de código abierto es, básicamente, que si alguien ya ha encontrado un problema y ha proporcionado una solución para ello, entonces sólo hay que integrar la solución en lugar de reinventar la rueda.\r\n\r\nLa solución proporcionada está claramente descentralizada y cumple con el alcance del problema al tener un contrato inteligente que permitirá a N gobernadores (que tienen un NFT particular) acuñar un token.\r\n\r\nUna idea estupenda, que se ajusta completamente a la configuración del reto propuesto.", "q0r": 5, "q1": "El proponente es un ex-miembro de Emurgo, y cofundador de Gimbalabs. Por lo tanto, desde la perspectiva de la experiencia en contratos inteligentes/técnicas en el ecosistema Cardano no veo ningún problema.\r\n\r\nPor otra parte, el proponente propone que, básicamente, contratar a algunos miembros del equipo de PBL para desarrollar esto, y puesto que el proponente es él mismo fundador Gimbalabs y también ha dado enlaces para el trabajo similar que ya se hizo por los miembros del equipo de PBL, estoy totalmente seguro de la perspectiva de la experiencia.\r\n\r\nEl plan presentado aquí es bastante sencillo, por lo que no veo una razón para dividirlo más. El presupuesto está bien justificado, para dos meses.\r\n\r\nSin embargo, habría estado bien incluir también los riesgos asociados (por ejemplo, que no se encuentre un desarrollador o que no pueda hacerlo, etc.), junto con la forma en que se verá el éxito...\r\n\r\nCreo que un ejemplo podría ser que lo utilizaran en algunas de las iniciativas de proyectos existentes de GimbaLabs? Dado que el proponente tiene mucha experiencia en esto, podría haber añadido esos detalles.", "q1r": 4, "q2": "La propia información sobre la aplicación es suficiente para auditar el progreso de esta propuesta.\r\n\r\nSin embargo, creo que el éxito de la implementación de esta propuesta sólo se puede averiguar una vez que este contrato inteligente se despliega y está en uso por algunos de los dapps. por ejemplo, ¿cuántos dapps están utilizando esta solución en 6 meses a partir de ahora?\r\n\r\n Creo que en general, dada la experiencia del proponente, no sería difícil proporcionar tales ejemplos a la comunidad. De lo contrario, esto podría terminar siendo una solución técnica impresionante que en realidad nadie está usando :)\r\n\r\nBuena suerte para la implementación al proponente :)", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The team is already providing and maintaining open libraries as well as hosted services. This new library does not only further the existing dandelion initiative, it also create what would no doubt become an essential staple for this key functionality crucial a host of decentralized structures including but not limited to DAOs.", "q0r": 5, "q1": "While the dandelion no doubt have the chops to accomplish this, the proposal did not make clear their intention to maintain the library across any time horizon. In my opinion \"success\" of an open source library hinges it's documentation, maintainer(s) and fine folks committed to providing support and addressing bugs. It's clear that they will build thing but with the lack of maintenance and support plan, I can only give 4 stars here. Even something the tune of we hope the community will adopt and help maintain the library going forward  with commitment to setup contribution guidelines would have suffice!", "q1r": 4, "q2": "The KPI and Roadmap is sweet, short, to the point, and sufficient to verify their 1 and 2 months stated deliverable. ", "q2r": 5, "assessor": "z_assessor_336", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The idea is to write a template for a smart-contract that will mint tokens only if an NFT (representin authentication) is included in the smart contract. That would make it decentralized, secure and on-demand. I am no expert in the area so I don't know if this problem needs to be solved or not so I defer to the expertise of the proposer. There could have been a more clear articulation of why is this important and how will it benefit the cardano ecosystem. I feel like the author should have explained in more detail the idea behind doing this so he can get people behind the idea before starting explanation on the technical part. The key metrics are relevant for the challenge. Nothing was mentioned about scaling and considering the words decentralization and minting were mentioned, I think it would be a good idea to include a \"how will we scale?\" section in the proposal.  This proposal would add to the ecosystem, but I'm no sure how valuable would that something be, because no impact was mentioned or how will this affect the cardano community. As a developer myself my concern is that voters would struggle to see the point in this proposal as I am. ", "q0r": 3, "q1": "The proposal has added a skill set that is verifiable and is clearly well experienced. A mention of one team member is mention, but I don't mention if they already talked to them and they agreed to work on the project or that's to be seen. The budget is prety clear: a salary for 2 months for a Plutus Engineer. The proposal could have put a bit more effort in a roadmap breakdown and tasks that can be followed by the community. The plan for implementation is sensible, it's just a bit vague on the specifics.  The technical aspects is one of the pros of the proposal, because they're well explained and connected together. No challenges and risks were mentioned so I hope the work is straightforward.", "q1r": 4, "q2": "There's a linked site where the plutus developers have put a short comprehensive description of their work relating to smart contracts that they've done, so tracability of the progress is there for any interested community members. There is a mention of KPIs although a bit rough and hard to progres check. There's a bids eye view of a roadmap about the 2 months of work planned out. The targeted problem and solution could be better explained and written and that would be my main suggestion for the author for the next proposal.  I'd also suggest for the author to put themselves in the voters shoes or ask someone unrelated to the project check out the proposal and gather feedback to help improval.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I like this proposal and what it aims to do, which will undoubtedly help to grow our open source ecosystem and enable many different teams to use an out of box solution for managing on-demand NFT minting on cardano. The could have a very wide range list of use cases and I think would be a great addition to the toolbox of cardano developers and teams alike.", "q0r": 5, "q1": "The proposer is a co-founder of the team behind the Gimbalands company which is a very reputable company within the cardano ecosystem and have many successful proposals funded in the past, this lends credibility to the idea that proposal would be successful. I would be personally shocked if the team did not deliver, I feel very confident that they will based on the proposal as presented.", "q1r": 5, "q2": "I feel the roadmap is very vauge and lacks specifics. A roadmap should include well defined milestones with specific KPIs for each milestone, otherwise it becomes a grey area when it comes time to audit the proposal we should be able to clearly see which KPIs was hit and which wasn't. I still feel the milestones at a high-level make sense, but we need a little more specifics in order for 5 stars.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Desarrollar un smartcontract que, utilizando metadatos específicos como entrada, acuñe tokens a la carta sólo si se incluyó un NFT de gobernanza en el tx.", "experience": "Defensor de DevOps con más de 15 años de experiencia. Ex jefe de DevOps de Emurgo. Cofundador de Gimbalabs. Fundador y operador de Dandelion."}