{"id": 398557, "author": "stakepool247", "title": "Indian SPO Support and Education", "url": "https://cardano.ideascale.com/a/dtd/398557-48088", "category": 26454, "amount": 7000, "description": "We have many people joining from India and we will expand the reach by providing VIDEO Education materials in Hindi.", "f6_no_assessments": 7, "f6_rating": 4.0476190476190474, "videos": [], "media": [], "f6_assessments": [{"id": 1562, "q0": "This proposal aligns squarely with Challenge goals.  It looks likely this project will make a positive impact because of a number of factors.\n\nThe plan is to engage with the community in a number of practical ways. One is on the selection of videos to be produced. As they acknowledge, knowing exactly what topics to cover is a challenge; this strategy at the very least shows a willingness and commitment to work with their more local community. This will enhance impact.\n\nAnother factor is the plan to do live support on Telegram. Team members have experience with English-language Telegram in this area.\n\nFinally, their commitment to making produced resources freely available to the public will add to impact, as will the choice of Hindi since Hindi is the most-used Indian language. ", "q0r": 5, "q1": "Feasibility looks strong due to solid previous related experience of team members not only in the area of SPO but also in creation of online guides and YouTube vidoes. Their SPO experience includes membership on SPOCRA board. \nThe fact their goals are limited to translating specific, already-identified guides, and making 12 videos, adds to credibility; they’re not promising the moon. \nThis team is going to be very busy April-June to get all this done. But given their track record it’s believable they will be successful. \n", "q1r": 5, "q2": "The numbers look reasonable, e.g. $1250 to translate four guides. Unfortunately the ‘video translation of current guide’ for $1500 is unclear, will that be sub-titles or a whole new video or a transcript or…? ‘Project management and other expenses’ is vague but $1250 seems reasonable, given the scope of the project and number of players. \nA little more breakdown of the numbers would have been helpful, but as far as a basic framework for auditability the numbers look adequate.\nUnfortunately the proposal doesn’t give metrics for uptake of the learning materials e.g. views and interactions both on YouTube and Telegram. However given they’re already active in Cardano it’s likely they’ll be able to promote the resources within the Cardano community and that will be enough to get the ball rolling. \nSuggestion for the team to check out the Kirkpatrick model of assessing instruction. It ranges from student satisfaction to changing student practice. Meaning an ideal metric would be to show how viewers of these resources are able to apply the knowledge in their lives. \nIt would have been good to see some resources going to promotion; presumably some of the $1250 for “Project management and other expenses” will go to that.   \n", "q2r": 3, "assessor": "z_assessor_1391", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3060, "q0": "The aim is to create educational materials in Hindi language. Creating educational materials will improve the quality of education in India. Targeted research will have to be done about which topics this educational material should cover. It will help children who are at home for a long time due to illness. The project will increase Cardano's visibility in the Indian market.", "q0r": 5, "q1": "The makers both have relevant experience to make the project. In the proposal there are 2 people who are in the team. This seems like a limited team to put everything together. The budget overview is very limited. It would be useful if it included hourly wages for the makers. I also think it would be interesting to put exact dates in the proposal about what they would release during that period. It also doesn't say what they're going to do with the copyright of various courses that need to be translated. There is nothing in this proposal about the pitfalls in this project. It might also be useful to raise money to buy laptops for families living in poverty. This proposal does not discuss the technical aspects. The advantage of this project is that it can be financed relatively with little money and yet it can have a major impact on the quality of education.", "q1r": 2, "q2": "In this proposal, the milestones are unclear to me about what the exact performance is. The schedule is very general. It is clearly described how they can solve the intended problem. There are no clear KPIs included in the proposal. This project certainly has a future in my view. It would be interesting to include how people living in poverty can also use this technology.", "q2r": 3, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3414, "q0": "Proposer introduced the problem and introduced part of the solution. Proposal already has information such as the function or impact of the project on Cardano, but does not have information related to the main content of the solution such as information related to documents that the team wants to translate into Hindi, how to include Hindi material to the community. Proposer should consider adding more information to make the proposal more complete. Risk information has also been shared, however, the proposer should clarify the solutions to those risks.", "q0r": 3, "q1": "Proposal already has a fairly specific timeline and plan when it comes to providing deadlines and tasks, however, the proposer can add more specific information in the next few months. Similarly, fees such as Server setup or Node Installation should also be included in expenses if they have been included in the spending plan. Profiles of team members are also provided with quite a lot of necessary information.", "q1r": 4, "q2": "The information of the Auditability section is only good, but not significant. Firstly, I like how the proposer provides an initial goal of 12 videos and these videos will be uploaded to Youtube and spocra. However, the proposer has not provided clear criteria to evaluate the success of videos such as viewership. Proposer should clarify the criteria for evaluating the success of the project through KPIs/Key metrics, so the project goals will be more realistic.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6313, "q0": "The proposal raised the issue of expanding the reach to Hindi speaking Indians. The solution offered was to translate the manuals into Hindi, create educational materials in Hindi, create a management channel to support SPOs from India, create a live Hindi TV channel in the Indian community. Besides, they also mentioned the risk that there may be many selected topics for translation without knowing which topic to choose, leading to difficulties in choosing. I agree that their outreach to Hindi speaking Indians is up to the challenge.", "q0r": 4, "q1": "The project has a clear roadmap for each month. The project will be implemented in 3 months, April, June, 2022 with detailed items such as translating SPO installation instructions, creating a support channel in Hindi, and instructions for setting up the pool in Hindi. 3 months for translating English videos into Hindi, creating 12 videos about Cardano in Hindi is reasonable. The project budget is clearly detailed.\nThe team has 2 people, they have experience related to the project but there is no link attached to clearly and transparently confirm the ability of the members. However, with the information of github and the web involved, the project can be successful.\n", "q1r": 4, "q2": "Proposing to do one video per week but not specifying how long it is makes it difficult to audit. The team already has a project funded in Fund 7: SPO Performance Monitoring, however, not much related to this project.\n", "q2r": 3, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6583, "q0": "Reducing language barriers widens the potential reach of Cardano.\n\nHaving multiple stake pools run from India and promoting themselves to the local community should help to grow the understanding and awareness of Cardano within those communities.\nThis proposal addresses the challenge - this is exactly what the challenge brief set out to try to achieve.\n\nSetting up local stake pools should help to incentivise others in the region to also do the same. With each promoting Cardano and their pools.\n\nThe Hindi language is common within a lot of India, although it does not cover all of India, so content in other common languages would also be needed - maybe that could be a future Catalyst proposal by an India team?", "q0r": 5, "q1": "The team are SPOs and have had a Catalyst proposal accepted in a previous round, and 1 of the 2 members has been active within Catalyst since 2020.\nThe new member is from India so local knowledge should help this project succeed.\n\nIt is noted that there is also a team of enthusiasts in India ready to participate.\n\n12 videos will be created in Hindi, and SPO documentation translated into Hindi. A live Hindi support channel will also be set up.\nQuestion - would this  last beyond this proposal? This is not clear.\n\nIt wasn't clear to me if a new stake pool would be set up and left running. This could be useful to gain funds and to keep the good work of this proposal alive after the initial phase is completed.\n\nA brief road map has been provided giving a reasonable overview of key objectives, lasting from April to June 2022.\n\nA cost breakdown is provided and this too looks reasonable.\n\nThere is an opportunity for collaboration with other Catalyst proposals wanting to also translate into Hindi.\nHaving a coordinated approach to these different proposals would be beneficial to avoid duplication and overlap of objectives, and it could be useful to leave a good project running after the initial phase has completed.\n", "q1r": 5, "q2": "Regular output of content can easily be monitored and assessed, eg 12 weekly Hindi videos.\n\nGrowth of engagement and the different channels of engagement can also be monitored if the team promoted via different channels eg ones common to India.\n\nThe team has provided community SPO tools and other services in the past, so confidence in them delivering on this project is high.\n", "q2r": 5, "assessor": "z_assessor_434", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8203, "q0": "Proposer clearly defines the problem of lack of translation and media content in Hindi and offers a solution to translate the current manual and create additional educational video materials in Hindi. Proposer states that team will translate current SPO installation manuals, Establishe Live Hindi support channel, Start Weekly Cardano education materials in Hindi (for the next 3 months), Stake Pool Installation Video Guide in Hindi, and this will add value to the Cardano ecosystem. This proposal is able to scale to address future challenges and all proposed objectives are aligned with the outlined challenge settings. As all required parameters are met by proposer I am strongly Agree.", "q0r": 5, "q1": "The work and the team so far have been transparently presented through the Github link and other links and we can clearly see how there is knowledge and expertise needed for this project to be realized. The budget is clearly defined and a budget brake down is presented and it is reasonable to achieve the goals. The plan is developed by months, describes the resources needed for implementation and presents the actions necessary for the implementation for this project. There is an awareness of the possible challenge but the proposer also offers a solution.\n\n", "q1r": 5, "q2": "The Roadmap is presented through the months from April to June within we can see what the team will be doing. The community can easily monitor the development and progress of the project. Proposer states making 12 videos one per week that will be dedicated to the Indian community.", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8372, "q0": "The proposal offers to translate blockchain data (in general) and Cardano information (in particular) into Hindi in the form of educational materials, live supporting channels and live chat supports. Provided arguments are reasonable and suitable to the challenge setting. The proposal will definitely help to grow Cardano in India. Challenge of the proposal has been identified. Mitigation solution, however, is not proposed yet, posting a lot of difficulty to the founder team on the process of project development later on.", "q0r": 4, "q1": "The project timeline is provided in term of month. At this stage of proposal, project timeline should be presented in term of week for easy assessment of the project feasibility. Requested budget has been broken down into measurable details. Further effort still required to make the requested budget feasible. For example: Project Management and other expenses is only 1250 USD. This amount is too little for 3 months project management, not to mention “other expenses”. Video translation (current English guides) 1500 USD. This amount is not assessable neither since it depends on the number of videos, the lengths of one video. Team members are meagerly introduced with related experience to the project. However, reference link about founder team has not been provided, making it hard for assessment. In summary, the feasibility of the proposal is therefore questionable.", "q1r": 3, "q2": "Definition of success of 12 videos per 12 weeks is auditable only if the length for each video is provided. Since the requested budget has not been reasonably proved in the feasibility segment, it is hard for audition once the project is funded. Though one proposal in a series of proposals has been funded previously, this proposal is new one and different from the funded one. The project is, therefore, considered as successfully launched the trial version. In combination of all above-mention arguments, it is hard to identify if the project is auditable.", "q2r": 3, "assessor": "z_assessor_675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}], "solution": "Translate current guides and create educational materials in Hindi as well as create a Live Support Channel for the Indian community.", "experience": "Have created technical guides and videos for SPOs for English speaking audiences\nhttps://cardano-node-installation.stakepool247.eu/https://t.me/StakePool247help\nBoard Member of SPOCRA (Stake Pool Operator Collective Representation Assembly)"}