{"id": 398841, "author": "dimitri777", "title": "Cardano in Bengali", "url": "https://cardano.ideascale.com/a/dtd/398841-48088", "category": 26454, "amount": 7100, "description": "Lack of official Bengali content . Thus Bengali speakers cannot learn in their native language. There are 250 million speakers globally", "f6_no_assessments": 10, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 1994, "q0": "This project has impressive impact, and seems to address many if not all of the Campaign goals and guidelines of the brief. The Challenge mentions 1.4 Billion people of India to reach, 55% of them under 30 therefore tech-aged, and emphasizes the many skilled IT folks, and reaching out to the folks in the 3rd most popular language seems like a massively untapped market. The Challenge mentions that there’s a well-established pool of skills and talent who just need to be made aware of Catalyst and Cardano, and the 337 Million speakers (larger than the entire population of the United States!) of this major world language seem like a prime group to welcome into Cardano and Catalyst. After all, one of the main suggestions of the Challenge was local language websites or socials to attract devs and creating how-to videos, and this project seems to be addressing exactly those points. It’s a pity that Catalyst is not farther along yet, but at this point, this proposal seems like it has great potential to promote awareness, connect with established YouTubers to create buzz, and gather all minds from coders to Catalyst proposers. \n\nThe KPI metrics spelled out in the Challenge suggest increasing interaction between Catalyst and Indian projects, an increase in Indian-focused submissions, and building out dApps and services for the Indian crowd, and making things available in a language more familiar to them seems like the first line to reach that market of one-third-Billion people. This project seems perfectly aligned with the Challenge, hence the high Impact score I am giving it. \n\nAdditionally to all of this, as I look at average costs for similar work to this if it were to be outsourced or hired elsewhere, it appears that the meager $7,100 request (4.7% of the Challenge funding budget) to do the amount of work proposed is considerably cheaper, therefore this is a bargain for Cardano to take up. \n\nEven further, it appears that nearly all UN Sustainable Development Goals, bolstering added impact even beyond the goals set forth in the Catalyst campaign/challenge. \n", "q0r": 5, "q1": "The team spelled out in the proposal seem more than capable of making this project a reality. Their credentials show decades of expertise doing this type of work, with a solid, powerful network they are connected with to make the proposal happen. \n\nThe proposal breaks down a very realistic timeline, not overly ambitious, with expectations well spelled out. The plan seems very well thought-through and ready to go into action right away. The project manager’s credentials and decades of experience combined with the decades that the rest of the team has leaves me with zero hesitation that this project will (if voted up) become a reality. More importantly, not only will the project become a reality, but looking at the mentions of likely doing extra work for no extra cost implies and suggests that Catalyst may very likely even get more output delivered than initially planned for, but yet on the same meager funding budget. \n", "q1r": 5, "q2": "KPIs appear well established and easy to follow or verify. A specified amount of output is guaranteed each month, and any auditor should be able to check the progress of the project without any difficulty. Following the social media campaign of this project, a feature that was suggested in the Challenge Brief, will render it easy as well, seeing followers on whichever platforms the team uses. Views per video, comments, shares, are all easy metrics for anyone to see on YouTube, where the majority of this project will be published. \n\nOnce the team provides to auditors which masters they have chosen from their network to make the project a reality, everything else will be very simple to audit. Great auditability. \n", "q2r": 5, "assessor": "z_assessor_1446", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 3064, "q0": "The proposal provides translated videos about the Cardano ecosystem. This will give 250 million people the opportunity to learn about the Cardano system in their own language. This will bring a new community into the Catalyst ecosystem. The main statistics and goals are present in the proposal. The key stats correspond to the challenges outlined. The makers of this proposal take future challenges into account. It is good that this proposal already offers solutions for possible future challenges.", "q0r": 5, "q1": "The proposal clearly lists the team members with in detail the useful experience they have. The team members have relevant experience to implement this proposal. The budget should be made in more detail. It is not clear what the makers will earn individually during this period. With this budget it is certainly possible to work out this project. A realistic time schedule has been offered that clearly states what the team wants to achieve in a certain period. It is written in small lines how they are going to implement the plan. It is good that local campaigns are going to take place so that people are addressed directly. The risks have been considered in the proposal.", "q1r": 4, "q2": "A roadmap that is included states what they want to achieve each month. The road map is quite limited. It would be more convenient to work out this roadmap in more detail. It could be added which social platforms are used, the exact locations of the campaign. Relevant KPIs are included in the proposal. There is a clear description of the language problem in India. The solutions can address part of the problem. The question is how long the videos will be usable. Suppose there are very big updates and a lot of visual changes. I think this solution can be a temporary solution to the language problem.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n"}, {"id": 3695, "q0": "India is a diverse country and has a lot of languages throughout the countries. In order to effectively market or spread the knowledge on Cardano to all the people of the country, translation of the content of Cardona to local language is required and is the most effective way to reach a larger group of people. In this case, the local language would be Bengali, which is very huge community in India and they are very proud of the language. Hence translating the contents of Cardano in Bengali would reach a lot more people than expected and also be appreciated for translating into Bengali. Many of the people in India are educated in their local language and might face difficulties in English, by translating the content to Bengali it would benefit a lot of people in getting familiar with Cardano and also the advancements of it. The proposer has effectively addressed the challenge and I strongly believe this application will be a success to Cardano as it will be reach more people and more people will be knowledgeable through this with the comfort of learning in their own language. It is also a scalable project and could go global benefiting Cardona on a large scale.", "q0r": 5, "q1": "The proposer has a roadmap on how to implement the project as he has mentioned that he will be uploading a new video every 3 days in the Bengali language and hence by uploading the Cardona content in the Bengali language on a regular interval of time would attract more viewers and gain more subscribers. It would also be helping a lot of people educate about Cardano in a better way. This whole together will be indeed bringing a new community to the Cardona, once people see the content in Bengali they will be more likely to promote the videos on his own to his friends and family to watch them and it will be of a better reach. The experience of proposer and his team seems to be very impressive and the proposal is likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has requested 7100 USD as funds to implement this project and he has also provided the breakup cost that will be spent on each individual requirement which seems fair. The proposer has also projected the funds for next 3 months and the money requested will be sufficient to audit the progress. The proposal is most likely to succeed as it going to reach over a community of 250 million Bengali speaking individuals. It will be very useful in reaching Cardona into the Indian market by translating the content into regional languages and the reach will be more than expected in the future days. The proposer has also foreseen the difficulties they might face while implementation and also has alternative solutions for the same.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n"}, {"id": 3912, "q0": "The project has the ability to significantly increase Bengali speakers' awareness of the Cardano ecosystem by offering translated videos. The proposal gives statistics on the number of Bengali speakers, but I believe the proposal could also include further analysis on the degree of blockchain comprehension of Bengali speakers. If there is a lack of awareness of blockchain technology, generating blockchain tutorials should be prioritized before creating information regarding the Cardano environment. This will make better impact on the community.", "q0r": 4, "q1": "Proposer provides practical data on the number of translated videos uploaded each month, as well as the length of the videos. A well-defined timetable and output are prescribed. I'd want to know more about the specific content of each video in order to properly evaluate whether or not the audience will gain appropriate fundamental understanding of Cardano ecosystem. The information about team members is clear and trustworthy, with LinkedIn profiles attached; the team as a whole has extensive expertise in both Cardano and translation. However, there is no information on the marketing campaign to attract audience.", "q1r": 4, "q2": "Proposer provides a detailed roadmap with specific milestones for better progress tracking. About KPIs and metrics, the number of comments is a good metric but sometimes misunderstanding in case all of the comments are negative. \nSome metrics I would recommend adding: \n- The ratio between positive and negative comments/feedback from audience. \n- The view rate between videos (increasing/decreasing)", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4550, "q0": "Since people always love to learn all the new things in their native language, which will help them to have clear idea on the subject, this proposal will be effectively addresses such challenge. Since there are 75 mn people speaking Tamil, they are huge group of people to capture the market, where all these people will learn about the projects of block chain in more effective manner and definitely show interest in investing future cardano projects. hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "As translation model in YouTube videos definitely won’t be much difficulty, which has very less chances of getting failure with people like Muttiah Duraiswamy who has Over 30 years’ experience in Ministry of Languages as Official Languages translator, it will be an easy goal to achieve. With the details of all veterans provided, presented data is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal has clearly mentioned about survey of Bengali speaking people and has provided the details of people who are working on this. This proposal has clear budget breaking, roadmap details and definitely provided excellent SDG goals for its success. It also has explained with what time duration videos will be provided for the audience with clearer idea hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\n"}, {"id": 4622, "q0": "The proposer rightly addresses the need for translation of IOHK videos into a regional language. The videos in Native language can better convey the message to the needful and hence popularize Cardano.The impact of the proposal would be considerable in reaching the Bengalis, with more than 350 million Bengali speakers in India, bangladesh and around the world.", "q0r": 4, "q1": "Rishantha Welikadage: MBA in business management from Australia===== Muthiah Duraisamy:LinkedIn profile mentions of \"Freelance Trilingual Translator at Home\".=====Dimitri Fernando-LinkedIn profile mentions \"CEO at Enigma Private Limited\" since 1996.===== Chamarie Ranasinghe-LinkedIn details not provided. The experience of the people involved should be enough to achieve all the goals of the proposal in terms of business management. The stated 30 years of experience of Muthiah Duraisamy in the field of translation should be enough to execute the tasks involved with respect to high quaity translations. Contingency fees could have been much lower for a 3month project also considering value of $2000 in terms of Srilankan/Indian Rupee.", "q1r": 4, "q2": "The deliverables are 360 minutes of translated videos in 3 months(15k words*3months or 120minures/month*3). A specific target number should have been mentioned for the metrics of followers/views/watching-hours/engagements considering $1500 being allocated for Social Media Campaign.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\n"}, {"id": 6658, "q0": "Please note this assessment should be taken in context of a set of 19 similar proposals by the same proposer in two challenges, Grow India, Grow Cardano and Grow The only real difference between the proposals being the spoken language used (Urdu, Thai, Gujurati, Laotian, etc.). In all other respects they are essential the same. Hence it is almost impossible to write 19 distinct assessments, I have tried to find specific differentiators but have also looked at the package of proposals as a whole as, I believe, this will add greater value to the voter. Looking at this specific proposal for translating videos into Bengali, it largely meets the challenge brief in seeking to broaden the horizons of the Cardano ecosystem. The proposer should be praised for taking the initiative. I would suggest the proposer uses the comments section to explain voters their rationale behind this multi-proposal approach. That should help with transparency and help people make an informed decision. For example: Are they looking for voters to decide on which languages they prefer thus restricting the choice to the existing community. This kind of defeats the purpose of reaching out to new communities. If this is the case I have done a rudimentary research on number of people speaking each language to help the voters make an informed decision. Given more time, an in depth analysis of demographics would be useful showing current literacy levels, access to technology, levels of education, English speakers, etc in India, Pakistan and Sri Lanka. Bengali ranks 2nd with a significant number of speakers so should be on the high priority list? 1.Hindi:615M 2.Bengali:265M 3.Urdu:170M 4.Punjabi:126M 5.Marathi:95M 6.Telugu:93M 7.Tamil:81M 8.Gujarati:61M 9.Kannada:56M 10.Bhojpuri:50M 11.Odia:38M 12.Malayalam:38M 13.Sinhala:17M 14.Nepali :17M 15.Assamese:15M Where the voter needs to pay particular attention is the entirety of the ask. The proposal therefore under assessment are: Grow India, Grow Cardano - 15 Proposals https://cardano.ideascale.com/c/idea/404484 https://cardano.ideascale.com/c/idea/398981 https://cardano.ideascale.com/c/idea/398980 https://cardano.ideascale.com/c/idea/398858 https://cardano.ideascale.com/c/idea/398857 https://cardano.ideascale.com/c/idea/398856 https://cardano.ideascale.com/c/idea/398853 https://cardano.ideascale.com/c/idea/398850 https://cardano.ideascale.com/c/idea/398847 https://cardano.ideascale.com/c/idea/398845 https://cardano.ideascale.com/c/idea/398843 https://cardano.ideascale.com/c/idea/398842 https://cardano.ideascale.com/c/idea/398841 https://cardano.ideascale.com/c/idea/398840 https://cardano.ideascale.com/c/idea/398838 ", "q0r": 3, "q1": "The contents of feasibility are duplicated across all 19 proposals. In simple terms we are looking at a total ask of $135,900 of which $38,000 (28%) is contingency. At a proposal level that is $7100 budget with $2000 contingency. My project planning head immediately points to the 28% contingency. It is not clear what this is set aside for. A risk of ADA price fluctuation is noted in the proposals, however one of the proposed mitigations for that is a 10% contingency, the other being to sell funds privately to ADA holders. In addition the proposals states “We have ample resources to complete the project on time and within budget’, once again raising the question on the need for such a large contingency in proportion to the budget? Now looking at what is to be delivered. Each proposal states the YouTube channel will be launched with 6 videos. We have to assume that means 6 videos translated in all 19 languages should they all be funded. After 3 months 10-20 videos (each translated in 19 languages) That gives us 380 translations in total at an average of 4 per day. I have run this by someone with experience in this area and their reaction was ‘its going to need a considerable team’. So, let’s look at the evidence of a team with the skills to deliver this proposal. The proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator. Specific languages are not mentioned so very difficult to validate of if they have the skills for this specific proposal Two other individuals are listed, their LinkedIn in profile are well populated but don’t display the skills required to deliver this project. That leave us with the “extensive network of Master translators”. Again no evidence of their existence of previous work exists so impossible to evaluate. I believe the proposer has a lot to offer the ecosystem and can suggest the following: 1. Help the voter understand the need for 19 similar proposals 2. Provide evidence that they have access to the skills required 3. Look at a small scope with a set of languages he or Muthiah are comfortable with. Use this as a POC on both the translation and engagement side. SHOW the community this proposal is growing adoption. 4. Take the learnings (e.g. which types of video are interesting your audience) and if a larger (multi language) proposal is what is required submit it in a future fund leveraging in the economies of scale that will naturally provide on the maintenance of socials, contingency & marketing.", "q1r": 2, "q2": "The metrics are sensible in terms of measuring engagement on youtube which is a great basic piece to measure. However to really get to the crux of the challenge we need to see the conversion rates into Cardano and/or Catalyst • increased interaction between Catalyst and Indian focused projects • Number of Indian focused Catalyst submissions • Number of Indian focused dapps/services actually built", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "This has to be filtered out.  So many reasons..\nCombining into one proposal may make sense to this proposer who may not be from India and recognize the huge diversity from state to state or region to region. All languages cannot be done by same people or same social media campaign.  This is why we broke up. Smaller proposals enable people to clearly see we are not here to grab money.   Each language needs its unique Social media campaign to reach people.  We cannot lump everything into one.  This assessor clearly if from India is of a tech back ground, knows English and Hindi and thinks everyone in the country speaks Hindi and ENglish as well as he/she does.  This is ignorance, bias and absolute discrimination since he should know that people in other states much prefer their own language to Hindi. \n\nSecondly Why consider the total ask?  The rules state that each proposal has to be considered on its own merit.  Therefore even if  i had a hundred language proposals, if i had a hundred teams of two Master Translators and Two Proofreaders, then it will get the job done. We are doing this for 25 years buddy.   We know exactly how to run a translation project.\n\nHe goes on\nThe proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator.\nI have stated as below, we have and use our extensive network of Master Translator Partners.\n\nThe assessor has not read the proposal. It states clearly as follows\nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing Or Mr Muthiah D is doing,  the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of the language both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nSome specific statements that are absolute nonsense=\nHowever, because the primary responsibility of this position is to translate text from English to Tamil, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network.   As stated we have been doing projects for over 25 years. The definition of Master translator if this assessor doesn't understand is a MASTER OF HIS CRAFT.  A SENIOR IN THE INDUSTRY.   Each one will have different qualifications.  As for our specific master translator, he is the ONLY ONE IN SRI LANKA to write for the Mahawamsa which is like the BIBLE OF HISTORY of SRI LANKA for over 4000 years. It has been written from the time of kings.  This is a role that he alone in Sri Lanka has. So this assessor is talking nonsense\n\nThe assessor has been influenced by IGNORANT GROUP THINK set in place by certain malicious CAs who seek to influence these CAs with rubbish instead of reading the proposal carefully since all facts are stated there. IF anything was still unclear I am a CA myself and was easily accessible through the CA chat or my own TG. Therefore please filter this out as its a malicious effort to bring down the proposal through ignorance.\n\nAlso he is completely biased and not seeing the reality as is Language diversity in India based on above mentioned biases.\n\n\n"}, {"id": 7345, "q0": "I think the proposal aligns well with the objectives of the challenge, the idea here is to translate content relevant to the Cardano ecosystem into the Bengali language, spoken in India. The proponent claims that in this region there are many people working in the area of ​​technology, and, at the same time, little content about Cardano in the local language. That is, everything fits. What we are looking for in this challenge is to favor India and Cardano at the same time. India, in the sense that we can take the opportunities of our ecosystem there, through courses brought in, content posted in the local language (as is the idea here), professionalization of people who work with blockchain, in general: creating opportunities for natives of the country can benefit from the employment positions generated by Cardano. Whether by participating as Catalyst project team members or even developing your own Dapps, acquiring Ada, learning to delegate, buying NFTs... In short, using our technologies to your advantage. And obviously, the Cardano ecosystem should benefit as well, one should increase the number of our currency in circulation, invest in minting active tokens on our blockchain, bring Cardano to a new audience that will popularize the blockchain and invest in it. The proposal meets these requirements exactly, because once content is available in the local language of that Indian state, it will be much easier for people there to get involved with Cardano. However, it would be interesting for the proponent to explain a little more what these contents would be, exactly, how it is intended to approach them, how they will be passed on and so on. The issue of themes is not clarified either here or in terms of feasibility, I think it would be an essential factor for us to fully understand what is being promised here. Therefore, I will give it 4, because I believe in the idea and in its potential, but there was a lack of detail to understand how all this will be generated and passed on. \n", "q0r": 4, "q1": "At first I didn't understand one thing. The proponent says that the intention is to release videos daily, right? And that when launched, the channel would already have 20 videos. If over 3 months (approximately 90 days) this goal was maintained, the minimum available videos should be 20 + 90 = 110... right? Because he states the daily goal and then immediately says that with 3 months the goal is to have 30 to 60 videos on the channel. Anyway, I was confused. From what he says, pre-existing videos will be translated. What videos are these? How could we access them? How can we buy its validity? We have 3 reliable sources: the IOHK channel, as well as the Emurgo and Cardano Foundation Youtube channel. But what about these other sources, how can we be sure about the veracity of the exploited content? Now talking about script, budget and team. The script is good, it makes it clear which activities would be done each month, it is said that the project would be completed in the third month of work, and because it is not such a complex proposal in the sense of having several different things happening at the same time, it is quite understandable how the proposal development process will take place through what is presented to us. Regarding the budget, the requested amount is 7100 USD. This funding is not explained so clearly, some things, like the price of the translation itself, are quite simple to understand, but others, like social media campaign and contingency fee, should be better explained. What would the marketing campaign be? Why would it cost 1500 dollars? Who would work on it, and doing what tasks? What is a contingency fee and why is it more expensive than the marketing campaign itself? I think the budget explanation could improve. And finally, speaking of the team, this part is excellent, almost perfect. We know the names of those involved and we have very extensive explanations about their previous experiences and they also attach their linkedin profiles, so that we can see even more details about their professional careers and verify the information that was said. I will give 4 because some improvements on the financial issue could be revised, so that we could understand more clearly how the requested money would be used. \n", "q1r": 4, "q2": "It bothers me that the proposer repeats some information in various topics of the proposal, such as metrics and KPIs. Finally, the auditability is average, on the positive side, I think the proponent provides us with a lot of material that can serve as a means of verifying whether what was promised is being fulfilled (that is, the development of the process) as well as the final results (the metrics and KPIs). However, what remains is to establish a bridge with the Cardano ecosystem, we would need to understand how our community members could audit the proposal in practice. Granted, the videos would be posted on the youtube channel and the translations on the forum, according to the proponents, but that would only allow us to track the partial results, the small goals that were achieved, and not the tasks behind it. According to the nature of the proposal (which is simpler), reports could be made at the end of each month, informing whether the activities planned for that period of time were actually carried out; whether there were problems that month; if all planned videos were posted (it would be great if the links were included in this report); anyway, if everything that was planned actually happened that month. The team could make these more complete reports available on the “Project Catalyst” Telegram channel, for example. And regarding the final results, a meeting could be held in Town Hall after the project is completed, in order to understand if the final results were achieved, showing data that proves this, if Bengali speakers are really participating in the Cardano ecosystem. after the availability of these translations; if so, in what way (it would be amazing if any of these natives could participate in the meeting as well). Anyway, I think the proponent provides us with material to be audited, but doesn't clarify how it would reach the community, so in general I think the auditability is just ok, with a lot to improve. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 11, "ne": 4, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "\n\nTHese projects are not intended to build Devs. they are intended for 99% of the population who are non devs to onboard to Cardano as well, hold some ada, learn how to invest, how to increase their holdings in qty and value, and get used to a crypto economy.  \n\nDOes the community not understand simple KPIs?  We are not artists to be able to do visual documents.  We stand by our process, our KPIs and metrics. We have done this for 25 years we know what we are doing. How would the community access those results? Just like they access the results in every one elses projects!!! The proposer provides them the results.  "}, {"id": 7991, "q0": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project, there will be similar sentences\"). This proposal is intended to help Bengali people understand Cardano, but the difficulty here is that Bengali people cannot learn their language, so the author has provided translated videos in Bengali to help the people here. understand Cardano and the ecosystem it runs on. The purpose of this proposal is to overcome the ignorance of the people here to create a trusted platform for 250 million Bengali people to deeply understand the ecosystem as well as Blockchain technology and cryptocurrencies. The idea is great. This proposal effectively addresses the challenge... The author has proposed a well-defined, goal-directed problem-solving approach that offers a lasting solution, a defined path. clearly defined problem solving. . . The author has scaled up with future challenges and the Bengali community of the Cardano ecosystem, the blockchain basics help everyone here build better apps. build a community of players in Bengali. They also outline possible risks, there are also some risk solutions highlighting the challenge by looking at it from a legal perspective. This shows that the author is very cautious with the progress of their project.\n", "q0r": 5, "q1": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). It is proposed to specify a clear period for activities to be divided into 3 months. The author has a team fluent in all languages ​​with more than 20 years in the industry. I believe the project's roadmap will be on schedule as the author promised. The budget is 7.100 USD, detailed and listed by the author for each category. With the amount listed for each month, I find the budget sufficient to check the progress of the proposal. Suggest an easy way to measure success through the metrics the author has listed. . . It is surprising with the number of years of experience that the group has given, the 4-member group has more than 20 years of experience. I do not doubt the experience of the propagandists, they are all elite members, members that we can follow through social networking sites. With a solid team of experts with good leadership, based on the information provided I think this project will be successful.\n", "q1r": 4, "q2": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). The measurement indicators are detailed by the author in 3 months of implementation, each month will produce 120 minutes of video. Well-defined KPIs determine the success of the proposal through the number of views, several followers, shares... The author gives great ideas it tackles effectively the challenge, if it is funded I believe the project will be very successful it will have a good impact on making more people aware of Cardano. However, the success of this project is tied to the success of other projects so I think the risk will be multiplied. . . This project is completely new and is waiting for funding.\n", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 8577, "q0": "The intention of  project which is the scope of the “Cardano in Bengali” proposal is to translate Cardano related video content, from the IOHK YouTube channel into Bengali. The same team has submitted functionally identical proposals, each covering a different language, for 15 different languages of the Indian subcontinent. I would like to point out that in this case, this is not necessarily a problem as each proposal covers essentially a different service. The aim of each is to translate a YouTube video every 3 days, in this case into Bengali.\n\nI have meticulously verified the text of all 15 proposals in a text editor that allows for snapshots and comparisons between snapshots (Scrivener), to make sure the text of the proposals is the same. With a few minor exceptions of paragraphs being present in some proposals, but not in others, I can say with confidence that they are functionally identical proposals. As such I will be reviewing the proposals as a proposal group.\n\nGiven India’s importance in the IT world, and especially considering its potential future growth my view is that this group of proposals would represent a very good investment for the Cardano community, and could have a great impact on attracting Indians to the ecosystem.\n\nThe main thing that I think is missing from this proposal group is the fact that they do not reference or acknowledge each other. If they did, the voters would get a much clearer picture of the project’s scope overall and be able to make much more informed decisions as a result. I would advise that in the future, if the proposals are to be resubmitted separately, the proposer should clearly indicate that the proposals are part of a proposal group and perhaps write a paragraph or two about the vision behind the project as a whole and how they plan to implement it, especially since the same people will be responsible for the project management, logistics and implementation of the whole set of proposals.\n\nI can understand the reasoning behind submitting each language translation as a new proposal, so that the Cardano community can choose to fund as many as they think is necessary, and that the project can still go ahead if only a few languages are funded. However, I also feel that the average voter, who may only come across 2-3 proposals should have been made aware of the existence of the proposal group. \n\nThe proposers provide the number of speakers for each language in each category, however as the proposals do not reference each other I will make a list of all languages the proposers have submitted proposals for, in order of the number of worldwide speakers:\n\n\t1)\tHindi - 528 million speakers globally\n\t2)\tUrdu - 280 million speakers globally\n\t3)\tBengali - 250 million speakers globally (this proposal)\n\t4)\tPunjabi - 113 million speakers globally\n\t5)\tMarathi - 83 million speakers globally\n\t6)\tTelugu - 83 million speakers globally\n\t7)\tGujarati - 75 million speakers globally\n\t8)\tTamil - 75 million speakers globally\n\t9)\tKannada - 56 million speakers globally\n\t10)\tBhojpuri - 51 million speakers globally\n\t11)\tOdia - 39 million speakers globally\n\t12)\tMalayalam - 39 million speakers globally\n\t13)\tNepali - 25 million speakers globally\n\t14)\tSinhala - 25 million speakers globally\n\t15)\tAssamese - 24 million speakers globally\n\nI have cross-checked these figures with the information provided in the Languages of India Wikipedia article https://en.wikipedia.org/wiki/Languages_of_India , and for the most part they check out. There are a few small discrepancies, but that is perfectly understandable given the dataset, even the Wikipedia article feature 2 separate lists with slightly varying numbers. Not on the lists in the article are Nepali (https://en.wikipedia.org/wiki/Nepali_language) and Sinhala (https://en.wikipedia.org/wiki/Sinhala_language), languages mainly spoken in Nepal and Sri Lanka respectively.\n\nI have also compiled a list of links to all the proposals in the group for easier reference:\n\n\t•\tCardano in Hindi - https://cardano.ideascale.com/c/idea/398838 \n\t•\tCardano in Urdu - https://cardano.ideascale.com/c/idea/398847 \n\t•\tCardano in Bengali (this proposal) - https://cardano.ideascale.com/c/idea/398841 \n\t•\tCardano in Punjabi - https://cardano.ideascale.com/c/idea/398857 \n\t•\tCardano in Marathi -  https://cardano.ideascale.com/c/idea/398842 \n\t•\tCardano in Telugu - https://cardano.ideascale.com/c/idea/398843  \n\t•\tCardano in Gujarati - https://cardano.ideascale.com/c/idea/398845 \n\t•\tCardano in Tamil - https://cardano.ideascale.com/c/idea/398840 \n\t•\tCardano in Kannada - https://cardano.ideascale.com/c/idea/398850 \n\t•\tCardano in Bhojpuri - https://cardano.ideascale.com/c/idea/398981 \n\t•\tCardano in Odia - https://cardano.ideascale.com/c/idea/398853 \n\t•\tMalayalam - https://cardano.ideascale.com/c/idea/398856 \n\t•\tCardano in Nepali - https://cardano.ideascale.com/c/idea/398858 \n\t•\tCardano in Sinhala - https://cardano.ideascale.com/c/idea/404484 \n\t•\tCardano in Assamese - https://cardano.ideascale.com/c/idea/398980 \n\nThere are a few inconsistencies, meaning the authors failed to update each proposal with the correct language, or, in a few instances, the number of speakers internationally is not consistent within a proposal, however, that is understandable given the number of proposals they had to keep track off.\n\nOverall, even though the proposal itself could definitely use some more work and could have been better written and more refined in a number of areas, the initiative itself is worthwhile and it’s a big plus for the Cardano translation effort that we have access in our community to such well-connected individuals in the translation field that are offering their services at very competitive rates.\n\nThe budget for translating a single language is very reasonable at $7,100, however, all the languages combined add up to almost 3 quarters of the total category budget, $106,500 out of $150,000. While the initiative to make Cardano content accessible in various Indian languages is certainly worthwhile it is up to the Cardano community to decide which to prioritise and fund and hopefully this overview will assist with that.", "q0r": 4, "q1": "The Impact section of my assessment of this proposal, “Cardano in Bengali”, also notes that is part of a group of proposals that aim to translate IOHK YouTube content into 15 Indian languages. As the proposals are functionally identical, my reviews will also be almost the same. However, reviewing a group of 15 proposals took almost the same amount of time as assessing 15 unique proposals, because of the steps described in the Impact section of my assessment. \n\nThe roadmap is very detailed and easy to follow. It makes perfect sense for the projects.\n\nThe budget requested by the team is very reasonable and a portion of it, $2000 out of $7100 is set aside for contingencies, meaning that even if unforeseen situations were to happen the team should be able to deal with them and deliver the product.\n\nAll the 15 proposals promise to “Translate the entire content of IOHK in stages”, however since that is a monumental task I would have liked to see more indications about their plan of action, and what they plan to start with. The proposals mention applying for future Catalyst funding\t if the project is to continue. \n\nSince the proposals’ primary focus is translating YouTube videos from the IOG channel, I would advise contacting them and coordinating with IOG on this effort. Especially if multiple proposals will be funded.\n\nThis could result in multiple benefits. For instance, the proposals don’t specify how the translations are to be handled, if they intend to bake them in, hardcode them in the videos, or if they are to be presented as CC (close captions).\nIf the translations are baked in, it would make sense for IOG to provide them with the original video files. This way the team won’t have to download the highly compressed video file from YouTube and upload a video file that has gone through multiple compressions, greatly reducing quality.\nIOG could get access to the text of the translations to be included in its primary videos, if wished, as CC (close captions).\n\nThe description of the team members involved with this project is very detailed and they seem more than competent to get the job done. The included LinkedIn profile links were helpful, however the LinkedIn profiles were kind of sparse for some of the team members. But, that didn’t constitute a problem since enough info is given in the proposals themselves.\n\nThe roles that the team members mentioned in the proposal will take within the projects are not exactly specified. However, I assume they will be mostly responsible for the project management of the proposals and the translations will be handled by the “Master Translators” mentioned several times in the proposal. If this is the case, I would have liked to see more details around this and how they plan to recruit. However, given the stated experience of the proposals my level of confidence that they will get the job done is high.\n\nI particularly appreciated that, unlike many other proposers, the team behind this proposal has taken the time to properly identify and address a long list of risks/problems that could occur during the translation process. This definitely increases the feasibility of the proposals.", "q1r": 5, "q2": "The Impact and Feasibility sections of the review for this proposal, “Cardano in Bengali”, also mention the fact that it’s just one in a group of 15 proposals that aim to translate IOHK YouTube content into 15 Indian languages. Bengali, in the case of this proposal.\n\nGiven that translated YouTube videos are the main deliverables to track for this group of 15 proposals the metrics presented in the auditability section should be sufficient to verify the evolution of the projects as they all have to do with engagement on the platform.\n\n As the output of these projects is YouTube videos, the quality of the translations will only be able to be verified by speakers of the 15 languages which the projects aim to produce translations for, but that is beyond the scope of current Catalyst auditability requirements. \n\nThe definitions of success given are more or less a copy/paste of the metrics presented in the initial section of the Auditability part of the proposals and various other parts of the proposal. However, the initial paragraph does offer some info about what the team hopes to accomplish with this overarching project that spans 15 Catalyst proposals in this round.\nIn the future, I would definitely recommend giving more thought to this section of the proposals and rewriting it. For instance, attaching clear values to each of the metrics given would have turned them into milestones/goals; an example: “15000 average views per video”. But, ultimately this doesn’t carry much weight in this case, given the nature of the project and the set of proposals.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}], "solution": "Provide translated videos in Bengali about Cardano ecosystem. Translate the entire content of IOHK . Transcribed, and subtitles offered.", "experience": "1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n+ 1995 to 2022 - 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\n\nOver 30 years experience in Ministry of Languages as Official Languages translator."}