{"id": 398838, "author": "dimitri777", "title": "Cardano in Hindi", "url": "https://cardano.ideascale.com/a/dtd/398838-48088", "category": 26454, "amount": 7100, "description": "Lack of official Hindi content . Thus Hindi speakers cannot learn in their native language. There are 528 million speakers around the world.", "f6_no_assessments": 23, "f6_rating": 4.173913043478261, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is great and fits perfectly with what the challenge seeks. I researched here and saw that Hindi is a widely spoken language in India (70% of the natives speak the language), in that sense, the idea of ​​translating into Hindi several youtube videos from famous channels that talk about Cardano would break the language barrier (the biggest obstacle to democratizing Cardano) for a greater portion of the country's inhabitants. Our objective in this challenge is to work on the development of India, benefiting it, helping it to grow in economic, humanitarian or environmental aspects. In this case, the focus will be on benefiting people, so we are working on the humanitarian aspect. However, this will also reflect economically, because once the target audience of the translations knows Cardano, the job opportunities that our ecosystem offers, such as working as a CA or vCA on Catalyst, or even as a programmer, designer or other much needed roles in projects, will generate income for these people. With this, the objective of benefiting India will certainly be achieved, as its inhabitants will be facilitated to enter the community because, let's face it, most of us are confused by the Cardano ecosystem at first, it's a lot and there is no definitive and accessible guide for everyone in all languages. Therefore, translating into Hindi videos from the main channels that cover teachings about Cardano, such as the IOHK channel, the Emurgo channel and Cardano Foundation, will be a great way to facilitate the access of many Indians to the Cardano community. And with that, obviously the Cardano ecosystem will benefit, as the number of active participants in our community grows, consequently the investment in Ada also increases, new digital wallets are created, new students learn about our technologies and generate the potential for new professionals working on our blockchain, investors turn their attention to our blockchain, understanding its particularities and advantages... In short, the benefits for Cardano would be numerous, if the translations are all done properly and this content is widely disseminated, reaching the public's knowledge target, in addition to being mentored in addition to the presentation of the videos (maybe this is not the responsibility of this team, but it is a necessity). Something I would like to note is that here is the statement that it takes a long time to convert Ada to local currency, but I disagree, I do it for binance in a few minutes, I don't understand why this was put as a problem here. But anyway, on the impact, I agree that the proposal has the potential to bring profound benefits to both India and Cardano, fully achieving the objectives of the challenge. \n", "q0r": 5, "q1": "The team is presented in great detail, we know who the members of this team are very specifically. Included are their names and very sizable texts about their past experiences, where we can see who is involved with the Cardano ecosystem and who is not. For example, Dimitri Fernando is a person who seems to be quite experienced when it comes to our blockchain, and even if the ideal is for everyone to have some involvement with Cardano, a well-understood person already makes a difference. It's also positive how everyone's social network profiles are attached; these are always welcome to directly understand what has been done in their professional lives so far, as well as being ways to prove what has been said. I wish the roles of each one with this project, specifically, had been better defined, as we know what their area and experience are, but not what exact role they would play here. About the budget, I think this part is average, because the method of charging per words is not simple to be audited, for example. I don't think anyone would have time to count how many words were translated by video, in addition to being an impractical method of monitoring whether what was promised was fulfilled. Therefore, I think that other ways should be established, such as, for example, a definition of the hourly rate for translators. Apart from the price per translated word, the other expenses of this proposal could be better explained, what would the marketing campaign be like, why would it cost 1200 dollars? What is the contingency fee? Finally, speaking of the script, I think that the activities that would be developed each time are described in a very superficial way, we know that content will be generated and disseminated. But how will the team organize itself to make these translations? How many translators would there be, what would their work routines be like? Who would select the videos to be translated, and even what topics would be addressed, in what order and why? I think this part of the proposal needs a lot of depth, a weekly schedule of tasks to be accomplished, for example. So I can't say that feasibility is bad, as important information is provided, but we have things to improve here, without a doubt. \n", "q1r": 3, "q2": "The auditability suggested by the proponent is useful to objectively perceive whether the main goals have been achieved. Regarding the process, he suggests that the content posted on youtube be verified; regarding the final results, things would be perceived through numbers: number of subscribers to the channel, number of comments, number of hours watched... And, of course, the goal is for the Hindi-speaking community to have the possibility to learn about Cardano and become an active part of our community. I think it is already a satisfactory auditable proposal, but it could be better monitored. Some suggestions are that the team give feedback to the Cardano community at the end of each one, it doesn't need to be anything elaborate, a message that contains basic information about whether the work that was planned for that period of time was accomplished, links to the translated videos, the problem score, if any, during the content creation process... Finally, the most appropriate thing is that this general overview was summarized in a report that could be forwarded to some discord group in the Cardano community, for example, that focused on tracking proposals financed from that fund. And in relation to the final results, I think it would be interesting if a closer monitoring of the channel's subscribers was carried out, so that we would know, in addition to how many people are subscribed, who are those who actually watch the videos that are periodically released... their learning process is taking place, what they intend to do with the accompaniment acquired there and so on. I think this information should be collected by the project team, and taken directly to the community in a kind of final report, which clarifies how the project impacted the Hindi-speaking community in an exact way. Thus, I believe that we would have an even more defined notion of monitoring both the process and the final scenario. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 12, "ne": 7, "ng": 4, "nfo": 1, "vca_o": 2, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "India is one of the most technologically advanced countries in the world. The cryptocurrency community here is also very large. Currently, there are more than 528 million people worldwide who speak Hindi. It is essential to provide videos and documents translated into Hindi. Recommendation: Cardano in Hindi is a very good proposition and perfectly suited the challenge presented. The successful proposal will make Cardano accessible to a large market and there will be a lot of talented people who can join the Cardano ecosystem in the future.", "q0r": 5, "q1": "The team consists of active and experienced members such as: Dimitri Fernando, Muttiah Duraiswamy, Rishantha Welikadage and many other outstanding members. The community can easily find information about them through the Linkedin links they provide. I greatly appreciate this. In addition, the risks that may affect the success of this proposal are also fully presented by the team. I fully believe that with the experience and thorough preparation from the team, you will complete this proposal well.", "q1r": 4, "q2": "The proposed implementation roadmap is also detailed and complete by the group. This shows that the team is very well prepared and has a lot of experience in this regard. In addition, I noticed that the $7100 grant that the team plans to use is very clear and transparent. I believe the community also appreciates this. The group KPIs are also very complete, but you need to be more specific about the number so that the community can easily measure it. Example: How many new people will watch the videos? How many people through translated videos reach the Cardano community? Through this proposal, how many people will come to start a business with the Cardano ecosystem? I believe that if you provide this information fully, the community will agree with you more.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "Please note this assessment should be taken in context of a set of 19 similar proposals by the same proposer in two challenges, Grow India, Grow Cardano and Grow The only real difference between the proposals being the spoken language used (Urdu, Thai, Gujurati, Laotian, etc.). In all other respects they are essential the same. Hence it is almost impossible to write 19 distinct assessments, I have tried to find specific differentiators but have also looked at the package of proposals as a whole as, I believe, this will add greater value to the voter. Looking at this specific proposal for translating videos into Hindi, it largely meets the challenge brief in seeking to broaden the horizons of the Cardano ecosystem. The proposer should be praised for taking the initiative. I would suggest the proposer uses the comments section to explain voters their rationale behind this multi-proposal approach. That should help with transparency and help people make an informed decision. For example: Are they looking for voters to decide on which languages they prefer thus restricting the choice to the existing community. This kind of defeats the purpose of reaching out to new communities. If this is the case I have done a rudimentary research on number of people speaking each language to help the voters make an informed decision. Given more time, an in depth analysis of demographics would be useful showing current literacy levels, access to technology, levels of education, English speakers, etc in India, Pakistan and Sri Lanka. Hindi ranks top by a long way so should be the highest priority? 1.Hindi:615M 2.Bengali:265M 3.Urdu:170M 4.Punjabi:126M 5.Marathi:95M 6.Telugu:93M 7.Tamil:81M 8.Gujarati:61M 9.Kannada:56M 10.Bhojpuri:50M 11.Odia:38M 12.Malayalam:38M 13.Sinhala:17M 14.Nepali :17M 15.Assamese:15M Where the voter needs to pay particular attention is the entirety of the ask. The proposal therefore under assessment are: Grow India, Grow Cardano - 15 Proposals https://cardano.ideascale.com/c/idea/404484 https://cardano.ideascale.com/c/idea/398981 https://cardano.ideascale.com/c/idea/398980 https://cardano.ideascale.com/c/idea/398858 https://cardano.ideascale.com/c/idea/398857 https://cardano.ideascale.com/c/idea/398856 https://cardano.ideascale.com/c/idea/398853 https://cardano.ideascale.com/c/idea/398850 https://cardano.ideascale.com/c/idea/398847 https://cardano.ideascale.com/c/idea/398845 https://cardano.ideascale.com/c/idea/398843 https://cardano.ideascale.com/c/idea/398842 https://cardano.ideascale.com/c/idea/398841 https://cardano.ideascale.com/c/idea/398840 https://cardano.ideascale.com/c/idea/398838 ", "q0r": 3, "q1": "The contents of feasibility are duplicated across all 19 proposals. In simple terms we are looking at a total ask of $135,900 of which $38,000 (28%) is contingency. At a proposal level that is $7100 budget with $2000 contingency. My project planning head immediately points to the 28% contingency. It is not clear what this is set aside for. A risk of ADA price fluctuation is noted in the proposals, however one of the proposed mitigations for that is a 10% contingency, the other being to sell funds privately to ADA holders. In addition the proposals states “We have ample resources to complete the project on time and within budget’, once again raising the question on the need for such a large contingency in proportion to the budget? Now looking at what is to be delivered. Each proposal states the YouTube channel will be launched with 6 videos. We have to assume that means 6 videos translated in all 19 languages should they all be funded. After 3 months 10-20 videos (each translated in 19 languages) That gives us 380 translations in total at an average of 4 per day. I have run this by someone with experience in this area and their reaction was ‘its going to need a considerable team’. So, let’s look at the evidence of a team with the skills to deliver this proposal. The proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator. Specific languages are not mentioned so very difficult to validate of if they have the skills for this specific proposal Two other individuals are listed, their LinkedIn in profile are well populated but don’t display the skills required to deliver this project. That leave us with the “extensive network of Master translators”. Again no evidence of their existence of previous work exists so impossible to evaluate. I believe the proposer has a lot to offer the ecosystem and can suggest the following: 1. Help the voter understand the need for 19 similar proposals 2. Provide evidence that they have access to the skills required 3. Look at a small scope with a set of languages he or Muthiah are comfortable with. Use this as a POC on both the translation and engagement side. SHOW the community this proposal is growing adoption. 4. Take the learnings (e.g. which types of video are interesting your audience) and if a larger (multi language) proposal is what is required submit it in a future fund leveraging in the economies of scale that will naturally provide on the maintenance of socials, contingency & marketing.", "q1r": 2, "q2": "The metrics are sensible in terms of measuring engagement on youtube which is a great basic piece to measure. However to really get to the crux of the challenge we need to see the conversion rates into Cardano and/or Catalyst • increased interaction between Catalyst and Indian focused projects • Number of Indian focused Catalyst submissions • Number of Indian focused dapps/services actually built", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\nThis has to be filtered out.  So many reasons..\nCombining into one proposal may make sense to this proposer who may not be from Asia and recognize the huge diversity from state to state or region to region. All languages cannot be done by same people or same social media campaign.  This is why we broke up. Smaller proposals enable people to clearly see we are not here to grab money.   Each language needs its unique Social media campaign to reach people.  We cannot lump everything into one.   \n\nSecondly Why consider the total ask?  The rules state that each proposal has to be considered on its own merit.  Therefore even if  i had a hundred language proposals, if i had a hundred teams of two Master Translators and Two Proofreaders, then it will get the job done. We are doing this for 25 years buddy.   We know exactly how to run a translation project.\n\n\n\nHe goes on\nThe proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator.\nI have stated as below, we have and use our extensive network of Master Translator Partners.\n\nThe assessor has not read the proposal. It states clearly as follows\nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing Or Mr Muthiah D is doing,  the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of Tamil both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nSome specific statements that are absolute nonsense=\nHowever, because the primary responsibility of this position is to translate text from English to Tamil, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network.   As stated we have been doing projects for over 25 years. The definition of Master translator if this assessor doesn't understand is a MASTER OF HIS CRAFT.  A SENIOR IN THE INDUSTRY.   Each one will have different qualifications.  As for our specific master translator, he is the ONLY ONE IN SRI LANKA to write for the Mahawamsa which is like the BIBLE OF HISTORY of SRI LANKA for over 4000 years. It has been written from the time of kings.  This is a role that he alone in Sri Lanka has. So this assessor is talking nonsense\nPlease filter him out.\n "}, {"q0": "Comprehension and communication is an indispensable trait for a rapidly expanding project such as Cardano, specially within majority developing-country areas of the world which are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. For that to occur, the material must be available in the main languages of each region. India has the characteristics of a high inequality region, with a very large population, high percentage of unbanked people and high engagement with new technologies, and Hindi is spoken by over half a billion people worlwide. This is a region ripe for disruption via the cryptoeconomy, and the use of Hindi to inform of Cardano-led projects will ensure a predominant market position for Cardano from an early stage.", "q0r": 5, "q1": "The proposer is an active member of the Catalyst Community (General ADA holder in Catalyst Circle V3, Community Advisor in Fund 6 and 7, Veteran Community Advisor in Fund 7, Founder of South Asian Town Hall), and both he and potential collaborators have LinkedIn profile attached for verification of real/life track records, specially when ti comes to translation skills and experience. This indicates a clear and deep commitment to the Cardano community and its success. The presence of EMURGO India could also provide the opportunity for some synergies to develop with funded proposals and subsequent informative material about Cardano in Hindi. It would be interesting to know, for a future iteration, if the team members comprise other regions of India so as to give a more diverse panel conformation to the Challenge Team.", "q1r": 5, "q2": "Within the budgetary breakdown provided, the milestones and KPIs (number of followers to the LanCardano Youtube Channel, average views per video, watching hours, comments, shares, downloads, etc.) are clear and auditable, specially given the 1 video translated every 3 days goal, and the fact that the word-based budget includes translation, transcription, dubbing, editing, and publishing.", "q2r": 5, "assessor": "z_assessor_787", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "The proposal that raised the issue was Lack of Official Hindi Content for the Cardano Project. Their solution was to Provide translated Hindi videos to educate the Hindi community in India as well as internationally about Cardano; Translate the entire contents of IOHK in stages. Content will be transcribed and subtitles provided for those who cannot hear. I totally agree this solution will make it easier for the Hindi community of 528 million people worldwide to participate in Cardano.", "q0r": 5, "q1": "The proposer team consists of 4 members, with Dimitri Fernando being an active member of the catalyst community, with 27 years of experience in running a translation agency. Other members are also experienced in document translation, business, and project management. They have provided links to document their experience and abilities. They also have a network of Translating Partners. I suppose with such experience they are a perfect fit. On the implementation roadmap the proponent said that they will implement it in 3 months. The workload is clear for each month, however I think 120 minutes of video per month is relatively low, if it can be increased it would be better. The requested project funding budget of $7,100 is earmarked for translation (including transcription, dubbing, editing, and publishing), social media, and contingencies. with a translation budget of $0.08 per word. I can judge it as reasonable. In addition, the solution to the project's possible risks includes a contingency cost of about 10% of the total cost. however when interpreting the budget I see $2000 for a corresponding 28.17% reserve. I recommend the proposer to explain it in detail so that it is easy for the reader to judge its plausibility.", "q1r": 4, "q2": "The proposal has a 3-month implementation schedule, the 3-month work contents are fully listed and measurable with 120 minutes of translated video with subtitles and voiceovers. However, as mentioned in terms of feasibility, for me such video duration for 1 month is quite low. Follow by LanCardano Youtube Channel Subscribers Indicators;\nAverage views per video;\nWatch hours;\nNumber of comments;\nNumber of shares;\nNumber of downloads; I recommend proposer included a specific definition of how successful this is. What is the goal for each month?", "q2r": 4, "assessor": "z_assessor_706", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "Having read through this proposal, the proposer seeks to provide translated videos in Hindi language to solve the problem of the lack of official Hindi content about Cardano ecosystem. To have an impact of this proposal, mention has been made that the project will bring a new Hindi speaking community into the ecosystem; and that this Hindi community will enrich the Cardano community with its long history and culture and also add to the developer skills in India. \nIn addressing the challenge, the proposal focuses bringing Hindi speaking Indians into the Cardano community to benefit the community with their natural coding developer skills. Mention has been made of the measuring of key performances as number of subscribers on the LanCardano Youtube channel, number of average views per video, number of comments per video and number of watching hours. All these measures according to the proposal will scale to address future challenge stated as bringing in more videos and other channels such as Emurgo and Cardano Foundation Youtube channel. \nThe proposer mentioned risks of the project as fear of another Covid variant which would hinder member participation and cause lockdowns; and also lack of proper terminology in the selected language. However the team provided a solution as having many other master translators on standby and also getting good people who could create a suitable terminology for use in the language for concepts. They also stated that the value of ADA may go down, which might be a risk.  \nThis category is well written but with a few repetitions which should be taken note of in future write ups. The information given deserves a 4 star rating. ", "q0r": 4, "q1": "The detailed plan mentioned that the LanCardano Youtube channel will be launched with 6 videos and build a following while daily adding new content. At the end of 3 months, 10 - 20 videos would come up, with one translated video every 3 days in local languages; I think this is well detailed. Proposer mentioned that there will be 120 min of content to be published per month. The road map is that in a month there will be 2 hours of video, in Month 2, there will be social media campaign, in month 3 they will continue to output 2 hours of video and social media continues. KPIs are clearly stated. \nBudget is well broken down into costs of social media, campaign costs, contingency fee, editing, etc. well broken. The total amount requested of USD7100 is quite reasonable for such a project of events. \nMention has been made of a team of 4 experienced people with experiences in community advisory roles, vCA, entrepreneurs, multiple businesses. Names mentioned as Dimitri Fernando being the project lead, Muttiah with over 30 years of experience in translation, and two others with similar experiences who can implement the project successfully.  With this detailed information, I gave 4 star rating.", "q1r": 4, "q2": "This proposal has stated the roadmap and milestones clearly as 3 months of delivery with details of events for each month. \nKPIs are also clear making mention that we can measure the number of average views per video, the number of watching hours, the number of comments , the number of shares, and the number of downloads, all from the recorded videos. The end success which can also be measured is from the awareness created in the community; bring in new proposers, members onboarded to become more aware of projects and build developer tool and also build the channel in future funds as they grow. \nThis detailed information deserves my 4 star rating, because the project can be easily audited. \nMention was made of it being a new proposal. I recommend that the team find a few more experienced event organizers from the cardano discord channel to collaborate with for a richer experience. The Sustainable Development Goals (SDG) rating (3,4,5,8,9,10, etc chosen) fit the challenge. This could be a very impactful project to create more awareness of Cardano in India, and its adoption.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "The “Cardano in Hindi” proposal in the “Grow India, Grow Cardano” challenge is for translating Cardano-related video content into Hindi. The same team has submitted functionally identical proposals, each covering a different language, for 15 different languages of the Indian subcontinent. I would like to point out that in this case, this is not necessarily a problem as each proposal covers essentially a different service. The aim of each is to translate a YouTube video every 3 days, in this case into Hindi.\n\nI have meticulously verified the text of all 15 proposals in a text editor that allows for snapshots and comparisons between snapshots (Scrivener), to make sure the text of the proposals is the same. With a few minor exceptions of paragraphs being present in some proposals, but not in others, I can say with confidence that they are functionally identical proposals. As such I will be reviewing the proposals as a proposal group.\n\nGiven India’s importance in the IT world, and especially considering its potential future growth my view is that this group of proposals would represent a very good investment for the Cardano community, and could have a great impact on attracting Indians to the ecosystem.\n\nThe main thing that I think is missing from this proposal group is the fact that they do not reference or acknowledge each other. If they did, the voters would get a much clearer picture of the project’s scope overall and be able to make much more informed decisions as a result. I would advise that in the future, if the proposals are to be resubmitted separately, the proposer should clearly indicate that the proposals are part of a proposal group and perhaps write a paragraph or two about the vision behind the project as a whole and how they plan to implement it, especially since the same people will be responsible for the project management, logistics and implementation of the whole set of proposals.\n\nI can understand the reasoning behind submitting each language translation as a new proposal, so that the Cardano community can choose to fund as many as they think is necessary, and that the project can still go ahead if only a few languages are funded. However, I also feel that the average voter, who may only come across 2-3 proposals should have been made aware of the existence of the proposal group. \n\nThe proposers provide the number of speakers for each language in each category, however as the proposals do not reference each other I will make a list of all languages the proposers have submitted proposals for, in order of the number of worldwide speakers:\n\n\t1)\tHindi - 528 million speakers globally (this proposal)\n\t2)\tUrdu - 280 million speakers globally\n\t3)\tBengali - 250 million speakers globally\n\t4)\tPunjabi - 113 million speakers globally\n\t5)\tMarathi - 83 million speakers globally\n\t6)\tTelugu - 83 million speakers globally\n\t7)\tGujarati - 75 million speakers globally\n\t8)\tTamil - 75 million speakers globally\n\t9)\tKannada - 56 million speakers globally\n\t10)\tBhojpuri - 51 million speakers globally\n\t11)\tOdia - 39 million speakers globally\n\t12)\tMalayalam - 39 million speakers globally\n\t13)\tNepali - 25 million speakers globally\n\t14)\tSinhala - 25 million speakers globally\n\t15)\tAssamese - 24 million speakers globally\n\nI have cross-checked these figures with the information provided in the Languages of India Wikipedia article https://en.wikipedia.org/wiki/Languages_of_India , and for the most part they check out. There are a few small discrepancies, but that is perfectly understandable given the dataset, even the Wikipedia article feature 2 separate lists with slightly varying numbers. Not on the lists in the article are Nepali (https://en.wikipedia.org/wiki/Nepali_language) and Sinhala (https://en.wikipedia.org/wiki/Sinhala_language), languages mainly spoken in Nepal and Sri Lanka respectively.\n\nI have also compiled a list of links to all the proposals in the group for easier reference:\n\n\t•\tCardano in Hindi (this proposal) - https://cardano.ideascale.com/c/idea/398838 \n\t•\tCardano in Urdu - https://cardano.ideascale.com/c/idea/398847 \n\t•\tCardano in Bengali - https://cardano.ideascale.com/c/idea/398841 \n\t•\tCardano in Punjabi - https://cardano.ideascale.com/c/idea/398857 \n\t•\tCardano in Marathi -  https://cardano.ideascale.com/c/idea/398842 \n\t•\tCardano in Telugu - https://cardano.ideascale.com/c/idea/398843  \n\t•\tCardano in Gujarati - https://cardano.ideascale.com/c/idea/398845 \n\t•\tCardano in Tamil - https://cardano.ideascale.com/c/idea/398840 \n\t•\tCardano in Kannada - https://cardano.ideascale.com/c/idea/398850 \n\t•\tCardano in Bhojpuri - https://cardano.ideascale.com/c/idea/398981 \n\t•\tCardano in Odia - https://cardano.ideascale.com/c/idea/398853 \n\t•\tMalayalam - https://cardano.ideascale.com/c/idea/398856 \n\t•\tCardano in Nepali - https://cardano.ideascale.com/c/idea/398858 \n\t•\tCardano in Sinhala - https://cardano.ideascale.com/c/idea/404484 \n\t•\tCardano in Assamese - https://cardano.ideascale.com/c/idea/398980 \n\nThere are a few inconsistencies, meaning the authors failed to update each proposal with the correct language, or, in a few instances, the number of speakers internationally is not consistent within a proposal, however, that is understandable given the number of proposals they had to keep track off.\n\nOverall, even though the proposal itself could definitely use some more work and could have been better written and more refined in a number of areas, the initiative itself is worthwhile and it’s a big plus for the Cardano translation effort that we have access to in our community to such well-connected individuals in the translation field that are offering their services at very competitive rates.\n\nThe budget for translating a single language is very reasonable at $7,100, however, all the languages combined add up to almost 3 quarters of the total category budget, $106,500 out of $150,000. While the initiative to make Cardano content accessible in various Indian languages is certainly worthwhile it is up to the Cardano community to decide which to prioritise and fund and hopefully this overview will assist with that.", "q0r": 4, "q1": "As mentioned in the Impact section of my assessment of this proposal, “Cardano in Hindi”, is part of a group of proposals that aim to translate IOHK YouTube content into 15 Indian languages. As the proposals are functionally identical, my reviews will also be almost the same. However, reviewing a group of 15 proposals took almost the same amount of time as assessing 15 unique proposals, because of the steps described in the Impact section of my assessment. \n\nThe roadmap is very detailed and easy to follow. It makes perfect sense for the projects.\n\nThe budget requested by the team is very reasonable and a portion of it, $2000 out of $7100 is set aside for contingencies, meaning that even if unforeseen situations were to happen the team should be able to deal with them and deliver the product.\n\nAll the 15 proposals promise to “Translate the entire content of IOHK in stages”, however since that is a monumental task I would have liked to see more indications about their plan of action, and what they plan to start with. The proposals mention applying for future Catalyst funding if the project is to continue. \n\nSince the proposals’ primary focus is translating YouTube videos from the IOG channel, I would advise contacting them and coordinating with IOG on this effort. Especially if multiple proposals will be funded.\n\nThis could result in multiple benefits. For instance, the proposals don’t specify how the translations are to be handled, if they intend to bake them in, hardcode them in the videos, or if they are to be presented as CC (close captions).\nIf the translations are baked in, it would make sense for IOG to provide them with the original video files. This way the team won’t have to download the highly compressed video file from YouTube and upload a video file that has gone through multiple compressions, greatly reducing quality.\nIOG could get access to the text of the translations to be included in its primary videos, if wished, as CC (close captions).\n\nThe description of the team members involved with this project is very detailed and they seem more than competent to get the job done. The included LinkedIn profile links were helpful, however, the LinkedIn profiles were kind of sparse for some of the team members. But, that didn’t constitute a problem since enough info is given in the proposals themselves.\n\nThe roles that the team members mentioned in the proposal will take within the projects are not exactly specified. However, I assume they will be mostly responsible for the project management of the proposals and the translations will be handled by the “Master Translators” mentioned several times in the proposal. If this is the case, I would have liked to see more details around this and how they plan to recruit. However, given the stated experience of the proposals my level of confidence that they will get the job done is high.\n\nI particularly appreciated that, unlike many other proposers, the team behind this proposal has taken the time to properly identify and address a long list of risks/problems that could occur during the translation process. This definitely increases the feasibility of the proposals.", "q1r": 5, "q2": "As already noted in the Impact and Feasibility sections of the assessment, “Cardano in Hindi”, is just one in a group of 15 proposals that aim to translate IOHK YouTube content into 15 Indian languages. Hindi, in the case of this proposal.\n\nGiven that translated YouTube videos are the main deliverables to track for this group of 15 proposals the metrics presented in the auditability section should be sufficient to verify the evolution of the projects as they all have to do with engagement on the platform.\n\n As the output of these projects is YouTube videos, the quality of the translations will only be able to be verified by speakers of the 15 languages which the projects aim to produce translations for, but that is beyond the scope of current Catalyst auditability requirements. \n\nThe definitions of success given are more or less a copy/paste of the metrics presented in the initial section of the Auditability part of the proposals and various other parts of the proposal. However, the initial paragraph does offer some info about what the team hopes to accomplish with this overarching project that spans 15 Catalyst proposals in this round.\nIn the future, I would definitely recommend giving more thought to this section of the proposals and rewriting it. For instance, attaching clear values to each of the metrics given would have turned them into milestones/goals; an example: “15000 average views per video”. But, ultimately this doesn’t carry much weight in this case, given the nature of the project and the set of proposals.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "This proposal is great idea since it brings Cardano closer to the population of more than haft a billion Hindi people in India. This proposal falls within the challenge setting purpose. The total number of translation duration is 120 minutes per month seems a little bit limited for someone who would like to discover about something new. If the proposal can increase the translated time to few times, it will have more impact on the community.  The proposal can also be scaled up easily by translating to Hindi more videos and other channels such as the Emurgo and Cardano Foundation Youtube channel. Some risks are identified and mitigation solutions for those risks are provided, enhancing the chance of project success and ensuring project impact to the Indian community.", "q0r": 4, "q1": "The plan of uploading one video every three days would sound more feasible if the duration of the video is provided. Proposal roadmap is clear and straight forward, that is 120 minutes of translated video per month. For a person who would like to discover more about blockchain in general and Cardano in particular, the duration of 120 minutes per month seems too small. If the proposers can increase the duration of translated video, it would have greater impact on the community. Besides, the proposers are master of translation with clear reference links for audience to assess at any time. The requested budget is reasonable and is broken down into assessable details. Requested budge of 7,100$ is reasonable. In short, the proposal is feasible.", "q1r": 4, "q2": "Roadmap is presented clearly since it is quite straightforward. Measurement of success is also defined. If the metrics for success is quantitative, it would be auditable. For example: The proposal defines the metrics are: Number of followers to the Lan Cardano Youtube Channel; Number of average views per video; Number of watching hours; Number of comments; Number of shares; Number of downloads; The questions are: How many numbers of average views per video would the project be classified as success? How many numbers of watching hours would the project be classified as success? How many numbers of comments would the project be classified as success? How many numbers of shares would the project be classified as success? How many numbers of download would the project be classified as success? With all of those arguments, I, therefore, still agree that the proposal is auditable.", "q2r": 4, "assessor": "z_assessor_675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "\nProposer states that there is a lack of content in Hindi and claims that he will translate the entire content of IOHK into Hindi, a language spoken by 528 million people in the world. Proposer claims that translating content into Hindi will bring a brand new community into the Catalyst ecosystem and thus add value to the Cardano ecosystem. The key metrics and goals of the proposal are aligned with the outlined challenge settings and proposal is able to scale to address future challenges.\n", "q0r": 5, "q1": "The team is transparently presented through LinkedIn and Facebook links and as these are 15 completely identical proposals with changes in the name of the language, the proposer points out that it will additionally engage people through the Master Translator Partner network to handle overflow of work. The budget is reasonable to achieve the goals and the budget is broken down to the items. Proposer aims to translate one video every 3 days and that after 3 months it will have approx 10-20 videos to upload to the youtube channel. It would be good to mention the possible challenges and risks, because we can be sure that they would arise in translations of all IOHK videos into 15 languages.\n\n", "q1r": 4, "q2": "A roadmap and time frame for achievements was presented. KPIs are presented through number of followers to the LanCardano Youtube channel (which needs to be done), number of average views per video, number of watching hours, number of comment, number of shares, number of downloads.\nCommunity can follow the development of this project. ", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project, there will be similar sentences\"). This proposal is intended to help Hindi people understand Cardano, but the difficulty here is that Hindi people cannot learn their language, so the author has provided Hindi translated videos to help the people here. understand Cardano and the ecosystem it runs on. The aim of this proposal is to overcome the ignorance of the people here to create a trusted platform for the 528 million people of Hindi to deeply understand the ecosystem as well as Blockchain technology and cryptocurrencies. The idea is great. This proposal effectively addresses the challenge... The author has proposed a well-defined, goal-directed problem-solving approach that offers a lasting solution, a defined path. clearly defined problem solving. . . The author has scaled up with future challenges and the Cardano ecosystem Hindi community, blockchain basics help everyone here build better apps. Build a community of players in Hindi. They also outline possible risks, there are also some risk solutions highlighting the challenge by looking at it from a legal perspective. This shows that the author is very cautious with the progress of their project.\n", "q0r": 5, "q1": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). It is proposed to specify a clear period for activities to be divided into 3 months. The author has a team fluent in all languages ​​with more than 20 years in the industry. I believe the project's roadmap will be on schedule as the author promised. The budget is 7.100 USD, detailed and listed by the author for each category. With the amount listed for each month, I find the budget sufficient to check the progress of the proposal. Suggest an easy way to measure success through the metrics the author has listed. . . It is surprising with the number of years of experience that the group has given, the 4-member group has more than 20 years of experience. I do not doubt the experience of the propagandists, they are all elite members, members that we can follow through social networking sites. With a solid team of experts with good leadership, based on the information provided I think this project will be successful.\n", "q1r": 4, "q2": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). The measurement indicators are detailed by the author in 3 months of implementation, each month will produce 120 minutes of video. Well-defined KPIs determine the success of the proposal through the number of views, several followers, shares... The author gives great ideas it tackles effectively the challenge, if it is funded I believe the project will be very successful it will have a good impact on making more people aware of Cardano. However, the success of this project is tied to the success of other projects so I think the risk will be multiplied. . . This project is completely new and is waiting for funding.\n", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "There are very few youtube videos on Cardano in Hindi, which is a  language spoken by many Indians. Availability of IOHK videos and other Cardano related information in Hindi will definitely help the Cardano's cause in India", "q0r": 5, "q1": "The proposal is by a strong team with cited LinkedIn profiles.  THe lead has more than 30 years of experience in translation work. The task is pretty risk-free, and the proposers will be able to complete the same. ", "q1r": 5, "q2": "The proposal is for producing 360 Hours of translations at the cost of approx 7500 over a period of three months. Roughly translates to less than 20$ per hour. If the production quality has to be maintained this is a reasonable cost. Since the output will be in the open domain it is highly auditable.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "Proposal is well strucutred with a clear problem statement and an adequate solution. India indeed has a great potential to attract new people is know for the capability of their proffessionals in technoogy and coding. Bringing these people to Cardano will enrich a lot the ecossytem and, for this, it is essential to have content translated in Hindi, which is spoken for about 70% of Indian population and is one of the main languaes in India. This proposal would also potentially address challenge kpis such as \"Increased interaction between Catalyst and Indian focused projects\", \"Number of Indian focused Catalyst submissions\" and \"Number of Indian focused dapps/services actually built\" as it would increase Cardano awareness for those who are not very familiar with english.\nThis, however, brings to the main issue of this proposal. Catalayst process and Cardano ecossystem is still all in english. Having contents translated to Hindi would certainly increase awareness about Cardano but the language barrier for non-english speakers to actively engage with Cardano would still exist and that's the main reason this proposal is not scoring 5. I understand this barrier could be overcomed by other proposals but if the scope of this proposal could be broaden a bit, I'd include an assistance channel to help people translate their proposals from Hindi to English or help with needed spot translation for the target audience to better engage with ecosystem. \nAs other suggestions, I'd better describe here who their target audience is. Is it poor high school students? STEM university students? employees at local tech company? It could be multiple, it would just be nice to have them listed here. I like though that there's a communication plan base on social media in place.\nRisk management is also well done with risks mapped and mitigation plan detailed.\nIf project is successfully implemented, other contents/channels could also be translated in future funds, so proposal is really scalable.", "q0r": 4, "q1": "Proposal is well strucutred with a clear problem statement and an adequate solution. India indeed has a great potential to attract new people is know for the capability of their proffessionals in technoogy and coding. Bringing these people to Cardano will enrich a lot the ecossytem and, for this, it is essential to have content translated in Hindi, which is spoken for about 70% of Indian population and is one of the main languaes in India. This proposal would also potentially address challenge kpis such as \"Increased interaction between Catalyst and Indian focused projects\", \"Number of Indian focused Catalyst submissions\" and \"Number of Indian focused dapps/services actually built\" as it would increase Cardano awareness for those who are not very familiar with english.\nThis, however, brings to the main issue of this proposal. Catalayst process and Cardano ecossystem is still all in english. Having contents translated to Hindi would certainly increase awareness about Cardano but the language barrier for non-english speakers to actively engage with Cardano would still exist and that's the main reason this proposal is not scoring 5. I understand this barrier could be overcomed by other proposals but if the scope of this proposal could be broaden a bit, I'd include an assistance channel to help people translate their proposals from Hindi to English or help with needed spot translation for the target audience to better engage with ecosystem. \nAs other suggestions, I'd better describe here who their target audience is. Is it poor high school students? STEM university students? employees at local tech company? It could be multiple, it would just be nice to have them listed here. I like though that there's a communication plan base on social media in place.\nRisk management is also well done with risks mapped and mitigation plan detailed.\nIf project is successfully implemented, other contents/channels could also be translated in future funds, so proposal is really scalable.", "q1r": 5, "q2": "roadmap is ok and kpis are well selected. I'd just include here targets, even if it were in increase percentage (e.g. grow views at 2% a week from week 2 onwards), though I understand is hard to think about it before it starts. There could also be some ways to collect feedback and measure the number of positive feedbacks to assess video qualities and improve the process. Other suggestion would be to, some how, measure how many Hindi speakers will be submitting proposals because of these videos translation (thats a hard one however).\nDefitintion of success is well done also.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "I highly recommend this project. I consider this proposal challenging as it is very important in bringing Indians into the Cardano community.\n\nThere are 528 million Hindi speakers in the world, making Hindi official for the Cardano Project, making it easier for Indians to learn from their native language. This will add very useful value to the Cardano System community. At the same time develop the community of Indians participating in the Blockchain technology and cryptocurrency market, which will help them benefit from having access to this ecosystem. As such, bringing them into the community will bring great benefits to the community... The solutions proposed by the proponent are intended to educate and develop the Cardano ecosystem in the Hindi-speaking community in India and around the world.\n\nThe release of translated videos in Hindi and Full Translation of IOHK content is phased in, to educate the Hindi community easily and access issues related to the Cardano ecosystem.\nIn addition to translating videos, they also provide a solution to transcribe subtitles on videos, aimed at inaudible audiences.\n \nThe proponent raises many risks, and there are solutions to overcome that risk. It is important that they foresee the risk, and take the initiative to address it.\nSolutions to overcome the risks are also specifically outlined as:\n1. To solve the shortage of interpreters due to the spread of Covid, they can take time off due to being infected, there are backup solutions with translators and masters in interpreting instead.\n2. To overcome currency fluctuations, affecting budgeted costs, the value of ADA may decrease. prices of goods and services increase. The proposed solution is to add a reserve fund of about 10% of the total cost.\n3. On the other hand, to solve the problem of converting ADA to local currency since it is completely dependent on the P2P market of Binance, it is possible to find a reliable network of ADA holders who want to increase their investment. they enter ADA without going through this market. This idea sounds reasonable but just proposed, when put into practice, hope that the group will find a network as mentioned to solve this problem for the community.", "q0r": 5, "q1": "This project provides a detailed and methodical plan, clearly presented, with a time arrangement corresponding to specific goals. Show that the Group has a good preparation.\n\nTotal cost for this project is 7100 USD. Budget given is reasonable, with detailed explanation.\n\nThe human resource team has many years of professional experience, loves the profession, has a specific assignment of responsibilities. Identify identity, personnel information easily on social media such as Linkedin channel, Facebook channel.", "q1r": 5, "q2": "The proposal outlines a roadmap with milestones and a timeline for achievement. For more authenticity, it is recommended that you provide a published video channel that can be checked through your Youtube channels.\n\nHave seen the plan and goals for the project clearly. However, the project is still in the process of implementation and is in the testing process. We'd love to see a translation and the specific video you've made would be much more practical.\n\nThis is a new proposal. Great idea, actively contribute to the development of the Cardano community. Hopefully, with your passion, enthusiasm, and knowledge, it will bring success if this proposal is considered for disbursement this time.", "q2r": 5, "assessor": "z_assessor_1534", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "Translating, transcribing and subtitling all the video content of IOHK, content from Cardano Foundation and Emurgo YT channels to Hindi is a proposal that definitively can increase awareness of Hindi speaking population about Cardano community, ecosystem and Project Catalyst which could raise interaction between Catalyst and Indian focused projects and bring more such Catalyst submissions. Eventually, the result of this project can indirectly bring to building of Indian focused dapps and services as well. That perfectly meets the challenge settings.\n\nKey metrics and goals of the challenge are addressed and the value added to Cardano system is clearly visible. If funded and successful, this project is easily scalable and more valuable content can be translated.", "q0r": 4, "q1": "By presented resumes, the team is overqualified for this job and is likely to be successful in achieving the proposal’s plan; translating, transcribing, titling and dubbing 120 min of videos per month and releasing it on YT channel. However, the proposer has made a number of exactly the same proposals for different languages native to India. More transparent way to apply would be with a single project that addresses all the languages addressed in all those different proposals. The reason for that is to make the assessment of successful implementation easier for the CA's.\n\nBudget is reasonable for the amount of work needed to complete the Milestones which are presented on a realistic Timetable which gives the team enough time to learn and deliver. Budget brake down is simple and understandable. Challenges and risks for the implementation are diagnosed, defined and the solutions are well presented.\n\nAgain, I am not sure that if all or some of the proposer's applications are funded, the team could meet their milestones. ", "q1r": 3, "q2": "The project targeted problem as lack of video content understandable to Hindi speaking population and presented the solution as translating, transcribing, dubbing and subtitling the high quality video content from IOHK, Cardano Foundation and Emurgo YT channels. \n\nThe plan is clearly presented and achievement of goals (solution) is easy to measure and control. Auditing should be simple and easy because all the Milestones on a Timeline are clearly set and the work itself (the goal of the project) will be presented on a public YT channel.\n\nKPIs are easily measurable through YT channel and are well presented within the proposal.", "q2r": 5, "assessor": "z_assessor_1781", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "There are about 528 million Hindi speakers in India and around the world, but currently the Cardano project does not have Hindi so Hindi speakers cannot learn in their language. The proposal would provide translated videos in Hindi so that the Hindi-speaking community would stay up to date with news and current affairs related to the Cardano project. The proposal proposes to translate the entire content of IOHK in phases, the content will be transcribed and subtitles provided for those who cannot hear it. As such, it will increase the number of Indians entering the Cardano community, in line with the challenge's objective.", "q0r": 5, "q1": "The project takes place in 3 months: the first month, launching the channel and completing 120 minutes of video; second month, running a social media campaign and continuing to produce 120 minutes of video; 3rd month, continued production of 120 minutes of videos and social media campaigns.\nIn my opinion, the video length given by IOHK is large, while the team has only released 120 minutes of video a month, so it may not be able to update all the information that IOHK gives about the Cardano project. Therefore, the team should increase the number of videos produced monthly to meet the amount of information that IOHK gives out, thereby providing complete information to the audience, attracting Hindi speaking Indians to the Cardano community.\nEstimated cost for the project is $ 7,100, including cost of transcription, dubbing, editing, publishing for 15 thousand words per month (unit price of 0.08 USD/word), for 3 months is $ 3,600, cost social media $1,500, provision costs $2,000.\nThe team hasn't detailed what the $1,500 social media costs are for specific jobs; The provisioning cost of $2,000 is high because in the risk section above the group shows that the provision is only 10% of the total cost, 10% of the total cost iThe project implementation team consists of 4 people, with members who are capable, experienced in translation, translation processing, members are members of the Catalyst community, CA for Fund 6, 7... project can be done easily only $ 510.\n", "q1r": 4, "q2": "The project has specific KPIs which are: Number of followers of LanCardano Youtube Channel, Average number of views per video, Number of hours watched, Number of comments, Number of shares, Number of downloads. And every month has a specific video length for each month, so the community can check the project easily.", "q2r": 5, "assessor": "z_assessor_1768", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "The proposer rightly addresses the need for translation of IOHK videos into a regional language. The videos in Native language can better convey the message to the needful and hence popularize Cardano.The impact of the proposal would be considerable in reaching more than 550 million Hindi speakers in India and around the world.", "q0r": 4, "q1": "Rishantha Welikadage: MBA in business management from Australia===== Muthiah Duraisamy:LinkedIn profile mentions of \"Freelance Trilingual Translator at Home\".=====Dimitri Fernando-LinkedIn profile mentions \"CEO at Enigma Private Limited\" since 1996.===== Chamarie Ranasinghe-LinkedIn details not provided. The experience of the people involved should be enough to achieve all the goals of the proposal in terms of business management. The stated 30 years of experience of Muthiah Duraisamy in the field of translation should be enough to execute the tasks involved with respect to high quaity translations. Contingency fees could have been much lower for a 3month project also considering value of $2000 in terms of Srilankan/Indian Rupee.", "q1r": 4, "q2": "The deliverables are 360 minutes of translated videos in 3 months(15k words*3months or 120minures/month*3). A specific target number should have been mentioned for the metrics of followers/views/watching-hours/engagements considering $1500 being allocated for Social Media Campaign.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "Since people always love to learn all the new things in their native language, which will help them to have clear idea on the subject ,this proposal will be effectively addresses such challenge.\nSince there are 528 mn people speaking hindi ,they are huge group of people to capture the market ,where all these people will learn about the projects of block chain in more effective manner and definitely show interest in investing future cardano projects. hence This proposal effectively addresses the challenge", "q0r": 5, "q1": "As translation model in YouTube videos definitely wont be much difficulty, which has very less chances of getting failure with \n people like Muttiah Duraiswamy who has Over 30 years experience in Ministry of Languages as Official Languages translator, it will be an easy goal to achieve.\nWith the details of all veterans provided , presented data is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "This proposal has clearly mentioned about survey of Hindi speaking people and has provided the details of people who are working on this.\nThis proposal has clear budget breaking ,roadmap details and definitely provided excellent SDG goals for its success. It also has explained with what time duration videos will be provided for the audience with clearer idea hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "The project brings up the issue of a lack of officially sanctioned Hindi content. As a result, Thai speakers cannot learn in their native tongue. There are 525 million Hindi speakers on the planet. Genuine, this problem may never be solved because new people join the group all the time, and it will be impossible to reach them all. The project's answer is only available to a limited number of people, yet it is a valuable solution that can somewhat help solve the problem.", "q0r": 4, "q1": "The initiative's originator has extensive experience in translation, which will be highly beneficial to the project. This is a crucial step in increasing the chances of a project's success. Furthermore, the project includes a detailed blueprint. Given the timeframes, I feel the project can be completed effectively and on time. I admire how the initiative gathers such comprehensive and precise data.", "q1r": 5, "q2": "Projects use a variety of methods to track their progress. I believe that project participants can trust the project's transparency and the project team's implementation process because metrics such as the number of videos and video views are always visible. Furthermore, the project establishes KPIs to track progress and promote transparency. These KPIs have a lot of flexibility, which I like. The participants will have a reason to believe in the team's ability to implement the project effectively based on those KPIs.", "q2r": 5, "assessor": "z_assessor_1710", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "The project has the ability to significantly increase Hindi speakers' awareness of the Cardano ecosystem by offering translated videos. The proposal gives statistics on the number of Hindi speakers, but I believe the proposal could also include further analysis on the degree of blockchain comprehension of Hindi speakers. If there is a lack of awareness of blockchain technology, generating blockchain tutorials should be prioritized before creating information regarding the Cardano environment. This will make better impact on the community.", "q0r": 4, "q1": "Proposer provides practical data on the number of translated videos uploaded each month, as well as the length of the videos. A well-defined timetable and output are prescribed. I'd want to know more about the specific content of each video in order to properly evaluate whether or not the audience will gain appropriate fundamental understanding of Cardano ecosystem. The information about team members is clear and trustworthy, with LinkedIn profiles attached; the team as a whole has extensive expertise in both Cardano and translation. However, there is no information on the marketing campaign to attract audience.", "q1r": 4, "q2": "Proposer provides a detailed roadmap with specific milestones for better progress tracking. About KPIs and metrics, the number of comments is a good metric but sometimes misunderstanding in case all of the comments are negative. \nSome metrics I would recommend adding: \n- The ratio between positive and negative comments/feedback from audience. \n- The view rate between videos (increasing/decreasing)", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "India is a diverse country and has a lot of languages throughout the countries. In order to effectively market or spread the knowledge on Cardano to all the people of the country, translation of the content of Cardona to local language is required and is the most effective way to reach a larger group of people. In this case, the local language would be Hindi, which is very huge community in India and they are very proud of the language. Hence translating the contents of Cardano in Hindi would reach a lot more people than expected and also be appreciated for translating into Hindi. Many of the people in India are educated in their local language and might face difficulties in English, by translating the content to Hindi it would benefit a lot of people in getting familiar with Cardano and also the advancements of it. The proposer has effectively addressed the challenge and I strongly believe this application will be a success to Cardano as it will be reach more people and more people will be knowledgeable through this with the comfort of learning in their own language. It is also a scalable project and could go global benefiting Cardona on a large scale.", "q0r": 5, "q1": "The proposer has a roadmap on how to implement the project as he has mentioned that he will be uploading a new video every 3 days in the Hindi language and hence by uploading the Cardona content in the Hindi language on a regular interval of time would attract more viewers and gain more subscribers. It would also be helping a lot of people educate about Cardano in a better way. This whole together will be indeed bringing a new community to the Cardona, once someone sees the content in Hindi they will be more likely to promote the videos on their own to friends and family to watch them and it will be of a better reach. The experience of proposer and his team seems to be very impressive and the proposal is likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has requested 7100 USD as funds to implement this project and he has also provided the breakup cost that will be spent on each individual requirement which seems fair. The proposer has also projected the funds for next 3 months and the money requested will be sufficient to audit the progress. The proposal is most likely to succeed as it going to reach over a community of 528 million Hindi speaking individuals, which is a huge number. It will be very useful in reaching Cardona into the Indian market by translating the content into regional languages and the reach will be more than expected in the future days. The proposer has also foreseen the difficulties they might face while implementation and also has alternative solutions for the same.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "The problem that the proposal raises is that in India, there are 528 million people speaking Hindi, but there is a lack of Cardano content in Hindi. The solution they came up with is to provide translated Hindi videos about the Cardano ecosystem and IOHK content. With such a solution will have a great impact on the people of India and fit the challenge. The proposal also introduces the risk that the price of ADA will fluctuate sharply and hedges by storing extra funds for it.", "q0r": 4, "q1": "The roadmap of the project is clear. The implementation time is 3 months, the project is completed with about 10 to 20 videos, the total length of 360 minutes of video is little compared to the amount of information that IOHK, Emurgo and Cardano Foundation bring to the Cardano community. If possible, the project should add more funding and time to the project to bring more information to the Indian people. Team members are experienced, and have links that prove the transparency of personal information. With this group of personnel, I believe that the project will be successful.", "q1r": 4, "q2": "Good auditability with clear roadmap is 120 minutes of video per month. KPIs like channel followers, average views, hours watched, shares... are metrics that are relevant to challenge and can be measured.", "q2r": 4, "assessor": "z_assessor_1632", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"q0": "(please be aware that there are a total of 19 proposals like this one submitted in Fund 8. So I give them the same rating and comment for this Hindi proposal)\nThis proposal aims to translate Cardano related content videos into Hindi language. There are a total of 19 proposals almost identical. They are the same proposer, the same applied fund, the same contents. The differences are the language and the number of the speakers. The languages are: Urdu, Odia, Tamil, Hindi, Marathi, Punjabi, Bhojpuri, Gujarati, Bengali, Kannada, Malayalam, Telugu, Nepali, Assamese, Sinhala, Burmese, Khmer (Cambodian), Thai, Laotian. By attracting more Hindi speakers to the Cardano community, this proposal itself is within the scope of the challenge. However I recommend that the proposer could combine his all 19 proposals into a single one. I rate 3 stars for this proposal since it could address the challenge but 19 similar ones would not be acceptable", "q0r": 3, "q1": "(please be aware that there are a total of 19 proposals like this one submitted in Fund 8. So I give them the same rating and comment for this Hindi proposal)\nThe proposal lays out a detailed schedule for a three-month period. The quantity of work, the goals, and the budgets are all displayed in a very professional and experienced manner. They have a core staff of four experienced individuals. The information supplied demonstrates that they have the necessary experience to do the job. However, because the primary responsibility of this position is to translate text from English to Hindi, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network. They also should indicate their internal quality control process. It is necessary for academic as well as technical videos from sources like IOHK. Normally, the translators don’t have much knowledge and experience on cryptocurrencies Cardano ecosystem. There should be someone better to review the content before publicizing it to the community.  Expense per transcripted word is a reasonable option for the needed fund. They should, however, provide more information regarding the $1500 Social Media Campaign. The $2000 contingency charge is still excessive. \nThe proposal itself has a good chance of success. The proposer, on the other hand, submitted dozens of ideas to Fund 8. It would be very tough for him to finish all of them. So I don’t agree that the proposal will be implemented successfully.", "q1r": 2, "q2": "(please be aware that there are a total of 19 proposals like this one submitted in Fund 8. So I give them the same rating and comment for this Hindi proposal)\nThe proposal includes a clear roadmap with milestones and deadlines. The progress could be checked through their Youtube channel. The KPI for the quantity of the work is quite clear in number: 120 minutes of video per month. There are also KPIs for video quality such as number of followers, number of views. They are all measurable and easy to check via the proposal’s Youtube channel. However, there is also no information on internal quality control to ensure the quality of the content. How could they improve the quality of the video? It should be audited by the community before the project starts. There is some improvement needed, so 4 stars from me.", "q2r": 4, "assessor": "z_assessor_1588", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "This has to be filtered out.  So many reasons..\nCombining into one proposal may make sense to this proposer who may not be from India and recognize the huge diversity from state to state or region to region. All languages cannot be done by same people or same social media campaign.  This is why we broke up. Smaller proposals enable people to clearly see we are not here to grab money.   Each language needs its unique Social media campaign to reach people.  We cannot lump everything into one. \n\nThe assessor has not read the proposal. It states clearly. \nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of Tamil both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nSome specific statements that are absolute nonsense=\nHowever, because the primary responsibility of this position is to translate text from English to Tamil, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network.   As stated we have been doing projects for over 25 years. The definition of Master translator if this assessor doesn't understand is a MASTER OF HIS CRAFT.  A SENIOR IN THE INDUSTRY.   Each one will have different qualifications.  As for our specific master translator, he is the ONLY ONE IN SRI LANKA to write for the Mahawamsa which is like the BIBLE OF HISTORY of SRI LANKA for over 4000 years. It has been written from the time of kings.  This is a role that he alone in Sri Lanka has. So this assessor is talking nonsense\n\nHe states \"Normally, the translator don't have much knowledge and experience on cryptocurrencies Cardano ecosystem. \"  We have knowledge of the product. How does the assessor know what knowledge our team has? He is assuming out of complete ignorance.   Who else is he expecting to review their work? Someone from IOG?   This is utter rubbish being talked \nThe assessor has been influenced by IGNORANT GROUP THINK set in place by certain malicious CAs who seek to influence these CAs with rubbish instead of reading the proposal carefully since all facts are stated there. IF anything was still unclear I am a CA myself and was easily accessible through the CA chat or my own TG. Therefore please filter this out as its a malicious effort to bring down the proposal through ignorance.\n"}, {"q0": "Proposal to provide videos in Hindi to Indians. This is not a new idea but it is a necessity in introducing Cardano, Catalyst to India. The proposal is suitable for the content of the Challenge given. Proposal to contribute to building Cardano community in India- A country with a young population and positive adoption of blockchain. \nHowever, I think you should specify how to spread these post-translation videos to Indians. Because if you just translate and post it on a Youtube channel without many followers and views, you will not attract the community. The marketing campaign to create a video community should also be detailed in more detail.", "q0r": 4, "q1": "Team members are mentioned a lot of experience but I don't see that in the attached Linkedin links. You should provide qualifications and documents related to experience so that the CA can see the necessary experience and skills to implement this proposal.\nRegarding the budget, the budget contains a summary of the cost items. However, I see the provision expense is 2000 USD, accounting for 28% of the total Budget. This cost is more than the cost of translating 15,000 words. I find it unreasonable.", "q1r": 2, "q2": "The project has a 3-month implementation schedule. Each month translates 120 minutes of video. The topic and content of the video have not been specifically listed. \nThere is no specific KPI to determine the success of a proposal. For example, there is no expected number of Youtube channel followers, expected views, expected watch hours, expected shares... Thus, the community, Catalyst cannot check the project efficiency will bring through estimation. It is impossible to know how much the project will carry out the marketing campaign with the expected results or not. I think you should add specific indicators to increase the persuasion of the project and the motivation for your team.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "\nThe assessor has been influenced by IGNORANT GROUP THINK set in place by certain malicious CAs who seek to influence these CAs with rubbish instead of reading the proposal carefully since all facts are stated there. IF anything was still unclear I am a CA myself and was easily accessible through the CA chat or my own TG. Therefore please filter this out as its a malicious effort to bring down the proposal through ignorance.\n\nSo many things he says make no sense.  \"Because if you just translate and post it on a Youtube channel without many followers and views, you will not attract the community. The marketing campaign to create a video community should also be detailed in more detail.\"  We have mentioned we are going to carry out a social media campaigh. Until we get the funding we dont need to go into great detail.  Has any of the other proposers he has assessed gone into detail as to how much they are going to spend on each platform, what campaigns they are going to use, and how they will plan the campaign?  Of course not.  I have assessed in this round and earlier and I have not seen that level of detail at this stage in the process. So asking for this from me shows a deeper hidden bias.\nTHerefore please filter this out."}], "solution": "Provide translated videos in Hindi about Cardano ecosystem. Translate the entire content of IOHK . Also transcribed, and subtitles offered.", "experience": "1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n+ 1995 to 2022 - 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\n\nOver 30 years experience in Ministry of Languages as Official Languages translator."}