{"id": 398927, "author": "konmaorg", "title": "Cardano India Tribe - Konmahood", "url": "https://cardano.ideascale.com/a/dtd/398927-48088", "category": 26454, "amount": 28700, "description": "There are no active communities in India that are dedicated to Blockchain and Cardano in specific.", "f6_no_assessments": 8, "f6_rating": 3.7916666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 7351, "q0": "In short, the idea of ​​this proposal is to create a community that brings together blockchain enthusiasts, people who are still new to the technologies of our ecosystem and some more experienced members. This group would be called “Cardano India”, and from what I understand it aims to guide the local public in the country about our ecosystem in various ways. I found it very positive as the author explores all the facets that this initiative would have, such as the forum, through which the members of the group would communicate. It would be even more interesting if the bidder determined which platform would be used as a forum. It is also interesting how the larger group would be divided into tribes, as this could increase the chance of greater interaction between the members of the respective tribes, as they would have common interests and areas of activity. The other features presented (voting system, content streaming, peer-to-peer communication, event hosting and course offerings) are also well explained, so we have a very solid understanding of everything that will make up this very multifaceted project. During my reading of the proposal, I thought that there would be many activities, of many natures, being done by many different people, and this would make it difficult to understand what would actually be done on a day-to-day basis at Cardano India. However, the proponent dedicates a topic specifically to explain what would happen there, in “WHAT DOES THE CARDANO INDIA TRIBO DO?”. Soon, my doubts were cleared. It is also super positive as the author of the proposal already makes it clear exactly who would be the target audience of this project, from university students to startup members. Anyway, I think it's a very complete proposal, which meets the challenge's objectives very well and is perfect, at least in terms of impact. In this challenge we are looking for ways to expand the Cardano ecosystem to the inhabitants of India, with the goals of a) benefiting our blockchain, making it more popular, increasing investment in our currency and our applications (Dapps) for example, growing the number of hubs, DAOs, CNFTs in circulation and other ways that we could verify the real adoption of Cardano b) it is also intended that the Indian population benefits from these projects. This can be done through education, that is, we educate the natives about our technologies, giving them the possibility to work with Cardano on technology projects. Even, that they obtain the necessary knowledge to live CAs and VCAs, which generates a very considerable, albeit unstable, extra income. Anyway, I believe this proposal meets all the small goals, deserving the maximum score in impact. \n\n", "q0r": 5, "q1": "Regarding feasibility, I will start by saying that I will be a little demanding in my analysis due to the fact that the proposal is very ambitious, as I explained, many activities are promised, so it is naturally difficult for all of this to be carried out in the optimally and within ideal timeframes. Regarding the script, I think that the time of 1 month (which would be April) is quite short for something so big to be built, and it is not clear if this would just be the beginning of the realization of the project, if it would still be necessary more work after that April period. However, regarding the explanations about this month, I think that what is provided is very positive, as the exact activities for each week are detailed. In this way, we have a well-completed view of everything that would need to be done for the idea to move from the theoretical field to the practical field (at least in the first month of construction). It's also very positive how the proposer sets out what would be possible to deliver at this point in development, so, as with the impact with setting the goals, we have a very solid understanding of the objectives of the proposal. Now talking about the budget breakdown, this part left a little to be desired in my view. The total amount of $28,700 was actually split into parts. However, each of them should have been better explained. For example, let's guide ourselves on the first part of using the money: “Rewards and Incentives for Hosting Hackathons and Competitions - $5,000”. How would these rewards be distributed? How many people would get them? So what approximate value do they intend to set for each reward? In the following part “Developing multilingual resources (video, audio, text documents) - $1,000 / language I, and 5 languages ​​x $1,000 = $5,000”; why would each language cost 1000 dollars? How much would go to video, and to audio, and to text documents? I think that, really, the first parts of the budget needed more detail so that they could be fully understood. The other parts, which relate to the payment of the professionals involved, are explained in a richer and more detailed way, as the price of each hour of work is informed. Therefore, ideally, the same level of detail would be available for all pieces of the budget. Finally, speaking of the team, I think this part is very good because all the necessary information is provided so that we can understand who we are dealing with. We know the names of the professionals involved, as well as a short summary of their professional assignments and their linkedin profiles. This gives a lot of confidence in the team. Therefore, I think the feasibility is already good, with only a few points to improve. \n", "q1r": 4, "q2": "The proposer defines several ways in which the proposal development process can be followed. For example, through “tribe growth reports” as well as “reports on a number of tribe members who apply to become Proponents, Voters and CAs”, in addition to “Member Feedback in the form of polls”. I understand that some of the feedback from members of this community will be picked up and analyzed internally, and that's okay. However, regarding the cited reports, how will they reach the members of the Cardano community? It would be necessary for the proponent to explain exactly on which platform he would make them available (either in the discord or telegram groups of the community, by email, through online applications such as Notion, Miro, Google Docs and several others) and also how often they would be posted. In fact, I believe this is my only observation about the auditability of the process, because the proponent already demonstrates that he will keep the Cardano community up to date, which is the crux of the matter, he just needed to better explain how this would be done. Now talking about the final results, I think that we have numerous ways to audit the success because, during the detailing of the proposal, the proposer informs us of many, many KPIs and possible results to be delivered. Therefore, there is no lack of materials to be used as a guide for auditability. In the final part of the breakdown of his proposal, he explains that the ultimate goal is “to reach people from all parts of India and communicate about blockchain and Cardano in the simplest way”. If he hadn't provided ways in which this could be measured, I would say that his proposed scenario still seems a bit abstract, and therefore more detail would be needed. However, as I've said before, it offers us more objective ways of perceiving this bigger picture. Ultimately, what needs to be established again is how the link between these results and the Cardano community would take place. As it is a very large project with many people participating, I think it would be entirely possible for a select group of Cardano India members to gather all this information and make it accessible to the Cardano community, through one of the several platforms I suggested earlier. . Therefore, I think that, as well as the feasibility, the auditability of the proposal is good, just needing some clarification as to how we could all have access to the audited information. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 1575, "q0": "The problem statement is itself problematic, needing unpacking. Saying there are “no communities in India that are dedicated to Blockchain and Cardano in specific” is both not obviously true and not obviously a problem, for an ecosystem committed to decentralization.  ***********\n\nThe definition of “communities” is important to assessing Impact because their argument is that using their platform is essential or highly desirable for groups of people pursuing interest in blockchain and Cardano. However obviously many platforms exist, the platform per se won’t be a decisive factor. They seem to mean, “community-type i.e. social media software” when they say “communities.”\nAlso they don’t appear to be creating a platform “dedicated” to Cardano, at least not in the sense IdeaScale is dedicated to Cardano. This group seems to be developing a more general social network program, which is great. But the argument that their platform per se is needed doesn’t hold water. Also, if e.e. their training material unavailable/only available on their platform? That’d be a risk for Cardano. \nAll in all it’s not that clear what the impact would be.\n", "q0r": 3, "q1": "Implied goal is to create “an active community in India that is dedicated to Blockchain and Cardano in specific.” So Feasibility needs to be thought of not how their platform could be used to support community, but whether they can create community by virtue of their platform’s awesomeness. \nThey present a number of good ideas about how a platform like theirs could be used for Cardano education and community building. Unfortunately there’s no compelling logic presented as to why and how users will be attracted to their platform, and whether using it per se will create a community around blockchain and Cardano.\nRegarding course offerings, this appears to be an after-thought and therefore unlikely to produce a significant impact. I.e. what topics would they cover, what background do their instructors have and other questions aren’t addressed. Also producing materials in five different languages would require a specialized  team  and workflow in itself, not presented. \n\nLIkely the biggest challenge would be bringing users to their platform; this challenge isn’t addressed at all. On that note, a suggestion to the team would be, “to divide the target group based on accessibility, level of understanding and languages and communicating on different levels over a period of time.” is probably a good idea, perhaps focusing on the segmentation groups they specify in their Intended Audience section.\n\nThe team looks strong in professional abilities and interest and knowledge of blockchain and Cardano. However advertising/promotion, and educational development would be two presumably key competency sets and these are both lacking on the team. Or at least they’re understated.\n", "q1r": 2, "q2": "The metrics and milestones are logical and suggest multiple measures, which is good. The budget is problematic though. Most items need clarification with more detai.\n“Rewards & Incentives for hosting Hackathons and Competitions, $ 5000” How many events paid, at what rate?\n \nCardano India Tribe Maintenance (Frontend & Backend Maintenance) - $ 2700\nSo Cardano would pay for them to develop their platform when other tools already exist?\n \nMulti-Lingual resource development (Video, Audio, Text docs) - $ 1000 / language I,e 5 languages x $1000 = $ 5000\nWho would do what and how, for how long, at what rate?\n \nRemuneration for Community Managers\nWho would do what and how, for how long, at what rate?\nClubhouse & Spaces Event Moderators (2 moderators) - $ 50/ hour/moderator; 3 hours/week for 3 months\n$50 x 3 x 12 x 2= $ 3600\nWhat would they be doing? Would the number of users warrant this?\n \nWorkshop Trainers (2 trainers) - $ 75/hour/trainer (each workshop will be for 2 hours); 4 workshops/month for 3 months\n$ 75 x 2 x 12 x 2 = $ 3600\nTraining in what? Social Media Content Creation (Posts, videos) - $ 2800 (3 months content)\nWhere? By whom?\n \nTargeted Marketing - $ 3000\nWhere, by whom, and with what measures?\n", "q2r": 2, "assessor": "z_assessor_1391", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 3075, "q0": "The aim of this proposal is to establish a platform on which to build a community forum for the people of India. By establishing this community forum, a community will try to be built. It is difficult to build a community without building a large advertising campaign beforehand. I think that before we can really invest in this project, there must be first enough people present. There are many similar projects that aim to do roughly the same thing. Challenges have been included in the proposal, but no possible solutions have been offered. The goal is to hire approximately 150 new members. This will not have a major impact on the Cardano ecosystem.", "q0r": 2, "q1": "The relevant experience of the team is clearly reflected in the proposal. The team comprises a whole that can elaborate this proposal. The people in this team can clearly be screened. There is a budget overview showing the costs of the project. There is a good overview of the working hours that the people from this project are paid. I think the budget is very big. I think it's better to lower the rewards because some people will join just to earn the rewards. The proposal offers a clear timetable. I think a lot more time will have to be spent on promoting. You can convince people by showing successful existing projects on Cardano. I would spread the implementation plan over a longer period so that there is more time to attract people. It is good that this will be performed in different languages to reach a wider audience. It is also clearly described what will happen in the tribal system.", "q1r": 2, "q2": "There will be clear statistics where the team can see if that project is successful or not. There is a roadmap in place that is very limited and should include much more detail with what will happen during this period. Useful KPIs that allow tracing whether the project has been successful or not are included. It's good that the community can view these statistics as well. The proposal offers a solution to the requested problem, but in my view a too small group is being addressed to make this a success.", "q2r": 3, "assessor": "z_assessor_1606", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3479, "q0": "The proposal mentioned clearly the ideas of creating the forum as the dynamic community for non-active community in India to learn and dedicate to Blockchain and Cardano.  The proposed solutions were described in detailed, from the period of forming idea to developing various features in the community which are ready to serve to various people in the community. The features were explained concretely, with information regarding to beneficiaries of each feature. This point is prepared excellently by the proposer. \nAlthough the beautiful idea of this proposed solutions and its intention, the metrics and KPI of this proposal have not been mentioned with sufficient idea. The idea of KPI and outcome matches with the proposed solution. However, if the proposer can give more quantitative indicators, to show their expectations of achievement, it will become more relevant and persuasive to all readers. \nThere are several risks and challenges mentioned thoroughly by the proposer. They were put not only idea but also include intentions of solving it in the future. It showed the carefulness of the proposer. \nOne strong point of this proposal is the well-consideration of proposer in not only develop their own project but also put attention on how to contribute to Cardano Ecosystem. ", "q0r": 4, "q1": "The roadmap was scheduled by the proposer in such a series of activities in short term, together with the milestone for 3 months. It will be easy for all readers when the proposer add more information about the road map in longer term as the community development couldn’t be done within short time. \nAligning with a series of activities which tends to be organized, the proposer already allocate budget for these activities. It will be easy for readers to follow what and how they want to utilize the budget. On the other hand, the information is still put as activity-based budget, if the proposer can breakdown in more detailed about types of payment, it will show the transparency more. \nThe appreciation points of this proposal is regarding to personnel. They have clear idea of team allocation, with experts from various sectors, who have both experiences and knowledge to contribute to the success of the project", "q1r": 4, "q2": "The project has consider about the outcome which can help all relevant stakeholders be able to measure the progress and the development of the project. However, still it lacks of quantitative indicators, which really show their imagination on scale of achievements and measurable evaluation factors. The proposer can consider to add more information on this part. \nSuccess that aims to achieve by the proposer is quite huge, when they hope it could reach to people from all parts of India and communicates blockchain and Cardano in the simplest way. \nSo far, there was no information on whether this proposal is a continuation of a previously funded project or entirely new ones. The proposer can add some information about it\n", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6838, "q0": "Cardano India Tribe developed on th eKonmanhood, which is a community onlinen forum would allow interested people to join Cardano and earn more about it. That way number of users will grow in India. Which is response to the challenge goal", "q0r": 5, "q1": "I haven't seen a previous connection between the Proposers and the Catalyst project. This doesn't limit them to submit a funding application, but they then have to learn more about how does process go from within.\nGreat idea to use an existing online platform and develop on it a sub-forum ''Cardano India'' The name is simple and understandable, they are already people ready to join and the set-up won't be complicated. This would facilitate the success of this initiative.\nWhat to mention is that the prospers plan is to have the content in five languages,  but the budget allocated to the translation of the content seems low while that's the basis of what will be offered.\nAlso, the service to be used for translation hasn't been mentioned.\nBudget should be reduced and allocated enough funds to the on Rewards & Incentives for hosting Hackathons and Competitions, Cardano India Tribe Maintenance and Multi-Lingual resource development.", "q1r": 3, "q2": "Konmanhood will be used to promote and present the results of this project, and it's through that platform that the community would track the success of it.\nAs for the risks, not having enough funding allocated to the translation work may delay the project. ", "q2r": 3, "assessor": "z_assessor_478", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8057, "q0": "\"The team tells that it is a community forum but I think it's just like a social networking platform with utility functions for community development. This forum will help to connect professionals and enthusiasts come to share their experiences and combine forces. More than just a simple forum, this platform has many useful features like a tribe system to help people centered around the exclusive domains, a voting system to help the community make decision decentralized, or content streamlining to help people easily find the content of their topic, and some other feature that well supports to the community. The proposer provides a very detailed explanation about these features and some of them with the case study that helps us easy to understand. Moreover, the listed detailed benefits and activities that this platform will help the community, and the key KPIs that they provide can help us to know how this project strongly impacts the Cardano ecosystem and align with the challenge settings. \nLast but not least, instead of providing general challenges to the project, they identified some key challenges that I think are very specific and directly impact their target audience - here in India - and all have the mitigation strategy to overcome. I hope that they're can work well to make this idea to be successful. \"", "q0r": 5, "q1": "The roadmap is broken down into weeks with simple outlines but they're all clear to understand what the task is. This roadmap is suitable for what they want to develop that is mentioned in the solution session. And also help to assess that the required budget is reasonable. The great thing is that their budget is broken down into hours to measure. Lastly, their key team members that are provided in the proposal seem enough for developing this project, especially the scope of this proposal. ", "q1r": 5, "q2": "They will provide a dashboard to help measure the metrics that they focus. Their key metrics particularly will show the development of activities of the member in the forum which I believe is the best metric for this phase of development and further. Moreover, the success picture of this project is promising to make a huge impact on the Cardano ecosystem in India, with the increasing adopters, ADA holders, and CAs as they mentioned in the proposal. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8384, "q0": "The proposal solves most problems of the challenge setting and therefore falling well within the challenge setting. The solution is to build Cardano community in India by Boosting the understanding of blockchain, Cardano, Haskell & Plutus; Building a decentralized community; Conducting events like: events, courses, talkshow, ... In addition, some risks are identified and reasonable mitigations provided. In general, the proposal has a great impact on growing India, growing Cardano.", "q0r": 5, "q1": "The project timeline is provided in term of week and sound reasonable. Milestones and deliverable are specified in quantitative manner, increasing the feasibility of the project. Requested budget is broken down into a rough detail and has not been able to justify, yet. For example:  Cardano India Tribe Maintenance (Frontend & Backend Maintenance) - $2,700. It would be easier for assessment if the duration of maintenance is provided (e.g. 3 months; 2 months, or 1 month); the component to be maintained. Besides, team members’ information is provided in details with reference links for verification, if required. The experience and expertise of the founder team are suitable for project development. In short, the project is feasible.", "q1r": 4, "q2": "Project deliverable is provided in a qualitative manner. If the quantitative deliverable is provided, it would be much easier for project audition. For example: Feedback from members in the form of polls. Then, how many feedbacks from members will the project be classified as success should be provided. Similarly, the definition of project success is just qualitative. Quantitative definition should be added for the project to be auditable once it is funded. For example: success would be reaching people from all parts of India and communicating about blockchain and Cardano in the simplest way. Then, the question is how many people does the project approaches to be classified as success should be justified. With all above-mentioned arguments, the auditability of the project is questionable.", "q2r": 3, "assessor": "z_assessor_675", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8943, "q0": "The idea is interesting, about to create Cardano community in India with an existing community forum named Konmahood. The proposal definitely fits into the challenge as well as adds value to Cardano ecosystem, because the community would allow people in India have a place to learn about Cardano, to connect, share and support each other in Cardano engagement. If it is successful, the proposal will help to increase number of new members onboarding, number of active members (CAs, vCAs, voters, developers,ect) and number of proposals from India community.\nI found the author proposes this existing forum (Konmahood – the same link) to create another community hub in Malaysia in the proposal “Cardano Malaysia Community” with link following:\nhttps://cardano.ideascale.com/c/idea/398931 \nand the link of this proposal here:\nhttps://cardano.ideascale.com/c/idea/398927\nI would like to ask: if these two proposals will get funded, is it possible to create 2 community hubs in India and in Malaysia on the same forum? (link the forum included https://linktr.ee/konma )\nThis is just my bonus question, I still agree this proposal is impactful.", "q0r": 5, "q1": "The proposers explain about the plan in details in a timeline 3 months with budget breakdown and information of the proposer for us to assess the feasibility of the project: Regarding to the plan, we can see what needs to be done in each of months in a period 3 months. The financial amount is broken down in details and explained very reasonable, which allows us to understand what needs to be spend money on, and how much it costs. Maybe there is a typing mistake about the budget in the proposal, because I see the budget is $25700 in the budget breakdown section, but the requested funds is $28700. Regarding to the team’s information, we can see their names, their professional majors, number of experienced years, and their social links where we can know more about them, I believe the project is in the good hands with fulfilling experience and skills relevant to conducting the project. However, I think it would be more benificial if the proposers could provide more information about the contents of “Train the Trainers” program. This is just my bonus for the proposal greater. I still strong agree the proposal is feasible.", "q1r": 5, "q2": "The proposers provide roadmap, milestones and KPIs understandable clearly as well as the section section “What does success for this project look like?”, that allows us to see what need to be measure, which goals the project aims to, and to have a vision of the project as a whole. Besides, all the results will be reported in the existing forum (the link has been  already included), the proposal is definitely auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Leveraging Konmahood, a global community forum to build a strong well-connected community in India", "experience": "We have an existing community platform that has been beta tested with a member count of 80+ from various parts of the world. We have community managers, Train The Trainers and PR specialists in the team who are also multi-lingual from different parts of India."}