{"id": 398928, "author": "konmaorg", "title": "Cardano Green Initiative - India", "url": "https://cardano.ideascale.com/a/dtd/398928-48088", "category": 26454, "amount": 24000, "description": "Humans have a very adverse carbon footprint in our current systems and we need more methods and solutions to sustainably offset them.", "f6_no_assessments": 9, "f6_rating": 3.7407407407407405, "videos": [], "media": [], "f6_assessments": [{"q0": "Project aligns with the objectives of the challenge. If successful it would both grow Cardano's presence and use in India.", "q0r": 4, "q1": "The teams seems to have put a bit of thought into this. They have experience so far with the actual reforestation and mobilizing volunteers portion. I'm not able to verify the haskell skills of the lead dev but the actual work planned seems feasible. My doubts are over the tokenomics which seem a bit unclear with respect to incentivizations to continued invest in the protocol.", "q1r": 3, "q2": "The final three metrics mentions are important. What seems unclear though is what makes it sustainable. I would recommend adding some \"lead\" measures (as opposed to lag measures)--the actual drivers of the purchase behavior. Think about the value buyers of the carbon offset verification tokens will see in aligning themselves with the protocol itself long term. For that the protocol should demonstrate some type of legitimacy or worth that would drive buyers to seek out the tokens. ", "q2r": 3, "assessor": "z_assessor_1171", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The proposal offers an innovative solution to a serious problem, there is no doubt about the impact of the proposal on the environment but there is also the impact on the Cardano ecosystem as the CNFTs stakeholders will start to understand the Cardano blockchain technology and its practical use, I would have liked to read what strategy you will use to mitigate the challenges that you identified for the implementation of the proposal.", "q0r": 4, "q1": "The team members and their skills are clearly identifiable and verifiable, the budget is broken down in detail, 75 usd/hour seems high to me, maybe 50 usd/hour would be good.\nI don't see a plan in case more funds are needed, the timetable seems a bit short for development. I need to explain in more detail the implementation plan and some technical aspects", "q1r": 3, "q2": "problem and solution clearly identifiable and explained.\nI recommend explaining the metrics in greater depth or putting goals in numbers to measure the progress of the project with more precision.", "q2r": 4, "assessor": "z_assessor_1264", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "In this plan, the intention is to link the blockchain technology to the Harithakanthi project that is already underway from last year. This is a nice project, but I don't think it will add value to the Cardano ecosystem. By financing this project, more people will not suddenly become involved with the blockchain technology that exists. Statistics are included in the proposal. It's about how trees are planted and how they can expand, but there's no mention of how people get closer to Cardano. The vision is to plant more trees instead of attracting people to Cardano. Future challenges are included, but they are not linked to the objective.", "q0r": 1, "q1": "Evidence has been provided on the experiences of the makers of this proposal. There is only 1 person in the team who is a blockchain architect. It seems difficult to me to get everything on the Cardano network in this period of time. I think an hourly wage of $75 an hour is a lot. A very limited time frame has been indicated without implementing extensive technical aspects. I think the time frame to implement the proposal is very tight. I would prefer to use a slightly longer time frame and to insert test phases more often. It is not clearly defined what resources are needed to make this proposal run smoothly. I think it's better to raise money through crowdfunding. There are 1200 volunteers who can raise money for the project. The risks are included in the proposal and are linked to the problem statement. I think the marketing phase should not run parallel to the implementation phase. I would work step by step and evaluate each time how everything went.", "q1r": 2, "q2": "There is a plan of what needs to be done. It says that targeted marketing is going to happen (how). The events will last 3 months (what will happen). KPIs that show how much success the project will have have been established. A good KPI is, for example, donations to plant trees. This KPI allows you to keep track of how popular the project is. The proposal clearly describes how the CO2 problem can be tackled locally by means of blockchain technology. I think this project should get a smaller budget to promote the ongoing project. This project can raise the money itself through campaigns.", "q2r": 3, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal solves all the problems posed. For example, the proposer clearly states the introduction, functions, and goals the project is aiming for in the future. Not only that, the proposer also provides additional information to information such as stakeholders, how the project worked initially and how the project connected with Cardano and thereby impacted Cardano and Cardano developers. The team has also recognized the risks that the project may face, the proposer should add a way to deal with it in the shortest time.", "q0r": 5, "q1": "Information related to the plan and timeline is just an outline, not detailed and specific. Proposer should provide additional activities that the team implements in the proposed spints, for example, sharing more information about activities in the 'design' or 'marketing' section. Thus, new voters can easily visualize the project implementation steps. The expenditure budget section is quite good when the information related to salary or other expenses is mentioned, however, if possible, the proposer can also clarify expenses such as 'event' further. Profiles of team members are clearly stated by providing a linkedin link (a reputable job site).", "q1r": 4, "q2": "Proposer has clearly shown the voters the criteria for evaluating the development of the project through key metrics and the approach to project development. Proposer may consider stating the number of goals that the project wants to achieve so that people can see the goals of the project more clearly.", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The idea is great and proposal strucutre leads to a straightfoward comprehesion of the solution for the problem stated, which make sense and does exist. Blockchain and smart contracts can indeed help to address climate change challenges by carbon credit offsetting and this proposal semes to start from an already established intiative and add blockchain as solution to intermediate this carbon credit exchange, which is good and helps to deliver a fast solution, focused on Cardano capabilities and leveraging existing strucutre outside Cardano competencies (trees reforestation), through partnership. \n\nI also appreciate that known and consolidated protocols will be used, such as Konma Carbon Credit Protocol and for carbon calculations. Important to highlight that this project does addresses in a very directly way the UN SDGs mentioned. One question i had in the beggining of the proposal is why India but this is also explained in the proposal.\n\nThe only problem I see here is scale. In order to asses proposal impact in reduction target, it would be important to know what is its total CO2 equivalent reduction (compensation) potential in a yearly basis. Companies nowadays have targets for net zero emission by 2050 of thousands of kt CO2 eq./year and it would be nice to see how much it can contribute with that. Moreover, it could be interesting to know better who is the main target of this proposal (indivuduals, companies/organizations, governments) and how to communicate with them about the project and the App.\n\n It is mentioned however some numbers regarding number of volunteers and number of trees planted so far.\n\nLast, I dont see any problem in this proposal being allocated in msicellaneous challenge but it could also be in others such as \"grow india, grow cardano\", \"developer exossystem\", \"DApp and integration\" and \"business solution\"", "q0r": 4, "q1": "I liked how timeline is broken down in sprint and the deliverables of each sprint is mentioned. it is really an adequate project to apply an agile approach, as it might be necessary constant modification and iteration in the solution and feedback from stakeholders.\n\nbudget breakdown is fair and broken mainly by hours worked, which make sense. \n\nProject team is formed by 4 people already committed with competencies in enviroment/sustainability and blockchain, which are necessary for such project and linkedin links are provided.", "q1r": 5, "q2": "the metrics proposed are really good. I liked the total carbon offset is considered, which is the final objective here. I'd add however, targets, at least for some of them.\n\nIt would also be imporant to see what are the main milestones during the development part of the project.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Great initiative to fight against climate change by offsetting the CO2 through the plantation of trees.\nIts's a direct impact on the Indian's population in particular and the world in general", "q0r": 5, "q1": "The proposal plan is realistic and some actions have already started like the tress plantation of 700,000 tress since 2020 when the initiative kicked off.\nThe team of proposers should have by now a lot of experience and learnings from previous success and challenges that would help them adjust and be able to make this initiative work.\nIncentivizing people and tokenizing  by creating an NFT around this project will encourage a lot of people to take part as it'll be rewarding for them\n", "q1r": 5, "q2": "The progress of the project can be followed by observing these key metrics:\nTotal No. of Trees planted\nMetric tons of Carbon Offset\nTotal No of CNFTs given out\nTotal No of donations received for Plantation\nBut for the community nothing is mentioned on how would they audit this progression for evaluation.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposal calculates the quantity of CO2 absorbed by the planting tree and then mints CNFT containing the geo-location, age of the tree, species, and other relevant information. The CNFT is then provided to company/organization that provides resources for planting trees. The proposal intends to employ DAO to govern the protocol.  Once success, this will raise awareness of people about planting tree and CNFT on Cardano blockchain. Two types of risks are identified but no mitigation solution is provided, making it difficult for founder team when those challenges appear on reality. In short, the proposal effectively impacts the challenge setting.", "q0r": 5, "q1": "The proposed timeline is provided in details in term of 2 weeks and sound reasonable. The requested budget is broken down into details. It should be further broken down into assessable amounts. For example: Events (3 Months) 3,000 USD. How many events in 3 months, where are the locations and what are the contents of the event? Besides, budget for project management and contingency should be provided for the sake of project success. Team members are provided with reference links. However, only a brief description of their expertise and experience is provided. It would be much easier for readers if further information about the founder team is presented. Besides, the experience and expertise of founder team are suitable for project development. In short, I agree that the project is feasible.", "q1r": 4, "q2": "Measurement of project progress is provided. However, quantification numbers should be provided for the audition purposes. For example, project success is defined as: Donations to plant trees. Then, the question is How much donations to plant trees will the project be considered success? Milestones for project success should be provided so that it can be tracked later on once the project is funded. Furthermore, the project has not been launched on testing yet, retaining the chance for project success. In combination, with all above-mentioned arguments, the audibility of the project is still questionable.", "q2r": 3, "assessor": "z_assessor_675", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "A green initiative in India, involving joint projects with the armed forces, schools, colleges and local planting organizations, are an effective way to get more Catalyst visibility and Cardano use cases in India and in turn encourage Indian users and follow-on proposals. Despite some reservations about the team and claims made, the idea as such is good and involves a large number of different stakeholders. I see possible impact as high if the project can be carried out successfully, something that I address under Feasibility/likelihood of successful implementation (below).", "q0r": 4, "q1": "Konma have according to their social media and web presence been around for 4 years, but have only gathered a following of 200 or so since inception. A planned/advertised online marketplace, social impact community, IT business etc. are diversifying the founders' resources but do not seem to have created meaningful traction. Against this somewhat unconvincing profile stand 18 proposals in Catalyst funds 7 and 8 and the request for a total of several 100,000 dollars in funding across challenge categories. The proposers listed do not have significant business experience prior to Konma and I cannot agree that I find it highly likely that the project can be carried out successfully. Even though it addresses a relevant problem of our times and may be a good idea in general, the lack of a credible roadmap or concrete business plan are a negative for assessing this project. A lot of references are made to high-level concepts like Kyoto Protocol, climate change and so on, but the claims of 700,000 trees planted and 1200 volunteers cannot be verified, are not backed up by links or attachments, and have failed to convince me personally.\nThe team mentions companies buying carbon offsets from them, but do not demonstrate knowledge of existing competitors or legal status in India, taxation, accreditation etc.\nA lot of time is dedicated to creating and implementing an Oracle without exploring existing Oracle's solutions or explaining why it is so important for green NFTs, or why the Konma Carbon Credit Protocol (KCCP) based on the Kyoto Protocol is a part of the project at all given that the UN Kyoto Protocol has been discontinued and the whole concept would work perfectly without it or the need for oracle feeds.", "q1r": 1, "q2": "In contrast to the long proposal's previous two sections using a lot of broad concepts and marketing speak, Auditability is given very little attention and a few vague possible KPIs are not explained or backed up by targets, figures or a timeline. It would have been useful to see other Konma requests for funding and how they complement outreach or create conflict with available resources. I am not sure how the project can be audited should it receive funding.\n", "q2r": 2, "assessor": "z_assessor_696", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This is a very practical initiative. It gives the idea of offset carbon by creating a green cover across India's defense protected areas through an ongoing project: Harithakanthi. Besides, it also creates awareness about climate emergencies and also the actions each individual can take by participating as a Cardano Stakeholder. By bringing its operations on-chain to ensure transparency and auditability, it can significant impact the Cardano adaption, contributing to the development of the Cardano ecosystem.", "q0r": 5, "q1": "The team you provide consists of 4 members: 1 blockchain architect, 1 CEO of Konma Labz, 1 Permaculture Expert, 1 Environmentalist, Founder TREES. I have accessed the contacts you provided, after reading their profiles, I find that they have enough knowledge, skills and experience to carry out this project.\nA 3-month roadmap has been provided, the tasks to be done are also listed, but it is not really specific. I think you should be more clear about what you will do, for example: how will you market (via facebook, telegram or other media),... . The budget has been determined and allocated based on the number of hours worked and the hourly wage. Criteria for measuring project progress and development were also provided. However, in my opinion, providing specific metrics would be easier for CAs to gauge its success. For example: after 3 months, the total number of trees planted is 500,000 trees,...", "q1r": 4, "q2": "Information about this project has been provided quite complete. In addition, I think you need to clarify the issues that I mentioned in the previous section (more clarification on the roadmap and tasks to be done, additional KPIs,...), to increase more convincing, making it easier for people to make predictions about the success of this project.\nThe idea of ​​this project is very good, it takes advantage of blockchain technology tobuild an integrated planting management platform for plantation drive, the system allows to gather ground-level data and manage the plantation more effectively. Besides, calculate the amount of CO2 that trees absorb and the amount of O2 produced, based on that to mint $KCCP tokens.\nMyself and a member of the Cardano ecosystem, in particular, I am very interested in environmental issues. I really hope this project can be done successfully, thank you!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We intend to offset carbon by creating a green cover across India's defence protected areas through our ongoing project: Harithakanthi.", "experience": "We are associated with an organization called TREES (Trust for Restoring Environment and Empowering Society), led by Mr Srikumar, an environmentalist. Haskell developers and Full-stack developers back our team to support the project."}