{"id": 399066, "author": "sarod.sasidharan", "title": "Cardano coffee - Regional languages", "url": "https://cardano.ideascale.com/a/dtd/399066-48088", "category": 26454, "amount": 29750, "description": "India is a multilingual country where a large section of the population speak and understand just their mother tongue.", "funded": 2, "upvotes": 75597379, "downvotes": 13299547, "votes_result": 62297832, "votes_cast": 305, "f6_no_assessments": 11, "f6_rating": 4.545454545454546, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=6390"], "media": [], "f6_assessments": [{"id": 1041, "q0": "The proposal effectively identifies a problem to be solved within the challenge that is the lack of content in languages ​​that the people of India understand, the solution is clearly detailed in a simple and effective way and it is explained how it will add value to the cardano ecosystem, the metrics of the proposal are aligned to those of the challenge.\n\nIf implemented, the proposal has the potential to significantly increase awareness of cardano in India.", "q0r": 5, "q1": "The proposal details and clearly explains how the implementation will be carried out.\nYou can find links about the experience and skills of the team, the budget seems totally reasonable to me, the estimated implementation time is realistic, plans have been considered if more funds or future implementations are required.\nTechnically, the contents on which they are going to focus are well detailed.", "q1r": 5, "q2": "Since the roadmap clearly specifies the milestones and estimated times, they also add other milestones to determine if the project was successful or not, the KPIs are well defined.", "q2r": 5, "assessor": "z_assessor_1264", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 1999, "q0": "This proposal highlights language barriers as one of the main issues holding back adoption and awareness of Cardano, which are largely the entire goal of the Challenge: increasing local awareness of Cardano in local languages. In the region that is the second largest crypto market in the world, with merely 12% of Indians having English knowledge, and even fewer than that with levels of fluency to understand current Cardano resources, the proposal makes a strong case for its ability to help expand Cardano into India. \n\nThe proposal breaks down a powerful case for why it has directed efforts to the chosen languages – for maximal efficacy and reach/scope – which seems to have the best efficiency of funding to reach the majority of the millions of IT professionals and developers already in the target regions. \n\nThis is a very well-written Proposal, covering areas that other translation proposals of this Campaign are not, and their three-Track approach, each broken into actionable pieces, seems like a great way to have strong Impact for this Challenge all over India including even, as mentioned, rural regions via mobile phones. \n\nThe content-creation Track, the interaction channels like Discord and a website of the accessibility Track, and the promotion Track including even newspapers for folks who are not as well social-media connected, seem like an ideal multi-pronged approach to have great impact in recruiting the next generation of Catalyst proposers, Plutus developers, and more for Cardano. \n", "q0r": 5, "q1": "The listed team seems to have impressive credentials and experience and fluency in exactly what they propose to do. Each member has their LinkedIn or GitHub profiles available, with years of expertise in their respective fields. By virtue of each team member having the expertise in a different language, there appears to be an “economy of scale” in rendering these translations cheaper than if other routes were used, which is emphasized by the proposal. \nThe team has spelled out a step-by-step process of which Cardano materials to translate first, and a well thought out roadmap of what to expect each month. They seem to have not only done a good job of specifying what to expect for each date, but also have proven their ability to make this plan become reality. \n\nThe cost breakdown seems quite practical and well planned with a project manager, front-end, back-end developers, translators, and even support all lined up. Looking through the credentials of everyone and this very well spelled out timetable, I feel full confidence in the team’s ability to make this come to life. That is, this project has phenomenal Feasibility. \n", "q1r": 5, "q2": "This proposal has nicely broken down what to expect at each time point, from the beginning of their website launch to user counts expectations to Catalyst engagement increases, as well as less-measurable items like awareness increase and enthusiasm for Cardano as a whole. The KPIs spelled out don’t just include what this team will be preparing and creating, but even go so far as to mention blog, Twitter, and YouTube engagement. I would measure this project as highly auditable, largely due to the monthly breakdown of what to expect. \n\nThe only thing that I could imagine further enhancing the auditability of this proposal would be between the outset and month 3 having a way to check in on what work has been made or produced yet on the website, but I would assume with the talent and experience laid out in previous sections that upon request the team should easily be able to update any auditors on what code has been written so far, or see the Set 1 translations spelled out for Month 1 and what Discord and socials have already been established. \n", "q2r": 5, "assessor": "z_assessor_1446", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3081, "q0": "The team wants young people to become aware of the possibilities of the Cardano ecosystem. The problem being tackled is the enormous diversity in language. The makers have researched in advance how they can reach the largest part of the population. They will cover 5 languages with which they will reach about 62 percent of the population. This project will be an added value to the Cardano ecosystem because it has a huge target group. Useful statistics are included in the proposal in advance. The goals have been carefully chosen to work as effectively as possible. The proposal has been thought in advance about the future challenge that will play a role.", "q0r": 5, "q1": "This project involves developers in Cardano, educators, and public relations collaborating on this project. The team is clearly described in the proposal with the corresponding links to their experience. The team has the advantage of being able to speak all 5 languages needed for the translations. The proposal contains a clear description of the resources needed to realize this project. The team has taken into account that these are the costs for approximately 1 year. The team also already knows what they will do if extra money is needed. advertising revenue) The proposal provides a realistic timetable with everything clearly explained. It is good that the technical aspects are discussed in the roadmap. The risks and challenges are well considered. A good implementation has been thought through in advance. I do think that higher than 100 participants can be aimed after 4 months.", "q1r": 4, "q2": "The fully detailed road map is available. This roadmap clearly describes the milestones the team wants to achieve. It's good to measure tangible results. The development can be followed closely using the milestones in the roadmap. It would be useful to also provide KPIs that can be measured daily, such as the number of participants. The proposal provides a clear description of the problem. Research has been carried out in advance into useful information that can be included in the proposal. The solution they offer is certainly a solution on a small scale. The project should be done on a larger scale in the future.", "q2r": 4, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3712, "q0": "India is a diverse country and has a lot of languages throughout the countries. In order to effectively market or spread the knowledge on Cardano to all the people of the country, translation of the content of Cardona to local language is required and is the most effective way to reach a larger group of people. India is a country of diverse languages and the people are very proud of their own language. Hence translating the contents of Cardano into the regional languages would reach a lot more people than expected and also be appreciated for translating as they can learn from their comfort language. Many of the people in India are educated in their local language and might face difficulties in English, by translating the content to regional language it would benefit a lot of people in getting familiar with Cardano and also the advancements of it. The proposer has effectively addressed the challenge and I strongly believe this application will be a success to Cardano as it will be reach more people and more people will be knowledgeable through this with the comfort of learning in their own language. It is also a scalable project and could go global benefiting Cardona on a large scale.", "q0r": 5, "q1": "The proposer has a roadmap on how to implement the project for the next six months by uploading videos in  the Kannada language and hence by uploading the Cardona content in the regional languages on a regular interval of time would attract more viewers and gain more subscribers. It would also be helping a lot of people educate about Cardano in a better way. This whole together will be indeed bringing a new community to the Cardona, once someone sees the content in their regional language they will be more likely to promote the videos on their own to friends and family to watch them and it will be of a better reach. The experience of proposer and his team seems to be very impressive and the proposal is likely to be implemented successfully.", "q1r": 5, "q2": "The proposer has requested 29750 USD as funds to implement this project and he has also provided the breakup cost that will be spent on each individual requirement which seems fair. The proposer has also projected the funds for next 6 months and the money requested will be sufficient to audit the progress. The proposal is most likely to succeed as it going to reach over a large community of different language speaking individuals. It will be very useful in reaching Cardona into the Indian market by translating the content into regional languages and the reach will be more than expected in the future days. The proposer has also foreseen the difficulties they might face while implementation and also has alternative solutions for the same.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4863, "q0": "Definitely this proposal is strongly addresses the challenge. Indian is second largest and developing country with digital india mission by their government till 2030. So i think we can leverage this by this proposal and grow and scale cardano. The major problem with india is language as mentioned most of them are understand their mother language only 10% of total population can speak/read/write english. So this will be really helpful them to understand about cardano like what is cardano what are the problem its solving what is decentralised platform and all those important knowledge in their local language and that will eventually build their interest in cardano and that will help to scale cardano. Also website and communication channel will be helpful for people having similar interest to interest and learn about cardano. Youtube channel and various  interactive courses will help indian developers to learn and understand this system and eventually that will create a better space for them to explore and participate in various events.", "q0r": 5, "q1": "Yes.  as they mentioned they are Team of experienced software engineers, Plutus Pioneers, native speakers covering five major Indian languages then which covers technical and regional team members with good experience. Also the plan and roadmap is very structured and detailed to be implemented successfully for example from Translating  the first set of content to regional languages as documents to creating self learning full course which seems achievable. ", "q1r": 5, "q2": "Yes. They provided here is very clear with problem statement and strategy to resolve it. For example they mentioned the percentage’s of different language speaker in india and accordingly translating content to their language is very clear and useful.", "q2r": 5, "assessor": "z_assessor_1792", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6316, "q0": "The proposal gave an idea to create a webiste containing content about Cardano in Indian language. There are many languages spoken in India, so choosing which language to translate Cardano information into is an important first step. In addition, the proposed team also provides data: in 2021, India is the second largest country in terms of access and use of digital currency, but people mainly know about Bitcoin, the number of people who know about the Cardano platform are few. In addition, India has about 5 million employees working in the IT industry, which is a good resource for Cardano's growth. The proposal also offers a well-prepared plan and content. It has been divided into sections and chapters very clearly such as: Content creation; accessibility and communication and promotion channels. In addition to translating, they also plan to conduct advertising campaigns in the media and newspapers. They also mentioned some possible risks, but did not identify measures to reduce risks. They have selected the 5 most popular languages to translate, translating 5 languages for more than 60% of the population of India is a huge amount of work. So I agree with this suggestion.", "q0r": 4, "q1": "The budget is broken down and seems reasonable. But the volume of information from 2020 is very large, so it is very difficult to use 1 translator for a language, I am afraid that they cannot translate all that amount of information within 5 months.\nThe team members are experienced in software, some are Hindi teachers, some are knowledgeable about Cardano and all have clear information, with links to check. I am confident that this team will complete the project. I also suggest that they hire more experienced translators to complete the project better.\n", "q1r": 4, "q2": "The project product is presented from the 3rd month, the 4th month has more than 100 users, the 6th month has increased proposals for Catalyst. It is better and clearer to measure if the translations and outputs of the 1st month and 2th month are also presented. At the same time, they also gave KPIs with indicators suitable for the challenge, but did not give specific figures after the end.", "q2r": 3, "assessor": "z_assessor_395", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6842, "q0": "Based on the characteristics on India and the plan developed by proposers, the impact of this is real:\n- almost 62 - 90 % of the population can access the info on Cardano\n- information is accessible in different formats (internet, social media, local newspaper, video and audio)\n- A society with a majority of young people (+50%), who if they adopt Cardano, they would perpetuate it for future generations", "q0r": 5, "q1": "The proposal contains enough information on various sections of it. It detailed the implementation process by providing enough information to follow.\nIndia as a big country with a high demographic rate may need much resources (Financial, human, technical...) in order to realize some initiatives like this one. this may explain why the budget of this proposal is high as a big part of funds are located to the translation support. However, by the importance of this project since it really promotes Cardano in a society formed by Youth in majority with a high rate of IT knowledge, if the entire budget cost can't be covered for this round, I would see the benefit for proposers to fulfill this initiative by steps on different funding rounds by attending two languages at a time.", "q1r": 5, "q2": "By its nature this proposal would be easy to audit by the community as all the outcomes have to be published. \nThe proposers plan to:\n- create a website in different languages\n- open a Youtube channel  to broadcast video content\n - create podcast for audio elements\nAll these are indicators of the success and can be identified and evaluated.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7709, "q0": "Creating content in the local language is important to make Cardano more accessible. As someone who lived in many countries, I can appreciate the need and the importance of it.  The proposal identifies a problem and an opportunity within the challenge which needs to be approached. It well explains the motivation and the target market.  The proposal clearly articulates how it will add value to the Cardano ecosystem why it is important for Cardano. The key metrics and goals of the proposal align with the outlined challenge settings and they well explained the alignment. The proposal did suggest how to scale it in the future building courses from the content with some initial idea for further funding but more elaboration on about it would have been helpful considering that content translations will be a going expense. The request for funds is about 20% of the challenge which is high also considering challenge success definition: “Success is having multiple submissions for Catalyst Fund8 for India focused projects, with real-world projects getting funded and built.” They could have asked for a smaller amount and translated for example 2 languages to prove the model and the impact and then go into more languages. \n   ", "q0r": 4, "q1": "The proposal is very well written and the proposer provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal. The proposer knows, in an identifiable manner, the type and number of team members required to implement the proposal. The budget is outlined clearly and broken down into identifiable items. As mentioned above the budget seems high for the purpose of the proposal. It does seem reasonable if we consider 5 languages, but it is not what will be the amount of translated data for $750 per month per language. The proposer also mentioned that KPI of 100 people in 4 months in the communication channels, if we divide it per language it is 20, what will be the numbers in 6 months? Otherwise, it might seem low for the investment required. Based on my entrepreneurial experience, I would have recommended focusing on fewer languages and proving the model first. In this case, also media efforts will be more targeted.  \n \nThe proposal offers a realistic timetable to complete the work. The proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how. \nThe proposer has considered only one challenge regarding COVID relevant to a successful implementation. I believe there are more challenges to add such as multi-languages translation, sustainable revenue model and marketing. \n", "q1r": 4, "q2": "A roadmap with milestones and a time horizon for achievement. Metrics/KPIs that define the success of the proposal, however mostly in a general way. It would have been good to have specific estimations for each deliverable for example Number of blogs/articles from IOG that are covered. The KPI of 100 members in 4 months is specific but what will it be in 6 months? Or 12 months? To align with the potential of the opportunity. As the proposal mention it is also about engagement with catalyst and not only members but what will be the estimated or targeted ratio? There is a clear understandable description of the targeted problem and a clear understandable solution that addresses the problem. Overall the community will be able to audit the progress of the proposal and the KPIs (although as I mentioned more specific numbers would have been helpful) - also considering the team is already in catalyst and in the Cardano ecosystem. This is why I still gave it 5 stars", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8386, "q0": "The overall aim of the proposal is to create a website that covers the vast majority of the population in India and make that content easily accessible. Since India is a multilingual country, it would be much more straightforward if the language or languages for the website is specified. In 2021 India is the 2nd country in terms of access and use of digital currency. However, people mostly know about Bitcoin, only few people know about Cardano. It is therefore a great chance to bring Cardano to India. India has about 5 million employees working in the IT industry, a very good potential for Cardano development. \nThe plan and content have been carefully prepared, in clear sections, chapters, and sections. In addition to translation, they also plan to conduct promotions in the media, newspapers. There is still room for future development likes opening courses, forums. Some risks are correctly identified and some reasonable mitigation solutions have been proposed, enhancing the chance of project success. In conclusion, the proposal effectively addresses the challenge. ", "q0r": 4, "q1": "Clear roadmap in term of month has been provided in the proposal. At this stage of proposal, a finer roadmap is expected, e.g., in term of week instead of in term of month. The requested budget is broken down into assessable details and sounds reasonable.  Founder team’s information is clearly provided in details with reference links for further verification, if needed. Experience and expertise of founder team are suitable for project development. In short, with the given experience and plan presented, it is possible that the proposal will be implemented successfully.", "q1r": 4, "q2": "Definition of success and deliverables are defined for 3-4-6 months. It would be perfect if that of the first and second month be described. Qualitative KPIs are provided. At this stage of proposal, quantitative KPIs are expected to assess the audibility of the project. For example, one KPI is defined as the number of announcements from IOG that are covered. It would be quantifiable if the number of announcements from IOG that are covered is specified as criteria as project success. Proposals in a series of proposals have been funded previously. However, this proposal is new one and different from the funded one. In conclusion, from the information provided the audition of the progress and the success of the proposal are still questionable.", "q2r": 3, "assessor": "z_assessor_675", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8690, "q0": "India being a multilingual country where a large percentage speak just their mother tongue, this proposal seeks to create a website that has only Indian content and the Mentors will be experienced Cardano community members who also speak the mother tongue. This is a laudable idea. \nThe aim of this proposal is to create content in Regional languages that covers the vast majority of the population in India and make that content easily accessible..\nAddressing the challenge, which intends to grow the community of developers and educators, the proposed regional content will help native speakers to learn about Cardano. The website and communication channels will act as discussion forums and inform them about pioneer programs and how to get involved. The outreach activities will take the information to those who are not aware of Cardano. What is lacking is the ease of information access and guidance for the local population and the project intends to bridge that gap. There are more relevant information in the proposal. \nThe main risk mentioned is that in case Covid variant worsens again, it will reduce availability of human resources and delay the delivery time. This challenge is well addressed by the proposal. ", "q0r": 5, "q1": "The detailed plan and timeline are summarized as follows; Translate content to Regional languages as documents; translate selected announcements; design user journey; website development; set up a communication channel using discord and other social media outreach, share content, and more content in the proposal explaining how feasible it is. In my opinion, this project is very feasible and will lead to the onboarding of more Cardano members. \nThe project is expected to start from June 2022 and last for 5 months and beyond. The activities and timeline have been scheduled appropriately in the proposal and very clear to understand.\n The sustainability of this project partly depends on catalyst Fund and other sources of revenue for expanding activities. \nThe budget breakdown is clear and detailed in the proposal. Activities have been divided into variable costs for clarity. The total amount requested is USD29750 and it is reasonable. \nThe team comprises 7 experts in software engineering, computer science, social entrepreneurship, R&D, language skills, etc. who are capable of delivering a successful project. The information provided will lead to a success in implementation of this project. My rating is 4.", "q1r": 4, "q2": "Measuring the progress of this project, the proposer has laid down the roadmap as 1st 3 months, 4 months, 6 months with different activities.\nThe KPIs for measuring success are the number of documents covering fundamentals of blockchain and Cardano in regional languages; number of articles from IOG; the number of announcements from IOG; the number of members joining the communication channels; the number of Twitter followers and number of videos in YouTube channel. This is a new proposal.\nThe information provided is sufficient for successful auditing, in my opinion. My rating is 4.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10448, "q0": "This proposal effectively addresses the challenge by exposing Cardano to a larger audience in India. India has many different languages and cultures that should be included in the Cardano protocol. This proposal is well written and thought out. The proposal creates tools for Indian speakers of many different dialects increasing the outreach of Cardano in India. The proposal outlines creating \"audio/visual content\" which is a powerful media tool. The translated content will be delivered via the proposers website and on social media platforms such as YouTube. ", "q0r": 5, "q1": "The Core team are very experienced in marketing, design, programming, and journalism. The team is also well educated in the field of computer technology, including Plutus and prism pioneers in the group. All team members are from India and have a good understanding of Indian culture which is very important to succeed. I think the plan is well laid out and very likely to succeed all around. The funds will go a long way for their stated goals of website development, translating, and infrastructure. Youtube has a very large base of users that will leverage the information to a large group of people in India. ", "q1r": 5, "q2": "The proposal outlines many KPI's to be met including, number of articles translated, outreach, and engagement. They also specify that milestones from roadmap can easily be tracked. I believe the information in this proposal is sufficient to audit the progress and success of this proposal. Youtube videos that are listed in this proposal can be measured by video views to measure engagement. Can track the amount of subscribers to the YouTube Channel to verify the project is reaching its stated goals. ", "q2r": 5, "assessor": "z_assessor_916", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a website and content in Indian languages. Team members who are experienced in Cardano as well as native speakers to act as guides.", "experience": "Team of experienced software engineers, Plutus Pioneers, Prism Pioneers and Gimbalabs PPBL members, native speakers covering five major Indian languages. Members of a delivered Fund 6 project and funded proposers from Fund 7 with about a year's experience building on Cardano."}