{"id": 399277, "author": "gulla0", "title": "Cardano White Board videos (Telugu)", "url": "https://cardano.ideascale.com/a/dtd/399277-48088", "category": 26454, "amount": 6988, "description": "Minimal exposure to Blockchain tech and crypto in the 49million Telugu speaking population.", "f6_no_assessments": 7, "f6_rating": 4.142857142857143, "videos": [], "media": [], "f6_assessments": [{"id": 500, "q0": "Providing native-language educational materials for an Indian Audience is a great fit for this Campaign. The key metrics tracking channel subscribers and new wallets created are aligned with good impact for the Cardano Ecosystem\nThe idea of future scaling is not directly addressed, but creating 24 new Cardano videos is a worthwhile goal unto itself, even without a future plan. What does concern me somewhat with time-intensive efforts in static educational materials is the pace of change in this ecosystem. Things change so quickly that materials may be noticeably out of date in less than a year, and materials of the type described here can't be easily updated. Many of the potential topics named by the proposer are pretty high-level (general blockchain/Cardano topics) which is a smart approach, as these topics will have relevance for some time.", "q0r": 5, "q1": "It looks like the proposer has experience with the video style he is proposing here. I am favorably impressed with his examples, and I believe he could create more good videos of this kind. His education and work experience speak to his ability to do the video production aspect of the work. I would like to know more about the proposer, who seems to be a 1-man team. I think we are left to assume that he is the Telugu-speaker in this scenario, but since language skill is central to this proposal, I would like to see that addressed more directly. I would also like to see something like a linked-in profile or a more complete portfolio of work. It's also unclear if the proposer has direct ties to the Telugu-speaking world, which would be extremely helpful to the feasibility/success of this project. I think we are supposed to assume he does have those connections, but it's not explicitly explained. I'm also not sure about where the \"Source content\" and knowledge for all the videos is going to come from -- I think it's just this one guy, and he mentions being \"in the Cardano Ecosystem\" for two years, but the quality and extent of his knowledge-base or source material is not well-explained. \nIn terms of budget: his estimate that each video takes 20-25 hours to create seems reasonable and correct, although it's not completely clear how much or if that includes research on new topics that might be required. In any case, he is proposing to pay himself $13/hour which seems like the bargain of the century. I'm not sure if he lives in an area where this is a living wage, because it certainly isn't where I live, and it seems he is proposing to do this work full-time for several months. Furthermore, delivering 24 videos on this timetable requires this one guy to work 40-50 hours per week for three months straight. I think there is some risk that this single-threaded team and timeline may have some risks that are not being addressed. Basically, the budget is clear, but needs some context to understand if it's reasonable.\n\nThe tools he needs for the job are clearly explained and reasonable. ", "q1r": 3, "q2": "Overall the roadmap and KPIs are well-defined and auditable, and they are aligned with this challenge and the interests of the Cardano Community. One KPI that i have some questions about is \"Wallet creation\" and understanding how that will be measured. I think it might be through the google form \"Call to action\" that he describes, in which case we would be counting on self-reporting from video-viewers to know if they create new wallets. In my experience, getting people to actually participate in surveys and self-reporting of that kind is very difficult -- people are not intrinsically motivated to do it. I wonder if there might need to be some kind of incentivisation built into the idea of the self-reporting form in order to get any meaningful level of use. \nMeasuring channel subscribers is a great KPI, and I have no questions about that!", "q2r": 4, "assessor": "z_assessor_1180", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2002, "q0": "Whiteboard videos are a popular way for people to learn, and to learn about new blockchain technologies or trends, so making Cardano content available to 82 Million native speakers of Telugu including folks in one of the most populous cities of India, Hyderabad, seems a pretty efficient and impactful way to achieve the goals of this Challenge. Especially given that there is so much IT skill and talent in India waiting to be harnessed for development such as by Cardano, YouTube channels in regional languages is among the best ways to expand into and tap into that ripe source of skill who just don’t yet know about Cardano or Catalyst because it hasn’t yet been made known to them. \n\nConnecting with Indian YouTube channels to talk tech is one of the suggestions for this challenge, and this YouTube channel expanding blockchain ideas sponsored by Cardano for the Millions of Telugu speakers is sure to increase buzz and chatter about tech, dev ideas, etc. \n\nThis project displays strong promise for Return on Intent in the field of Impact. \n", "q0r": 5, "q1": "The proposer mentions 10 years of filmmaking and links to already-made whiteboard videos explaining some concepts showing that the team is knowledgeable and capable. Two videos a week is not too ambitious. Example topics have been provided, as has production timelines like 20-25 hours of labor per video. A cheaper-than-average bargain rate has been provided to do 480 hours worth of video editing and presentation to expand into the Telugu market with realistic costs for one-year use for necessary software. Thanks to the proposer spelling out each of these details nicely broken down and added together, it is easy to see that this plan has been very well thought out and is ready to deliver. \n\nMy only concern is seeing a team of two proposers and only one name listed to do all the work of the 40-50 hours weekly, which, although still realistic, seems potentially a lot for one person. This scores therefore high in Feasibility, with room for one more star if the team were to be expanded. \n", "q1r": 4, "q2": "Not only has the proposal explained how to use YouTube analytics for key metrics, but additionally the educator has laid out a plan to encourage feedback after each video and a call to action, and therefore as an aid to measure more directly how many new members are onboarding to Catalyst or Cardano due to this outreach project. Seeing which schools this content will be shared to for free yields another way to monitor the reach that this project has made. \n\nBy following the channel from May to July of this year, auditors should easily be able to follow whether sufficient video content has been delivered on time, whether sufficient engagement numbers are showing, and by following the Google Forms feedback tracker hopefully the upper goal approaching 50,000 Subscribers and 10,000 new Cardano wallet creations will be seen. \n\nThese nicely explained items and metrics render auditability easy and very high. \n", "q2r": 5, "assessor": "z_assessor_1446", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3083, "q0": "The maker wants to offer people who speak Telugu (49 million) a YouTube channel that makes Cardano-based videos about cryptocurrency. I think the audience he addresses is quite limited considering that there are 1.5 billion people in India. It would be useful if he could make the films directly in the different languages so that a larger audience can be addressed. It is good to educate the local population about the blockchain technology. The people there are also given the opportunity to make use of strike actions.", "q0r": 5, "q1": "The proposal includes someone with relevant experience in education and video design. He works alone on this project. No one is needed anymore and this keeps costs down. The budget is clearly written out. The maker pays himself a very low hourly wage to work on the films ($13 per hour). The maker offers a realistic timetable. In the youtube video the maker explains how the films will be constructed. The maker has run over a few risks. I have my doubts because suppose we are a few years further and there is a huge update that makes the videos unusable. If I were the maker, I wouldn't limit myself to 1 language. Perhaps there is a possibility to work with someone who can also record it in another language, so that you can appeal to a larger audience.", "q1r": 3, "q2": "The proposal states what the maker wants to achieve. By collaborating with schools it would indeed be possible to obtain sufficient subscribers. I still have my reservations about the number of wallets. You cannot check who has made a wallet through the maker's videos. There are no real KPIs described other than the number of subscribers of the videos. For the people who speak Telugu, this proposal is certainly a solution. It will still be difficult to attract people who are not interested in this topic.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4566, "q0": "People always love to learn the subjects in their local language, and ui based animation will definitely attract people to watch the videos which can serve both  as entertainment and knowledge purpose.\nHence idea proposed by proposer has effectively addressed the challenge, in bringing all viewers to know the basics of cardano,and future cardano projects which also removes misconception on cardano.", "q0r": 5, "q1": "The proposer has worked as educator, UI/UX designer, product designer and filmmaker for past 10 years and he's been in crypto for last 2 years , the proposer definitely knows what kind of design people like these years with animation, and has planned his videos according to that model , and shown his stepwise development hence,the presented projected can be implemented successfully.", "q1r": 5, "q2": "The information provided shows which audience the proposer wants to target ,and has also mentioned about which are basic concept proposer wants to teach to audience.\nProposer has mentioned proper key indicator  for model's success, and has also shown his experience as ui  designer, hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7369, "q0": "The idea here is to create a youtube channel that teaches basic concepts about blockchain and Cardano, such as how to acquire Ada, create a digital wallet, generate passive income through staking and etc. This is something very positive, however, which already exists in large quantities. The platform on which Cardano has the most space and viewers is youtube, so much so that in the end 7 we created a challenge precisely to be able to disseminate content related to our ecosystem in other, more traditional types of media, so that we can reach a wider audience. So, even though in theory it is important to bring knowledge about Cardano to India, I don't see much need to create videos explaining these basic concepts, since they are already available and accessible to everyone. In addition, starting a channel from scratch would create the need for a lot of marketing to get interesting visibility. In my opinion, we could have a more interesting approach to the problem here if, for example, the proponent subtitled some videos that already exist in Indian, instead of creating them from scratch. He could organize these videos into a playlist, as a kind of introductory course on our blockchain, subtitle them and perhaps establish a question and answer session about the contents that were studied. It would be great to create a group of students, let's call it that, and support them, instead of creating more of the same, deepening what already exists, making it more accessible, answering questions and individually guiding young Indians who are interested in learning our Cardano , what our ecosystem can offer of opportunities, if they are from the technology area and are interested in learning about our computing languages, for example, or how to build Dapps and etc. Or, if these students are from other areas (outside of design, programming and all those professional positions that are highly targeted at Cardano), they can also understand how they fit into the community, because the proposals also need non-technical professionals in those areas , or even to work as CAs on Catalyst. Anyway, the idea is good, but I think it could be adapted to the current reality, where there are many videos already on the subject, and it could be invested in deeper and individual guidance of the intended target audience. \n", "q0r": 3, "q1": "The feasibility of this project is average, we were able to understand in general what would be done, but at the same time it lacks a lot of detail. It is said the frequency and what would be the themes of the videos to be created. However, nothing is said about the creation process itself. The proponent wants to release 2 videos a week, but how big are they? How would he go about raising them? Would a script be written, then recorded, edited, narrated? It is a bit abstract how the development process would actually take place, what small steps would have to be completed in order for such videos to be generated. Therefore, I would like the proponent to include in this part of the proposal a script that explains in detail their creative process, how many hours or days each stage of creation would require, etc. Now talking about the budget, we know that you will be charged a value of 13 dollars per hour of work, which would give an average of at least 260 dollars of cost per video, considering that it would take a minimum time of 20 hours to create. I found it a little high, since we don't even know their size, so we don't know exactly how much work would be dedicated to each video. All the money would go to the proponent, I am concerned that he has no affiliation with any other professional to carry out this project, we know that he is technically qualified because he claims to be a postgraduate engineer in cinema in media, but I don't think the best solution is work alone. From my point of view, it would be interesting for him to hire at least someone from the marketing area to help with the promotion of the channel and videos. In fact, nothing is said about it, all the money asked would correspond to the cost of producing the videos, but how would it be advertised? When seeing seeing, as important as creating quality content is to publicize it, so that it can reach your target audience and the largest possible number of people. So I think it is a flaw that the proponent did not mention this at any time in the proposal, nor if he himself would work on promoting the channel or if someone else would be responsible for it, in addition to what marketing strategies would be adopted here. Finally, about the team, as I already mentioned, this proposal would apparently be developed only by the proposer. He gives good information about who he is, his background, etc. But it would be interesting if a formal resume was attached, either through your linkedin profile or another platform. This way we would have a secure proof of the information that is passed. We don't know how the proponent understands Cardano, how he relates to the blockchain, if he is an active member of the community and yes, through what actions... That way, not so much confidence is passed about his preparation in teach about our blockchain. \n", "q1r": 3, "q2": "The bidder did not include very precise information on how to audit his bid. He says that progress will be measured by the content posted on youtube as well as the number of youtube subscribers, as well as how they interact with the videos. The expected number of subscribers is at least 50k and 20k portfolios created from the teachings disseminated. In fact, these are logical ways to measure the success of the proposal, but they are also superficial, because they seek to analyze only numbers, and not how, exactly, people exposed to the contents would be affected. My suggestions are that the proponent first establish a script for creating the videos, and as he develops his project he can give feedback to the community about what it was like to work with it. As it is a simple project, compared to other Catalyst proposals, this feedback can also be provided in a simple and direct way. It could be a short report that contains this information about the video creation process. Whether the activities were carried out as planned, whether any difficulties were encountered, etc. And regarding the results, we could keep the indicatives suggested by the author and increase the interaction with the subscribers. A direct meeting could be held with them, in order to listen to them, both in terms of doubts and to understand their progress. How are these people relating to Cardano, becoming active members of the community, etc? All this could be clarified through direct contact. It would be important that, in addition to knowing how many subscribers and portfolios were created, the proponent would inform us at what level and activities these people are after the teachings. Anyway, these are suggestions on how to further deepen auditability, I agree that it is possible to measure it satisfactorily, but not ideally, through what the proponent suggests. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8220, "q0": "Proposer presents a solution for a part of India where the Telugu language is spoken (75 million People wiki), and that is the production of short White board videos that will bring Blockchain and Cardano closer to the people. Through video content, the proposer plans to educate people through topics like creating a wallet, staking, transferring and receiving ADA, buying crypto on centralized and decentralized exchanges, etc. The key metrics and goals of the proposal align with the outlined challenge settings. and proposal is able to scale to address future challenges.", "q0r": 4, "q1": "It would be good to transparently put a link in the proposal where you can get more information about the team and who is behind this project. We come across links with similar content posted by the proposer in the proposal but I would love to see who will work on this project. The budget is reasonable and it is clearly presented to what and how the money will be distributed. Proposer states that he will make two videos a week in a total of 24 videos with a reasonable time frame from May to August, and explains what each video will contain from basic to advance content. It’s good to have in mind the possible risks and challenges that may arise during the implementation of this project.", "q1r": 3, "q2": "A roadmap with milestones and a time horizon for achievement has been developed. KPIs are defined through monitoring through YouTube analytics and website analytics, a number of wallets being created by users, Subscribers on YouTube through the months as videos will be posted from May to August. The community can monitor the development and success of this project.\n\n", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10710, "q0": "Cardano white board is getting famous which includes Khmer, Argentina etc everywhere,\nIndia has population of 1.4B with 29 offical languages, By explaining and giving Minimal exposure to Blockchain tech and crypto in the 49million Telugu speakers of India,\nIt will be big boost to cradano ecosystem, \nProviding youtube channel only not enough , It need website also so gave 4 star, \nAdding more people to Cardano ecosystem and catalyst  will bring new ideas for development together, Information about cardano and Blockchain technology should reach maximum people irrespective of any barrier,\nHere proposer has explained in proposal and it is effectively addresed.  ", "q0r": 4, "q1": "By looking at sample video's provided by proposer, they have tried explaining basics of blockchain, crypto and NFTs w/ a focus on Cardano is good, providing two video's per week is good start to teach in Telugu, \nexplaining local Telangana and  Andhra people  about blockchain and what are it's advantages through videos and explaining  about Creating a Cardano wallet and why you should create one?, will really help bring more people to cardano and it will increase cardano value, as proposer already worked on relevant field and  has been in catalyst more than 2 years, with given experience and plan presented it is highly likely this proposal will be implemented successfully .  ", "q1r": 4, "q2": "the proposer has provided his experience and education in Tech filed, But has very small team which need more bigger, Having enough experience in UI/UX design, Product design & Education will be helpful for whiteboard Telegu,  as proposer ready to share youtube data and its analytics and website is yet to start, Number of wallet and people they will bring to cardano community, n all data and information provided is sufficient to audit the progress and the success of the proposal.  ", "q2r": 4, "assessor": "z_assessor_992", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Youtube channel in Telugu with Cardano based, crypto educational videos for onboarding new wallets & users.", "experience": "I have worked as an educator, UI/UX designer, product designer and filmmaker in the past 10 years. I have also been a part of the Cardano ecosystem for two years now."}