{"id": 400567, "author": "defidiscussions", "title": "Networking Events Bombay, India", "url": "https://cardano.ideascale.com/a/dtd/400567-48088", "category": 26454, "amount": 18000, "description": "Awareness of Cardano's projects and vision could stand to be improved among investors, young people, and community leaders in India.", "f6_no_assessments": 7, "f6_rating": 3.476190476190476, "videos": [], "media": [], "f6_assessments": [{"id": 7411, "q0": "In theory the proposal is excellent, but there are several things to improve. The idea of ​​the proposal is very good and it totally aligns with what is asked in the challenge, because our goal here is to somehow popularize the Cardano ecosystem for the Indian audience, specifically. In this way, we would be contributing to the country's development, since people learning about Cardano could: invest in our currency, which in the long run will generate profit; actively participate in the community, for example through Catalyst; learn more about our technologies and align this with their professional activities (be they in the technology, advertising, legal, business, etc.) That is, in many ways, the local population should benefit. As well as our blockchain, of course, we need to finance ideas that help explain our technologies, through investment in ada, as I mentioned, buying and selling CNFTs, direct investment in some projects like Dapps and etc. All this will certainly be achieved if the Indian population gets to know our blockchain better, and the promotion of these events will certainly help with that. That is, in theory, this idea is perfect with what we are trying to pursue. However, in practice, it is still somewhat abstract how such events would work, little is known about each of them specifically. We know that in total there would be twelve, but we do not know which subjects would be addressed in each meeting; we don't know which professionals would lecture; nor do we know how many people are expected to be an audience for the event, or how the team will be able to publicize the events so that people are interested even without knowing what blockchain is after all. Anyway, little is said about the exact structure of each meeting, we know that there will be an educational demonstration, followed by a lecture and a moment of networking and coffee break, from what I understand. However, what is the difference between the educational session and the lecture? Maybe the target audience, maybe in the first case we are trying to reach young people and students, and in the second case people who are already involved in Cardano's technologies? In other words, my opinion is that the idea is aligned with what is sought in the challenge, but unfortunately the explanations about it are scarce, so it is not possible to fully understand how it will happen, and this compromises our confidence in the impact. Therefore, I will give a neutral grade, if the event had been better explained, the grade would probably be maximum, because the theory itself is exactly what we are looking for in this challenge. \n", "q0r": 3, "q1": "A roadmap is not drawn up that allows us to understand well how the necessary processes for carrying out these events would take place. The proponent explains that the events will take place in the 3 main cities, but which cities are these? It is also said that “we would measure our deliveries with a ledger that would track the number of participants throughout the year. Also, how many people can we integrate into our project catalyst through account creation. Another measure we would take is how many people per event create a wallet.” These indicators are interesting to analyze the auditability of the project, however, they do not talk about the feasibility. For the project to be viable, it would be necessary for the proponent to attach a roadmap, indicating the activities that would take place according to a certain time interval (monthly, for example). These activities should talk about the pre-production of these events, everything that would need to be agreed and defined, such as physical space, which speaker would be chosen for each event, how it would be announced to people about the existence of these meetings, etc. That way we would have a solid understanding of the process, which unfortunately does not happen due to the lack of explanations. Regarding the budget, I think it's explained in a very basic way how the requested money would be used. It would cost 1500 dollars per event, 750 for space rental, 500 for the speaker and 250 for meals. But my question is the following, how these prices were defined if a) we don't even know the exact locations of each meeting, so prices can vary b) it is not defined who the speakers are, that is, maybe they charge a value above or under 500 dollars c) the value for meals should be calculated based on how many people will attend each meeting. So I think that although it is quite possible to understand the financial division, it is not so simple to believe in the need for 1500 dollars for each event since everything is still undefined. And finally, speaking of the team, we have a very diverse team here, with many people participating in the project. However, the explanations about each of them are quite superficial. We don't know much about his previous experiences because all that is revealed to us are his professional performances and a small resume is not attached. Some people have made their linkedin profiles available, so it's easier in these cases to check their previous work, what they've done so far, etc., but ideally, all of them would provide this information, not just some team members. Therefore, I think the feasibility of this project is low, with several things to be improved. \n", "q1r": 2, "q2": "The ways to audit the proposal are quite numerical (numbers of: people we can integrate into our project catalyst + people creating portfolios + interactions on social media sites (what media?) + people viewing youtube videos + new proposals coming out from India). In addition to these indicators, in order to carry out an adequate auditability of the process, I think it is important that we monitor the work routine of the professionals involved. What would each of the people mentioned in the team part do for this project? According to the roadmap, which was not actually attached, how can we verify that activities that were promised for each month were actually fulfilled? In summary, what I want to say is: it is important to know quantities, how many people created portfolios, submitted proposals, etc., but it is also necessary for us to know how the whole process of building these events was. Once all this analysis is done, it needs to be made available to the Cardano community. How can we verify this information? Regarding the final result, the proponent again focuses a lot on a quantitative analysis, as according to him success would be measured by the number of people participating and proposals submitted. However, I would like a more humane analysis of the thing, for example: a survey with the participants, to understand how they absorbed the knowledge that was passed on. In what way do they also intend to apply this knowledge, if they will study more about ecosystem technologies, will they participate in Catalyst. If proponents of this project are born, it would be very interesting to know what these proposals were. Finally, we need to know what the real impact of all this was, both for India and for Cardano. Therefore, I think the proponent should promote a broader and richer survey, and this final survey should, as well as the partial results coming from the progress, be available to any member of the Cardano community. There are several ways to establish this bridge, but the most direct, in my view, are through Town Hall, discord groups or telegram. At this point, it is at the discretion of the bidder and his team. To conclude, in summary, what I think is that the path of auditability has started well, but it needs to go beyond the numbers and also become more accessible to all members of the ecosystem. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 10, "ne": 9, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1578, "q0": "From the point of view of Cardano which would be funding these events, the biggest risk would seem to be that these networking events may not actually be impactful. 50 people may come out to an event, especially if there’s merch and refreshments, but then what?\nGenerally increasing interest in Cardano is unlikely to be very impactful. The lack of a strategy for meaningful follow-up with any of these three segments is a significant lack, e.g. on social media or YouTube, or call-backs, mail campaigns, etc.\n\nA related problem is that the target audience group or groups aren’t well defined.The key audience segments would seem to be potential investors, potential developers, and potential users of Defi, because these groups may in the future contribute back to or get involved meaningfully with Cardano. However none of these segments is specifically addressed. \nThe stated goal of onboarding new potential Catalyst proposers only aligns with Challenge goals if people being “onboarded” to Catalyst are developers or otherwise qualified to submit meaningful proposals; this difficulty speaks to the lack of differentiation within the intended audience.\nRather the approach appears both one-off and generic, which implies mediocre impact. \n", "q0r": 2, "q1": "It looks like this group will be able to book speakers and venues and to carry out this plan as described, given the team members.\nHowever the commitment of team members is very hard to assess. Will all eight team members be actively involved in the project? If so, in what roles? How successful were the events of team members in previous funds i.e. in terms of metrics in project cited?\n", "q1r": 3, "q2": "A number of important questions arise in the area of auditability.\nThe numbers seem inflated, e.g. $500 for a guest speaker? Thousands are working in the Cardano ecosystem as volunteers.****** Is $750 for 50 guests reasonable for a venue in India? To clarify the team could have provided data on venue prices locally. ******** Cost of raffles and ADA give-away? \n ********\nThe metric of having 50 guests isn’t very meaningful without some way of qualifying the attendees by potential future contribution to Cardano. Giving away merchandise seems unnecessary and/or not necessarily going to attract qualified attendees. ********\nI like the idea of creating wallets at events and using these numbers as a metric.  ********\nNo way to relate investment from India with these events, although this is mentioned as a metric. *****. No mention of developing anything or following up with YouTube, yet number of views on YouTube is listed as a metric.********\nOther metrics to consider might have been. \nNumber of attendees in each category of potential investor, developer or defi user or other category. ********\nAttendee satisfaction. ********\nMost importantly, a measure of whether participants followed up in the Cardano ecosystem and if so, how.\n", "q2r": 1, "assessor": "z_assessor_1391", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3088, "q0": "The aim is to make people from India aware about Cardano's projects. This project can provide clear added value if these meetings are organized on a large scale in India. I wouldn't lure people in by letting people participate in a lottery. The people who want to participate in this program must be screened in advance. If this project becomes more large-scale, it could create a new large community. I don't think the proposal is described in enough detail at the moment. I myself would choose to have some of the network events taking place online so that a larger audience can be addressed directly. The project can certainly have a positive impact if it is on a larger scale.", "q0r": 3, "q1": "The team consists of people with relevant experiences. They have already carried out this project in Ethiopia. The team behind this project forms a nice whole to build up the events. There is a budget overview in the proposal. I think the budget is limited. How the budget is spent could be described in more detail. There is no clear timetable when the network moments will take place. There is no implementation plan in the proposal. There is nothing described in the proposal how the events will take place. There is only the location. The locations are well chosen. It would be helpful to possibly run several networking events at the same time, but in different places. That everything is filmed at 1 event and that everyone can follow along at the other places, so that a larger audience can be addressed immediately. There is nothing described in this proposal about the technical part, the technology and the architecture. The risks are considered to ensure a successful implementation.", "q1r": 2, "q2": "A number of great goals are described at the bottom of the proposal. Various KPIs have been taken into account. In the long run, this project can be a success. Bombay consists of 21.04 million inhabitants. I wonder how this project can have a big impact in the long term by organizing a network meeting of 50 people once a month. If this project can be carried out on a larger scale, it will certainly have a future. This project certainly provides a solution to the posed problem.", "q2r": 3, "assessor": "z_assessor_1606", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4574, "q0": "Since in India financial literacy is very less ,proposed idea can be addresses the challenges effectively.\nAs Events increases people will have knowledge of cardano and try it invest the money instead of keeping the same money in the bank  ,as Mumbai is great city to start where words soon reaches all the parts of India and more people will show interest towards cardano", "q0r": 5, "q1": "As the proposed task is not very difficult to achieve it can be implemented easily and successfully.\nThe proposal just needs an excellent speaker and space to conduct events which will definitely not be difficult in Mumbai.\nSimilar to this, Tedx has be great achievement in recent days where people in India pay 1000s of Rupees to attend the events which will have great scope in the future.\nHence the presented proposal can be implemented successfully without any difficulty", "q1r": 5, "q2": "The presented info is clear where they have mentioned how they'll check the progress after conducting each events ,They have even mentioned on how people are encouraged on attending the events where wallets will be created for each person.\nAs Wallet is created it will showcase other people about safety of their money in the wallet  and adding videos in YT people away from Mumbai will also have the knowledge towards cardano, as the proposer keeps the ledger of these people, they can be easily targeted customers for cardano", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6415, "q0": "The problem statement being lack of awareness regarding cardano ecosystem among investors, young people and community leaders in India. The proposer is trying to resolve it by providing networking events throughout India and also to invite speakers for the events which in turn help people to understand more about the Cardano and get interested about Cardano eco system. This proposal does identify the issue which needed to be resolved and addresses it. The goals of the proposal does align with the challenge settings.  Based on the proposal the proposer is already conducting events in Ethiopia, Paraguay and Ecuador and have received funding for the same in the previous rounds hence in future proposer will be able to conducts events in different locations to increase the awareness about the cardano eco system therefore the proposal is scalable to address the future challenges. By increasing awareness about cardano we will be able to onboard new members to the community and also ADA holder will be able understand cardano's vision and try to participate in the community instead of only considering ADA only as a investment option thus this will add value to the Cardano ecosystem. Put together from above observation this proposal effectively addresses the problem", "q0r": 5, "q1": "The proposer have been already conducting networking events in various locations and have received funding for the same in previous project catalyst rounds. Based on this it's safe to say that the proposer and their team has the required experience and relevant skills to execute the proposal successfully. The proposal consists of a detailed budget breakdown and has taken account of all required expense. The budget asked for seems reasonable to implement the proposal. The proposer hasn't proved a clear step by step timeline to carry out the proposal without the timeline it would be hard to judge if the progress of the proposal is going as per planned. The proposal do have a sensible plan to execute the proposal that shows what is being done and also how its being done. the proposer has taken in account of resources required to implement the proposal The proposal has mentioned all risks or challenges that may effect the successful implementation of proposal and the proposer has also provided the solution to mitigate the risks. Based on the above observation and on previous works it is likely this proposal will be executed successfully", "q1r": 4, "q2": "The proposal doesn't consist of a step by step roadmap with milestones to achieve within a timeframe. Without this it would be hard to audit the progress of the proposal and also to know whether the proposal is being executing as per the schedule. The proposer has provide a clear detailed key performance indicators which will be very helpful to track the development of the proposal. The proposal do consists of detailed understandable solution that address the challenge. The proposer has also provided details on how success for this project look like. They have also given a detailed budget breakdown which will be very helpful for auditing. With considering all these the information provided is somewhat enough to audit the progress and the success of the proposal as mentioned earlier a detailed timeline with goal to be achieved would have been helpful to audit", "q2r": 4, "assessor": "z_assessor_419", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8394, "q0": "The proposal intends to establish a series of networking events throughout India to gain acknowledgement of Indian people about Cardano. A frequency of one event per month seems a bit too few, limiting the impact of the project on the challenge. Some risks the can occur during project development are correctly identified, namely finding space to host events, security, and finding good keynote speakers. Effective mitigation solutions have been developed and presented. In summary, the proposal effectively addresses the challenge.", "q0r": 4, "q1": "The frequency of hosting 1 event per month in a year is feasible. Project’s timeline is therefore straightforward. Requested budget is broken down into measurable details and sound reasonable. Information on proposer team is provided briefly with reference links for verification, if required. In general, the expertise and experience of founder team are suitable for project development later on. If obligation for each team member is specified then the feasibility of project can be assessed easily. In short, I believe that with given experience and plan presented, the proposal can be implemented successfully.", "q1r": 4, "q2": "Project’s progress is qualitatively presented. At this stage of proposal, a quantitative progress is expected for audiation purpose. For example: One criterion of project is the number of people who view youtube videos. This criterion should be quantified for measurement later on, e.g. the criterion may be 10; 100, 10,000 or whatever number of people who view the youtube videos. Proposals by founder team have been funded in Fund 5 and Fund 7. However, this proposal is new one and different from the funded one. Besides, the proposal has not been tested yet. In a nutshell, with information provided, it is questionable to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 8704, "q0": "Having read through the entire proposal I can deduce that the proposer wants to establish a series of networking events throughout India; create interest in Cardano among the people to solve the problem of limited awareness of the ecosystem in India. Their stated solution is to host events in Bombay once a month for 12 months. They want to have educational segments and provide incentives for regular attendees, and attendees will be onboarded to Eastern Town Hall. They will create ADA wallet for attendees thus bringing minds to Cardano community in India. In addressing the challenge, the proposer mentioned that the network events will increase interest in Cardano and onboard new potential project catalyst proposers. Mention has been made of risks as how to find venue for the events, and security keynote speakers will be a challenge. But their solution to this challenge is to leverage the networking connections and also hire Guards for the security issue. \nI recommend that the proposers collaborate with other experienced blockchain techs to help them have more impactful events. The details address the challenge well, hence my 4 star rating. ", "q0r": 4, "q1": "The detailed plan of 12 months of networking events is clearly stated. It mentioned 3 networking events in a quarter in 3 main cities which is quite good. The proposal could give more details of contents of the program such as , the definition of blockchain, Cardano and other blockchain, etc.\nThe team of 9 experienced people with detailed profile links is good for reference. \nBudget breakdown shows the cost of venue, catering, keynote speaker are all detailed. The total budget of USD18000 is reasonable for a 12-month event. The information given warrants a 4-star rating.\n", "q1r": 4, "q2": "Details of the progress of the work for auditing are mentioned as availability of a ledger to keep a measure of attendees; number of people onboarded onto their project catalyst; number of interactions on social media; the number of people who view YouTube videos; and number of new proposals coming out of India. The success KPIs are also mentioned as number of attendees; over 50 guests who can create accounts in project catalyst; and the future catalyst proposals that will be submitted by onboarded attendees at the events. These are measurable in respect of the proposals.  The details are quite sufficient for auditing the success of the proposal hence my 4-star rating. \nIt is stated that it is a continuation of previous funded proposals in Fund 5 and Fund 7. ", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "By establishing a series of networking events throughout India; inviting speakers to networking events we can garner interest in Cardano", "experience": "Experience in international logistics and having well-established connections in Bombay, India. Computer Science Degree from Rutgers University, counseled by business and marketing advisors. Managed Networking events in Ethiopia, Ecuador and Paraguay. Community Ambassador"}