{"id": 402965, "author": "mikechandler.pool.parad", "title": "360 Development Launchpad", "url": "https://cardano.ideascale.com/a/dtd/402965-48088", "category": 26454, "amount": 29000, "description": "Proposals are random many good ideas with trouble communicating and execution.", "f6_no_assessments": 7, "f6_rating": 2.523809523809524, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is not bad, but unfortunately it is a little poorly structured. We know in general what would be done here, the purpose of the proposal is to create a platform that serves as a space for people with ideas, developers and Cardano enthusiasts to share ideas and develop projects from start to finish. The problem raised by the proponent is that “the proposals are too many good random ideas with communication and execution problems”. That is, as much as people have good ideas, they don't have constant and secure communication with each other, so they can't formulate proposals that are strong to be funded on Catalyst; from what I understand, the purpose of this platform would also be to connect different types of people, who can help each other. For example: I have a good idea, but I don't know anything about programming and development. Some programmer or developer may have the technical knowledge to make my idea a reality, but we don't have a communication bridge. I thought that overall the explanation of what this platform would be a little confusing, but that's what I inferred from the whole. The proponent explains which parts this platform would be formed by (Idea 360 Farm + idea 360 + Milestone 360), however, the explanation of these parts is a little superficial, it is not possible to understand exactly how each of them would be. Speaking of the objectives of the challenge, in particular, I disagree that the proposal fits well with what we are looking for, because it is not explained how this platform would be aimed at the Indian audience. At the end of the impact, the proponent states that “This project will focus on bringing some of the biggest developers in India and around the world into the Cardano development ecosystem”. However, how will this be done? How will these developers find out about the platform? How does the platform dialogue with the specificities of this people? Would it be in their native language? It is not clear why this platform is beneficial especially for India, the way the idea is presented seems to me to be a good way to promote communication among the general public of the Cardano community, but that is not what we are looking for in this challenge. It would be necessary for the proponent to better argue this point, after all the proposals that are financed in this challenge should benefit not only Cardano, but also India. \n", "q0r": 2, "q1": "The script of the proposal is unfortunately very superficial. All the activities that will be done are explained in a basic way, let's exemplify. The proponent states that it will “train 2 developers as training managers 6 weeks”. How will this training be done? What kind of learning will they have? What would happen in each training week? The proponent then says that each part of the platform (Idea 360 Farm + idea 360 + Milestone 360) would take approximately 1 month to build. However, it would be necessary for him to explain better what would happen in these time intervals, for example: who would perform what tasks, in the weeks of these months, what are the exact plans, what small goals should be achieved in these periods of time, how would it be the final delivery of those parts of the platform and etc. From the way the roadmap is explained to us, we do not have an exact view of the development process of this proposal. Now, speaking of financing, 29 thousand dollars are requested, a very high amount. I don't think the bidder adequately explained how this amount would be used, as again the information provided is superficial. He breaks the whole into a few parts, but doesn't argue why they need to cost what they do. For example, “Developer 360 Certification - $8,000”, what certification is this, and why does it cost $8,000? “idea 360 - $12,000 full-time project manager”, what would the project manager do in their work routine to justify this salary? Would he be active to the fullest extent of the proposal? Finally, speaking of the team, this part is not good either. It is revealed to us that the team would actually be a duo, “2 instructor managers (developers to manage the training certification program)”. However, it would be essential that more information be passed on about each of them. For example: their full names, their background, examples of previous work (a brief CV), how these people relate to the Cardano ecosystem (if they are active members and what they do). Unfortunately, confidence is not given in any of the fundamental parts of feasibility - roadmap, budget and staff, and a rephrasing of this part of the proposal is necessary. \n", "q1r": 2, "q2": "Regarding the auditability of the process, unfortunately the proponent only repeats the information that was given in the part of the script. It does not outline new ways in which we could monitor the project, it does not provide KPIs, metrics, what would be the partial results that would need to be achieved little by little for the proposal to be considered a success... For this part to improve, it would be necessary that a) he left the script more detailed, so that we could have a clearer view of the process and with that more conditions to follow it, monitor it to know if what was promised was fulfilled in the right way, etc. b) it would be essential for him to provide us with some partial results, that is, ways of verifying whether the small goals were being progressively achieved. The way this part of the proposal has been described, we really don't have a way to properly monitor the progress of the project. Now, talking about the auditability of the final results, the proponent tells us in a very abstract way what is intended here: “success in this project would be to build a working system that cures and promotes successful catalyst projects to promote the Cardano ecosystem. In addition, it increases available developers for the Cardano ecosystem.” This information is already given in the impact part, it would be necessary for the proponent, once again, to indicate objective ways to understand if the platform was in fact a catalytic space, exchange of experiences and mutual help between those involved. We would need quantitative data (eg how many developers are using the platform, how many projects have left it, etc.) and also qualitative data (how was this project beneficial not only for Cardano, but for India? What were the measurable consequences for the public? target? How did they benefit?). All this information should also reach the members of the Cardano community in a clear way. Unfortunately, I found the auditability to be very superficial, not informing us adequately of ways to monitor the process. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The intention of the proposal is to build a platform where people can collect ideas and then create White Papers concepts. The aim is to tackle the problem that people do not have the necessary skills to fully develop their idea. This proposal can only help a few people. It doesn't say how the makers will choose major developers. I don't think this project will add value to the Cardano ecosystem because you can't learn and apply everything in a few months. The risks have been considered too limited. It only says that it is difficult to find developers who are certified. It is also possible that people no longer see it during the training. What will happen if people speak a different language? It mainly says what will happen if this project is a success.", "q0r": 2, "q1": "There is no evidence in the proposal that the proposer has relevant experience. It would be better to put certain links stating who the submitter is effectively. It says there is a team of 45 people, but there is no proof either. An enormous budget is required. The merits of the managers are described too superficially. It would be useful to include hourly wages in the proposal. It has an unrealistic timetable. I don't think it is possible to get to know someone everything about Cardano in six months and then also work out a project. There is no clear implementation plan. It is described what the sections are in the platform. The sections of the platform are briefly explained. The technical aspects are not included in the proposal. Not enough thought has been given to the risks and challenges to make this project a success. It should be taken into account that different languages are spoken in India. It doesn't say anything about how people are going to be attracted.", "q1r": 1, "q2": "There are no clear KPIs that can show that this project will be a success. For example, it would be recorded how many people are registered in the platform. The diversity in languages could also be included. The roadmap is insufficiently developed and the timing is difficult to meet. Currently, this problem described cannot be solved because it will be difficult to select the right people from all the participants. This solution has a too small impact because only a few people can be supported.", "q2r": 2, "assessor": "z_assessor_1606", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "India is only mentioned once, and no details are provided on how this proposal focuses on India vs the normal global availability of online platforms.  Which local languages/dialects will be supported?  Will certain areas, schools, institutions of India by focused on?  The proposal mentions “bringing some of the greatest developers from India and around the world into the Cardano development ecosystem” which indicates a global view rather than a strong focus on India.  Therefore, I disagree this proposal meets the challenge requirements of focusing on India.\n\nThe proposal is not clear on exactly what the end point is.  Initially it seems the proposal aims to build a customer relationship platform that gathers Cardano project ideas from the public and guides those ideas through to the end point of submitting them on catalyst.  \nHowever the “submit on Catalyst” objective is confusing when the project also mentions developing “Developer 360 Training and Certifications”.  Are these developers to be allocated to a project before successful Catalyst funding?  How much technical development and coding of a project is being undertaken before moving a project to apply for Catalyst funding?  \nThe proposal needs to clarify where Catalyst fits into the timeline of fostering proposers.", "q0r": 2, "q1": "The budget provided by the proposal incorrectly totals $43,000 instead of the $29,000 applied for.  This needs correcting before it can be evaluated as appropriate.\n\nThe team is currently limited to the proposer who is a stake pool operator and lists software development experience, and business experience, but provides no accomplishments in any similar project on Cardano.  The proposer does not mention building any online platforms previously.\n\nThe proposal does not say what form the launchpad platform will take or if they have built anything similar previously.  Given the existence of many free collaboration tools, messaging services etc.  It should be clarified by the proposal what the platform will look like, or links provided showing similar platforms etc.\n\nNo detail is provided on what training 2 developers as “training mangers” involves for $12,000 or who these team members will be or how they will be sourced.  It is unclear whether the training is for these people to become developers, or if developers are being trained to become training managers?  What exactly are training managers?  \nIt is also unclear who these training managers will train.  Do they train and certify the idea-proposers in developing coding skills on Cardano?  Or do they train anyone interested in learning these skills?  Idea proposers may have no personal interest in learning complex coding, rather they may need those who do have those skills.\n\nI consider it unlikely this proposal is feasible given it is highly dependent on as-yet-unknown future key team members to be found and trained, provides an incorrect budget and the proposer does not list any building of online platforms in the past, or any accomplishments with a similar focus.", "q1r": 2, "q2": "The proposal provides basic milestones on the completion dates of the different aspects of the platform, but does not list any KPI’s for the success of the launchpad.\n “Idea 360” appears 3x in the timeline when it looks like it should only be mentioned twice.  No KPI’s are listed for numbers of ideas fielded, fostered, submitted to Catalyst, people trained, developers certified etc.  Therefore, insufficient information has been provided to assess the progress in attaining its stated goals.", "q2r": 2, "assessor": "z_assessor_1614", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "There are many good ideas around all parts of India who want to implement, still due to lack of support or equipment , people couldn't complete the projects , so this proposal definitely help those ideas to complete and bring lime light to such projects, and help in getting more sponsorships towards the project, which will definitely be a big boost to people who wants to implement new ideas in the future.", "q0r": 5, "q1": "The proposer has 20 years of experience, and even have built a team consisting of 45 members hence with given experience in the field , the proposed model can be implemented successfully.\nThe proposal has very organized manner of sector of platform , which shows clear idea on steps to select the ideas presented by the people , so with given organized manner and minimal risk  plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal doesn't contain the marketing strategy which will be used to attract the ideas, and what are steps that will be taken if the selected idea failed to complete due to lack of some tools.\nExcluding the above mentioned points the proposal has provided excellent different sections of platform, which gives idea about the organization chart of the company. \nWith provided detailed roadmap and budget breakdown, The information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal preset a very interesting idea to build a Cardano launchpad. However, from my experience as an entrepreneur as well as from reviewing many proposals on catalyst since fund 6, it seems that the proposal still missing a lot of information and it seems that it mainly includes the headlines of the various solutions. It would have helped to have more details to be able to understand the Impact, Feasibility, and Auditability.  The proposal does not necessarily focus on India which I think is important for the challenge and it could have been presented as a POC. Missing also key metrics for the proposal. The proposal success mention that “This project will focus on bringing some of the greatest developers from India and around the world into the Cardano development ecosystem.” but it is not clear how it is going to achieve it and there is no estimation of how many developers will join. It is not clear what is being built, is it a CRM for proposals or a lunch pad for Cardano. The Budget requested is 20% of the challenge and I would have suggested either making a very detailed plan and relating it to the challenge or asking for a smaller amount and trying to have a POC.\n", "q0r": 2, "q1": "From the relevant experience section, the proposer seems highly experienced. However, there are no links and references to validate the information or the relevant skills and experience needed to implement the proposal. The proposer identifies the type and number of team members required to implement the proposal but without many details and does mention if the team is already available with more info about the members. The budget is outlined clearly and broken down into identifiable items. The budget seems reasonable for the tasks mentioned but as the goal is not clear/detailed and there is no matrics it is difficult to evaluate if it is reasonable overall for the objectives of the proposal. \nAdditional funding will probably be required to implement the proposal and the proposer has not provided a verifiable plan in this regard. \nIt is difficult to evaluate if the proposal offers a realistic timetable to complete the work and if the plan describes the resources necessary to implement the proposal as a lot of details are missing - there are only headlines with very short explanations. The proposer has considered one challenge but it did not really explain how it is going to be mitigated.\n", "q1r": 2, "q2": "A roadmap with milestones and a time horizon for achievement is provided but again there are minimum details and not clear what exactly the solution is going to be. Therefore, it will be difficult to audit it. There are metrics/KPIs that define the success of the proposal. There the targeted problem is explained and also what success will look like relates to the problem. However, yet again the proposal lack detail to support it. At the what is success the proposer presented that it will be “successful catalyst projects” and “available developers for the Cardano ecosystem” which is good, but I recommend including it in the proposal with some specific targets so the community could evaluate the proposal golas and track results. ", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal intends to build a Cardano launchpad, bringing some of the greatest developers from India and around the world into the Cardano. Sections of the launchpad include: Idea 360 farm; idea 360; Milestone 360; Idea 360 Market; etc. The solution addresses many aspects of the challenge. A potential risk of finding developers and getting them certified on the platform is correctly identified. Mitigation solution, however, has not been proposed, posting the project success at risk. In summary, I still believe that the proposal effectively addresses the challenge.", "q0r": 4, "q1": "Project timeline is presented in a general manner, in term of month. Program for training the two developers should be prepared and presented in term of week. The proposal requested budget is broken down but not at the assessable details. For example, one requested budget component is Developer Certification 360 - $8000. If this component is broken down to how many developers, for how many months, and cover any other cost or not, then it would be perfect. Project team members are provided meagerly, no detail on expertise as well as reference links provided. It is hard to verify founder team information as well as to examine if their expertise and experience are suitable for project development. In conclusion, given experience and plan presented it is questionable if the proposal will be implemented successfully. ", "q1r": 3, "q2": "Project progress is roughly provided in term of month. At this stage of proposal, a finer progress is expected, e.g., in term of week. Besides, definition of success is not measurable, neither. The proposal is new one and has not been funded before. This idea is new submission to Catalyst for funding. In summary, the information provided is insufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "This proposal wants to build up a platform to help Indian proposers write proposals from the first day they pop up until the day they submit them onto Ideascale. This platform also helps connect people who are passionate about Cardano/ Catalyst and build teams if needed. Talking about the idea of this proposal, I think that it’s nice and necessary for the community. Its goals also align with this challenge setting. \n\nHowever, I can only rate 3 for its impact. The proposer doesn’t provide clear key metrics for the goals. Without key metrics, the proposal is just an idea. It’s very challenging for voters/ CA/ vCA to define how impactful this project is. \n\nKey metrics must be presented with fully-detailed & correct criteria to assess the progress and the achievements of the proposal. I advise the proposer to specify the metric of “building a working system that farm curates and foster successful Catalyst projects” because it’s now too general. \n\nHow could we know that if Indian people join this training programme, they will write better proposals than joining other communities? How to measure the training quality? Questions like these could be some guidelines for the proposer to set up key metrics for success.", "q0r": 3, "q1": "I disagree that this proposal will highly likely be implemented well because of several reasons:\n(1) Since this is an educational project aiming to attract Indian people/ developers, build a team to train them about Cardano, and give certificates for the qualified ones, the skills & experience of the educators are key. However, this proposal seems like not have a team yet. The proposer introduces himself as an engineer and pool operator. At least, the proposer should have some experience in submitting proposals on Catalyst or was a member of the challenge team, or some other relevant skills and experience about proposing ideas onto Ideascale - to instruct other people. \n\n(2) To be more reliable, I advise the proposer to attach the profile/ CV/ LinkedIn of all team members in the proposal. \n\n(3) About the budget, I think it needs to be broken down even smaller. Additionally, I have assessed many proposals from several funds but I haven’t seen any proposal asking for $12,000 for the position of project manager. I personally think that this is too high. If the proposer wants to keep this budget for this position, I suggest he clarify more about the scope of work and the number of hours for working. About the cost of training 2 developers and managers in 6 weeks (also $12,000), it should be broken down into how many hired people and how many hours they do the job. Another point, $8000 for developing certification should be clarified as well. \n\n(3) Timetable should be estimated and added to the proposal because that’s the requirement of Catalyst. \n\n(4) Risks and challenges are the topics that we discuss after we plan every step for a proposal as well as we could.   \nAbout the risks and challenges that the proposers presented in the proposal “finding the developers and getting them certified on the platform” is not really a risk or a challenge, it’s a part of the plan of how to implement this proposal. This proposal is lacking the step how to attract people to join the programme.", "q1r": 2, "q2": "This proposal hasn’t provided me with enough information to audit its progress to achieve success. Time horizon should be added to the roadmap. The key metrics, as I said above, need to be set. After having correct key metrics, detailed KPIs should be filled in afterwards. \n\nAgain, this is a nice idea. I searched for the community of Indian people on some social media channels like Discord, Telegram, Meta, Youtube and see very little engagement (official Telegram of Cardano India & Sri Lanka has only 98 members at the time), I think that if the proposer works more on this project, it could be a great help for his people in the future.", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "360 Development wants to build a collaborative platform to take ideas from start to finish success.  We plan on building a Cardano launchpad", "experience": "Stakepool operator Paradise Staking PARAD.   20 plus years in building businesses in both brick and mortar to software development.  I have built my team to over 45 team members in my previous business Wireless Paradise.  I have developed an LMS and many other applications."}