{"id": 383036, "author": "francek", "title": "Philanthropy & positive change", "url": "https://cardano.ideascale.com/a/dtd/383036-48088", "category": 26248, "amount": 18000, "description": "Людям иногда нужна помощь (материальная, эмоциональная, финансовая...), но они либо не знают, где ее попросить, либо стесняются этого.", "funded": 0, "upvotes": 15288534, "downvotes": 22567284, "votes_result": 7278750, "votes_cast": 85, "f6_no_assessments": 5, "f6_rating": 2.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "The Cardano mission has a utilitarian and decentralized character and this proposal aims to connect people with each other based on their needs and is aimed to be a support network.", "q0r": 5, "q1": "While feasability for creating a website is likely, it is more important to consider possible risks and how to onboard members to use the site. The proposer or proposing team failed to explain how this website would replace existing websites that connect neighbors or that are targeted to connect people in need. There is \"nextdoor\", the horrible facebook that also allows for give/take/support connections between members, there is craigslist, ebay..... basically I think this is a good cause and very interesting idea, but the proposing team should provide an objective why this specific proposal might fill a gap. There is for instance no mention of what area this proposal is targeting - maybe adding this information might make it clear, that there is no alternative at the moment. Generally, the idea is interesting, the roadmap, the budget and the provided information about the geographic area, the proposing team and the KPIs are not enough to assess feasability and general relevance of the project. The proposer should address the risks of a platform that is connecting strangers to share personal information like their address and to maybe add the option of paying in crypto - which makes any phishing or social engeneering scam very possible. How will the website prevent fraud/ scams?", "q1r": 3, "q2": "The proposer did not provide proof of prior work, references or a clear roadmap with actionable steps. No example about how people might connect on this platform is given, it is not clear how this website would be marketed or onboard new members, it is not clear which country or neighborhood this website is for. The proposer should also do a risk assessment and provide information about measures to keep the data of the members of this website safe and how to prevent scams to occur if he or she or they plan to include crypto payments that are based on utilitarian transactions.", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 21, "ne": 9, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is too broad and doesn't have an engagement plan for its platform (besides the fact that there are already tons of identical solutions available everywhere). To improve the proposal, it's necessary to narrow the problem and connect it with the solution in question. ", "q0r": 1, "q1": "The proposer has provided no information beyond his/her own statement of experience as a webdeveloper. To make it stronger, I suggest bringing concrete or external information like a portfolio. \r\nBesides that, the proposer has provided no information about his/her experience in the problem's field: Phylantropy. ", "q1r": 1, "q2": "There's a roadmap, but no KPIs. The only metric available in the proposal is the rhetoric question \"was this challenge valuable to the community\". Therefore, the proposal should be improved on its products and KPIs to become better auditable.", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 21, "ne": 1, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The intention and idea is Nobel, however there are a large number of platforms existing to support his kind of initiatives. Even Twitter was used to coordinate such activities. A new platform will have the issue of sustainability and popularity. ", "q0r": 3, "q1": "The proposer has more than ten years of experience in software development and will technically implement the proposed site, technically. However, these initiatives require solid social networking and reach to produce meaningful results. ", "q1r": 4, "q2": "The proposal estimates that the \"the platform will be used actively internationally and its userbase will be growing\". It is a noble project and it hard to write negative about it. However, I feel there is a need for more information and how it is going to be better than many other social media platforms.", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "\"Philanthropy and making positive changes is always a great thing for the world and society to be able to make society better. With experience as a member of JCI, an organization with the goal of creating positive changes for the world, I completely agree with the proposer about the significance of the proposal to society. Creating a website to connect the poor and those who are in need of material and spiritual resources with those who want to do charity activities is a great idea.\r\n\r\nWhile the idea of ​​this proposal is generally great, I haven't seen the proposer mention target numbers like: How many people will the website help? What is the material and spiritual value that the website can bring? Website can connect with how many people are doing charity?\r\n\r\nTherefore, the proposer should set specific goals for the proposal so that we can see the impact of the proposal on society.\"", "q0r": 3, "q1": "\"The proposer has 7 years of professional experience in full-stack web development. So it is possible for the proposer to complete a website with all the features of the proposal.\r\n\r\nBut this proposal wants to connect many people around the world, so it is not reasonable for the team to focus all of their money on building a website. Because a website like this needs a lot of work to be completed such as: How to introduce and connect people who have problems in life with the website? How to connect website with charities? How can I confirm if the person in need of help has a real problem or is a scam?\r\n\r\nTherefore, in order to achieve the results of the proposal the team needs to have more people with experience in volunteering and community management to market and carry out various activities on the website. Besides, the proposer also needs to specifically list the clear goals of the proposal so that the proposal can be successful.\"", "q1r": 2, "q2": "\"All of the proposal's activities and outcomes are easily accessible through the proposal's website which is a great way to track the outcome of the proposal.\r\n\r\nBut I can't find any specific plan and KPI in this proposal. Therefore, we cannot know what results the proposal will achieve and what specific tasks through each stage of the project need to be completed.\"", "q2r": 2, "assessor": "z_assessor_645", "no_vca": 17, "ne": 3, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Offering material help is one thing, but often it is more than just material help that some people need, many organizations that offer material help have been developed in such a way that users come to pick up the stuff so that they can talk to the people and more assistance can be initiated so that they can also develop a social network in addition to material assistance.", "q0r": 4, "q1": "The proposer can use a partner with experience in the social sector. Will the users remain anonymous? Because there is a high chance that the users are ashamed. I would also recommend making the tool as accessible and simple as possible, people who need help don't always have the right (digital) skills. How are you going to make the tool known to the people who need it?", "q1r": 3, "q2": "A budget has been drawn up for the development of the tool, which seems logical to me. Will money only go there or are other costs also required? The success is only determined by the start of the tool, maybe also mention how you want to reach the users.", "q2r": 4, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Создайте платформу, где хорошие люди, которые хотят изменить чью-то жизнь к лучшему, напрямую связываются с нуждающимися.", "experience": "У меня 7 лет профессионального опыта в полнофункциональной веб-разработке."}