{"id": 366722, "author": "", "title": "Raise Catalyst's reach & awareness", "url": "https://cardano.ideascale.com/a/dtd/366722-48088", "category": 26120, "amount": 200000, "description": "How can we increase the reach and awareness of Project Catalyst to encourage meaningful participation and accelerate adoption of Cardano?", "f6_no_assessments": 1, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Just like the Events challenge from the same proposer, this feels like it is an attempt to redefine the weirdly named \"Catalyst Value Onboarding\" which is essentially about encouraging meaningful participation: https://cardano.ideascale.com/a/campaign-home/26106\r\n\r\nPerhaps this one goes a step further to bring in new people from outside Catalyst. I was hoping that one group specifically would be mentioned: ADA investors and traders who are still blissfully unaware of what we are doing here. They keep their ADA in centralized exchanges and while they might follow what is happening in the ecosystem they are missing out on opportunities to participate. I'd say that is a real \"low hanging fruit\" because it's easy to justify to them why they should join: to increase the value of their investment.", "q0r": 3, "q1": "Apart from notes like \"a media plan is required from all proposers\", this is a very relatable challenge and fairly easy to put into action. The tone of these remarks sounds like the proposer wants to sell his services to the rest of the community: \"This challenge aims to give professional and experienced marketers the financial framework to use their skills to increase Catalyst's reach and awareness.\" So, these things need to be reworded but the gist of the proposal is solid.", "q1r": 3, "q2": "You shouldn't limit the community's ability to innovate by limiting this only to \"Online marketing campaigns and Event marketing\". Any outreach efforts could fall under this challenge.\r\n\r\nThe language and success metrics still need to be reworked (in conjunction with every other challenge for Fund7).\r\n\r\nThere's one that I specifically don't like: \"Increase diversity of community: Number of countries represented in the community\". Diversity is a much wider topic than geographic dispersion of members. There's another challenge for this: https://cardano.ideascale.com/a/dtd/Increasing-Diversity-in-Catalyst/368363-48088", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1, "reply": "Instead of assessing the alignment, feasiblity and verfiablity of this challenge setting proposal, this CA mostly has shared his opinion about a different approach. But the statements don't explain how good this porposal matches the three criteria. Therefore it is not an adequate assessment. "}], "importance": "Project Catalyst is still very unknown. Raising awareness through coordinated campaigns will accelerate the adoption of Cardano.", "success": "Coordinated marketing activities that attract all types of talent to help build a diverse and successful community around Project Catalyst."}