{"id": 367430, "author": "", "title": "Fund Microlending Everywhere", "url": "https://cardano.ideascale.com/a/dtd/367430-48088", "category": 26120, "amount": 500000, "description": "What do 60%+ of Latin America, South East Asia, Middle East, and Africa's population have in common?", "f6_no_assessments": 11, "f6_rating": 3.7878787878787876, "videos": [], "media": [], "f6_assessments": [{"q0": "Microlending similar to Kiva would be a great idea. This has a big impact since most people in that part of the world can't access proper fund, and will have to pay high interest rate even if they do have access", "q0r": 5, "q1": "There are going to be a lot of challenges with micro lending in general, not to mention micro lending across the world in different countries especially with auditability, ensuring that the funds go to proper uses as well as recoverability rate, many lenders probably would not see their loan back", "q1r": 4, "q2": "It's very hard to audit the project especially with large countries involved, unless we have representative set up there as well.", "q2r": 3, "assessor": "e_assessor_1", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "The idea is quite intriguing, and aligns to some of the Cardano objectives to provide banking for the unbanked", "q0r": 5, "q1": "There is no detail about a roadmap, how the funds will be offered etc.", "q1r": 1, "q2": "It is not possible to determine what should be audited", "q2r": 1, "assessor": "e_assessor_2", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "The Proposal provides a challenge setting that would greatly add to the reach and functionality of the Cardano ecosystem, thus it very strongly meets the impact requirements as a challenge setting for fund 7.", "q0r": 5, "q1": "there should be a great many ways to meet the challenge setting should it be chosen for fund 7, i am excited to see the proposals written to meet this challenge.", "q1r": 5, "q2": "auditability should be quite possible with this challenge as it provides clearly delineated steps.", "q2r": 5, "assessor": "e_assessor_3", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "This likely would provide significant value to the ecosystem, if possible. However, the challenge setting proposer does not really provide much detail on the parameters for proposers to consider. While there are some simple key metrics and measurements of success they are much too broad and unfortunately are not fully thought through. At the next fund, I would suggest adding more details to help guide proposers. How will microlending support innovation in Africa? It is important to spell it out for people, not everyone has the knowledge or can make the logic leaps.  There is something here, just requires additional development. ", "q0r": 3, "q1": "Unfortunately, there are no real criteria or guiding questions that would be helpful to proposers who wish to enter this category. The current format is really unstructured and doesn't explain how the communities that need it would participate. They would need to be participating within Cardano, at least tangentially, and the challenge should also address this. Additional guidance on specific certain or communities that could be engaged first?  There is also a massive defi space on Cardano and this challenge does not mention it. Providing some guidance on how this challenge can leverage that space would also help strengthen this challenge proposal. Without a better idea of what and how this challenge is designed to address, it is not possible to know if it would be feasible. ", "q1r": 2, "q2": "There is no real way to provide audit capability for this challenge. The indicators provided are not specific enough for a challenge. I don't want to say that the budget is too much because it can easily be used and it exists within Catalyst. With that said, and for the reasons mentioned above, it is hard to know how impactful, feasible, and auditable this challenge would really be. As it's written now it is way too broad and sparse.  Some additional work at the next fund, with an inclusion of more success measurements, metrics, potential areas of focus, connections with DeFi and other microlending platforms, and finally, intended level of engagement with communities will make this a huge success. ", "q2r": 2, "assessor": "e_assessor_4", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "proposal aims to touch users in Latin America, South East Asia, Middle East, and Africa so wide reach", "q0r": 3, "q1": "unclear from the brief", "q1r": 2, "q2": "\"number of countries with projects funded, number of projects funded, number of people getting loans powered by the Cardano ecosystem\" give tangible metrics by which the project can be audited\n", "q2r": 4, "assessor": "e_assessor_6", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "This fund challenge has a big impact and could have a wide spectrum of users in areas that hve little to no access to traditional banking.  This could spark and create ideas that drive new users, assist with funding/donations to less representative areas.", "q0r": 5, "q1": "There are other chains that have similar solutions in place for micro lending and to assist with overseas payment system.  Projects should be able to be created to accomplish something similar since there are existing solutions across the blockchain space", "q1r": 5, "q2": "Projects can be measured with the KPIs set forth by the proposer.  As well as other ones similar to basic project management kpis.", "q2r": 5, "assessor": "e_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "Opening up innovation for other parts of the globe is mission critical to the Cardano blockchain. Given that our community is a global one, expanding operations on a global level is a logical step and crucial for scaling. This is a good idea to put up the choice to the voterbase so they can decide if it is time to make this move at this moment or not. \nThere is a vast influx potential. Innovation creates business opportunities and thus also name recognition for the entire ecosystem. \nThe challenge is written with a focus on microlending, which makes me wonder why not to see it broader and leave other options open. ", "q0r": 4, "q1": "The Cardano community exists of people from all over the world who live in various places, in various situations and see improvement opportunities. For this reason I see no issues to bring such a fund challenge setting to a good end. ", "q1r": 5, "q2": "The metrics are sufficient for a challenge setting of this kind, but there is no elaboration on the requested amount. In the comments it is clear that initially there was a demand for 800k USD, but it was lowered to 500k USD, which translates to roughly 9% of the fund budget. ", "q2r": 4, "assessor": "e_assessor_10", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "Microlending funding would be a very interesting challenge setting for a next fund and bring real utility to many people so this challenge setting proposal is in perfect alignment with Cardano's mission of banking the unbanked.\nCentralized microlending platform such as Kiva (the one Charles H. uses at the end of his AMAs) exist and are popular so we know their is actual use and demand for them. Decentralized solutions powered by Cardano would be a wonderful application of its technology.\nThis challenge is very specific though and very focused. Microlending capability depends on many things to work correctly. A way to improve this challenge would be to make it more open to all these requirements that would make microlending become possible.", "q0r": 5, "q1": "We just had smart contracts released on Cardano. Microlending, alongside smart-contracts, also requires working oracles and stable coin (Djed is currently being implemented) as well as working and established DIDs which are just about to be unveiled by the Atala Prism team (they have just started recruiting for their first pioneer program). All of these requirements were stated by Charles Hoskinson in one of his AMAs where he talked specifically about microlending (I've been watching his AMAs for several years now). We are close to having all that but I'm afraid it's just a little bit too early for our community to tackle this effectively as soon as fund 7 which will be starting just in a few weeks from now... Our Cardano ecosystem needs to be way more mature in my personal opinion.\nMicrolending for the unbanked also supposes a way for them to either, use their lent stable coin directly (using ADA would make pay back impossible if price jumps), or be able to transform it into the local legal money tender. The more we dig the more we can see that this is not that simple. In fact we could say that the day we have a successful microlending platform on Cardano that Cardano has reached maturity and is a total success.\nMicrolending will be a very natural solution and \"easy\" to create once everything is ready for it.\nSo because of all the above I can only set a score of 2 concerning this feasibility criteria.", "q1r": 2, "q2": "The current success criteria are ok if we take a very long term view but as I said in my previous comments this challenge setting would gain by opening itself to a broader view of what would make microlending possible.\nFor example if it were named \"Toward microlending\", it could finance research projects on the mater to build a working model that could be implemented once the technology is ready.\nSo I think that this challenge setting needs a little bit more work both in terms of technical study and in term of goals definition.\nGiven this I can only give a score of 3 in this Verifiability criteria.", "q2r": 3, "assessor": "e_assessor_11", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "Microfinance can have a direct impact on the lives of families in the developing world. Cardano can help to facilitate and organize this impact.  I believe this proposal to be a great challenge setting for fund7 as it represents a real need in Latin America, South East Asia, Middle East, and Africa. ", "q0r": 5, "q1": "I think the DeFi space and specifically Automatic Market Makers have shown how a borrowing and lending platform can be implemented in a decentralized way. I believe this could be extended to microfinance, with the specific aim of making it accessible  to those in need.   ", "q1r": 5, "q2": "I think the metrics provided footprint, number of projects/people funded is a great start. It would also be great to have a qualitative metric that shared the success and stories of the recipients of these micro loans. ", "q2r": 5, "assessor": "e_assessor_12", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "At the onset I thought Microlending proposals could simply fit into any of the current challenges be it Dapps & Integration or Defi & Microlending in Africa but on careful consideration I think it may well need to be a Challenge Setting on its own, one that is more global, caters to a broader user-base but targeted to the peculiarities of a people. Every country where micro-lending systems and processes could be deployed are nuanced. They may have differences in rituals & habits, regulations, practices and financial needs hence, we may well require country-specific lending platforms tailored to local communities and this is where a Challenge on its own may prove to be the difference between getting a proposal funded in one of the current Settings or for Cardano to truly provide a transformative pathway to aid people and assist in its global adoption. This challenge proposal is brief but it does provide the gist of the kinds of proposals it can foster. That said, it would have been better if the proposer expanded on its descriptions more and perhaps provided some examples of established micro-lending systems (even if its fiat) & the current state of these systems and their levels of impact today. That would have supported the argument for needing its own Challenge Setting. The proposer could have also elaborated more on what success looks like for both micro-lending users and for Cardano if this were to be approved. This would help voters imagine the kinds of possibilities and the future under this Challenge.     ", "q0r": 5, "q1": "The Cardano Community has coalesced on a mission to help the unbanked and improve the lives of many who'd been left behind. The proposal lists the regions in the world where a majority of them live and this brings to focus the kinds of proposals that could well target those communities. To this effect we as a community have the desire to support this Challenge and our drive is already more than half of any measure of feasibility. Can we do this? Yes we can. As already mentioned, this proposal would have benefitted from an expansion of the descriptions, not so much to pre-fill a form with unnecessary information but to simply paint a current state so that a future one could be seen by voters. I subscribe to brevity when the information is enough to get a point across and I agree this proposal, however brief achieves that. But since its success will depend on thousands of voters some of whom may not be as familiar with micro-lending practices and current uses and levels of success, this is perhaps a situation where brevity should have made way for an expansive rhetoric because it is a feasible Challenge. We have Catalyst members from across the globe and a lot are enterprising enough to respond to this challenge. I'm unsure how Challenge Settings are finalised but I hope, should this go forward, that it's finessed as suggested. I also would like to suggest the inclusion of the Pacific Islands in the description. Ethereum-based solutions for the unbanked have started there recently and unbiasedly I say, Cardano-based transactions can ensure they do not remain poor. ", "q1r": 4, "q2": "The Key Metrics for this Challenge have been set at a high level and could have been improved hence I only 'agree'. That said, they are enough to cover the essentials for a challenge. It would have been more meaningful if key metrics also included how the lives of people who would benefit from this challenge are measured but I guess that could be left up to the proposals themselves if this goes ahead. Catalyst may well have enough to audit this challenge going forward but the true measure of its success and ours is to know the kinds of impacts we have made to families, businesses and to people. I'm unsure if such a benchmark could be added at the Challenge level but it sure would have appealed to voters and to Catalyst if we have a way to measure the lives we change. ", "q2r": 4, "assessor": "e_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}, {"q0": "If managed well, this challenge is in line with the social mission of Cardano and could have a multiplying positive effect in the world.", "q0r": 4, "q1": "This challenge needs a great challenge team to coordinate it but, as it stands, a challenge team is not specified. This challenge is potentially confusing and could lead to a lot of small proposals rather than proposals outlining well thought out microlending platforms.", "q1r": 3, "q2": "The KPIs are not very well thought out. They are \"trailing measures\" rather than measures that would incentivize desired action and follow the \"what gets measured gets done\" logic. Each suggested proposal in this challenge should be able to outline their impact for People, Planet and Profit, i.e. the tracking should be directed towards social and environmental impact as well as financial sustainability.\n\nSome more ideas e.g. here: https://ssir.org/articles/entry/what_every_good_microfinance_business_should_track_and_why#", "q2r": 2, "assessor": "e_assessor_16", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0}], "importance": "They're underbanked but they are very resilient, they get out to work in any way possible and they can do wonders with small working capital", "success": "Open funding for microlending projects anywhere."}