{"id": 367618, "author": "", "title": "Infrastructure Boost in Africa", "url": "https://cardano.ideascale.com/a/dtd/367618-48088", "category": 26120, "amount": 300000, "description": "On a continent with subpar electricity and internet penetration, how can grassroots Africa help realize Cardano's potential & solutions", "f6_no_assessments": 1, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, fully agree. In principle, as a former social entrepreneur myself, I would be against just pouring money on to a problem and waiting for it to get solved. That's the giving a fish approach. This proposal, however, goes beyond teaching how to fish. It aims to fund the creation of 10 sustainable fisheries. :)  \"This challenge will therefore look for local implementors to acquire, equip and resource local community centres/hubs where communities can be mobilized to solve problems on Cardano.\" I think this is exactly the way to go. The only thing I would add is to try and get partnerships created as well, e.g. the abovementioned World Mobile co-sponsoring a location or other relevant players tagging along.", "q0r": 5, "q1": "This relies on the efficiency and effectiveness of the Project Catalyst process and, so far, it has proven to be a very good way to disseminate funding to worthy projects. Also the challenge team is experienced and I have all the confidence in them.", "q1r": 5, "q2": "This is the weakest part of otherwise spot on proposal. The success metrics and KPIs will need to be revised to not only track the outcome but also the process and the capability of the proposing teams to establish these community hubs. Finally, a question: will the challenge accept proposals from people who have already started their stakepools, education campaigns etc on the ground?", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "Without support, electricity and internet accessibility challenges will hamstring Cardano's overall potential and goal to bank the unbanked", "success": "Create well resourced Community Centres in African countries where communities solve local problems on Cardano & expand Cardano's market"}