{"id": 367912, "author": "", "title": "Already Approved Project Challenge", "url": "https://cardano.ideascale.com/a/dtd/367912-48088", "category": 26120, "amount": 250000, "description": "What more can projects that have already been approved and have successfully delivered value to the ecosystem with extra funding?", "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a very good suggestion because CAs need a way to focus on new and \"old\" proposals separately. It would be in everyone's best interest that the previously funded projects would \"battle it out\" between each other when applying for extra funding. This would hopefully discourage Catalyst-dependence in the long term.", "q0r": 5, "q1": "The CAs would appreciate the fact that each of the previously funded projects would have to play by the same rules when it comes to reporting results and applying for more money for the next steps. This would make the value-adding proposals comparable with one another and lessen ambiguity.", "q1r": 5, "q2": "The KPIs need to be worked on.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Funding for projects funded in previous rounds aligns with the Cardano mission of driving adoption of Cardano. Under the current funding process, there are many proposals that involve partial development of a product on the expectation that they will be able to get additional funding in subsequent funding rounds. It is entirely possible that the original challenge no longer exists in future rounds and that they may not be able to qualify under alternate challenge categories. Covering that use case is important since otherwise invested money is simply lost. \r\nI agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 4, "q1": "The intent of the challenge is to fund projects that have already met previous deliverables which demonstrates the technical capability to address the challenge. Whether this category is required depends upon how many multi-funding round projects that the community votes to fund.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and measurable.  \r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I agree with this proposal because I think that its important to  enable successful projects to grow to the next level. This I believe should be contingent that every project who gets funded through this is willing to help three projects which are in their initial stage of funding to grow to a successful level. This would be in all possible aspects, technical, developer, coding, non technical such as marketing, promotions etc.  This shows that the successful project is not only getting value from the community but also giving value to the Catalyst community. They should also be willing to offer the new projects their fullest support.", "q0r": 5, "q1": "The budget for this project is reasonable .", "q1r": 4, "q2": "The auditability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out.\r\nMetrics include Number of already funded proposals that are given funding and fullfill their specific metrics.", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}], "importance": "Projects that have been previously funded currently have to stand out again in the crowd of new proposals. Proven projects can add more.", "success": "Success is that quality projects receive the additional funding that they require to continue or finalize their vision."}