{"id": 368363, "author": "", "title": "Increasing Diversity in Catalyst", "url": "https://cardano.ideascale.com/a/dtd/368363-48088", "category": 26120, "amount": 150000, "description": "How can we as a community increase diversity, equity, and inclusion in Project Catalyst?", "f6_no_assessments": 2, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "I love Cardano and Project Catalyst. Don't we all. But the obvious lack of diversity is something that almost made me quit. I have brought it up a couple of times and I've been bluntly dismissed or ignored. That's why, I was so happy to read about this proposed challenge. We need to be more inclusive in our ways: that 73-year-old social innovator from Reunion Islands is not going to feel at home in English-speaking Discord. More diverse membership leads to more quality ideas. Naturally, we cannot be open for everyone. The sheer amount of languages in this world makes it impossible. But with a challenge like this we can level the playing field and make it easier for different kinds of people to find their way to Project Catalyst.", "q0r": 5, "q1": "Yes, this is very doable. We just need to understand that diversity is not introduced overnight (unless you do introduce quotas that everyone opposes anyway). It's a long process that can be nudged forward with a challenge such as this one. But it cannot be a one-off challenge. It has to be a permanent one. Even if we had 3-5 funded proposals in every Fund that proactively advance diversity, it's still a tiny fraction of all funded proposals.", "q1r": 5, "q2": "I would approach this from another angle. Now it says \"To change the world, we need to hear the voices of all cultures and constituents. We need diversity to build a just and equitable future.\" Well, naturally, yes. However, years of experience have shown me the importance of diversity when it comes to Organizational Learning and the capacity of continuous innovation and renewal. I have written my Master's Thesis on Diversity Management so I know what I'm talking about. Since Catalyst is all about innovation, I think that's the angle we should take.\r\n\r\nMoreover, we need to be super mindful of how to word these things. For instance, \"welcome diverse participants\" doesn't make sense. We are all diverse. Rather, state something like \"We welcome initiatives that increase Project Catalyst participants' diversity of background, education, gender, culture ... etc in order to increase perspective and to make the community more innovative.\"\r\n\r\nI would probably exclude geographical diversity because it might be easily misinterpreted and we would be swamped with proposals suggesting something for every little village in the most remote parts of Absurdistan.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 9, "ne": 6, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "This challenge is crucial to the achievement of Cardano's mission of enabling, empowering, facilitating, and accelerating progress in the blockchain space. In every mission, a human capacity participation is required to make it a success and every organization that has a mission and seeks to achieve it must consider the inclusion of participants from all walks of life when the need be. Cardano for instance is a community that needs to consider this practice. Why because the blockchain was built for all and if Cardano is working to accelerate it's progress, then increasing diversity in the Catalyst is the key.\r\nThis practice will pave way for entrepreneurs and developers from all over the world join the community without any fear of rejection, denial, and racism. \r\nOn top of it all, the team is made of people who have played massive roles in other proposals which have received funding before and they're delivering. They're mostly close to the grass and feel exactly what limitations people are having with regards to onboarding.", "q0r": 5, "q1": "The stated budget ($150K) is reasonable enough and it makes me strongly agree that the Catalyst Community has the capacity to address the challenge. \r\nYes of course there are so many benefits the Catalyst Community can yield out of an investment into the human onboarding space as a lot of proposers will come on board with technical ideas, lots of constructive community advisors will also show up as well voters from all over the world. \r\nThis challenge can also foster the adoption of Cardano and ADA in so many regions across the world. It's a win, win, win situation I see here.", "q1r": 5, "q2": "Success criteria and Metrics suggested in the proposal are set correctly to help the Catalyst Community measure progress and define success in the challenge. Looking at the Key Metrics in the proposal, it would even be very easy for the Catalyst Community to identify success and loss as they'll need to keep close monitoring on people joining the community everyday. An attention needs to be paid to their information submitted to help easy measuring of diversity. ", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}], "importance": "To change the world, we need to hear the voices of all cultures and constituents. We need diversity to build a just and equitable future.", "success": "Every culture and constituent has a voice in the conversation, and we build solutions that includes and elevates everyone."}