{"id": 369125, "author": "", "title": "DAOs <3 Cardano", "url": "https://cardano.ideascale.com/a/dtd/369125-48088", "category": 26120, "amount": 500000, "description": "How can we make Cardano the go-to choice for DAOs to manage themselves?", "f6_no_assessments": 2, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "DAOs is the most exciting feature blockchain has to offer and they are the  future. Focusing on building tools for DAO creation and support will increase traffic to the Cardano space. Many proposals on Catalyst will scale better if they become DAOs. Having a challenge setting that promotes and supports tool building for DAOs will help other proposals as well. This challenge could provide a springboard for Cardano adoption and advance Cardano's mission therefore aligning with two of the Fund 7 challenge setting guiding questions.", "q0r": 5, "q1": "The Catalyst community already has the Cardano vision and Catalyst in itself is an active DAO. They have first hand experience being involved in a DAO so they would know what kind of tools would be beneficial to help growing and maintaining the DAO. I have seen proposals and comments of people talking about creating their own DAOs. The Catalyst community definitely has the capacity to address this challenge.", "q1r": 5, "q2": "Key metrics to measure seems doable and a good indication of a successful challenge setting. Having more or better solutions to manage your DAO on Cardano than on any other blockchain seems like a good success definition and progress measure.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Making Cardano the go-to choice for DAOs aligns with the Cardano mission of growing the global Cardano community.  There are no established challenge funds that overlap with this challenge. With the new smart contract features and the upcoming digital identity services from Atala Prism,  Cardano will have all the necessary tools to implement decentralized autonomous organizations which are the natural next step.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "Smart contracts and DIDs are essentially all that is needed to implement DAOs. All the tools will be available by the time this challenge is funded.  By the decentralized nature of the Catalyst community, members are already motivated towards DAOs.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and measurable.  \r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "Blockchain applications have moved from trading to DeFi, to NFT. DAOs is what follows. Cardano needs to be ready for when that happens.", "success": "There are more and better solutions to manage your DAO with Cardano than with any other blockchain."}