{"id": 369268, "author": "", "title": "New SPO Business Opportunities", "url": "https://cardano.ideascale.com/a/dtd/369268-48088", "category": 26120, "amount": 250000, "description": "Stake Pool Operators are a key-success-factor of Cardano. With their infrastructure and capabilities, important new services can be created", "f6_no_assessments": 2, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Forming partnerships with the global community of sustainability stakeholders aligns with the Cardano mission of growing the global Cardano community and facilitating partnerships. The scope of the challenge does not overlap with any of the existing challenge funds although there are competing new environmental challenges in this fund. Cardano has many attributes that make it a more green and sustainable blockchain ecosystem than leading competitors so its a natural partnership. It also has the potential to bring in a lot of new users to the community.\r\nI strongly agree that this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "My understanding is that it will be one or two hard forks before many of the features which will allow SPOs to offer a large number of services. By the time this challenge is run and awarded the hard fork may have occurred however even if it has not then the challenge brief is flexible enough that setting up a solar powered hub in a rural village that could possibly provide electricity and internet access as add on services would also meet the challenge objectives. There is nothing in the challenge that cannot be addressed by the community and the budget is moderate. I think this challenge will also have follow on benefits even to those SPOs who do not win or are not participating as it will give them ideas on improving their business.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and mostly measurable.  \r\nI  agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "I agree with this proposal because  I think that Stake pool operators being a key part of Cardano Community, increasing them will grow the community. Providing new business models and income opportunities makes things more attractive for them to come. More stakepools means more users and more coins generated. This will widen the reach of Cardano.\r\n\r\n", "q0r": 5, "q1": "\r\nThe budget for this project is reasonable . I would even increase it to 500,000", "q1r": 5, "q2": "\r\n\r\nThe Verifiability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out.\r\nMetrics include \r\nAre submitted funding mechanisms faster than Catalyst? How Scalable are they ? would it scale to 10x? 100x? 1000x?  How Transparent is the mechanism? Is it open, auditable, and enables transparency of decisions, funding, and results? How Accountable is this proposal? What is the reporting requirement? Are funds disbursed over time based on performance? How impactful is this proposal?  ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1}], "importance": "Being an SPO shall be economically attractive. In addition to this, there are great opportunities for adding new ideas & services", "success": "The overall business model of SPO's can become even more attractive and we can add new features and services for driving decentralization"}