{"id": 369278, "author": "", "title": "Global Sustainable Indep. SPO's", "url": "https://cardano.ideascale.com/a/dtd/369278-48088", "category": 26120, "amount": 100000, "description": "How can we promote a decentralised, globally distributed and sustainable pool of operators to run the Cardano network", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A decentralised globally distributed and sustainable pool of stake pool operators aligns with the Cardano mission driving adoption of Cardano however the creation of community stake pools is included in other challenges and the Cardano stake pool operator delegation supports smaller stake pool operators.\r\nI neither agree nor disagree that this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 3, "q1": "The catalyst community definitely has the technical capabilities to address the challenge. Challenge funds being used to stake initiatives leaves ongoing concerns such as when the spo  eventually shuts down or the community wishes to pull its ada out of the stake due to underperformance or for another project. Best to leave staking initiatives to the Cardano stake pool operator delegation which already has the processes in place to actively manage staking.\r\nConcerns about centralization within large hosting platforms are definitely warranted as are sustainable energy concerns.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question.\r\nThe key metrics are relevant to the success criteria and are measurable. \r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "\r\nI agree with this proposal because  I think that having a large number of Stake pool operators who are spread all over the globe will be vital for ensuring safety and security of the entire network.  This will widen the reach of Cardano.", "q0r": 5, "q1": "The budget for this project is reasonable .", "q1r": 5, "q2": "\r\nThe Verifiability of this is clear. Metrics have been identified, a roadmap has been laid out to be carried out.\r\nMetrics include \r\ndispersion of stakepools around the globe, amount of community funds in ada staked to projects/ngo based SPO's, number of verified unique hosting providers/self hosted infrastructures used for SPO's, number of stakepools using green energy primarily.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}, {"q0": "This idea seems to align with Cardanos mission on several fronts, including but not limited to the below.\r\n\r\n1. As Cardano is looking for a self-governing community, this proposal aligns by focusing  on  a \"diverse and healthy ecosystem\" of stake pool operators from around the globe, which is a great way to ensure a well represented population.\r\n\r\n 2. I would of never thought about the \"multitude of infrastructures\" being important, but it made me think about centralized infrastructures risks and limitations. ", "q0r": 5, "q1": "What really caught my eye here was highlighting the importance of assisting new delegators in choosing where to stake their ADA. As someone who recently went through this, it resonates as something that could help direct funds in a better and more \"sticky\" experience.\r\n\r\nI would have given 5 stars if there was some information on the credibility of the team or experience to execute, but it still felt like a 4 star given the theme of the challenge and the general more \"subjective\" feel of this challenge.", "q1r": 4, "q2": "I thought the KPI's provided were very relevant and would allow for an easy and flexible way to verify the projects success over time.\r\n\r\nThe focus on green stake pools and their importance and also relevance to \"new\" users is interesting. ", "q2r": 5, "assessor": "z_assessor_503", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The challenge is critical to cardanos mission as it promotes the decentralization and disbursement around the glove of cardano SPOs. It also is aligned with cardanos sustainability mission as it promotes green energy usage. It seeks to measure all of these as well.", "q0r": 5, "q1": "With numerous stake pool operators and members of the community with a wide variety of experience, we will have the expertise to tackle this challenge. We will also have the voices and opinions to make sure we address a solution that is beneficial for the community as a whole.", "q1r": 5, "q2": "Measuring the geographical dispersion, the number of unique SPOs, and the number of SPOs running on primarily green energy are the exact measurables we want for this challenge as we strive for a global and sustainable ecosystem.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The decentralization of stake pools is critical to the long term success of Cardano.  This fund challenge would give space for proposals enhancing the regional, network, and energy decentralization of the network.  It could also help delegators select pools which align best with the security of the Cardano network. ", "q0r": 5, "q1": "I have seen proposals in previous funds that would fall within this category.   while I worry that there may be a shortage of ideas to fill a whole challenge category, I hope that the incentive of available catalyst funds will attract a variety of proposals. One goal that I see as problematic is the verification of green energy usage by pools. ", "q1r": 4, "q2": "The four metrics given by the proposers are  easy to track, although the verification of renewable energy use presents certain difficulties. ideally we would see the emergence of Alliances that provide resources to delegators and SPOs, and encourage decentralized infrastructure and energy sources. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}], "importance": "A globally distributed self-reliant network is the best defense against a number of major threats to the network", "success": "A diverse and healthy ecosystem of stake pool operators from around the globe collectively run the network on a multitude of infrastructures"}