{"id": 369449, "author": "", "title": "DeFi and Microlending for Africa", "url": "https://cardano.ideascale.com/a/dtd/369449-48088", "category": 26120, "amount": 250000, "description": "How can we enable the creation of micro-lending and Defi dApp solutions that fit the African setting?", "f6_no_assessments": 2, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Enabling DeFi and Microlending in Africa aligns with the Cardano mission of driving adoption of Cardano however this proposal overlaps with two other established challenge funds one specific to Africa and the other to DeFi. Duplicating challenge funds hurts Cardano's mission since it prevents other critical challenges from being funded.\r\nI disagree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 2, "q1": "DeFi and Microlending for Africa is new to Fund 6. There are 12 proposals (15th largest of 18 Challenges) being assessed for $90K. The number of proposals was quite small relative to the size of the fund compared to other challenges which is indicative that this challenge is too specific. Despite the small number of proposals in Fund 6, the challenge is more than doubling its funding request in Fund 7.\r\nI disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 2, "q2": "The success criteria are relevant to the challenge question. \r\nThe key metrics are relevant to the success criteria.\r\nI  strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This project will help empower many people both economically and in their access to Cardano. It touches the african adaption related and DeFi challenges as well. This would be a good choice of a challenge.", "q0r": 5, "q1": "Since a lot of devs and defi experts are part of the community, also specifically some with ties to african adaption efforts. This means the community has the capacity to adress this.", "q1r": 5, "q2": "The success criteria and metrics are clear and intuitive and match up with the topic of the challenge.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "importance": "Microlending and DeFi dApps targeted specifically to the African context & based on historical cultural norms will accelerate user adoption", "success": "At least 5 viable projects with implementation plans for DeFi dApps, micropayment and microlending solutions in Africa"}