{"id": 369593, "author": "", "title": "Equip the Economically Excluded", "url": "https://cardano.ideascale.com/a/dtd/369593-48088", "category": 26120, "amount": 200000, "description": "How can Cardano provide the resources to enable economically excluded people to run their own projects ?", "f6_no_assessments": 2, "f6_rating": 3.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I believe in the power of the DAO and helping the economically excluded to harness that power and uplift themselves and their communities will be a great way to show the world the positive and powerful effects that a DAO can bring. Together with Cardano this could drive the masses to adopt and use these technologies to improve their own lives.", "q0r": 5, "q1": "There will be different ways to go about this. One way I can imagine is teaching small communities to run stakepools and start building from there. I am sure the Catalyst community will come up with bright ideas. Transferring knowledge to the excluded is a win win at the end of the day. Getting people on the ground to transfer that knowledge, might be challenging. Budget allocation seems fair for a start.", "q1r": 4, "q2": "The vision for this challenge is clear and the results this challenge may bring can be very beneficial for Cardano and for the economical excluded out there. The proposals that originate from this challenge could change peoples lives.  Success is defined with a few valid key metrics to measure. One potential risk is how would they rebuild their DAO should some major event happen that destroys everything they worked for. The proposals should include safety  protocols to makes these DAOs resilient to risks and challenges.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "Equiping economically excluded communities to run their own projects aligns with the Cardano mission of growing the global Cardano community however this partially overlaps with geographically based initiatives.  It is not clear to me how to handle funding requests for the near infinite number of potential self defined communities.\r\nI neither agree nor disagree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 3, "q1": "The challenge is defined so narrowly that it requires economically disadvantaged leaders to run teams of economically disadvantaged people who need training but can still successfully deliver a project. I don't know if there would be enough community members fitting that description to make it a meaningfully competitive funding process.\r\nI neither agree nor disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 3, "q2": "The success criteria are relevant to the challenge question. \r\nThe key metrics are relevant to the success criteria. Not sure what is intended by \"priviliged knowledge\"\r\nI  agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "importance": "To \"create possibility for the many, as well as the few\", Cardano can equip the economically disadvantaged to build their own solutions.", "success": "Autonomous solutions built by economically disadvantaged communities."}