{"id": 369634, "author": "", "title": "Grow Africa, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/369634-48088", "category": 26120, "amount": 500000, "description": "How do we grow the Cardano ecosystem in Africa?\n\nThe same way we do everywhere, focused initiatives!", "f6_no_assessments": 4, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Growing the Cardano ecosystem in Africa aligns with the Cardano mission of growing the global Cardano community. Cardano cannot be a global community without African participation\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "I really like that the proposer has set down a marker of 6.25% of the Total Funds available as it gives a starting point for a conversation on what is a reasonable percentage of funds to dedicate to grow the Catalyst community in specific regions. The current funding model is an all or nothing approach which is problematic. Setting expectations as to what is a reasonable fund size helps proposers, CAs and voters in their decision making. \r\nThe fairest way to allocate funds to specific communities should be based upon community size. Africa represents ~15% of the global population therefore using the 6.25% Total Fund guideline if spread out equally on a global basis that would mean that would mean 41% of the Total Fund should be set aside for growing the Catalyst community within specific regions. Personally, I would favor 20% set aside for localization however 40% is not an unreasonable number given the push to rapidly grow the community.\r\nI agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 4, "q2": "The success criteria are relevant to the challenge question. \r\nThe key metrics are partially relevant to the success criteria but some are not readily measurable. I don't think a \"fund me so I can become a Plutus Pioneer graduate\" proposal would be considered valid by most community members however the metric would suggest it to be so.\r\nI agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I agree with this proposal because Africa is one place that is subject to exploitation and inequity at all levels and all fields. As it is, the Cardano community is heavily based in North America and Europe with most proposers coming from these regions and most projects catering to these areas. Even opening and financing wallets is a cumbersome process in Africa and Asia.\r\n", "q0r": 5, "q1": "\r\nThe budget for this project is reasonable .", "q1r": 5, "q2": "\r\nThe Verifiability of this is clear.\r\nThe metrics include \r\nThe number and quality of funded proposals originating from Africans themselves.\r\nAn increasing number of Plutus Pioneer graduates from Africa.\r\nGreater and more economical communication between African members of the Cardano community due to infrastructure improvements.\r\nA higher number of Africans involved with the Catalyst community.\r\nSolutions created by Africans to problems that people all over the world share. \r\nSolutions built by Africans for Africans will be able to better identify with the population. They will have more credibility and trust because people will know its not being built by outsiders, Westerners with vested interests that may be different from their best interests. \r\n\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}, {"q0": "The proposal raises a very important issue to have the Cardano be known globally. Focusing on Africa by Africans, and people who know very well the continent is a great approach. \r\nThe proposal is scalable, align with the issue, and the impact is local, regional and global, with the bottom line to get the be known in various regions  (African) by new people and communities.\r\n", "q0r": 5, "q1": "The proposer doesn't mention anything about their experience in managing such a big project. Either about people they'll be working with. readers of the proposal may understand the idea behind it, but they won't know exactly how will it be implemented. Also, giving details about the requested budget would inform more, and a timeframe, even though the target is the Fund-7\r\nI neither agree or disagree with this proposal.", "q1r": 3, "q2": "6.5% of the funds from the Fund-7 would be allocated to this project as the Proposer is requesting. This needs a certain auditability and liability to the community that have to be clearly mentioned in the proposal, so people would trust abut the use of funds.\r\nAs presented, the proposal seems risky.\r\nI disagree with this approach but still believe in the idea that will have to be well structured", "q2r": 2, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "I like the general idea of helping Cardano organically spread in Africa, i.e. where (given the current socio-economic situation) the impact potential is very high (a lot of things that significantly improve human condition can be achieved with relatively lower input costs). This proposal perfectly adresses such an ethos and it is a praiseworthy attempt to bring in more African projects for Fund7.\r\nHowever, that being said, I'm missing a proposal of a more granular prioritization scheme for future African-based projects. More specifically: I believe we should prioritize not only on the scale of what network effect (among African developers or other stakeholders) the project will bring, but also how this future Fund7 challenge is able to incentivize African developers to tackle high-impact projects. By this \"high-impact\" I mean both for their local communities, but also from the global perspective (and give the very specific condition of Africa, many solutions to local problems can have much larger positive global effects in the long run).\r\nI think that e.g. a future Decentralized Crops-Insurance project proposal should be given a higher priority than a new Microlending platform, which itself should be given a higher priority than a yet-another-micro-payment-system-this-time-based-on-cardano-in-africa, which still should be higher than e.g. a NFT platform for African rappers.\r\nI mean this as a very illustrative example, don't take it literally, but I think you get the point ;-)\r\nAnyway, I think what could really improve the current proposal, is to include such an impact-based prioritization mechanism. Perhaps based on something  along the lines of Effective Altruism, or some other more African-facing rationalist movements that have already identified what development streams could make the biggest long-term positive impact on Africa.\r\nIf such a prioritization is present, I gladly give 5 stars. Now I'm on 3, which means \"really good, but I'm not so sure about the ultimate impact\".", "q0r": 3, "q1": "This is quite a specific topis, Fund7 challenge setting, where there is no need for a full-stack development team etc. It's more on the community meta-level. Still, somebody from the team will have to do the challenge presentation, facilitate breakout sessions, lead a challenge retrospective, track key metrics, etc.\r\nUnfortunately, this project proposal has no team introduction or anything like this. I can only judge from a) how the proposal is written (and it's written well, in a structured and coherent way, etc.), and b) what else can be found about Steve Lockhart on Ideascale - he's involved in couple of other proposals, one of them being much more elaborated (Planting Roots in Africa).\r\nSo much gut feeling tells me that Steve will be able to handle all these. Hence 4 stars. I'd give 5 stars if I could see the proof here with this proposal.", "q1r": 4, "q2": "The proposal states clear set of KPIs, which I find sufficient. I would add one more KPI - how the Fund7 challenge projects are impactful for Africa, but I've already discussed this in the \"Alignment\" section (where I gave less points because of this). So full points here because I don't want to discount the \"lack-of-impact-KPI\" issue twice. And the currently proposed KPIs are really sufficient.", "q2r": 5, "assessor": "z_assessor_634", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "importance": "The Cardano community is heavily based in North America and Europe.\n\nGrowth elsewhere requires our support and initiative as a community.", "success": "A wide spectrum of people across Africa, or from Africa, coming together and forming teams to grow our ecosystem with tools provided by us."}