{"id": 369659, "author": "", "title": "Anti-scam & anti-fraud campaign", "url": "https://cardano.ideascale.com/a/dtd/369659-48088", "category": 26120, "amount": 500000, "description": "Is there a way to outplay the scammer?", "f6_no_assessments": 2, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Conceptually an anti-scam and anti-fraud challenge aligns with the Cardano mission of ensuring stakeholder accountability however this challenge needs some editing and clarity about intent especially the Challenge brief, in which there are statements which are not conducive to a decentralized community.\r\nI neither agree nor disagree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 3, "q1": "While the Cardano Foundation may have the means to negotiate with third parties the terms requested in the challenge brief, the Catalyst community does not have means to do so.\r\nI strongly disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 1, "q2": "The success criteria are partially relevant to the challenge question. What is meant by, \"less fake and more real world\"?\r\nThe key metrics are partially relevant to the success criteria but not readily measurable. What investors are being referred to in \"Increased number of investors\"?\r\nI neither agree nor disagree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "It is indeed very important to keep scammers off the network to prevent Cardano from loosing its credibility. However the proposed measures seem a bit extensive and some of them rather than a pitch instead of an open challenge.", "q0r": 4, "q1": "I think it is a really extensive challenge where a lot of Cardano users could put in their different competencies. While most topics the fommunity does have the capacity for, some, like e.G. affecting legislation are probably outside of their scope.", "q1r": 4, "q2": "The challenge proposal could be a bit more structured, and some parts of the challenge brief are a bit uncomprehensive. The key metrics and success criteria could be a bit more detailed. This all would help give proposers a better idea what kinds of projects they could propose and how those would need to be structured.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "Making people fair treated and satisfied is in the core of Cardano ideology. People are coming. But good sign is when people are staying.", "success": "Less scammed and lied people among Cardano community. \n\nLess leaving people and more newcomers. \n\nLess fake and more real world."}