{"id": 369705, "author": "", "title": "Connecting Japan/日本 Community", "url": "https://cardano.ideascale.com/a/dtd/369705-48088", "category": 26120, "amount": 50000, "description": "How can we help the Japanese community to adopt Cardano and connect with the Catalyst community?", "f6_no_assessments": 2, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Helping the Japanese community adopt Cardano and connect with the Catalyst community aligns with the Cardano mission of driving adoption of Cardano and growing the global Cardano community.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The proposal identifies specific barriers that a sizable portion of the community experiences when trying to engage with the Catalyst community as a whole. The community has the skill set to solve these issues. The fund request is small however it does partially overlap with the established Multilingual Resources challenge. Is it better to have a broad multilingual challenge or smaller challenges specific to each language? There are pros and cons to both strategies.\r\nI agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 4, "q2": "The success criteria are relevant to the challenge question. The key metrics are relevant to the success criteria. The adopt Cardano portion of the challenge question is not mentioned in the success criteria or the metrics although there is a loose correlation between the two.\r\nI strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I agree on the idea behind it, I think the proposers idea to inter-connect Japanese members into Cardano community (Catalyst) is very good start that could benefit in lots of ways for both Japanese members as well for Cardano ecosystem. Based on my experience with Japanese colleagues - they will find it most helpful and respectful to translate some portions of Catalyst web/information to their language.\r\nHaving in mind the good idea and potential benefits to community I agree that this proposal effectively addresses the challenge. ", "q0r": 4, "q1": "Detailed step-by-step roadmap is not provided as well as the budget spending is not described.\r\nHowever the challenge team consisting of 3 relatively experienced members (but also unknown) could be enough to overcome any issues that might occur. \r\nUnfortunately many important questions remain unanswered, so I neither agree nor disagree that this proposal has a high probability of successful implementation. ", "q1r": 3, "q2": "The challenge team provided some measurable KPI's so the community can measure the success. Unfortunately the roadmap nor the time-frame is not provided which is a shame. So action plan must be updated to receive better score.\r\nAlso funding-wise there are some transparency issues with non-existing spending plan.\r\nBased on the given info, I neither agree nor disagree that this proposal provides us with sufficient information to review its progress. ", "q2r": 3, "assessor": "z_assessor_605", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1, "reply": "It is not entirely clear if the assessments views it as a challenge or as a proposal as it talks about a missing roadmap and a plan for spending the budget."}], "importance": "There has been early adoption of Cardano in Japan from the start but participation in Catalyst is relatively low", "success": "An active Japanese Catalyst community operating in Japanese and connecting with other parts of the ecosystem"}