{"id": 369764, "author": "", "title": "Seeding Cardano's Grassroots DeFi", "url": "https://cardano.ideascale.com/a/dtd/369764-48088", "category": 26120, "amount": 200000, "description": "How to encourage new teams to Deploy Defi Solutions on Cardano?", "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Deploying Defi Solutions on Cardano aligns with the Cardano mission of driving adoption of Cardano.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "With the new smart contract upgrade, Cardano has all the features necessary for DeFi apps and we have an experienced diverse community with the relevant skill sets to build these dapps. \r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge question. The key metrics are relevant to the success criteria. The success criteria is based upon the number of teams deploying DeFi dapps while the metrics are about number of DeFi dapps instead of teams. The metrics are probably more valuable to the community so I would change the wording of the challenge question and success criteria to focus on dapps instead of teams.\r\nI agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "\r\nI agree with this proposal because DeFi apps are the way both for financial independence for communities and countries but for wealth generation on a global scale without the currency and exchange rate inequities brought about by centuries of colonial exploitation. Our exchange rates are the way they are because of things done over the ages to uplift one country or empire at the expense of another country. \r\nDeFi and Cryptos level that playing field to some extent and bring everyone to the table with the same time opportunities as the other.", "q0r": 5, "q1": "The budget for this project is reasonable", "q1r": 5, "q2": "\r\nThe Verifiability of this is clear.\r\nThe metrics include\r\nHow many DeFi dapps were launched on Cardano mainnet within 3, 6 and 12 months after funding.\r\nHow many daily active users are the DeFi dapps funded in this cohort attracting.\r\nHow long does each dapp take to be launched.\r\nHow much Total Value Locked (TVL) are the funded DeFi dapps able to capture 3, 6 and 12 months after launch.\r\nNumber of bugs and vulnerabilities found in each dapp.\r\nAmount of resources lost due to bugs or vulnerabilities.\r\nNumber of users participating in testnets.\r\nNumber of token holders/unique wallet(when dapp has a token).\r\nDistribution of supply between the team and the community.\r\nNumbers of listed pairs (in case of DEXs).\r\nNumber of listed assets (cases of loan+lending dapps, derivatives and synthetic assets).\r\nNumber of articles and open source financial models research delivered to the community.\r\n\r\nCreating proper and strong DeFi applications will definitely strengthen the network, the upliftment of Cardano as a viable network and ADA as a viable currency for an increasing number of Financial transactions\r\n\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Community defined challenges are critical for Cardano community self-governance, and generate a unique way to achieve Cardano's mission.\r\n\r\nChallenge setting is different from other challenges as it's about proposing new challenges, whether regular challenges are about proposing initiatives to address challenges.\r\n\r\nThis challenge lays out very clear success metrics of atleast 4 teams in 2022 which I think is both an attainable goal, while also still allowing for stretch targets with \"atleast\". Go get em!\r\n\r\nA dozen different relevant KPI's show a willingness to address both the strengths and weaknesses of the possible outcomes of this challenge by including metrics like \"Number of bugs and vulnerabilities found in each dapp\" & \"Amount of resources lost due to bugs or vulnerabilities.\". I think its too easy to just focus on the positive metrics while ignoring the areas for improvement. Well done.", "q0r": 5, "q1": "This is the best laid out plan or feasibility I've seen so far (mind you I'm quite new!!). But I did think that the way the 25% cap per team is structured is a good way to help distribute the funds, but I especially liked how well thought out it was by adding the different examples and scenarios. This is very helpful.\r\n\r\nMaybe the only area that stood out for improvement were better links. While they are quite impressive hacks and huge #'s, it does set quite a high bar in terms of expectations. So maybe just clarify how 100,000 USD would help tackle such a massive problem.\r\n", "q1r": 5, "q2": "As mentioned earlier the goal setout in the defined success of \"at least\" 4 new teams deploying DeFi dapps allows for a simple and verifiable way to measure the overall success of this challenge proposal.\r\n\r\nThere does seem like a lot of KPIs to track and evaluate so not sure if thats an issue for verifiability, or if that just helps. Because im not sure I wont limit as its likely just my limitation of the area.\r\n\r\nWell laid out description in the challenge brief gave me the confidence here for 5 stars.\r\n\r\nInterested to maybe see a bit more plan for how the community might look and evolve?\r\n\r\nGood luck!", "q2r": 5, "assessor": "z_assessor_503", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "So that new teams can have a kickstart in their projects without having to resort to ICOs and VCs  allocation.", "success": "At least 4 new teams deploying DeFi dapps on Cardano in 2022 + Managing to form a community in order to gain competitiveness/susteinability"}