{"id": 369946, "author": "", "title": "Local Agriculture Market", "url": "https://cardano.ideascale.com/a/dtd/369946-48088", "category": 26120, "amount": 250000, "description": "The idea is to favor the economy of small farmers.  By financing their production, through a social distribution fund.", "f6_no_assessments": 3, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "  This Idea Proposer has potential to show the benefits of  \r\nopen permission-less system to show it benefits to small community.\r\n  But it is two broad and need to provide much more information on how success, should look like and be measured and supervised by Cardano community.\r\n\r\nAs Software Developer I would like to see much more clear plan on how Proposer would attack the challenge, and possibly separate the task on phases, so community could assess how previous phase have been done.   ", "q0r": 4, "q1": " I would like to see eventual team structure and skills required to address the challenge.  It would be good to have clearly staged plan for actions with Budgets attach to it. Some actual real scenarios and use cases would help for understanding the scope and actions required. ", "q1r": 2, "q2": "Please see my previous notes in terms of  Venerability, and providing community with enough information to assess the scope and goals of the project along with means to assess real progress on the project along with invested funds.  ", "q2r": 2, "assessor": "z_assessor_195", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "Cardano is about demoractizing finance and meaning that smaller players can have a say and making access to funding, this proposal aligns with that aim in that smaller farmers are often squeezed out by monopolies. By distributing and democratising local agriculture it feels to align to Charles Hoskinson vision of the future. ", "q0r": 5, "q1": "It feels like the sentiment is good, but smaller agriculture players need to get involved in the Catalyst community in order to have a say. Perhaps this challenge needs to be wider and loop in others who've had experience in the conservation sector also. ", "q1r": 3, "q2": "It feels as if the challenge needs to outline what good and bad looks like in a clearer challenge structure. Like how does the score vary based on effects on ecology environment and sustainability. Is there a bias towards using GMO products, mechanisation or other intensive practices in the proposals for the challenge, and how is that waited in scoring?  Perhaps example containing a sample proposal or idea that would be successful or not work at all. It should also potentially look into how consumers can be linked up with any agriculture related market.", "q2r": 2, "assessor": "z_assessor_332", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This is a proposal to fund the creation of a specific farming foundation and not a Fund 7 challenge proposal. The proposal would need significant editing to turn it into a challenge fund \r\nFunding the purchase of farms does not align with the Cardano mission. \r\nI strongly disagree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 1, "q1": "The community does not have the processes in place to oversee the purchasing and long term management of farms.\r\nI strongly disagree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 1, "q2": "The success criteria are partially relevant to the challenge question. The key metrics are specific steps and not metrics\r\nI strongly disagree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "importance": "The non-profit foundation helps farmers in the production of organic products, and favors exchanges with local customers.", "success": "Local customers will have organic products with a low ecological impact. Farmers will not suffer from the low price imposed by distribution."}