{"id": 370158, "author": "", "title": "Multilingual resources", "url": "https://cardano.ideascale.com/a/dtd/370158-48088", "category": 26120, "amount": 100000, "description": "How can we motivate non english speakers to learn and grow Cardano ecosystem in the next 3-6 months?", "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Motivating non-english speakers  to participate in the Cardano ecosystem is is key to meeting the Cardano mission of growing the global Cardano community.\r\nI strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "Multilingual resources is new to Fund 6. There are 41 proposals being assessed for $75K in funds which is quite large for a small fund. The increase to $100K probably isn't sufficient given the interest and how big of a constraint issue this is on Cardano's growth. $200K for Fund 8 would likely be reasonable.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "The success criteria are relevant to the challenge objectives. The key metrics are relevant to the success criteria. \"A sense of community and conversations. Having people around to talk with.\" is not a valid metric unless some survey of user's sense of community is envisioned. A better metric would be tracking the number of town hall/discord or other community forums are dedicated to non-english speakers.\r\nI agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "As a French speaker, I can relate to the challenge of participating in the Cardano community without the knowledge of English. Getting multilingual support is a critical component of adoption.", "q0r": 5, "q1": "Yes, through paid translations or community-let translations, we could address the challenge. Ideally, the requested amount would support community-led initiatives as it is relatively low for a compony-let one.", "q1r": 5, "q2": "Adoption will ultimately be an individual experience. However, metrics can be created in the multilingual repositories that the challenge could help create.", "q2r": 3, "assessor": "z_assessor_370", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "\r\nI agree with this proposal being important   because  multilingual platforms will allow non-English speakers to learn about Cardano and increase its adoption worldwide. It will open up vast parts of the population who cannot understand English at all and also those who can understand English but not the technical jargon that current courses are written in. If resources are in native languages in easy to understand vocabulary, it will increase their comfort level to participate both in use, in proposing and in developing solutions.", "q0r": 5, "q1": "\r\n\r\nThe budget for this project is too low.  At least 1,000,000 should be allocated.\r\n", "q1r": 5, "q2": "\r\nThe Verifiability of this is clear. Metrics would include\r\n \r\nWhat is the number of non-English speakers joining Cardano community\r\nWhat is the number of courses translated to different languages, from programming to stakepool operation and so on.\r\nWhat is the number of breakout rooms which are held in local languages. \r\nWhat is th level of activity in other languages\r\nHow many proposals come in other languages?\r\n\r\n\r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}], "importance": "Multilingual platforms will allow non-English speakers to learn about Cardano and increase its adoption worldwide.", "success": "Increased adoption and community engagement of non-English speakers.\n\nIncreased amount of resources in a variety of languages."}