{"id": 370152, "author": "", "title": "Proposer outreach", "url": "https://cardano.ideascale.com/a/dtd/370152-48088", "category": 26120, "amount": 200000, "description": "How can we encourage entrepreneurs from outside the Cardano ecosystem to submit proposals to Catalyst in the next two funds?", "f6_no_assessments": 1, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Attracting entrepreneurs  is key to meeting the Cardano mission of growing the global Cardano community however the challenge question is poorly worded. Do we want \"entrepreneurs from outside the Cardano ecosystem to submit proposals to Catalyst\" or do we want to attract outside entrepreneurs to join the Cardano ecosystem? Do we want \"outsiders\" submitting proposals unless they are committed to developing the community?\r\nI agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 4, "q1": "The Proposer Outreach challenge existed in Fund 5. There were 6 proposals successfully funded for $96,957 out of $100,000. In Fund 6, there are 29 proposals in the assessment phase for the $100K fund therefore the community has the capacity and likely the interest in funding this challenge up to the $200K of this challenge.\r\nI agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 4, "q2": "The success criteria are relevant to the challenge objectives. The key metrics are relevant to the success criteria. What is the definition of a \"new\" member? How long until someone is no longer considered new?\r\nI agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "Outside proposers will inject vitality and diversity to the community while increasing the overall quality of proposals.", "success": "Bright entrepreneurs, and specialized firms from across the globe learn about Catalyst and submit high impact proposals."}