{"id": 372914, "author": "", "title": "DApps & Integrations", "url": "https://cardano.ideascale.com/a/dtd/372914-48088", "category": 26120, "amount": 250000, "description": "What applications will provide the most value for end users in 2021?", "f6_no_assessments": 2, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Building quality Dapps and integrations  is key to meeting the Cardano mission of Driving adoption of Cardano\r\nI strongly agree his challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "The Dapps and Integrations challenge existed in Fund 5. There were 5 proposals successfully funded for $245,016 out of $250,000 therefore the community has the capacity and in the interest in funding this challenge.\r\nI strongly agree that the Catalyst community has the capacity to address the challenge.\r\n", "q1r": 5, "q2": "Given the timing of Fund 7 all references to 2021 should be updated to 2022. The metrics are measuring application transactions which are not necessarily linked to the number of users  or applications. It is a useful metric however the questions you are \"asking ourselves\" should be modified since they are not being answered.\r\nI agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "\r\nI agree with this proposal being important   because  Quality Dapps and integrations will increase utility & adoption of Cardano. Therefore ensuring high quality DApps and help the community in learning how it can be properly used is of vital importance to proposers, users, and others in the overall ecosystem. \r\n\r\n", "q0r": 5, "q1": "\r\nThe budget for this project is too low. It should increase to 1,000,000 at least\r\n", "q1r": 5, "q2": "\r\nThe Verifiability of this is clear. Metrics would include\r\nHow many new users came onto the platform? \r\nHow manynew, viable applications were built on top of Cardano?\r\nWhat was the Usage of applications developed during the challenge:\r\nNumber/growth of application output\r\nNumber/growth of application transactions\r\nTotal volume of Ada involved in application transactions\r\nTotal/growth of resource usage by applications\r\nNumber/growth of distinct addresses mentioned in application transactions\r\nIf the application uses tokens:\r\nNumber/growth of application tokens\r\nNumber/growth of distinct addresses holding application tokens\r\nViability of applications developed during the challenge:\r\nHow many of the applications are still being developed at the end of 2021?\r\nHow many of the applications made a profit for their creators?\r\nHow many of the teams which built the applications grew during 2021?\r\nHow many of the teams which built the applications built (or plan to build) another application?", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 9, "ne": 3, "ng": 2, "nfo": 4, "vca_o": 1}], "importance": "Quality Dapps and integrations will increase utility & adoption of Cardano.", "success": "Novel and viable applications get built of top of Cardano attracting users. Integrations manage to pull in more adoption."}