{"id": 381096, "author": "shawnim", "title": "ALLIN Betting DAO", "url": "https://cardano.ideascale.com/a/dtd/381096-48088", "category": 26240, "amount": 18000, "description": "Aucune application actuelle n'offre une expérience de pari tout-en-un, sans intermédiaire, avec de multiples façons de gagner du rendement.", "funded": 1, "upvotes": 52348240, "downvotes": 6681116, "votes_result": 45667124, "votes_cast": 185, "f6_no_assessments": 4, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Les proposants souhaitent avoir une DAO de paris. Vous pouvez parier avec d'autres personnes dans votre bureau ou dans le monde entier. C'est une proposition intéressante, car il y a toujours un désir de parier et cette solution fournirait une plateforme d'application décentralisée pour cela. De telles plates-formes permettront d'attirer davantage de personnes dans l'écosystème Cardano. Les mesures clés comme l'adoption et les adeptes sont valables et s'alignent sur les paramètres du défi. Les proposants ne mentionnent pas les défis futurs et les problèmes auxquels ils pourraient être confrontés, ce qui est un manque à mon avis en tant que développeur. En dehors de cela, je ne vois aucune partie majeure manquante dans la proposition. Par rapport à d'autres propositions, celle-ci semble assez unique et cela signifie moins de concurrence pour réussir.  C'est une idée intéressante qui pourrait avoir un certain impact sur la communauté des joueurs, mais qui aura un grand impact sur celle de Cardano.\r\n", "q0r": 5, "q1": "En effectuant quelques recherches sur LinkedIn, j'ai pu vérifier les membres de l'équipe ainsi que leurs compétences et expériences nécessaires à la mise en œuvre de la proposition. Le fait qu'ils aient donné leur nom me donne plus de confiance dans leur projet. Le nombre et le type de membres de l'équipe sont déjà connus et présents. Le budget est présenté, mais il pourrait être un peu plus détaillé. Par exemple, les services juridiques pour différents projets s'étendent de 2 000 à 10 000 et il n'y a aucun moyen de le vérifier. Il serait donc utile de connaître le nom du cabinet qui sera utilisé ainsi que son taux horaire, par souci de transparence. En tant que développeur, le calendrier fixé pour le développement semble réaliste. Je ne peux pas parler de la partie marketing. Il semble que les proposants ont un plan raisonnable pour la mise en œuvre du projet et ont une assez bonne idée de ce qui doit être fait et dans quel ordre.  Les aspects techniques sont mentionnés, comme les technologies et les langages qui seront utilisés et qui sont cruciaux pour la mise en œuvre. J'ai déjà mentionné que les défis futurs manquaient, et j'espère que les proposants ont laissé une marge pour eux. Il n'y a aucune mention d'un projet similaire, mais j'ai fait un peu de recherche et je ne vois aucune concurrence pour cette idée spécifique. Bonne chance aux proposants !", "q1r": 5, "q2": "En parlant de traçabilité et d'auditabilité, les auteurs ont mentionné les médias sociaux et les canaux discord mais n'ont fourni aucun lien concret sur lequel la communauté pourra suivre l'évolution ou l'activité de leurs projets, ce qui est très décevant. Les indicateurs et les KPI semblent pertinents, comme l'adoption par les utilisateurs, qui est, à mon avis, l'un des indicateurs les plus importants. Il y a une feuille de route claire avec des jalons tout au long du parcours, séparés par trimestre, donc le calendrier est correct. Pour être honnête, la description du projet pourrait être un peu plus claire lorsqu'on parle d'Allin Token et d'Allin stable token. Un exemple d'utilisation de chaque jeton aurait été d'une grande aide pour en comprendre le but. La solution répond au problème et est suffisamment claire.  Dans l'ensemble, je pense que la traçabilité du projet pourrait être un peu difficile si les auteurs ne tiennent pas leur promesse d'un canal discord. Et cette proposition aurait été le meilleur endroit pour mettre un tel canal pour commencer à développer une communauté. Bonne chance à vous et n'oubliez pas de créer ces canaux communautaires.\r\n", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Cette proposition correspond très bien à l'objectif du défi, puisqu'elle vise à créer une plateforme qui permettra de placer différents types de paris (jeux d'argent) et d'utiliser des jetons, le rendement DeFi et d'autres technologies pertinentes pour l'écosystème Cardano. J'ai trouvé que c'était une idée intéressante d'avoir deux types de tokens, un plus instable et un plus sûr, afin de pouvoir servir un public plus conservateur (ou moins risqué, dans ce cas, puisque nous parlons de jouer à des jeux de hasard). Il est également positif que l'équipe développe d'autres types de paris, des alternatives à la modalité de personne à personne, lorsque la possibilité de parier contre la blockchain est lancée. C'est important car le marché des jeux d'argent est en train de saturer, à mon avis, j'ai vu plusieurs propositions dans ce même défi qui abordent ce sujet. En dehors de ce nouveau type de pari, les auteurs décrivent de nombreuses modalités, ce qui rend très clair pour nous le fonctionnement des activités sur cette plateforme.", "q0r": 5, "q1": "Les auteurs de la proposition affirment être des professionnels expérimentés dans les domaines de la construction d'applications, du DevOps et de diverses technologies appartenant à l'écosystème Cardano. Cependant, cette description est très abstraite, elle manque de détailler qui est chaque membre de l'équipe, son domaine d'expertise, ses expériences précédentes et comment il agirait spécifiquement sur le projet. Nous avons un site web joint, où nous pouvons voir la photo et une petite description de chaque personne, mais il est très court, peu de sécurité est passée par rapport à l'équipe elle-même, même si la proposition est très bien détaillée et qu'ils ont déjà un site web prêt et plusieurs jalons atteints. Sur la question de la réalisation du projet lui-même, je pense qu'ils ont réussi à nous situer sur ce qui va se passer, quand et dans quel ordre. Il y a beaucoup, beaucoup d'activités différentes, allant de la programmation d'applications web à la création de design et à des aspects plus bureaucratiques comme les contrats légaux, et nous pouvons comprendre comment tout cela va se dérouler chronologiquement. Malgré cela, il pourrait y avoir plus de détails quant à l'explication de chacune de ces étapes (cela augmenterait grandement la confiance dans le processus). C'est très positif qu'ils établissent une notion temporelle, comme je l'ai dit auparavant, c'est-à-dire que nous savons dans quelle période de 2022 chaque chose se produirait, et aussi comment ils citent comment chaque partie de l'argent serait utilisée, bien qu'ils ne parlent pas des détails de chaque partie . Par exemple, dans le domaine du marketing, comment cela se ferait-il ? Un professionnel paierait-il, probablement, une publicité payée dans certains médias, etc.", "q1r": 4, "q2": "Voici quelques indicateurs clés de performance, mesurés en trimestres : 3, 6 et 12 mois ; les attentes en matière de réussite sont énumérées pour chacune de ces périodes, ce qui permet à la communauté de mieux suivre l'évolution du projet. Mais je pense qu'il serait utile pour ce projet, en particulier, d'avoir un suivi constant par des membres de la communauté mieux préparés, car il est très complexe, il implique plusieurs fronts. Il serait intéressant que la communauté elle-même puisse de temps en temps tester le fonctionnement de l'application, voir si tout se passe bien, détecter les défauts et les améliorations, car il y a plusieurs types de paris. Les auteurs nous donnent des moyens de voir comment les choses se passent, ce que je suggère c'est de rapprocher la création et l'amélioration du site de la communauté, car comme je l'ai déjà dit, il y a déjà beaucoup d'applications de ce genre, et il faut beaucoup d'efforts pour qu'elles se différencient.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "If sucessfull the proposal will create a betting dao or betting platform that will attract more users the the Cardano ecosystem, more users equals more utility and adoption, thus the proposal effectively addresses the challenge.", "q0r": 4, "q1": "The proposal has a link to a website where there are short bios about the team, I would like to see links to LinkedIn or similar to verify experience. I would like the team to expand on the backend architecture and how it will tie in with PAB, also I would love to hear the teams thoughts on concurrency in the eUTXO model when placing bets at the same time. As the proposal is presented at the moment its hard for me to see a clear path to success. ", "q1r": 3, "q2": "The proposal provided a high level roadmap and line item budget based. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. Furthermore, I would like to see the team add measurable goals to the KPIs identified – create/sign up/ X number by Y date –, have 150 users week 8, etc. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The betting industry is a high stake industry and is one of the use cases of Blockchain in the simplest manner. Apart from the ethical site and reservations it's a good business and can boost the adoption and utilization of Blockchain with better transparency than the current centralized setup. This feature is currently lacking in the Cardano ecosystem and can benefit from the success of this proposal. This is addressing an important challenge. \r\n", "q0r": 5, "q1": "The proper team has four persons with substantial experience in the industry and displays a professional approach. There is no major technical hurdle in achieving the end result. Moreover, the team claims to have carried out much of the work required for MVP.  The roadmap and the steps are fairly clear and achievable with these under consideration i feel that the team will be able to complete the project. ", "q1r": 5, "q2": "The proposal has a clear aim and has presented a workable strategy. There will be seven different types of bets and each is being implemented in a separate manner. The proposal has a clear roadmap and budget breakdown. The development cost is reasonable. The progress of the implementation and its success is auditable and measurable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "DAO de paris totalement transparente et capable de fournir des rendements de DeFi, play-to-earn, staking, participation aux bénéfices, pick following et plus encore.", "experience": "Équipe mondiale de développeurs et de professionnels ayant de l'expérience dans le développement d'applications, DevOps, DeFi, blockchain et l'industrie du jeu."}