{"id": 381008, "author": "matthiasksieber", "title": "Benefits App", "url": "https://cardano.ideascale.com/a/dtd/381008-48088", "category": 26240, "amount": 115200, "description": "La rétention des employés est à son plus bas niveau.", "funded": 1, "upvotes": 28211098, "downvotes": 20276829, "votes_result": 7934269, "votes_cast": 192, "f6_no_assessments": 5, "f6_rating": 3.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "L'idée est très intéressante, il s'agit de créer une Dapp qui puisse aider les employés de certaines entreprises à choisir leurs avantages sociaux. Cela aiderait certainement à retenir les travailleurs, profitant à la fois aux entreprises, avec la fidélité de leurs employés, ainsi qu'aux employés eux-mêmes, clairement, en ayant plus de liberté et d'informations sur leurs avantages. La blockchain aurait sa place ici puisque toutes les informations relatives aux choix de l'employé seraient enregistrées, toutes les transactions effectuées devraient être prouvées, l'employé aurait donc suffisamment de liberté et de sécurité pour exécuter ses choix. Les entreprises ne seraient plus en mesure de manipuler les employés et de les forcer à recevoir un avantage ou un autre si leurs options étaient estampillées sur le réseau blockchain, cela dévoluerait le pouvoir de choix aux personnes, et non aux institutions. Par conséquent, je pense qu'il s'agit d'une idée à fort impact, car elle utiliserait beaucoup les technologies de l'écosystème Cardano, tandis qu'elle pourrait grandement bénéficier aux travailleurs des entreprises en question, en particulier, et aussi aux entreprises elles-mêmes, en gardant les employés plus heureux (la recherche prouve déjà comment le niveau de satisfaction de ceux qui travaillent modifie directement la qualité du produit/service créé).", "q0r": 5, "q1": "En ce qui concerne l'équipe, je pense qu'elle est bien formée pour faire de ce projet un succès. Nous ne disposons pas d'une description de ses membres dans la proposition, mais nous pouvons trouver ces informations grâce au lien qui a été fourni. Dans celui-ci, nous voyons des photos et une série d'informations sur chacune des personnes impliquées, qui incluent leurs domaines d'expertise, leurs expériences précédentes et des liens vers des pages telles que linkedin/gitbuh, où nous pouvons mieux les connaître. Je pense qu'il y a beaucoup de confiance dans l'équipe, car certains d'entre eux ont déjà fait des propositions réussies auparavant au sein de l'écosystème Cardano. Par exemple, la plateforme de résolution/modération des conflits, dont je ne me souviens plus du nom exact mais qui a été faite par la même équipe ; également certains outils comme CA et vCa tool, très utiles pour la communauté, etc. Concernant le scénario, les informations fournies étaient suffisantes pour que nous ayons une compréhension de base de ce qui allait se passer, mais cela aurait pu être fait avec plus de détails. Chaque activité principale aurait pu être divisée en plus petits sujets afin d'améliorer notre vision du processus. Par exemple, lors de la conception de l'interface utilisateur, que feriez-vous ? Existe-t-il déjà des principes d'identité visuelle ? Quelles solutions faudrait-il rechercher ici ? En ce qui concerne le budget, bien qu'il soit assez élevé, je pense qu'il est justifiable en raison de la haute qualification de l'équipe. Ce sont des professionnels très bien préparés et expérimentés, il est donc compréhensible que les heures de travail soient plus chères. La répartition du budget est assez compréhensible, même si elle n'est pas très détaillée. Ce qui m'a manqué ici, c'est l'argent destiné au marketing. Comment ont-ils l'intention de promouvoir la dApp ? Cela aurait pu être plus clair.", "q1r": 4, "q2": "L'équipe indique très clairement quels seront les paramètres de réussite et les indicateurs clés de performance. Ces informations sont fournies avec un bon niveau de détail, ce qui nous permet de comprendre quels résultats seraient attendus en général, de considérer le succès atteint, et aussi quels sont les objectifs spécifiques pour les périodes de 3, 6 et 12 mois. Je crois que la proposition est très vérifiable, ce qui doit être fait à partir du financement, s'il est obtenu, serait l'établissement d'un pont entre l'équipe et la communauté Cardano. Il serait essentiel qu'ils nous présentent l'avancement de la création de la dApp, qu'il s'agisse de l'achèvement de la programmation, du design, des petites parties qui ont été terminées.... Ces informations pourraient être apportées à la communauté par le biais de rapports rédigés dans un langage accessible à tous, par exemple. Je pense aussi que ce serait un excellent moyen de comprendre si le projet a eu un effet que de rester en contact avec les entreprises : voir si l'objectif final (retenir les employés et améliorer votre relation avec eux) a vraiment été atteint ; demander quels avantages ont été remarqués, d'une manière plus individuelle pour chaque entreprise. Le même feedback pourrait être demandé aux utilisateurs finaux (employés). Qu'est-ce qui leur a plu le plus dans la dApp, quels points peuvent-ils améliorer ? Cependant, il s'agit davantage d'idées pour améliorer l'auditabilité. A mon avis, ce sujet est très bien couvert.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Relation to personal qualifications: Since I am actively observing the general crypto space since several years and also the projects in Project Catalyst, I have a certain understanding of what opportunities the sector has to offer and what applications could provide added value to the community. In addition to this I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects.  In addition to this, I learned some programming during my university studies, so I can comprehend the basic ideas behind a lot of the technical details. This proposal identifies a real-world problem, and provides a blockchain-based solution to it. This solution will be beneficial both to industry, employees and the Cardano Ecosystem. The KPIs and metrics match the challenge and the proposal should be scalable.", "q0r": 5, "q1": "The proposers ere well-known, competent and have shown in the past that they are able to deliver. They are transparent about the type and number of team members they are going to use. It is highly likely that they are up for the challenge.  \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. The proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown.This proposal can confidently be assessed as feasible", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "I believe the proposer could further add clarity on the problem statement for much better understanding of the causes of employee retention etc. That being said, the proposer can further explain on what are the criteria of \"detailed and aggregated  insights into their benefits\". An ecosystem with different use cases must be created here, but this requires further developments in this area in addition to this proposal. The proposer should further clarify on its impact on why blockchain is valuable than existing corporations that have these benefits. Also, more risks should be presented on the proposal. Making that distinction clear in the objectives would be amazing!", "q0r": 3, "q1": "The budget provided is very general and therefore I cannot say whether it is appropriate or not, as the proposer is missing some other parts of the project such as - budget for marketing and outreach campaign. Although, the given experience are relevant on developing this application successfully, I believe, and the proposer have provided links and reference of the team members. Still, I am giving this a 3 as mentioned, there are missing key points on how to achieve its success from the required funding.", "q1r": 3, "q2": "The proposal lacks some important information, such as a more detailed timeline and roadmap where they plan to achieve the key metrics given. I recommend including this information with clarity so that the community can have a better feasibility assessment and understand the impact of the proposal. Moreover, the proposer should mention the application whether a tracking of the contribution is open-sourced on their website etc. for better auditability.", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The idea put forward by this proposal is very interesting and could in theory attract big companies to blockchain in general and Cardano in particular. But there is a very big \"if\", hanging over this - will companies actually come and use the solution described once it's built? I would have really liked to see a clear plan to address this. This is made even more of a questionable goal by the fact that no part of the budget is allocated to marketing, even though the requested budget is almost half of the total challenge budget.\r\nThe mission of the app seems very promising on the surface, but perhaps we should be cautious about funding dapps, that even if they are great by themselves, will stay mostly unused.", "q0r": 3, "q1": "Given the solid team of this proposal and the very realistic approach to budgeting the deliverables of this proposal have a high chance of being completed in the allocated time. Having said that I would have liked to see a more in-depth description of the goals of the proposal and the steps planned to achieve them. As it stands now the proposal feels a bit rushed. Perhaps the second iteration of it will provide more details about the Implementation. The timeframe given until the launch of the product feels a bit overly optimistic as well and it will very likely take longer to successfully ship the described product.", "q1r": 3, "q2": "The metrics presented don't go into too much detail, but should suffice as a basis for the auditing process. The budget presented is broken down and specific enough to track its allocation.\r\nThe KPIs mentioned further emphasise the fact that the planned product's success would be heavily reliant on marketing.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 13, "ne": 5, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal accurately identifies  a DApp that has the potential to increase the Utility of Cardano. The metrics of increased user adoption align with the challenges outline. ", "q0r": 4, "q1": "The team is well known within the community but unless they plan on onboarding far more developers I struggle to see How they will have the requisite man power to complete the number of development hours they have fund requested within the timeframe of the roadmap.", "q1r": 3, "q2": "KPIs and a roadmap is defined but for the amount of funds requested needs at least biweekly development updates to ensure to proposal remains on track.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Permettez aux employés de choisir librement la manière dont ils veulent utiliser leurs avantages sociaux à l'aide d'une dApp Avantages.", "experience": "L'équipe de Loxe Inc., groupe de développeurs Plutus et web expérimentés et vainqueurs de hackathon, membres de Gimbalabs PPBL."}