{"id": 381348, "author": "rhysmorgan", "title": "NFTPass - NFT Ticketing Solution", "url": "https://cardano.ideascale.com/a/dtd/381348-48088", "category": 26240, "amount": 40000, "description": "Les ventes de faux billets pour les sports, la musique et les voyages coûtent des millions de livres au public chaque année au Royaume-Uni.", "funded": 0, "upvotes": 16584473, "downvotes": 15317908, "votes_result": 1266565, "votes_cast": 154, "f6_no_assessments": 4, "f6_rating": 3.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal seems that addresses the challenge brief based on what is presented by it is necessary for the proposer to provide further details to give a good insight on how the concept would work in a real life use case especially when it comes about the off-chain integration and how the metadata (TXs) is authorized and validity checked (client side) before on-chain transaction validation (server side).", "q0r": 3, "q1": "The team consists of two members but the proposal lacks in providing relevant information about their necessary skills and experience to successfully implement the project. It is unclear if the developer has the knowledge about Haskell/Plutus needed for the dapp to interact with the on-chain smart contract (SC). Also it is unclear if the dapp will use an already functional SC API or a new SC will be created to make the dapp interacting with the blockchain.\r\n\r\nThere is a budget outlined and broken down into identifiable items but the plan which says what is to be done lacks in information about how the work is done. (development phases etc.)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. Generally, off-chain data is unstructured. A hash or signature for the off-chain item is generated and that is what is stored in the blockchain. The actual item (NFT) is either stored in the cloud or in near-cloud storage. Based on this it is necessary that the proposer should be aware of the premises for a valid calculation of off-chain storage (average document size, 24x7 364 days a year etc.)\r\n\r\nThe proposer doesn't provide information about the storage type, if is decentralized or centralized and what are the risks associated with the use of a centralized storage system.", "q1r": 2, "q2": "There are some key metrics defined to measure the success of the proposal implementation but they are presented in a vague manner as is unclear what is the size of \"small venues/areas\" as an estimated number of users. Also it is difficult for an outsider to clearly understand what is the meaning of the following statement \"to pitch businesses in all verticals\".\r\n\r\nTo create the proposed solution is one thing, but operating it successfully is another. If the described aspects are improved, then this proposal has a significantly better chance of obtaining successful funding. Based on the given information, I don't expect a successful implementation.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 20, "ne": 6, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The idea of using an NFT as a ticket is unique and has the potential to improve adoption due to no transaction fee, Provided the UI and UX are good. This proposal also highlights the use of NFT without on-chain transactions to prove ownership. This model is the perfect solution for the ticket sale and needs good implementation and marketing to bring it mainstream. \r\n", "q0r": 5, "q1": "The Proposer is an SPO and has experience in minting NFTs. The project is fairly simple in technical challenges but will require good, UI and marketing for adoption. The proposer being an SPO is likely to be able to market the idea. Any reference to one major event for adoption will be a game-changer. However, with the available details, it is fair to assume that the proper will be able to implement the proposal. ", "q1r": 4, "q2": "The proposal does include the breakdown for the amount requested. Based on the deliverables and the road map the budget is not very expensive however, clarity on the breakdown of the required amount would have been better. The project will fructify as a small-scale adoption at the end of 12 months as per the proper this is a modest aim and achievable. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: Since I am actively observing the general crypto space since several years and also the projects in Project Catalyst, I have a certain understanding of what opportunities the sector has to offer and what applications could provide added value to the community. In addition to this I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects.  In addition to this, I learned some programming during my university studies, so I can comprehend the basic ideas behind a lot of the technical details. The proposal identifies a problem within the challenge which needs to be solved, however does not articulate the solution and ist value to the Cardano ecosystem clearly enough. The proposal partially aligns with the challenge metrics, however they are not directly adressed.\r\nThe proposal should be able to scale if executed correctly", "q0r": 3, "q1": "The proposer is transparent about his background and seems competent and up to the task. He provides proof that he is up to technical tasks regarding stakepools, however it is unknown whether this also applies to developing Apps. The proposer defines the number of team members required to implement the proposal.\r\nThe budget is only coarse-grained. Feedback: For future proposals, try to draft a more detailed plan on what each item of your proposal will cost and rationable calculations on how you justify those costs.\r\nThe proposer has not provided a plan for the case if they need additional funds. Feedback: Consider defining an MVP that might even be possible to be made with less funds or explainig where you would get additional funds if needed. The proposal only has a brief timetable that however seems reasonable to complete the work.\r\nThe proposal only provides a coarse-grained plan for implementation that does not exactly show how it will be implemented.\r\nThe proposal does not explain the technical aspects on the functioning of the apps, but only briefly explains what they are supposed to do. The proposer has not considered challenges and risks relevant to a successful implementation.", "q1r": 3, "q2": " A roadmap with only brief milestones and a time horizon for achievement is presented.\r\nMetrics/KPIs are not presented except for a few targeted industries, which makes the proposal difficult to audit.\r\nThe proposer only presents a brief description of the targeted problem and solution.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The biggest impact that I see coming out of this proposal is the plan to create media kits and present the use case of NFTs as an authentication mechanism to businesses. Although to properly assess that more info about the proposers would have been needed. \r\nIt is not made clear by the proposers why they need to build a dedicated lite wallet to enable NFT verification functionality. Similar services already exist, and function perfectly fine without the need for a dedicated lite wallet, such as the Catalyst Fund5 funded authenticator NFT Key - https://nftkey.me/. \r\nI would suggest including a clearer explanation of their technical approach and why a lite wallet would be needed in a potential future iteration of the proposal.", "q0r": 3, "q1": "The proposers themselves point out that one of the key elements of the project is approaching business about the service, yet no examples of actual businesses their planning to approach are given, neither is a brief description of how they're planning to approach larger organisations. I would have liked actual identifying information given, in this version of the proposal there is none even though the \"Included identifying information about all proposers\" requirement was marked as successfully completed in the self-assessment checklist. No examples of prior projects are provided, nor are other credentials.  Not knowing who is behind the project makes it very hard to assess if it would actually be completed.\r\nI would suggest emphasising the elements above if the proposal is resubmitted.", "q1r": 2, "q2": "The budget is broken down and definitions of success are given.\r\nBut the main objective of this proposal is onboarding businesses to Cardano through an NFT authenticator service - that is rather vague in the current iteration, thus the proposal isn't sufficiently auditable. Completion of the key objectives of the proposal would be subjective and debatable, as such the community would be left not clearly knowing if the promises made by the proposal were actually delivered.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Une solution NFT simple qui permet d'authentifier les billets sans frais de transaction ni attente de blocs.", "experience": "Entrepreneur et SPO ayant de l'expérience dans la création de NFT et de connexions dans les événements sportifs et musicaux, en partenariat avec un chef de projet de dév."}