{"id": 381454, "author": "ali.m", "title": "P2P dApp for sharing tech gadgets.", "url": "https://cardano.ideascale.com/a/dtd/381454-48088", "category": 26240, "amount": 56000, "description": "53,6 millions de tonnes de déchets électroniques sont générés chaque année dans le monde, tandis que 28 % de la population est prête à partager ses gadgets.", "funded": 1, "upvotes": 26373968, "downvotes": 20092188, "votes_result": 6281780, "votes_cast": 150, "f6_no_assessments": 7, "f6_rating": 3.619047619047619, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition est de la plus haute valeur, répondant très bien aux objectifs du défi, et je vais vous expliquer pourquoi. L'idée ici est de créer une plateforme électronique de partage de données, qui aura certainement un impact positif sur l'écosystème Cardano. Je crois que la phrase qui résumerait bien cette proposition est la suivante, que l'on trouve tout au début de la description : \"partage et location de vos gadgets technologiques en toute sécurité garantis par un contrat intelligent basé sur Cardano\". Avec cet objectif en tête, l'équipe, qui semble être très compétente même par la description techniquement très bonne de l'idée, pourrait mener une activité qui serait utile à un bon nombre de personnes qui manquent d'un tel service, tout en augmentant l'adoption des contrats intelligents dans notre blockchain. Les auteurs soulignent également la nécessité pour leur dApp d'expliquer de manière synthétique et efficace comment est le marché actuel, comment cette niche du partage électronique se développe de manière exponentielle et comment il y a encore un manque de plateformes/entreprises/initiatives qui abordent le sujet. Il semble judicieux de combler cette lacune avec un dApp basé sur Cardano, car les bénéfices seront garantis. L'équipe est soucieuse d'expliquer exactement le produit qu'elle va créer, quelles seraient ses caractéristiques et ses parties, rendant la compréhension de l'idée elle-même très claire. Donc, la note maximale pour ce sujet de revue.", "q0r": 5, "q1": "Je pense que l'équipe aurait pu être plus généreuse dans sa présentation. Nous ne connaissons pas leurs noms, qui fait quoi, quelles sont leurs expériences précédentes, comment ils sont arrivés à Catalyst, s'ils ont déjà une relation de travail avec notre blockchain... Il y avait un manque de détails pour comprendre plus profondément qui ils sont. En ce qui concerne la division financière, je pense qu'il pourrait également y avoir plus de détails, le montant qu'ils demandent est élevé, et bien que cela soit logique pour la complexité du projet, j'aimerais comprendre davantage sur chaque partie mentionnée. Par exemple, quelles sont les opérations de marketing qu'ils citent ? Une autre chose que j'ai pensé est qu'il serait très intéressant de comprendre l'identité visuelle du projet, comment les personnes qui ne sont pas si familières avec la blockchain pourraient utiliser la dApp, à quoi ressemblerait son interface, etc. Je pense que tout sera très bien étudié et exécuté, après tout il y a un designer UI/UX dans l'équipe, mais de telles informations auraient pu être présentées. Comme pour les points mentionnés ci-dessus, je pense que le scénario aurait également pu être plus détaillé ; les intervalles de temps mentionnés sont très longs, tous les 3 mois. Nous savons ce qui est censé se passer à ces intervalles de temps, mais j'aimerais que cette information soit plus détaillée. Par exemple, l'équipe aurait pu fournir un calendrier mensuel des activités, l'ensemble du processus de production ici est extrêmement complexe, et les personnes non techniques ne comprendraient probablement pas tout ce qui se passe ; il serait alors parfait que les phases soient expliquées dans un langage accessible, tout comme le script tous les 3 mois, afin d'atteindre une compréhension pour la majorité. En raison du manque de détails généraux, je pense que cette partie de la proposition pourrait être révisée.", "q1r": 3, "q2": "L'auditabilité est ici très bonne. Nous disposons de KPI mensuels, y compris des KPI quantifiés, c'est-à-dire que nous savons quel pourcentage de la dApp doit être prêt à un moment donné, la quantité de smart contracts générés, les utilisateurs, etc. Les auteurs établissent également comment serait le succès du projet, de sorte que nous avons ici les informations nécessaires pour suivre la proposition. Il nous suffit de suivre l'évolution des activités, il serait bon qu'un membre de la communauté qui comprend les technologies présentes dans l'idée puisse avoir des réunions périodiques avec l'équipe, et ainsi comprendre la situation exacte du projet à ce moment-là, apportant un feedback au reste de la communauté. Il serait également intéressant de suivre l'adhésion à la dApp, combien d'utilisateurs l'utilisent, en moyenne comment les smart contracts et l'utilisation de notre blockchain se sont développés depuis ce projet. Nous avons des informations pertinentes pour l'auditabilité, comme je l'ai dit, c'est suffisant pour dessiner des stratégies afin qu'elles ne soient pas gaspillées.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "L'idée est très bonne. En effet, l'économie circulaire est une mégatendance qui tend à gagner de plus en plus d'espace et les solutions qui traitent des déchets en général sont toujours les bienvenues. J'ai particulièrement apprécié dans cette proposition que des chiffres soient apportés pour valider les propositions (comme les tonnes de déchets électroniques générés et le % de personnes prêtes à partager leur gadget) et qu'il y ait des liens, à la fin de la proposition, avec les articles d'où proviennent ces chiffres (ma seule amélioration ici serait de lier directement ces références avec le texte, comme dans un vrai article, mais c'est un détail).\nIl semble y avoir un plan solide en place avec un MVP, ce qui est essentiel dans un projet comme celui-ci. J'apprécie également que le projet ait déjà son modèle économique et ses sources de revenus détaillés. La proposition s'aligne également sur les paramètres du défi, car elle entraînera une augmentation du nombre/de la croissance de la production des applications, des transactions et éventuellement des bénéfices pour leurs créateurs.\n\nComme autres suggestions spécifiques, j'aurais clarifié dans la proposition comment le bon et le mauvais comportement des utilisateurs de gadgets seraient évalués et comment l'accord juridiquement contraignant s'étendrait aux régions du monde en dehors de la matrice de la \"société\" (ou même si l'intention est, au moins intialement, de le limiter à un pays spécifique - région de portée). D'autres éléments à prendre en compte ici sont la logistique (comment les appareils seraient-ils échangés ? Y aurait-il un service spécifique d'enlèvement et de livraison de l'application/sous-traitant ou les utilisateurs devraient-ils procéder eux-mêmes à l'échange ?)\n\nEn général, le projet a un bon impact potentiel et la proposition est bien écrite, il faut juste un peu plus de détails sur certains points.\n\n\n", "q0r": 5, "q1": "En ce qui concerne l'équipe, très peu d'informations sont fournies. Elle ne fait que nommer les personnes impliquées et décrire brièvement l'expérience globale de l'équipe, ce qui rend très difficile de comprendre la faisabilité du développement de la DApp par l'équipe. Afin d'améliorer ce point, j'apporterais ici le parcours individuel, l'expérience et les capacités des 6 professionnels impliqués avec des liens pour vérifier les informations.\n\n\nIl y a un bon plan avec des livrables mais il serait bon d'avoir un peu plus de descriptions sur les activités impliquées. J'ai particulièrement apprécié, cependant, la validation initiale du marché au cours du 1er mois. Il est très important de le faire avant de développer la technologie car c'est une étape moins coûteuse mais critique (sans cela, le produit n'aura pas de valeur commerciale et sera inutile).\n\nIl n'y a pas de ventilation du budget, juste l'argent total nécessaire pour créer le MVP (proposition dans son ensemble). Pour améliorer ce point, j'essaierais de ventiler dans les heures payées pour l'équipe, combien chaque étape coûterait (validation du marché, développement du produit lui-même, MVP, etc).\n\nDans l'ensemble, le plan/feuille de route est correct (il faut juste quelques améliorations mineures) mais la répartition de l'équipe et du budget doit être améliorée dans la proposition pour mieux évaluer sa faisabilité.\n\n\n", "q1r": 3, "q2": "Le projet est généralement contrôlable. Les indicateurs clés de performance (KPI) sont bien définis dans le temps et les objectifs sont déjà fixés. Ils comprennent à la fois la validation du marché et le développement de la partie technique de la Dapp, ce qui couvre les deux principaux risques du projet (acceptation du marché et obstacles techniques). La feuille de route comporte également des jalons pertinents et vérifiables, ainsi qu'une définition claire de la réussite.\n\nComme autre suggestion, je vois une grande importance à la gestion des risques pour ce projet. Comme indiqué précédemment, les risques commerciaux et techniques sont critiques et il serait bon de disposer d'une stratégie d'atténuation. Il y a d'autres risques mineurs liés à la qualité de la DApp (qui peut être couverte par le MVP, tant qu'il y a une boucle de rétroaction / itération avec les utilisateurs) et le respect du calendrier proposé.\n\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 23, "ne": 12, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "A marketplace based on the cardano blockchain for sharing/renting technical gadgets. The authors plan to do a dapp so it's in the right category and fits the challenge settings. There will be impact on the community, and there were prety interesting documents about the \"sharing market\".  There were success definition and somekind of a roadmap, but I didn't see any metrics, which was a bit of a letdown. Not sure if the project will be able to scale as well, because I didn't see a possible challenges section even though there were such accepted comments. The proposal is lacking key metrics like user adoption, growth rate and so on. It's a unique proposal to be sure. I haven't seen anything of the sort. As a developer, I'm not too sure on the technical part, because no details were specified. Overall I like the idea, but the proposal could have been more detailed.", "q0r": 4, "q1": "I didn't find any references or links to any kind of credentials. There was a presentation linked, and there were some team members there, but I couldn't match them with the names of the proposers so I weren't able to verify the members that plan to work on this proposal. Unfortunately that brings the credibility of the project down. I see there's some idea of the type of team members, but they haven't approached them yet or at least that was my impression after reading the proposal again. The budgets is clear enoiugh, although it's a bit strange for the developer experts and marketing, business & customer operations to have the same low salary, but kudos if they manage to find these people. I'd say the timetable is realistic only if they already have found the people to work on the project. The proposal might have done a better job at explaining the technical implementation of the sharing market, but I won't hold that agains them since I don't thing they haven't found the devs yet.   One thing that IMO is lacking is the consideration of challenges and risks. What would happen if a gadget is broken once its lended. Are there any safety mechanisms in place like locking some token in or any kind of value before borrowing a gadget? How would legal disputes be managed? Does the smart contract hold weight in court? These are all important questions that weren't mentioned.  Overall I like the proposal, but I don't think it's feasible in it's current state. ", "q1r": 2, "q2": "I don't see a way for any interested community member to follow along with the progress and development of this proposal. There are no metrics to speak of, but there was a small definition of success table, which is a start. The roadmap is a bit coarse and could be a lot more detailed. The problem and solution statements are clear enough.  I'd suggest to the proposers to put themselves in the shoes of the voter and take a look at their proposal. I believe this will help them come back in the next funding roud with and even stronger proposal. Good luck! ", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 22, "ne": 10, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "As an active Catalyst member, experienced Technology builder and Sharing economy former entrepreneur I strongly agree this proposal aligns with the Challenge objectives and will generate a positive impact to the Cardano Blockchain by creating smart contracts and their use by the lenders/renters in the platform. The amount of impact expected in the short and medium term are even quantified as KPIs.", "q0r": 5, "q1": "Even though the team is mentioned and the co-proposers are present in the platform, there is no extra details or external references provided to be able to validate their skills and experience, there is also the need to hire a PLUTUS developer which could be tough to find, hire and produce in 3 months, it would've been better to produce an agreement with any of the plutus devs in the Catalyst community or any of the organizations that can provide that capacity to mitigate that risk.\nThe plan provided is aggressive, but  doable with the amount of people assigned (4 devs and 2 Business/Ops), specially as the aim is to launch a first MVP in 3 months.\nThe requested budget breakdown is clear and aligned with market prices (considering full time dedication of team - not clarified in the proposal though), and the total amount for the Return On Intention of product with this capabilities I think it is OK.\nThere is also an analysis and plan to create a sustainable Business Model after funding and launching, which makes the proposal more solid.\nThere are no risks identified and I think there will be many hurdles in the way, that will arise unexpected, with the complexity, amount of team and short time to deliver and aggressive goals. So if project is voted I'd sit with the team first and understand deeply those challenges and have some ideas on how to mitigate them.", "q1r": 4, "q2": "The milestones provided, KPIs identified are SMART and will enable our community to audit the progress of the project during the 3 months project plan. There are also some objectives for the medium term provided and a sustainable business model to be tried. So I do believe the project will be auditable and transparent for the community.  ", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 24, "ne": 9, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "Its a good idea at face value but I have a hard time seeing this coming together. For example, people typically store persinal sensitive data on their devices such as passwords, accounts, emails and addresses. How do you share these devices and at the same time ensure that they are wiped of sensitive information? I think this is difficult to solve and its not addressed at all.", "q0r": 2, "q1": "It would help to have more information about the team and what past projects they have worked on. In reading it appears to me they are looking for an expert developer meaning they currently dont have a qualified team and their first milestone is having the app already finished in a month which is completely unrealistic. The whole idea is centered around the app but it appears that it is a minor thing to accomplish in the milestones.. just makes no sense to me as a developer. I think more detail is needed on the design of the app and how the user will interact with it. How will users connect to each other?", "q1r": 1, "q2": "There are some decent metrics and kpi but they rely on the fundamental app which has little information on how it will work. I think more needs to be accomplished in defining all the parts of this process before a clear audit trail can be recognized.", "q2r": 1, "assessor": "z_assessor_119", "no_vca": 22, "ne": 3, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "It identifies a potential problem some Cardano users might have. The problem the world has with e-waste is unfortunately not a problem in this challenge, but there could be some Cardano users that can't afford Tech and it would be better for them to rent devices. It aims to ad value to the Cardano ecosystem by bringing some of the \"sharing economy\" to Cardano. Some of the key metrics align with the challenge in bringing new users to the ecosystem. This project is able to scale as technology always evolves and there is always old tech lying around that could be better off in someone else's hands. ", "q0r": 4, "q1": "They haven't provided any evidence of experience or existence and they stated that they are looking for a Cardano developer expert. The current team of 6 claims to  have experience in UI/UX product design, business, marketing and branding. Considering that they still need a plutus developer their targets might not be achievable should they fail to acquire the dev. The budget is somewhat reasonable and broken down, but they haven't allocated anything for the plutus dev. They go into great detail about how their product will work and I appreciate the risks they have considered and the way the will mitigate them. They don't however go into any technical details. We don't know what will be used for frontend and backend developement. How users data will be stored. etc.  Having a plutus dev on your team and providing the reader with the technical details of your product will show your approach to the problem and boost voter confidence.", "q1r": 2, "q2": "The roadmap they provided is broken down into 1, 3 and 6 months. The milestones are a little vague and could've been better explained. The KPIs are measurable making it easy to track the performance and progress of this project. They identify the problem of old devices not being used and people in need of devices that can't afford them. They plan to solve this by building a marketplace where people can rent and share their devices for extra income.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 27, "ne": 8, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "This is a great idea bringing Blockchain technology specifically smart contracts to an increasingly sharing global economy with trust and security as a major selling point. This proposal is definitely with the campaign brief and goals with the potential to increase the adoption of the ecosystem and particularly onboarding new members.", "q0r": 5, "q1": "There is much information about the team's ability and experience to deliver this project however the fact, the proposal was well thought out with detailed roadmap and realistic budget estimate including the realisation that they definitely need a developer from onset. Am convinced that the proposal will be successfully implemented. ", "q1r": 4, "q2": "The proposal has presented more than enough information to ensure effective assessment and monitoring of the project if funded", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 24, "ne": 1, "ng": 17, "nfo": 6, "vca_o": 1}], "solution": "Créer une solution de bout en bout qui permet aux gens de partager et de louer leurs gadgets technologiques en toute sécurité, garantie par un contrat intelligent basé sur Cardano.", "experience": "Nous sommes une équipe multidisciplinaire de 6 professionnels possédant un vaste ensemble de compétences dans les domaines de la technologie, de l'UX/UI, de la conception de produits, des affaires, du marketing et de l'image de marque."}