{"id": 382035, "author": "jcaso", "title": "C64 Extension Wallet", "url": "https://cardano.ideascale.com/a/dtd/382035-48088", "category": 26240, "amount": 19660, "description": "Extension de porte-monnaie qui offre une expérience souveraine et personnalisée aux utilisateurs et aux développeurs en prenant en charge P2P, NFT, Identity, Voting en tant que plugins.", "funded": 1, "upvotes": 77413110, "downvotes": 12201552, "votes_result": 65211558, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Je suis conseiller communautaire depuis le Fonds 2 et ACV depuis que je me souviens (OK, pas vraiment, depuis le Fonds 3 pour être précis). J'ai également agi en tant que proposant dans certains fonds Challenge Setting (je suis assez vieux pour me souvenir de l'époque où ils s'appelaient Community Choice - oui, le nom était nul). Mais je m'emballe. Cette proposition est pratique pour l'utilisateur final. Elle vise à développer un porte-monnaie communautaire léger, multi-navigateurs, avec un format popup qui permet de changer de réseau (Testnet - Mainnet - Yeah !!) et de les unifier dans un même outil à partir d'un même compte. Ce qui est encore mieux, c'est que les utilisateurs pourront choisir leurs propres points d'accès de confiance. Le portefeuille léger multi-navigateur pourrait avoir un grand impact s'il est couronné de succès, d'autant plus que les utilisateurs de Cardano sont de plus en plus frustrés par l'utilisation d'un portefeuille de nœud complet (oui, nous vous regardons, Daedalus !). L'idée d'utiliser un porte-monnaie à extension modulaire progressive qui facilite l'ajout de nouveaux cas d'utilisation sous la forme de plugins (quelqu'un a-t-il dit P2P, NFT, Identité, vote, etc. ?) est excellente et très importante. Si vous êtes électeur et que vous n'avez pas encore visité https://c64.app/ (le site du porte-monnaie C64), faites-le. Je ne savais même pas qu'il existait. C'est ça la décentralisation. Plus de portefeuilles, plus d'approches, plus de résilience. Toutes les parties prenantes en bénéficient.", "q0r": 5, "q1": "Le projet est soutenu par une équipe très compétente. Elle comprend un ex-Emurgo DevOps lead. cofondateur de Gimbalabs, un développeur full-stack, ambassadeur Cardano, SPO, et un ex-Emurgo Yoroi-mobile, conseiller en ingénierie R&D... L'équipe est composée de trois membres qui ont clairement les connaissances techniques pour fournir le résultat. Je suis souvent inquiet au sujet de certaines propositions - qui peuvent mourir d'une mort lente (ou rapide) après la livraison, mais ce qui est vraiment encourageant sur la faisabilité et la croissance durable de ce projet est que l'équipe a déjà étoffé les fonctionnalités futures qu'ils ont l'intention de construire et d'ajouter avec le financement futur de Catalyst (dans les tours futurs). Le porte-monnaie C64 semble être une idée avec un grand potentiel de croissance - comme l'a reconnu l'équipe qui propose le projet. Ils ont inclus un calendrier réaliste divisé en trois étapes clés pour l'achèvement, tandis que le budget a été étoffé en composants - permettant un examen plus détaillé du travail. Les auteurs de la proposition ont inclus et expliqué les composants techniques clés sur lesquels ils s'appuieront - et j'aime le fait qu'il s'agira d'un système multi-navigateur Chrome, Brave, Edge et Firefox (provisoire). L'idée d'inclure des démos dans la proposition était excellente, et merci d'avoir inclus les profils Linkedin.\r\n\r\n\r\n", "q1r": 5, "q2": "L'équipe qui fait la proposition a une vision claire de ce qu'elle souhaite réaliser et une voie claire pour y parvenir. Elle a inclus une planification claire et compréhensible de ce qu'elle veut réaliser et la solution qu'elle propose est rationnelle et a beaucoup de sens. L'équipe a inclus un calendrier de 6 mois avec 14 indicateurs clés de performance qu'ils veulent utiliser pour l'audit et le développement. Le développement a été divisé en trois grandes phases et, grâce à la ventilation détaillée du budget, il sera facile à auditer. C'est un exemple de proposition claire et bien présentée.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "L'auteur veut construire un portefeuille d'extension et ses fonctionnalités peuvent être étendues avec des plugins. Ainsi, en fonction de vos besoins, vous pouvez étendre votre porte-monnaie. C'est une proposition très intéressante et intuitive qui répond au défi posé. J'apprécie également que le proposant ait fait des efforts pour réduire le coût de cette proposition en combinant les efforts entre la proposition du fonds 5 et la proposition actuelle. Il y a une valeur implicite apportée à l'écosystème si cette proposition est financée et mise en œuvre, mais à en juger par les précédents résultats de ce proposant, je ne suis pas inquiet. Il y aura des KPIs rapportés toutes les deux semaines comme cela a été fait jusqu'à présent. L'impact est toujours lié à la mise à l'échelle d'une solution, et pour celle-ci, je n'ai aucune inquiétude quant à la capacité de l'équipe à relever les défis décrits. De nombreux efforts ont été déployés pour trouver une solution à ce projet et cela se voit car il n'y a pas de trous dans la proposition. Ce projet bénéficierait à la communauté et à l'écosystème de manière significative s'il était mis en œuvre comme décrit, mais je crois qu'il sera encore plus bénéfique s'il s'agit d'une collaboration entre quelques projets ayant les mêmes idées. En tant que développeur, je n'ai aucune inquiétude quant à la mise en œuvre de la proposition.", "q0r": 5, "q1": "Le proposant a ajouté les profils linkedin des membres de l'équipe, ce qui veut dire deux choses. 1. Les proposants sont prêts à soutenir leur projet avec leurs noms. 2. Cela permet de vérifier les compétences indiquées dans la proposition. 3. (bonus) apporte de la crédibilité au projet. Le nombre et le type de membres de l'équipe ont évidemment été discutés et sont présents dans la proposition. Le budget est bien géré, il y a une option présentée par les proposants, d'utiliser les fonds d'un financement précédent d'une manière plus optimale - cette proposition est également financée, et je suis étonné de voir comment les tâches du projet sont clairement regroupées si cela se produit. Il y a un calendrier réaliste pour faire tout le travail nécessaire déclaré. Le projet définit comment il sera exécuté et quelle mise en œuvre sera utilisée.  Il y a une description détaillée des éléments futurs qui doivent être pris en charge et qui ont un sens (support du trézor, jalonnement et autres). Certains défis et risques sont pris en compte dans la proposition. Une autre chose que j'ai vraiment appréciée est la liste des démos, mais j'en parlerai dans la section sur l'auditabilité. Je ne suis pas sûr que le projet est en phase avec d'autres propositions similaires qui veulent construire des plugins séparés par le standad présenté et être en mesure de mettre en œuvre avec l'autre sur un niveau modulaire, et ma suggestion en tant que développeur serait de jeter un coup d'oeil autour des propositions similaires et voir s'ils ne peuvent pas collaborer sur certaines fonctionnalités et plugins. Dans l'ensemble, une grande proposition avec beaucoup de potentiel en elle.\r\n", "q1r": 5, "q2": "Je ne m'inquiète pas de la traçabilité du projet, puisque l'auteur de la proposition s'est engagé à fournir des mises à jour sur l'avancement de la solution toutes les deux semaines. Ce que je recommanderais, c'est d'avoir un canal discord ou telegram pour obtenir des commentaires directement de la communauté si nécessaire, mais ce n'est en aucun cas obligatoire. J'aime beaucoup la longue liste d'indicateurs clés de performance mentionnés dans le texte de la proposition. Ils donnent de la validité à l'effort fourni car ils sont très pertinents pour la réussite du projet. La feuille de route et les jalons sont également présents et seront visibles pour la communauté qui souhaite les suivre. Je vois une définition claire d'un problème et une compréhension vraiment technique et profonde de la solution proposée.   Je souhaite bonne chance à l'auteur dans la phase de vote. C'est une bonne proposition !", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "There is a need for lite wallets to provide more options to end users and developers for experimentation. The proposal will also provide Cardano Backend tools for the community to use and will decrease the dependency on a single entity for providing backend for lite wallets. ", "q0r": 4, "q1": "The team C64 which is proposing this project was funded for a desktop wallet which can mint NFTs. The same team is proposing to create a cross browser wallet in Typescript which is considered better for security than the javascript. The team also proposes hosting of Cardano Backend suites for the lite wallets. Based on the experience and the demonstrated capability it is likely that the team will be able to complete the project successfully. ", "q1r": 5, "q2": "The proposal is detailed with clear risk analysis. The dcSparks connector has been released and is successful therefore the proposal should not be facing any technical blocks. The proposal has a clear roadmap and it is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This is one of the Cardano wallets that was funded in fund 5 and they still keep developing that proposal. This proposal is an additional part that I think they need to do for more convenience to end-users, increase the user experience is what can increase the results of their KPIs that include both in the old one and this proposal. Therefore, this small project will help the whole bigger project better impact on Cardano ecosystem ", "q0r": 5, "q1": "As I mention, this proposal is an expanding fund for developing their browser extensions, which means that they're running this project and have some results on it. We can check the product through the main website of the project. \r\nAnd the team filled this proposal with the whole project implementation plan that all is clear. Therefore, I absolutely believe that they're doing well and will make this proposal good as they did with the other parts of the project. ", "q1r": 5, "q2": "Info in the proposal is completely enough to help auditing works in this scope of the proposal. They pointed the specific outline in the general roadmap that relates to this proposal clearly and all make sense. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "It's great idea to build an extension wallet by adopting the Connector standard from dcSpark for interaction with dapps and Defi services which increases users and devs' experience and the Cardano applicability. Also, this dapps helps Cardano to communicate with other blockchains. The proposer shows a clear roadmap and solutions to build the wallet. This project will definitely help the growth of Cardano community. ", "q0r": 4, "q1": "The proposal has qualified team with experience in developing Cardano, Ermugo and Ardana project which make me believe in the success of implementing this project. The team has a deep understanding of Cardano and their project. They give a clear road map and detailed KPI. Also, I find the requested fund is suitable for their proposal at this stage. ", "q1r": 4, "q2": "It's easy to audit this project as every information related to the implementation of the proposal is clearly stated. They give a detailed timeline for the roadmap,KPI which can be checked on their website and github source. The proposal also gives evidence behind the team backgroud as they are well-known in Cardano community which make this proposal gain more trust. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Concevoir et mettre en œuvre un portefeuille d'extensions modulaires progressives qui facilite l'ajout de nouveaux cas d'utilisation sous la forme de plugins.", "experience": "L'équipe possède une vaste expérience professionnelle en tant que développeur full stack, traitement en temps réel, applications mobiles, administrateur système, devOps et SPO."}