{"id": 382341, "author": "raghu.thakur", "title": "Dapp for Art & Creator Discovery", "url": "https://cardano.ideascale.com/a/dtd/382341-48088", "category": 26240, "amount": 30000, "description": "Seuls 3% des artistes parviennent à se faire découvrir et à promouvoir numériquement leur art et leur talent. L'adoption des crypto-monnaies parmi les artistes est de 0,004%.", "funded": 1, "upvotes": 34179549, "downvotes": 13275146, "votes_result": 20904403, "votes_cast": 184, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Je suis d'accord pour dire que cette proposition relève efficacement le défi. L'énoncé du problème décrit un problème bien connu dans le domaine traditionnel de la création artistique. La solution donnée au problème est évidente, car la blockchain et la décentralisation sont au cœur des problèmes existants de centralisation/monopole.\r\n\r\nLa proposition, cependant, à mon avis, aurait pu représenter quelques preuves statistiques sur les chiffres que le proposant a donné dans l'énoncé du problème (seulement 3% des artistes sont en mesure d'être découverts) L'adoption de la crypto est de 0,004%. De plus, la solution revendique 10 fois plus d'adoption de crypto pour 91% de coûts en moins, il aurait été formidable que la communauté soit informée de la manière dont le proposant a atteint/trouvé ce chiffre. Toute information supplémentaire qui aide la communauté à vérifier vos revendications est agréable à avoir, sinon cela ressemble juste à une revendication qui n'a aucune substance derrière elle.\r\n\r\nLe site web est déjà en place et ils ont un produit fonctionnel jusqu'à un certain point, et je crois que la partie décentralisation est manquante pour laquelle cette proposition a été faite. Ce que je ne comprends pas, cependant, c'est que le produit a peut-être plus d'un an, et comment en sont-ils arrivés à l'aspect décentralisation maintenant, et quels efforts ont été faits au cours de la dernière année ou plus de leur côté pour promouvoir la décentralisation ? Ce serait bien d'avoir cette information présentée ici (essentiellement leur courbe d'apprentissage sur le moment où ils ont identifié ce problème de centralisation, parce que si elle était là depuis le début, est-ce qu'ils sont juste tombés sur Cardano et pourquoi n'ont-ils pas pris les contrats solidity basés sur Ethereum pour avoir la première version de celui-ci ? En théorie, ils pourraient simplement utiliser le convertisseur ERC20 pour passer leur projet à Cardano.)\r\n\r\nEn tout cas, il y a de la place pour des améliorations dans la rédaction mais l'idée est intéressante et je l'approuve.", "q0r": 4, "q1": "L'équipe principale derrière la proposition est assez transparente, et son profil public est présenté ici.  Un seul des membres de l'équipe se trouve du côté technique, mais son profil Github et sa participation à Haskell/programmation fonctionnelle ne sont pas visibles.  \r\n\r\nEn tant que participant au programme pionnier de Plutus et développeur senior moi-même, je sais que la courbe d'apprentissage de la programmation Plutus n'est pas aussi triviale que celle des langages de haut niveau tels que java/javascript, etc. Donc, pour la communauté, il aurait été bien que nous puissions avoir un aperçu plus détaillé sur les dépôts github et / ou d'autres développeurs qui participeront et qui ont soit fait partie du programme pionnier Plutus ou ont fait d'autres contributions open source ?\r\n\r\nLe plan présenté ici est divisé en étapes et assez élaboré. Le succès après 3-6-12 mois est bien décrit. Cependant, pour soutenir l'étape des 3 mois, je ne vois pas de ventilation budgétaire plus poussée à l'étape MVP. Il est écrit Back-end platform development mais qu'entendent-ils exactement par back-end ? Le contrat intelligent (avec le code offchain-onchain), Quel protocole de stockage ils vont utiliser (par exemple arweave ??).\r\n\r\nLe jargon technique tel que \"validation de modèles prototypes pour les composants individuels\" n'aide pas le lecteur (et encore moins un développeur comme moi) à comprendre facilement ce que les électeurs/membres de la communauté peuvent attendre, ce que cela signifie vraiment ?\r\n\r\n\r\nEt comment ce chiffre (25 000 $) a-t-il été atteint ? Il aurait été préférable pour la communauté que le proposant ventile davantage les exigences budgétaires en heures de travail, et qu'il divise la phase MVP en sprints de 2 semaines et/ou en délais plus courts. Certaines propositions ici ont fourni un tableau jira avec une telle mise en œuvre.\r\n\r\nPar conséquent, en tant qu'AC, je dois donner à ces propositions des notes plus élevées et donner à cette proposition la même note qu'elles ne serait pas juste.\r\n\r\n", "q1r": 3, "q2": "Je dirais que les informations fournies ici sont suffisantes. Le point positif est que l'on indique comment se présente le succès au bout de 3-6-12 mois, mais à mon avis, il aurait fallu le ventiler davantage pour que la communauté puisse suivre les progrès toutes les deux semaines (sinon toutes les semaines).\r\n\r\nJe pense que la communauté a la capacité de vérifier les progrès et le succès de cette proposition, mais le proposant aurait pu faire un meilleur travail en donnant plus de confiance sur les mesures qu'ils prendront pour avoir la mise à l'échelle à l'esprit dès la première étape. Par exemple, Cardano a déjà résolu le problème de la mise à l'échelle bien avant qu'Hydra ne démarre, je pense que pour toute plateforme qui cherche à être largement adoptée, les choses difficiles devraient être résolues dès le début et si c'est le cas, la communauté doit en être informée via cette proposition.\r\n\r\nDans l'ensemble, un bon rapport, mais des améliorations sont encore possibles.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " There is a need for onboarding visual artists to blockchain which provides a secure and decentralized means to monetize the art. This initiative to provide a networking site with smart contract-based remuneration has the potential to onboard a large number of artists including photographers. This is relatively low-hanging fruit and achievable. ", "q0r": 5, "q1": "The proposers are already running an artist networking site and are experts in the domain. The team also has a clear plan and aim. The current proposal is to create an MVP and a working model. This platform also aims to attract artists by offering work which by itself will start boosting adoption. Therefore it is highly likely that the project will be implemented in earnest. ", "q1r": 5, "q2": "The proposal is detailed and includes a clear roadmap. Their work schedule has been provided in detail. The proposal will have visible outputs and adoption can be measured in quantitative terms. Thus it satisfies all requirements for audibility. The success can also be measured based on the number of artists the dApp onboards. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does addresses the challenge, and have an interesting outlook of creating a social network platform in the blockchain, thus increasing the adoption of users. Moreover, this does not just increase adoption but give opportunities to unsung creators that want to share their work and skills on the Cardano ecosystem. The proposer have even set milestones that they want to achieve and gave detailed overview on how creators can benefit using the dApp.", "q0r": 5, "q1": "The front-end interface for Bluetook looks alot like Facebook, and I believe it will easily adopt users to use it. Given the team members that have experiences in various fields, I think the dApp can be developed successfully. In addition, the whitepaper have clearly planned for its ICO tokenomics.  The main concern are risks management that the proposer have not mentioned. (Such as, when both party of creators agree via smart contract to create something, what are the risks involve in doing so? What happens if once they have agreed on the smart contract and the \"get together\" does not actually happen? How do creators avoid from being scammed through this?). These are essential for bringing confidence to the users/voters.", "q1r": 4, "q2": "The funding required are well allocated in terms of business, development and marketing. On the whitepaper, the proposer have mentioned all phases to achieve their goal on gaining users. And based on the proposal above, I do believe that the proposer wants to kickstart on the MVP stage within the 3 months as the budget has stated. Roadmap are detailed, with integrations on Artano (marketplace) and galleries, have shown that the proposer's vision of the project. Although, this will be a big leap, it will be helpful if there are key metrics to be tracked for better auditability. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal fits the challenge and gives a brief general overview of the problem it's trying to solve. The proposers didn't outline how this would add value to the Cardano ecosystem. Still, given that the product they have prior is already active, there is no doubt that this will drive adoption by utilising this technology.key metrics align with the proposal; as detailed in the plan, the project is measurable via tokens and transactions flow.", "q0r": 4, "q1": "The proposers primarily link to a startup called bluetook, which the team is trying to integrate and build on top of Cardano. a small team is put together which has the relevant experience from the startup bluetook, but should be aware that Cardano is an entirely different beast and requires an understanding of how it works under the hoods to properly take advantage of Cardano's features to make this project a success.  The project offers a fair overview of what they want to achieve in the 18-month timeframe, but the budget doesn't match what they are setting out to achieve. What's being asked is less than what is used in their budget breakdown. I didn't see any relevant challenges risks that the team will face as to whether or not it will hinder the project's success. Details and context were missing; a little more light should be shed on the information that the proposal lacked, such as risks, key performance metrics, more emphasis on the problem etc.", "q1r": 3, "q2": "Short Milestones are outlined briefly, and KPIs are non-existent. We get a brief description of the targeted problem and more of an emphasis on their solution, but as a viewer, we don't understand the problem and how it fits in with the solution. More information on the problem and examples of how things work today rather than jumping straight to the solution.", "q2r": 3, "assessor": "z_assessor_903", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Découverte décentralisée de l'art et du créateur avec le réseau social. Adoption de 10 fois plus de crypto par les artistes et les clients à un coût 91% moins élevé.", "experience": "Bluetook est opérationnel depuis plus d'un an et accueille plus de 1 700 artistes et 50 000 images sélectionnées. Les fondateurs sont des artistes, des techniciens et des gestionnaires qui ont déposé 17 brevets."}