{"id": 384504, "author": "petervg", "title": "Treedano: NFTs for mature trees", "url": "https://cardano.ideascale.com/a/dtd/384504-48088", "category": 26240, "amount": 56250, "description": "Les arbres matures ont de la valeur parce qu'ils stockent du carbone, ancrent les écosystèmes et améliorent la qualité de vie, mais leur seule valeur monétaire est celle du bois abattu.", "funded": 1, "upvotes": 51654563, "downvotes": 15107040, "votes_result": 36547523, "votes_cast": 313, "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=6185", "https://www.youtube.com/watch?v=Hsyj1PLOzsg", "https://www.youtube.com/watch?v=jheqJzP0J_Y"], "media": [], "f6_assessments": [{"q0": "This defines a problem and solution that fits the challenge and will make an impact in the cardano dapp ecosystem.  The theme and execution match Cardano's and Catalyst's principles of stewardship, openness, collaboration and \"Cascading disruption\". \r\n\r\nThis proposal aligns very well to the campaign by providing meaningful value to the person, the community and the planet.  The app user will enjoy playful communion with the nature world.  The Cardano community will gain new users, a new dapp, a new token,  and traffic on the mainnet.  The planet will be protected one tree at a time - and the growing awareness that we are all connected and have value. ", "q0r": 5, "q1": "I appreciate the clearly defined roadmap for scaling the project after this round of funding. This fun and clever project is back by serious business sense.  I know exactly what will be created with these funds (as specific as individual blog posts) and what will be created later (a Treedano DAO after one year). \r\n\r\nThere will be challenges and risks to success, but this team and plan are capable of overcoming them.   Among other things, Reading the team's values help me make this assessment. This is a team I want to see thrive and these values spread.", "q1r": 5, "q2": "I trust this team is capable of success. They have a balanced team with proven leadership, values and vision.  The budget, timelines and resources are reasonable and clear (The proposal gives justification of the hourly rate, for example).  There is a \"what they will do\" and a \"how they will do\" with adequate detail in this context.", "q2r": 5, "assessor": "z_assessor_56", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This is a great proposal and highly aligned with the challenge and Cardno values to be a leader blockchain for sustainability and climate change solutions (the last Cardano summit clearly shows the importance of this area to Cardano).  The suggested proposal is a good combination of impact with the scale of transactions on Cardano. \r\nThe key metrics and goals of the proposal align with the outlined challenge settings. The proposal is able to scale to address future challenges. The team has a great plan in place and is very passionate about the solution. \r\n\r\nAs an entrepreneur and mentor for startups for many years, this is a great sign of dedication and resistance that will lead to success. ", "q0r": 5, "q1": "The team brings together both the right spirit/passion as well as the professional experience, in addition to being very positively active in the Catalyst community.  The proposer provides good information on the relevant skills and experience needed to implement the proposal. \r\nThe budget is significant for the first 3 months/ and for the challenge total budget (over 20%) but is reasonable based on the team experience and in order to achieve the set goals, taking into consideration the amount of work needed. It could have been helpful to break down the number of hours required for each task to give higher visibility. Additional funding will be required in fund 8 and it could have been helpful to have estimations for it and if you will consider also other funding sources (i.e. other grants)\r\nThere will be some key challenges and risks (i.e. additional funding needed) and it could be good to state and consider them. \r\nIt will have been helpful to provide more detailed information about the product. There are many elements to the solution and deliverables in the first three months that might be very ambitious (Based on my experience as an entrepreneur who developed technology products). Good to focus on a pilot location.    ", "q1r": 4, "q2": "A roadmap with milestones and a time horizon for achievement is well detailed. Having clear objectives per month for the first 3 months will make it easier to audit the progress. Then the plan for 6 and 12 months is also well detailed showing the scope of the project.  Metrics/KPIs/deliverables that define the success of the proposal are well presented. The budget is for 3 months and it gives the opportunity to the community to evaluate the deliverables and decide on further funding.  Overall, based on the team and detailed deliverables, especially for the first 3 months, there will not be any issue auditing the proposal. ", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 20, "ne": 10, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal adds value to the Cardano ecosystem in growing its citizen science movement and strengthening its position as the sustainability-focused blockchain. This could be a way for hikers/nature lovers/geocachers to help gather data and document existing trees, especially previously undocumented ones. The impact is local first and expanding to global, if everything works as expected and more. The ability to scale depends on community adoption, the number of supported tree species and the community's will to provide these extensions.\r\nIt is not clear how the \"tree pinning\" process is going to work. Is there experience needed to pin a tree? What infos are saved in the NFT and who proves the veracity of that data? What role do DIDs play in this process? \r\nAlthough Orcfax is stated core infrastructure, there is not enough information in the proposal on how the targeted scientific standard is going to be met. ", "q0r": 4, "q1": "The success of this proposal is likely. Both lead developers provide a wealth of experience, which is clearly aligned to the proposal's objective. Especially influential is the abundant experience as an archivist of one of the leads and previous experience in building oracles.\r\nThe budget is explained, and I really appreciate seeing equal pay for all human resources in the budget plan. But this invalidates the decision to take earning potential outside the ecosystem into the calculation, as these differ greatly between an experienced full stack lead dev and a teacher. Thus, I think the expected wage of $75 per hour is set too high.\r\nThe token-incentive mechanism relies solely on wealthy individuals and companies that want to carbon-offset. This might be a risk to the incentive schema.", "q1r": 5, "q2": "There are clear milestones in the roadmap, but the proposer did not state explicit KPIs. There might be easily extractable metrics to audit the progress, e.g. \"Number of Tree-NFTs minted\".\r\nTherefore, the community can only audit the product when it's near production-ready.\r\nThe roadmap is clearly written and detailed, although there are a lot of open questions on the blockchain use. E.g. what happens to the NFT if its tree burns down?\r\nIt is not clear how the gamification part is achieved. There is the possibility to document/collect and get a score → competition, while maybe connecting socially. What other components make it fun for non-geocachers? There is a clear alignment to inaturalist.com, but not so much to TikTok.\r\nThere is a mention of Atala PRISM DIDs in the roadmap, but no details provided on what DID's will be used for.", "q2r": 3, "assessor": "z_assessor_924", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Une application qui met en œuvre la comptabilité du capital naturel pour symboliser les arbres adultes, refléter leur véritable valeur économique et encourager la conservation.", "experience": "\nPropriétaires de biens ruraux\nLes randonneurs de l'arrière-pays\nLes éco-activistes de Cardano4Climate\nDéveloppeurs Mobile/Plutus\nDéveloppeur principal d'Orcfax\n"}