{"id": 384575, "author": "jeffghome2020", "title": "StoryTime - A Writers Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384575-48088", "category": 26240, "amount": 41200, "description": "Les écrivains sont soumis à un traitement injuste en raison de leurs opinions et de leurs récits. Leur liberté et leurs droits sont souvent menacés.", "funded": 0, "upvotes": 17281303, "downvotes": 16707663, "votes_result": 573640, "votes_cast": 155, "f6_no_assessments": 5, "f6_rating": 2.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "D'après ce que j'ai compris, cette proposition vise à créer une place de marché permettant aux écrivains de partager et de vendre leurs œuvres, où les auteurs peuvent choisir d'être anonymes, tout en conservant la transparence et les avantages de la technologie blockchain. Travaillant dans le secteur culturel et étant impliqué dans l'espace des crypto-monnaies, je dirais qu'il n'y a pas eu de développement approprié des dApps liées aux arts et à la culture. Les artistes souffrent du fait que les entreprises s'emparent de la plupart des bénéfices, et sont toujours contrôlés par une main intermédiaire quant au contenu à créer. Cette proposition serait une étape vers le développement d'un lieu où les auteurs peuvent créer et gérer leurs œuvres de manière indépendante, si elle est exécutée correctement. L'énoncé du problème est clair dans sa description, tout comme la solution au problème. À première vue, cette proposition semble être beaucoup plus ciblée sur les auteurs, mais après réflexion, ce projet vise également à se connecter aux consommateurs (bien sûr), ce qui en fait une toute autre histoire en termes de sensibilisation et d'adoption. Il pourrait très bien s'agir d'une bonne utilisation de la trésorerie de Catalyst, avec un grand potentiel d'expansion à l'avenir s'il est exécuté correctement. Dans le meilleur des cas (selon l'auteur de la proposition), ce serait l'une des premières bibliothèques décentralisées, si tout se passe bien. Je suis d'accord pour dire que cette proposition relève efficacement le défi.", "q0r": 4, "q1": "Le proposant/l'équipe a l'expérience de propositions financées par le Fonds 4 et le Fonds 6, ce qui témoigne de la crédibilité et de la compétence de l'équipe. Dans ce cas, il serait utile que la proposition comprenne une série de liens permettant de vérifier davantage les compétences des membres de l'équipe principale. Il pourrait s'agir de liens vers leurs profils LinkedIn, ou de liens vers les propositions pour lesquelles l'équipe a déjà reçu un financement. Il y a une vidéo youtube fournie présentant le fondateur (qui est très bonne), mais j'aurais aimé avoir des informations plus détaillées sur cette proposition. La proposition comprend des informations de contact utiles pour les membres de l'équipe centrale, ce qui est rarement le cas dans les propositions (d'après mon expérience en tant que conseiller communautaire).\r\nLa déclaration selon laquelle l'équipe a l'intention de rembourser les fonds de cette proposition dans un délai d'un an témoigne d'un engagement élevé envers le projet et la communauté, mais il serait bon d'avoir des informations plus détaillées sur l'origine de cet argent et sa répartition tout au long de l'année. L'allocation budgétaire est assez simple et comprend un plan d'embauche de développeurs ayant les compétences nécessaires, présenté avec les heures de travail et une estimation du salaire horaire sur une plus longue période (environ 2 mois, 1 développeur à temps plein et 2 développeurs à temps partiel). Il y a une partie de l'allocation budgétaire qui ira au fondateur pour travailler 30 heures par semaine, mais il serait bien d'avoir une brève ventilation de ce qui est inclus dans ce paquet de travail. S'agit-il de marketing, de la gestion de ce projet uniquement ou d'autres projets ? Si le fondateur travaille 30 heures par semaine sur ce projet, cela signifie-t-il qu'il ne participera pas aux autres projets ? La faisabilité de la proposition serait beaucoup plus forte si nous pouvions savoir plus de détails sur la dApp elle-même, comme de savoir la proposition présente principalement l'idée de base, mais pas beaucoup de détails. Quelles fonctions aura-t-elle en dehors du téléchargement/achat de matériel ? Les acheteurs seront-ils anonymes et comment seront-ils distribués ? Intégrera-t-il des NFT, et comment cela fonctionnera-t-il ? Je sais que ces questions sont peut-être \"évidentes\", mais si l'objectif est de toucher un grand nombre de personnes ayant une expérience variée du travail avec Cardano et la technologie Blockchain en général, je pense qu'il serait bénéfique que la proposition inclue ces informations. Pour les raisons mentionnées ci-dessus, je ne suis ni en désaccord ni d'accord avec le fait qu'il est très probable que cette proposition soit mise en œuvre avec succès.", "q1r": 3, "q2": "Afin de mesurer l'auditabilité d'une manière claire et structurée, je suggère que le proposant ajoute beaucoup plus de détails concernant le développement et le processus du projet. Il serait incroyablement bénéfique de voir une feuille de route claire avec des jalons, et avec l'inclusion d'un calendrier estimé. Pour l'instant, nous pouvons seulement voir que le proposant souhaite créer une place de marché, mais quelles sont les étapes de la création d'une place de marché pour les auteurs ? Où en est le projet après 3 mois, 6 mois, 9 mois et 12 mois ? Sur quels canaux sociaux la communauté pourra-t-elle suivre l'évolution du projet ?Je suggère également d'inclure quelques mesures du succès afin de suivre le développement (KPI et métriques). Combien d'utilisateurs seront attendus au cours du premier mois, ou après 6 mois ? Si je comprends bien, Cardano Outreach semble être assez actif dans les médias sociaux, et inclure ce plan ou ce processus dans la proposition augmenterait encore l'auditabilité et la transparence du projet dans son ensemble. L'inclusion d'un court paragraphe de texte expliquant les risques et les défis, et la façon dont l'équipe prévoit de les traiter, augmenterait encore la confiance dans l'équipe, et montrerait qu'ils ont une vue multi perspective et une compréhension profonde des aspects micro et macro du projet.\r\nSur la base du manque d'informations fournies, je ne suis pas d'accord pour dire que cette proposition me fournit suffisamment d'informations pour évaluer les progrès dans l'atteinte des objectifs fixés.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Je conviens que cette proposition présente un problème très intéressant et sa solution potentielle à la communauté.\r\n\r\nAvec de plus en plus de contrôle et de monopole si certains points de vue d'un écrivain ne sont pas en phase avec les plateformes telles que google, facebook, twitter, nous avons vu que beaucoup d'écrivains ont maintenant peur de s'exprimer car ils seront soit enfermés dehors OU bloqués des plateformes pour s'exprimer. Par conséquent, à mon avis, cette solution, si elle est mise en œuvre, donnera pour la première fois la parole à ces écrivains et leur permettra non seulement de s'exprimer, mais aussi d'être récompensés pour cela. Le facteur d'anonymat est absolument important pour la mise en œuvre de cette proposition.\r\n\r\nNéanmoins, je vois beaucoup de possibilités d'amélioration ici, en particulier en donnant un peu plus de détails sur la façon dont cette application fonctionnera ? au moins un haut niveau de caractéristiques et de flux de travail OU des informations sur les fonctionnalités auraient été mieux, car la description actuelle est assez abstraite. Je vois une certaine marge d'amélioration dans la rédaction, d'où les 4 étoiles de mon côté.\r\n", "q0r": 4, "q1": "Du point de vue de l'expérience, les fondateurs ou les responsables de cette proposition sont très expérimentés, mais pour moi, en fin de compte, ce sont les développeurs qui mettront en œuvre cette solution.\r\n\r\nD'un côté, je peux comprendre que l'équipe n'ait pas pu obtenir que ces développeurs partagent publiquement leurs détails ici en raison des limitations affichées par le proposant dans la section des commentaires. Cependant, je dois rappeler qu'il y a d'autres propositions qui l'ont fait, :) donc il est tout à fait logique de donner plus d'étoiles / notes à ces propositions qui ont fait un meilleur travail de présentation afin que la communauté ait plus de confiance en elle.\r\n\r\nPour moi, j'aime l'idée que le proposant propose de rembourser les frais générés par l'application, et cela signifie que le proposant est très engagé dans cette proposition et veut démarrer la mise en œuvre de cette idée. Par conséquent, je suis prêt à lui donner 4 étoiles, mais certaines améliorations sont nécessaires, donc pas tout à fait d'accord ici.", "q1r": 4, "q2": "La bonne chose à propos de cette proposition est que l'auteur de l'idée est assez actif dans la communauté Cardano et fournit donc une bonne confiance à la communauté qu'il sera disponible pour la communauté pour fournir une bonne feuille de route sur le projet.\r\n\r\nNéanmoins, je peux voir qu'il y a beaucoup d'améliorations à apporter pour que cette proposition soit pleinement évaluée. Le plan, les indicateurs clés de performance et les mesures de réussite sont absents. A quoi ressemblera le succès ? Quelle est la feuille de route détaillée pour le MVP ? L'idée est abstraite et il est toujours préférable de s'asseoir avec vos développeurs et d'établir un plan de base sur l'ensemble des fonctionnalités de votre MVP, quand vous le déployerez et qui l'auditera et fournira des informations en retour ?\r\n\r\nPar conséquent, du point de vue de l'évaluation, je lui donne 3 étoiles, ce qui signifie que je ne peux pas dire avec certitude dans quelle mesure il est probable que cette idée puisse être auditée et suivie parfaitement.", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This idea is excellent! Proposer clearly presents the problem with writers and offers a clear solution. This proposal if implemented, would have a positive impact on the Cardano ecosystem and is clearly visible in the proposal on how it will add value to the Cardano ecosystem. Unfortunately, KPIs are not listed so it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.\r\n\r\n", "q0r": 3, "q1": "In this proposal it is clear how the proposer is looking for developers who would realize this idea. It would be good to know who is behind this proposal. Maybe some link from a proposer via LinkedIn or a website. The bearer of the idea does not have the necessary skills and knowledge needed for the realization of this idea. But if he could find developers with experience, knowledge and the necessary skills, the project surely could be realized. The proposer clearly communicates how many developers are needed in the team and most of the requested budget that is clearly presented would go to external collaborators aka developers. The budget is reasonable and broken down into identifiable items. An additional funding is required to implement the proposal but the proposer states that they will be borne by the founder and the devs. Proposer does not specify a detailed implementable plan and details of actionable tasks and order of execution are missing. Unfortunately, there is no more detailed timetable to complete the work and the possible risks have not been elaborated. In the proposal we can find the necessary resources to implement this idea but it would be better to present them in more detail. The explanation and technical aspects and technologies required for implementation are missing.", "q1r": 2, "q2": "It would be good to have an elaborate roadmap with milestones and a time frame within which the idea would be realized. It is also necessary to present KPIs with which the success of this proposal could be measured. Unfortunately the community can't follow the development of this project in any way due to the lack of necessary data.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I find it difficult to see an app like this becoming popular at this time. \r\nThe DApps success defined as attracting users to Cardano. The service that this app aim to provide is not appealing enough compered to many other apps proposed in this challenge.\r\nThere are many platforms for publishing, and readers will not pay for more texts that in the current environment.  ", "q0r": 2, "q1": "The experience \r\n of the proposer seems legit, but there is a lack of information about the rest of the team - in the proposal it specified - \"3 Developers \r\n• Front End, Back End, UI\"\r\nBut there are no names. Is those developers are already part of the team or the plan is to recruit them later? It is not clear. ", "q1r": 3, "q2": "There are no KPIs. ", "q2r": 2, "assessor": "z_assessor_871", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The problem stated is the lack of publishing platforms for writers. I assume StoryTime would be the decentralized version of Amazon KDP publishing, instead of a blogging platform. If so, then this proposal fits the Challenge's needs and could drive more adoption. But if it's a blogging platform, then Publish0x and Steemit is already providing a solution. This proposal would benefit from having a clear statement on its unique selling point. What does safe and decentralized environment mean? Amazon KDP publishers face the risk of being taken down and their funds frozen if the subject material does not meet their requirements. Are StoryTime writers protected from this? There is also no KPI on how the success of this project can be measured. The proposal can be much stronger if these details are added.", "q0r": 2, "q1": "\r\n\r\nNot enough time is spent on the technical aspect of the proposal. The proposal has a clear idea on the manpower needed for the job, but comments seem to reveal that the developers are busy with full-time jobs until January. The team's linkedin/github profiles should be shared to add credibility to the proposal. The dev cost for an MVP product is $32,000 and $9,200 is paid to the founder. More details on StoryTime's implementation needs to be included to justify the money involved. The proposal could also benefit from a section on the risks involved: what if there's too low of an adoption? What if no one finds out about StoryTime? How would censorship or quality management of published content be enforced? Just a few questions that come in my mind.", "q1r": 1, "q2": "No roadmap with milestones for the MVP. No metrics to measure success of the project as well. The proposal would benefit from sharing some technical details as well as expected number of users/sales/books published. Maybe a comparison to Publish0x and Steemit would help? Like a chart showing the differences.", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Nous voulons créer un marché leur permettant de vendre leur travail et d'être rémunérés équitablement dans un environnement sûr et décentralisé via un DAPP.", "experience": "Fondateur de Cardano Outreach, gagnant du fonds 4/6. Plus de 20 ans d'expérience en tant que gestionnaire, propriétaire d'entreprise et éducateur."}