{"id": 384625, "author": "dcspark", "title": "Fractionalized NFTs v2", "url": "https://cardano.ideascale.com/a/dtd/384625-48088", "category": 26240, "amount": 50000, "description": "Nous avons publié un dApp Plutus pour les NFTs fractionnés. Cependant, il n'a pas été audité et ne supporte que le fractionnement de NFTs uniques.", "funded": 2, "upvotes": 192932440, "downvotes": 4443349, "votes_result": 188489091, "votes_cast": 549, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "Je suis tout à fait d'accord que cette proposition répond efficacement au défi.  La v2 de Fracada est très importante à mon avis, car de nombreux projets aimeraient vraiment avoir une fonctionnalité NFT fractionnée dans leurs dapps/projets.\r\n\r\nCela permettra à de nombreux projets d'avoir une solution déjà intégrée pour ce type de cas d'utilisation, et de se concentrer plutôt sur leurs principales règles commerciales / cas d'utilisation. Cette proposition de solution favorise la réutilisabilité, car d'autres projets peuvent facilement examiner le code (repo github public) et réutiliser la fonctionnalité.\r\n\r\nCette proposition en elle-même couvre une fonctionnalité très recherchée, et à mon avis donnera un bon coup de pouce aux développeurs qui construisent des dapps sur l'éco-système cardano.", "q0r": 5, "q1": "Du point de vue de l'expérience, je suis tout à fait convaincu que l'expérience de l'équipe est bien en phase avec la base de connaissances de plutus et haskell pour le développement SC sur cardano. Le développeur principal est très actif dans l'écosystème Cardano et l'équipe a également travaillé avec Emurgo, le projet chargé de fournir des formations aux développeurs et des ressources pour développer considérablement l'écosystème des développeurs Cardano.\r\n\r\nLe plan présenté ici, même s'il n'est pas très élaboré, est déjà en place dans le dépôt github. et sa mise en œuvre est déjà terminée. Ce que l'équipe cherche à obtenir, c'est un audit public de la fonctionnalité des contrats intelligents et, à mon avis, le coût de cet audit aurait dû être détaillé également. Par exemple, au moins quelques liens publics qui indiquent en général le coût de tels audits. Il est clair que l'équipe cherche également à obtenir de l'aide de la fondation Cardano, et globalement, de mon point de vue, c'est un signe assez sain pour ce projet.\r\n\r\nJe suis donc assez confiant dans le fait que ce plan et l'expérience des équipes, cette proposition sera mise en œuvre avec succès. Cependant, je vois quelques défis/risques en termes de problèmes majeurs trouvés dans la mise en œuvre déjà faite, ce qui enlève un point.", "q1r": 4, "q2": "Je pense que les informations fournies ici sont suffisantes pour vérifier l'avancement et le succès de cette proposition.\r\n\r\nSi l'équipe est en mesure d'obtenir un financement, alors elle sera en mesure de vérifier la mise en œuvre du projet et tous les problèmes qui sont trouvés ou soulevés, peuvent facilement être suivis par la communauté sur l'activité Github.\r\n\r\nNéanmoins, comme je suis moi-même développeur, je pense qu'il aurait été bien de donner une perspective plus détaillée en termes de plan de projet / feuille de route pour ce projet.\r\n\r\nLes 15 000 dollars pour le développement de Fracada v2 sont donnés, mais ils n'ont pas été divisés en heures de travail et quelles sont les fonctionnalités attendues ? Ces détails sont très importants pour que la communauté puisse faire un bon suivi de l'avancement de la proposition. Je pense que les développeurs ignorent souvent que les électeurs et la communauté n'ont pas nécessairement une formation technique et que c'est donc au proposant de rendre la proposition suffisamment claire pour le grand public. Je vois quelques améliorations nécessaires dans la rédaction de cette proposition, d'où les 4 étoiles de mon côté.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Fractionalised NFTs have huge potential and an open sourced solution to batched NFTs will definitely bring value to Cardano ecosystem and therefore this proposal is well placed and speaks to the challenge of integrations.", "q0r": 5, "q1": "The team is well known and active within the community and capable of performing the proposal. It would be good to see a more comprehensive breakdown of funds for this proposal as it is a large sum requested.", "q1r": 4, "q2": "The proposal does not have a clearly defined roadmap or KPIs listed. However it can be audited by the simple fact of if the SC is complete and it itself has been audited. It would be great to see a more in depth dive into the timeframe and roadmap however", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal describes creating an improved version of an existing open source package they made called Fracada which helps with fractionalizing an NFT. In this proposal the team looks to allow people to fractionalize a bag of NFTs and also audit the code. The proposal team has also found that there is interest in the community already or their existing project and have also outlined in an article why NFTs are a fundamental building block in DApp development in Cardano. Both the evidence of existing demand and future demand there is a high likelihood that this proposal could have a high impact on the existing community projects already but also with new projects that can utilise the code from the start.", "q0r": 5, "q1": "The team has a background of working in Emurgo and working closely with IOG. They have started a company dcSpark to work on infrastructure to be used in the community and have already delivered against previous funded Catalyst proposals already. The team has already implemented a first version of this proposal which is open source and can be reviewed. Due to the background of the team and evidence of the implementation already there is a high chance it is feasible this proposal will be executed.\r\n\r\nA budget break down has been provided between the auditing and next part of work outlined. It would have been good to know more about who will audit their work as this will determine the confidence levels that community projects would have in implementing this work into their own projects. This is a minor concern as the team has the technical expertise to know who to select for this process however the information would have been nice to add for increasing confidence of audit feasibility.", "q1r": 5, "q2": "A basic roadmap is given stating early 2022 for delivery. No KPIs or success metrics were given. There is already open source code provided which allows advisors and the community to audit the code already and will be able to continue auditing that code as and when it gets updated. It would have been good to see here more on success objectives that explore some of the use cases for this work. NFT marketplaces appear to be a clear example given, however some other examples would add clarity to where to expect this proposal to be used and how that could influence what the success outcomes are for this proposal.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 7, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Nous voulons publier une version 2 de Fracada qui soit auditée et qui permette de fractionner un sac de NFT.", "experience": "Ayant précédemment travaillé chez EMURGO, nous avons travaillé sur Plutus pendant des années et publié Fracada en tant que contrat intelligent MIT open-source pour Cardano."}