{"id": 384922, "author": "rajatauton", "title": "Liquidity Aggregator for Cardano", "url": "https://cardano.ideascale.com/a/dtd/384922-48088", "category": 26240, "amount": 50000, "description": "Il n'y a actuellement aucun agrégateur de liquidités sur Cardano ou sur le DEX basé sur le carnet d'ordres, ce qui place les traders dans une situation concurrentielle très défavorable.", "funded": 2, "upvotes": 145223690, "downvotes": 10823828, "votes_result": 134399862, "votes_cast": 699, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "Je suis d'accord pour dire que cette proposition répond efficacement au défi. La proposition vise un agrégateur de liquidités sur Cardano, un peu comme ce que fait le protocole Orion. Cette idée n'est pas nouvelle dans l'espace, cependant, sur Cardano, cela pourrait être la première.  Le plan détaillé explique également comment cette solution aidera l'éco-système Cardano dans l'espace DeFi.\r\n\r\n\r\nL'énoncé de la solution est clair et compréhensible. En outre, le plan détaillé explique plus en détail pourquoi l'équipe pense que sa solution est nécessaire. Par exemple, Smartpools sur SmartDex 2.0 semble être une idée vraiment intéressante qui donnerait une chance égale aux traders/investisseurs de détail d'avoir de meilleurs retours sur leurs investissements.", "q0r": 5, "q1": "Le lien internet fourni dans la description de la proposition contient une description détaillée de l'équipe qui est à l'origine de cette proposition.\r\n\r\nL'équipe dispose d'un bon ensemble de développeurs et d'une liste de conseillers où Ben Goertzel est également mentionné. Du point de vue de l'expérience, je suis confiant dans l'équipe.\r\n\r\nDu point de vue du plan, la distribution des fonds est clairement expliquée, bien que pas en termes de taux horaire, mais les taux mensuels sont donnés qui sont justifiés. Les jalons trimestriels sont bien élaborés avec des détails sur ce que l'équipe prévoit de réaliser au cours de chaque trimestre.\r\n\r\nDans l'ensemble, la proposition est bien rédigée et je suis convaincu qu'elle a de grandes chances d'être mise en œuvre avec succès.", "q1r": 5, "q2": "Le plan explique en détail à la communauté les problèmes existants et ce que cette proposition tente de réaliser. Ce plan est en outre bien décomposé dans la feuille de route, trimestrielle.\r\n\r\nLa définition du succès après 3 mois, 6 mois et 9 mois est donnée par points, et est donc claire à comprendre et à suivre. La communauté dispose également de dates provisoires pour la bêta du Testnet et la bêta du Mainnet.\r\n\r\nPuisque le profil de l'équipe est public, toutes les conditions requises pour auditer l'avancement de cette proposition, à mon avis, sont remplies et je suis donc très confiant que les informations fournies sont suffisantes pour auditer l'avancement et le succès de cette proposition.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2, "reply": "Thank you for the assessment. We look forward to being an asset to the Cardano blockchain and helping to onboard users to the space."}, {"q0": "Interesting idea. If we can have such a \"hybrid\" dex, it can definitely attract more users to the Cardano blockchain and increase its adaptability.\r\n\r\n\r\nQuestion is - why there is not such a product already? (by someone else) where is the catch? \r\n\r\nI find this proposal highly in accordance with the challenge impact. Rating is given 5.", "q0r": 5, "q1": "Their product is working, yet I could not find any information about the proposers, no links nor relevant experience stated.\r\n\r\nIt would definitely increase the credibility of proposers if such information would be included. \r\n\r\nRelevant experience stated.\r\n\r\nGiven the working website- \r\n\r\nRating given 4.", "q1r": 4, "q2": "A detailed roadmap is provided, in reasonable detail.\r\n\r\nAlso, the definition of success if stated, which is increasing the audit. \r\n\r\nBased on the information given, I find it sufficient for audit. \r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "Cross-chain liquidity aggregation will be a massive catalyst for onboarding billions of dollars in liquidity from other blockchains, right as Cardano defi comes online. This is a crucial time for Cardano and implementing corss-chain liquidity and swapping functionality will exponentially grow our ecosystem faster than just about any other single factor. I believe this proposal succeeding will go a long way to making Cardano the blockchain of choice for defi in the web3 world!", "q0r": 5, "q1": "The team has experience with building on other blockchains that they will bridge Cardano to. They have a live product already deployed on ethereum and binance smart chain and polygon  where they have already built a DEX and a cross chain liquduity aggregator for cross chain swaps.\r\n\r\nI think this proposal as written has a very high probability of success and will benefit the entire cardano ecosystem greatly once implemented.", "q1r": 5, "q2": "The roadmap for this proposal is very impressive, detailed with reasonable milestones and contains specific KPIs for each  milestone on the roadmap. \r\n\r\nI think project catalyst has plenty of information to successfully audit this proposal and determine whether it was successful or not.\r\n", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "I'd like to thank you for the great words of encouragement in our project. Autonio plans on being a boon to Cardano and a crucial project for helping onboard users to the Cardano ecosystem with our Smartdex."}, {"q0": "Extremely accurate challenge fit. Provides a good summation of the problem and a well delivered presentation. ", "q0r": 5, "q1": "The proposal provides a clear use prior Dex knowledge and presents a clear and defined roadmap. The proposal also take not from leading players and makes efforts/plan to include them in the future. What will make this project stand out from other DEXs being launched on Cardano? ", "q1r": 4, "q2": "Yes. The proposal contains detailed points of reference and provides a clear outline of how the requested funds will be spent. My only concern is the shear number of items on the roadmap. I'm concerned voters may not be able to process such an aggressive action plan and believe it is not possible to complete in the proposed time. Maybe provide a cleaner timeline that is easier to audit. ", "q2r": 4, "assessor": "z_assessor_970", "no_vca": 23, "ne": 3, "ng": 13, "nfo": 7, "vca_o": 1, "reply": "Smartdex will be set apart from other DEXs by our ease of use, cross chain bridging and liquidity aggregation and other features. It is already aggregating liquidity on ETH, Polygon, and BSC and we are working to incorporate Cardano currently as well as others. Users will be able to trade, bridge, swap, cross chain bridge, cross chain swap, invest in smartpools and liquidity pools, earn through our earn section, and more planned for the future. We have updated our timeline as well as our project experience."}], "solution": "Smartdex regroupe la liquidité à travers les DEX pour offrir aux utilisateurs des transactions efficaces ainsi qu'une solution de règlement hors chaîne et sur chaîne.", "experience": "DEX sur ETH, Polygon, BSC avec book and swap, mise à niveau vers 0x v2.1 en 2020, la sortie de 2.0 avec agrégation de liquidité et swaps cross-chain."}