{"id": 380920, "author": "vicepool", "title": "ADAPlus - Pool Boost", "url": "https://cardano.ideascale.com/a/dtd/380920-48088", "category": 26246, "amount": 38100, "description": "支持小型任务驱动的SPO的代表们在资金池获得令人印象深刻的赌注金额之前不会得到奖励。SPO也处于亏损状态。", "funded": 2, "upvotes": 88733270, "downvotes": 7195835, "votes_result": 81537435, "votes_cast": 441, "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "It's a great idea that can help small pools survive. I see only one issue related to trust. But, I think that the authors are well aware that the reputation will be lost in the event of deception and non-payment of rewards. I love that the authors want to make all votes and numbers transparent.", "q0r": 5, "q1": "I have no doubts about the reality of this project. It is not the first time the proposal authors have participated in Catalyst, and they have working projects that benefit the Cardano ecosystem.", "q1r": 5, "q2": "Both the budget and roadmap are realistic. I think the defined time is real for creating the project, and the final result is described sufficiently.", "q2r": 5, "assessor": "z_assessor_104", "no_vca": 26, "ne": 2, "ng": 14, "nfo": 10, "vca_o": 1}, {"q0": "ADA Plus Pool Boost is proposing to support small stake pools by providing a common launching pad.  Small pools register for the service and delegators vote on which small pool they prefer.  ADAPlus SPO rewards are distributed to the small stake pools. Once a pool receives votes sufficient to sustain operation the supporting voters are encouraged to transition their stake to the pool.\r\n\r\nThis is a creative idea for overcoming the challenges of sustainable independent SPOs.  If the concept works it would provide an opportunity for new and/or small SPOs to ramp up their operation in an economical manner.", "q0r": 5, "q1": "The proposal is very well written providing explicit detail describing how the operation will work.  A clear roadmap towards operational capability for a public launch in 2022 is provided. The budget describes how the funds will be allocated. The team was funded in F6 for a related project and the F7 proposal describes how they will leverage that capability and build additional services.", "q1r": 5, "q2": "The KPIs are described for 3, 6 and 12-month milestones.  The goals are clear: 3-month - build infrastructure; 6-month - register 5 initial pools and 100 initial delegators; 12 -month public launch of service.", "q2r": 5, "assessor": "z_assessor_145", "no_vca": 26, "ne": 5, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "This is great community approach to a challenge that nay be prevalent in the SPOs reward system. This would greatly help delegators and SPOs ability to mint blocks and the way is done is very in line with Cardanos blockchain strengthening the security of its decentralization efforts.", "q0r": 5, "q1": "There is a plethora of experience and previous work on the blockchain by this group of proponents. Highly confident that the plan will be sucessfully implemented.", "q1r": 5, "q2": "The plan, the funds and the KPI metrics are quite clear and achievable. Have high confidence in the deliverables.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 21, "ne": 2, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "This is an interesting approach that combines a lot of ideas I have seen in previous catalyst proposals. I like that it can support small mission driven pools, but the idea of these \"ghosts pools\" with no delegation and not minting blocks, but being funded through another mechanism, is somewhat counterintuitive. I understand that the idea is to transfer stake to the chosen pools when the gain sustainability, but I worry that there will be little incentive to gain the necessary delegation in the boost pool to have a meaningful impact, with a large number of pools just sitting around wasting energy and collecting a few ada per epoch while providing no service to the network other than serving as a relay. ", "q0r": 3, "q1": "The proposer have a couple catalyst projects in development and seem capable of executing the project as described. ", "q1r": 4, "q2": "budget, roadmap, and KPIs all seem realistic and are detailed sufficiently to make the auditing process meaningful. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The proposal perfectly addresses the challenge. In fact, it is a wonderful idea and a well thought-through mechanism to support smaller SPO's, especially the ones with a larger mission/purpose beyond decentralization. Of course, every voter has to understand that it will first and foremost be an experiment to show if those mechanisms work and if there are no unfixable ways to exploit such a incentive structure. However, there is no other way than experimenting with large crowds and community to find out.", "q0r": 5, "q1": "The team is experienced and the plan itself is also solid. My assessment will be 'strong agree' to this criterion regardless of understanding that fundamentally the 'highly likely' aspect is about getting small SPOs and delegators on board. But exactly to know that, this kind of experiment is necessary and therefore the noticeable marketing budget asked in the project is justified.", "q1r": 5, "q2": "Convincing and verifiable KPIs are presented in the proposal. What makes those KPIs stand out, is that there is a clear 'skin in the game' for the proposers: already reaching the first 3-month milestone KPI has significant recurring costs involved (10 VMs etc), so it will be already clear after the first milestone if there is progress or not.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal seeks to promote more SPOs, through sharing of 100% of its profit to SPOs to achieve sustainability. The challenge is well addressed in the write up mentioning that Pools of the Cardano network are the central part of the blockchain due to the speed of information distribution through the network, transaction processing and stability because the stability of newly created blocks depends on them; unlike other POS -based blockchains, Cardano pools have their own personality.", "q0r": 5, "q1": "The team is made up of 2 co-proposers with over 15 years experience as SW Engineers, entrepreneurs, marketers, already part of Cardano Wall and ADAPlus. The team can implement the proposal successfully. The detailed write up and plan of the proposal, among others, mentioned that the project will generate income for SPOs; also, the profit from pool boost is distributed to support the purchasing SPO and their delegators. All these facts will lead to successful implementation of the proposal.", "q1r": 5, "q2": "The road map is detailed showing 12months period divided into quarter years with detailed mapping of work to be done. The budget is well broken into the minutest detail making auditing very effective. Good proposal.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}], "solution": "Pool Boost将其100%的利润分配给SPO。代表们为SPO投票，一旦达到目标金额就直接重新授权。", "experience": "两位共同提案人。超过15年的SW工程师、企业家、营销人员的经验。来自CardanoWall和ADAPlus的开发者。"}