{"id": 381012, "author": "matthiasksieber", "title": "Blace.io: Marketplace Creator ⚡", "url": "https://cardano.ideascale.com/a/dtd/381012-48088", "category": 26251, "amount": 97000, "description": "Au fur et à mesure que les places de marché sont construites, des travaux répétitifs sont exécutés, ce qui réduit l'efficacité globale des développeurs.", "funded": 1, "upvotes": 51226590, "downvotes": 24056593, "votes_result": 27169997, "votes_cast": 209, "f6_no_assessments": 3, "f6_rating": 4.666666666666667, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=18945"], "media": [], "f6_assessments": [{"q0": "Ce projet sera énorme s'il réussit. La proposition essaie d'éliminer la plupart des travaux en double par les développeurs en construisant un outil de place de marché dans un endroit réutilisable. Cela permettra aux autres développeurs de Dapp de se concentrer uniquement sur les différentes fonctionnalités et aspects de leur propre Dapp. En tant que développeur moi-même, j'adorerais avoir un tel outil. La définition du défi est conforme à la proposition. Ce projet apportera une énorme valeur ajoutée à l'écosystème cardano, en raison de l'accélération et de l'amélioration de la cohérence si tous les futurs marchés ont les mêmes os.  Il s'agit d'une grande équipe, qui sera en mesure de faire face à tous les défis futurs qui pourraient survenir. Contrairement à beaucoup d'autres propositions similaires que j'ai vues, il ne manque aucun élément dans celle-ci. Pour l'instant, l'écosystème de développement manque de tels outils, qui joueront un rôle vital à l'avenir.  ", "q0r": 5, "q1": "L'équipe est assez importante, ce qui me garantit que le travail sera effectué comme décrit dans la feuille de route. Ils ont toutes les compétences logicielles nécessaires pour mener à bien ce projet. Ils ont laissé leur profil linkedin, et apportent ainsi une légitimité à leur travail. Le budget est assez important et il aurait été intéressant d'avoir une ventilation des coûts réels prévus dans la feuille de route. Je suggère aux proposants de ce projet de vraiment penser à un tableau de ventilation du budget. Le fait qu'ils aient déjà identifié le nombre de membres de l'équipe et leurs compétences est étonnant, mais ce qui l'est encore plus, c'est qu'ils ont déjà formé une équipe prête à travailler.  Il y a un calendrier réaliste et raisonnable pour réaliser le travail. Les auteurs de la proposition montreront non seulement quand, mais aussi comment le travail est effectué, lorsqu'ils ouvriront les blocs de construction.  Les aspects techniques de la proposition sont assez simples ... écrire du code pour que d'autres développeurs puissent l'utiliser. En tant que développeur, j'ai été impressionné par le fait que le CLI (interface de ligne de commande) sera fait en utilisant Haskel, qui est le choix original de langage pour l'écosystème cardano. Les membres de l'équipe ont une très grande majorité de compétences et de capacités, je suis donc confiant dans leur capacité à relever les défis à venir. Les projets futurs devront être synchronisés avec celui-ci afin de promouvoir un développement plus rapide.  ", "q1r": 5, "q2": "Toute personne intéressée par le travail en open source sera en mesure de suivre l'évolution de cette proposition, à l'exception de l'outil CLI, qui sera en open source une fois le projet déployé. Cela rend l'auditabilité de la proposition assez facile. Il n'y a pas de KPIs listés, ce qui est un petit problème, je recommanderais d'ajouter quelques mesures d'adoption pour les futurs projets.  La feuille de route et les jalons du projet sont clairement définis et réalisables. Il y a une description claire et compréhensible du problème ciblé, et les proposants posent toutes les bonnes questions. Il est facile de voir qu'ils ont vraiment réfléchi avant de faire cette proposition et qu'ils ont vraiment creusé les problèmes commerciaux et de développement de l'état actuel de l'écosystème.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 4, "nfo": 2, "vca_o": 2}, {"q0": "The proposal is addressing one of the most critical requirements of the Cardano open source ecosystem. This proposal is an example of why this fund stream was created. This proposal has the potential to lower the entry-level for a large number of innovative market makers and boost the complete ecosystem in a substantial manner. ", "q0r": 5, "q1": "The proposal is being made by a strong team of innovators with established credentials in the Cardano community.  The project site list 9 international members. The countries that are represented in the team just exemplify the spirit of Cardano and the power of open source to bring people together. I would like to stick my head out and go on to say that it is one of the best teams we have seen in the Cardano proposals. ", "q1r": 5, "q2": "The proposal is clear and has a well-defined functional point that is aimed to be developed. Their output will be open domain and the progress can be monitored. The proposal is highly auditable and the success can be measured based on the number of forks/use of the web market. \r\n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal intention is to build infrastructure that makes it easier to create a marketplace within the Cardano ecosystem. The core components are listed that are common to a marketplace and that are often shared pieces of logic and functionality between systems. As identity and payments increasingly utilize blockchain we can expect to see an increasing demand for marketplaces for both services and products. Marketplaces represent some of the biggest companies in the world and due to that there is a big opportunity for this proposal to lead to high impact marketplaces if executed well.", "q0r": 5, "q1": "The proposal team are listed in a separate link with their LinkedIn profiles added. The team has a strong background in software development which will be important for feasibly executing this proposal. A budget breakdown is not provided which makes it difficult to know exactly where the funds will be used. The teams background makes this proposal feasible but to further improve the rating more information would be needed for a budget breakdown and also potentially more information on the core features and how they would be implemented as they are non trivial. Some of the features could have been marked as high priority and released in stages as they are completed.", "q1r": 4, "q2": "A roadmap is presented with the key areas of focus. No KPIs or success objectives have been added. As an area of improvement the core components listed are likely non trivial to implement, it would have been good to see some groupings to state which ones will be implemented first so they could be released and shown to the community, ideally open source. This would make it easier for the community to audit and provide feedback as the proposal progressed through the initial implementation. Better clarity on the budget break down would also be valuable so it's easier for the community to audit where the funding budget was spent.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Fournir aux développeurs une couche de base de fonctionnalités de marché, afin qu'ils puissent se concentrer sur les spécificités de leurs produits et services.", "experience": "Une équipe expérimentée de développeurs, de pionniers de Plutus, d'experts juridiques, de chefs de projet et de directeurs techniques."}