{"id": 381617, "author": "henno", "title": "Open Source for the environment", "url": "https://cardano.ideascale.com/a/dtd/381617-48088", "category": 26251, "amount": 4380, "description": "La nature est une externalité de notre système économique.\nPlus vite nous pouvons tout prendre à la nature, plus nous serons rentables.", "funded": 0, "upvotes": 19070348, "downvotes": 27883141, "votes_result": 8812793, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=13945"], "media": [], "f6_assessments": [{"q0": "Le projet propose une nouvelle monnaie qui sera corrélée à la nature grâce à un composant de mesure supplémentaire qui varie en fonction de la façon dont un produit est fabriqué et si ce processus est destructeur pour l'environnement ou non.  L'impact dépend de l'adoption de ce projet, donc l'impact est très difficile à mesurer par lui-même. Ce projet va certainement aider l'écosystème des développeurs de Cardano avec un exemple de construction de Dapp. La proposition indique comment il apportera de la valeur, mais elle ne précise pas l'écosystème de Cardano. Ce projet serait encore mieux adapté au défi DApps & Integrations. Si la proposition peut s'étendre avec l'intérêt, cela dépend entièrement de l'auteur, mais en gardant à l'esprit l'expérience déclarée, je ne vois aucun problème à accueillir les défis et la croissance potentielle.  ", "q0r": 4, "q1": "L'impact de ce projet dépend de son adoption. Et surtout de l'honnêteté des fournisseurs de produits lorsqu'ils décrivent le processus qu'ils utilisent. Ce fait est pour moi un gros défaut du projet. Il est clair que l'auteur du projet y a consacré beaucoup d'efforts, mais je pense aussi que cette approche est trop idéaliste pour fonctionner dans la pratique, si l'on en croit les vidéos postées sur la chaîne youtube, qui indiquent que la relation entre le prix à payer pour un produit dépend indirectement de la réponse honnête du fournisseur quant à l'origine de l'eau utilisée pour la culture du produit, aux engrais utilisés (destructeurs de l'environnement ou non) et à une série de questions spécifiques pour chaque type de produit. Je vois deux problèmes pratiques principaux qui n'ont été mentionnés nulle part : 1. Comment allez-vous garantir que les fournisseurs répondront honnêtement à des questions qui pourraient avoir un impact négatif sur leur activité ? 2. Qui décide des questions posées pour un produit spécifique. Pour ces deux raisons principales, je ne pense pas que ce produit soit réalisable. Si le proposant n'a pas l'intention de réunir une équipe pour les propositions futures en se basant sur celle-ci et en la soutenant, il sera très difficile de concrétiser cette idée. Le budget est ventilé pour identifier les éléments, mais j'ai vraiment le sentiment qu'un financement plus important serait nécessaire pour atteindre les objectifs fixés. Je parle en tant que développeur qui a effectué un travail indépendant similaire à la proposition. Aucun calendrier n'est proposé dans la proposition, donc je dirais que c'est un point critique d'amélioration de cette proposition. Il y a une vaste description de l'objectif final à l'esprit, ce qui est formidable, mais je n'ai pas trouvé dans la proposition les étapes concrètes pour y arriver et le calendrier pour l'ensemble du plan.  Les aspects techniques n'étaient pas assez détaillés pour que je puisse les comprendre, bien que j'aie regardé plusieurs vidéos postées sur le canal des proposants. Un livre blanc aurait été un excellent moyen d'éduquer les gens sur la mise en œuvre réelle de l'idée. La proposition indique seulement que la tokenomique de ce projet est complexe sans plus d'explication. Ma suggestion serait de réfléchir aux risques pertinents pour une mise en œuvre réussie comme : ai-je besoin d'une équipe ? ai-je les étapes concrètes, la feuille de route et le calendrier pour accomplir les tâches ?", "q1r": 2, "q2": "L'auteur de la proposition n'a pas mentionné d'indicateurs clés de performance (KPI) ni de moyen de suivre l'évolution de la proposition. Ma suggestion serait donc de se concentrer sur des exemples pratiques clairs et des KPI ciblés pour permettre à la communauté Cardano d'aider et de comprendre l'idée globale du projet.  Comme mentionné, il n'y a pas de feuille de route ou de jalons à proprement parler. J'ai eu du mal à trouver une description claire de la question \"comment vais-je mettre en œuvre le projet ?\". La solution semble excellente, mais je n'ai pas compris le plan pour la mise en œuvre réelle et les incitations commerciales.", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is a novel and a Nobel attempt to create an open-source system that will enable value creation by following nature-preserving options in any walk of life. However, its direct impact on the open-source echo system is debatable. This proposal may have limited direct impact directly but may act as a catalyst to force the open-source community to delve more in this exciting area. ", "q0r": 5, "q1": "The proposer is developing a model to monetize nature preservation measures, this is a much-needed revolutionary concept and needs to be taken up. The proposer has been following the idea in a passionate manner and created a centralized website that is able to demonstrate the idea. This is a novel and complicated mechanism and needs substantial oracle support in a decentralized setting. The deliverables of the proposal are not explicit and may not create an immediately usable system. ", "q1r": 4, "q2": "The proposal has listed 7 features that he aims to develop in this fund these are clear software features and will be released in open-source. The project can be audited based on the quality and the number of deliverables successfully created. There is a need for creating more documentation on how the tokens can be made valuable and how they will be pegged to fiat. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Your statement, \"The quicker we can take everything from nature, the more profitable we will be.\". The above information would be easy to confuse the reader about your project's working progress intention if not read through your entire project. It should be clearer where and how the community will access your results output and the availability channel. ", "q0r": 4, "q1": "With 20 years plus in database development back and front and website design and implementor. I am not quite sure why your crucial performance and course breakdown only create a small website functionality, draw some pictures on objects and research, research, and a small questionnaire to be developed for $4380. I believe you would deliver better with your skill-set in database and web services. As the proposer stated, it is a proof of concept. I think in the next three months, with the key performance indicator, the proposer would be able to deliver the promised PKIs.", "q1r": 4, "q2": "The proposer should have highlighted clearly whether the community will benefit from your project available in Cardano ecosystem open-source packages or your project using available open-source resources for your project. Once the progress is evident and nailed down agenda, the committee has a more transparent view to audit your project progress. This also helps the current Fund 7 Challenge team easier to make a report for the next three months if your project is being funded.", "q2r": 3, "assessor": "z_assessor_726", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "Dans la vie. Dans la vie, tout est connecté.\nConnecter l'environnement aux transactions est difficile ?\nEst-ce que cela peut être fait dans Cardano ?", "experience": "Ingénieur industriel, 20+ ans de développement (base de données, services Web, front-end et back-end)\nA passé des années dans le commerce électronique et les affaires"}