{"id": 382199, "author": "highlander", "title": "Smart Contract Library - Phase 1", "url": "https://cardano.ideascale.com/a/dtd/382199-48088", "category": 26251, "amount": 45000, "description": "Cardano ne dispose pas d'une bibliothèque open source de contrats intelligents que les développeurs peuvent utiliser pour le prototypage rapide.", "funded": 1, "upvotes": 47711176, "downvotes": 17707950, "votes_result": 30003226, "votes_cast": 200, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Ce projet vise à créer et à mettre en source un ensemble de modèles de contrats intelligents pour accélérer le développement global de Cardano. Ce sera une grande contribution avec un impact encore plus grand si cela se produit, en raison de l'impulsion qu'il donnera à tout développeur pour tester et apprendre à connaître l'écosystème cardano et la façon dont les choses fonctionnent. La proposition identifie un problème adapté au défi à relever. Il y a une idée claire de la façon dont cela va améliorer l'écosystème cardano décrit. Il n'y a pas de mesures clés à proprement parler qui s'alignent sur les paramètres du défi. L'ajout de telles mesures serait mon conseil pour les propositions futures. Je garde à l'esprit que les auteurs de cette proposition ont une expérience sérieuse et pertinente dans la création de contrats intelligents en etherium et je suis confiant qu'ils seront en mesure de relever les défis futurs qui se présenteront à eux.  Si cette proposition est mise en œuvre, elle apportera beaucoup à l'écosystème en termes de modèles de contrats intelligents réutilisables, ce qui est nécessaire dans les communautés en croissance comme celle de Cardano.   ", "q0r": 5, "q1": "Le plan est d'embaucher un développeur pionnier de Plutus ouvert qui a de l'expérience dans les contrats intelligents, mais cela ne s'est pas encore produit, donc aucune référence ne peut être donnée ou liée, ce qui est un obstacle car une personne concrète qui pourrait faire le travail de manière vérifiable apporterait de la crédibilité à cette proposition. Le budget est assez simple : il s'agit de payer un salaire à une personne pour faire le travail. Le calendrier pourrait être amélioré puisqu'il n'y a pas d'étapes importantes, à l'exception de la publication d'une version bêta. La faisabilité du projet dépendra de la capacité de l'équipe à trouver un développeur pour faire le travail ou non. La bonne chose est qu'il y a une compréhension claire et un plan pour combien de membres de l'équipe seront nécessaires pour la mise en œuvre de la proposition. Le budget est suffisamment clair, compréhensible et décomposé en morceaux afin de décrire les étapes nécessaires pour atteindre l'objectif. Il se peut que des tâches et des étapes plus techniques soient nécessaires en cours de route. Il y a un calendrier réaliste et si les proposants le suivent, il ne devrait pas y avoir de problème pour réaliser le travail comme prévu. Il y a une description des éléments nécessaires à la mise en œuvre, mais pas de feuille de route qui explique clairement les tâches séquentielles qui seront travaillées, ce qui pourrait aider les partisans de ce projet à ralentir la mise en œuvre .  La chose que j'attendais en tant que développeur était de voir une sorte d'architecture ou de plan pour les technologies qui vont être utilisées. Cela m'aurait permis de savoir s'il serait facile de trouver une personne pour faire ce travail. En l'absence de détails, je suis incapable de donner une estimation correcte du succès sur la base de ce qui est décrit dans la proposition. Les proposants ont une expertise significative dans le développement de contrats intelligents sur Etherium qui sera bénéfique même si l'écosystème et les paradigmes sont différents sur Cardano.  Il pourrait y avoir de la place pour des collaborations entre ce projet et d'autres que j'ai vus dans le défi de l'écosystème des développeurs.", "q1r": 4, "q2": "Puisque l'équipe prévoit que tout le code soit open source sur un dépôt, je n'imagine pas qu'il y aura un problème pour toute personne intéressée à suivre l'avancement du projet. Aucun indicateur clé de performance n'est fourni, ce qui aiderait tout membre de la communauté à mesurer le succès de la proposition. Je suggère d'ajouter des KPI plus concrets et peut-être de diviser la proposition en plusieurs tâches différentes qui seraient mises en œuvre sur plusieurs fonds.  Une feuille de route est une suggestion deffinitive pour les futures propositions de fonds, c'est juste une partie intégrante de tout bon projet.  Il aurait pu y avoir plus d'explications sur le côté technique des choses, mais dans l'ensemble je crois en ce projet !   ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is a brilliant and game changing idea to have a smart contract library available to help speedup the developments proocess on the cardano ecosystem. This is game changing it will help speed up the process of application development on the cardano blockchain since developers can easily use already build open source templates which will ease their burden of having to start writing smart contracts from the scratch.", "q0r": 5, "q1": "The team have the required expertise to execute the project. The budget sits well though not so detailed but it is reasonable to guarantee a successful project execution.", "q1r": 4, "q2": "The proposer has outlined a timeline for project execution but has failed to include key metrics/KPI's, which is key to be able to help audit the progress and success of the project when funded. ", "q2r": 3, "assessor": "z_assessor_799", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly and concretely answers the most important guiding question of this challenge, “How can we ensure future developers benefit from the work that is funded today?”. Its plan is simple to describe and understand, but its impact could be substantial, not only for existing Cardano smart contract developers, but also it could prove a great resource for attracting new developers to the platform by making their transition much easier with a prebuilt library of smart contract templates, which is the aim of this project. Overall the proposal could have a big impact on the ecosystem if properly executed as it could make the experience of smart contract developers on Cardano much smoother.", "q0r": 5, "q1": "The team clearly has experience with building blockchain related applications, as is evident from their website, which hosts multiple NFT related mini-games. But, from the looks of it their current smart contacts run on the Binance Smart Chain & Ethereum and it’s unclear if they have Cardano specific experience, as that’s not mentioned in the proposal. However this may not have a great impact on the feasibility of the proposal as their plan is to hire an external developer part-time to write the Cardano specific smart contract templates, in fact this is where most of their requested budget is allocated towards (40 out of 45K).\nTheir goals are realistic, the proposal is written in a very down to earth manner and the requested budget seems feasible. The very reasonable amount of $30/h is given, and a full year of part-time development is factored in.", "q1r": 5, "q2": "The audibility section of the proposal is the only one that leaves a few things to be desired, like a clear description of the KPIs and of the exact intended launch dates. However these can be easily deduced from the proposal, as they are mentioned. Thus the progress of the proposal according to the given timeline, as well as the completion of the smart contract templates could be easily monitored and verified by the community auditors. However if a future submission of the proposal will be required I would recommend including these elements.\nI would like to mention that in the case of this proposal specifically the community would need to audit the quality of the technical output as well as the overall completion of the project. We certainly want to be vigilant about wasting community treasury funds, but perhaps in this case it would be even more important to assess the quality of the smart contract templates generated by the project. It would be far worse to release a set of flawed smart contracts in the community carrying the stamp of approval of project Catalyst.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is clear and concise which aims to build and publish a series of smart contracts templates, similar to Ethereum's Open Zeppelin which Cardano developers can use. Laudable idea and it addresses the challenge effectively.", "q0r": 4, "q1": "The team is behind the Highlander platform and they have written smart contracts on Ethereum already, and are capable of implementing the project. The plan depicts that they aim to build an introductory series of smart contract templates for token issuance, NFTs, and governance protocols. They will then release the contracts to the public and refine thm based on user feedback. The team can successfully implement the project based on the valid facts in the proposal.", "q1r": 4, "q2": "The budget is well broken down and timeline clearly showing 3, 6 and 12 months. The amount requested is also reasonable for the project.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1}], "solution": "Construire et publier une série de modèles de contrats intelligents, similaires à OpenZeppelin d'Ethereum, que les développeurs de Cardano peuvent utiliser.", "experience": "Nous sommes l'équipe derrière la plateforme Highlander. Chris est notre développeur principal et possède une grande expérience dans l'écriture de contrats intelligents sur Ethereum."}