{"id": 384062, "author": "antoine", "title": "Cardano-L-EARN", "url": "https://cardano.ideascale.com/a/dtd/384062-48088", "category": 26251, "amount": 18000, "description": "La courbe d'apprentissage de Cardano est très raide. Nombreux sont ceux qui veulent apprendre mais qui sont fortement limités par le temps, les ressources et la volonté.", "funded": 0, "upvotes": 20843094, "downvotes": 18903050, "votes_result": 1940044, "votes_cast": 133, "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal will create a rewarding framework to learn Cardano Basics and development skills. The aim contributes to the challenge of improving the developer ecosystem. The modality and the success can be argued. However, if this project is carried out in earnest it is likely to result in the onboarding of new people to the ecosystem.", "q0r": 4, "q1": "The proposer is already running a fairly well-received  BlockDevsUnited and the associated blockchain training events. Therefore the current proposal is fairly straightforward to implement which will prepare training materials and offer rewards for participants in ADA for completing the task. It is very likely that the proposer will be able to achieve the aim. ", "q1r": 5, "q2": "The proposal is requesting $9000 for course development and $9000 as incentives for learners. The proposal will result in creating a permanent training resource that is auditable, however, the distribution of reward is likely to be difficult to audit. The skillset of the learners at the end of the course is also difficult to understand. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1, "reply": "We will track and publish expenditures (for both development and learners) to ensure excellent auditability"}, {"q0": "The project wants to incentivise learning with financial stimulus. The impact of such a project would be great, because who doesn't want to get payed to learn. It's a really nice idea, and the proposers of the idea already have some know-how on doing things. The identified problem is valid, because right now at this stage of the cardano development there aren't enough devs who are well versed in haskel or other related programming languages and technologies. There is a clear value to this proposal, which will help the cardano ecosystem grow with more developers growing their skillset. This proposal finds a nice spot in the challeng setting, and will bring a lot of new devs to the system if completed successfully. I hope the proposers have thought of a long term way to scale, because the funding would indeed increese with the need for adoption, and a strategy for future funding would be a good idea. This is maybe one of the few things lacking in the proposal and is my suggestion and hope the authors bring some attention to this unknown. There sure are a lot of learning ideas and proposals in the ecosystem, but this is the first I've seen to offer financial incentives to help people learn.   ", "q0r": 5, "q1": "And it's empty right now, and I would have been glad to see a simple readme with a description of the intention of the project, just as a good will gesture. If the proposers had added linkedin profiles or some kind of credentials, it would greatly improved the credability of the project in my oppinion. There's a lack of concrete timetables and the actual budget distribution is too general. There are no answers on how will the teachers and testers be aquired (are they going to be hired later on or are there onboard already?) Do the proposers have the necessary manpower and resources to do what's stated in the proposal? These are some serios but unanswered questions which bring down the feasability of the project a bit.  I was hoping for a more clear breakdown tables of expenses and timetables to complete the planned work. This would enable supporters of the project monitor and lend a helping hand if there was a specific roadmap and plans for implementation and hiring. I see the \"what\" but I was searching for the \"how\" do they plan to make this idea a reality, and the proposal lacks a bit info in thata regard. There is some description of what resources would be necessary to bring the project to it's fruition although a bit vague at times.  My suggestion fro the proposers would be to ask themselves: \"What are the risks for our project?\" so they can prepare accordingly, because throghout the last couple of funding rounds there were a lot of stories of hurdles that almost brought the whole project down. I'd also suggest some kind of a colaboration with other educational platforms and proposals.  ", "q1r": 4, "q2": "One thing that left wanting is the KPIs. It would have been nice to have an expected adoption rate or expected results for a given time since the start of the project.  The roadmap and milstones are missing as well, so I struggle to see the steps that need to be taken to lead the project to it's end. There's a clear description of the targeted problem, but not the targeted solution.  The proposer should put themselves in the shoes of the voter, maybe go to the discord channel and ask what would the users want to see in a platform such as this one. This would give them great feedback and quick at that to greatly improve their proposal for the next funding rounds.  ", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "We agree that a funding strategy is needed for long term success! That is indeed a gap in our plans at the moment, but you gotta start somewhere!\n\nThe Github repo has more content, so you can look back at it now. \n\nThank you for encouraging us to consider our risks more carefully - we will are writing a risk assessment document and add it to our github.  \n\nWe are also adding a more detailed roadmap on github as well. Please see. \n\nThanks again for feedback. "}, {"q0": "This project identifies a very unique problem and the solution will definitely impact  the cardano developers ecosystem. I like the fact that the proposal focuses on the developers ecosystem and this is a very good way of onboarding new developers in such a way that they can learn and  earn at the same time. Incentives the Plutus pioneer  program using this method will definitely increase the completion rate . The impact to the developers community if implemented   is clearly seen and for that I score 5", "q0r": 5, "q1": "There is a definition of success for 3,6 and 2 month , what is lacking is the skill  required to implement this platform and the public profile of the team members . There are no launch dates. The proposer did not consider  risks and challenges that would have enhanced feasibility  of this project. there is a budget breakdown with the budget item and allocated amount but there is no actionable step on how to implement the Project. With the experience of the Proposer , I would have expected that preliminary work on the platform development has been done , but none is provided . I have checked the provided github, there is a repository that contains a little content about the potential course and amount to earn but nothing to show commitment like the actual platform development .\nI would suggest the proposer should assemble an experienced team to develop this Project.\n", "q1r": 3, "q2": "The information provided is not enough for auditability; there is no clear KPI and metrics  in the projects . There is  a budget breakdown but there is no budget item for the platform Development.\nThere is a milestone but it is for feasibility.\nI would suggest the proposer should review the funded proposer and add more content to increase auditability .\n", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 22, "ne": 5, "ng": 17, "nfo": 0, "vca_o": 1}], "solution": "Cardano L-EARN est une plateforme \"Learn to Earn\" (apprendre pour gagner) qui permet aux développeurs d'acquérir des connaissances et des compétences sur Cardano, et de gagner des ADA pour la preuve de leur apprentissage.", "experience": "Exécution de programmes d'apprentissage. Anglais et espagnol. github.com/blockdevsunited/l-earn\n7 ans d'organisation et d'enseignement des communautés cryptographiques."}