{"id": 384458, "author": "larde.victor", "title": "Open source scalable OST ecosystem", "url": "https://cardano.ideascale.com/a/dtd/384458-48088", "category": 26251, "amount": 90000, "description": "La diffusion du contributionnisme et le succès du plan OST vont créer une énorme demande d'outils personnalisés de la ville, appartenant à la communauté.", "funded": 0, "upvotes": 17494329, "downvotes": 27951003, "votes_result": 10456674, "votes_cast": 127, "f6_no_assessments": 3, "f6_rating": 2.5555555555555554, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=15965"], "media": [], "f6_assessments": [{"q0": "The proposers plan on initializing One Small Town. The basic idea is to make the people of one small town not depend on anyone but themselves and grow businesses while contributing 3 hours a week for another initiative. The idea behind is to have the OST(one small town) become independant, while continuing to invite investors and export goods that the town doesn't need for it's own living. The proposal identifies there's a problem with economic growth at smaller towns that could be aliviated by letting people take charge of their own production needs. The place where the cardano system comes into play is to have an ICO that would fund the start of this endevour. There are key metrics listed in the proposal describing the wanted results with which to follow the success of the project. Not sure about scaling this solution at least in the form it is in right now requiring funding. I hope the proposers will have a better plan for scaling OST for many indivirual towns and not requiring and ICO for each one, because that could get quite expensive. The proposal is lacking an explanation on how exactly will the economics work. There are vague mentions of businesses that will provide everything the town needs and export the excess which is all good, but doesn't mention anything about import. And about 90% ot items in store are exported from somewhere, so I'd like to see this item elaborated on in future prsals.  As a developer I have an interest in such a solution, because it's always a fun task to think about how to solve a problem of any kind. The impact of this project IMO is directly corelated with finding the right town to start off the experiment. The proposers state they have already found applicatnt towns, so I'll be following this project to check on it's progress. ", "q0r": 5, "q1": "There are links and linked in profiles that verify that the proposers have all the skills and experience needed to implement the proposed solution to the problem. There's a clear understanding what team and people need to be involved so the proposel reaches a successfull state. The budget is clear and outlined, broken down into items that would provide the necessary funding for the different phases of the project as the need arises. Concerning the proposal and the timetable set 12 months 200000 members, which means between 4 and 40 towns participating in a year, which is very very ambitious. The proposal speaks about the domino effect that will happen when the first town joins, and they may be right, but first to have a domino effect you need at least two towns not one, and these two towns need at least a year to have the ideology explained in the OST videos up and running before any investors and towns join in. So the time table seems a bit shortened at a first glance. The proposal provides a plan for implementation, although I'm not sure if it's sensible or not. I sense some kind of distaste comming from the proposers when it comes to the work corporation and capitalism, but the word corporation comes from the latin \"corpus\" which means \"body\" or corporation means, many people doing things \"as a body\" as a whole and from what I've read in the proposal they are trying to do exactly that. As for the word capitalism, they're not too far off it, whithout realizing it. Capitalism: \"A way of organizing an economy so that the things that are used to make and transport products (such as land, oil, factories, ships, etc.) are owned by individual people and companies rather than by the government.\" if the proposal describes this exact setting. I understand there are some differences, but they are not that far apart to be so negative about the term. There are several resources listed that would acomodate the OST infrastructure like: smartcards, ubuntu blockchain and OST token wallet which is a good sign of a vigurous thought process. There's a clear explanation of the architecture and plan for what is the end goal, but are a bit lacking on the \"how\" part of things. I saw no explanation of how will the project start up only what will happen when the project is already in motion and all people or a large enough group so that the proposal would work, are perfectly aligned with the plan. Getting people on the same page is hard and it takes time, meanwhile who is going to fund the process on the way there?   ", "q1r": 3, "q2": "For anyone interested in followin the progress of this project as I plan on doing there's a website linked in the proposal, which you can follow for more information. There are extensive KPIs so only time will tell if they're going to be relevant or not. There's a roadmap although a bit general and an ambitious time horizon for the success of the project although I'm still unsure what the definition of success is.   I'd suggest the authors put themselves in the shoes of the voter and see if they would invest in their own venture in the first year of it's development and not when it's already up and running. I am an active investor, and I see no point in investing in something so dependant on willingnes of people to cooperate on such an integral level. Best of luck to you, I admire how brave you are and recognize you're trying to build a better world in your view! ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 8, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "I searched the proposal and the whitepaper for this project for some connection to the challenge brief -contribution to the opensource ecosystem- but I didn't find anything except a brief mention that this proposed ICO \"will be open source and scalable at will\".  The problem stated does not seem relevant to Cardano or Catalyst, or the opensource ecosystem as such, and in combination with the solution -the marketing of an ICO- seems to be a self-referential problem.  When one also considers that the whitepaper for this project mentions the use of Cardano only as a temporary measure prior to the establishment of their own blockchain, it is hard to imagine just what impact to Cardano is expected from this project.  The lack of any included KPIs, nor indeed any means of tying them into the purpose of the challenge, or even the Catalyst ecosystem, weighs heavily against any possible ability of this proposal to return value to Cardano.", "q0r": 1, "q1": "The proposal requests a $90k budget to effectively market an internal ICO, with the intent to eventually roll out the ICO world wide.  Ignoring the lack of impact on Cardano at large, especially through the initial startup portion of this proposal (creation and marketing of the ICO, for which this budget is proposed) the budget itself lacks any granularity or identifiable items, with fully 2/3 of the ask ($60k) budgeted to a single line item marked as \"ads and influencers\".  The team itself doesn't appear to have any particular specializations in marketing or development though they do indicate that they will bring in a development team for that part, and that they have possibilities lined up.  However there are no included repositories to assess the scope or qualifications of those possibilities.  The included roadmap resolves to broad 3-month descriptions and lacks concrete milestones or actionable items.  The proposal could be improved significantly, from a feasibility standpoint, by the inclusion of a much more detailed roadmap, better description of what exactly was to be produced or delivered, and the requirements and qualifications of the needed development team.", "q1r": 1, "q2": "Being as the majority of the proposal is boilerplate for the underlying philosophy of \"Contributionism\" and its particular use case of OneSmallTown(OST), there is not a lot of clarity regarding what exactly the proposal is setting out to accomplish with the funds it is asking for.  The budget does make clear that what would need to be audited would be the creation of a website, and then a marketing campaign for an ICO.  Auditing the creation of a website should be easy enough, but this proposal would be improved if it included particular measurements and KPIs to assess the effectiveness of this website in impacting Cardano or Catalyst, perhaps by tracking the number of adoptees?  It is unclear if this is their goal, though.  But it should be mentioned that there appears to be no means to effectively audit the majority of the budget, a large marketing campaign, since what is to be marketed  is also not clear.  The proposers should clarify whether they intend to expand the reach of the ICO, their OST campaign, or something else.  They do appear to maintain an accessible presence within their own OST ecosystem, so perhaps a plan could be included for how to integrate the communities to provide accountability.", "q2r": 1, "assessor": "z_assessor_811", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This is a well-organized and structured plan but that departs from the main objective of the campaign. There is little synergy between the OST ecosystem and the Cardano ecosystem. To me it seems that the OST is a separate project trying to take advantage of the opportunity of funding. It has great intentions, but its goal is to make small communities thrive and not exactly build tools common to Dapp projects of the Cardano environment. At least it was not highlighted in the proposal. Besides that, there is no mention of open-source git repositories or open source docker containers that will be used.", "q0r": 2, "q1": "There is a link to the Ubuntu page, but the relevant experience section is very superficial.  They did add the LinkedIn profile links at the end but two of the three don't seem to have strong backgrounds in blockchain or DeFi. Even Victor who was supposed to have a deeper knowledge in the topic doesn't seem to have achieved any meaningful milestone yet. The team members required are discussed and used to estimate the budget which is slightly overpriced. In my opinion there is too much budget allocated to marketing. Regarding the timetable there seems to be a gap in Q3 2022. Moreover, the stages described are too generic, \"development of the ecosystem\" is too broad not to be broken down into more sizeable chunks of steps.", "q1r": 2, "q2": "There is a roadmap with clear milestones traced, but again I believe they could be further divided into more granular steps or at least described more thoroughly. The time horizon and KPIs are reasonable and objective. However, these KPIs are not measuring metrics that are adherent to the proposal.", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 22, "ne": 3, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Construit sur Cardano, l'écosystème One Small Town sera open source et extensible à volonté par toutes les nouvelles villes signées dans le monde.", "experience": "Chercheur - Scientifique - Auteur - Militant - Humanitaire. Planificateur financier senior. Coach en blockchain et crypto-monnaies. Planificateur d'entreprise."}