{"id": 384854, "author": "reshm", "title": "NFT Based Authentication", "url": "https://cardano.ideascale.com/a/dtd/384854-48088", "category": 26251, "amount": 12500, "description": "Le potentiel des NFT en tant que moyen d'authentification similaire au cadre OAuth 2.0 n'est toujours pas utilisé.", "funded": 2, "upvotes": 105365590, "downvotes": 7749918, "votes_result": 97615672, "votes_cast": 457, "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"q0": "Les auteurs de la proposition veulent utiliser les propriétés des NFT pour permettre un protocole standard d'autorisation sur la blockchain. Un problème important (la sécurité) est identifié par les proposants et ils prévoient de le résoudre en utilisant les briques posées dans l'écosystème. En tant que développeur, j'adore cela. Il est clairement indiqué comment cela bénéficiera à l'écosystème Cardano et à ses utilisateurs en particulier. Les mesures sont claires (c'est l'un des rares projets à en avoir) et en phase avec les paramètres du défi. La proposition sera en mesure de s'adapter aux futurs défis, sur la base de leur vaste expérience.  La sécurité est plus que jamais nécessaire, et le fait que les auteurs aient trouvé un moyen d'implémenter quelque chose qui a déjà été testé par OAuth.2.0 témoigne de leur niveau de compétence et d'imagination. Je n'ai aucune inquiétude concernant la proposition, je recommande de voter pour elle avec toutes les voix dont vous disposez.", "q0r": 5, "q1": "J'ai réussi à vérifier toutes les références listées dans linked in et quelques autres endroits, donc les proposants sont légitimes et ont le savoir-faire disponible pour mener à bien le projet. Il y a des membres de l'équipe qui ont collaboré ensemble et qui ont déjà été financés par le tour précédent. Le budget est simple et ventilé de manière raisonnable. Il y a un plan vérifiable facile à comprendre et à suivre en tant que partie intéressée. Un calendrier réaliste pour toutes les tâches à accomplir et à travailler, accompagné d'une explication pour chacune d'entre elles, constitue une bonne proposition. Le plan de mise en œuvre n'est pas trop technique pour que tout le monde puisse le comprendre, mais il n'est pas trop simple pour montrer sa valeur. Les ressources qui seraient nécessaires à la mise en œuvre sont pour la plupart des spécifications et elles sont énumérées dans la proposition. Les aspects techniques sont bien définis puisque les proposants vont mettre en œuvre une norme d'authentification déjà existante, plus ou moins. Il y aura des défis, mais les proposants les ont mentionnés dans la proposition et y ont déjà réfléchi. Le projet est en phase avec ce qui a déjà été fait et il est prêt à être développé par-dessus. J'adore la proposition, bonne chance à vous et rendez-vous au vote !", "q1r": 5, "q2": "Les auteurs accueilleront toute personne intéressée par leur projet sur un canal discord et sur un dépôt github open source. Cela permettra à tous les membres de la communauté intéressés de suivre l'évolution du projet dans sa phase de construction. Les mesures et les indicateurs clés de performance sont non seulement présents, mais aussi pertinents, ce qui est malheureusement plus que ce que je peux dire pour de nombreuses autres propositions. La feuille de route et les jalons sont assez simples. Le calendrier est également assez définitif. Le problème et la solution sont clairement définis.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the need for open source repo to demonstrate how NFTs can be used as authentication. This will ad value to the Cardano ecosystem by bringing lots of new transactions and use cases to the blockchain. The metrics of this project is aligned with the challenge in the sense of projects making use of the  repository. This project is able to scale well as it is open source and available for all to use.", "q0r": 5, "q1": "The relevant skills and team is provided with links and backgrounds. They are well known and active members in the community. The budget is reasonable and broken down into identifiable items. It will take 3 month to complete the repo, which is achievable. They explain in detail the process of using the NFT as authentication from start to finish. They provided a diagram to visualize the process. Some technical details are also provided, and this idea has already been proven to work and won a Capstones Challenge award. The only risk they touch on is the changes Plutus will still go through and they mitigate this by keeping the repository up to date.", "q1r": 5, "q2": "They provided a roadmap with milestones and KPIs making it easy to measure the progress and performance of this project. They identify the problem of an open source repo needed to bootstrap NFT authentication methods. They solve this by creating the repo and community to contribute to this repo and maintaining the repo as Plutus evolves.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 25, "ne": 2, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "very interesting idea and proposal. Being myself a developer and used IdentityServer based openid connect and oauth2.0 authentications/authorisations, i can vouch for this idea 100%.\r\n\r\nThe idea fits in perfectly and might be ground breaking use case for NFTs. Almost everywhere we see right now google/FB etc based oauth mechanisms in place. These companies just provide their implementation of these standards and perhaps control also all the data in many ways.\r\n\r\nAn open source solution like this could open up a new paradigm to web3 or even at web2 and people can finally start seeing diverse use case for NFTs.\r\n\r\nFull points from my side.", "q0r": 5, "q1": "From experience perspective i fully trust the team, the team has really good experience with Cardano eco system and also have contributed to developer eco system quite extensively.\r\n\r\nThe team details are public and as can be seen have good professional work experience in software engineering. Moreover,\r\nThe team members already has good knowledge on plutus programming (3rd position in cardano hackathon) and are not alien to it.\r\n\r\nThe plan presented has been split well, understandably two. months for Repo/documentation and Plutus SC and PAB implementation, as they will do the most heavy lifting for this implementation.\r\n\r\nAlso the budget outlined is well explained. Developers count and fund requested per developer is well under budget.\r\n\r\nOverall all the criterion are met, hence full stars from my side.\r\n", "q1r": 5, "q2": "I strongly agree that the information provided is sufficient to audit the progress and the success of the proposal.\r\n\r\nThe deliverables are quite clear and since this is a pure implementation oriented proposal, and as a senior developer myself i totally agree that the roadmap is perfectly well outlined. \r\n\r\nThe success metrics are provided for 3-6-12 months and KPIs are well written, so for auditing the success community can always keep the long term vision in mind.\r\n\r\nTherefore, in my opinion community should not have any issue in auditing the progress and success of this proposal.\r\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1, "reply": "Accesss to cloud credits is a common benefit of accelerators and incubators, yet none of the other proposals have this as a talking point. Therefore I disagree with the assessor who states that this proposal does not fit into the challenge."}, {"q0": "This proposal outs forth the idea of creating open sourced software that would help developers in all areas. It is aiming to create a foundational tool for developers.", "q0r": 5, "q1": "The plan could have more detail as well as more of a budget breakdown, but from the info provided it seems they have all the relevant experience to follow through with this proposal.", "q1r": 4, "q2": "Thiis proposal would be improved if it was able to provide more details with the roadmap, milestones, KPIs, and budget. It does provide the required info, but the audit would be limited in scope with the little information provided. More details would give themselves wiggle room when determining the success as well.", "q2r": 3, "assessor": "z_assessor_612", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "This project is about to make a lookalike OAuth 2.0 authentication in the blockchain network. For future development, this is one of the must-have functions and it will make a strong impact on every network. \r\nThe proposers also provide KPIs that are aligned with this challenge and can help everyone measure the success clearly. ", "q0r": 5, "q1": "The team info is shown in the proposal is outstanding talents that I believe they can make this project work well. This is not a too complex project, and the proposer also provides things that the project will deliver in detail. It's appreciated that all of the content is easy to get. \r\nAbout the budget, the proposer's required budget is sufficient and so much optimized for all tasks. ", "q1r": 5, "q2": "The proposer provides a very detailed roadmap and their KPIs completely help to audit the development progress easily. \r\nThe proposer also helps us acknowledge the problem standing and make a real case about how their solution act. \r\nThe last thing I want the proposer to consider is the risk and obstacles in the development plan, for this type of project, most are about the timing and bug... Detecting those can help them avoid disruption. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 20, "ne": 2, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "Développer et maintenir un référentiel open source démontrant comment les NFTs peuvent être utilisés pour réaliser une authentification de type OAuth 2.0.", "experience": "Ingénieurs en logiciel senior, pionniers de Plutus, vétérans de Gimbalabs PPBL, gagnants du hackathon CardStarter et du défi Capstone de Plutus Pioneers."}