{"id": 385098, "author": "rcmorano", "title": "NFT-authorized NFT-minter contract", "url": "https://cardano.ideascale.com/a/dtd/385098-48088", "category": 26251, "amount": 7000, "description": "Il n'existe actuellement aucun moyen d'effectuer une frappe de jetons décentralisée, autorisée et à la demande à partir d'un smartcontract.", "funded": 1, "upvotes": 34256077, "downvotes": 19428368, "votes_result": 14827709, "votes_cast": 138, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "\r\nLa proposition mentionne qu'ils ont rencontré un problème/question au cours du développement de Dandelion (qui est un projet soutenu par la communauté et dirigé par GimbaLabs).\r\n\r\nCe problème, à mon avis, sera rencontré encore et encore par de nombreux projets qui se basent sur Cardano, et en général, en tant que développeur senior, trouver des solutions génériques et réutilisables est la clé à long terme.\r\n\r\nLe système de source ouverte est fondamentalement que si quelqu'un a déjà rencontré un problème et a fourni une solution à cela, il suffit d'intégrer la solution au lieu de réinventer la roue.\r\n\r\nLa solution fournie est clairement décentralisée et répond à l'énoncé du problème en ayant un contrat intelligent qui permettra à N gouverneurs (qui détiennent un NFT particulier) de frapper un jeton.\r\n\r\nSuperbe idée, qui correspond parfaitement aux paramètres du défi proposé.", "q0r": 5, "q1": "L'auteur de la proposition est un ancien membre d'Emurgo et le cofondateur de Gimbalabs. Par conséquent, du point de vue de l'expérience sur les contrats intelligents/techniques de l'éco-système Cardano, je ne vois aucun problème.\r\n\r\nDe plus, le proposant propose d'embaucher un membre de l'équipe PBL pour développer ce projet, et puisque le proposant est lui-même le fondateur de Gimbalabs et qu'il a également donné des liens vers des travaux similaires déjà réalisés par des membres de l'équipe PBL, je suis pleinement confiant du point de vue de l'expérience.\r\n\r\nLe plan présenté ici est assez simple, donc je ne vois pas de raison de le diviser davantage. Le budget est bien justifié, pour deux mois.\r\n\r\nNéanmoins, il aurait été bon d'inclure également les risques associés à ce projet (exemple : développeur non trouvé ou ne pouvant pas le faire, etc.), ainsi que la façon dont le succès sera perçu ?\r\n\r\nJe pense qu'un exemple pourrait être qu'ils vont l'utiliser dans certains des projets existants des initiatives de GimbaLabs ? Puisque le proposant a beaucoup d'expérience dans ce domaine, il aurait pu ajouter ces détails. Je pense donc qu'il y a place à l'amélioration ici.", "q1r": 4, "q2": "Les informations sur la mise en œuvre sont en elles-mêmes suffisantes pour vérifier l'état d'avancement de cette proposition.\r\n\r\nCependant, je pense que le succès de la mise en œuvre de cette proposition ne peut être découvert qu'une fois que ce contrat intelligent est déployé et est utilisé par certaines des applications. Par exemple, combien d'applications utiliseront cette solution dans 6 mois ?\r\n\r\n Je pense qu'en général, étant donné l'expérience du proposant, il ne serait pas difficile de fournir de tels exemples à la communauté. Sinon, cela pourrait finir par être une solution technique géniale que personne n'utilise en réalité :)\r\n\r\nBonne chance pour la mise en œuvre à l'auteur de la proposition :)", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The team is already providing and maintaining open libraries as well as hosted services. This new library does not only further the existing dandelion initiative, it also create what would no doubt become an essential staple for this key functionality crucial a host of decentralized structures including but not limited to DAOs.", "q0r": 5, "q1": "While the dandelion no doubt have the chops to accomplish this, the proposal did not make clear their intention to maintain the library across any time horizon. In my opinion \"success\" of an open source library hinges it's documentation, maintainer(s) and fine folks committed to providing support and addressing bugs. It's clear that they will build thing but with the lack of maintenance and support plan, I can only give 4 stars here. Even something the tune of we hope the community will adopt and help maintain the library going forward  with commitment to setup contribution guidelines would have suffice!", "q1r": 4, "q2": "The KPI and Roadmap is sweet, short, to the point, and sufficient to verify their 1 and 2 months stated deliverable. ", "q2r": 5, "assessor": "z_assessor_336", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The idea is to write a template for a smart-contract that will mint tokens only if an NFT (representin authentication) is included in the smart contract. That would make it decentralized, secure and on-demand. I am no expert in the area so I don't know if this problem needs to be solved or not so I defer to the expertise of the proposer. There could have been a more clear articulation of why is this important and how will it benefit the cardano ecosystem. I feel like the author should have explained in more detail the idea behind doing this so he can get people behind the idea before starting explanation on the technical part. The key metrics are relevant for the challenge. Nothing was mentioned about scaling and considering the words decentralization and minting were mentioned, I think it would be a good idea to include a \"how will we scale?\" section in the proposal.  This proposal would add to the ecosystem, but I'm no sure how valuable would that something be, because no impact was mentioned or how will this affect the cardano community. As a developer myself my concern is that voters would struggle to see the point in this proposal as I am. ", "q0r": 3, "q1": "The proposal has added a skill set that is verifiable and is clearly well experienced. A mention of one team member is mention, but I don't mention if they already talked to them and they agreed to work on the project or that's to be seen. The budget is prety clear: a salary for 2 months for a Plutus Engineer. The proposal could have put a bit more effort in a roadmap breakdown and tasks that can be followed by the community. The plan for implementation is sensible, it's just a bit vague on the specifics.  The technical aspects is one of the pros of the proposal, because they're well explained and connected together. No challenges and risks were mentioned so I hope the work is straightforward.", "q1r": 4, "q2": "There's a linked site where the plutus developers have put a short comprehensive description of their work relating to smart contracts that they've done, so tracability of the progress is there for any interested community members. There is a mention of KPIs although a bit rough and hard to progres check. There's a bids eye view of a roadmap about the 2 months of work planned out. The targeted problem and solution could be better explained and written and that would be my main suggestion for the author for the next proposal.  I'd also suggest for the author to put themselves in the voters shoes or ask someone unrelated to the project check out the proposal and gather feedback to help improval.", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I like this proposal and what it aims to do, which will undoubtedly help to grow our open source ecosystem and enable many different teams to use an out of box solution for managing on-demand NFT minting on cardano. The could have a very wide range list of use cases and I think would be a great addition to the toolbox of cardano developers and teams alike.", "q0r": 5, "q1": "The proposer is a co-founder of the team behind the Gimbalands company which is a very reputable company within the cardano ecosystem and have many successful proposals funded in the past, this lends credibility to the idea that proposal would be successful. I would be personally shocked if the team did not deliver, I feel very confident that they will based on the proposal as presented.", "q1r": 5, "q2": "I feel the roadmap is very vauge and lacks specifics. A roadmap should include well defined milestones with specific KPIs for each milestone, otherwise it becomes a grey area when it comes time to audit the proposal we should be able to clearly see which KPIs was hit and which wasn't. I still feel the milestones at a high-level make sense, but we need a little more specifics in order for 5 stars.", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Développer un contrat intelligent qui, en utilisant des métadonnées spécifiques en entrée, frappe des jetons à la demande uniquement si un NFT de gouvernance a été inclus dans la tx.", "experience": "Défenseur de DevOps avec plus de 15 ans d'expérience. Ex-Emurgo DevOps Lead. Cofondateur de Gimbalabs. Fondateur et opérateur de Dandelion."}