{"id": 385056, "author": "titan", "title": "Transaction Editor & wallet", "url": "https://cardano.ideascale.com/a/dtd/385056-48088", "category": 26251, "amount": 16400, "description": "Le CLI de cardano est trop lourd à utiliser pour les transactions importantes et complexes.", "funded": 2, "upvotes": 142629562, "downvotes": 9374330, "votes_result": 133255232, "votes_cast": 664, "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Wow ... juste waw ! L'auteur de la proposition veut introduire un éditeur de transactions plus utilisable pour remplacer le CLI (command line interface) de Cardano. En tant que développeur moi-même, je peux m'identifier au problème décrit dans la proposition et vérifier qu'elle répond au défi posé. Il est clairement exprimé comment cela apportera de la valeur et suscitera la joie chez les développeurs de l'écosystème cardano, moi y compris ! Les mesures clés sont pertinentes et il est clair que le proposant a beaucoup réfléchi à la proposition elle-même et à l'outil. Il y aura certainement des défis à relever, mais je ne doute pas, compte tenu de l'expérience de l'auteur et de sa gestion du temps, que les défis seront relevés sans problème ! Il n'y a absolument rien qui manque dans cette proposition, ce qui est rare. Ce projet ajoutera quelque chose qui manque dans l'écosystème : un moyen facile de travailler avec des transactions sans avoir à souffrir. Il n'y a aucune inquiétude de ma part. Ce projet aura un impact important sur la communauté s'il est financé et j'encourage les gens à voter pour ce projet car je le ferai !", "q0r": 5, "q1": "Il y a tellement de références et de compétences énumérées qu'il m'a fallu un certain temps pour les lire et les vérifier. Le type est un docteur en physique théorique qui développe des simulations pour des systèmes d'électrons corrélés (mike drop). Il y a un plan d'exécution clair et il connaît le travail qui doit être fait, le temps et le processus pour le faire. Le budget est clair et suffisamment bien ventilé pour permettre d'atteindre les objectifs fixés, qui sont nombreux et ambitieux. Il y a un calendrier réaliste pour compléter le travail, mais je me demande si une équipe ne serait pas plus bénéfique, mais je peux certainement respecter l'homme qui veut construire un outil dans le mannar approprié et avoir des membres de l'équipe n'est pas toujours la voie à suivre (au moins au début). Une explication détaillée est fournie non seulement sur le \"quoi\" mais aussi sur le \"comment\", ce qui est rare et doit être apprécié. Les ressources nécessaires au développement du projet sont claires. Les aspects techniques tels que l'éditeur choisi et les fonctionnalités déjà présentes et prévues pour l'avenir sont tous décrits et significatifs en tant que jalons. L'auteur du projet a pris en compte les défis et les risques liés à une mise en œuvre réussie et, de surcroît, il a analysé l'impact de ces décisions. Le projet est en phase avec ce qui a déjà été fait, et ce sera un élément constitutif de l'avenir, je crois. Un travail de proposition absolument exceptionnel ! Bonne chance ! J'espère que vous serez financé ! Je voterai pour vous !", "q1r": 5, "q2": "Pour ce qui est de la traçabilité, l'auteur a déjà établi un calendrier et un plan très précis sur la manière d'inclure des bêta-testeurs de la communauté pour l'aider dans le cycle de travail, ainsi que des plans pour la documentation et la communication à la communauté des fonctionnalités disponibles. Je ne vois aucun problème à faire savoir aux gens ce qui est fait et développé. Les mesures et les indicateurs clés de performance sont également à la hauteur du reste de la proposition, ce qui est rarement le cas dans de nombreuses autres propositions. Une feuille de route avec des jalons et tous les détails sont là, ainsi qu'un calendrier qui tient compte des défis et prévoit une marge de sécurité. Un problème clair et compréhensible et des solutions correspondantes sont présents et bien écrits, bien qu'un peu techniques parfois. La solution est à 100% une solution pour les luttes de l'ingénieur logiciel ordinaire de tous les jours.  Bonne chance !", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Currently the tools available for developing an app on Cardano (on low level) is still far from perfect. Using cardano-cli would still make developer struggle and have trouble, as what the proposer mentioned that there are a lot of people asking and looking for answers on Discord and Cardano forum. This proposal would build a tool to make it easier to use cardano-cli in a declarative way, means you declare what you want and the tool will handle the command for you. E.g for creating wallet, looking UTxOs addresses, balance, etc. By having this tool, it will greatly help the developer community building on Cardano, and further attract more developer to not get intimidated into getting started.", "q0r": 5, "q1": "Oscar (the proposer) have proven the experience in building these various tool, from the growing open-source Scientific Python Project until it became the open standard, to having a Ph.D. in Theoretical Physics developing simulations for correlated electrons systems. Looking at the Github repo, it has a comprehensive documentation, with already working feature such as: token mints, metadata, delegation certificates, unlocking of Plutus Smart contracts. Although, it would be better if Oscar could provide his Linkedin too for further verification. Reading through this proposal, Oscar could articulate clearly on what the problem, how he came up with the solution, and how to implement that solution with working example already provided. The 10-week action plan he provide is clearly described in details, and shows what to achieve on every week. Overall, this proposal have a high chance of success, considering the amount of experience he had. ", "q1r": 5, "q2": "The roadmap, the goals / achievements, and metrics/KPIs is very well defined in details (10-week plan). It is highly auditable considering this is an open project and we can track the progress through Github commit. The proposer have a clear understandable description of the targeted problem, and also able to articulate the solution in details, i.e using Emacs and specify why he choose it, why it would help developer community in Cardano, etc. ", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 21, "ne": 10, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The team pointed out the dead point of user experience and made a great way to fix it. This idea will save a lot of time and advance the risk when performing transactions in the node. In addition, the team also has detailed content to explain how it impacts and the target. \r\nMoreover, the KPIs are promising for people in Cardano communities. ", "q0r": 5, "q1": "The team has experienced how to perform their plan well, moreover, they did it since fund 6 and there is a video to visualize how this idea happen. The team also provides full of content to explain what they gonna do from point of view of users, and also with the technical explanation. Everything is clear and easy to understand. Moreover, there are many attached links in the proposal that can show how great this team did for the Cardano ecosystem. ", "q1r": 5, "q2": "They have a detailed roadmap in weeks and good KPIs for easily auditing their progress. \r\nThey also have a good explanation about the problem, and that's why their solution can address the problem very well.", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 2, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "A high level, declarative, transaction editor that fully integrates with your wallet, cardano-node and your text editor will be a helpful tool since it solve the problem of the cardano CLI. ", "q0r": 5, "q1": "He's a skillful developer with relevant experience and he explain very well what he plan to do. All information is very transparent: the time he will spend on the project, a detail timeline and KPI etc. Moreover he also demonstrates what the expect outcome will be with examples. ", "q1r": 5, "q2": "The metrics to audit the progress is well-thought. We can easily track the progress of the project because he's very transparent and the timeline is in detail plan.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Un éditeur de transactions de haut niveau, déclaratif, qui s'intègre totalement à votre portefeuille, à cardano-node et à votre éditeur de texte.", "experience": "Prototype fonctionnel pour les transactions, avec des monnaies à jetons et le déverrouillage de scripts Plutus. Lauréat du concours Plutus Pioneer Capstone."}