{"id": 383199, "author": "mininiva", "title": "NFTSwap ~ making NFTs fungible", "url": "https://cardano.ideascale.com/a/dtd/383199-48088", "category": 26243, "amount": 200000, "description": "誰もがNFTを、暗号で購入する資産クラスと考えています。私たちは、NFTをポケモンカードのような取引可能な資産と考えています。", "funded": 0, "upvotes": 17021147, "downvotes": 27872387, "votes_result": 10851240, "votes_cast": 151, "f6_no_assessments": 3, "f6_rating": 1.0, "videos": [], "media": [], "f6_assessments": [{"q0": "I can appreciate someone who thinks outside the box. I am not sure how an NFT (Non-fungible token) can become fungible. Wouldn't it just be a Fungible token then? Haha. I can almost grasp the thought behind making something into something else. Using a word other than \"fungible\" might be less confusing, albeit less rogue.\r\n\r\n*This proposal fails to meet the intention of the challenge \"to sow new teams, [Individual proposer] who have never received funding from Catalyst so they can have a chance to show their value to the community.\r\n*Each new team can request up to 25% of the total $200,000 USD budget, ($50,000 USD) \r\n\r\nBecoming familiar with and understanding the challenge brief will correct this oversight in future iterations.\r\n\r\n*A Proposal for $200000/$200000 does not qualify for this challenge. (100% of total)\r\n*To be considered as a legitimate proposal, the proposer must articulated how it will add value to the Cardano ecosystem. The passion behind the statement, \"I am bullish on Cardano ever since I first heard of you guys. This project should be built on Cardano\" needs to go beyond the initial attraction to Cardano. Without articulating the feeling, people are naturally drawn to a safe and lively environment in which to explore the highest potential of human collaboration.  \r\n*The key metrics and goals of the proposal are non-existent.\r\n*There is no identifiable plan to scale.\r\nI notice by your profile Edoardo, that you are very new to Ideascale. No doubt this could be for a number of reasons. This proposal indicates a need for connection to the community for guidance in creating a viable proposal in the future. Wednesday Project Catalyst townhalls are a good place to start. From there you can join breakout rooms and connect with topics that interest you and help guide you through the Project Catalyst experiment. The Catalyst School offers several workshops around creating proposals. \r\n\r\n(1) I strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "When an idea needing to be developed does not succeed on the first go around, it will be the passion and the commitment to this idea that will become the driving force to get back up and do what it takes to make it happen.\r\n*The proposer does not provide evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal: In future iterations it would be expedient to include links & references to validate \"I am head of Growth and Special projects for nate.tech.  I have built startups at Entrepreneur First, Founders Factory  and Public.io.\" For $200K I would expect much more.\r\n*The budget is extraordinary, requesting $200000 out of the F7: Seeding Cardano's Grassroots DeFi challenge budget of $200000 and fails the criteria: \"Each new team can request up to 25% of the total $200,000.\"\r\n*The proposer has not identified the type and number of team members required to implement the proposal. Finding others to co-create a future project will be key for this proposers success. \r\nThere are just too many gapping holes in this proposal to warrant further assessment. Be sure to tap in to the collective wisdom of the community to help you find the missing pieces.\r\n\r\n(1) I strongly disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 1, "q2": "For one reason or another, you have been drawn to the Cardano blockchain community. Time will tell what becomes of this first attempt at a proposal. Well done for trying and Welcome to the experiment! \r\n*This proposal does not have a roadmap. Clarifying and stating milestones and a time horizon for achievement is needed to improve this proposal.\r\n*The metrics/KPIs for the success of the proposal are missing.\r\n*This proposal does not have a clear understandable description of the targeted problem. \"Everyone sees NFTs as an asset class to be bought with crypto.\"\r\n*This proposal does not have a clear, well thought out, understandable solution to address the problem as indicated. \"Provide a platform where users can trade their NFTs with other users' NFTs.\"\r\n\r\nLearning how to be a community advisor is not only helpful in learning what the components of a high quality proposal are, it will give you the opportunity to see first hand what other community members are doing. You will also find others to collaborate with. There is a reason this challenge is for teams. Teams take an idea to a whole new playing field.\r\n\r\n(1) I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. I look forward to seeing the growth in understanding & development in future proposals.", "q2r": 1, "assessor": "z_assessor_500", "no_vca": 20, "ne": 10, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "\"I still don't see what the team's solution in this proposal is. The team wants to provide a platform where users can trade their NFTs with other users' NFTs just like trading Pokemon cards. What benefits will this solution bring?\r\nWhen I access the 2 documents that proser provided. 1 document does not exist. 1 document is just an introductory power point about the correlation of NFT with Pokemon Cards.\"", "q0r": 1, "q1": "\"Proposer is head of Growth and Special projects for nate.tech.\r\nHe/she has built startups at Entrepreneur First, Founders Factory and Public.io\r\nBut there is no proof for those claims.\r\nIn addition, the proposal does not have a roadmap, specific plan, or product explanation\"", "q1r": 1, "q2": "\"Unfortunately there is nothing to assess at this proposal as the info provided are insufficient.\r\nNo metrics/KPIs are set to define the success of the proposal.\r\nThe problem and the solution to solve the problem are not presented in a clear and understandable manner.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 21, "ne": 0, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "This is not a matter of investment. it doesn't state the problem nor favor cardano.", "q0r": 1, "q1": "This is a project with no high feasibility, not enough authentication factors, maybe just a trap. The project's plan is unprofessional, sketchy, not dedicated to the project, no budget table, Where does the $200,000 figure come from? Although there is an experience, there is no concrete evidence.", "q1r": 1, "q2": "There is no evidence of what this proposal says.", "q2r": 1, "assessor": "z_assessor_756", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}], "solution": "ユーザーが自分のNFTを他のユーザーのNFTと交換できるプラットフォームを提供する。\nレコメンドエンジンとマッチングの仕組みを提供する", "experience": "nate.techの成長と特別プロジェクトの責任者です。\nEntrepreneur First、Founders Factory、Public.ioでスタートアップを立ち上げました。"}