{"id": 381122, "author": "cryptoloops", "title": "Flooftopia: An Adorable CNFT Game!", "url": "https://cardano.ideascale.com/a/dtd/381122-48088", "category": 26241, "amount": 55000, "description": "Les NFT et les jeux NFT actuels se concentrent sur des structures NFT rigides et ne s'adressent pas à de larges groupes démographiques.", "funded": 1, "upvotes": 71090502, "downvotes": 6690088, "votes_result": 64400414, "votes_cast": 309, "f6_no_assessments": 9, "f6_rating": 4.518518518518518, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=1035"], "media": [], "f6_assessments": [{"q0": "Je suis tout à fait d'accord pour dire que cette proposition répond efficacement au défi. L'énoncé du problème cible un problème spécifique, à savoir que les jeux basés sur l'ENT s'adressent principalement aux joueurs, mais en général, j'ai également constaté une augmentation considérable du nombre de jeunes enfants jouant à des jeux sur tablettes/mobiles.\r\n\r\nCes jeux sont bien sûr soit éducatifs, soit spécifiques aux enfants. Par conséquent, je pense qu'il y a un énorme marché à exploiter dans cette direction.\r\n\r\nCe serait formidable d'augmenter la portée démographique des jeux sur Cardano. Cette proposition touche les bases et fournit leur solution à ce problème.\r\n\r\n\r\n\r\n", "q0r": 5, "q1": "L'expérience de l'équipe est publiquement disponible et donne une bonne première impression des capacités techniques et commerciales de l'équipe pour atteindre les objectifs de cette proposition.\r\n\r\nJ'apprécie qu'ils aient essayé de couvrir toutes les dimensions et pas seulement une ou deux, par exemple le codage, l'art, la conception du jeu, le marketing. Par conséquent, c'est une bonne chose qu'ils aient déjà des personnes qui couvrent cette proposition dans tous les sens.\r\n\r\nL'allocation des fonds est bien expliquée et la distribution horaire est expliquée. Cependant, je ne suis pas sûr de la raison pour laquelle cette taxe de 7 % est exigée ? il aurait été formidable d'ajouter la raison pour laquelle cette partie de la taxe est exigée.\r\n\r\nDe plus, la section sur l'utilisation de fonds catalyseurs supplémentaires fournit de bons détails sur les autres utilisations qu'ils souhaitent faire de ces fonds dans un avenir proche. Dans l'ensemble, la proposition est très bien rédigée et je suis entièrement d'accord avec l'expérience et le plan présentés, il est très probable que cette proposition sera mise en œuvre avec succès.\r\n\r\n", "q1r": 5, "q2": "Je suis tout à fait d'accord que les informations fournies sont suffisantes pour vérifier l'avancement et le succès de cette proposition.\r\n\r\nLe modèle d'entreprise - la voie du succès fournit une description détaillée de ce que l'équipe a fait jusqu'à présent, et où le financement du catalyseur entre en jeu. Cela donne à la communauté l'assurance qu'elle ne dépend pas entièrement du financement du catalyseur et qu'elle est très motivée.\r\n\r\nLes objectifs/étapes trimestriels sont bien présentés et peuvent être utilisés par la communauté pour avoir une vision de la réussite à court et à long terme. Les risques sont également décrits, ce qui permet à la communauté de garder à l'esprit les risques encourus lorsqu'elle vérifie la progression de ce défi.\r\n\r\nDans l'ensemble, je ne vois aucun problème pour le suivi des progrès et de la réussite de la proposition.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 20, "ne": 11, "ng": 8, "nfo": 1, "vca_o": 2}, {"q0": "Le jeu répond très bien à ce que cherche le défi. L'idée est de créer un jeu où les joueurs personnaliseraient, avec de nombreux détails, leur personnage, qui serait un NFT. J'ai trouvé très intéressant que ce jeu s'adresse également à un public d'enfants, je ne me souviens pas avoir vu d'autres propositions qui s'adressaient à cette partie de la population qui est massivement pertinente pour la création de contenus de divertissement (on sait à quel point ils peuvent être énormes, par exemple, les chaînes youtube destinées aux enfants, cela pourrait être repris dans les jeux). Si le projet réussit, il sera une bonne porte d'entrée pour les nouveaux utilisateurs de l'écosystème Cardano, peut-être même que les parents de l'enfant qui joue au jeu seront intéressés à en apprendre un peu plus sur notre blockchain ; cela augmenterait aussi certainement le nombre de jetons frappés et d'ada échangés dans le jeu, donc je pense que le projet bénéficierait à l'écosystème Cardano de différentes manières, s'alignant parfaitement avec ce défi.", "q0r": 5, "q1": "L'équipe semble très compétente, elle a déjà développé tout un concept d'identité visuelle, que l'on peut découvrir à travers le site web qui était joint et aussi à travers l'image d'un personnage qui était fournie directement dans la proposition. J'ai trouvé que c'était très beau et attrayant pour le public, pas seulement pour les enfants. Ils fournissent également une brève description de qui ils sont, y compris leurs rôles et certains travaux antérieurs, afin de vous rassurer sur leur expérience. Et ils semblent effectivement très expérimentés. Par exemple, d'après la description donnée, Christian est très intelligent et a plus de dix ans d'expérience dans le domaine de la conception graphique. Concernant la relation de cette équipe avec la blockchain, d'après ce que j'ai lu, Conward serait celui qui a le plus de connexion avec les technologies de notre écosystème, mais j'aimerais que ce pont soit exploré davantage. Sur la répartition financière, c'est bien qu'ils aient déterminé précisément comment le financement total (qui est assez élevé, mais justifié) serait utilisé, mais je pense qu'il pourrait y avoir plus de détails dans chaque partie. Certaines parties sont détaillées, comme les travaux d'animation et de codage, mais d'un autre côté certaines parties comme le marketing et la partie cool ne sont pas bien expliquées. Ces deux parties du projet absorbent une part importante de l'argent, ce qui nous oblige à mieux comprendre ce qui se passe. Dans la partie marketing, pourrait-on expliquer comment se déroule la campagne de diffusion, par quels canaux, comment atteindre les enfants ? Dans la partie où ils expliquent le développement du projet, ils mentionnent dans la première phase qu'il y aurait une activité sur les réseaux sociaux, ce qui nous fait déduire qu'une partie de la campagne de marketing s'y déroulerait. Mais il était important de comprendre exactement comment cela allait se passer. En parlant de développement par étapes, je pense que cette partie du projet est assez détaillée, de sorte que nous avons une image assez précise de ce qui va se passer, quand et comment, comme cela est censé être. Je pense donc que ce sujet est très bon, je suggère simplement d'approfondir les détails dans certaines parties citées.", "q1r": 4, "q2": "Excellente auditabilité, l'équipe définit de manière très détaillée ce que serait le succès, nous avons donc beaucoup de contenu à surveiller. En plus du sujet créé spécialement pour comprendre les KPI, nous pourrions aller plus loin dans le suivi car ils détaillent également ce que seraient les phases, c'est-à-dire que nous savons ce qui se passerait et quand, de sorte qu'il est possible de vérifier si les choses se passent comme promis. Ce qu'il faudrait faire, c'est que 1) l'équipe prépare un résumé des résultats et les présente au reste de la communauté, je pense que dans le cas spécifique de ce projet, le plus approprié serait de participer à quelques Town Halls, puisqu'il s'agit d'un projet très visuel et qu'ils ont déjà prouvé qu'ils étaient excellents sur le plan graphique, ce serait génial si nous avions une courte présentation visuelle de la façon dont les résultats se développent. Et 2) la communauté elle-même s'implique dans le jeu, le testant, apportant des retours constants, certains membres pourraient être sélectionnés pour cela, notamment ceux qui ont des enfants pourraient faire quelques tests pour voir comment les enfants réagiraient à l'univers et aux personnages créés. Ceci étant dit, je pense que l'auditabilité du projet est très bien engagée, elle a juste besoin d'être exercée par la communauté.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 20, "ne": 16, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Flooftopia aims to bring a brand new game on the Cardano blockchain, not only for PC but also on Android and IOS devices. \r\nTarget users will include also children and women.\r\nSo the challenge is definitely addressed by this proposal", "q0r": 5, "q1": "The team has an extensive experience in the sector as some members worked for big gaming companies such as Ubisoft. The game structure is not based on pay to win, which potentially can bring more active users and encourage them to continuing the gaming experience.\r\nA minus for not using the already existing CNFT.io webiste, because it would save some time and cost, but I guess using a dedicated NFT marketplace would help users avoiding switching pages and be lost buying wrong NFTs that would not work in the game. \r\nThe risk analysis outlines potential delays that would be avoided by shifting temporarily some resources to overcome them. Moreover the team is well aware of the extra budget that might be required on top of the funding. The LOOP staking pool is also related to this project.", "q1r": 5, "q2": "Key metrics, budget breakdown and timeline are clear and well summarized. The website structure is already in place, which leads to think the team is already fully operational. ", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 19, "ne": 2, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The idea of customizable NFT is awesome that I have never seen before, moreover, this idea can attract kids and women to our communities. The team also has a detailed description of how their game work and the goals into phases, which I think will impact a lot to the development of Cardano network, especially to kids and women whom I also didn't see on any other NFT games. \r\nWith their non-combat-oriented gameplay, hope that they will have more modes for kids, and content for the development of kids - one of their key target players. ", "q0r": 5, "q1": "They have a perfect team for developing this project, also as they mention they're already working on it for a while. That's the reason why they have a so perfect proposal for this idea: perfect context and also provide clearly info about how their idea strongly impacts the Cardano ecosystem. \r\nTechnically, their broken-down budget is very reasonable with the detailed roadmap to hit their success. \r\nMore than that, they also addressed their 2 risks and point out how they will kill them. So I strongly believe that the team will make this idea come true and so you do. ", "q1r": 5, "q2": "This is one of my triple 5 rate projects because their provided information for the audibility is fulfilled. We can check their member's information not only on this proposal but also on their website, moreover, we can check the development updates on their blog articles. \r\nAnd again, their success metrics and goals are very clear and align with this challenge. Their roadmap also has a realistic arrangement to help them acquire their success. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 5, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The idea of customizable NFT is absolutely can solve the problem that they have and they're within this challenge. \r\nThe proposal also have a clear success key metric that fit with the challenge setting. Those key metric can show how their work affect to the Cardano ecosystem. Especially to kids and women, targets that they aim to be players of their game. ", "q0r": 5, "q1": "Proposal have clear the detail of: \r\n- Roadmap that was detailed in to related activities that affect to the goal of that phase\r\n- The budget allocation that they break into specific position and workload for each of their position \r\n- For supporting to the roadmap, they also have very clear goal in 6, 12, 24 months that show how their work will be done and they're all reasonable to their detail explaination about the game. \r\nThe proposal also have show some key risk and how they solve it. \r\nMoreover, with the experience of their team we can believe that they will succeed. ", "q1r": 5, "q2": "Proposal have: \r\n- Very detail roadmap that devided to field \r\n- Their success goals fit with the roadmap and they can get it with their reasonable break-down \r\n- And these goals are also fit with what they explain above, how the game work and how it solve their problem clearly. This also show us that they really aligh with the challenge setting. \r\nMoreover, they also have their own website and some important info for audi we can find there including: \r\n- Team information \r\n- Regularly update the development progress in blog section \r\nI think ", "q2r": 5, "assessor": "z_assessor_670", "no_vca": 18, "ne": 3, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "The game is not just for finance-driven players but I think it will strongly affect a lot of kids and their parents to join to be aware of the Cardano ecosystem that the team also mention. The idea of customizable NFT is one of the special things that I don't see in most other NFT games, but when this project successfully deploys it I think it will drive a lot of users because now they can put their personality into their assesses. \r\nThe project also has key success targets very clear and detail in a particular period of time, most of them directly align with the challenge setting and really help to develop Cardano ecosystem well. ", "q0r": 5, "q1": "I think team should provide some more detail about the game environment, it will help us assess your work estimation better. The only info in the proposal we saw here is just only about how we can customize the NFT and general info about the environment. \r\nLooking into the roadmap, we can see it is a complex project but I think with the experiences of their team members, it will succeed. \r\nThis proposal is nearly perfect and I hope that the team can get their goals as they detailed there. ", "q1r": 4, "q2": "With the detail of the roadmap into single fields and achievable goals, it's enough for us to audit the project. \r\nMoreover, the project also has a very detailed explanation about how they solve the problem that can help us well understand how their work will be and that also how their roadmap was made. \r\nBut as I said before, wish that they will have more detail.  ", "q2r": 4, "assessor": "z_assessor_671", "no_vca": 15, "ne": 3, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The general idea seems interesting, in creating your own special character and that it is for all age groups. That means a bigger market. It would be beneficial if the game itself would be a little bit more explained. It is mentioned as adventure based game and social based game, but more details would be helpful. The team itself looks as experienced group in gaming and in blockchain. ", "q0r": 4, "q1": "It looks as the plan could be implemented successfully. The market for the game is big enough to cover multiple age groups and the team seems to be experienced enough. The stages of the project are well explained with achievable milestones. It does depend a lot on first sales of NFTs, but it is gaining a lot of followers on Project Catalyst so that could be a good indicator of future. ", "q1r": 4, "q2": "As mentioned, the milestones are nicely explained and seem to be achievable. As Q4/2021 is ending it would be nice to see what is done in that time slot, if the project is on track as planed a lot of things are mentioned as 'ongoing'. More details would be nice to see. ", "q2r": 4, "assessor": "z_assessor_672", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "An adorable CNFT game that looks exciting and fun for all ages. Being a community driven NFT adventure game as stated in the proposal, users will customize their own NFT before game is released, and then they will mint to their new NFT friend on the blockchain, and that NFT will be used in Flooftopia upon the game's release. This effectively promotes cardano blockchain and makes it attractive to gamers.", "q0r": 5, "q1": "With the team's experience in coding, Art, Marketing, game design and strategic advisory, coupled with their ability to have launched the game already (currently ongoing), the proposal can be executed successfully. The detailed plan showing the different phases and the explanation of the whole game process in the proposal, implementation will be successful.", "q1r": 5, "q2": "The time line is very comprehensible with the breakdown into different phases of success factors makes it auditable. The budget breakdown is quite detailed and auditing will be effective. ", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Your scheme is very creative and lovely for lovers of light games. Interestingly, the author added the content of NFT codes into the game, which appeals to players including mothers and children. \r\nHowever, from the point of view of a mother of 2 children, I have the opposite opinion of the proposal, perhaps children are the objects to avoid or limit the use of mobile devices, especially content. novelties include NFT that draws them in. Children need more activity, more abstract thinking than existing in digital video games, and for their future worldview. \r\nI always want the proposal to focus on making engaging content for real game lovers.", "q0r": 2, "q1": "Regarding the feasibility of the proposal:\r\n- Experienced team with members with necessary skills to complement each other, from programmers, marketers to game artists. The identity of the members is easy to verify and interact with on social networks.\r\n- The solution of the project has not been clearly stated, especially the explanation of the project's game system. The ways that create the NFTs, the technical foundations and operate them.", "q1r": 3, "q2": "The auditability of the proposal:\r\n- The author proposes to provide a very detailed budget description that is necessary, it is easy for investors to consider the budget.\r\nHowever, with $57,000 in funding, you can break it down into phases of a project that will have a higher chance of being accepted.\r\n- A roadmap is also very clear and a timeline with specific criteria.\r\n- The risks of the project are also mentioned, but more radical solutions are needed.", "q2r": 3, "assessor": "z_assessor_755", "no_vca": 21, "ne": 0, "ng": 11, "nfo": 10, "vca_o": 1}], "solution": "Nous allons créer un jeu de frappe de monnaie NFT et CNFT mignon et personnalisable qui se concentre sur l'inclusion de tous les groupes démographiques, y compris les enfants !", "experience": "Codage : Dirk\nArt : Chris\nMarketing : Conward\nConception du jeu : Alex\nConseiller stratégique : Marcin"}