{"id": 381294, "author": "carnivilla", "title": "Onboarding Untapped Communities", "url": "https://cardano.ideascale.com/a/dtd/381294-48088", "category": 26241, "amount": 50000, "description": "Les joueurs des communautés de type Metaverse manquent de fonctionnalité et d'appropriation de leur propriété numérique et des actifs de leur environnement.", "funded": 1, "upvotes": 29243871, "downvotes": 20588156, "votes_result": 8655715, "votes_cast": 151, "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=18987"], "media": [], "f6_assessments": [{"q0": "Cette proposition est très intéressante car elle ne promet pas de créer un jeu en soi, mais un environnement virtuel dans lequel les joueurs de différents jeux peuvent interagir et apprendre à utiliser les technologies que la blockchain promeut de manière plus efficace et pratique, comme le NFT, par exemple, qui selon les auteurs de la proposition sera considéré comme quelque chose de basique à gérer par le joueur. Je crois que c'est une idée très pertinente car malgré que l'univers de la blockchain soit déjà une réalité, cette technologie est beaucoup plus connue dans certains points que dans d'autres, et il est difficile pour une personne d'apprendre seule ce qu'est la blockchain, les crypto-monnaies, le NFT, etc... . Même si la personne est issue du monde du jeu, selon le contexte dans lequel elle est insérée, c'est-à-dire s'il s'agit d'un pays/ville dans lequel on parle et on connaît peu le monde de la cryptographie, il est fort probable que cette personne aura quelques difficultés à y entrer. Si tout va bien, c'est-à-dire si notre blockchain devient de plus en plus populaire et que l'utilisation des NFT dans les jeux se généralise, les personnes qui n'ont pas de conseils appropriés sur la façon de les manipuler seront certainement lésées. Je pense que cette idée est bien liée à l'objectif plus général de Cardano aussi, de construire un monde plus égalitaire, même si seulement dans cette partie spécifique des jeux. J'ai aimé cette idée, je pense que si elle est financée et exécutée avec succès, elle peut amener de nouveaux membres à l'écosystème Cardano, qui amèneront probablement d'autres personnes à la blockchain également, et ainsi de suite, un réseau peut commencer à être créé petit à petit, et le moyen d'attirer un jour beaucoup de gens à Cardano. Je pense que c'est une proposition très intéressante et qui a de grandes chances d'apporter des résultats très positifs.", "q0r": 5, "q1": "L'équipe se préoccupe de fournir une courte description de chaque membre, dans laquelle nous connaissons leur nom et leur rôle, ainsi que (dans certains cas) la durée de l'expérience de la personne dans un domaine d'expertise donné. Malgré cela, il serait encore plus intéressant s'ils fournissaient une page de réseau social pour chacun, linkedin est toujours, à mon avis, la meilleure option, parce que nous pouvons y voir les expériences passées et les connexions de chaque membre, de sorte que vous pouvez apprendre à les connaître. plus intimement. Cependant, ici nous avons quelques défauts sérieux. Quelque chose qui m'inquiète est que, bien que semblant capable du projet, aucun membre de l'équipe ne prétend avoir une implication directe avec notre blockchain. Cela serait important pour s'assurer que Cardano en bénéficie directement, il existe d'autres endroits où les joueurs peuvent monnayer leurs natifs numériques, il existe plusieurs possibilités d'interagir avec la blockchain ; il est nécessaire que nous soyons sûrs de la manière dont la nôtre sera utilisée ici, car sinon, il n'est pas intéressant de financer l'apprentissage d'utilisateurs qui ne savent pas avec certitude s'ils utiliseront les technologies de Cardano. D'ailleurs, il n'est pas clair s'ils seraient capables d'enseigner ce qu'ils proposent, quel membre de l'équipe a des connaissances solides sur la blockchain, le NFT, etc ? Ce n'est pas explicite dans la description qui nous est montrée, malheureusement nous avons besoin de savoir s'ils sont préparés pour le projet lui-même, au-delà de leurs expériences en dehors de l'univers cryptographique. Concernant la répartition financière, l'équipe nous fournit des informations sur la manière dont le montant total serait réparti, en nous donnant des explications pour chaque sujet. Cela nous donne une bonne compréhension de la façon dont cette partie du projet se développerait. Le scénario est satisfaisant en termes de détails, il s'agirait de 6 mois, divisés en deux grands blocs, dont nous savons quelles activités se dérouleraient dans chaque partie, de sorte que nous avons une vision plus solide de ce qui est à venir. Cependant, en raison des questions entourant la qualification de l'équipe pour traiter les problèmes dans l'écosystème Cardano, je dirais que ce sujet doit être reformulé, afin qu'il transmette plus de confiance et de sécurité dans l'équipe.", "q1r": 3, "q2": "L'équipe nous donne des données directes concernant l'auditabilité, il y a des définitions de succès attendus en fonction du passage du temps. Il y a deux sujets, spécifiant comment le projet serait réussi. De cette façon, nous pouvons suivre directement les résultats possibles. Il serait également possible de suivre le développement du projet lui-même, à travers les activités qui ont été décrites dans les phases. Je pense que l'audibilité pourrait se faire de la manière suivante : nous choisissons un ou deux membres de la communauté pour suivre ce projet, entrer en contact avec l'équipe et collecter les données. Le suivi, qui peut être apporté à la communauté par le biais de rapports. Il serait extrêmement important que l'équipe elle-même nous donne également satisfaction sur le processus, et pas seulement sur les résultats, afin que nous puissions comprendre comment le produit final se construit au-delà de ce qui est obtenu à la fin du processus. Par conséquent, je le crois, l'équipe fournit des informations importantes pour le suivi du projet, mais je souhaiterais établir un contact direct et constant entre l'équipe et le reste de la communauté Cardano, afin de transmettre plus de sécurité en général.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is aimed at an untapped community that would be able to interact with the cardano blockchain seamlessly to bring wide adoption. It would target gamers who are active in marketplaces and provide them with value and a reason to adopt cardano.", "q0r": 5, "q1": "This team has exprience in events, digital creation, and gaming, but it is not clear who will be doing the blockchain/NFT development and what their experience is with such. They have the two partner companies with relevant product experience, but their blockchain development is not clear. This proposal would benefit from providing more details on if that will be outsourced with the budget and who will be doing it.", "q1r": 4, "q2": "This proposal would benefit from breaking down their ideas of success down futher to judge the development vs the initial launch progress. The budget breaks down what the funds are spent on, but could be more comprehensive to improve auditability.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Even the problem can be within the challenge, because at my point, their idea with VR can make something special to Cardano communities and it can make our ecosystem become diverse but I'm not sure it is the direction of the current proposal or not? They should have more words to explain to us how their model will impact this challenge. Or providing some key metrics, goals that they plan to get can also help us know about that. \r\nBecause of lacking a lot of these thing I rate them 1 our of 5, hope that they will have a better proposal in next fund. ", "q0r": 1, "q1": "Seem that the team has great experience to finish their proposal easily. In addition, they also divide their phase into small pieces in their roadmap and explain how their people will solve it in the funding allocation. So, I believe that within this proposal scope, its feasibility is 4 out of 5. \r\nAnother thing they should provide is the risk of their proposal and how they will solve it. The fact is with the info inside this proposal, I cannot estimate which risk they will get because of their experience & they're doing well everything for their project and this proposal is just a small step of their development. ", "q1r": 4, "q2": "But they should give us some key metrics, this will help us clarify what they want to get and how it can help our communities. Technically, I rate the feasibility high because of their ability and project situation but they're lack something for us to audit their work. Providing key metrics, detailed explanations about the solution will help people in our communities assess their purpose better. Even we can track their work on their channels that are shown on their website but better be clear here in the proposal. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "I'm not sure what detailed solution and how they will solve their problem in detail. Indeed, that their problem is lying in the scope of this challenge but the info in the proposal is not enough to explain how it will and can't help us on assessing the level of impaction to the challenge. \r\nMoreover, even this project is running but this proposal will have its own goals and the proposer should prove some key metrics that they will track when running in the scope of 10 weeks that they're already mentioned in their funding allocation. ", "q0r": 2, "q1": "As a developer, I can understand a bit with the info they shared in the funding allocation but they should have a more detailed explanation about these technologies, also be better if they have more info on the solution explanation - it will help us assess their step of development better. \r\nBut I think that this team can solve this proposal because their project is running in real life and the team info can show their professional skill that suits their job. \r\n", "q1r": 5, "q2": "Again, lacking detailed explanations about their solution can't help us clarify their goal within the scope of the proposal. \r\nEven they have a detailed roadmap and explain what they will do and use their fund, but I think the proposer should provide some goals, key metrics - it will help communities measure it. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This on-chain game also brings in a virtual reality component which will only continue to be more popular in the future. Using this challenge's funding in this manner is a good way to ensure Cardano is on the cutting edge.", "q0r": 5, "q1": "Yes, the team's experience will lend to its success. Additionally, you can tell from the KPIs, project roadmap, and budget breakdown that the team has approached the planning process thoroughly.", "q1r": 5, "q2": "Yes, the detailed KPIs, roadmap, and budget breakdown are sufficient for auditing the project's progress and success.", "q2r": 5, "assessor": "z_assessor_788", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "VR NFT based game proposal is effectively addressing the gamers on-chained challenge.", "q0r": 5, "q1": "The team has experience building VR apps for events and has presented a complete plan to build out there metaverse platform to create gamified learning and community spaces for Cardano community members. ", "q1r": 5, "q2": "The information in the roadmap, defined success, team and budget sections are very useful audit items.", "q2r": 5, "assessor": "z_assessor_805", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Initiation des communautés VR à l'interaction de base avec la blockchain dans des environnements immersifs et ludiques.", "experience": "L'équipe a organisé deux événements au cours desquels les participants ont appris à accéder à la blockchain et à interagir avec elle dans un environnement réel de NFT."}