{"id": 383002, "author": "mr.mietrich", "title": "Be a Tree! - The Tree Simulator!!", "url": "https://cardano.ideascale.com/a/dtd/383002-48088", "category": 26241, "amount": 18300, "description": "Les connaissances communes sur les arbres, leurs besoins, leur importance et leur caractère unique sont rares. Des millions de personnes ne peuvent pas distinguer un arbre d'un autre.", "funded": 1, "upvotes": 40651900, "downvotes": 7243120, "votes_result": 33408780, "votes_cast": 173, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=4833"], "media": [], "f6_assessments": [{"q0": "L'idée répond bien aux objectifs du défi, car l'intention de l'équipe impliquée ici est de créer un jeu dans lequel les gens simulent la croissance d'un arbre, chaque joueur (arbre) étant monnayé en NFT, qui peuvent être échangés. En plus des NFT des joueurs eux-mêmes, les organisations à but non lucratif pourraient participer au jeu avec leurs propres NFT, ce qui est également très intéressant. En d'autres termes, en ce qui concerne la connexion de ce jeu avec notre blockchain, je pense qu'il est assez clair comment le projet pourrait bénéficier à l'écosystème Cardano, puisque les joueurs et les institutions impliqués monnayeraient leurs jetons dans notre blockchain. Ce qui me fait me demander, en fait, si l'idée du jeu elle-même serait largement acceptée, si les gens seraient vraiment intéressés. L'équipe affirme qu'au cours du développement de l'arbre, qu'il s'agisse d'une graine, d'un arbre adulte ou même d'une forêt (vous voulez comprendre ce que c'est, la personne multiplierait-elle son arbre ?), le joueur apprendrait comment fonctionnent tous les systèmes de la plante. et il deviendrait également un expert dans l'identification des espèces. J'avoue que c'est une idée intéressante pour ceux qui sont déjà intéressés par ce genre de choses, mais je ne pense pas que ce soit le profil de la plupart des joueurs, généralement les gens aiment quelque chose qui implique la construction de l'univers, l'interaction directe avec d'autres joueurs (ce qui peut arriver ici aussi, mais moins intensément), les jeux de hasard... Ma question est de savoir si nous serions vraiment capables d'atteindre un nombre suffisant de joueurs, qui monnayeraient leurs NFT en Cardano et effectueraient des transactions qui couvriraient les coûts de production du jeu et généreraient des bénéfices. J'espère que les auteurs de la proposition ne se sentiront pas offensés par ma remarque. Ce que j'essaie de dire, c'est qu'à mon avis, ce jeu fonctionnerait bien pour une certaine niche de joueurs, mais je ne pense pas qu'il puisse avoir un large public. Je peux me tromper, bien sûr. En conclusion, je crois que oui, ce jeu aurait un impact positif pour notre blockchain, je voudrais juste que les auteurs incluent dans la proposition un plan de marketing qui pourrait expliquer comment ils attireraient les joueurs et les garderaient actifs dans le jeu.", "q0r": 3, "q1": "En ce qui concerne l'équipe, il est positif qu'au cours du détail de la proposition, ils aient précisé combien de personnes seraient impliquées dans le projet et quels seraient leurs rôles. Ils ont également joint un site web où, si vous faites défiler vers le bas, il y a un petit onglet avec la présentation des membres de l'équipe ; j'ai déjà évalué une autre proposition avec cette même équipe et ils semblent capables de ce type de projet, qui a un biais plus éducatif. C'est important car nous avons des détails sur qui sont les membres de cette équipe, un petit CV dans lequel nous pourrions apprendre sur leurs travaux précédents, etc. A propos de l'élaboration d'un scénario, il arrive ici qu'ils établissent des étapes à suivre en fonction du temps, mais je pense qu'il y avait un manque de détails. Par exemple, dans la première phase, ils disent que le site web et l'identité visuelle seront créés. Mais c'est tout. Il serait important de comprendre plus en détail comment ce processus va se dérouler, la création de l'identité visuelle étant un point clé pour ce jeu (en fait pour tous les jeux, le design visuel est d'une importance capitale). Et enfin, sur la question de la division financière, ce point avait encore moins de détails, malheureusement. On sait qu'ils ont calculé un salaire de 1200$ par mois pour chaque professionnel, mais ils n'ont pas précisé combien d'heures par jour ils travailleraient avec (ils mentionnent le temps partiel, mais cela varie d'un endroit à l'autre), combien de jours de la semaine ils travailleraient, comment l'organisation interne entre eux se ferait (comment ils entrelaceraient leurs parties pour composer le tout)... En gros, nous ne comprenons pas grand-chose à la façon dont cet argent serait utilisé en pratique, nous savons seulement qu'il s'agirait d'une distribution égale entre les membres de l'équipe pendant une certaine période. Un autre point est que, si je comprends bien, l'argent demandé dans ce tour de financement ne couvrirait que les salaires du premier trimestre de développement, il serait important pour l'équipe de le préciser. Dans la partie qui explique l'argent demandé, ils multiplient le salaire mensuel par le nombre de professionnels et par 3, soit 3 mois de travail. Demanderont-ils plus d'argent plus tard ? Seraient-ils en mesure de le faire à partir de là ? Comment les choses se passeraient-elles ? J'ai ressenti un manque de sécurité dans cet aspect de la proposition.", "q1r": 3, "q2": "Les auteurs nous fournissent quelques indicateurs clés de performance pour mesurer le succès du jeu. Je pense qu'ils sont satisfaisants pour comprendre si le public suit vraiment l'idée, si elle est touchée, si le nombre de NFT dans notre blockchain aurait une croissance attendue pour la proposition, et aussi si les institutions à but non lucratif bénéficieraient du fait (ce qui est directement lié aux objectifs plus généraux de l'écosystème Cardano). Il serait important pour l'équipe de préparer périodiquement des rapports contenant ces informations et de les présenter au reste de la communauté par le biais de l'un de nos canaux de communication. Un autre point serait de surveiller le développement du jeu lui-même, et pas seulement les résultats. L'équipe prévoit un total d'un an pour terminer le jeu, il serait important que la communauté puisse suivre les phases qui ont été mentionnées par eux, je suggère une réunion à la fin de chaque phase pour démontrer les progrès. De cette façon, nous pourrions exercer une auditabilité plus complète, basée non seulement sur les résultats, mais sur le processus de création lui-même. Je pense que les auteurs nous ont donné quelques moyens de suivre le projet, mais pas assez pour une auditabilité forte.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The idea of tree simulator is interesting and fresh. The idea that you could save you tree as NFT and have the 3D model of if for printing or any other purpose is quite interesting. Especially if it would be used as some educational project, like schools where kids could have the tree 3D printed that they gave 'life' to. Additionally the idea that you could buy NFTs from other users is also interesting and a good way to make transactions. Also as it would be used for funding real life environmental projects is a good thing. ", "q0r": 4, "q1": "The team seems to be passionate about educational projects, so proposal would most likely be implemented successfully. One of the potential issues could be the small niche for market. As not a lot of people would find interesting a tree simulator. But the fact it can be used for educational purposes is a nice touch that could attract people, especially kids that are willing to learn more. Overall an interesting idea but in my opinion a potential small market. Additionally would the  game become monotonous after some time?", "q1r": 3, "q2": "The information seems to be sufficient, but maybe additional milestones would be nice to have. What would be the first steps, how would it be marketed after the release or things like that. Explanation of KPIs is nice and could be a good way to measure progress of the game and overall transactions related to it. ", "q2r": 4, "assessor": "z_assessor_672", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "A well-thought-out approach to the challenge at hand. This proposal tries to address the quite ignored aspect of the challenge which is the scholastic side to the games. When it comes to games, people often look at them from the entertainment view rather than the educational side. Especially, during the times where the flora and fauna are being disregarded, a proposal such as this can be of exorbitant importance. This will certainly lure a special fragment of people (i.e environmentalists, nature enthusiasts, NGO) to the ecosystem who have been very few in numbers on the network at the moment. The proposal also comes with a detailed game plan and timeline which makes the proposal more intriguing and promising.", "q0r": 5, "q1": "The team is very diverse and the mix seems to have the necessary experience and expertise to make this proposal a reality. The requested amount of 18.3k USD out of the allotted 250k USD for the challenge seems to make justice. The break up of how and where the funds are to be utilized is fair and reasonable too. The road map even though is brief, is quite self-explanatory. But the only thing that concerns me is that the team has not mentioned the possible challenges and hiccups the team might face during the implementation and how the team proposes to get the better of them. Provided all the above information, the chances of the plan being implemented successfully are still high. Therefore, I rate feasibility with a score of 4.", "q1r": 4, "q2": "The proposal has a clear mentioning of the KPI/Metrics one can use to audit and track the progress of the proposal. The metrics are good enough to monitor the footsteps the proposal leaves across various segments of people. However, a few managerial metrics such as cost of quality, productivity, customer satisfaction index, and daily active user to monthly user ratio, customer retention ratio will probably provide more insight during the audit to monitor how well the game is being received and appreciated by the customer base. Henceforth, a dainty bit of attention to these additional metrics can make the proposal a heavyweight in this challenge.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 17, "ne": 7, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Construisez un simulateur d'arbre en 3D pour que les joueurs puissent faire pousser leurs propres NFTrees, de la graine au géant, tout en donnant de la visibilité aux organisations à but non lucratif axées sur le climat.", "experience": "UX/UI, Full-Stack Dev, pionnier de Plutus, artiste génératif, modélisation procédurale, scientifique culturel, arboriculteurs."}