{"id": 383840, "author": "psmaxzaxster", "title": "Platform for painters", "url": "https://cardano.ideascale.com/a/dtd/383840-48088", "category": 26241, "amount": 30000, "description": "Beaucoup de peintres en Slovénie, notre pays est célèbre et ne savent pas comment faire des NFTs.\nIl en va de même dans les pays étrangers, surtout les plus anciens.", "funded": 0, "upvotes": 14829854, "downvotes": 17992276, "votes_result": 3162422, "votes_cast": 157, "f6_no_assessments": 6, "f6_rating": 1.7222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "the problem has not been precisely defined. this is an idea. the experience described matches the quality of the explanation. the impact is unclear. This idea is not an effective response to the challenge.", "q0r": 2, "q1": "the budget is only roughly explained and needs further elaboration. a roadmap, kpis and delivery dates are not known and should be added. the github link again leads to the provider's website, which offers a better overview to the previous product. the link to the website should also be added. the applicant's experience is not aligned with the application.", "q1r": 1, "q2": "the community could control the progress of the project via its own website, provided that the applicant sends regular updates. unfortunately, there is no information about this. possible risks are not described and should be mentioned. also possible solutions for this.\r\n", "q2r": 2, "assessor": "z_assessor_260", "no_vca": 23, "ne": 0, "ng": 14, "nfo": 9, "vca_o": 1}, {"q0": "This proposal's problem statement and solution are not aligned with the challenge. The challenge is about creating game, toolkit, SDK to attract gamers and creators onboard Cardano. The key metrics and goals are not align with the current challenge settings. This proposal should be moved to miscellaneous challenge.  ", "q0r": 1, "q1": "The proposer did not provide any verifiable links to profile such as linkedin. Please provide information on the team members with the relevant skills and experience needed to implement the proposal. Furthermore, the proposer did not provide the required manpower and resources to successfully implement the project. Moreover, the proposal did not give any details on budget breakdown. In addition, the proposal did not provide any roadmap or realistic timetable to complete the work. This proposal also did not provide any sensible and conductible detail plan of  implementation. Besides that, the proposer did not consider any risks and challenges that they might face relevant to a successful implementation.  ", "q1r": 1, "q2": "The proposer did not provide a clear roadmap with milestones and a time horizon for achievement. Furthermore, the proposer fails to provide information on the team members working on the project. Anonymous teams poses risks of rug pull. In addition, the proposal did not mention any metrics or KPI that defines the success of the proposal. Other than github link, there are no other ways for voter to keep track of the project progress or engage with the team members", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 21, "ne": 1, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "I did not see how the proposal connected to the brief of gaming on Cardano. I believe the proposal should have been entered under DApps and Integrations. ", "q0r": 1, "q1": "The proposal provided a link ta a github, I would like to see the background information on the team strengthened with links to LinkedIn or similar.  I would like the team to expand on the go to market strategy. I would also like the team to expand on the backend design and how that will tie into the Cardano bockchain. ", "q1r": 2, "q2": "I would like to see the team develop a simple monthly roadmap with milestones to connect the funds expenditure with the goals of the proposal. I would like the team to develop KPI's to help track performance, for example have 200 NFT created month 4, have 200 users by month 10 etc. I feel the information provided is might be challenging to audit the progress and success of the proposal.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "\"Bringing artwork on blockchain is a great idea to help artists get their work directly to customers and they get paid for what they create without needing to pay. must go through any 3rd party.\r\nBut I still haven't seen the proposal that gives specific descriptions of this Platform and how it plans to implement it and how it plans to connect people who want to buy these paintings or works of art?\"", "q0r": 2, "q1": "\"The team behind the proposal is a group of people from a painting company called Painting studio Max Zaxster. This shows that they are competent in art. But most of the work in this proposal is about how to market to target customers? How to put actual works on the blockchain platform? How to directly trade products on the blockchain platform?\r\nAll of these require a team with experience in blockchain, smart contract or NFT. This is what the team has yet to have and is looking for.\r\nBut how will the team convince those people with blockchain experience to work for the team without a specific plan to deploy and attract customers?\r\nThe things proposed in this proposal don't look very feasible\"", "q1r": 2, "q2": "This Proposal has not provided the necessary information for an audit such as: Roadmap, milestone, KPI, What does success look like, budget breakdown. So this proposal cannot be audited", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "As a business developer, it is unclear of the solution that the project proposed would benefit the Cardano ecosystem with the challenge given. ", "q0r": 2, "q1": "I do believe that there are experienced painters in Slovenia and to help the recognition of creativity around the world. It would be great to see a well-planned roadmap for the NFT that the proposers would like to sell, the distribution of budget for their team and project, and how this would be of value to the key metric/goals of the challenge. ", "q1r": 2, "q2": "As stated, it is a fulfilling idea to create a recognition for great artists around the world, but it is unclear as how the funding would be distributed for the project.", "q2r": 2, "assessor": "z_assessor_669", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This is a very interesting proposition, it offers a new approach to art.\r\nHowever, you may have digressed, this is not exactly a game, I think this proposal is in the field of community events.", "q0r": 2, "q1": "A team of highly experienced and skilled painters can create valuable paintings.\r\nUnfortunately, in this proposal, the part of the plan is not fully described. Therefore, I will not be able to know your work plan, making it difficult to see and evaluate.", "q1r": 3, "q2": "You should add a lot of content to your offer:\r\nAdvertising policy, attracting users.\r\nWork plan in a specific way.\r\nDescription of the price of each painting, as well as the material to make the picture.\r\nAlso, the requested budget is 30000$, how is this money spent?", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1}], "solution": "Nous voulons créer une plateforme qui puisse les aider, et faire des NFTs en leur nom. Ainsi, il peut vendre leur travail\négalement sur la blockchain comme art NFT.", "experience": "Studio de peinture Max Zaxster, nous avons beaucoup d'expérience avec l'art, et nous avons\négalement des gars qui ont de grandes idées avec les NFTs. Des croyants de Cardano."}