{"id": 383909, "author": "jt.aussiegingersnap", "title": "Game Asset Analytics [Revelar]", "url": "https://cardano.ideascale.com/a/dtd/383909-48088", "category": 26241, "amount": 11400, "description": "La visualisation des mouvements et des interactions des NFT à l'aide d'explorateurs de chaîne est confuse et complexe.", "funded": 1, "upvotes": 56083470, "downvotes": 4389728, "votes_result": 51693742, "votes_cast": 182, "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "I think there is a lot of game players who are thirsty for this feature. Hence, if this team can successfully deploy their tool on Cardano, I think it will drive a lot of users in multiverse games to come and use.\r\nThey also show us their goal of success, with these numbers I believe that it will make a big impact on Cardano ecosystem. ", "q0r": 5, "q1": "In the scope of this proposal, the team shows shortly about their features that will help to beat the problem, and also with the roadmap. Hence, my advice to them is that they should give some more detail about features and how it works in case studies or technologies that will use for it. And the roadmap should be outlined with more detailed tasks of each field instead of just a single target. \r\nThey have good key metrics that prove that their ideas will strongly impact the Cardano ecosystem, but this is not a simple project that needs a more detailed plan with risk management. ", "q1r": 3, "q2": "The proposal team provides a roadmap but is not detailed, and the budget is not broken down into detailed parts. But I think it is rather enough for auditing their progress. \r\nThe good thing is they have clear and promising KPIs and detailed features of the tool to finish. \r\nOne more good thing is their explanation of the problem and how the features of their project solve it, can help everyone easily understand for assessing their work feasible or not. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal effectively and innovatively addresses the challenge. The gaming community will win from the proposed analytics approach in many ways: understanding the ecosystem, developing/designing better games, getting and gaining feedback, and understanding larger general trends and patterns within game asset NFTs.", "q0r": 5, "q1": "Very strong and experienced team. However, an expert in visualization, visual analytics, HCI, and (analytics-oriented) UX would have been a strong piece to the puzzle. The plan is clear, innovative and realistic to be implemented successfully.", "q1r": 4, "q2": "Measurables and development timeline is dedicated for more transparent progress monitoring and auditability. Proposed measures and logic are convincing and verifiable.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This is a pretty good proposition. It create a web app dashboard with key metrics for game asset NFT's so game makers have a clear view & tracking of their content. This proposal covers the game asset analytics dashboard within the Revelar NFT Game Engine v1. It helps proponents know which parts of their game are being used, helping to deliver a better gaming experience in PreAlpha and Alpha versions.", "q0r": 4, "q1": "The plan is presented in a truly optimal way, there is a good chance that this proposal can be successfully implemented in the manner described by the proponents. The roadmap is well estimated in my opinion, the terms seem concrete, the team is well trained and multidisciplinary in the gaming area. The budget is clear and reasonable to achieve the objectives set, however it is not divided by areas (eg DevOps, Development, Design, Marketing, ..), doing this would certainly help to better outline the costs, perhaps even dividing them by phases.", "q1r": 4, "q2": "Everything is concise and to the point. The need is clear, implementation is already promising. There's enough information about the team and metrics which would help the effective tracking of their progress by the Project Catalyst community.\r\nI looked at the image of the provided game asset analytics dashboard, it's very detailed. Including market capitalization, users, top collections,... It will help a lot for manufacturers in tracking and managing parts of their game.\r\nHowever, I cannot access the website that was provided. (The time of my access is 12/12/2021). This is a very potential project, I hope it will be implemented successfully.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Créer un tableau de bord d'application web avec des mesures clés pour les ressources de jeu NFT afin que les créateurs de jeux aient une vue claire et un suivi de leur contenu.", "experience": "Une décennie en tant que fondateur et directeur technique d'une entreprise de technologie + pionnier de Plutus + Fonds 6 + aux côtés d'une équipe complète d'ingénieurs. (Voir ci-dessous)"}