{"id": 383911, "author": "jt.aussiegingersnap", "title": "Game Asset Management - [Revelar]", "url": "https://cardano.ideascale.com/a/dtd/383911-48088", "category": 26241, "amount": 7650, "description": "La gestion de plusieurs projets NFT (avant et après le lancement) est difficile et il est difficile de trouver des actifs pour le soutien.", "funded": 2, "upvotes": 72016542, "downvotes": 2528150, "votes_result": 69488392, "votes_cast": 255, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "As a game player, I do want to have this feature in my wallet. And now, with their dashboard for managing all my game assets, I think I and other gamers will use it immediately. \r\nMore than that, the team also has plans to get their numbers in the key metrics, that they will attract thousands of assets and games to use their system. Therefore, I think this idea will help to grow a ton of players in the Cardano ecosystem. ", "q0r": 5, "q1": "This is just a single and simple dashboard feature so I think their roadmap and its timeline are realistic for their development team. But I hope that they will give us some plan on attracting people and games to their platform for achieving the KPIs that they set. \r\nBy the way, they have a detailed explanation of their problem and how they can solve it, especially listing all the basic features - that can help CA to assess their progress so well. \r\nLast but not least, I think that it's a little hard to get their goals of success with numbers of assets and games will join, hope that they could show some relevant risks and how they can against them. ", "q1r": 4, "q2": "The team has a good roadmap that is divided into weekly sprints to clarify what they will do in weeks, and their key metrics are promised for a great start but lack of implementation plan for those numbers - only plan for developing the features. \r\nThey have detailed the problem and explained how their solution can solve it well, but I think they should give us some more info that relates to technical stuff. \r\nOnce again, I love to know which risks they can aware and how they solve them to get success. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This is a pretty good proposition. It create an easy web app for any project to manage their NFT Assets with a robust dashboard for multiple projects & users. This proposal covers the game asset management dashboard within the Revelar NFT Game Engine v1, offer both pre minting and post minting asset management so team's can collaborate and distribute their content across games, users, and manage new collections and content for their games over time.", "q0r": 4, "q1": "The plan is presented in a truly optimal way, there is a good chance that this proposal can be successfully implemented in the manner described by the proponents. The roadmap is well estimated in my opinion, the terms seem concrete, the team is well trained and multidisciplinary in the gaming area. The budget is clear and reasonable to achieve the objectives set, however it is not divided by areas (eg DevOps, Development, Design, Marketing, ..), doing this would certainly help to better outline the costs, perhaps even dividing them by phases.", "q1r": 4, "q2": "Everything is concise and to the point. The need is clear, implementation is already promising. There's enough information about the team and metrics which would help the effective tracking of their progress by the Project Catalyst community.\r\nI think need to add some more information, for example: how the team can manipulate to manage their projects,...\r\nI cannot access the website that was provided. (The time of my access is 12/12/2021). Overall, this is a very potential project, I hope it will be implemented successfully.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The idea of having one place to manage all game assets and visualize them seems really and is aligned with Challenge as it will save developers management time leaving more time to create more games and increase challenge kpis such as Number of gaming based applications building/built on Cardano, Number of fungible tokens made specifically for gaming and Number of gaming based content creators that have come to Cardano.\n\nThe proposal is also well sctructured contained most of the needed information. As suggestion, it could be brought here some benchmark with similar plataform, even if outside cardano (if exists), just to better exemplify the final deliverable here.\n", "q0r": 5, "q1": "There are 6 people already committed in the team with good developint competences and linkedin links, which seem to be enough to run this project successfully. As suggestion, I'd try just to briefly describe the individuals experience in the proposal, in a summarized way.\n\nThere's a sensible time-framed plan in place and with a beta version being launched first. I liked the project is divided into sprints. It would be good though to have identified here who are the main stakeholders to see who is going to be validate the feature developed at the end of each sprint. Budget details are clear, it could just be broken down in the sprints/roadmap.\n\nIn general, project seems feasible with a high chance of success.", "q1r": 5, "q2": "There are good time-framed KPIs with already defined targets. theres also very good milestones in the deliverable that will help to asses project progress during development phase. ", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 21, "ne": 4, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "Such a UI sounds valuable for the Cardano gaming ecosystem and the service will provide a backend relieve game developers from the details of minting and management.", "q0r": 5, "q1": "More technical details would be appreciated to gauge the ability of the team to execute this proposal. The team has many interrelated proposals which makes it difficult for CAs to understand the feasibility of the project. I suggest in future rounds that the team include the \"big technical picture\" within every proposal to help reviewers judge the feasibility.", "q1r": 3, "q2": "use of funds, deliverables, measurables, and timeline are included in sufficient detail. It should be easy to audit success/failure of each point. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 23, "ne": 0, "ng": 16, "nfo": 7, "vca_o": 1}, {"q0": "There are 15 minutes to go for the flash assessment round so I am writing this hastily.\nI think I am competent to assess this proposal for a challenge setting as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well.\nHowever, the proposal is also quite technical and I might be missing some important parts.\n\nAs far as I can understand it, the proposal wants to improve an existing NFT game engine called Revelar with support for dynamic minting of NFT's ingame. This sounds like a good idea which fits in the Gamers On-Chained challenge perfectly, because we need tools to help people make good games.\nThe proposer has added good metrics for success which I will try to cover in the sections below. I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team has added a lot of details about the members (their experience and previous accomplishments) and referenced them with LinkedIn pages. Their approach seems very sober to me: they have an acceptable breakdown of the budget (250 hours, $34/hour per each of the two developers, for the total of 8500, which is really not that much), but most importantly, they have a very good development timeline, which is measured in sprints (this tells me that the team has actually worked in software development before). They split their tasks properly into 4 sprints (2 weeks each) starting in March, with the delivery deadline set by 13 May 2022.\nThe only improvements I can suggest here are that you could have given more details about your existing NFT game called Duo, which looks similar to cards against humanity and I find to be a big plus to confidence about your current proposal and since you use sprints, it might be a good idea to prepare short presentations (in youtube videos maybe), after each sprint, with the deliverables. This would help auditability.\nWith the team's experience, sober approach and low amount of requested funds, I strongly agree that this proposal can feasibly be implemented.", "q1r": 5, "q2": "We have a timeline with goals for 3, 6 and 12 months (how many projects will use the tool and how many assets they will have) which can easily be tracked by the community. It would have been good to have a roadmap with the future of this tool you plan to build as well.\nSubmitting as the time for assessment is over. I strongly agree that this proposal is auditable.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 21, "ne": 9, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Créez une application web simple permettant à tout projet de gérer ses actifs NFT à l'aide d'un tableau de bord robuste pour plusieurs projets et utilisateurs.", "experience": "Une décennie en tant que fondateur et directeur technique d'une entreprise de technologie + pionnier de Plutus + Fonds 6 + aux côtés d'une équipe complète d'ingénieurs. (Voir ci-dessous)"}