{"id": 383915, "author": "jt.aussiegingersnap", "title": "Game Asset Image Embed [Revelar]", "url": "https://cardano.ideascale.com/a/dtd/383915-48088", "category": 26241, "amount": 11400, "description": "Il n'existe pas de moyen facile d'intégrer les images CNFT + les métadonnées sur les sites web dans un format standard simple.", "funded": 1, "upvotes": 74688803, "downvotes": 5454397, "votes_result": 69234406, "votes_cast": 194, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Although this proposal is breaching two worlds nfts and gaming, it definitely fits well inside this challenge. In my regards,the described solution could be a useful tool for the Cardano in the seemingly booming space of Gaming/Nft. ", "q0r": 4, "q1": "In terms of feasibility, the proposal is transparent by representing linkedin's of everyone involved from proposer to the working team behind it. And after a quick scoop this gives me strong confidence in their success, I think the team is capable of executing their drafted plan. \r\nThe proposal also has a very well structured and succinct description of their goals and timeframes as well as their explanation of their required funds. It also seems as if they have their mission of going through with this vision regardless of the support of project catalyst, which in my point of view is a strong point.\r\n", "q1r": 5, "q2": "In account of auditability, again I remark that they were succinct and provided a well paced roadmap which in my non-technical point of view seems achievable. Their kpi's are also very easy to verify as they progress through execution. And the application of their funds is also described. ", "q2r": 4, "assessor": "z_assessor_416", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "Since many games are developing via the web, such a feature for embedding NFTs into javascript could be very demanded.\r\n\r\nAlso, the dashboard for customization seems like a pleasant feature.\r\n\r\nAt the same time, I agree that we should follow the current leaders - open-sea and ETH  ecosystem to catch up. \r\n\r\nOn the other hand, it is not in perfect accordance with the challenge, because it is addressing rather game devs, than onboarding gamers to the blockchain. \r\n\r\nNevertheless, I find the idea interesting and it can improve the blockchain gaming industry.\r\n\r\nRating given 4.", "q0r": 4, "q1": "Based on the provided information and the detailed description of the team members, linked in profiles and working websites, I am confident that they can successfully implement the proposal.\r\n\r\nAlso, the timetable is provided, which is increasing the credibility of the proposer.\r\n\r\nRating given 5.\r\n", "q1r": 5, "q2": "The proposal contains a detailed timetable with subtasks, a roadmap for 12 months, and the estimated budget, and also an hourly rate.\r\n\r\nAll of this information is provided in sufficient detail allowing smooth audit procedures.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This is a pretty good proposition. It use the success from OpenSea and other Ethereum NFT marketplaces to create a rich API for NFT collection embeds in a Javascript Widget. This proposal covers the game asset image embed within the Revelar NFT Game Engine v1,  set a standard data stream and visualization of NFT's, collections, combinations, and more to be used in early web app account inventory dashboards for games.", "q0r": 4, "q1": "The plan is presented in a truly optimal way, there is a good chance that this proposal can be successfully implemented in the manner described by the proponents. The roadmap is well estimated in my opinion, the terms seem concrete, the team is well trained and multidisciplinary in the gaming area. The budget is clear and reasonable to achieve the objectives set, however it is not divided by areas (eg DevOps, Development, Design, Marketing, ..), doing this would certainly help to better outline the costs, perhaps even dividing them by phases.", "q1r": 4, "q2": "Everything is concise and to the point. The need is clear, implementation is already promising. There's enough information about the team and metrics which would help the effective tracking of their progress by the Project Catalyst community. \r\nI cannot access the website that was provided. (The time of my access is 12/12/2021). Overall, this is a very potential project, I hope it will be implemented successfully.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Utilisez le succès d'OpenSea et d'autres places de marché NFT en Ethereum pour créer une riche API pour les collections NFT intégrées dans un widget Javascript.", "experience": "Une décennie en tant que fondateur et directeur technique d'une entreprise de technologie + pionnier de Plutus + Fonds 6 + aux côtés d'une équipe complète d'ingénieurs. (Voir ci-dessous)"}