{"id": 385151, "author": "adosiawolf", "title": "market jetchicken NFT card game", "url": "https://cardano.ideascale.com/a/dtd/385151-48088", "category": 26241, "amount": 32000, "description": "jetchicken est un alignement pour le play-to-earn avec l'attrait d'attirer de nouveaux utilisateurs vers Cardano, mais créer une plus grande notoriété de la marque est coûteux", "funded": 1, "upvotes": 23704339, "downvotes": 15234185, "votes_result": 8470154, "votes_cast": 159, "f6_no_assessments": 11, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is asking for funds to market a CNFT trading card game that is in development which can be an important part of developing a successful game and as such, fits nicely into the challenge.", "q0r": 5, "q1": "The proposer mentions that they would be working with a professional cryptocurrency marketing firm, but they don't mention which one. Would recommend that they provide some more details to this regard. The information on the website for jet chickens is pretty sparse, there are some stats on the cards themselves and a way to buy, but there is no whitepaper about how the game works and it it difficult to see what the game is about and what it's progress is. The proposer includes their linkedin profile which is nice, but not really relevant since it is more important to know information on the marketing firm here. ", "q1r": 3, "q2": "The proposal breaks down how much of the funding would be used for marketing over a four month time period and specifies some KPIs to measure success. Again it would be good to know who the marketing firm is and what the intend to do", "q2r": 3, "assessor": "z_assessor_142", "no_vca": 21, "ne": 2, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement and solution for this proposal are not aligned with this fund challenge. Marketing are not the main focus of this challenge but instead, the main goal is to create a game/tool/dev kit. Moreover, how does funding marketing campaigns for jetchicken will benefit Cardano as a whole?", "q0r": 1, "q1": "The proposer provided evidence of relevant skills and experience needed to implement the project. The proposer also knows the required manpower and resources to successfully implement the project. Furthermore, this proposal provides a sensible and conductible plan for implementation. The budget presented is outlined clearly and broken down into identifiable terms. However, the budget requested are too high to achieve the set goals. In addition, the proposer fails to provide a risk management plan. What is your contingency plan if there are challenges along the way that requires additional funding?", "q1r": 2, "q2": "This proposal provided a roadmap with milestones and a time horizon for achievement. The proposer also provided key metrics and KPI that define the success of the proposal. The proposer also provided information on which platform the voters can use to keep track of their progress. \r\n", "q2r": 4, "assessor": "z_assessor_357", "no_vca": 23, "ne": 0, "ng": 12, "nfo": 11, "vca_o": 1}, {"q0": "Yes.  Marketing Jetchicken will bring awareness to first the game.  As new users learn about Jetchicken, it will be natural for them to learn a bit more about the general gaming ecosystem and opportunities on Cardano / Catalyst. ", "q0r": 5, "q1": "Proposer included links to both his LinkedIn and the Jetchickens' project itself.  Proposer seems to have a history of delivering value to the Cardano ecosystem as both an SPO and developer. ", "q1r": 5, "q2": "Yes.  This is a straightforward ask.  The proposer wants funds to market his game so that he can acquire users, which also brings users into the Cardano ecosystem.  He included the exact amount needed for marketing as well as success criteria. ", "q2r": 5, "assessor": "z_assessor_391", "no_vca": 20, "ne": 1, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "NFT-Games clearly help to onboard more users to cardano. I like the idea of a NFT card game. On the other hand it is actually not as clear on how this game will look like out of the proposal.", "q0r": 3, "q1": "Since the team has to hire marketing enterprises and they dont seem like they have any technical expertise it looks unlikely that the game will be produced. I would especially wish more technical details on this proposal. Also a clear roadmap and some more detailed success metrics would help.", "q1r": 1, "q2": "The whole proposal seems kind of superficial. It does not go into the detail and not everything is clear which makes it really hard to asses. ", "q2r": 2, "assessor": "z_assessor_41", "no_vca": 21, "ne": 0, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "It appears that this proposal is suggesting to hire an outside marketing firm to drive users to their NFT that they are selling. While getting gamers onboarded to cardano is well suited for this category it seems very vague and lacking in details how this marketing firm will make this happen.", "q0r": 3, "q1": "I think the goals of this proposal are very ambitious and is unlikely to reach their goals, I think if they can onboard 50% of their stated user adoption goals it will still be great for cardano gamers adoption. Therefore I still feel 3 stars is warranted despite the lack of information about how the proposal will work with the marketing firm.", "q1r": 3, "q2": "The thing holding this proposal back the most is the lack of a clearly defined roadmap with clear milestones and specific KPIs for each milestone. The proposal claims that after 2.5 months the marketing firm will help onboard 10k+ users I find that to be highly improbable, and would like to hear more details about how exactly that would happen, the NFT appears to cost 20 ADA to purchase in order to (presumably) play the game.\r\n\r\nSimply put, we need more information about how this marketing firm will approach this proposal of onboarding the users. i.e. which type of gamers are you targeting, and will the marketing be done via social media, or more tradional mediums?", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposer approach to attract adoption into Cardano ecosystem via game/play to earn ecosystem is a great idea. Although to request the high marketing fees / cost just for 1 specific project seems not effective", "q0r": 4, "q1": "Unfortunately A detailed plan or package by the SMM not given, as CA is very difficult to see if the package / or cost requested is relevant and/ or meet the industry standards. If the proposer at least mention a couple marketing firms that he intend to use, we can see a broader picture. ", "q1r": 2, "q2": "No detail audit or progress tracking provided, if we assume the proposer will get the updates from the marketing firm, it should be stated what the method being used. Including why 10k or 100k is being used as the benchmark of success?", "q2r": 2, "assessor": "z_assessor_646", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "It is hard to assess how much this game impacts Cardano system because there is no information about the game. \r\nTherefore, I think the problem is not within this challenge and the same as their solution of hiring marketing experts for helping the project. ", "q0r": 1, "q1": "There are a lot of things that we have to provide in the proposal for proving that the team can finish the project well and people in our community can trust them. For this project, I can give some examples like: the detailed roadmap or detailed activities in marketing that they will do; in addition, some information about their game development roadmap, hence we can assess that the marketing activities will help them; and key metrics also help CA to assess their estimation better for fair funding... \r\nThis proposal just shows not of them at all. So I rate for 1. ", "q1r": 1, "q2": "Definitely, success is clear and promising, but there is nothing about the project that can help us understand what it will become. \r\nMy recommendation for the proposer is that they should have a more detailed roadmap of their game, and marketing executive activities to support each phase of their roadmap, and again - key metrics to clear that they're going to align with and help to grow the Cardano ecosystem", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 20, "ne": 0, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "It would be good to develop a clear and concise description of the issue in the Problem Statement. It turns out that the problem is that few people know that this project exists and the solution would be to hire a company that will raise this brand and its product to the level where the products will be bought. Already, the project has a positive impact on the Cardano ecosystem. Definitely when the community would start buying NFTs it would add value to the Cardano ecosystem but also to the project itself. Proposer does not list KPIs in the proposal so it is impossible to compare KPIs with challenge setting and the proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "Through the links provided, Proposer proves his previous work, skills, knowledge and experience that was needed to bring the project to where it is now, but also for the future to come. The proposer in this proposal is exclusively looking for money for marketing without a clearer plan. So we have great crafted NFTs waiting for someone to buy them! And what now? All the information on Feasibility that the proposer should provide are missing. It would be good to connect with the Cardano community and find a common solution for this project.", "q1r": 2, "q2": "Proposer does not meet the criteria of Clarity and Auditability because it does not provide the required information. It would be good to connect with the Cardano community and find a solution and way out of this situation.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 16, "ne": 3, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "At this moment besides the site where you can buy cards I don't see how it will operate and what is the general idea behind this project. You can buy cards that can be played with? It is not clear to me at this stage. Would like to see more detailed explanation on the general idea behind this project. Help is requested for promotion purposes only, but I would like to see more about this project current state and what is planned. ", "q0r": 2, "q1": "For me it is difficult to asses if the project can succeed or not. There are no milestones explained. It is not clear what is the current state of the project and at what time it is planned to be finalized, released, promoted etc. ", "q1r": 2, "q2": "As mentioned there are no clear milestones presented and it is not possible to audit the progress of the project. Website for the game is available but it is lacking information on the progress and plan behind it. It would be difficult to asses the success of the project at this point. ", "q2r": 2, "assessor": "z_assessor_672", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The project unfortunately doesn't address the challenge in a way that is satisfactory. Would be ideal if the proposal is a little bit more fleshed out. ", "q0r": 2, "q1": "There's little experience to show that the project is going to be followed through to the end. The page shared for jetchicken only houses the landing page. It's quite sparse. ", "q1r": 1, "q2": "There's little to hold on to when it comes to the auditability of this project. Would be great if there's a roadmap to follow. One that inspires confidence of those interested in the project and users alike. ", "q2r": 1, "assessor": "z_assessor_700", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"q0": "Overall, this proposal addresses the challenge posed. Gamers no longer spend time and money on video games in vain. Instead, they can profit in the long run from playing the game.", "q0r": 4, "q1": "The proposer has a detailed plan, job description in each specific timeline.\r\nHave experience working, partnering with a company with extensive experience in promoting crypto initiatives", "q1r": 4, "q2": "Requires a budget of 32,000 dollars, besides hiring an advertising agency, what is the rest of the money going to be used for?\r\nIn the proposal, the description of the game is not mentioned. Need more clarification on Play To Earn.\r\nI have visited the website, however there is a fee to register. There should be a trial play feature, so that users can experience.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}], "solution": "faire appel à une société professionnelle de marketing des crypto-monnaies pour vous aider à créer du contenu et à promouvoir le contenu payant afin d'accroître la notoriété de la marque.", "experience": "marketing ad-tech, développement de projets - nous travaillons avec une société de marketing chevronnée ayant une grande expérience de la promotion des initiatives cryptographiques."}