{"id": 366744, "author": "", "title": "Filamint - 3D Printable NFTs", "url": "https://cardano.ideascale.com/a/dtd/366744-48088", "category": 26115, "amount": 80000, "description": "3Dモデラーは、作成した資産の物理的な供給や知的財産に対して最小限のコントロールしかできない", "f6_no_assessments": 8, "f6_rating": 4.208333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The NFT technology applies well to the context of art. The 3D art is growing therefore it is important to regulate it. The 3D printer are also digital addicted by definition and this is why I like this Proposal. It could work very well. ", "q0r": 5, "q1": "I think the experience of the team is important and I can feel the passion they have put into the field of 3D art. The Plan is in line with what they are declairing. The fund rising instead seems very high. \r\nMy suggestion is to split the idea in a pilot scenario and a target scenario in order to collect feedback from the market", "q1r": 4, "q2": "The information provided is explained well but it is missing the identification of KPI that allow us to verify the status update of the proposal. ", "q2r": 3, "assessor": "z_assessor_303", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal indeed suggests a novel and interesting use-case, which bridges the gap between the real and the digital world in the context of 3d-printed assets. This novel idea opens up new business opportunities, where creators of 3d models can be rewarded for their efforts and can sell either their models or limited supplies of their creations. This has the potential to attract users from a new niche, and opens the door to exploration of how the blockchain interacts with real-world assets. The proposal includes both technical objectives as well as marketing ones, which is essential for adoption, and a great plus to this proposal.", "q0r": 5, "q1": "The plan is clearly laid out. I consider the timelines optimistic, but they are definitely doable by a team that is  experimented and dedicated. The team seems indeed to have most of the technical skills required, though I couldn't find prior experience related to smart contracts or NFT-related development. However as a software developer myself, I know that isn't a roadblock and can be picked up easily to develop at least the first version of this system. ", "q1r": 4, "q2": "My main concern is that the proposers do not address risks and challenges - 3d printing is not always an exact science, and surely a lot of details with how the real asset interacts with the blockchain element will need to be tweaked. Regardless, the proposal proposes measurable, specific goals on the tech and marketing roadmap.", "q2r": 4, "assessor": "z_assessor_318", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": " The proposal attempts to merge two growing markets, NFTs markets and 3D printable models. As a member of\r\n   the 3D printing community I am personally excited for a dApp which allows creators to monetize and\r\n   distribute 3D models. The proposal offers a unique approach to hosting 3D model repositories and a\r\n   mechanism for creators to easily craft and monetize their work. This proposal builds off the current NFT craze to access a,\r\n   relatively, untapped market for the 3D printing community. The proposed dApp shows promise to attract\r\n   people with 3D printers to the Cardano ecosystem. ", "q0r": 4, "q1": "The proposal is very repetitive, it continuously makes claims about what the dApp will be capable of but doesn't offer insights to how the team will achieve them.\r\n - How will the 3D model data be stored? on-chain or Off-chain? Many detailed 3D models are gigabytes in  size and require multiple parts. The proposal does not offer an answer to how or where the data will be stored? centralized or decentralized storage? \r\n- What off-chain or on-chain mechanism will be utilized to prevent multiple NFTs from representing the same 3D model\r\n     - A block explorer can verify that a smart contract \r\n       only minted a single instance of an NFT, but \r\n       doesn't prevent other smart contracts from minting \r\n       a different NFT to represent the same\r\n       metadata (i.e. 3D model).\r\n     - Is there a plan to prevent other NFTs from \r\n        representing the same model? Such as an off chain \r\n        algorithm that combs through the off-chain \r\n        database to identify NFTs that represent the \r\n        same/similar models or only listing NFTs that were \r\n        minted with the project's NFT minting solution. So \r\n       that it the dApp can verify that each listed NFT \r\n        represents a unique 3D model.\r\n- Much of the data that specifies how to print the model (i.e. nozzle temperature and size, print bed temperature and size, different materials, SLA vs FMD printer etc.) differs for each 3D printer. How will the dApp handle print details which differs for different 3D printers?\r\n   - Once a \"user\" of the dApp gets the 3D models from \r\n      the off-chain database, (I am assuming that the \r\n      cad/slicer models will not be stored on-chain -> too \r\n      expensive) what is preventing the \"user\" from\r\n      sending multiple copies of the model to their 3D \r\n      printer. How will the dApps enforce the \"pay-per- \r\n      print\" mechanism. \r\n- How would the dApps limit the quantity of 3D prints of a specific model, without relinquishing control of the 3D model data? Once the user is given the data necessary to 3D print the model, how can the user be prevented from printing unlimited copies?\r\n\r\nBecause the proposal does not seems to acknowledge many of these concerns it is not clear how or if the team has the capability to complete the dApp. ", "q1r": 1, "q2": "Much of the milestones offered by the proposal are definitive and can be used to measure the progress of the team.  Hopefully the team behind this proposal will make the milestone data available to everyone. \r\n\r\nThe proposal seems to have a well defined metrics for measuring their success.  I believe it will be very possible to audit the progress and success of the proposal. ", "q2r": 4, "assessor": "z_assessor_338", "no_vca": 12, "ne": 7, "ng": 3, "nfo": 2, "vca_o": 2, "reply": "I would like to make a defense of the feasability score for this review. This CA obviously has extensive knowledge of crypto and 3d printing tech... This is probabily one of the best reviews we have recieved. That being said I don't think its entirely fair to expect a full breakdown of feasability when our proposal was already one of the longest in its category. In a situation where the average person voting on these proposals may not have technical knowledge you are forced to make choices on how to paint the picture so people can understand quickly. I apologize if this proposal fell short in the keen eyes of an experienced developer. Just because we did not include everything does not mean we aren't spending long hours thinking about how to solve these problems. We have idenetified a majority (if not all) of these problems and are already working on ways to solve them. Honestly I would love to talk to this CA and see what he/she thinks about some of our solutions."}, {"q0": "This is a very promising proposal. It has a significant potential to grow cardano's user-base, network-utility and network-value. The application suite proposed is a fantastic combination of the NFT concept and the cardano network and has all the necessary requirements to attract all the 3D printing enthusiasts. It has clear and measurable goals, the budget is pretty reasonable and it seems to have the capacity to attract the community interest and engagement. The plan set out is quite clear on how they plan to add value to the cardano ecosystem and the milestones are aligned with the objectives of the campaign.\r\n\r\n\r\n\r\n\r\n\r\n", "q0r": 5, "q1": "This proposal is very likely to be successful based on the definition of success set out in the plan. The team is experienced and has the necessary knowledge to implement the idea. The budget not only is broken down into very clear items but also has a reasonable estimation for each one of them. The milestones are very realistic and feasible. The only point I would add is a deeper thought on the unexpected challenges that could arise during the project and what alternatives the team would invest to overcome them.", "q1r": 5, "q2": "The information provided is sufficient to audit the progress of the team. Even though it is not extremely detailed about the entire roadmap, there's a good amount of milestones with clear metrics for each of them. A good idea would be to prepare some presentations mid-journey to show how current progress is compared to what was planned. But again, the KPIs are very clear and aligned with the definition of success which in turn presents a good understanding of the targeted problem.", "q2r": 4, "assessor": "z_assessor_341", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is offering protection to Intellectual Property in 3D printing through NFT. However, it goes more in the direction of making 3D printing less accessible and less democratic. It's of course important to protect Intellectual Property and give value to the work done by 3D makers. However, controlling every piece printed does not counter the problem of piracy (as the NFT and art market have proved s far) and moves the market to more oligarchic models. Therefore, it is questionable that the proposal effectively addresses the challenge and will disrupt the 3D printing market.", "q0r": 3, "q1": "The team has experience in the market of 3D printed and seems to be business-oriented. There's a clear plan and clear goals. However, it's a too-small team to execute all the steps and the huge amount of work described in this proposal. And the proposal does not give any contingency plan in the case that users/makers simply do not see an advantage in \"regulating\" the 3D printing market. If there are not users enough in the platform, would it at least leave a legacy to the industry or it does not change anything at all?", "q1r": 3, "q2": "The proposal is well structured and detailed in a way that the progress can be audited. However, the required budget is not reasonable. In special, because it is an audacious task to build the entire platform with 5000 active users, in one year and in a team of two persons. It would be too risk to invest such amount of money, considering the chances of failing and delays.\r\n", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is a very unique way to approach the concept of a NFT, and utilizes the blockchain issued NFT to tie the digital world to the physical, or vice versa. This makes blockchain the \"glue\" of our economy. 3D printing is an obvious next step in manufacturing as far as physical products goes, and NFTs will be a large part of this space.", "q0r": 5, "q1": "This proposal is likely to succeed based on the merits of the team proposing it and thee vast depth of their respective backgrounds. ", "q1r": 5, "q2": "The road map is incredibly well laid out, thoughtful and easy to measure quantitatively in plain terms with no ambiguity. Voters should feel comforted knowing this will be clear as day weather the team succeeded or not.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "I think this is a fantastic idea to bridge and start NFT marketplace. Relevant experience is detailed and the roadmaps has great metrics.", "q0r": 5, "q1": "The roadmap appears to be well thought out and the product \"Filamint\" pretty cool name for the 3D printing connection with blockchain technology to create scarcity and ownership.", "q1r": 5, "q2": "The overall plan seams well established, the funds are reasonable per intended use and the timeline well designed.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "This proposal addresses the challenge quite well also in the context of all 3D designs and visualisations that requires physical realisation.\r\nThe marketplace recommended to serve as some kind of \"certification\" hub as well.\r\nStoring of the native files - IPFS or centralised?", "q0r": 5, "q1": "Very likely - with clear deliverables and timelines.\r\nTokenomics re scarcity might add value and more buy-in for success.", "q1r": 4, "q2": "Although metrics quite clear - would be good to releasd basic functionality after month 2.5 as value gap between month 1 and 4 too big -especially out of blocks.\r\nAs much as youtube can help with marketing, selling and education - metrics and effort should be added on streamlining the core processes of ensuring that the essence of the challenge is optimised and made user friendly.", "q2r": 5, "assessor": "z_assessor_633", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Cardano NFT技術を用いて、物理的な供給をコントロールし、IPを保護する3Dプリント・ユーティリティー・スイートを作成することで、3Dモデラーを惹きつける。", "experience": "6年 3Dモデリング/プリンティング\n\nC++、Java、HTTP、CSS、PHPを合わせて30年\n\nYouTubeチャンネルで25万ドルを獲得\n\nCS、EE、BMの理学士号"}