{"id": 369701, "author": "", "title": "Real NFT-Gallery & voting tool", "url": "https://cardano.ideascale.com/a/dtd/369701-48088", "category": 26115, "amount": 25000, "description": "Art-NFTは仮想的にしか存在せず、そのアートは容易には展示できないし、ネイティブな資産として、アーティストには販売以外の収益は存在しない。", "f6_no_assessments": 7, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "A simple and elegant idea that shifts the paradigm of the traditional art gallery and gives profits back to artists. As more and more digital art is produced, \"showing\" digital art will quickly become an important part of any gallery's exhibition plan. In terms of addressing the campaign brief, there are no hard numbers in the proposal, however form some quick googling \"In 2017, 24% of the U.S. adult population had visited a museum or art gallery in the previous year\", indicating a sizable potential audience that could be onboarded to Cardano", "q0r": 4, "q1": "The technical aspect of this is highly likely to be successful, given the experience of the proposer. The challenge will come from finding a venue, gathering a suitably diverse and famous array of digital art and then marketing it well. 3 months to do the three key non-technical aspects of this project is aggressive and suggest pushing this out to at least 6 months. A second key would be to find someone experience in the art world to assist with the 3 non-technical tasks above.", "q1r": 3, "q2": "There are some high level goals that can be audited however more specifics around number of galleries, desired number of pieces of digital art would be helpful to audit progress against.", "q2r": 3, "assessor": "z_assessor_275", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal lives up to the NFT challenge and it is an interesting idea.", "q0r": 4, "q1": "From the development point of view there is a sufficient experience shown in the proposal. From other perspective, like setting up the gallery and coordinating the whole process to keep the gallery running in Berlin, experience isn't shown. Also what would be beneficial to show how the gallery costs will be covered with some more detailed breakdown. Please consider expanding the planning and financial breakdown.\r\n", "q1r": 2, "q2": "I think the proposal is great. That the project goes alive, probably some more detailed project plan would be necessary. Maybe also to consider step by step building, starting e.g. with online gallery only and if there is enough interest expand to live also. Development audibility could be tracked, indicators might be a tough topic. It would be also useful to think about how much would people pay for such a voting and what would be the return of interest time.", "q2r": 2, "assessor": "z_assessor_33", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal's problem solution is about tokenizing event or admission ticket and create a voting platform with it. The objectives are aligned with the challenge which is to create a NFT business model which are non-art use case. This platform will be useful for event organizers to gather data from customers by using the voting features and also save the environment by reducing the use of paper.  Therefore I believe it will attract a lot of new users thus adding great value to Cardano. However, the proposer did not provide any information on how to scale the platform to millions of users outside of Berlin or even Germany. Does this platform is open source and free to be used by everyone or it is exclusive for your team members?", "q0r": 3, "q1": "The proposer doesn't provide any verifiable credentials of the team members. Teams that are anonymous has low rate of successful implementation of the project. Provide a link to your profile so that the community can verify you have the skills and experience needed to execute the project. Furthermore, there is no detail breakdown on the manpower and resources required to implement the project. Moreover, there is no detail breakdown on the budget. Provide the community with information on how would that 10k USD be used for plutus and voting app development? For example, 2k USD per month for developers salary x 5months = 10k USD. In addition, there is no information on what the risks and challenges that the proposers might face in the future during the development of the project. What will be the plan if additional funding is required?", "q1r": 2, "q2": "This proposal has a clear roadmap however there is no method provided for the community to keep track of the project progress. Please provide a medium for the community to receive update on the project. Also provide the team members profile so the community will know who is accountable for the project.", "q2r": 2, "assessor": "z_assessor_357", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "You can make an argument that displaying NFTs in a gallery does have NFTs at the core of its business, the proposal will provide off-chain exposure for the Cardano ecosystem and payments are done in ADA. I would like the team to think about how they can scale this concept so it can reach thousands of people.  ", "q0r": 3, "q1": "I like the idea but the proposal requires further development to ensure successful implementation. I would want to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "The proposal has a simple roadmap and budget.  I would like to see the team further develop and define Key Performance Indicators (KPI's) for the project, then connect the KPIs to the milestones on the project roadmap. I would like the team to connect the KPI's and roadmap milestones to project spending, what are the specific tasks and deliverables that the labor must provide and when must they deliver – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the labor spending, by connecting the KPI's and roadmap milestones to the budget, the team can track performance and spending over time.  As the project stands at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "The cool concept in giving NFT's more accessibility and publicity to crypto. The voting tool is additionally a perfect combination for this. I would love to have voting tools in museums cause I always leave the museum with a feeling that I am missing something for feedback. Given the cool concept and seeing all the other proposals I do feel this proposal is missing that extra touch. I would've like to see the amount of art you would host in the gallery.  ", "q0r": 3, "q1": "The briefing of the proposal is short but effective to a certain level. There are missing some details that are needed to assess this. You say you successfully launched an NFT-project but give no reference to this. You state that you need a team to be recruited which is a good sign seeing that you know you can't do this alone and lack relevant skills to fully complete the project, but I can't find how many members you wish to attract and with what relevant skills. The budget plan is asking for relatively large funds but they are not explained in detail. It would've been better if you had given an hourly rate on the development cost or the number of developers you wish to recruit. For marketing, this seems like a good amount needed since Berlin is an expensive city but a little more breakdown would've surely helped to justify the amount.", "q1r": 2, "q2": "For auditability has a clear plan. Milestones are clearly given within doable time windows. Although finding a gallery that is free within 6months seems a bit far-fetched in Berlin? As I stated early the budget breakdown could've used a bit more detail, this makes it clearer for audit. The solution for the proposal is well described and leaves no room for error. We know what to expect from the proposal. On a last note I want to say the proposal looks promising and if it won't get a funding this round I would gladly see it back the next round with more details.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "For the NFT challenge brief, \"sustainably growing Cardano's user-base\" - this proposal would limit the impact to a regional area (Berlin) and rely on footfall traffic. I therefore 'disagree' that this effectively addresses the challenge and see no scope for scale. \r\nMy advice: this is a business idea that could be tested small-scale with a pop-up gallery and attract a niche audience. This does not qualify for Catalyst funding. ", "q0r": 2, "q1": "I strongly disagree that this proposal will be successful in its impact. There is no information given on expected revenue, anticipated audience size or recurring customers. The proposer is part of Plutus Pioneers and lists a 'successful NFT launch' but does not give references or any evidence of capabilities. Team hiring is mentioned, but requirements or costs are not provided. ", "q1r": 1, "q2": "I strongly disagree that there is enough evidence to audit this proposal. There's no roadmap, no indication of scale or success KPIs. The amounts requested seem arbitrary and unreasonable for their allocations. \r\nThe 3- 6- and 12- month milestones are very vague and do not seem thought through. ", "q2r": 1, "assessor": "z_assessor_510", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "A unique idea to physically display NFTs in a art gallery this proposal looks promising ", "q0r": 4, "q1": "The idea is great but at this point in time it is just an idea, the team has not been developed and will do so upon receiving funds. More development and commitment to the task I feel is needed. ", "q1r": 3, "q2": "The information provided is in its infancy at this point in time and although it is a great idea more details and development would be welcomed ", "q2r": 3, "assessor": "z_assessor_523", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "私たちは、NFTホルダーとアーティストが、来場者の投票によって報酬（ADA）を得ることができる、ベルリン、オンライン、その他の都市における最初のカルダノNFTギャラリーとなります。", "experience": "私はPlutus Pioneer Dev Cohort 2で、4月にCardanoでNFT-projectを成功させました。残りのメンバーはこれから募集します。"}