{"id": 369978, "author": "", "title": "Community Bond -Loyalty Rewards", "url": "https://cardano.ideascale.com/a/dtd/369978-48088", "category": 26115, "amount": 10000, "description": "すべてのローカルなものをつなぐ。バーチャルコインを使ったデジタルプラットフォームで、ローカルビジネスやコミュニティのロイヤリティ向上を支援します。", "f6_no_assessments": 7, "f6_rating": 1.2857142857142858, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers have a social business product they want to build and have added a document to the attachments. They have submitted the same thing into 6 categories, all with the same limited information and most with the same text. This document doesn't even mention Cardano, blockchain or NFT's. Please apply with a project which explains how your product fits with Cardano and how it addresses the challenge.\r\nThis proposer has proposed or co-proposed a number of other project with little details and/or funding requests such as:\r\nPharo ACM - $1\r\ndRisk - $5\r\nProof of Insurance - no details\r\ncommunitybond.io Integrate- no details\r\nCommunity Bond - Metadata - no details\r\nTrade Finance and Credit Insurance - minimal details\r\nEndangered Language Preservation - no details\r\nLocating Culture - no details\r\nNAGchi - no details\r\nNAGchi Cares - no details", "q0r": 1, "q1": "There is no plan on what will actually be made and how it addresses the challenge of NFT business models. Please provide a project plan on what you will produce and what the funds will be used for.", "q1r": 1, "q2": "\r\nThere is no detailed plan of what the funds will be used to produce which can be assessed against. Thus progress and success cannot be measured. It is not clear what, if anything has already been built.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "the proposal does not address the challenge. to be sure, i looked at the attachment and the website more closely and cannot see any connection to nft`s. this proposal is better off in a different cathegory for fund 7. the challenge in this cathegory is to make a global impact with NFT`s. \"bond\" focuses on local impacts. this is also visible in the number of downloads of the app (500+).", "q0r": 1, "q1": "the feasibility cannot be understood because it was not stated exactly what the proposal would accomplish. the 8 bullet points should be filled in with more details. the requested costs should be divided among the points and provided with checkpoints so voters understand how the $10k breaks down.", "q1r": 2, "q2": "a timeline and milestones are not described and should be mentioned in the next proposal. also possible risks should be considered. ", "q2r": 1, "assessor": "z_assessor_260", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very short and lacks detail, thus it is hard to judge if the proposal addressed the challenge. I would like the team to rework the proposal to show how NFTs will be at the core of the business model and demonstrate how the proposal will deliver value to the Cardano ecosystem.", "q0r": 1, "q1": "I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". I would like the team to further expand on the plan to go to market. – how will the team recruit users for the platform. ", "q1r": 2, "q2": "The proposal has no roadmap and single line budget. I would like to see the team develop Key Performance Indicators (KPI's) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline). I would like to see the team create a solid roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond a single line entry and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 9, "ne": 4, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "A problem hasn't been defined in the problem statement. The proposal doesn't show a relationship with the challenge.\r\n\r\nThe same proposal was submitted in 5 different challenges.\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-CRM-for-SME-s/369180-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-CRM-tool-for-SME/369960-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Bond-Connecting-entrepreneurs/369964-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-Metadata/369982-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-Loyalty-Rewards/369978-48088\r\n\r\nA generic plan was presented and not compatible with the Catalyst proposals, there is no mention of Cardano, how and why blockchain technology will be used in the project. I believe that the plan in the attachment was not created for Catalyst.\r\n\r\nHow can 5 identical proposals have different budgets?\r\n\r\nProposals in Catalyst need to be created in the context of the challenge they are allocated. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage. ", "q0r": 1, "q1": "The same proposal was submitted in 5 different challenges.\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-CRM-for-SME-s/369180-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-CRM-tool-for-SME/369960-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Bond-Connecting-entrepreneurs/369964-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-Metadata/369982-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-Loyalty-Rewards/369978-48088\r\n\r\nA generic plan was presented and not compatible with the Catalyst proposals, there is no mention of Cardano, how and why blockchain technology will be used in the project. I believe that the plan in the attachment was not created for Catalyst.\r\n\r\nHow can 5 identical proposals have different budgets?\r\n\r\nProposals in Catalyst need to be created in the context of the challenge they are allocated. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage. ", "q1r": 1, "q2": "The same proposal was submitted in 5 different challenges.\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-CRM-for-SME-s/369180-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-CRM-tool-for-SME/369960-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Bond-Connecting-entrepreneurs/369964-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-Metadata/369982-48088\r\n\r\nhttps://cardano.ideascale.com/a/dtd/Community-Bond-Loyalty-Rewards/369978-48088\r\n\r\nA generic plan was presented and not compatible with the Catalyst proposals, there is no mention of Cardano, how and why blockchain technology will be used in the project. I believe that the plan in the attachment was not created for Catalyst.\r\n\r\nHow can 5 identical proposals have different budgets?\r\n\r\nProposals in Catalyst need to be created in the context of the challenge they are allocated. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage. ", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal seems incomplete as the proposal text mainly consists of Bullet points looking like placeholders for more detailed descriptions. Unfortunately this makes the proposal ineligible for funding.", "q0r": 1, "q1": "As noted, the proposal is incomplete, so it seems the proposers do not have the capacity to finish the proposal.", "q1r": 1, "q2": "No metrics and plan are presented, so the proposal cannot be audited.", "q2r": 1, "assessor": "z_assessor_52", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I love the idea of utilizing NFT's to allow small local businesses to create loyalty programs, but this proposal doesn't state in real terms how to make that happen, and this proposal itself is crucially lacking in information of how it is going to get there.", "q0r": 3, "q1": "The proposal makes it difficult for me to say with any degree of confidence that it will be successful, mainly because we don't know exactly what successful looks like until we get some more information about the roadmap, and some KPIs to measure.\r\n", "q1r": 2, "q2": "I'm not sure if this proposal was unfinished but it does not include a roadmap, KPIs for roadmap milestones or any kind of quantifiable measure of how to determine if this proposal is a success or not.\r\n\r\nFrom the website I gather the vision of the proposer, but without a concrete roadmap it is simply too difficult to measure the result of this proposal, should it get funded. I cannot rate it any higher than this until we get a proper roadmap.\r\n\r\nFor example: I see that you have the app in the app store already, you should definitely mention this to the voters as it helps show how credible and serious you are about this proposal. From there, you could create some exact KPIs you would like to reach and create a roadmap to reach those KPIs. This is what voters and project catalyst would like to see in order to help you be as successful as possible in the next funding round.", "q2r": 2, "assessor": "z_assessor_577", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has been submitted multiple times with all of the same info in each proposal. NONE of the proposals hold any information that helps us asses this proposal. The only information here is a website, and the problem they seek to solve.", "q0r": 1, "q1": "This proposal has been submitted multiple times with all of the same info in each proposal. NONE of the proposals hold any information that helps us asses this proposal. The only information here is a website, and the problem they seek to solve.", "q1r": 1, "q2": "This proposal has been submitted multiple times with all of the same info in each proposal. NONE of the proposals hold any information that helps us asses this proposal. The only information here is a website, and the problem they seek to solve.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "中小企業や地元企業では、顧客ロイヤルティやマーケティングを管理するためのリソース、スキル、時間が限られています。Bondはそれを自動化します。", "experience": "\\+ スタートアップ、プラットフォーム、マーケットプレイスでの15年以上の経験。ソーシャルメディアをはじめとする海外でのマーケティング経験"}