{"id": 369769, "author": "", "title": "Logosphere - Cell Level Security", "url": "https://cardano.ideascale.com/a/dtd/369769-48088", "category": 26107, "amount": 33000, "description": "ドキュメント内のフィールドの中には、プライバシーに配慮して、非表示にしたり制限したりする必要があるものがあります。これをフィールドレベルで実装するのは困難な作業です", "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a really nice use case which combines immutable blockchain and data and encryption to provide  differencing levels of access to part of single documents. It is well described and would be a lovely product to have integrated to the Cardano ecosystem providing powerful functionality for smart contracts.", "q0r": 5, "q1": "The proposers provided evidence of extensive experience required to develop this product. They have provided a detailed plan with milestones. It would be nice to see the budget aligned with those, however it is a well thought out and communicated proposal. It would be nice to see some more discussion on their marketing plan. How do they expect to get people to use the product and how are they going to commercialise it?", "q1r": 4, "q2": "The plan is well segmented over time allowing progress to be measured. A number of KPI's have been identified. It would be nice if the proposers put goals on those KPI's however. Its hard to measure success unless you have a target to reference performance against.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "An excellent, well formulated proposal that adresses the issue of privacy and compartimentalisation of (meta-)data which is an important issue in digitalisation and also overlaps with the DID topic.", "q0r": 5, "q1": "A well written plan and a very transparent tram of proposers that clearly has the capability to successfully enact this proposal.", "q1r": 5, "q2": "The comprehensive, detailed milestones and the KPIs make auditing of the realisation process quite doable. Plenty of contacts are abailable to aid in this process.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is incredibly unique and necessary part of what might be thought of as a \"trusted sidechain layer\"  that runs along side Cardano network itself, this proposal could actually prove to be pretty groundbreaking as it makes data sharing between the dApp ecosystem standardize and seamless.\r\n\r\nThere is no need for every Cardano dApp to build it's own storage solution siloed off from one another.\r\n\r\nIt's difficult to overstate how much of an impact this proposal could have on the entire Cardano ecosystem, if successful. This could send waves through the entire Cardano dApp ecosystem as it would allow disparate siloed dApps to access off-chain data in a standardised and trusted way. Much like they can already can do when accessing on-chain data.", "q0r": 5, "q1": "After looking back at their fund 5 proposal, it is clear the team has taken steps to refine their proposal. I have personal interest in the Fluree-React library that they are proposing as a web developer myself we find tools like this incredibly empowering, and will be a massive win for Cardano dApps to have a sidechain layer capable of storing large amounts of data as our dApp ecosystem gets built, out having Fluree right there waiting will be crucial to this ecosystems growth and I feel like this team is ready to take this up this important mantle and carry it for all of Cardano.", "q1r": 5, "q2": "The roadmap is detailed, with accompanying KPIs - though I would like to see specific target numbers to help the voters/catalyst measure exactly how successful the proposal was.\r\n\r\nThat being said, the team has presented a very logical and reasonable roadmap, and the budget in my view is very reasonable as well, considering what the team is attempting to acomplish.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "while by all appearances and off-chain solution I'm sure that metadata plays a role in the on-chain aspects of the project.  The idea is a signing and verification solution that controls permissions on a field-by-field basis. As such it seems to fit within the scope of the metadata challenge. Eventually SPOs will host these decentralized services.", "q0r": 5, "q1": "The team appears highly qualified and will leverage the Fluree team in a partnership. The roadmap is divided into three stages which have clearly defined goals. the quality of the proposal gives me confidence in the team's ability to execute. ", "q1r": 5, "q2": "detailed goals or definitions of success are provided for the three main project stages. Provided key performance indicators are meaningful and easy to measure. Analysis of ROI should be straightforward.", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "FlureeデータセントリックセルレベルセキュリティとSmart Functionsを使用して、dAppsとそのユーザーの間で共有されるオフチェーンデータを保護します。", "experience": "\\- Dmitri Safine: ex-Amazon\n\n\\- Manik Jain: ex-Tata Consultancy Services Ltd.\n\n\\+ 4名のSr.ソフトウェアエンジニア（元F500企業"}