{"id": 400986, "author": "titan", "title": "Bayes Spam filter for vCAs", "url": "https://cardano.ideascale.com/a/dtd/400986-48088", "category": 26447, "amount": 32000, "description": "Fund 7 had a unmanageable sea of CA reviews rendering vCAs filtering work a heavy burden", "funded": 0, "upvotes": 13989978, "downvotes": 18131481, "votes_result": 4141503, "votes_cast": 89, "f6_no_assessments": 5, "f6_rating": 1.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1083, "q0": "This is a challenge about auditing successfully funded proposals to ensure a ROI to the community. It is not about CA and vCA work. As such, even though it is correct about a problem that is in need to a quickly built solution, it is basically irrelevant to the challenge. Ironically, it also takes up CA and vCA time when plainly incomplete proposals such as this one are not cleared out of the system before the assessment phase begins.", "q0r": 1, "q1": "The proposer requests $32,000 without laying out a budget plan. The proposer notes that there is a need to assemble a development team but hasn't done so. The proposer cites a PhD in theoretical physics as relevant to leveraging spam filter technology. While sometimes it does indeed seem that spam burdens are so massive that they might bend spacetime, there remains nothing here that signals that this proposal might be implemented successfully. The work just hasn't been done.", "q1r": 1, "q2": "What's provided in the auditibility section is not much at all. As noted before, this proposal is simply incomplete. Next time, the proposer should categorize their next proposal correctly and fill out the form with all the needed details.", "q2r": 1, "assessor": "z_assessor_1275", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 1345, "q0": "The project tries to create a tool that can help vCA spam filter. With my understanding of the proposal, the proposer tries to create a Bayes model as a spam filter. If implemented successfully this would be a valuable tool to the vCA. However, the proposal does not provide much crucial information that made me doubt the execution of the proposal. The proposal does not provide any potential risks that can hinder their proposed solution. Whereas there's a risk associated with the project, how if the Bayes model overfit the training set and does not perform well on production? What if there is an unexpected cost? etc.", "q0r": 2, "q1": "The proposal does not have milestones or a roadmap. It would be best if the community know the specific deliverables that constitute a whole project, thus can easily track where the progress of the project currently sits. It can be written such as deliverables 1 on the first two weeks, deliverables 2 on the next following month, deliverables 3 on the next 3 weeks, etc. The proposal just state ‘TBA’ on budget information and does not give any further information. It can get much better if the budget is broken down into detailed information. For example, 20K$ remuneration for the developer, 5K$ for rent cloud service to train the naive Bayes model, etc. The proposal does not give any personal information like background or experience for the members, or even the full name of the proposer. It would be much better if the proposal also provides a concise background and relevant experience of any team member needed, and also gave a LinkedIn profile. A LinkedIn profile or other online presence made the community easily verify they are giving funds to a legitimate person.", "q1r": 1, "q2": "The metric/measure for progress is not clearly explained. For example, is there a GitHub repository that made the community can track development progress? Is there any kind of dedicated report so others can evaluate the project execution? The proposal also doesn't provide any deliverables that can be objectively valued are successful or not. Indicators for success are defined but are ambiguous, too short, and not details enough. For example, does working on localhost\n for the proposer itself constitute ‘online’? How many users use the tools to be considered successful?", "q2r": 1, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6527, "q0": "The problem identified makes sense and has been a big one. I, as a \"vCA\" have noticed that the large amount of assessments and attempts to abuse the review model have caused problems. The similarity filter has been an important add-on tool, but I see room for more complex options. The problem is that it was not well explained how the spam filter will work, which makes it difficult to understand the impact of the proposal. I see that this proposal would be more in line with the challenge of Community Advisor Improvements.\n\nThe proposal is still a draft. Metrics/KPIs were not included to make the impact assessment clearer.", "q0r": 2, "q1": "The proposal is a draft, it does not have a concrete plan and because of this it is difficult to assess whether the proposer's experience is relevant. It is unclear whether the proposer is also a CA/vCA which would indicate more feasibility. There is no budget breakdown, there is no delivery timeline.", "q1r": 1, "q2": "There is clarity in the problem presented in the proposal, but there is no clarity in which type of solution will be created, the spam filter is still a vague concept and needs more rationale to be understandable. There is no plan with milestones, clear deliverables, metrics, KPIs or budget breakdown, which causes a negative impact on the auditability assessment.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6673, "q0": "The challenge brief provides clearly articulated boundaries. It is focussed on funded proposals. This proposal, unfortunately,  is in the wrong challenge as its main aim is to support the vCA process.\nTwo separate community members have left comments in the past week recommending the proposer to move it to a more appropriate challenge (CA improvements). For this reason I am forced to give this a 1 star rating.\nIn terms of the idea, the proposer could be onto something here. An addition tool to support the QA process in Catalyst is very welcome. It just needs clearly articulating & simplifying into language that’s others in the community can digest. Look forward to seeing this idea fleshed out in the next Fund ", "q0r": 1, "q1": "As per the comments in the 1st criteria I can only give this 1 star.\nEven if it were in the right challenge it still needs a lot of work to get it up to speed.\nThere is no plan, deliverables, budget, details of resources or skills required.", "q1r": 1, "q2": "As per the comments in the 1st criteria I can only give this 1 star.\nMy main recommendation to the proposer is to reach out to the vCA community to understand the root causes of what happened in Fund7, test their idea (Bayes filter) out on Fund 5, 6 and possibly Fund 8 assessments. This will help to confirm to the proposer that this is worth pursuing and can they return in Fund 9 with a tangible plan, including any tools they might want to build. ", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9841, "q0": "The proposal does not meet the challenge, ie auditing of funded proposals. I am in agreement with the comments given by the other community members that this proposal is best suited in the CA improvement challenge. However, the topic feels like it could be a really useful addition to the assessment process.", "q0r": 1, "q1": "As described in the previous section. When submitting the proposal in the correct challenge, the proposer should flesh it out. The proposal is very much in a draft state and needs a lot more work to make it into a sensible proposal. Details on plans, deliverables, resources and budget breakdown will help voters to make an informed decision.", "q1r": 1, "q2": "As described in the previous section. If this proposal is submitted in the correct challenge then details on metrics, KPIs, risks etc must be provided.\n", "q2r": 1, "assessor": "z_assessor_774", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "vCAs need an interactive and personalized spam filter for this reviews. The similarity tool is not enough.", "experience": "PhD in theoretical physics, and author of the cardano transaction editor."}