{"id": 381146, "author": "dwayne", "title": "DAO-NET: CryptoFusion Funder", "url": "https://cardano.ideascale.com/a/dtd/381146-48088", "category": 26236, "amount": 80000, "description": "Project Catalystは一連の実験ですが、進化の過程を早めるために、資金調達のための実験は並行して行われていません。", "funded": 1, "upvotes": 52153734, "downvotes": 12822985, "votes_result": 39330749, "votes_cast": 301, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "提案されているCryptoFusion Funderプラットフォームは、より迅速な資金調達メカニズムを構築することを目的としているため、この提案は課題と非常によく一致しています。提案書の中であまり明確ではなかったのは、提案されているメカニズムをCatalystの中に組み込む、つまりCatalystの資金も使って、例えば別のチャレンジで使うのか、それともDAOメンバーのような他のソースから資金を分配するのかということです。提案チームは、プロジェクトをスカラ化する計画を追加しており、また、いくつかの可能な課題を予見し、可能な解決策を提供しています。モーメントトークンに基づいて資金を分配する仕組みは非常に興味深く、多くのことを考えているように見えます。この仕組みが成功するかどうかを予測するのは難しいですが、これがうまくいくかどうかを評価するためにいくつかのテストが行われるでしょうし、それに応じて適応していくべきでしょう。市場や買収の計画は良いものだと思いますが、最初は少し楽観的すぎました。これは、本ファンドの迅速な資金調達メカニズムの課題で提出された提案の中でも、最も優れたものの一つだと思います。", "q0r": 5, "q1": "提案チームは、提案書に記載されている内容を確認するために、自分たちの経歴やLinkedInのプロフィールを提供してくれました。彼らはプロジェクトのマネージャーであり技術リーダーであるため、このチームはこのプロジェクトを成功に導くために十分な準備ができていると思われます。また、チームに提示されているスキルや必要なスキルもきちんと記載されており、プラットフォームを開発するのに十分な内容だと思われます。ロードマップは非常に詳細で、月ごとに何が開発されるのかを明確にしており、提案されている内容に対して現実的であると思われます。予算は適切だと思いますが、監査の部分は、エコシステムの中でこのサービスはまだ少なく、かなり高価なので、記載されている金額（10,000ドル）よりも高くなるかもしれません。また、テックリードには予算が割り当てられておらず、プロダクトマネジメントにしか割り当てられていないように見えます。提案チームは、提案のリスクと課題について非常に優れた詳細な分析を行い、可能な軽減策を適切に提案しています。また、事前に評価するのが難しいものもありますが、ほとんどのものは理にかなっています。これらの情報から、私はこの提案の実現性は高いと考えています。", "q1r": 4, "q2": "提案チームは、最終納品までの毎月のマイルストーンとステップを示した非常に詳細なロードマップを提示しており、この提案を監査したり、資金提供後にIOGに必要な報告書を提出したりすることが非常に容易になっています。成功指標は非常によく説明されており、提案のインパクトを測るのに役立ちます。また、KPIは非常に簡単に追跡可能で、提案の範囲に非常に関連しており、チャレンジ目標にも沿っています。このプロジェクトがオープンソースになるということは、さらに信頼性を高めることになります。この提案の監査可能性は非常に高いと思います。", "q2r": 5, "assessor": "z_assessor_31", "no_vca": 22, "ne": 12, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "This is a proposal to set up a DAO for funding small (<$10k) proposals with a quick turn around. It seems to rely on people wishing to put money into the DAO to provide the funding. Actual funding is decided on a 1 person 1 vote basis, where every living person on the planet can apply for a vote token. What is not clear is the benefit to the funders? What do they get for the funds they provide? It seems they get DAO tokens, but why do these have value? Is it just a feel good factor that you gave Ada to a project you liked? Without a clear case for why bidders would give Ada to projects, its is not clear how this project would scale.\r\nMore importantly for this campaign, how are the funded proposal held accountable and how is their impact measured. ", "q0r": 3, "q1": "The proposers have the technical skills to build the smart contracts and have clear roadmap for developing these. Building the technical backend is only part of the process. It would be good to see a marketing plan on how the project will attracts voters, projects, and most importantly bidders who would be providing the funding for the projects. It would be good to see a clear outline of the value proposition to bidders as for this to scale they need to continually provide funds. It is not clear to me this has been done.", "q1r": 3, "q2": "The proposal has a clear roadmap against which technical delivery can be measured. It also has a good set of metrics with goals attached to them for measuring success in terms of projects submitted and funded and the time taken to fund them. It would be good to also have some metrics around measuring the impacts of the funded proposals themselves on the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 30, "ne": 7, "ng": 23, "nfo": 0, "vca_o": 1}, {"q0": "This bit sounds very promising: \"The Cardano ecosystem will gain an alternative funding mechanism that is self sustainable and optimized for the funding of proposals of less than $10,000 USD in under 7 days.\" Unfortunately the rest of the proposal doesn't really support it.  It is very hard to see the bridge between dream and reality.\n\nSounds like everything is very much thought through by the proposer, to the last detail, but therein lies the issue: a DAO is supposed to be governed by its members, to evolve via collaborative exploration and discovery. It's hard to see people getting behind such readily chewed idea that they were not part of developing.\n\nSomething like this is needed. I just don't think this particular idea is the solution. I therefore disagree this is fully aligned with the challenge or required to make the Cardano community better.", "q0r": 2, "q1": "Combined ask of all the DAO-NET proposals is a whopping $544,200 USD - potentially the highest in the history of any Catalyst fund. While some of the proposals appear to be \"nice to have\" add-ons, this one is one of the core proposals without which the others won't work as expected. Likewise, if one of the other core DAO-NET proposals doesn't get funded, this one might be useless. In the proposal itself, the \"Sybil Defense DAO\" is mentioned as pre-requisite (and there are potentially others). The sheer scale of these proposals is so massive that I have hard time believing a team of two people can pull it off, no matter how efficient and smart the project manager was. It says in the proposal that \"Product Manager and Lead Developer are required to participate in every proposal\". Whether this single $80,000 USD proposal is feasible, it's hard to say. Neither agree nor disagree.", "q1r": 3, "q2": "Although there is a lot of detail in the proposal and everything is very much set up to be an exemplary proposal, according to CA guidelines, it is still a bit vague how the goals will be reached. Sure, the proposal promises open source software and lists measures but there are no goals set nor a process outlined how to reach them. For example, the proposal talks about using Fund6 voters as early adopters but doesn't say how they are contacted and what are they supposed to do. How are the 1,000 members and 20 proposals reached? Most likely the proposer has answers to all these questions and he will keep the community in the know after being successfully funded. Right now it's just so centred on one person (or two people) that it's hard to say whether this is auditable or not. I neither agree nor disagree.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 23, "ne": 11, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is spot on for the Rapid Funding challenge. The idea is to have a separate DAO which will facilitate small proposals, up to 10k in under 7 days. It will run in parallel to bigger Catalyst. The value added to Cardano will be a faster turnaround, self-sustaining DAO.\nMetrics and deliverables are clear, precise and concrete.\nVery well written proposal overall and in line with the challenge.", "q0r": 5, "q1": "The proposal is written with all the details covered as per Catalyst best practice: experienced members with verifiable links, clear budget for personnel, timetable, deliverables, success, technical details on the implementation and even risk mitigation. I am fully convinced that the team can deliver as presented.", "q1r": 5, "q2": "The proposal has a clear roadmap, deliverables, quantifiable and measurable metrics. It will be easy to make a follow up on the promised deliverables. For example, after 12 months we need to have 40k in ADA funded, 50k members etc.\nThe proposal also perfectly addresses the Challenge with a well written and concrete proposal. Being a CA/vCA since Fund2, we do need a good separate model for micro projects and this proposal has great potential.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 23, "ne": 2, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "The proposal aligns very well with the objectives of the challenge. Our goal here is simple: to work on new ways to promote the distribution of the Catalyst treasure that are faster and more efficient (as well as auditable). The idea presented here is the creation of a DAO, aimed at discussing this issue and proposing solutions. The team provides the project's git hup, where we can see in more detail what they want to do (however, I went to the link and couldn't find out that much; maybe the intention is to fill it in as time goes on). I found it interesting how the proponents express their intention to involve more PEOPLE in this process. I, for example, am participating in Catalyst and already have 3 funds, but for me the distribution of the treasure is still a distant and somewhat confusing subject. If the members of the community itself have more control over it, I believe that this destruction will increase in quality. It is also positive that they leave it open for anyone to participate in the DAO, just prove your identity (it would be very interesting to integrate this platform with the Atala Prism DIDs, in the future). The functioning of the DAO, as I understand it, is based on: do participants mint tokens, through smart contracts, can the funding acquired in the round be used to fund future proposals? That's what I understood, I may have been a little lost. But anyway, it's an idea that fits like a glove with what we're looking for in the challenge, so I'll give it full marks.", "q0r": 5, "q1": "The script of this proposal is very rich in details, they do what I consider to be ideal: they divide the phases by month and list a series of activities that are developed within that period of time. With this, we can perfectly understand what the development of the process would be, understand what small steps need to be taken in order to obtain the final results. The creation of a DAO to try to launch alternatives to the financing of Catalyst is an ambitious and complex idea, but with the action plan provided - very specific - it becomes something possible and palpable to happen. About the team, we have a total of 4 people here, 2 of which are already known and 2 still need to be hired. About acquaintances: their description is quite adequate, despite being short, it is assertive. That is, we have the basic information to understand who we are dealing with, and we can deepen this knowledge through the attached linkedin profiles. It would take 2 plutus developers, I would like to understand how they would be selected. I believe that the Plutus developers are key people for the realization of several proposals, from what I noticed evaluating. Is there a way to bring these professionals together in order to distribute the work and select who would be best for each type of project? Regarding the budget breakdown, the amount requested is quite high, but it is in line with the market. It's about the salary of professionals, and also something about the smart contract. I would like to better understand what \"Smart Contract Audits\" would be. However, in general, this topic of the proposal is also perfectly contemplated, in my opinion.", "q1r": 5, "q2": "Again, bidders deliver everything. We have a lot of information here that makes the proposal auditable. Starting with the topic \"Challenges/Risks\". Here we have some challenges that can be faced during the practical realization of the project. I tend to evaluate proponents who include risks as people who possibly have experience and a very broad view of what they are dealing with. Anticipating problems and anticipating possible solutions is essential, and this is done here. Through this topic, we can monitor whether such things have happened and whether they have been properly resolved. The proponents also include several topics about risks: they talk in depth about this part of the proposal. Through the detailed roadmap, it is possible to audit the project development process. By the definition of success, we have direct information about what to expect as the final product of this proposal (see that this is the basics of auditability and should be included in each and every proposal, but these authors go further). It would be important, as I say in most of the proposals, for this team to establish direct contact with the rest of the Cardano community, in order to update us on the progress of things and also the final results. One idea is to gather data, after a long time of activities in DAO (1 year, maybe), and bring it to the community. Has crowdfunding and alternative funding really been a success?", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 24, "ne": 8, "ng": 15, "nfo": 1, "vca_o": 1}], "solution": "DAOを設立して、コミュニティ、資金提供者、提案者に新しいプロジェクトへの迅速な資金提供のインセンティブを与える実験的な資金調達メカニズムを開発する。", "experience": "ブロックチェーン開発者、Plutusのパイオニア、SPOオペレーター、コミュニティアドバイザー、ソリューションアナリストからなる経験豊富なチームです。"}