{"id": 397340, "author": "raz", "title": "Commonwealth+UNESCAP+CatalystImpact", "url": "https://cardano.ideascale.com/a/dtd/397340-48088", "category": 26446, "amount": 29600, "description": "Lack of capacity building to close the digital divide for women and youth empowerment across Commonwealth, UNESCAP South Asia countries.", "f6_no_assessments": 4, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 10504, "q0": "The goal of the proposal is clear. The aim is to empower youth and women entrepreneurs through education, social and political change. This would be accomplished through creating training resources both for youth and women entrepreneurs and also for policy makers. These are laudable goals which would likely create value for the community. The resources are targeted to specific groups but would be made available for free to anyone who wants to access them which is also good to see. The proposal however does not match the challenge goals well. The KPIs do not specifically address material for legislators or regulators. The challenge goals are oriented to lobbying politicians for better tax rules, usage rules, and privacy rules for cryptocurrency. The challenge also incorporates an aspect of focus on PoS and Cardano particularities. None of these aspects are a stated particular focus of this proposal. One could argue that social metrics in legislation is beneficial to all aspects that we should care about. As someone who has experience with interpretations of legislation and legal documents I would say that this would not be an accurate description of the spirit or intent of the challenge as written. I would recommend that this proposal be submitted into a more appropriate category for funding. Therefore although this is a solid proposal in many other ways, I disagree that this proposal effectively addresses the challenge. ", "q0r": 2, "q1": "The team for this project has good credentials in fields which are applicable to the goals of the proposal. There are links and resources provided to confirm all this information. The resources required are broken down into categories and those categories seem reasonable in the sense that the budget and the goals are well matched. There is a realistic timetable provided for the objectives of the project. The project is working in partnership with other well known projects in the community who have solid reputations which improves the odds that the objectives here would be rolled out successfully. It is also very good to see that there is some thought put in on how to avoid duplicating efforts through ongoing dialogue with other projects. Any economies that projects can make in that sense is obviously beneficial for the community and shows conscientiousness on the part of the proposers. One suggestion I would have is to elaborate on the challenges anticipated. This is not touched on very much other that saying that the goal is to move away from male dominated traditional commerce. Overall I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The roadmap is simple and straight forward and hits key points that need to be addressed. The milestones are realistic and include dates for implementation (in the feasibility section) and when pieces will be ready for use. The key goals are included but does not show specific KPI targets which would be good to have to form a more quantitative measure of successful implementation. For example there could be a target of educating X number of new entrepreneurs in online business or producing X number of courses. The timeframes for all this could also be duplicated in the auditability section for easier assessment since they are only in the feasibility section. There is no specific mechanism mentioned where the community can go to measure the progress although the team is active in the community and would have many ways to make progress visible. Overall I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_935", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1298, "q0": "This Proposal is a comprehensive plan for educating women, youth and Politicians into the digital world. The proposers label it as the digital divide. It has a coalition of like minded organization, a mini Whos Who in Cardano, which is the number four of the key metrics in the Challenge Brief - Number of partnerships and collaborations with organizations and non-profits that work in the same cause. The Proposal does not address from my reading and assessment the first goal of Lobbying but does directly address the education of Legislators. I would suggest to the Proposers that an edit to strengthen voter attraction would occur if the sections on Legislators education on Crypto Currency were more emphasized in the proposal. This would elevate my assessment based on the Challenge brief to a 5 - Strongly Agree, that this proposal effectively addresses the challenge.\n___________________________________________________\nSuccess for this Proposal is well defined as well as the key metrics it addresses. The success statement and purpose in part states: \"Educational course on technology... ; address the digital divide aspect....; empower policy makers...\" . It also states that the educational modules and learning courses would be open access, self- paced learning and accessible for free to all in the world for online access and use in physical workshops...  .\n", "q0r": 4, "q1": "My assessment is this proposal and plan is highly likely to be successfully implemented based on its plan, the team, the organizations involved, the budget and resources. As I stated the Colab organizations are impressive including: Catalyst School, WADA, BlockChain Learning Center, Cardano4Climate and more. \n____________________________________________________\nThe $29,000 budget request is well presented and detailed with the bulk of it - $25,000 targeted towards education materials, courses and online e-learning courses.\n__________________________________________________\nThe plan has about a 6 month launch timeline. In classic Risk Management principles the plan includes a 3/6/12 month monitoring and evaluation review, including participation metrics and feedback monitoring. This type of monitoring system assists in moving projects forward towards goal realization and program success. ", "q1r": 5, "q2": "The clarity of the budget, the milestones, KPIs both in the text as well as the SDG rating and generated KPIs set this Proposal and project up in the straightforward to Audit lane. The success measurements are pretty clear in my assessment.", "q2r": 5, "assessor": "z_assessor_1339", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8300, "q0": "I am a bit puzzled by this proposal and wonder if it was mistakenly submitted to the wrong challenge. The proposal identifies an important problem, namely that there is a digital divide for women and youth in large parts of the world. The proposer plan to address this issue by providing online training and capacity building workshops. They present a well-thought out and detailed solution involving running workshops and building capacity that would allow those marginalized populations to cross the digital divide. But the challenge brief calls for proposals that “fund specialists….who can promote the creation of an environment of laws that are more favorable…to the crypto space.” I would have liked the proposers to help me connect the dots and understand how their impressive project would respond to the challenge brief. ", "q0r": 3, "q1": "The team consists of well-known Catalyst community members and impressive experts in the field. The assembled talents bring exactly the skill set that would be needed to conduct this project. They have identified a wide range of partner institution that could support the delivery of the identified workshops and classes. The budget is not large and is divided into several line items. The largest line item is a bit vague, but I didn’t downgrade the rating due to the proposal team’s clear reputation and history with delivering educational courses. ", "q1r": 5, "q2": "The proposal provides clear KPIs and quantifiable results that will be measured. With good recordkeeping, they should have no issues determining the number of women entrepreneurs that move into online business activities. If the project is able to support women in these entrepreneurial ventures, it will be very clear that the team has achieved success.  It should be similarly straightforward to track how many e-learning courses are developed. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10471, "q0": "I am very sure about how COVID-19 pandemic has raised new barriers for inclusive development especially in Various restrictions imposed during COVID-19, including physical movement of cross-border goods, services and transport has negatively affected the economies of countries. From the proposers I am impressed about their ability to write on the problem statement. It gives a clearer picture about what is actually happening in most African countries. Whilst the pandemic has made countries recognize the need for deeper digitalization, the digital divide has also widened within and across countries. The digital skills gap is one of the major deficits that many developing, least developed and small state economies are challenged with. The most affected from the digital divide are women across and within countries hence the proposal to empower women and Africans in general on Project Catalyst and for that matter Cardano is a well thought one. ", "q0r": 5, "q1": "I am excited about the plan and the milestones the proposers presented in this proposal. It was clear and straight to the point.\n\nTheir deliverables were also an exciting one to review considering the fact that the proposal will help empower and educate people within the commonwealth subregion. Obvious their proposal and plan to  Train and build capacity for youth and women entrepreneurs via E-Training courses (Cardano, Blockchain, Project Catalyst) is one that is commendable. \nThe experiences of the team members is also awesome. They have the right expertise and the capacity to deliver results when given the opportunity.\n", "q1r": 5, "q2": "\nThe information the proposers provided to measure the success and auditability of the proposal is an impressive one. I read through and I realised their KPI to measure the Progress will include:\n\n(i) assessing the Number of women entrepreneurs trained and moving to online businesses.\n\n(ii) Number of e-learning courses developed and delivered to policy makers and feedback from the participants.\n\nI however feel they could have provided more indicators to include the sustainability and the way forward of the proposal. \nFurthermore, I was looking to see how that the proposers should have included the expected challenges they anticipate to face in the implementation of the project.\n\nThe information provided on the achievement and involvement of the team in other related Blockchain activities is worth commending and brings their experiences to bare and to help in the auditability of the success of the proposal. I am impressed about this proposal and so I will score this 4. ", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Addressing the digital divide by empowering youth and women across different regions through online training and capacity building workshops", "experience": "The Commonwealth - Dr Radika Kumar - Adviser infrastructure policy, Commonwealth Secretariat, UNESCAP - Dr Rajan Ratna - Deputy Head of ESCAP South Asia, Accelerate2030, Cardashift, Sustainable ADA, Catalyst School, C4C Education, Wada + Cardano Collective for Impact Network"}