{"id": 398686, "author": "dfolino", "title": "Legislation in PA and Beyond", "url": "https://cardano.ideascale.com/a/dtd/398686-48088", "category": 26446, "amount": 35000, "description": "PA can be a gateway for Cardano’s ecosystem, but legislators need education, without which they will enact dangerous legislation.", "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": [], "media": [], "f6_assessments": [{"id": 1112, "q0": "This proposal has a plan to work and educate members of local and state governments of Pennsylvania to help promote favorable cryptocurrency laws.  This meets the expectations and the scope of the challenge setting by engaging and working to lobby for favorable legislation. The sole reason, for not giving 5 stars is that this proposal has a really narrow scope in terms of the global impact that it will have on Cardano.", "q0r": 4, "q1": "Ths proposers has experience in the local blockchain space and connections within the state to enable a strong proposal.  The proposer pouts a very good case, but the size of the efforts and the size of team (4) maybe looks like the teams efforts may be stretched to perform as many engagements and educational series that they are planning.  ", "q1r": 5, "q2": "The proposal contains a clear path and roadmap of the numbers of engagements and target audience that they are hoping to make with the funds raised during this effort.  They also include KPI/metrics for rowth and legislation passed which are all measurable items in the proposal.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 1300, "q0": "This proposal is a funding request to help support a fairly new organization focused on influencing legislative Block Chain, Crypto & DeFi related legislation in the State of(PA) Pennsylvania in the US. PA coincidently is where the signers of The Declaration Of Independence put pen to paper. This proposal effectively addresses the Challenge Brief by proposing to Lobby and Educate and work towards favorable legislation in the state.\n____________________________________________________\nSuccess  to this proposal has four key metrics: 1. Passing sandbox legislation, 2. Passing taskforce legislation, 3. Growing the entities coalition to 100 members in the first 9 months  and, 4. Meeting with all 253 General Assembly members within the first two years.", "q0r": 5, "q1": "The proposer is the President of the PA Blockchain Coalition which is a grassroots organization and is a member of the National State Blockchain Association. The association has a number of social channels, even though young and is active in growing itself and expanding it's board and membership.\n____________________________________________________\nThe Proposal looks like it will work towards solving the issues raised in the Challenge Brief. The Timetable is realistic and it has a solid Implementation Plan. While, the budget is clear and appears realistic I do suggest a point for the team to clarify. The budget request includes $5,000 for Website content/developer. The Associations website is currently being developed by the Burns Design Group. I would suggest for transparency and voter comfort an explanation be edited into the current proposal. \n____________________________________________________\nI maintain the rating of a 5 towards the Feasibility of this proposal but do ask for the one budget question to be edited into the current proposal.", "q1r": 5, "q2": "The milestones provided in this proposal and discussed in an earlier section are solid, realistic both in scope and timeframe and are measurable. The detail of the plan along with the KPIs are the reasons I rate this Proposal as a 5 that it will be successfully implemented. ", "q2r": 5, "assessor": "z_assessor_1339", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3478, "q0": "The ideas of enhancing knowledge of legislators is very relevant in the context of entering and developing the ecosystem. The proposer already put detailed in the favorable context and their goals to develop the solutions to address challenges. The main activities of the project and the target beneficiaries has mentioned in detailed based on specific target. By the way, the proposer can add some case-studies to persuade the readers more. \nAs the project target to train the legislators, the proposer already put the detailed numbers of legislators in specific state to be trained. Besides, several outcome were put as well to convince the readers and make the project be more meaningful.  Besides, others quantitative outputs were mentioned in roadmap as well, so it will be clear to assess the project. \nRisk is considered well to the target beneficiaries of the project as well. Solutions for this risk is also described by the proposer so that if happening, the implementer will know how to solve it as well as convinced more to the people. \nThe proposer can add some information regarding to how this project can contribute to the Cardano ecosystem as well\n", "q0r": 4, "q1": "The timeline were prepared by the proposer with the tentative duration of each steps and the expectation from the proposer when implemented this information. Although roadmap is prepared in terms of activity-based, some activities take longer time to implement. It is necessary for the proposer to add information on how they will do each action in more details to let people understand more. \nBudget was put generally based on work category, not based on the roadmap. Therefore, it is suggested the proposer to prepare again the budget breakdown based on activities in the roadmap. In addition, the budget is better to write in detail, directly to kinds of payments.\nTeam allocation was prepared by the proposer. Except one person’s profile was shared in detailed, it is better to add more information about others personnel. In addition, the allocation in team composition is necessary to add as well. ", "q1r": 3, "q2": "In the proposal, the provided quantitative and qualitative data were put sufficiently to let people catch easily about the progress and development of the project if it is funded. After being funded, the team can follow this metrics to share to all donors for catching easily. \nThe success of the project is mentioned clearly in the proposal. When these work could be done completely, the project is considered to be achieved. \nSo far, There was no information on whether this proposal is a continuation of a previously funded project or entirely new ones. The proposer can add some information about it.  ", "q2r": 4, "assessor": "z_assessor_1655", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8304, "q0": "The proposal clearly aligns with the challenge brief’s stated goal of promoting the creation of an environment of laws that are more favorable to the crypto space.  Focusing on the state of Pennslvania, and explaining the key role that this state plays in the US regulatory landscape further substantiates the proposal’s potential impact.  The proposers seem to have a good grasp of the existing PA draft legislation, and how their efforts would fit into the current policy landscape. I was surprised that there is no mention of how supportive the current PA US senator is of the crypto industry. Pat Toomey is outspoken regarding his desire to promote the industry and protect innovation. Given the lead proposer’s background, I am sure he is aware of Toomey’s position, and would only suggest that Toomey might be able to support the team’s efforts, especially since Toomey is heading into retirement from the US senate.  ", "q0r": 5, "q1": "The metrics focus on the number of meetings of with state lawmakers, which aligns with the challenge brief. The proposal seeks to educate all 253 members of the General Assembly. The KPIs reference additional meetings with the State Treasurer’s Office, candidates for Governor and US Senate, and members of the Governor’s office. From googling Dominic Folino, his LinkedIn profile details his extensive experience in this field. However, his only support for the lobbying activities seems to come from a much more junior member of the team, Caroline Ehrenfeld, and it is not clear whether she is engaged in the proposal activity on a full-time basis. It seems that the tasks might be too ambitious for the team referenced and for the requested budget. $20,000 for lobbying engagement does not seem to be enough to cover all the activities envisioned.  Looking at the PA Blockchain Coalition website, it seems clear that many more people are involved with this effort than are detailed in the proposal. Perhaps the amount requested would only provide some support for activities that are already ongoing. It would have been helpful to have this explained.  \n\nI would envision that it might be difficult to get the attention of some of the lawmakers. Those most in need of education are probably the ones least likely to make time to meet with a Blockchain Advocacy group. I would have been interested to learn how the team plans to mitigate this risk, although the proposer’s experience in this industry suggests his skill is equal to the task. While accomplishing all of the intended meetings in a three-month time frame might have been impossible, the proposal details an 18-month time frame, which seems feasible enough to this CA who does not have a good understanding of how the lobbying process works. Getting legislation enacted with in an 18-month time frame also seems like a very ambitious metric. \n", "q1r": 5, "q2": "The proposal provides a clear roadmap with milestones. The metrics and KPIs align directly to the stated problem and align well to the challenge brief. It will be straightforward to audit whether the collation grows to 100 members after 9 months, and whether or not legislation is passed. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9058, "q0": "Educating the political figures, candidates and legislatures on the ideals and opportunities of blockchain and cryptocurrencies is an important first step to drafting favorable laws for blockchain to thrive. The project addresses the challenge and a key component to enlighten policymakers favor the crypto ecosystem ", "q0r": 4, "q1": "Looking at the kind of activities and for consistency and better outcomes, the budget may not be enough for such exercise. It could be important to consciously categorize the exercise into stages.\nStage 1- meeting with potential winning candidates. At least 10% of them.\n\nstage 2 - meeting with policy stakeholders\n\nStage 3 - Meeting with legislatures.\n\nwhen these exercises are consciously done it would easy to trigger a huge conversation on blockchain and build consensus. \n\nThe budget can be broken down to measure success for each stage.\n\nIt also looks the team members are no where here to read their experience and decide on their competence.\n\nIt is likely the could be challenges during implementation\n", "q1r": 2, "q2": "The information is quite sufficient but too ambitious to audit for success. Seeking to pass legislation in the short term is good but looks a difficult task and the budget may not be enough", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Engage in a lobbying strategy to educate leaders and pass legislation while utilizing a coalition structure to provide grassroots support.", "experience": "President of PA Blockchain Coalition, member of National State Blockchain Association. Decades of political advocacy expertise."}