{"id": 398934, "author": "konmaorg", "title": "Regulation in Sri Lanka", "url": "https://cardano.ideascale.com/a/dtd/398934-48088", "category": 26446, "amount": 29000, "description": "Sri Lanka is in deep financial crisis and is in need of a technology like blockchain to alleviate its current situation", "f6_no_assessments": 6, "f6_rating": 3.3333333333333335, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=12774"], "media": [], "f6_assessments": [{"id": 3480, "q0": "The proposer has great idea, to support Sri Lankan overcome their difficulty lives in particular and the whole country in general when launching and spreading blockchain in the whole country. To convince all audiences, the proposer already put backgrounds of Sri Lanka and country’s challenges through news and reports. It is appropriate to prepare the project to be ready to address the challenges. The proposed solution includes sufficient information in functions, main activities and target beneficiaries to address the challenges. To make the proposal become stronger, it is better to include several case-studies in the proposal.\nThe proposed solution has clear target in enhancing the intervention of stakeholders in the project. It is aligned with the issue the project aims to tackle. However, still it lacks of quantitative target, which can support the proposal be more reliable and measurable. In addition, it is better to add more information in the KPIs that how they want these outcomes to be implemented. \nChallenges and strategy was brainstormed and share in the proposal. In case of facing these problems in reality, the implementor will have idea to overcome it. \nIn addition, it is better to include one session about how this idea will contribute to the Cardano ecosystem to let all people understand quickly about its contribution to the overall goals. ", "q0r": 4, "q1": "Feasibility\nThe project roadmap was developed in such a short 4-month period, focusing lobbying action only. Thinking about its understandable and aligning to , it will be hard to imagine up to the end of project, how the grassroot people can change their lives by blockchain. In addition, even mentioning 4 months, it is better to put the roadmap in more details, including how they implement in the specific timing, \nBudget was allocated based on two main activities including infrastructure and lobbying. Although the budget allocation is aligned with the proposed plan, it is necessary to breakdown on amount specifically used in each itemized activities to ensure the transparency and accountability of the project. \nRegarding to human resources, the team for lobbying in Sri-lanka were decided with experts in various sectors. These people has rich experiences in lobbying as well as reputations in the mind of people. The proposer already mentioned clearly about this team by the provided link. In addition, it will be better if proposer can add some tentative human resources for the next steps, launching to grassroot level to make the proposal be more appropriate. ", "q1r": 3, "q2": "The proposal has metrics on how to check the progress and development of project. However, it was too general without any specific data that they expect to achieve in each period or by the end of the project. Therefore, the proposer need to consider to add more information in this part . \nFor the success of the project, it aims at getting the grassroot onboard and working blockchain based solutions. However, comparing with the plan mentioned hereunder and the budget, still there were a gap to reach to that. The proposer can consider to rewrite again about it. \nWithin the project’s proposal, there is no information about whether this project is new or continuous ones of a previous funded project. ", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 3619, "q0": "This solution is aligned with the challenge because it aims at approaching lawyers to create awareness and favorable regulations for the Cardano Blockchain Ecosystem. The proposal did give a lot of statistics and links to news reports to show that the economy of Sri Lank is facing a financial crisis. The Sri Lanka economy is going down seriously. This is to explain why this solution chooses to approach lawmakers in Sri Lanka. As in this time,  it can show benefits that blockchain technology can bring about to revitalize the Sri Lanka economy and better persuade lawyers there creating favorable legislation to allow blockchain to thrive here. In fact, this proposal described clearly what the solution is all about as well as its specific goals. Through that, it showed how impactful this solution is to only the economy of Sri Lanka but also to the development of the Cardano blockchain ecosystem here as if this project was launched successfully, then favorable laws created would pave the way for start-up projects based on Blockchain to thrive. Besides, the proposal also set up some KPIs for this project. It also clearly mentioned some challenges that it will face when executing this project and the strategy to mitigate them was also given, showing the high certainty of operating it smoothly.", "q0r": 4, "q1": "The plan and the timeline were given quite clearly and detailedly. About the budget, it listed 3 types of costs, but only mentioned the Lobbying Panel budget was used for 3 months. In fact, it should mention how long those budgets would be used for each type of cost so that everything is transparent enough to follow and audit. Apart from mentioning in the first part of this proposal that the leader of this project is an entrepreneur and has some experience trading with Sri Lanka for a decade now and has close connections with the lawmakers of the country, which is a very strong point to prove the feasibility of this project, it provided a link to the team members of the project, but it is inaccessible. Therefore, it should list out here in this proposal the structure of the team, how many people are involved, the role of each one, and their background and relevant experience to better persuade the possibility of operating it successfully", "q1r": 3, "q2": "Regarding auditability, it just mentioned 3 criteria to measure the progress and the development of the project. But it is not enough to audit. Instead, it should mention specific indicators for each phase that goes in accordance with all milestones in the plan. For example, in the first month, it should arrange how many meetings with ministers so that the sponsor could evaluate the proceeding process and what to expect to happen next. Besides, the description of the success of this project is not detailed and did not cover all goals and KPIs mentioned earlier.  For example, it mentioned one of its goals is to build a website to promote blockchain technology, but no criteria related to this are listed to define the success of this project. It also needs to indicate this is a new project or a part of a project that was funded before", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4560, "q0": "Sri Lanka is having one worst economical crisis in recent times, as per the latest news Sri Lanka has cancelled exam as it doesn't have any funds to conduct the exams. The country has too much dependency over tourism and tea , where both are not permanent solution for development of country.\nWith having more debt than amount present Forex, most of the countries wont try to invest in Sri Lankan projects, So this the right time to bring block chain to this country by making laws more simple, this  will help citizens in knowing the block chain in better way, and it will boost their confidence in such projects, hence this idea will be very much beneficiary to both block chain developers and Sri Lankan Economy hence proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "Since the proposer has found the right time for this project ,Sri Lankan government is cornered to accept the laws, as it needs funds at any cost. Setting up meeting with ministers is bit challenging here, and making them understand , the importance of block chain is also quite a challenge.\nOther than that setting up blogs about the importance of block chain, and setting up grassroots of Cardano, wont be much difficult.\nIf government tends to accept the projects , it will definitely boost people to invest in such projects , as it is a right time with Given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "Other than how the proposer convinces the law makers and cabinet Ministers of Sri Lankan government every other aspect is mentioned clearly.\nThe proposer can also use some of best speakers of their country in educating the people , which will create more attraction towards these projects.\nProposer has provided his clear goals of this projects which is creating grass roots of Cardano, and also mentioned clear roadmap and budget break down of the project, By Providing valid references and excellent Key Indicators in the proposal, the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8945, "q0": "This is certainly a great idea which is about to lobby with lawmakers in Sri Lanka on regulating blockchain by creating a website with Cardano content, approaching the Sri Lankan cabinet ministry officials to advocate about the advantages of adopting blockchain technology with the help of the website. This proposal is completely impactful. It fits very well with the objective laid out in the challenge because success metrics of the proposal are within the key metrics of the challenge (“number of experts in regulation, lawyers, and other members involved”), if it is success, it will create awareness in lawmakers in Sri Lanka about blockchain teachnology and benefits that it would bring to alleviate the economic crisis of the country (due to the analysis and links that are provided in the proposal from Reuter Report), a basic but important step to have a place with favorable legislation, privacy, tax reduction, and a positive environment for mass adoption of Cardano ecosystem.", "q0r": 5, "q1": "The author explains clearly about the situation of economic crisis in Sri Lanka, allow us to understand why this country is a “promissing place” for Cardano adoption. The detailed plan helps us to know what will be done in each of months in a term of 4 months, and the budget is broke down into 3 identifiable items (website & repository building, lobbying panel and lobbying events). I think it will be benificial if the author gives more details about these items in the budget, for example how does the item “website & repository building” cost $3000? What are the contents of lobbying events? How does it cost $5000? … About the team who will make up the project, the author gives a link in which we needs to access the link to get information about the project’s team members, but I have failed to open it somehow, even though I tried so many times. I would recommend the author should provide the team’s information clearly in the proposal, for readers to see easily who are they, their professional majors, their experience and skill related to conducting the proposal,… to raise the trust of the readers (CAs, voters,…).\nBecause of lacking of team members' information, I do not know if the project would be implemented successfully or not.", "q1r": 3, "q2": "The author provides us materials enough to monitor the progress of the proposal, consist of detailed plan in timeline, roadmap and milestones, success metrics and KPIs, help us to have a vision of the project in general. We can audit through the detailed plan, or measure the results based on the KPIs which are explained in section “Impact” of the proposal, so that the proposal is auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9064, "q0": "The proposal is speaking to the challenge to ensure friendly legislations are passed in favor of the blockchain community. From impact, it looks the people of Sri Lanka have little or no knowledge about blockchain. Killing two birds with one stone may not be appropriate. It is therefore appropriate to engage in grassroot activism and education on the high potentials of the blockchain. \n\nWhen the mass education is done, it is then the Executive and Legislature could be engaged for legislature reforms for adoption. ", "q0r": 2, "q1": "The team at this point may not be able to cause legislature reforms but could engage in mass education first before pushing for legislation reforms. This proposal could be part of Scale Up Cardano Community in the first stage and after being funded, the second phase which involve legislature reforms could be at Lobbying for favorable legislature. \n\nThis will be more easier to cause the necessary conversation and reforms.\n\nHere, the budget is higher for such a project looking at the lack of education on blockchain in Sri Lanka. ", "q1r": 3, "q2": "The proposal seeks to address two things at the same time and and would be difficult to audit. Making the attempt is important but doing that constructively with defined KPIs will guide the success of the project for auditing. The information is quite not enough for both progress and final auditing.", "q2r": 2, "assessor": "z_assessor_719", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10064, "q0": "The proposer seeks to design and implement a strategy for Cardano project deployment in Sri Lanka. However, the strategy itself is not clear outside of attempting to meet with Cabinet ministers and set up a lobbying panel. Moreover, since Sri Lanka as a country offers only a potential population of approximately 22 million, in terms of the potential worldwide impact of the funding required (more than 10% of that available in this Challenge) it is debatible whether or not that money might be better spent elsewhere. For future iterations, perhaps an integral Lobbying for Cardano in South Asia Challenge setting might be more interesting. Also, seeing as there is another Lobbying for Cardano in Sri Lanka proposal in this same Challenge and Fund8, perhaps join efforts with Dimitri Fernando (the other proposal´s author and Founder of the South Asian Town Hall) to create synergies and devise a more effective and well-rounded strategy for future editions.", "q0r": 2, "q1": "The proposer has no verifiable experience within Catalyst, although many proposals have been submitted in the current Fund. Konma, the only discernible organization in the links provided, does not appear to have any advocacy or lobbying experience at all, rather focusing on marketplaces and other such blockchain implementations. For future iterations I would strongly suggest to join efforts with Dimitri Fernando (the other Sri Lanka proposal´s author and Founder of the South Asian Town Hall) to create synergies and devise a more effective and well-rounded strategy for future editions that is more feasible. Also, it would be interesting to explore which governmental regulatory bodies and authorities would be approached to initiate the lobbying strategy (eg., which representatives should be approached first due to their prior known pro-crypto stances to serve as the vanguard for lobbying favourable legislation, or identifying and engaging key bureaucratic positions within the national system to be able to become aware of potentially damaging legislative proposals before they are approved and irreversible).", "q1r": 2, "q2": "The bulk of the funds requested aim at the establishment of a lobbying panel that has no stated characteristics (lawyers, legislative assistants, congressmen, blockchain specialists, etc). The selected KPIs (number of ministry approached, number of lawmakers educated, number of members onboarded) are adequate but not a measure by which funds could easily be dispensed. I would strongly recommend monthly goals set out in regards to either specific measurable lobbying efforts (interviews with national or local representatives and/or bureaucrats), published articles or reports, crypto-favorable legislative or regulatory drafts to be circulated to already vetted pro-crypto representatives within the national government, growth of number of members actively taking part in the advocacy group, etc.", "q2r": 2, "assessor": "z_assessor_787", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Introducing blockchain technology to the grassroot levels & lobbying with lawmakers to create awareness and best practices for regulations", "experience": "I am an entrepreneur who has been into international trade with Sri Lanka for a decade now and have close connections with the lawmakers of the country."}