{"id": 399589, "author": "natdwamena", "title": "Establish Center for Coin Liberty", "url": "https://cardano.ideascale.com/a/dtd/399589-48088", "category": 26446, "amount": 40000, "description": "How do we secure favorable regulation with continuous advocacy and vigilance in mainstream policy discussion in Ghana?", "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 2114, "q0": "The proposal aims to establish a think tank in Ghana for public engagement to shape legislation and provide policy alternatives, and is very well aligned with the challenge, since blockchain adoption in developing countries with weak monetary systems where local currencies are seen as a poor store of value is key to world wide adoption of the technology. And of course, in order to be able to shape legislation, one needs to first of all establish a reputable voice and wrap its existence around a traditional solution such as an NGO / think tank. \n\nA successful project deployment would also bring about significant synergies for future similar projects, with potential good practices emerging from such policy shaping activities, or even casting a wide net and merging several lobby activities under the same umbrella and benefiting from an already existing organization recognized by stakeholders - so great scalability potential.", "q0r": 5, "q1": "The core team consists of three members: A researcher with years of experience in think tank development and non-profit management, an advocate of the High Court of Kenya and a cryptocurrency enthusiast with experience as a risk and compliance officer. One of the members is an active Catalyst member, and this is definitely an argument that they have a solid understanding of the funding process and community’s expectation towards each funded project. It is also worthy of praise the fact that all team members have made their Linkedin profiles available and one can very easily assess the way in which their expertise and skills match the project. I do have mixed feelings however whether the overall team generally present high enough caliber for a project with such an increased visibility, and I see merit in striving to on-board additional members in the future. \n\nThe budget is sufficiently granular, but to turn this proposal into an excellent one I feel that at least some broad indication of hourly rates should have been provided at least for the items where the efforts will commensurate mostly into hours of work by the core team. There are also certain items which make me wonder what exactly will be the use for those items, for example Team fees to offer the most obvious example. \n\nTime-wise the project is split into three main parts. The first one (1-3 months) comprises mostly set-up efforts and marketing and outreach activities. The second one (4-9 months) would focus on research, publishing policy papers articles and increased development efforts. Lastly, the third phase (9-12 months) would bring to fruition the efforts in the prior phases through engagement with authorities and an increased media presence, and hopefully partnerships with visible stakeholders. Although the general idea is definitely there, I would have appreciated a drill down in some key topics, for example regarding what kind of research / policy papers they envisage to publish, or what kind of partnerships they seek to develop in the long run. You know the saying, if you do not know where you are sailing, no wind is favorable. ", "q1r": 4, "q2": "I salute the team’s openness towards auditability, since they have pledged to make their activities open, and recording of stakeholder and educational outreach available to enable tracking. They have also created a channel on Discord and would publish the activities on a partner institute’s website.\n\nThere are also a number of KPIs presented by the team that will further strengthen the team’s ability to deliver clarity to the Cardano community: number of reports, media appearances, policy papers, advocacy campaigns. I see a lot of merit in such a quantitative approach, but feel somehow that future iterations might take into account adding a few qualitative indicators as well, albeit much more difficult to design, implement and track. To name just a few, perhaps they could implement some sort of feedback mechanism amongst stakeholders through which to gather feedback following their interaction on certain topics. \n\nA last strength of this proposal is the fact that the team is well aware of the risks involved in undertaking such policy shaping activities, and rightfully identified that varying interest from political stakeholders for certain topics is usually a major challenge, and they provide a positive example of how they tackled such a problem in the past. The humbleness of how they approach that example gives me a slight extra boost of comfort that the team is fairly well positioned to face future challenges. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 5050, "q0": "Yes, the proposal does exactly what is expected of it. It offers an expert, knowledgeable team to lead an effort to lobby and advocate positively and with quality information for Blockchain technologies and Cardano. Furthermore, the proposal provides demonstration of previous successful activities in these endeavors.", "q0r": 5, "q1": "With the minor exception of the oversight of a disaggregated budget by quantities and time interval (e.g.: months). The proposal is thorough in demonstrating expertise, previous engagement, knowledge of the legislative and social environments and effectiveness. All of this strongly suggest it offers a high chance of being effective.", "q1r": 4, "q2": "Some of the metrics offered to audit the progress and success of the proposal (e.g.: Number of Regulatory Modifications) are ambitious and somewhat nebulous, Nevertheless, it is my opinion, that the knowledge, experience and effectiveness offered in the proposal and, to a certain extent, demonstrated in the external links provided,  suggest that the team will be able to demonstrate significant success in many of the other indicators of their strategy.", "q2r": 4, "assessor": "z_assessor_183", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8305, "q0": "While much lobbying activity focuses on the US, it is also important to build strong lobbying organizations in other parts of the world. This proposal is responding to the Challenge Brief’s call for crypto-friendly legislation by focusing on activities in Ghana. Given the importance of the country and the region to the Cardano strategy, building capacity in this area would provide value to the Cardano ecosystem. The goal of building a center and continuing to contribute to the public conversation about the technology clearly align with the challenge setting. ", "q0r": 5, "q1": "The lead proposer has significant experience in this industry, in Ghana, and in the Cardano ecosystem. He is a member of WADA and is also leading another Cardano venture – Cardano cares. He has published op-eds that contributed to the public policy debate, which is exactly the type of experience that suggests he can successfully respond to the challenge brief through engaging in the activities described in the proposal. The other two team members have similarly relevant backgrounds, as described in their LinkedIn profiles. The budget is broken down into line items, and the amounts seem reasonable for the activities described. ", "q1r": 5, "q2": "The road map provides clear milestones, such as the writing of op-eds and policy papers. It is not entirely clear to me how the “Number of Media Share and Reach” would be calculated and audited, but it is possible that something got lost in the translation. While the funds requested would help to launch the Center, the proposal notes that the quarterly fundraising strategic plan would provide ongoing support. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9073, "q0": "This proposal is really addressing the challenge and it has a clear path for success for financial inclusion. The approach to influence policy and trigger conversation for public support and subsequent drafting for favorable legislature is indispensable. \n\nGhana is always the pacesetter and this could make other African countries to have conversations to deduce favorable legal frameworks for the blockchain community. \n\nAnother interesting part of the proposal is the teaming up with an existing think tank with good reputation. This will make it canvass for public and media support to influence legislation. ", "q0r": 5, "q1": "The team has the experience and looks to have already done some works in the policy space on Cardano adoption. This is a good step and shows the team will be able deliver for impact. \n\nThe team also has experience in the catalysts ecosystem and much familiar with blockchain and its endless opportunities. \n\nWith the what the proposal sort to achieve, the budget is also reasonable for the activities and deliverables have clear timelines ", "q1r": 5, "q2": "The information provided is enough to track progress and success. A progress report of 7 pages and a final report of 10 pages would also be a simple tool to audit success. If this proposal is funded the proposer could include that. Also, the number of meetings to be organized  with stakeholder and legislature should be added to allow for auditing. ", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10010, "q0": "Favoring the legislation and providing a suitable payment that facilitates banking the unbanked can impact the lives of many african countries. In ghana this proposal is aiming to support the people to lower they transfer costs in a safe and independant way", "q0r": 4, "q1": "The Wada group has shown an impressive list of acheivements in the local community in Africa. They are represented by teammembers with good experience around the money transfer and hurdles that are faced. \nThis proposal has listed the overall campaign deliverable and KPI's \nSince this proposal will only target a part of the overal project the proposers noted that they will rely on further funding. This can show confidence that they will deliver and continue to ask funding in multiple phases. ", "q1r": 5, "q2": "The wada team commited to have a discord group and visibility on the overall project. In addition a major addition is that The teammember will generate a progress report and deliver at set interval between each milestone.", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10069, "q0": "The advancement of favourable legislation for crypto in Ghana specifically and Africa more broadly effectively addresses a major need that is felt in spite of the advancement of crypto-related startups. Establishing a Center for Coin Liberty with active engagement of legislators would undoubtedly be an asset in this regard, specially given the example of the E-Levy upon which the proposer has already authored an article. However, for future iterations of this project, I would suggest focusing and narrowing the scope of the use for the funds requested (or of the planned output of the CCL) for specific policies that favor Cardano adoption (for example, advancement of PoS vs PoW draft legislation, bearing in mind the environmental benefits of PoS blockchains such as Cardano).", "q0r": 4, "q1": "The proposer lacks any prior engagement with the Catalyst and Cardano community, given this is his first interaction with the project. As per their LinkedIn profiles, the team are mostly African entrepreneurs and lawyers with experience in corporate matters, but there is a lack  of legislative advisers, which are of course an integral part of the requirement for lobbying efforts espoused in this Challenge. Seeing as they already have WADA Alliance members, crypto researchers, entrepreneurs and lawyers, my suggestion is they would benefit in future iterations from incorporating political advisors that might help navigate the lobbying efforts required once the Center is established.", "q1r": 3, "q2": "Insofar as the proposal is the establishment first of the CCL and afterwards a series of report- and bill-related KPIs (number of Regulatory Modifications and Advocacy Campaigns, Policy Papers and Briefs Adopted/Implemented, Media Share and Reach, Partner Organizations, Impact Reports, etc.), the progress should be auditable by the Community. Having said that, future iterations of this project should emphasize the Cardano promotion aspect of this potential CCL to have more weight in the consideration of the Cardano community voters. Also, a more thoroughly discriminated budget would be best given the amount of funding requested (15% of the total Challenge setting), with for example the “Research” line of 12,200 dollars being indicated by amount of researchers and research specialization of each of them, specific projects, legislation drafting, paralegal expenditures, time allocated per researcher on a weekly basis over a given period, etc.", "q2r": 3, "assessor": "z_assessor_787", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Use Cardano's evidence-based methods and research to create constant and continuous public engagement to shape legislation for adoption.", "experience": "We are a team of Researchers and Lawyers with over 15 years of experience in advocacy, non-profit management and Think Tank development and focus on achieving impact by influencing public policy.\n\nFund 7 proposer and member of WADA - Ghana"}