{"id": 399826, "author": "heinz.gassner", "title": "DLT360: Regulatory RADAR Team", "url": "https://cardano.ideascale.com/a/dtd/399826-48088", "category": 26446, "amount": 25000, "description": "DLT360 Risk and Opportunity Radar provides a global regulatory overview - this needs the be periodically researched, updated and reported", "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 2118, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: Behind the wider DLT360 umbrella lies another sub-project focused on the Risk and Opportunity Radar, with 4 branches and 5 proposals. This proposal focuses on the first  branch - Politics/Social/Legal (please note that there is another proposal for this first branch - Governance). \n\nI see striking similarities with the other 3 branches of the Risk and Opportunity Radar sub-project and I highly encourage merging them in scope for future iterations. ", "q0r": 4, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: 20% of the budget goes to active content sharing by domain experts, 20% to quarterly video shooting, 20% to team meetings with Radar-content review. For budget core-work rates are 30 to 100 USD/hour. \n\nAgain, striking similarity in scope to the other 3 branches and again, suggest merging them for future iterations. ", "q1r": 4, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.\n\nSpecific part: basic KPIs are presented: size of active network, new content elements, net promoter score from Cardano community. I am not sure how they will manage to obtain data on the NPS score from the Cardano community, or how that community is being defined.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9077, "q0": "The proposal addresses the challenge. Providing a legislative overview on blockchain and cardano particularities is important to guide those lobbying for favorable legislations.", "q0r": 4, "q1": "The team have received unding for fund 6 and 7 and have experience in implementing project within the cardano ecosystem for success. \n\nThough the budget quite reasonable, it will be appropriate the team team hold on with project and focus on the success of those in fund 6 and 7.\n\nThere's no need to rush to implement projects when especially funded fund 6 project has not been completed. Doing one thing at a time to measure success of each is important.  ", "q1r": 3, "q2": "The information is quite clear on the KPIs and good to track for auditing. Links of success stories of previous funded projects have not been provided to track progress and success.", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10479, "q0": "The need to constantly and regularly provide regulations, updates  and reports is a very laudable one as far as the Cardano ecosystem is concerned.\n\n\n But there is the need to continuously investigate facts, trends, risks and opportunities as stated in the proposal by this team. They argued that in commercial companies, this is typically done by independent risk-management entities reporting directly to the C-suite. And sothey are coming out with their own services, which will include support Cardano in multiple ways professionally. This I believe will catch the attention of many folks within the ecosystem. Making sure that the millions (billions) are wisely invested and Enabling the future dREPs and Cardano governance-bodies in making data & fact based decisions\nHaving major trends, risks and opportunities precisely analysed and visualised (collecting from a multitude of sources)\nDemonstrating this carefulness to regulatory bodies and professional clients (e.g. governments and corporations who rely on Cardano as public, permissionless blockchain). The solution of the proposers is succinct and worth commendation as it will address the challenge at hand.\n", "q0r": 5, "q1": "The proposers have really researched very well about the subject matter. One can certainly say that they are qualified to execute this project and do that with precision. Their ability to give a more detailed history of their backgrounds and previous experiences including working with other Blockchain and Cardano related activities is catching and also their LinkedIn profiles provided, where we can get to know each of them in more detail is also a very good one. I believe they have what it takes to do a good job about the project.", "q1r": 4, "q2": "The Key Performance Indicators provided where satisfactorily except to day I was looking forward to seeing some specific percentage quotations with their expectations of the metrics. But in all the team have provided enough information that demonstrated that they can be trusted with the implementation.", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Our regulatory expert team & contributing network apply a well-defined process for keeping content valid and deliver a quarterly reporting", "experience": "The DLT360 Domain Expert Team and the contributing network with many years of experience\nSenior Lawyers specialised in this subject matterUniversity experts, assistants and studentsDLT360 supporting teams\nDetailed information & links provided in feasibility section below"}