{"id": 400282, "author": "fsamvura", "title": "Mobilize : Grass-root activism", "url": "https://cardano.ideascale.com/a/dtd/400282-48088", "category": 26446, "amount": 20500, "description": "Supporting causes is hindered by distance, mismanagement and insider vote-rigging. Blockchain offers activists power, control & recognition.", "f6_no_assessments": 7, "f6_rating": 3.8571428571428577, "videos": [], "media": [], "f6_assessments": [{"q0": "In the proposal, the context of why this proposed solutions come up was shared in concretely by the proposer. It helps all readers understand about the necessity of developing one solution, to address the challenges of the proposal. Thanks to the existing of application, the support to political and civil society become stronger more than ever. Solutions in mentioned in detail in terms of enhancing both local and international impact. To make the proposal be stronger, it is better to share several successful case-studies about how this tackle has been done successfully before. \nIn the proposal, it was clear to see how the project will be done to improve the current situation by applying both commercial approach and negotiation strategies with different government. Besides, it was found concretely that the project can cooperate with various stakeholders, even Cardano’s local community center. The involvement of them will ensure results of project. However, KPIs and key metrics of the challenge has not been written down in detailed by the proposer. It is better to consider to explain this part in the proposal based on stage/period/ or milestone in the roadmap. Especially, mentioning about how the project contribute to the Cardano is also one point need to be cared by the proposer. \nThe strong point of this proposal is the careful consideration on risk and preparation of solutions for that. It will help all stakeholders be more confident to implement this project. ", "q0r": 3, "q1": "The proposer has clear idea and plan to implement the project based on provided roadmap. All steps for each phase was described carefully by the proposer with the explanation of purpose for each step. However, still the information about tentative duration, timing and how to implement each step will be very important for each stakeholder and audiences to understand about its feasibility. \nBudgeting was divided based on activities categories in general by a sum of cost. On the other hand, thinking about the transparency and sustainability, it is better for the proposer to break down more of the budget, to make it be clearer and itemized. \nThe team members were clarified in the proposal including their knowledge, experienced and profile. Team consisted of members in both economics and public policy sector and experienced technician in blockchain. Some members also joined in several training of Cardano, which can help to develop appropriate options for the project. With this team member, the roadmap could be done smoothly. ", "q1r": 4, "q2": "In case the project is funded, it will be easy for the community to track the progress of the proposal in terms of quality. However, still the proposal lacked of quantitative data, which can help all people to judge about the achievement of the project, to see how it is done, with measurable results. If having detail indicator for project and some explanation about how it linked to the SDG as overall goal, the project will become worth for all people to consider and support for it.\nThe proposer are able to present ideas of project’s success. By the way, it is still simple and too much short in this part that might cause the confusion of the audiences. It will be sufficient when the proposer develop more details on how the results look like for better understanding.\nThis project is an entirely new ones. ", "q2r": 4, "assessor": "z_assessor_1655", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Rather than focusing on the legislative process, this proposal focuses on using Cardano’s technology to improve the electoral system. As a result, the voters would elect more qualified and less corrupt politicians, who, as a result of the contributions from the tools created through the proposal, would better understand blockchain technology. Better educated politicians would be likely to create better blockchain legislation, and thus the proposal’s goals align well with the challenge brief. Additionally, as these tools would be built on the Cardano blockchain, the project would spread awareness and adoption of Cardano among both politicians and voters, thus adding value to the ecosystem. Once built, the tools described should scale for use in a variety of different communities. ", "q0r": 5, "q1": "The proposal team provides the details and LinkedIn profiles of the four team members. They have experience in computer science and with the different Cardano technologies required to build this project – Haskell, Plutus, PRISM, design, and stake pools. They also have experience with local political environment, and seem to be connected to the student groups that would be the users of the tools they are building. And they have experience with business and public policy, which will be important skills sets for the project’s success. The budget is broken down into clear line items. The team has identified both the technical steps required to build the tool, and the business and marketing efforts required to ensure usage of the tool. As evidence that the team understand the space in which they are working, they have highlighted the risk that “foreign or unregistered support may be legally restricted.” However, they explain that the solution for this risk is that small donations are often not subjected to these restrictions. ", "q1r": 5, "q2": "The proposal provides a clear roadmap for implementation. I find it particularly impressive that they know where to find the target users, and plan to focus first on students unions, where they have connections. The Road map is broken into a first phase, which contains six concrete steps, and a second phase, which would require additional funding at a later date. Providing regular YouTube video updates would help keep the community aware of the progress and provide an opportunity for auditing. The team’s vision for success is both inspiring and clear. ", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "At first I was suspicious and thought “is this a dApp for buying politicians”? Then I realized this addresses one of the most important issues in representative democracy: you might support three of the initiatives that a particular candidate has on their agenda but the other eight you feel either indifferent about or even against some of them. The proposers suggest “crowd-voting on selected causes” and then crowd-funding them, utilizing blockchain so that the funds are escrowed and only released when there’s evidence the candidate has delivered on their promises. This is potentially groundbreaking. If successfully implemented, it can have global potential and many use cases. Rather than “defending ourselves from attacks by governments and compromising legislation” as the challenge states, this proposal takes a more positive and proactive stance. With that approach, I would say the proposers go beyond what is being asked, exceeding expectations. This would have been a good match also for the Nation Building dApps challenge.", "q0r": 5, "q1": "The proposers are from the same university so their collaboration can be quite seamless. They have mutually complementing skills that are enough to make the plans a reality. They have outlined a step by step plan for building the dApp and they have considered where their initial user base comes from: students unions and local non-profits. Since engaging the Congolese diaspora is part of the plan, it might be an idea to also source non-financial support to scale the solution beyond the MVP. The budget is reasonable. Some of the key risks and challenges have been outlined and mitigation plans are included. A proper timeline and a set of measurable goals would have made the proposal excellent. Now it’s only “very good”.", "q1r": 4, "q2": "The team has outlined well how they are going to handle the progress reporting: mainly through videos, documents and updates in Catalyst meetings. There are some unclear statements like this one: “One vote can include several choices as it is done through Catalyst voting”. Not quite sure what is meant by that. Plans, metrics and goals could have been a bit more specific. As it stands, there is quite a bit of room for interpretation and “artistic freedom”. This “ability for agility” is not necessarily a bad thing since getting into the political arena is always full of uncertainties.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This proposal will work to help build and develop a grassroots action to raise awareness in local Congo.  This will be done through various phases of local/civil and political engagements to help build understanding of the blockchain space and how Cardano can help make a difference.  The impact will be limited to it's scope which is DR Congo, but the plan has a solid outline of how to influence.", "q0r": 4, "q1": "With the details and phases laid out in this proposal it is clear that there is a strong plan in place to target and build/grow awareness of Cardano and blockchain in general in DR Congo at various levels.", "q1r": 5, "q2": "The proposed auditability of the project comes in the form of updates provided and do not have very many indicators and/or metrics which to judge the proposal.", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal matches the challenge in a way, as it is not directly related to crypto legislation, but involves politics and is affected by Crypto legislation. It can prove to be very useful in regards to supporting grassroots activism, thus it is still very relevant to Cardanos bigger mission. The proposers gave adressed scalability issues and manage to point out the benefits towards the Cardano ecosystem", "q0r": 5, "q1": "The implementation plan is well-made and sufficiently detailed. The team is transparent about their background and seems up to the challenge. The budget is explained and modest. Evrn a credible contingency plan has been made, so this proposal indeed seems feasible.", "q1r": 5, "q2": "Both the problem explained and the solution are clear and add up. The efforts to make the proposal auditable are explained and credible and the success criteria all in all match the proposal, while however the definition of KPIs is missing.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is valuable and seems like a good project. However, I feel that its impact on this challenge is limited and that it is a better - dare I say excellent - fit for the Challenge Nation Building Dapps. This proposal does have some superficial common points with the Lobbying for favorable legislation challenge as it intends to support grass-root activism in a wide sense of the phrase, with a view to specifically support such activism in the DR of Congo. Yet, the idea behind this Lobbying for favorable legislation challenge is to fund specialists in regulation, lawyers, and politicians who can promote the creation of an environment of laws that are more favorable or less harmful to the crypto space, with a focus on PoS and on Cardano's particularities. The proposal here suggests a more circuitous approach that would see the creation of a Dapp that would allow users to use a Cardano wallet to influence decision-making at different levels in the DR of Congo. Hence, the proposer expects that the political entities that eventually accept to ... for lack of a better word ... accept blockchain funding - will also be inclined to support legislation facilitating the use of cryptocurrencies. I think that the proposed direct impact of this Dapp on favourable legislation for Cardano will be limited - due to the suggested indirect approach that carries with itself a lot of suppositions and expectations. As regards impact, the proposer has not indicated that similar legacy alternatives for crowdfunding/donations are extremely important in the DR Congo for financing similar initatives and that there is great demand for this type of solution. Namely, are centralized alternatives such as GoFundMe used by members of the diaspora to support local organizations on the ground? If yes, it would be good to submit some examples of such activties and partner with those organizations. In case this proposal is resubmitted in Fund 9 (if it is not voted in this round) it might be interesting to approach such organizations that use service for crowdfunding in DR Congo and include them in the pilot as partners. ", "q0r": 2, "q1": "The group's idea is to develop a voting Dapp that would also rely on the use smart contracts to manage allocation and crowdfunding through escrow and crowdfunding templates which are mostly readily available through Plutus use cases. The team states it has already implemented solutions involving both aspects on the Testnet. If the proposal is not voted in this Fund, I would suggest the inclusion of these examples from the Testnet as it would strengthen the already strong qualifications of the team based on included information. The team includes a member who has completed the Plutus Pioneer and Atala Prism Pioneer Programs and additionally acts as a Haskell and Plutus trainer for Wada and for the Gimbalabs Education programs, according to information from the proposing team. The challenges/risks are well presented - although some could have been addressed immediately. For example, the \"Foreign or unregistered support may be legally restricted\" issue is easy to verify and hence the proposed solution seems to be equally uncertain \"Small donations are expected to constitute the majority of the support and these often are not subjected to the restrictions\". Namely, political donations are a very sensitive issue and \"often are not subjected to the restrictions\" might not be definite enough for a proposal that has the donation mechanism at is core. If resubmitting, it would be good to have a clear prospect whether such donations are legal. The roadmap is there but there seems to be not as focused on the DApp itself. The roadmap cites two stages - the first phase has been identified as the Fund 8 stage \"First Phase (Civil Society - Fund8)\" and that Fund 8 stage is followed by the Second Phase is the stage of Political Lobby/Entity - Fund9 - Targeting 2023 National Elections. But I was left with unanswered questions - when will the detailed budget breakdown apply? When will exactly the \"Front-end design with wallet integration\" be delivered exactly - it affects feasibility as there needs to be a more explicit technical timeline. Seems unclear. WHen will the Back-end design and integration/Plutus Smart Contract Design be completed exactly ? Also for Atala-Prism based DID integration? If this proposal is resubmitted, it would be good to include this - as this has to be part of a sensible and conductible plan for implementation. \n", "q1r": 3, "q2": "The auditability seems to be low in terms of the technical aspects of the proposal. When will the DApp be made available exactly and the smart contracts? Will the Regular YouTube Video Updates be related to the general First Phase (Civil Society - Fund8) work with civil society ... or will it involve detailed update on the technical aspects of the proposal with feedback from the Plutus Pioneer and Atala Prism developers? When will the DApp be delivered and will it be available for outside scrutiny? The roadmap seems sparse on the exact timeline for the technical deliverables. The problem statement is not that clear as it already contains a suggested solution \"Blockchain offers activists power, control & recognition\" and the problem statement does not refer at all to the region that is being addressed by the proposal. I mention this - because creating a laser-focused  Problem Statement probably leads to better focus in developing a perfect Problem Solution and a precise Proposal. The proposed solution is for developing a DApp - so if this proposal is not voted in this Fund, I would suggest resubmission in Fund 9 with much more focus, information and explanations about the DApp itself (it is the solution identified by the proposing team!) - to improve auditability. The Problem Solution directly states - \"DApp where users would use a wallet to vote on candidates/proposals, send funds and onboard volunteers. Foreign allies can directly assist\" - so more info might be welcome on the DApp and on the wallet that it will be integrated with to improve auditability of the proposal - as these components are at the very heart of the solution. \n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "I think this proposal would fit better in the Nation Building Dapps challenge. The campaign brief of the challenge it is posted in specifies that the aim of the challenge is to fund and support specific entities that work for crypto/Cardano-friendly legislation.\n\nThis proposal is a Dapp for decentralized funding of political activists/candidates in general. Which is a much broader scope than the challenge setting. Therefore I can only give a low score for alignment.\n\nHowever, I think the impact of such a Dapp could be great for the Cardano ecosystem, and given that the proposal would align well with the Nation Building Dapps challenge (I assume it was just posted in the wrong challenge), I will give it an extra point for impact.", "q0r": 2, "q1": "The team has experience with Plutus and are involved in a local Cardano hub already running a stakepool. The background and relevant experience of the different team members is explained well, and gives confidence that they are able to create a Dapp on the Cardano blockchain.\n\nWhen it comes to the roadmap and budget I am not sure about the approach. It seems that the team will decide which organizations will added to the platform. Although this might only be for the MVP of the Dapp, this seems like a more centralized way of doing things than I would have expected. I would have assumed that any organization or individual would be able to join the platform and seek funding. In my mind this would be the most open and democratic way of introducing such a platform.\n\nIn the two budget items Environmental Scans and Consultations they are requesting $4500. I think these items are not explained well enough, as it is not self-evident what they entail. And I think some more transparency would be needed for me to have full confidence that the funds are being put to good use.\n\nThey also have a budget item called media coverage, which I think would make more sense for later funding rounds, after they have a working product. Also, if they already have onboarded a number of political organizations and candidates, I think those entities should be able to bring enough media coverage to the platform for the time being.", "q1r": 3, "q2": "For me, the proposal doesn't make it clear enough whether they are creating a funding mechanism for political organizations that they are already in contact with, or if they want to make an open and free platform that anyone can use. \n\nTheir vision of success seems really good, and one that I would agree with. To ensure that they are accountable to the Cardano community, I wish that they would quantify their success metrics more, and clarify the time horizon for a succesful implementation.\n\nIn general, the proposal needs some work (for later funds) for me to enthusiastically support it. Specifically, I think the problem statement and described solution should be defined more clearly. It is important that there is no doubt as to what they are creating.", "q2r": 3, "assessor": "z_assessor_73", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "DApp where users would use a wallet to vote on candidates/proposals, send funds and onboard volunteers. Foreign allies can directly assist", "experience": "Goma Cardano Hub:\nRegular Haskell and Plutus training since Sep 2020Goma Cardano Stake Pool running several Testnet Nodes in Goma4 developpers and technical professionalPlutus and Atala-Prism Project based learningWeekly meet-up since Oct 2020 to promote Cardano Blockchain\n"}