{"id": 400662, "author": "daniandrade", "title": "Educational tool kit f/ legislators", "url": "https://cardano.ideascale.com/a/dtd/400662-48088", "category": 26446, "amount": 66125, "description": "Decision makers in Brazil do not have basic knowledge about blockchain. \nTranslations for  PT_BR, EN, ES, FR in the attachments ", "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"id": 951, "q0": "\"This proposal clearly outlines the problem while also closely aligning with the challenge of lobbying for favorable cryptocurrency legislation. On Feb 02- 2022, Brazil's Senate made its first step to regulate its cryptocurrency market with the body's economic affairs committee unanimously approving a bill that creates rules for digital currency funds. If approved, Brazil would be the largest Latin American country to regulate crypto (https://www.bloomberg.com/news/articles/2022-02-22/brazil-s-senate-takes-first-step-toward-regulating-crypto). This legislation could create favorable or unfavorable conditions while also serving as an example for the rest of Latin America. \n\nThis proposal outlines an excellent approach to lobbying for favorable legislation as the proposer has a vision of creating a think tank as a vital source of information. The ThinkTank could effectively act \"as an agent of change that carries out information transfer, aggregating and presenting knowledge through collaboration with various public and private actors.\" \n\nThe Think Tank's first product will come in the form of a blockchain toolkit website for policymakers. An educational tool kit for legislators focusing on best practices could drive informed decision-making as it will counter misinformation and positively impact the regulatory landscape in favor of cryptocurrencies which would directly benefit the Cardano ecosystem. The proposal also plans to hold various events, such as a launch at National Congress to promote the tool kit. The press will also be invited to cover the creation of the think tank, the toolkit, and the launch event at National Congress. \"", "q0r": 5, "q1": "This proposal has already established a team. Primarily Maria Carmo and Daniella Andrade, along with various positions budgeted for the enablement of the proposal. For example, press officer, developer, lawyer, etc. Maria Carmo's experience in the Cardano ecosystem is verifiable as she has been involved in the Cardano ecosystem as Cofounder of Cardanista Stakepool (verified on ADA.pools), Lovelace Academy (https://lovelace.academy/) and works as an advisor on several projects including Cardano Warriors, Little Goats, and Catalyst School Latam. \n\nDaniela Andrade, has a solid background in public policy and has held various policy and research positions. She is well acquainted with the political landscape that could translate to this role.   Their combined expertise is more than sufficient to carry out this task.\n\nThe budget is highly detailed and is segmented into a verifiable plan which outlines all the components necessary to accomplish this task. Given the limited accessibility to political decision-makers, the timeline (6 months) may be too stringent, but it is still a realistic timetable. The budget request is 22% of the total for this component of the F8 campaign. \n\nCovid was addressed as a risk component, but online events could be as successful. Also, the mobilization and involvement of politicians, which is one area I'm concerned with, is addressed as a risk. However, they are mitigating this risk by budgeting for a lobby specialist. ", "q1r": 4, "q2": "There is a clear, understandable description of the targeted problem.  The roadmap provides enough information to ascertain whether or not this could be successfully implemented. \n\nThe road map provided extends over the next six months, with key deliverables/milestones supplied at various stages. However, the roadmap to the solution lacks some detail.The proposal could be improved by outlining a roadmap in more granular detail. For example, what deliverables will the lawyer, lobby specialist, and press officer deliver over these six months? If we can estimate the cost of their services, we can indeed provide what deliverables are associated with those costs. \n\nOverall, I agree the solution is clear, addresses the problem, and provides metrics and deliverables which define success.", "q2r": 4, "assessor": "z_assessor_1247", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5052, "q0": "Proponent Maria Carmo, is a seasoned and effective Cardano community entrepreneur and this shows in the effectiveness, clarity and completeness of the proposal. The proposal offers exactly what is required of it, a serious detailed plan, lead by experts, that can be effective in influencing large important constituencies, in this case, Brasil.", "q0r": 5, "q1": "The experience and reputation of Maria Carmo is easily verifiable in the internet and in common communications channels of the Cardano community. Unfortunately, the situation is not the same for the expertise of her co-proponent Daniela Andrade. It would  have been great if they had provided links to sources demonstrating both of their bios. Nevertheless, the writing of the proposal and the detailed and thoughtful planning displayed in it, support the claims of skill and knowledge offered in the proposal and required to successfully implement it. Furthermore, the previous execution of Maria Carmo's endeavors within the Cardano Community, and the detail and thoughtfulness of the planning suggest a good chance of success for the proposal.", "q1r": 4, "q2": "Yes, As a result of the detailed and knowledgeable planning demonstrated in the proposal, it offers concrete and impactfull  milestones to audit its progress and success.", "q2r": 5, "assessor": "z_assessor_183", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8998, "q0": "The problem is not clear. For example, the proposer doesn't explain whether the lack of understanding has resulted in bad laws being enacted or if the space is just being ignored. Also, it's not clear how a toolkit that helps legislators understand public blockchains would automatically translate into their understanding of how to regulate it in a way that's favorable to cardano stakeholders. ", "q0r": 2, "q1": "It seems that the team has familiarity with Cardano and stake pool operations, and also some of the ecosystem projects. The team also has experience in govermental affairs, which could be relevant to the challenge. And given what they propose to deliver is a toolkit and press releases/media, I do think the team has the experience to deliver. ", "q1r": 4, "q2": "It will be possible to audit the materials the team will create. But in terms of the budgetized items for funding, it will be very difficult to show that payments for transportation and meals, etc are effective ways of creating toolkit. ", "q2r": 3, "assessor": "z_assessor_716", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9092, "q0": "Think tanks are very important institutions influencing ideas and policy decisions. Though the proposal addresses the challenge, a new think may not be able to make the necessary impact in the short term. \n\nIt will be more appropriate to partner other think tanks to leverage on their reputations so the tool kits would be embraced by policymakers", "q0r": 3, "q1": "In as much as the team looks strong there are no links to verify their previous works to ascertain how well and prepared are they.  \n\nThe requested budget looks to support more travel than to use to run the think tank to make the necessary inputs through advocacy and the toolkit.\n\nI am not sure this project will be implemented successfully. ", "q1r": 3, "q2": "The information is quite enough good for auditing. However, the KPIs are not measurable and seems to be assumptions over reality. ", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10484, "q0": "The issue about developing a tool kit for legislators is an excellent one because they will be well informed about Blockchain and obviously about Cardano and Project Calalyst. This will enable them to make good laws and regulations that will provide an enabling environment for the community to strive. I am happy that the proposal targets to create a ThinkTank that in this challenge will deliver a “toolkit”. This I think is useful in shaping the political sphere characterized as an agent of change that carries out information transfer, aggregating and presenting knowledge through collaboration with various public and private actors. This will also encourage collaboration among the various stakeholders. I believe this is a good proposal since the ThinkTank will serve the legislators very well.\n\n\n\n \n\nWhile policymakers may not have the tools to respond quickly to a critical policy issue, they often suffer, not just from a lack of information, but also from an “avalanche” of unstructured information that ends up negatively interfering with decision making. Overcoming these obstacles often requires knowing where to turn to rigorous, reliable, and accessible information and analysis.", "q0r": 4, "q1": "The timelines given are well thought through and capable of being achieved.\n\nThe timelines which states from the proposal:\n\n1st month: website ready with initial content about ThinkTank.\n\n1st to 4th month: period for preparing and publishing the Toolkit.\n2nd to 6th month: press inserts/podcasts about blockchain and ThinkTank.\n4th to 6th month: actions of organization and execution of the launch event in Brasília.\n6th month: holding the event and inserts in the press/podcasts.\n\nI was looking out to seeing a brief of the content the proposers will include in their press information, conferences and podcasts. This will inform community members as well outsiders about what they seek to achieve with the proposal.\n\nA more detailed information about the team members could have also be commendable than a scanty one.\n\nBut I am however impressed about the way and manner the team members have indicated about how they have been involved in Blockchain activities including Cardano.\nA Total Budget of  $ 66.610,00 requested is not bad at all. The proposers have been able to state how they intend to use the funds to execute the project. \n\n\n\n\n\n", "q1r": 5, "q2": "I am enthused about the idea of educational tool kits for legislators. It's going to improve on education about Cardano and Project catalyst. I am also of a firm believe that the proposal addresses the challenge, however the proposal seems to only focus on curving out educational tool kits and targeted at only legislators when there are other arms of the  government in the country that can help to institute policies to help spread the gospel of Cardano and Project catalyst. \n It is not clear, given the information provided, how the team foresees that their project may scale up to the current and future requirements of Project Catalyst. The team could relook at it. The proposers have also provided a roadmap and timelines for executing the project which is commendable. The brief idea the proposers also created about their experiences are also impressive and I think there the auditability of the project is possible.", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Creation of a ThinkTank with the first product being a blockchain “toolkit” for political decision makers.", "experience": "Maria Carmo – Co-founder of Cardanista Stakepool, Lovelace Academy, part of Catalyst School Latam and DEFI school. \n\nDaniela Andrade – More than 10 years of experience working in Brasília in the area of Government Relations, working with several organizations."}