{"id": 400719, "author": "nicoarqueros", "title": "Chamber of Digital Commerce for ...", "url": "https://cardano.ideascale.com/a/dtd/400719-48088", "category": 26446, "amount": 30000, "description": "Help shaping regulations in a way that support the industry and Cardano.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 5053, "q0": "The proposal addresses the challenge very well but it takes a very measured approach which is justified and reasonable but not too ambitious. The person and the organization proposing this challenge are knowledgeable about blockchain, Cardano, and lobbying in the space. One may believe that they could be more ambitious but, at the same time, if they are offering this measured approach is because they understand the issue, but also, because they may be overextending a little bit form the technical to the political. The participation of Nico Arqueros and dcSpark in this challenge is great, it would probably be desirable that in the future they coordinate with other proponents in the challenge to take advantage of their expertise and distribute tasks. ", "q0r": 4, "q1": "Yes, given the experience of the proponents and the plan offered it is very likely that this proposal will be implemented successfully. The team is credible, experienced , and has demonstrated skills in achieving success, and the plan is measured and reasonable. Furthermore, the most important challenge ahead is clearly identified and, I believe, the  proponents have the institutional capacity to manage the project for effectiveness.", "q1r": 5, "q2": "Given the elegant simplicity of the proposal (elegance in the mathematical sense), the information provided is sufficient to audit the progress and success of the proposal. Unfortunately, the \"metrics\" are limited to \"Monthly participation in activities organized by the Chamber of Digital Commerce.\" It would be important that the auditor and the proponents agree to communicate to the broader Cardano (and if pertinent), the blockchain communities, meaningful events, proposals and decision that occur during the activities of the chamber of commerce.", "q2r": 4, "assessor": "z_assessor_183", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5223, "q0": "This is rather clever of an idea and very strategic but does seem to lack some detail.. While I do still land in favor of the proposal, I think it would've been a much stronger approval if there was some clarity provided. I absolutely buy the argument that there is substantial difficulty in attempts to get 1:1 time with regulators and this proposal enables efficient networking opportunities. Though, I would like to see more quantifiable data regarding the number of participants, the amount of legislation that has come from participants of the digital chamber, and maybe how often meetings take place. Overall, I'm excited about this proposal but I do think the requested amount warrants a little more detail. ", "q0r": 4, "q1": "I appreciate the realistic outline of participation and contingency plan if things don't go accordingly. I think this presents a very low-risk model, in the event that dcSpark is denied membership. I would like a better breakdown of the potential costs for the 1-year membership and potential trips (based on the number of people likely to attend). However, these details aren't a deal-breaker for me.  I think it's a very simple proposal that offers risk-reducing contingencies. ", "q1r": 5, "q2": "Normally, I'm a stickler for quantifying KPIs and success metrics. In this case, I don't feel it necessary to be strict on that and I can't really come up with creative ways to do that. I think the proposal is straightforward and offers very simple benefits that are facilitated by a very trustworthy team. ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8308, "q0": "In terms of Impact, this is clearly a five-star proposal. The Chamber of Digital Commerce is composed of an all-star cast of regulators, politicians, business leaders, and others who wield enormous influence over the policy-making process in Washington, DC (I do find it a bit odd that the proposal references the Wikipedia article about the organization, rather than the organization’s own website). Having a voice for Cardano in that group would provide huge value to the community. The organization’s mission clearly states that they focus on working with policymakers and regulatory agencies, and thus the proposers’ participation would perfectly align with the challenge brief.", "q0r": 5, "q1": "The proposal writes that Nico (presumably Nicola Arqueros, Co-founder and CEO of dcSpark) previously led this type of initiative inside Emurgo and has experience working with the Chamber of Digital Commerce. The proposal does not commit to Nico participating directly, but that someone from dcSpark’s top management will attend the activities. When evaluating feasibility, it would have been more helpful to understand exactly who would participate in the activities. Lobbying is a very specific skill. Being a brilliant coder or architect does not necessarily mean that the same person will be able to effectively articulate the industry’s needs to non-tehcnical policymakers and regulators. While the proposal makes it clear that Nico has prior lobbying experience, other management members may not have the same skills. In the absence of understanding exactly who would be representing dcSpark, and as a result be speaking for the broader Cardano community, it is difficult to evaluate the proposal’s feasibility.  I also find the information about the requested budget a bit confusing. The total requested is 30,000, but the line items don’t reference specific amounts. I checked the Chamber’s website, and annual dues are a minimum of USD 10,000. I can’t determine how much dcSpark would have to pay for their membership. The proposal budget would also pay for travel time to DC, but it is not clear if this is one trip or multiple trips. While it is entirely reasonable to pay for some travel, I don’t think that spending, for example, 20,000 for travel and 10,000 for the membership would be a reasonable distribution of funds. Hence, further detail around exactly how much the membership would cost compared to the travel would be helpful. The proposal does state that “any remaining amounts won’t be taken from the requested proposal” but it isn’t clear what this means. The proposal notes that dcSpark management won’t be separately compensated for the time they spend on Chamber activities, which seems appropriate.  ", "q1r": 4, "q2": "The proposal notes that if dcSpark is not able to join the Chamber, the funds will be returned. While a promise to return the funding does somewhat mitigate the risk that the project will not be completed successfully, it would be very helpful to know how likely that risk is, particularly since funding this proposal would necessarily mean that some other project is not funded. If Nico has participated in the Chamber in the past, I would think it would be relatively straightforward to know how likely it is that dcSpark would be accepted as a member. It would also be helpful to better understand which issues or working groups the dcSpark team would target. The proposals references that the team understands “Ouroboros, eUTXO and other technical models related to Cardano,” but those are technical issues and are not the focus of advocacy groups. The Chamber’s website lists its policy priorities as: “National Action Plan for Blockchain,” “AML/CFT Compliance” “Regulatory Clarity for Digital Tokens,” “Guidance for Digital Asset Taxation and Accounting Standards,” Legislative Tracking & Advocacy,” and “Promoting the Use of Blockchain in Business and Working with Innovators to Grow the Industry.” It would help with auditability if the team had provided just a bit more direction on where they plan to engage with the organization, and what specific outcomes they would be working towards", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Participating with the Chamber of Digital Commerce will help us interacting with regulators and other key players in the industry.", "experience": "Nico previously led this type of initiatives inside Emurgo and also he was one of the board members of the Cardano Foundation. He has experience working with the Chamber of Digital Commerce and other organizations."}