{"id": 400884, "author": "drllau", "title": "Co-regulation, not Red-Flag laws", "url": "https://cardano.ideascale.com/a/dtd/400884-48088", "category": 26446, "amount": 150000, "description": "Circuit switched jurisdictions are enacting laws inappropriate to packet switched Internet of Value. Co-regulation to address public policy.", "f6_no_assessments": 3, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 8309, "q0": "The proposal aims to “leverage our existing body of thought leaders to collaborate with the Cardano community to identify, focus, and ideate solutions to existing policy problems facing crypto adoption.”  At a high-level, this worthwhile goal aligns well with the challenge brief, which is seeking to create “an environment of laws… more favorable or less harmful to the crypto space.”  However, in spite of the large volume of text and links provided in the proposal, several critical questions are left unanswered, which make it difficult to assess the proposal’s impact. The LexDAO organization seems to be rooted in the Ethereum ecosystem. I had some difficultly researching LexDAO as some of the content seems to be restricted to members. But I found references to Gitcoin grants, references to ETHDenver, and in the video showcasing Geoff Costeloe, he makes reference to his experience as a Solidity developer. The proposal explains that as a first step they would “Sense the Cardano community to nominate public submissions opportunities.”  Part of this work would include “polling affected Cardano subDAOs.” I wish that the proposal had provided more details about how they plan to leverage their experience in other ecosystems for the benefit of the Cardano ecosystem. As the CA Guide states, a characteristic of an impactful proposal is that it “clearly articulates how it will add value to the Cardano ecosystem.” Particularly given the large amount of funding requested, I would like to see more evidence and more specifics regarding how the funds would be used to benefit Cardano. ", "q0r": 3, "q1": "From what I could gather from the publicly available information, LexDAO appears to be a group of attorneys certified by some sort-of framework. As stated above, much of the information about the guild is restricted to the group’s members. According to the proposal, members of this group submitted feedback to the Wyoming legislature regarding a bill about DAOs. A link to their Github repo is provided. I found the GitHub pages to be full of jargon that was not explained either in the repo or in the proposal. For example, Github referenced “codeslaw chefs” and “PoAPs” and “OpenLaw markdown.” These references didn’t tell me anything about the specific regulatory goals the group was pursuing, and in what way their efforts has successfully impacted the proposed legislation.  \n\nThe budget breakdown references 40% of the funding would go towards participation prizes such as books, swag, or social capital. I am not sure what “social capital” means in this context as a prize to be allocated in return for participation. Given their total budget request of $150,000, 40% of that amount is $60k, which seems like a lot of money to be given away in the form of some sort of pirze. The second line item is 30% (or $45k) which would go to go the coordinator(s). As there is no information regarding who this individual is (or individuals are) it is impossible to evaluate whether they can feasibly deliver on this line item. The third line item involves paying bounties (20% or $30k). Additional details on how the bounty program would work would be helpful. \n\nThe final allocation is for, among other things, “Gas fees for PoAP.” It is problematic for a proposal seeking funding from the Cardano Treasury that they plan to use those funds to pay for activity on the Ethereum blockchain. Perhaps they are not aware that Cardano has its own NFT minting and smart contract capabilities. I refer to the above section regarding the need for more details about the benefits to the Cardano ecosystem. ", "q1r": 2, "q2": "The auditability section does not provide specific or quantifiable KPIs or metrics to measure. There is not method to assess or evaluate what work has been done with the large amount of funds requested, whether that work was effective, and whether it successfully responded to the challenge brief. Given the lack of detail, it would be very hard for the community to verify whether the funds had been used to achieve the desired outcome. ", "q2r": 1, "assessor": "z_assessor_662", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 10513, "q0": "This proposal is an attempt to create a hub for policy analysis and proliferation through a DAO. This would have the advantage of focusing on policy changes that have worked in several other jurisdictions and attempting to recreate that success without essentially starting the legislative process from scratch each time. There is an acknowledgement of some of the potential difficulties that will be encountered with this model including jurisdictional differences which is good to see. The overall approach is broken down into phases which are a little hard to understand and even have different names in the impact section. The assumption is that these phases are part of the governance structure that the DAO will use to create beneficial legislation. With all that said I am having difficulty understanding how this way of producing a product (a piece of legislation) is better for the Cardano community than using catalyst to propose and fund these same products internally. If there is a distinct advantage specifically to using an outside structure for this I don't clearly see it and perhaps that could be expanded upon. One of the key pieces of this proposal also focuses on running \"hackathons\" which in this case are akin to crowdsourcing legislation. The monetary request to do this is high and again I do not see an explanation of why the model used in this DAO to do this is fundamentally better that using existing Cardano governance through catalyst. The possibility of being able to learn from previous legislative success and quickly apply those successes elsewhere is appealing but I feel the reason for the particular model used requires more clarity given the large amounts of funds requested. Another aspect of this proposal is that these proposed legislative documents would be useful across jurisdictions and be scaled globally. This is a big statement which would need clarification since jurisdictions all work under different models and authorities and therefore it is not self evident that this would work. For these reasons I neither agree nor disagree that this proposal effectively addresses the challenge.", "q0r": 3, "q1": "The proposal has identified a number of particular legislative documents and entities that it would like to crowd source responses to/for. It also has left a category open for \"various crypto bills\" on top of the specific ones it mentions. This is good as it provides concrete goals but also some flexibility. It also provides 3 examples of previous work which consists of a petition, a proposal and a bill amendment proposal. This to me shows that there is a clear an achievable objective of producing crowd sourced responses to these various entities. I have been involved in petitioning government for legislative changes throughout my professional life on many occasions although admittedly only in one jurisdiction. From my experience politics is often about who you know rather that what you know. I would like to believe that the approach that this proposal aims to achieve of \"a sniper shot\" rather than \"shotgun\" is functional but I do not see the evidence of that yet. The examples that were provided do not show any resulting legislative changes. As a suggestion I would like to see a lobbying component to this proposal. Creating good policy is half the story, selling it is the other. I think this proposal shows that it can accomplish half that fundamental equation. Since this is also fundamentally a new approach I may be wrong about my assumption that you need lobbying for this type of initiative. In that case I would suggest that the proposer provides more examples of successful legislative changes that have been accomplished using their method. At this point I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 3, "q2": "The metrics used for success are articulated and would be relatively easy to assess. There are no specific quantitative numbers given as to what would constitute a successful participation at a hackathon, or numbers of media mentions. Some more specifics would be useful in this section but the fact that qualitative goals were established is acknowledged. However more importantly there were many actions identified in the feasibility section which are ultimately what is important as metrics for this proposal. These are easily verifiable since they are public record documents that would be submitted to the various legislative agencies. Also successful legislative changes would also be easily verifiable and shared. I would suggest that these various concrete objectives be included in the auditability section of any future proposals for ease of assessment. Timeframes for how quickly these various documents could be completed and submitted should also be included. Given the many easily verifiable objectives I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_935", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1307, "q0": "The Proposal has a number of interesting thoughts and a jumble of concepts. One of the Risk Management statements resonated with me regarding this proposal when I finally came upon it. The statement of risk Is: \"Incomprensible (exact spelling) Pitch - technical gobbygook deters grass-root advocation\".` Unfortunately, for what I think, could be a powerful proposal left me  with a bewilderment towards what this Proposal was working to achieve. I understand it is primarily seeking funding for a series of Hackathons of about 5-10 thousand per / total of $200,000 out of a budget request of $150,000. I have not been able to fathom what the Hackathons will achieve. Further I am not able to conceptualize how the proposal is demonstrating to address the Challenge of Crypto Currency favorable lobbying, education, rule influence or privacy legislation. I would advise the Proposer to re-edit the proposal and put it in ELI5 language for other Assessors and the Voters. Simplify, and make the proposal cohesive in it's concepts and please explain how it addresses the Challenge.\n___________________________________________________\nI would suggest that the proposer explain what Lex Dao is and exactly how the described three step solution of a)Sense; b)Analyse; c)Respond - meets the key metrics set forth in the Challenge Brief. The metrics are: # of jurisdictions; # of laws; # of experts; # of collabs; & # of votes.\n__________________________________________________\nI rated this as 3 or neutral in agreement or disagreement with whether the proposal effectively addresses the challenge due to the methodology of the writing and idea formation. My advices to clarify the Proposal may change my rating and perhaps more importantly the opinion of the Voters. I would also suggest a re-editing to correct the mis-spellings.", "q0r": 3, "q1": " I do not believe this proposal will be successfully implemented and it does not appear to solve the Proposal problem.  The proposal is not focused in it's presentation, which may be its biggest challenge to voters. Second the budget request does not meet its suggested expenditures. The solution (distilled version) is to 1. Sense, 2. Analyse(not my spelling), 3. Respond. The budget allocates $150 - 200 K out of a $150,000 Budget request towards 20-30 Hackathons with 40% of that for swag.  There is no budget allocation for the first two endeavors of Sensing and Analyzing.\n____________________________________________________\nThe team behind the proposal is a little fuzzy to my research.  There is a github with primarily a Youtube vid about DAO Denver. There is also a LexDaO Discord which apparently is a $300 a year membership driven not for profit association about legal settlements and coded agreements. It does appear to have history of what looks like legal consulting for a fee.\n____________________________________________________\nMy suggestion for my comfort level and perhaps those of the voters would be to adjust your proposal to state exactly who the team members would be administering this budget and the plan. Include bios, Linked-In profiles and other credible sources for team vetting. ", "q1r": 1, "q2": "The proposal has some milestones, though they do not correlate to the milestones set forth in the Challenge Brief. KPIs are not included in the proposal.\n_____________________________________________________\nMy advice after Assessing this proposal would be for the proposer(s) to re-read the Challenge Brief and address your proposal to the Challenge requirements. Your concept may be powerful and may achieve what the Challenge is seeking but the Proposal does not communicate that and does not conform to my interpretation of what the Challenge goals are:  CryptoCurrency Lobbying, Education of Politicians, Rule influence and favorable Privacy laws. Please apply the Key Metrics indicated in the Challenge Brief to your Proposal.", "q2r": 1, "assessor": "z_assessor_1339", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Coordinate - Considerate (careful thought) - Collaborate\nNetwork of members, local leadHackathon on open submissionPolicy repo to compare", "experience": "LexDAO previously crowd-sourced internally and submitted to govt (US Senate Banking, Wyoming DAO amendments, SEC). We aim to extend this experience globally (SDG 9) for other communities as part of wider mission of justice for all (SDG 16) and democratisation of finance (SDG 8)."}