{"id": 403011, "author": "wolstaeb", "title": "Impact Finance Regulatory Sandbox", "url": "https://cardano.ideascale.com/a/dtd/403011-48088", "category": 26446, "amount": 99450, "description": "Financial market regulations aim to protect investors but make financing of smaller social and environmental impact investments expensive.", "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is by far the most powerful one in the overall challenge. There are a few key reasons for this: \n\n(1) it aims to establish a regulatory experimental sandbox for impact investing in New Zealand, working together with local regulators. \n\n(2) There is a perfect alignment with the challenge. In contrast to other proposals that bring forth success indicators difficult to measure (number of meetings with [...], number of laws influenced, etc.) this proposal aims at working closely with the regulators, and trust me, this is the only way to change a regulator’s appetite for legal and fintech innovation, in a low-risk setting environment brought by a sandbox regime, without pressure from licencing requests, media attention and high-stake projects that can turn all the regulator´s red flags indicators on and potentially turn into a completely risk-off mode.  \n\n(3) Huge scalability potential. There are a few countries / unions around the world whose financial regulatory regimes are beacons of light for all the others: Australia, UK, EU, US being a beast of its own. New Zealand is definitely one of these regimes, and a successful sandbox project there, properly documented and available online can become a huge source of inspiration and model for good practice for other let’s call them tier-2 countries whose local regulators simply do not have the knowledge / capacity to spear-head such bold projects on their own without technical assistance from outside. ", "q0r": 5, "q1": "The team seems very solid and broad in its blend of competencies within the 6-person team: one academic profile, a former public servant profile (crucial to have the regulator’s eye), a lawyer, and two software / business sector members. \n\nThe budget is predominantly focused towards the research writing (60%) with an hourly rate of USD 150/hour. The rest of the budget is split between consultations with regulators (15%), project management (9%) and proof-reading, web-dev, video production, etc. with 1-3% each. Having a bit more transparency for each budget line would have been very useful, however. On a personal note, seeing how another solid research proposal from Fund8 is offering an overall hourly rate significantly lower than the one we have here, I find that the value for money from this proposal could have been slightly higher for the community. \n\nThe team expects to start the project in July 2022 and finish it within six months. A few broad-brushed milestones are set out for month 1 and 3 of the project, so overall there is fair / good enough outlining of the project.  ", "q1r": 5, "q2": "The final result will be published in a report and supplemented by video material, useful for the promotion of the blueprint in NZ but other countries as well. Helping to build an ecosystem of public officials interested in championing legislation in New Zealand and beyond.\n\nTracking the project will take place in Orbit, a web-based project management / CRM tool if my quick glancing over the website was of any use. I am not sure however if any of the key items there will be available live for the community or whether periodic updates will be provided by the team. The Blueprint will be published under an open-source Creative Commons licence, another strong point of the proposal for avoiding any type of tendency to gain control of the work after the end of the project.The published report will also be maintained in a public Github repository.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "The assessment provided by the assessor is excellent. The assessor clarifies their reasoning, provides critical thought on the proposal, and contemplates their perspective. They offer expertise without writing a resume and provides positive coaching. It is easy to see how the assessments' scores relate to the advisor's perspective."}, {"q0": "This proposal is about establish a regulatory experiment for Blockchain-based social and environmental financing, called a Regulatory Sandbox for Impact Investing. The blueprint’s focus is on New Zealand regulation, a country which is suitable and favorable for testing policy innovations. They will also create media assets such as motion graphics, video, and website,... and run webinar to present the result to regulators and interest parties. These activities are unified and mutually supportive, which will make the project completed and have good impact to the New Zealand market regulator and tax authority so as to to acquiescent to regulatory experiments for impact investment.\n\n", "q0r": 5, "q1": "It is highly likely this proposal will be implemented successfully because the team members all have many relevant experience and they seems to be talented and successful on these fields. They present well their solution to the problem, which includes awareness of reality application, opportunities and challenges of the project. They also demonstrate a clear vision and a detailed plan to action toward that vision. The detailed budget breakdown is convincing.\n", "q1r": 5, "q2": "The proposal includes clear roadmap yet concise with stage and activities, target for these activities on each phase. This make the progress of the team transparent. In addition, the output is easy to audit: research, legal review, consultation, writing, media assets or webinar. The definition of success is also on point. We can easily see the Blueprint after it is published and marketed.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Overall a good assessment and perhaps an excellent assessment. The assessor provides a thoughtful summary of the proposal in the impact assessment and offers a personal perspective on the structure of the proposal's activities. Moreover, the impact, feasibility, and auditability assessments are concise and informative, supporting the assessor's score; they inform voters. "}, {"q0": "The proposers are piggybacking on the ESG trend in investing and initially it sounds very promising. “A blueprint for creating a regulatory sandbox to experiment with innovative DeFi in social and environmental finance” that could definitely have global appeal in this day and age. Although it’s mentioned once that the end results - a report, a website and video material - can be used for “championing legislation in New Zealand and beyond'', it is still very much a New Zealand centric proposal. As such, it might not be justified to spend one third of the challenge budget on this.", "q0r": 3, "q1": "According to the proposers “the research and writing team are professionals in law, legal scholarship, public finance, policy, blockchains, and software engineering”. Looking at the list of team members confirms this. They are heavy-hitters representing diverse backgrounds and, as such, there is no doubt that they would produce quality results within the scope of this proposal. The only issue is the price. Even if they state that the “hourly rate of ~USD$150 is on the low side for the domains and experience in the team”, spending $62,000 in research/writing only should be justified in more detail. Finally, in the section about risks it is mentioned that there might be issues with team commitment as well as difficulties in gaining the New Zealand regulators’ interest.", "q1r": 4, "q2": "The proposal is written almost as if it was a scientific paper itself. The way the proposers have included a list of references is commendable. Having said that, some of the language in the proposal could be a little less academic (e.g. “enable pluralism in appropriations and funding of value-based care pathways”). Another point of criticism is citing the “Legal Hackers (NZ) webinar brown-bag sessions” which, according to the team, is not part of the proposal’s budget. If so, then why mention it so often? Although there are no numerical goals and metrics per se, the overall plan to follow-up progress is in place. They will report with a Gantt chart (updated monthly), a log of completed and planned team activity, an intermediary literature review, and drafts/report published in a public Github repository.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is looking to help build an experimental regulatory sandbox that will be used to research, innovate ,and design a plan that the (New Zealand) government can look to for implementing blockchain-based solutions.  Although this solution is intended for New Zealand, the process could be scalable for other jurisdictions and could impact and create favorable legal conditions elsewhere", "q0r": 5, "q1": "Since the goal will ultimately be a blueprint type of paper, the ability to write this document is not really a question.  The only questions would be that the team has the breadth to cover the entire scope in which they are looking to cover.", "q1r": 4, "q2": "Traditional project planning tools will be used, but details into what the drivers and metrics that will be used to measure progress are a little vague.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "I really like this project. It makes clear that open-ended research and experimenting for good regulations is much better than blatant lobbyism, hence it is more appropriate to this challenge than a lot of other proposals. Setting up the research in this open, progressive way will help adaptibility and scalability a lot, so it will sure be beneficial for the Cardano ecosystem.", "q0r": 5, "q1": "The proposal makes clear what is being done and how and gives us a good, comprehensible implementation plan. The budget is transparent and a thorough risk-mitigation section is presented. The competence of the team speaks from tge proposal so I am positive it is feasible.", "q1r": 5, "q2": "The problem description is clear and offers a comprehensible, detailed solution. The way of tracking and auditing is presented clearly, and the success metrics are suitable. Well done.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This proposal looks very exciting. It seeks to explore the possibility of using block chain in financing environmental and social impact assessment. The blueprint that would be developed, when successful could be useful avenue for raising funds for undertaking ESIAs in an era where multinationals demand a huge amount of paper work to support such projects ", "q0r": 4, "q1": "Given the diverse background of the proposers in terms of experience from academia and industry, I strongly believe the piloting of this project in New Zealand will be successful for it to be replicated in other countries. The project activities outlined are implementable.", "q1r": 4, "q2": "The indicators of success of the project as outlined in the proposal need to be clarified. Also there is the need to indicate how the Orbit Gravity [31] will be used to measure the KPIs to help in auditing the project progress.", "q2r": 3, "assessor": "z_assessor_270", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Research and write a blueprint for creating a regulatory sandbox to experiment with innovative DeFi in social and environmental finance.", "experience": "Commercial and Intellectual Property Law; DAOs & Blockchain regulation; Financial markets software engineering, Govtech, Impact Investing market technology; Economist, public offical, markets and public finance; Data and analytic strategy for social investment and taxation."}