{"id": 404539, "author": "cargofe2", "title": "Colombian Congress Cardano", "url": "https://cardano.ideascale.com/a/dtd/404539-48088", "category": 26446, "amount": 8000, "description": "Colombian congressmen require quality information about Cardano to make better legislative decisions on cryptocurrencies in 2022/26", "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 5238, "q0": "This proposal demonstrates either a lack of specific information or lack of relational resources from which to pull specific information. The only specific information we are provided is the name (and LinkedIn profile) of the person driving forward the movement.  There's a lot of rhetoric about working with senators, developing allies in congress, and interviewing representatives holding office in Columbia. None of this description provides any specifics (except for mentions of general political parties), in terms of names of individuals or organizations.  I'm not entirely concerned about the risk of funds being thrown away because $8000 seems like a relatively reasonable amount for the importance of the proposal goals. However, the proposal does not appear to be coming from a place that is too heavily intent on driving Cardano in particular. Ultimately, I don't have a ton of confidence that the money will be spent well if I'm drawing from the information we've been given, but I also don't think the requested funds are unreasonable. ", "q0r": 3, "q1": "The roadmap is rather concerning because it seems to reveal that there are no solid or reliable connections made with existing political figures. The proposal seems to indicate that one figure has been connected with (I assume using this same methodology of cold calling politicians), but it doesn't indicate the name of that politician. There also isn't any market research or data provided to indicate that there is a reasonable expectation that any of these political figures would be receptive to allying with the Cardano (or general cryptocurrency) community. I would also like to see a little more depth on the proposer's track record of acheivements in his career. ", "q1r": 2, "q2": "I think the metrics for measuring the success of this proposal are a sufficient criterion. I do think there are imperfections here to be concerned about, such as a lack of sources provided to monitor and measure this success that is publicly accessible. Still, I do think that the structure for measuring success is an effective tool for determining success and enabling a need for adjustments. ", "q2r": 4, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7040, "q0": "This proposal effectively addresses the challenge as the proposer is willing to promote Cardano among the congressmen of the colombian parliament in order to bring awareness and drive favorable legislation for crypto adoption.", "q0r": 5, "q1": "The proposer has been already funded in Fund 7 for the same proposal, bringing the first results by engaging with the first congressman and arouse the attention of a young senator. \nThe proposer is well experienced in the field and he can continue to deliver the proposal in the right direction, spreading awareness among the new congressmen after the election in Colombia [2022]. \nThere is a HIGH risk that the new parliament will not be interested in discussing this matter in the first months after the elections. ", "q1r": 4, "q2": "The proposer listed a complete timeline and the budget breakdown is very simple, at it takes in account 200 hour of work for one person at 40usd/h, which is quite realistic.\nThat would be equivalent to 5 weeks full time (1.25 weeks dedicated every month, from June to September).\nThe most important KPI is regarding the number of laws drafted/discussed after the congressmen have been involved. \nThe proposer states \"...This strategy will allow a close defense of the community against high impact legislation that is already in progress...\". I would have liked to know which legislation is already in progress which needs to be stopped or modified. ", "q2r": 4, "assessor": "z_assessor_530", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9113, "q0": "This proposal is addressing the challenge with clear areas of focus. It also a continuation of previously funded project and to scale up measurable outcomes, the proposal seek further funding to achieve that. ", "q0r": 4, "q1": "Experience has been gathered from the previously funded project. This makes the team member the trump card and key lead to engage congress. \nAn unfinished business is no business. It is therefore realistic that this purpose driven approach to engage congress is achievable. \n\nThe budget is reasonable to undertake this project for the necessary outcomes. ", "q1r": 4, "q2": "The KPIs are clear for auditing but some look highly a long term one. This Number of laws impacted by this process. This is unlikely measure in the short term.\nSince it is a continuation, it is easier to build on the previous auditing to track success. \n\nHowever, the proposer should consider providing progress reports with success stories .  ", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "It is necessary to inform Colombian Congressmen now in a direct way through interviews that solve doubts and determine positions.", "experience": "Consultant with 15 years of experience, former congressional official with extensive knowledge of the target profile"}