{"id": 404815, "author": "adamrusch", "title": "IRI: Educating Crypto Regulators", "url": "https://cardano.ideascale.com/a/dtd/404815-48088", "category": 26446, "amount": 25000, "description": "The blockchain community needs to educate regulators on crypto and blockchain policy best practices if good legislation is to be drafted.", "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 2704, "q0": "IMPACT:\nThe team describes the clear necessity for education and knowledge about blockchain best practice on legislation and crypto regulation. They provide details about the non-profit ‘Immutable Research Institute’ (IRI) they are part of. Its mission is to educate individuals about blockchain technology and advocate for better regulatory frameworks that support this industry. I consider that this proposal is a step ahead as a project, since the team has already established a non-profit entity, by registering it formally. In addition, the proposers are not only planning on keep adding online text/video sources, but also setting up formal events for public consumption about cryptocurrency regulation. In this regard, the proposal offers a professional plan in-place, according to the fund challenge. The key metrics and goals are aligned with the challenge of education for favorable legislation, and the creation of a positive environment for mass adoption in cryptocurrencies. On the other hand, the team mentions that they will continue with the educational labor at IRI, regarding of getting funded or not. I can assume this is feasible, since they have officially registered the organization, which involves state and government documentation and some sort of legal commitment.  They explains the goal of establishing institutional credibility by offering professionalism and trust as an authoritative source. This in an important aspect projects need to address when it comes to add value to the Cardano ecosystem and new crypto adopters. We can also find additional information at the IRI official website, and the team professional experience in the educational, research and scientific fields. This also adds credibility to the proposal. \nScore given: 5\n", "q0r": 5, "q1": "FEASIBILITY:\nSince the non-profit organization IRI is already established, the first step of the project implementation is met. The team describes how they are planning on engaging in educational activities and the facilitation of more programs. I would suggest mentioning and list those activities and programs by offering links for public access.  \nOn the other hand, this proposal provides in an identifiable manner, the number and details of the team members and their professional experience. We can also find their social media links (Twitter and LinkedIn) at the ‘About Us’ section of the IRI website, as verifiable online sources. \nRegarding the budget, the proposers offer a description of the amount needed on each area (Constituent Relationship Management, legal expenses, seed funds for event planning, and down payments). Although, the budget requested for keeping an organization active and running is reasonable, I would suggest offering a more details on the identifiable items, so the public can understand in a clear manner the definition of each area.\nIn terms of the goals timeframe, the proposers offer a realistic roadmap of the work progress (12 months). With an official organization backing, they describe wanting to build a network of like-minded individuals who can coordinate education. By the end of the project maturity, they will be holding events to advance the crypto interaction to help understand principles of law and regulations of blockchain. I would suggest explaining or specify how they will be planning on organizing those events, such as: format guidance, meeting procedures, and verifiable attachments to measure the process of the educational contribution. \nScore given: 3\n", "q1r": 3, "q2": "AUDITIBILITY:\nI consider this proposal will be able to assess the progress by providing updates on their non-profit website IRI and social media accounts. Most of the team proposers are public known in the Cardano ecosystem, based on their community contributions. For Instance, Adam Rusch is a PhD professor, and one of the Core members of ADAO (Cardano Educational DAO). Matthew Plomin is the founding member of the IRI, Tech Leader of the “Project Book Worm” CNFT collection, and he also has experience working in financial and business regulatory-compliance guidance. These previous professional references are important to ensure the correct project implementation and execution of the project, since the proposers are committed to provide public progress verification to the community. However, the team mention there are several experts in regulation, lawyers and other members involved in this project. In my opinion, it is important to add and attach as many information as possible to guarantee the success and professionalism of the proposal. Finally, they offer information about their experience and connections with groups like ADA Café (a collision of Twitter spaces which offer free assistance and public information about the Cardano ecosystem), ADAO, The Alexandria Project (which is well-know for providing educational tools attached to the blockchain of Cardano). Other projects they have collaborated with are Runtime Verification, Wolfram Blockchain, and Disruption Lab at Gies College of Business. I would encourage them to add further information or links that can verify the existence of all these projects or programs for public access. \nScore given: 4\n", "q2r": 4, "assessor": "z_assessor_1557", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 135, "q0": "This proposal will facilitate communication between policy makers and industry experts. Therefore, perfectly addressing the challenge brief of lobbying for a favorable legislation. By establishing their organization near a university, they will have access to students who might become future lawmakers. The only thing I'm missing is a detailed strategy on how they want to influence policy makers. Therefore, I rate this proposal with a score of 4.", "q0r": 4, "q1": "The proposer team has all the necessary experience to successfully implement this proposal. They have already started the process of obtaining their 501(c)3 status and are working together with a reputable law firm. Their claim of continuing this project even without funding gives me great confidence about their conviction and mission.\nThe timeline presented seems realistic and plausible.\nThe only issue I have is that they do not describe what will happen if their motion for a 501(c)3 status gets denied. It is probably unlikely, but it would have been great if that would have been addressed.\nI rate feasibility with a score of 4.\n", "q1r": 4, "q2": "The proposer team provides a well thought out roadmap and detailed plan on how they aim to deliver their project. The budget breakdown is sufficient and seems realistic.  Their plan of sharing progress via social media channels and their website will ensure an easy way to audit their progress. To further boost transparency I recommend sharing detailed cost breakdown on how the potential funding will be spent.\n", "q2r": 4, "assessor": "z_assessor_1074", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 952, "q0": "The proposal identifies a problem that is a component of the challenge but not entirely hitting the mark of \"\"lobbying for favorable legislation\"\". \n\nThis proposal reads more as a request for seed funding to formalize their educational/research hub as opposed to a focused solution to the challenge. For example, they have requested $12,000 for a 1-year subscription to a CRM platform and $10,000 for legal expenses to ensure they are compliant as a non-profit. \n\nI do see that this could add value to the Cardano ecosystem as their research center would create awareness.  Unfortunately, their roadmap doesn't directly state at any point how it will engage political decision-makers to lobby for favorable legislation. This proposal could have been improved by dovetailing into the specifics of how this educational hub would be leveraged to meet the challenge. \"", "q0r": 3, "q1": "The team has provided evidence of their proficiency in this space. They are highly qualified with experience in education policy, asset management, and trading, and I'm confident they would be great allies in our quest to lobby for favorable legislation. Unfortunately, the roadmap does not mention how they will utilize their non-profit to directly meet the challenge apart from creating public awareness and establishing themselves as a research/education-oriented crypto hub. \n\nI do understand that their focus is to establish this research center and work towards the goal of creating \" a network of like-minded individuals who can coordinate education and advocacy.\" I'm just not sure that this proposal provides the best ROI compared to the other proposals that meet all the criteria of this challenge. ", "q1r": 3, "q2": "The roadmap primarily outlines how the team will formalize and grow their research hub. However, it is extremely high level and would be difficult to verify as the milestones don’t detail how the team will achieve success. \n\nFor example, \"Within 6 months we will be part of a robust network of blockchain advocates that are making a positive impact on the ecosystem. We will be operating quality education programs that helps people understand and appreciate blockchain technologies. We will also provide resources for other blockchain education and advocacy groups to form and help them get involved with our network.\" \n\nIn summary, I remain neutral with regard to the relevance and variability of this proposal.", "q2r": 3, "assessor": "z_assessor_1247", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1, "reply": "This assessment should be filtered out because the review author is applying their own criteria of what would be helpful instead of following the Campaign Brief: \"The idea behind this challenge is to fund specialists in regulation, lawyers, and politicians who can promote the creation of an environment of laws that are more favorable or less harmful to the crypto space, with a focus on PoS and on Cardano's particularities.\"\n\nWe make it very clear in our proposal that the creation of non-profit entities such as ours is essential to perceived legitimacy in the eyes of regulators.  Every industry has established lobbying firms, think tanks, and educational entities to do this work - and we intend to provide this kind of role in the Blockchain space.  As a Cardano-first organization, funding our CRM, legal fund, and event-planning budget is a good use of Catalyst resources because it makes the Policy community aware that we are active.\n\nWhile the reviewer essentially asks, \"what will your organization do for crypto\" our answer is that the very existence of a well-established organization is highly effective in and of itself."}, {"id": 5239, "q0": "There is very little to be pessimistic about here. This proposal is fantastic on a variety of different levels and is an incredible investment for the Cardano community to approve. First of all, the IRI is an advocacy group that has specific benefit to the Cardano ecosystem, as opposed to many other proposals that advocates for general cryptocurrency. Second, the legislative direction of US cryptocurrency regulatory law is substantial in the impact of the rate of adoption for a cryptocurrency. Third, $25k is actually a relatively low amount for the US because of higher regional costs than many other parts of the world. Finally, they are an experienced/educated team that is already established and doing the work they present in this proposal. I believe this demonstrates reliability in success and efficiency in the investment. ", "q0r": 5, "q1": "IRI gives a well-thought proposal and reliability in the impact of their work. There is little to no concern about any foundational startup hiccups because they are already established with a pending 501(c)3 non-profit foundation application with the IRS and the legal backing necessary to ensure approval. Their roadmap is clear and reasonable, the budget breakdown is clear and impactful, and the team's education and experience is very impressive. The relevance of this team's experience and relationship with the Cardano ecosystem is a very positive factor for the impact this could have on Cardano. ", "q1r": 5, "q2": "The collaboration between a list of numerous reputable partnerships definitely provides a level of accountability to the proposal goals. The metrics established to measure success is plenty sufficient to understand progress and their commitment to providing regular updates on their website and social media gives confidence to their transparency and accountability to the public.", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We have formed a non-profit entity that will hold events and share resources about how to properly understand crypto and blockchain.", "experience": "Founding members include Adam Rusch, a PhD in Education Policy and Lecturer in Information Sciences; Matthew Plomin, an Asset Manager for Deutsche Bank and CNFT Creator; and Kristoffer Knigga, a SysAdmin for High-frequency Trading Firms."}