{"id": 404826, "author": "jondepinet", "title": "Arizona for Cardano Lobby", "url": "https://cardano.ideascale.com/a/dtd/404826-48088", "category": 26446, "amount": 5000, "description": "Arizona has existing legislation and progress on blockchain topics. Cardano should be advanced in the same legislation", "funded": 2, "upvotes": 43929874, "downvotes": 1949763, "votes_result": 41980111, "votes_cast": 155, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 1313, "q0": "This proposal effectively addresses the Challenge Brief by directly addressing the top three stated goals : Lobby, Educate Politicians and Rule changes. By inference the proposal also addresses the last goal,  Privacy, but my thoughts are it is inclusive of the proposals education focus.  The proposal appears to be a Grassroots effort directed at one state - Arizona.  My thought due to the Gambling Industry and the amount of currency flow per annum this will be a vital state for a grass roots lobbying effort in America but potentially having multistate and multinational effect.\n___________________________________________________\nThe success statement in my opinion is solid and is directly targeted to the Challenge. The proposals success statement is to measure the legislative victories advocated for.\n___________________________________________________\nThe Key metrics as stated by the proposal are directly in line with the Metrics of the proposal and are to my thought a solid way of measuring success. These are: Licensing of the lobby entity by the state; Number of Legislators educated; Legislation proposed; Legislation passed.  A straight forward at bat to hit metric.", "q0r": 5, "q1": "My assessment is that this is extremely likely to be implemented. First, the proposal is accurately focused on the target set by the Challenge brief as mentioned previously. Second, the implementation plan is direct, well thought out and well presented. The initial budget request at first glance looked too low but the indication this will be an ongoing enterprise after the initial formation and lobbing successes made me realize how well the plan formulated is.\n___________________________________________________\nThe proposer is well integrated into the Cardano ecosystem , the state of Arizona and its politics.  The reach out to a professional lobbying consultancy group - Bolder Advocacy strengthens the success potential in my opinion. They operate in Arizona and several other states helping Non Profits in their Lobbying Ecos. My suggestion would be for the proposer to look at Coin Center for Colab., and potential synergies as they initiate the lobbying in Arizona.\n____________________________________________________\nThe budget is straight forward and modest. Though, this may become an ongoing funding effort as the Not for Profit is formed and Legislative lobby efforts take traction in Arizona. \n_____________________________________________________\nThe Risk Management assessment involves compliance with the State compliance laws. Mitigation by hiring Bolder or other advocacy groups will provide the layer of security needed.", "q1r": 5, "q2": "KPIs are straight forward and easy to measure. The milestones stated are: State licensing approved; Number of Legislators educated; Legislation proposed; Legislation passed. Solid, straightforward and easy to measure.\n___________________________________________________\nMy thought to the proposer with the caveat that I have not done any research on state or national or international laws: Arizona is an attractive state for conventions and junkets. It may be a potential to grow this lobby effort to multi state/international uses, depending on all laws. Perhaps a Cardano Lobbying Convention.", "q2r": 5, "assessor": "z_assessor_1339", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5240, "q0": "There is a lot of things I really like about this proposal, so this rating is very difficult for me to give. Unfortunately, I just don't have much confidence in the success of this proposal and I don't think the funds would be put to good use. It is worth noting that the amount requested is relatively low, so it doesn't seem like a substantial risk to me. I just want to be seeing more details about what legislators would be connected to, what credentials encourage reliability in gaining an audience with said legislators, and what sort of specific legislation would be pushed for. I don't necessarily need those specific things, I just need details to be convinced and I don't feel like I get that here. ", "q0r": 2, "q1": "I think there is sufficient experience here to be a sufficient educator on blockchain technology, though I would tend to prefer a little more diversity experience. I do not believe there is enough experience in non-profit work or politics to encourage real legislative change as a result of the approval of this proposal. Though, I could change my mind if there was market research in Arizona that demonstrates that these legislators would be receptive to cryptocurrency regulation. I am very encouraged by the frugal nature of the requested funds, though I am concerned that this budget is a little unrealistic. Other non-profits that I've done research on, specifically those working with cryptocurrency-based legislation, has a budget of $5000-$10000 for legal fees. I'm concerned that this non-profit would face challenges of being not competitive, which is an additional challenge in the face of the plethora of reasons most non-profits fail. I'm rooting for it, but I can't give my stamp of approval based on what I'm seeing. ", "q1r": 3, "q2": "I would like to see more systematic KPIs for measuring success. I think what's listed is a good start, but I think there can be more systematization added. Like what is the definition of \"educated\" or the success rate of the number of meetings to \"allys\" produced. Maybe the success rate of contacts to meetings could also be a form of measurement. It just feels like it's missing something. ", "q2r": 3, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10515, "q0": "The project goal is well aligned with the challenge. Clearly the creation of an advocacy group which intends on lobbying on behalf of Cardano, directly correlates to what this challenge intends to accomplish. The scope of the impact is of course limited as it is only within one state in the USA. That said this must be viewed in relationship with the amount of funds requested. Since the amount requested is low the return is actually quite high for the community. The proposal also states that this is meant as a first in a series of proposals. Therefore this has future expansion potential as well and as such I see this as a first step in the creation of a lobby group. I am not familiar with the political environment in Arizona but as a union president I have been involved in political lobbying for years and know that you have to start somewhere. It would have been nice to have seen a plan for a proposed bill to target or some material that is going to be shared as part of the lobbying. Not altogether necessary at this early stage however but perhaps something to look for in future proposals. For all these reasons I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "This project has a simple and modest aim of becoming a registered lobbying group. The goal is to promote Cardano and educate local politicians. This seems very much achievable. The proposer has listed his experience dealing with Cardano and the ecosystem and this was easily verified by looking into his community and catalyst involvement. The proposal also only seems to list one individual (the proposer himself) as being the lobbyist in this case. Again this is modest but is in line with the funds requested which is not a large amount. There is also experience listed specifically in politics in Arizona. Unfortunately this experience is not easily verifiable as no link or proof of this was offered. There is also no specific information as to what form the lobbying itself will take. I think that is mostly reasonable however for the start of a project like this. There is a plan to reach out to a group which specializes in the formation of this type of lobbying and a plan to register as a lobbyist which in my experience is a perfectly valid place to start. Taking all of this into consideration I agree that it is highly likely that this proposal will be implemented successfully. Being able to verify the political experience and showing that this experience is relevant in gaining better access and understanding of Arizona politics would have helped in getting this to a 5 star review.", "q1r": 4, "q2": "The metrics here for success are well identified and easy to verify. Any legislation proposed or passed are a matter of public record and are accessible to everyone to see. Getting a license is also easily verified. Perhaps the creation of a blog or newsletter keeping people informed of the meetings and information shared with local politicians could be looked into to improve auditability. This would also help bring awareness to the issues in general as it is easily shared. For future proposals I would also recommend specific KPIs such as a particular number of political meetings, or a specific number of legislation amendments submitted. Again though I believe this is not necessary at this stage since this is the formation of something new and I can appreciate the need for some ambiguity. The KPIs are not specific but they were not ignored and are verifiable. I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_935", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A non-profit to pursue lobbying and education of state politicians in order to advance a favorable environment for the Cardano Blockchain.", "experience": "30 years resident of Arizonainvolved in Cardano since 2020involved with Catalyst since Fund 2 as a proposer.involved since fund 3 as a Community AdvisorInvolved since fund 6 as a vCA.Atala PRISM Pioneer"}