{"id": 404952, "author": "h.baca.amenabar", "title": "Favorable legislation in Argentina", "url": "https://cardano.ideascale.com/a/dtd/404952-48088", "category": 26446, "amount": 13830, "description": "Argentina's weak currency makes it the perfect country for adoption. We can advocate for favorable laws from inside the National Congress.", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal clearly identifies the problem and provides a solution by lobbying for favorable regulatory laws from within Argentina's National Congress. It is a prime use case as Argentina's currency is weak thus making it the perfect country for cryptocurrency adoption.\n\nThis proposal is segmented into three stages over the course of a year which provides metrics and goals which align very well with the challenge. For example, their goal is to create an educational center called the \"Center for Digital Policies\" (CPD) with other political advisors and NGOs (such as \"Democracia en Red\" or Net Democracy) in order to educate legislators. \n\nThe solution is also scalable as it inserts itself at the national level and the proposed team has been involved in the drafting of several laws, such as the 27.363, 27.372, 27.452, and 27.552 national laws. National Congress has high visibility and Argentina's adoption of crypto could have a significant impact on Latin America's political landscape. \n", "q0r": 5, "q1": "The prosperer has provided evidence via LinkedIn that speaks to their team's experience and specialties in parliamentary procedure, cyberlaw, crypto-asset tax compliance, and even some coding skills in python and solidity. They will also collaborate with other doctoral advisors and a non-government organization known as Democracy in Red to aid them in their quest. The budget requested seems reasonable enough as it is only 4.3% of the total allocated budget. It also clearly defines how the funds will be used (at a high level) throughout the three stages mentioned in their roadmap. For example, the cost of creating and registering CPD as a civil organization pegged at $3500 and notary fees of $1000. \n\nI believe the timeline of one year is realistic and trust the team's ability to properly scope how long it would take to enact their plan as they are employed in this space. The risk associated with this task was also adequately identified. The prosperer acknowledges the risk associated with legislation passage, citing that there is no guarantee that they can influence favorable legislation as democracies have built-in mechanisms that allow for various outcomes.\"", "q1r": 5, "q2": "This proposal clearly aligns with the goal of lobbying for favorable legislation concerning Argentina. It is evident that this team is well apprised on the legislative process of Argentina's National Congress as the roadmap clearly provides proper granular detail as well as realistic timetables. They humbly highlight the possibility of success while simultaneously remaining rational about the associated risks. \n\nThe  1year timeline is feasible and has detailed quarterly milestones that provide a road to achievement. They also provide both qualitative and quantitative success metrics that are easily auditable. I strongly agree that this proposal could be a pivotal element to changing Argentina's regulatory tide in favor of cryptocurrencies.  \n", "q2r": 5, "assessor": "z_assessor_1247", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal meets the scope and expectations of the challenge group by targeting to work with the congress of Argentina to help deliver more favorable legislation in the jurisdiction of Argentina.  This will help to hopefully build confidence and fluency by legislators to make blockchain and cryptocurrency more available and affordable to  many in the Argentinan space.", "q0r": 5, "q1": "The proposer are lawyers who have extensive experience in working with the Congress to introduce legislation and experience in the blockchain space as well.  The targets that they are hoping to get with this proposal seem attainable with the targeted approach that they are planning on taking.", "q1r": 5, "q2": "This proposal provides both KPI/metrics (quantitative and qualitative) as well as a staged roadmap approach that makes this proposal appear more than manageable to meet.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "Simon Kuznets said that there are four kinds of countries: developed, developing, Japan, and Argentina. Leading with this apocryphal quote, I tend to agree with the proposers that Argentina's weak currency makes it a solid candidate for blockchain adoption (low trust in domestic currency as a store of value, intensive usage of USD in major transactions, use of peso for day to day expenses only). Combined with the fact that the team behind it argue that they can advocate for favorable laws from inside the National Congress, I think that this proposal aligns extremely well with the challenge and can bring added value to the overall blockchain community in general and of course Cardano too. \n\nIt is highly unlikely that such a project can easily be replicated elsewhere due to Argentina’s peculiar circumstances, but it will nevertheless be an interesting experiment if the legislative framework can be shaped at this stage. So less points for scalability but overall a worthy project to fund!", "q0r": 5, "q1": "The core team consists of three lawyers with extensive experience in Argentinian parliamentary procedures which have intervened in the drafting of several laws throughout the past years. They are complemented by a satellite of collaborators that cover technical aspects, constitutional law and digital marketing areas. Judging by the public Linkedin profiles that they have all shared and the fact that the language used throughout the proposal is clear, structured, extremely well articulated and to the point, i place a high degree of trust in them to deliver on their promises. The team argues that they can advocate for favorable laws from inside the National Congress, which (knowing intimately how legislative bodies work in general) I recognize as a very efficient way of having the regulator’s ear. \n\nThe overall budget is very decent, and a very clear split is offered, another indication that the team has a well thought out plan ready to be put in place. I judge the value for money as excellent if the project gets funded!\n\nTimewise, the project might take anywhere between 9 to 18 months, and is split into three stages. Stage 1 for initial set-up (max 3 months), stage 2 focused on workshops (max 6 months) and stage 3 for engaging national regulators and other policy makers. ", "q1r": 5, "q2": "The team uses a remarkable number of KPIs to be used in order to ensure the auditability of the project. A challenge will definitely be in ensuring a consistent and clear documentation of meetings, engagements and draft documents in order to prove the work performed at the end of the project. I also know that a lot of the work will have to revolve around parliamentary committees where it is difficult and sensitive to keep a tight track of meetings held, discussions held and a clear view of bills influenced / drafted. Politics gets really messy around those stages of the legislative process and sometimes allowing for a certain degree of ambiguity actually increases the chances that the team might be successful in changing hearts and minds!\n\nI am definitely rooting for this project and for wider crypto adoption in Argentina!", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is extraordinarily thorough and well-researched. The awareness of the political climate of Argentina is well-demonstrated. It is clear that the recipients are positioned very well to drive forward the adoption of cryptocurrency in Argentina, though it is rather concerning that the proposal contains no mention of Cardano (except for the initial summary). Still, the adoption of cryptocurrency has an inevitable impact on the future of Cardano, and the catalyst proposal is not incredibly expensive for the scale and impact of what this might accomplish. ", "q0r": 4, "q1": "The roadmap and detailed breakdown of the plan is extremely thorough and very transparent. Based on the information provided, we know exactly where every dollar is being spent and we know exactly who is a part of this movement (via linkedin profiles - all of which are comprehensive demonstrations of credentials). There is also demonstrable evidence to show that these individuals are already doing impactful work to accomplish the intentions of this proposal. While the success of the proposal is entirely dependent on outcomes of legislation in the democratic process, the conditions/timing/actors involved in this movement appear to be ideal conditions for support. ", "q1r": 5, "q2": "Actors do a phenomenal job of developing a quantifiable system for seemingly unquantifiable outcomes. It's very helpful to see metrics of progress beyond the dichotomy of whether or not adoption has been accomplished. While I would like to see some kind of source where progress can be publicly accessed in the format presented here, this presentation is more than what I might've expected from this kind of proposal. ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The advancement of favourable legislation for crypto in Argentina effectively addresses a major need that is felt in spite of the advancement of crypto-related startups such as Buenbit, Lemoncash or Belo, amongst many others that are in many cases (such as the first two examples) forced to operate under foreign jurisdictions such as El Salvador. Establishing a Center for Digital Policies with active engagement of legislators would undoubtedly be an asset in this regard. However, for future iterations of this project, I would suggest focusing and narrowing the scope of the use for the funds requested (or of the planned output of the CDP) for specific policies that favor Cardano adoption (for example, advancement of PoS vs PoW draft legislation, bearing in mind the environmental benefits of PoS blockchains such as Cardano).", "q0r": 5, "q1": "The proposers lack any prior engagement with the Catalyst and Cardano community, given this is their first interaction with the project. As per their LinkedIn profiles, they are mostly Argentine lawyers with experience in corporate matters and also experience as legislative advisers, which is of course an integral part of the requirement for lobbying efforts espoused in this Challenge; however, they would benefit in future iterations from interacting and perhaps joining efforts with members of the LATAM Cardano Community, be it through their weekly TownHall or Telegram/Discord/Twitter channels, seeing as many of them are also based in Buenos Aires and can offer more technical insights necessary to obtain the technical expertise on the basis of which more specific and beneficial legislation may be drafted.", "q1r": 4, "q2": "Insofar as the proposal is the establishment first of the CDP and afterwards a series of workshop, conference and bill-related KPIs (number of NGO’s, political and legislative advisors, and crypto-related public figures engaged, number of bills analyzed and discussed, number of bills drafted or updated for political consideration, number of national congressmen and women attendants at the conferences, number of other policy makers and political figures involved in the conferences, number of bills originated in the CPD considered and passed by Congress, etc), the progress would be clearly auditable by the Community. Having said that, future iterations of this project should emphasize the Cardano promotion aspect of this potential CDP to have more weight in the consideration of the Cardano community voters.", "q2r": 5, "assessor": "z_assessor_787", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We´ll create an educational center for legislators within our Congress to engage them in the blockchain revolution and Cardano’s ecosystem.", "experience": "We are lawyers specialized in parliamentary procedure who work in Argentina’s National Congress. We’ve drafted many bills and have vast experience in cyber and commercial law. We’ve studied all major bills regarding cryptocurrency in ARG and are linked to legislators and NGOs."}