{"id": 381864, "author": "toby", "title": "https://www.cardanoworld.io", "url": "https://cardano.ideascale.com/a/dtd/381864-48088", "category": 26245, "amount": 15000, "description": "No existe una combinación de un explorador de cardanes con los proyectos en evolución (explorador de proyectos). No hay un punto de entrada único, ni una visión general.", "funded": 1, "upvotes": 61236890, "downvotes": 11833378, "votes_result": 49403512, "votes_cast": 136, "f6_no_assessments": 6, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposer wants to develop/upgrade the explorer for Cardano, while the current challenge is to attract more SPO's or create attractive business opportunities for existing SPO's. However, the implementation of the proposal might bring recognition for new business in Cardano but the proposal should have stated how particularly SPO's can take advantage of it. This proposal can have a better fit in some other challenges ex: Developer ecosystem. However, Cardanoworld would be a great addition to the Cardano ecosystem, would like to suggest introducing this in a more appropriate challenge.", "q0r": 2, "q1": "Proposer already has a pretty good site/product built which shows the capability of the proposer so can make sure the proposal will be implemented successfully. While various projects would love to showcase their projects in Cardanoworld, would have been better to mention how the verification process would take place, how transparent that process will be in the proposal. Proposals timeline looks realistic and achievable.", "q1r": 4, "q2": "The timeline is clearly divided and the fund breakdown is clean. Would be looking forward to seeing how this will be utilized to create better business opportunities for SPO's, or how the existing SPO's can take advantage of this. On successfully implementing this proposal, one would be able to see filters and projects that are catalyst funded would help the community to track the projects easily.", "q2r": 3, "assessor": "z_assessor_208", "no_vca": 19, "ne": 3, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "I do think this proposal does address the challenge, but wonder if the funds could be spent on opportunities that would capture more press as opposed to a project that makes other projects easier to assess and navigate. Still, the costs are low and think there would be great value for little expenditure, and do think this team can deliver based on what they have before.", "q0r": 4, "q1": "I think their assessment of their own abilities of looking at what they have done for free applied to a forecast of what they could do as full-time developers: is a good one and says much about what they can produce.\r\nI would have liked to have seen more team specifics other than an anonymous team, but hope there is a valid reason for this.", "q1r": 4, "q2": "Websites are a bit bare, but present, and as stated this was done for free and without resource...and not everyone thinks that aesthetics of a website has any effect on success. A black font on a grey background though is just troublesome. However, again, this doesn't take away from the info provided here and on the website.", "q2r": 4, "assessor": "z_assessor_363", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment, which also applies to decentralized and partially mission-driven stakepools, especially regarding the economic part. This knowledge and my knowledge about mission driven stakepools enables me to provide valuable insights for this challenge. The proposal identifies an important addition to the Cardano ecosystem, accurate mapping of it. This will not just benefit SPOs, but also be beneficial in many other areas. The project will, if implemented, have a lot of positive impact on the Cardano ecosystem. Even though the key metrics are not mentioned explicitly, the scope of the project is formulated in a structured comprehensive way that matches the overall mission statement. This proposal will also greatly help to increase future scalability.", "q0r": 5, "q1": "The proposer has so far shown (with the past work) that they are a serious and competent and are able to deliver. It is highly likely that they are up for the challenge.  \r\nThe budget is outlined clearly and broken down into detailed, identifiable items and is reasonable to achieve the set goals. What is also appreciated that the proposers already did a lot of work ahead.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This proposal can confidently be assessed as feasible", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Having centralised resources in a decentralised world is important if we are to propagate and increase participation. An interactive, searchable online tool that allows you to get headline details along with further links, definitely helps build the SFO opportunities. It should have global impact (as long as it can be translated in later versions or be readable and translatable by browsers). It will take work to scale this but it has the bones to have wide impact, which is important and also very evident for voters. As someone with 10+ years experience in education resources in a Fortune500 company, interactive, self-serve resources are key to uptake. The only issue I see here is that it the proposal doesn't talk about how they are going to promote the site or drive traffic to it. This is going to be a major consideration the proposers need to plug.  ", "q0r": 4, "q1": "Given the work that has already been done, I (and voters should) feel fairly confident that the team have the experience necessary to deliver on the technical capabilities of this project. That being said, as mentioned already, the \"activation\" and driving traffic to the site is not explored or mentioned here so that is a major hole that will need consideration. Another gap that would be useful to see is actual measurable KPIs. I appreciate that the problem and brief here is somewhat hard to measure but even some basic metrics around site visits or social interaction would be useful to see. ", "q1r": 4, "q2": "Without sufficient KPIs detailed in the proposal, it will be very hard to evaluate the success of this proposal. That being said, the fact that they are building something that is tangible will make it easy to measure whether the funds have been used effectively in the first instance. If I were to fund this, I would want to see a lot more detail on how they are going to activate the information.  ", "q2r": 3, "assessor": "z_assessor_620", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal accurately addresses the challenge of creating alternate opportunities for SPO. The metrics within the proposal align with the challenge and If successfully implemented there proposal will bring value to the ecosystem.", "q0r": 5, "q1": "The proposal has already completed the initial phase and build out making the success of the following phases very feasible. The funds requested are reasonable within the allotted time frame", "q1r": 5, "q2": "The deliverables are clearly defined and make this proposal auditable. However it would be great to see KPIs like number of page visits to ascertain how successful the proposal truly is.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal outlines further developing a website cardanoworld.io which is both a stakepool explorer and a project explorer. The proposer does not mention the other stakepool explorers in the market such as adapools, pools.pm, stakeboard which is up and coming etc. The proposer also doesn't mention other websites doing project explorers such as cardanocube.io or for catalyst projectcatalyst.org. The proposer has not made clear what different their implementation will make to these alternatives and how that will benefit the community. The community appreciates all effort to make something valuable for the ecosystem so the proposer should be definitely add this extra clarification in and any future proposal updates to make it clear what makes this project add value that doesn't already exist in the ecosystem.", "q0r": 2, "q1": "The proposer does not break down the team information or give background sources to their skills and professional background. The website link is provided however upon inspection the site doesn't seem to be working for loading projects so as it stands doesn't provide much evidence that the proposer can feasibly execute what is needed with high confidence. There is a basic breakdown of budget provided taking into account server and development costs for each of the phases listed.", "q1r": 3, "q2": "The proposer breaks down the timeline into phases, phase 1 is part of another proposal. It would have been clearer to not copy the same text into both proposals about the breakdown of tasks and instead just linked to each proposal from the other stating that there is another relevant proposal we have for the site that is worth reviewing. No KPIs or success objectives have been added. It is hard to say with any confidence what success looks like for this project without understanding how it differs from other solutions and not having any specific metrics that the proposer believes are important to gage the success of the proposal once completed.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 14, "ne": 2, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Queremos hacer evolucionar nuestros servicios para la comunidad desarrollando aún más https://www.cardanoworld.io y https://www.cardanoworld.io/projects.", "experience": "Estamos desarrollando el blockchain y el explorador de proyectos https://www.cardanoworld.io, y dirigimos el stake pool CASCH.\nVéase la FASE 2."}