{"id": 368091, "author": "", "title": "Distributed Work-Reward Mechanism", "url": "https://cardano.ideascale.com/a/dtd/368091-48088", "category": 26104, "amount": 4760, "description": "Rewarding intangible work in a DAO is not transparent or scalable. There is too much focus on $ allocation before contribution attribution.", "f6_no_assessments": 2, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is attempting to deliver a system to reward the intangible work behind the scenes in a working DAO.  The examples of how to build a system and metrics would help with facilitating and incentivizing others to contribute more to a DAO-based system ultimately driving improvement in the system and helping the DAO to be better organized and supported.", "q0r": 5, "q1": "This proposal has a clear-cut plan, detailed roadmap, and KPIs outlined in the proposal that makes the proposed features and workload bound in this proposal seem more than doable with the funds and timeframe allocated.  The team is filled with a variety of individuals with a vast set of skills and experience to be able to work through the problem adequately.", "q1r": 5, "q2": "With the timeline, milestones, and KPIs set in the proposal, makes for an easily auditable proposal.  The details surrounding the entire proposal make it possible for someone to verify the progress of the project.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "I believe, the proposal addresses the challenge, nevertheless, the proposal seems to be oriented to the \"attribution, valuation & reward system\" of relatively small projects, and even though that is a contribution to the challenge, it is not clear, given the information provided, how the team foresees that their project may scale up to the current and future requirements of Project Catalyst and Voltaire (i.e.: Cardano in general). The proponent team demonstrates experience, knowledge, and interest in the issue at hand, I understand that they are proposing a learn-by-doing approach and that they are emphasizing the execution and documentation of their experiment. I highly recommend that, if the proposal is funded, the team pays special attention to think about how their experience besides being transferred to other organizations in the Cardano Ecosystem, may be scaled to contribute directly to Project Catalyst ASAP and to the Voltaire era in the near future, to extract the most value from their effort to the community.", "q0r": 4, "q1": "Given the experience presented, I believe, it is highly likely that the proposal will be implemented successfully. Nevertheless, I also believe that the team has designed a very tight schedule, in particular, to achieve the \"test runs\" and their documentation. As \"we all know\" in the blockchain space, this type of sequential trial has a tendency to stretch timelines. Furthermore, in this proposal, the team provides milestones for three, six, and twelve months but only a detailed roadmap for three months. It is not clear or convincing (from this lack of information) how the team will fulfill its long-term goals. I am aware that the team has indicated that this proposal \"will inform and provide support materials for SecretDecks \"Off to On-Chain Self Governance\" proposal\", and I will do my best to assess that proposal also, but the assessment of this proposal has to rely only on the information it contains and from that (absent) information is that I signal to the team and others this issue incomplete information. It seems to me that the team trusts their capabilities and experience and has elaborated a \"fuller\" plan but is in the process of dividing it into sequential proposals could not track the completeness of all the information necessary to keep this proposal whole. As the team seems competent and experienced, and interested and dedicated to the project, these underly the confidence that I assign to their success, nevertheless, if they are funded (but also if they are not) I would suggest paying attention to the issue of completeness of each individual proposal for their execution (or for their inclusion in a future funding round).", "q1r": 4, "q2": "The information provided is sufficient to fully audit the progress and success of the first stage of three months of the proposal. Also, the milestones provided are sufficient to evaluate the success of the project at six and twelve months. Nevertheless, a dedicated and experienced auditor, with technical knowledge in the specific domain area (software development, SourceCred, blockchain, Cardano stack? etc.) will be necessary to be able to evaluate progress within the three and six and the six and twelve months periods. Furthermore, the second component of the six months milestone \"achieved self-funded status\", is something that no project (in history) has guaranteed and that there is no way to guarantee. Yes, it is highly probable to achieve this goal in blockchain technologies, nevertheless, it is not an adequate milestone as it is very much independent from the work of the team.", "q2r": 3, "assessor": "z_assessor_183", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Develop an open-source attribution, valuation & reward system based on a Distributed Co-Op approach.", "experience": "SecretDecks has 5 core members with backgrounds in product & project management, editorial, philosophy & web development (See Detailed Plan)"}