{"id": 369284, "author": "", "title": "Stake Pool Operators Video Series", "url": "https://cardano.ideascale.com/a/dtd/369284-48088", "category": 26104, "amount": 9000, "description": "Stake pool operators (SPOs) should be household names but 2500+ SPOs wrestle to retain+grow pools+connect meaningfully with global audiences", "f6_no_assessments": 2, "f6_rating": 3.5, "videos": ["https://vimeo.com/576882227"], "media": [], "f6_assessments": [{"q0": "The proposal does not quite address decision making. The guiding questions for this challenge are more about participation, tools for decisionmaking, iteration or development of processes around the funding process and general engagement into governance/ distributed decisionmaking in Catalyst. However, the proposers argue that voters would make better decisions if they knew more about stake pool operaters. While I think this does not address the core ideas of the challenge I think it would be an interesting approach/ addition.", "q0r": 3, "q1": "Petr is an active community member and has lots of experience in professional film making. Raz is also an active community member. Both community members already contributed greatly to the Catalyst community and Petr already delivered proof of finished work/films. I think it is highly likely that the proposers will be able to implement their idea. It would additionally serve as a multi-language outreach and onboarding instrument. It is very valuable that the proposers included the fact that this will be highlighting the diversity and missions of the SPOs.", "q1r": 5, "q2": "The proposal does not give a very detailled roadmap or financial planning, but since the project is very clear and can be done by the two proposers themselves, it is still possible to audit success based on the numbers of videos that the proposers want to deliver. The timeline is very realistic with 1 video per month and the documentary across the 6 month period. So overall - auditability would be possible based on outcome. ", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 11, "ne": 2, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "A '3' for impact appears to reflect a very tight reading of the challenge, especially as the proposal elaborates with answers to the guiding questions. A '4' for auditability appears inconsistent with the notes given as it appears to the CA that the proposal provides sufficient information to ascertain the auditability of success, so unsure as to why this is not a 5 instead."}, {"q0": "It's great that this proposal addresses a decision that seems a bit under-repped in this challenge (i.e. choosing a stakepool), and that it considers how to move people from there, to getting more actively involved with Catalyst. It's basically about giving people info on which to base a decision (always a positive); and about doing so in an accessible way (vital in addressing the challenge's aims around diversifying the group of decisionmakers.) I particularly like the multilingual and global approach – again, vital to address the challenge.\r\nHowever, if \"giving info\" shades into \"persuading and influencing\", that'd be less in the spirit of this challenge -  so I would like to see the proposer make more of their background in documentary, and use a little less of the \"hearts and minds\" and \"inspiration\" rhetoric in the proposal, to make it really clear that they are seeking to inform and empower, not to advertise or manipulate opinion. Even though I personally support the focus on mission-led SPOs, I still feel advertising a handful of them wouldn't really support the aims of this challenge; so I think the proposal perhaps needs to be clearer that this is not what it's doing.\r\nAlso, the \"Step 3\" part could do with more elucidation -  where \"SPOs have formed community groups that align on agreed vision and mission statements\" and basically vote en-bloc on Catalyst proposals they support. It's unclear how this will happen; and crucially, who will support the background admin that it might need to make sure it's accessible, open, distributed, and supports the spirit of this challenge.\r\n", "q0r": 4, "q1": "The proposer clearly has the experience and skills to make the videos well, and the timescale seems very workable, so I feel sure the videos will get made. \r\n\r\nBut a big part of \"successfully implemented\" will be about them finding an audience. At the moment, the proposal just mentions  \"IOG marketing\" and \"Cardano Foundation communication\"; but since the audience will be such a big part of whether the project is successfully implemented, I'd like to see a clearer plan for reaching an audience.\r\n\r\nThe budget is OK, but I'd like a little more detail in some areas. Particularly – the multilingual aspect of the videos is a great plus-point of the proposal, but there is no budget for translating. I assume it's being included in the cost of \"making\" the videos, but it'd be good to see it broken down more specifically. \r\n\r\nAlthough the project's \"step 2\" and \"step 3\" aims (getting ADA-holders more involved with Catalyst, and getting SPOs to organise together) are interesting, there's no detail, tasks, timeline, or budget on how they would be achieved. This kind of community engagement takes quite a lot of work and thought, so I have to say it doesn't seem very likely to be implemented successfully. Perhaps if the proposer rethought the budget a bit, maybe asked for a bit more, and thought through the work of using the videos  as a starting point for engagement, this aspect of the project could really take off – but it's still a lot to do in 6 months. So maybe just make the videos, and put the wider engagement work in a follow-up proposal?\r\n", "q1r": 2, "q2": "There are some great KPIs given – but there is no info on how the proposer will actually measure things like \"How many people were helped by the videos with their decision to delegate with a mission driven stake pool\" or \"How many new users came onto the Cardano blockchain with the help of the videos?\"  This kind of  quantitative monitoring and evaluation can actually be quite expensive (and it's not in the budget), as someone or something has to collect the data and present it; so I don't feel convinced that we'll be able to audit the KPIs that the proposer is suggesting. \r\n\r\nI also don't see any clear way in the proposal to audit the Step 3 element of the project – even if Step 3 happens, it would be hard to audit how far it was due to the videos. \r\n\r\nStill, though – we can certainly audit whether the videos get made, how many people view them, and some qualitative data from things like Youtube/Twitter comments; so that's a good start. ", "q2r": 3, "assessor": "z_assessor_540", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "A score of '2' doesn't reflect the first sentence written by the CA - \"The proposer clearly has the experience and skills to make the videos well, and the timescale seems very workable, so I feel sure the videos will get made.\""}], "solution": "Professional videos captivate viewers' hearts+minds with inspiring+informative SPO stories, helping SPOs communicate+connect meaningfully", "experience": "15+ years in TV | Documentary Filmmaking, Educator\n\nhttps://www.linkedin.com/in/razali-samsudin/  \n\nhttps://www.adatruth.com/"}