{"id": 370212, "author": "", "title": "2Min Review", "url": "https://cardano.ideascale.com/a/dtd/370212-48088", "category": 26104, "amount": 12000, "description": "Vietnamese stakeholders have difficulties to read, understand and evaluate submitted proposals in project Catalyst.", "f6_no_assessments": 2, "f6_rating": 3.833333333333333, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=22194"], "media": [], "f6_assessments": [{"q0": "This proposal certainly addresses a crucial problem for this challenge. Solving the difficulties that Vietnamese voters have in assessing proposals would definitely improve community participation levels and make decision making more distributed. But I'm not convinced this proposal does solve the problem.\r\n\r\nClearly this \"2-stage assessment\" approach would make the process more accessible – but I'm unconvinced about the criteria it will be using. For instance, one first-round criterion is about whether the proposers interact with the community or not. This seems misguided to me. For *some* kinds of proposal, this is important, of course -  but not necessarily for all kinds. It's perfectly possible for someone who is new to the community or who hasn't interacted much, to put forward a brilliant proposal  – and by this approach, it wouldn't even get through the first round. This could potentially have the effect of *reducing* participation levels, by excluding new and unknown proposers. I wonder how the team arrived at these particular criteria? I'd like them to include a line or two to explain.\r\n\r\nTaking this further, the really key issue for me is that the proposed first-round criteria (Identifiable, interactive, carefully prepared) don't match the current published criteria for proposals in Catalyst; they introduce new benchmarks (such as \"in order to write a good proposal, you have to interact with the community'). The issue here is not about whether or not that is a good criterion – it's about the principle that fair funding processes require transparency, and you need to inform proposers what criteria they need to meet. So if this gets funded, it'll be really important that it gets properly integrated into the whole Catalyst proposal process, and that proposers are informed that their proposals will be assessed this way by the Vietnamese community; otherwise, you again end up inadvertently making community decision-making less fair, less distributed, and less transparent. I'd like to see some recognition of this issue in the proposal, and an outline of how the team plan to liaise with Catalyst  and with the wider community to make sure proposers know they will be assessed using these additional criteria, and that proposers really understand what the criteria mean (just as we do for all the other criteria that proposals have to meet). For example, will the team write something, or produce guidance notes, for proposers? Work with the rest of Catalyst to get these criteria signposted on Ideascale? Etc.\r\n\r\nFinally – it would be good to add some figures to show how big the Vietnamese community in Catalyst is, and thus the scale of the problem being addressed. I *think* the Vietnamese community is quite large, but I don't know for sure -  so including that info would help people see how important this is. Of course, barriers to inclusion still matter even if they only affect a handful of people – but if, as I suspect, it's LOADS of people, that information would make the proposal all the stronger.\r\n", "q0r": 3, "q1": "Yes, I think so. \r\nIt's great that the team are strongly embedded in the Vietnamese Cardano community, so they  understand what that community wants, and have the connections to deliver it. Also Duc Tiger himself clearly has plenty of experience in assessing proposals as a CA (altho I think iit would make the proposal stronger if we were told how many of his 500 assessments in F4 and F5 were highly rated!) It's also clear that the idea has already been piloted and has worked. It is a little hard to assess completely because the proposal comes from a team of several, but the 'relevant experience' section talks about only one of them, Duc Tiger; but that's a minor point, and esentially I feel pretty sure it would be implemented successfully.", "q1r": 4, "q2": "Nearly a third of the project budget is \"reserve\" – that seems high.  it's not clear exactly what this is, and what it will be used for.\r\nThey will audit the project by sticking the CA's assessments on a Google sheet that people can look at in real time. That's certainly very open and transparent – but I'm not convinced that it addresses that actual aims of the project. Yes, we'll be able to see that Vietnamese CAs are doing these 2-minute assessments – but how are we measuring the numbers of Vietnamese community members that this engages, and whether they do in fact find it easier to assess proposals than they did before? I'm not convinced that the *important* info, that will tell us  if the project is working and what Catalyst can actually learn from it, is being collected at all.\r\n", "q2r": 3, "assessor": "z_assessor_540", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "The CA has spend alot of time to brandstorm my proposal and gave some notes. However, I am not agree with he (she) about Impact and Auditability note:\n\n*Impact note:\n\n-\"Interactive\" is one of the most criteria that we are consider, because the proposer need to answer some questions of the community. If the proposers are new join into Catalyst and they need want to collect as many votes as possisble then they need to appear and reply as many comments as on their proposals. Why I need to give money to someone who is not willing to answer my questions?\n\n*Auditbility note: Reserve is budget to advoid from volatility of ADA price. Last week, the price had dropped from $3.2 to $1.92. In this case, we are still have enough money to pay for participances."}, {"q0": "As the proposal authors put it, \"one of our main goals is to include the Vietnamese community in the project's catalyst and to be part of a diverse, global community.\" To achieve this goal, they propose creating a tool that will help the community evaluate proposals. Coincidentally, I just evaluated a very similar proposal, from that same fund (it's called the Catalyst Proposals Assessment Guide), and I believe this is a real and very relevant issue for the Cardano community. Little is taught how new ada holders can evaluate proposals and participate in the Catalyst Project. Therefore, a way to facilitate this activity would certainly be a positive step in terms of the challenge's objectives, in distributed decision-making.", "q0r": 5, "q1": "The main author of the idea has a solid background when it comes to evaluating proposals and in the universe of cryptocurrencies, as we can see through the spreadsheet he attached, which from what I understand are analyzed proposals, and in addition he also attached his twitter so that we can get to know him more intimately. With that, we have a great degree of trust in the leader. However, the rest of the TIGER review group is not so well presented; there are several names and then we have the contact details of each one in the telegram. It would be positive if the team were more detailed, as well as the author of the proposal, if we knew the role of each participant there. In this way, reliability would benefit even more. ", "q1r": 4, "q2": "Regarding the step-by-step process for carrying out the project, I would like to talk about 3 topics. 1) the tool is very well explained, we are detailed how the tool would work, what the minimum requirements the future CAs and vCAs would evaluate to analyze the proposals. And this is done in a clear and objective way, which gives a lot of credibility to the functioning of the tool itself. 2) it is also explained in a clear and objective way how the funding would be used, and although divided into parts, these parts could be more detailed. For example: $2,000 salary to support CAs. How many CAs do they intend to involve in the project? $1,200 Youtube Editor and Fanpage Manager for 3 months. What would the youtube channel and fanpage look like? It was not very clear how these platforms would be built and maintained. 3) I found it positive that they already have contact with the target audience (Vietnam's population), according to them, through Facebook and Telegram, but it would be even more interesting if these channels were linked in the proposal, so we can take a look! That said, I believe the project is pretty detailed, it just requires a few improvements to be perfect.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 12, "ne": 8, "ng": 4, "nfo": 0, "vca_o": 2}], "solution": "Building a simple toolkit to offer the Vietnamese community an inclusive service to read, understand and evaluate submitted proposals.", "experience": "Over the years, I have reviewed hundreds of cryptocurrency projects, and reviewed more than 500 submitted proposals of Catalyst."}