{"id": 373192, "author": "", "title": "Power Up The Catalyst Circle", "url": "https://cardano.ideascale.com/a/dtd/373192-48088", "category": 26104, "amount": 9500, "description": "Without a budget to fund its operation, Catalyst Circle can't produce meaningful outcomes.", "f6_no_assessments": 13, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims for funding the Catalyst Circle for the period of  NOV21 to  JAN 22. IOG is currently managing the Catalyst Project, with the aspiration to decentralize Governance to the community. \r\n\r\nIn my view, this proposal is of higest strategic importance, since it helps to make sure that Catalyst Circle can become independant from IOHK. Since everything is driven by Community elected key-players and IOHK representatives, this proposal has definitely high direct impact. ", "q0r": 5, "q1": "The proposers belong to the very core-team behind CATALYST and the current Catalyst organization structurs. \r\n\r\nThis means that the funding would directly go to the next learning-iteration of the Catalyst Circle. This holistic focus on people, process and learning iterations leads to a high likelihood of success.", "q1r": 5, "q2": "The activities during this proposal are properly listed and allow simple measurments for determining success. All elements of the 'definition of success' are already known, since Catalyst Circle is already operational in its first iteration round. \r\n\r\nThe overall amount asked for funding the Catalyst Circle during this second iteration round is rather small and very reasonable. \r\n", "q2r": 5, "assessor": "z_assessor_101", "no_vca": 24, "ne": 6, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "This proposal gets Catalyst one step closer towards decentralisation. Perhaps one of the most important proposals. I would have liked to have more details in respect to how members are to be chosen. For example I was not aware that CC was looking for a secretary and facilitator. Perhaps better circulation of information - sending an email to all those registered on Ideascale - would have been good in order to source the best people for the positions. If the election of new members is not well devised we will end up in a small number of people getting selected for these positions. If limited to a small group, the best people might not be selected for the post. This is not easy to do however, perhaps setting something similar where everybody can submit his resume, and the Ideas he/she brings to the table. Then similarly having CAs and VCAs vote and ultimately ADA holders to elect the people similarly to the current process for proposals.", "q0r": 5, "q1": "As described above the success of the proposal is tangible on the quality of the sourcing process for Catalyst Circle members in order to source the best people in a real decentralised manner. Having a small circle of people picking new members or else  picking from a small pool of people based solely on their links to people or popularity would not be considered as a decentralised process.", "q1r": 4, "q2": "Whilst certainly some sort of budget must be allocated towards the effort of Catalyst Circle members, more information is required how elections are to be conducted. Besides, there must be certain goals set for the elected members to reach at the end of the 3 month period.", "q2r": 3, "assessor": "z_assessor_281", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "By bringing together a group of elected representatives from both top down (IOG, CF) and bottom up (SPOs, TM&M, CAs, Funded Cohort, and General Voters), this is a diverse group that can surface and prioritize important issues in our community. While volunteerism is a strength of our community, being able to pay these positions a stipend will bring better ability to devote time and energy to the Circle and sets a good precedent for how we value people's time as a community, The Catalyst Circle is a great example of an experiment in decentralized governance and will set the tone for the next stage of our governance evolution.", "q0r": 5, "q1": "As the proposal is very clearly outlining the roles and expectations of the Circle members, and the financial support is to allow the circle members to devote professional time to the Circle, this is a very feasible proposal in terms of clear achievable goals. Also, with a 3 month roadmap, it is not too long of an experiment and the results will be easier to measure sooner.", "q1r": 5, "q2": "The goals of the proposal are very clearly outlined in hourly expectations for members of the circle. The roles and duties of the circle and the admin team are measurable and the non-\"payroll\" expenses are minimal. The KPIs and metrics are measurable and can be tracked by the admin team.", "q2r": 5, "assessor": "z_assessor_285", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "As a member of the Catalyst experiment, and a person that cares a lot about the Cardano's vision to impact the world for the better, I do believe that the Distributed decision making challenge objectives are being greatly addressed by the Catalyst Circle and powering up this initiative with funding, to be able to establish new roles and the time and muscle to continue experimenting and driving Catalyst purpose is KEY. \r\nWether this setup and roles or new ones that are derived from the insights this experiment produces, I agree that funding is key to properly drive the effort in a continuous and relentless manner.", "q0r": 5, "q1": "The track record of the involved individuals behind this proposal clearly denotes their passion, alignment and willingness to make this experiment a success. With that belief and way of working, I strongly agree that this plan can be implemented successfully and with great impact in the Catalyst and Cardano's communities. The provided goals, timeline and expected results are clearly stated.\r\nThe funding though seems a little bit low, considering the importance the Catalyst Circle has and the impact this project is having and will have. I would've been more bold at the request, though I do understand the position of showing that this is not mainly about money, the whole Cardano's community success I think is based on the idea that in order for people to put effort into something and for great talents to get involved (really involved) the Catalyst project needs to be sustainable and funding is a key part of it. But that is an ongoing discussion that I firmly believe will continue to open opportunities for this type of contributions.", "q1r": 5, "q2": "The provided KPIs will provide the community with clear evidence to be able to audit and measure the progress of the proposal.\r\nI do think though that the provided metrics are too much focused on tasks and not desired outcomes of a key Body such as the Catalyst Circle. I would concentrate more on metrics that provide better view of how the decentralization is happening, such as amount of challenge set by the community, amount and type of decision that the CC and the Catalyst community made with no intervention from IOHK, how we can measure elected officials contribution, etc.", "q2r": 4, "assessor": "z_assessor_288", "no_vca": 11, "ne": 9, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This is very much needed for The Catalyst Circle to strengthen the foundation of Project Catalyst. The Secretary and Facilitator could perhaps be longer time positions to ensure continuity even if other members change every 3 months. I have been in a global leadership development organization AIESEC where the leadership changes every year on local, national and international level (in about 100 countries, since 1948) and the biggest issue the organization faces is continuity: losing the learning points from the past. Let's not make the same mistake here. On the other hand, to prevent centralization of power, it should not be allowed for a member to be re-elected immediately for another term.", "q0r": 5, "q1": "Obviously the Circle members are in the best position to suggest this. There's no doubt about their capacity to put this into action. The plan is good for the next 3 months and it might change later but that's ok. This is part of the great experiment.", "q1r": 5, "q2": "I'm not entirely sure if \"problem sensing stage\" makes sense. If there is a better way to gauge continuous feedback from the growing membership, then the Circle should adopt that. There needs to be better ways to do \"social listening\" in the various Telegram groups and Discord channels to bring the ideas and issues to the forefront, faster and more collaboratively. Now the entire decentralized nature of the project hinges on Catalyst Circle's ability to listen to the community, filter the issues and create solutions. That might be too big of a responsibility for a handful of people to handle. Regardless, this is the best approach we have tried so far. Let's hope it adapts.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks funding. The challenge being addressed is one about funding the catalyst circle. If funded, then the challenge is addressed by that funding. So in essence this proposal addresses the challenge by making receiving funding the challenge of the proposal. ", "q0r": 5, "q1": "Yes. Elected representatives would allow for more governance and a new line of governance. The requirements for those 3 month elected officials are detailed and seem appropriate. ", "q1r": 5, "q2": "I have outstanding concerns about the election process and any campaigning that would be involved. Elections can lead to possible unsavory interests a manipulative bargaining for those who are elected. I am concerned about that possibility of electoral interference via monetary gains etc etc.", "q2r": 4, "assessor": "z_assessor_388", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge brief with its clear and concise problem and solution statement.", "q0r": 5, "q1": "The proposal team members are active in the community and have wide ranging experience. The detailed plan and KPI's show the thought and purpose of action that has been put into the project.`With the allocated budget, the catalyst circle should be able to drive and keep the experiment running. By establishing systems and having three month rotations, members of the community will take ownership of the project. ", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the success of the proposal as there is a detailed budget, plan and corresponding KPI's for office bearers which has informed my scoring decision.", "q2r": 5, "assessor": "z_assessor_410", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "The problem and solution presented are within the scope of the challenge.\r\n\r\nCatalyst Circle has been important for the coordination between several representatives of the Cardano community, the integration and comprehensive vision provided by representatives from different niches of the community helps decision making at the macro level of Catalyst.\r\n\r\nThe objectives already achieved so far are good impact indicators and the goals and KPIs described in the proposal signal the continuity of the process. I would only recommend tying targets to KPIs.", "q0r": 5, "q1": "With the exception of the IOG and CF representatives, the rest of the Catalyst Circle members were elected by the community and this in itself indicates their qualifications for the task. CC members are well-known, participative members and have been very important to the evolution of Catalyst and the communities they represent.\r\n\r\nA structured and reasonable plan was presented, with a budget breakdown, but it was not clear how the amount of $5,000USD for CC member remuneration will be divided. I assume it's just for the elected members, that is, all but the representatives of the IOG and CF.\r\n\r\nThere is an objective timeline with defined dates for the start of CC2.", "q1r": 5, "q2": "There is clarity on the problem, solution and alignment with the challenge. A 3-month roadmap for CC2 has been described and dates have already been defined.\r\n\r\nThere are targets, metrics/KPIs relevant to auditability. I would just recommend targeting KPIs for a more objective auditability assessment.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This Proposal fit into the challenge , the team has a good track record , there is road map and KPI but there is no start date. The implementation of this project will improve the overall Catalyst experience and I believe this will impact the community positively , This deserve 5 point but i score 4 because the team are aware of the guideline but there was no expected public launch date for the Proposal.", "q0r": 4, "q1": "The team has good track record and experience. I have personally listen to some of the Video of past session hosted by this team , I Would say i strongly agree that the experience and Plan provided is highly likely this proposal will be implemented successfully ", "q1r": 5, "q2": "There is a budget breakdown and the money requested for is effectively accounted for in the budget  , from the KPI provided , it sufficient to audit the progress and the success of the proposal , i score 5", "q2r": 5, "assessor": "z_assessor_430", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The Catalyst Circle appears to be a strong attempt at the funding goal of making decision making more distributed across the Cardano ecosystem.", "q0r": 5, "q1": "While still in its infancy, the actions from previous funds show a history of progress towards its end goal.", "q1r": 5, "q2": "While some of the goals for distributed decision making are abstract, The Catalyst Circle v1 has shown good auditing that should be continued into v2.", "q2r": 5, "assessor": "z_assessor_450", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "The proposal identifies a problem within the challenge which needs to be solved (the circle needs to be founded to produce relevant outcomes). The proposal clearly articulates how it will add value to the Cardano ecosystem as its pointed in the \"members duties and responsabilities\"  (Represent the community that selected them, Exercise their own best judgement about matters that come before the Circle, Familiarize other members with the projects, activities, aims, hopes, and concerns of their communities,  Periodically take the opportunity to introduce policy proposals into the Circle's agenda for consideration, Inform their communities about initiatives of the Circle).  The key goals of the proposal align with the outlined challenge settings as the The Catalyst Circle is an evolving strcuture that helps to enable a governance with sustainable distributed decision making.  ", "q0r": 5, "q1": " The budget is outlined clearly and broken down into identifiable items. Since its about funding an already working governance structure, no skills or experience is needed to implement this proposal. ", "q1r": 5, "q2": " The Catalyst Circle strcuture it's very transparent and the proposal brings plenty of links to verify the progress of the system. I'am satisfied with the level of details in this proposal and would not change anything.", "q2r": 5, "assessor": "z_assessor_474", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This appears to be allotting dollars/ADA to pay and incentivize Catalyst Circle members for their participation. It's a simple process, though the specifics of how dollars are divvied up is less clear, namely distributed equally amongst the participants? But it is answering the specific challenge by furthering a committee that's helping work on governance issues.", "q0r": 4, "q1": "The proposal seems to focus on compensating Circle participants, and that's likely to be successful (the compensation piece).", "q1r": 4, "q2": "KPIs are outlined as factors to track, but less so clear as to the markers of \"success.\" The successes so far are only outlined for v1 of the Circle. Could be as simple as compensating only for 90% attendance and participation in meetings, for example. ", "q2r": 3, "assessor": "z_assessor_517", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Incentivize people to bring out their best has been proven to be always effective. Catalyst cirlcle seems to be an effective additional layer to improve Catalyst Townhall and creating a tracker ", "q0r": 5, "q1": "I think the leaders of Catalyst know what's best for the future of it.The team is very well experienced given the fact it already worked within Cardano. The plan presented is clear and well summarized", "q1r": 5, "q2": "Long term success need still to be defined, however this is the initial stage of the project. Budget breakdown is clear as well, and its allocation is scaled to the effort required for each role. ", "q2r": 4, "assessor": "z_assessor_530", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Funding from the Cardano Community via Catalyst helps to ensure increased accountability of participating CC members.", "experience": "We are elected leaders from the ecosystem serving a key role in turning Catalyst into the largest decentralized innovation fund in the world"}