{"id": 367821, "author": "", "title": "Automated Cyber Threat Intelligence", "url": "https://cardano.ideascale.com/a/dtd/367821-48088", "category": 26110, "amount": 40000, "description": "The Cardano ecosystem is producing massive volumes of data, we need a scalable framework to correlate this data into real-time threats.", "f6_no_assessments": 4, "f6_rating": 1.9166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "It appears the proposers ran out of time to complete this proposal with a number of TBC in key parts of the proposal", "q0r": 2, "q1": "Whilst the proposers appear to have the ability to delivery a project in this area, the proposal lacks information on what will be produced and how the budget will be spent.", "q1r": 3, "q2": "As the proposers appear to have failed to complete their proposal it is not clear what exactly they would be providing thus it is not possible to audit progress or success of this project.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal goal is aligned with the challenge goals since it aims at identifying and acting against probable threats to the Cardano ecosystem. Although, there are some KPIs that could be measured once the proposal is funded and the project delivered, even though they are not detailed. The proposal should add some more information about the Kafka ecosystem, which is mentioned throughout the whole text. Also, the proposal seems not to be finished since there is some information missing, especially about the solution design, which is critical to the assessment process. The proposer also didn't answer some questions made by the community. These facts combined indicate that the proposer was not so engaged with the Catalyst process for some reason. Besides, the proposal should mention how it would evolve, if needed, after the project is finished and delivered, if there is a sustainability plan or not. Score: 3", "q0r": 3, "q1": "The proposer provides a link to the team's repository, which gives more confidence about it, even though the proposers themselves are not mentioned directly. But based on their background and expertise, it seems likely that they are able to deliver the project. The budget unfortunately is not explained in detail, only a lump sum is presented. And since there is no roadmap as well, it's not possible to assess the feasibility of the proposal in this regard. It lacks a timeframe for the delivery, besides a plan for implementation. Some details are provided partially in the summary, but more information, especially regarding the solution design, should be included. At last, some possible challenges during the development should be mentioned regarding the scope of the project. Score: 2", "q1r": 2, "q2": "It seems like the proposer ended up not finishing the proposal, since the solution design and roadmap are set as 'TBC'. Without this information, it is not possible to properly assess the auditability of the proposal, even though some metrics and KPIs are mentioned in the text. Also, the lack of a detailed explanation about the budget would be required to improve the proposal's auditability. In summary, to improve the proposal's auditability, the proposer should include: roadmap, milestones, clear KPIs and a budget breakdown, at least. Score: 1", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal fit into the challenge , The problem statement and solution seem too broad, there is no way it mention who specifically will act on the correlated data events if there is a security threat , is the ADA holder? SPO? who will have access to the tool and how it will impact the community.\r\nWhat are the indices to  detect anomalies ? I believe this can be refine and be more specific on the solution as it relate to distributed data. one way to think of anomalies is to understand how the consensus protocol works in Cardano, I am neutral", "q0r": 3, "q1": "The team has great experience in DevOPs and SecDevOps and Cardano SPO management . However there is no clear plan and road map on how to implement this project , It says \"High level solution design diagrams and roadmap will be uploaded in the coming days\" I assume this is not the final proposal , based on the information provided now , i score 2", "q1r": 2, "q2": "There is no budget breakdown , There is no KPI/metric , No start date and the definition of success for 3 , 6 and 12 months is vague.", "q2r": 1, "assessor": "z_assessor_430", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "While the proposal details necessary elements of data collection necessary to identify cyber threats, there is no detail on the types of threats this proposal aims to identify, or what the action would be to respond to such threats. The funds requested total 80% of the challenge budget. Without these necessary and relevant details it is hard to assess how the proposal would directly target the challenge brief and be a better use of funds than the other proposals vying for these same funds.", "q0r": 2, "q1": "The High Level Solution design is yet to be filled in. Likely that the proposer didn't have enough time to create it, but we must use what is presented in the proposal itself. The referenced github link does not provide any ongoing work directly relevant to this proposal but does provide evidence that the proposer has knowledge in the field. Comments in the proposal have gone unanswered, which doesn't provide enough evidence of commitment to the project.\r\n", "q1r": 2, "q2": "A section on measuring success has been provided, but alignment of challenge metrics and KPIs are missing. There is no detailed summary of how the funds would be spent and no clear timeline or roadmap to audit success.", "q2r": 1, "assessor": "z_assessor_590", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Monitor, correlate, and proactively act on events from various real-time and batch data sources to detect anomalies and respond to incidents", "experience": "We are leading consultants in many of the world's most influential emerging technologies with a key focus on event driven cybersecurity."}