{"id": 369533, "author": "", "title": "Cardano Threat Identification", "url": "https://cardano.ideascale.com/a/dtd/369533-48088", "category": 26110, "amount": 50000, "description": "As the Cardano network grows and ADA becomes more popular the threats from bad actors will also increase.", "f6_no_assessments": 6, "f6_rating": 1.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is asking for the full challenge funds to develop and application and system logic to capture threats for Cardano users and categorize them. Unfortunately, that is about the entire plan. ", "q0r": 1, "q1": "This this proposal needs a clear description of what it would, how it would do it, when it would do it by, how the budget would be spent and evidence the proposer has the skills to deliver. ", "q1r": 1, "q2": "Without a clear plan, timeline and deliverables, let alone any metrics for success there is not enough information to audit this proposal.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Having a centralized location to report and discuss threats would be useful assuming sufficient community  buy-in and engagement. I mean, what are the alternatives? Rely on IOHK forever? Discuss threats in a Discord channel? These are not good options. We can do better!\r\n\r\nFor example: https://cve.mitre.org/", "q0r": 5, "q1": "> Develop an app/web location to capture threats from Cardano users\r\n\r\nFrom a technical standpoint, developing a web app to capture threats submitted from Cardano users seems straightforward; given the proposer's credentials, I'm confident the submitter is capable of constructing a web app. \r\n\r\n>  and then categorize their threat level based on the system algorithm.    \r\n\r\nWhat is meant by \"system algorithm\"? \r\n\r\nSince most practical attacks against Cardano (or similar block chains) are guarded against by the blockchain protocol itself, credible attacks will tend to have novelty - they have new or unexpected approaches to defeating the system. As a software developer of 30+ years, I don't know how one would go about building a \"system algorithm\" to categorize threat level in an automated process. \r\n\r\nI suspect every threat needs to be carefully considered by a human. \r\n\r\nWhich leads me to my next and primary concern with this proposal as it stands: lack of community engagement. \r\n\r\nA successful threat identification and mitigation system needs strong community engagement, including access to experts, developers and stake pool operators. Yet this proposal appears to focus exclusively on the construction of a web application. \r\n\r\nI suspect this proposal is premature. Perhaps the idea should be discussed with community members first. \r\n\r\nFor example, when a threat is submitted, who will analyze the threat and categorize it? How do we verify this person's credentials? Do we compensate them? What policies do we use regarding disclosure of threats? How do we alert affected parties (developers, stake pool operators) of imminent threats?\r\n\r\nOnce we better understand the requirements for the system, and garner community buy-in, then we will know enough to begin building the web app.", "q1r": 1, "q2": "I suspect the proposal submitter has a vision for the application they intend to build in fulfillment of this proposal. But, as it currently stands, there is little evidence of the vision in this proposal. This proposal is too vague. We cannot effectively audit whether the project met it's goals because there are no concrete goals stated. \r\n\r\nI encourage the proposal submitter to include more details regarding the vision for the web application. What the app would do, not do, features left as possible future improvements, and so on.\r\n\r\nFor example, how will threats be tracked? How can community members see and interact with threats? Will threat submitters have their identity protected? How? Are anonymous threat submissions allowed? How are disclosure policies structured?", "q2r": 2, "assessor": "z_assessor_305", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is aligned to the challenge since it aims at creating a system to capture perceived threat, and the proposal fits the general purpose of the challenge. Although, there is a lack of key metrics to properly compare the proposal goals with the challenge goals. Also, it does not does not articulate how such a system would be, which makes it more difficult to evaluate the proposal impact and how big it could be, and how the proposal could evolve in the future to scale and sustain itself after funded. The proposal unfortunately seems to still be a draft and should have more information added, as explained in comments about feasibility and auditability. Score: 2", "q0r": 2, "q1": "The proposer mentions it's background, but he/she doesn't add any links or more details about his/her bio besides mentioning 15 years of experience and a master's degree.Since there is a lack of information about the project itself, such as detailed roadmap, goals and timeframe, it's not possible to evaluate if a team is required, and this is not mentioned in the proposal. This information should be included.The budget is not broken down and it is not possible also to evaluate if it's appropriate or not. There is a lack of general information regarding the feasibility of this proposal, since it's not possible to evaluate based only on the idea. To improve its feasibility, the proposer should include: a roadmap, timeframe, details about the proposer and a budget breakdown, at least. Score: 1", "q1r": 1, "q2": "This proposal lacks information to properly evaluate its auditability. In order to improve the auditability, the proposer should include a roadmap, milestones, the time horizon of development, key dates, metrics and KPIs. Also, the budget should be detailed to add the possibility of checking the proposal expenditures. Score: 1", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposed solution is to develop a  a capture/intake process for perceived threats. The proposer suggests to create an app/web location to capture threats from Cardano users and then categorize their threat level based on the system algorithm.  This might be a very good step to implement if it was followed by a real plan for developing the application and system logic and a forward view on how it could function. This proposal to me screams \"IDEA\" and not \"real implementation plan with specific milestones and deliverables\". It almost coincides with the name of the challenge, but is careful not to delve into too many (any?) specifics. The proposer should demonstrate more forethought, planning and consideration of possible paths, platforms, alternatives, mechanisms and choices that will be made in implementing the project. What are the hurdles to effective implementation? As it stands now, the proposal is so generic, so bland, so lacking in any detail that it is difficult to criticize it for any failure in planning. Namely, there is no specific plan - apart from a few sentences. So, my advice is to start setting up a team and explore the idea - as a possible MVP and plan to deliver the MVP and explore alternatives to how this could be done and what are the difficult design choices. \r\n", "q0r": 1, "q1": "OK, so the proposer hasn't included a professional biography and detailed competencies apart from generic statements This could be easily improved by providing a link to his/her Linkedin profile and projects that have been successfully realized - if any. Success is defined in a very limited way as \"Develop an app/web location to capture threats from Cardano users and then categorize their threat level based on the system algorithm. \" I feel this is such a low bar for success, especially without specifying any quality parameters, platforms, functionalities, user interface traits, maintenance challenges, budget breakdown, estimated costs of individual deliverables, technologies that will be used... There is so much that could go wrong in a project like this, but none of this is given any consideration in the proposal. The worry for me is that if the proposal is this bland (I strongly encourage the proposer to improve it in further rounds if it is not approved in this one) - then the outcome/product could be of a similar nature. This proposal needs more rigor, more documented experience, more forethought, and more structure and more team members probably and more planning in order to be deemed feasible - in my eyes. \r\n", "q1r": 1, "q2": "I can't see this proposal as a fierce contender in this challenge as there is very limited information provided to audit the progress and the success of the proposal. No deadlines, apart from a very general \"Estimated 6 to 9 months\"... The spending will be excruciatingly painful to audit as the budget is a lump sum. Whether the proposed app or website will really deliver on its functionalities is up in the air - as the only promised functionality is to \"develope a capture/intake process for perceived threats.\" No specifics apart from that ... and truthfully an app/site that invites email submissions would clear that extremely low bar. I would suggest to the proposer to revisit his proposal (if it is not approved this round) by thinking long and hard about a vision of the future in which his app/website works. Imagine how success looks like, in your head. Imagine how problems emerge. Imaging how you overcome these problems. This mental map for the future will help guide some design and system decisions today. Don't limit your proposal to an idea. Have a clear vision of the future .. and then write the gory details down in a proposal, the nitty gritty, what works, what will not work, analyze competing solutions in similar platforms for capturing perceived threats, also look at practices in other functioning systems. There is a lot of room for improvement here. Make your proposal easily auditable, define success in terms of deliverables, specific smaller and larger goals and go for it ", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "Having a hub for reporting perceived threats is an important part of addressing emerging threats.", "q0r": 3, "q1": "The plan is vague and there is no evidence of the claimed experience. A link to your LinkedIn/code repo/social media page would help to establish credibility.", "q1r": 2, "q2": "There are no milestones and the definition of success lacks measurable KPIs. Adding more detail to the plan and breaking it down into steps in a roadmap would improve the proposal's auditability.", "q2r": 1, "assessor": "z_assessor_504", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "Requesting 100% of the funds offered by this challenge, there is an expectation of a thorough, comprehensive and bulletproof proposal. Without any details there is not enough sufficient evidence that this proposal would be impactful or not on the Cardano ecosystem, and so it is hard to argue that this is a good use of treasury funds when other proposals in the challenge are asking for far less with more alignment with the brief.", "q0r": 1, "q1": "While some qualifications have been provided, there is no linkedin profile, website or sufficient knowledge about the proposer in the Cardano ecosystem to validate the information.  Attempts by the community to learn more information about the proposal through comments have not yet been met with responses.", "q1r": 1, "q2": "There are no clear deliverables or metrics with which to measure success. Additionally, no details on the risks / challenges of such a proposal has been provided.\r\n", "q2r": 1, "assessor": "z_assessor_590", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Before developing a solution(s) we need to first develope a capture/intake process for perceived threats.", "experience": "I have over 15 years of IT experience in various sectors and a Master's degree in Computer Information Systems from Boston University."}