{"id": 384668, "author": "yutazzz", "title": "Japanese FUD / SCAM Buster 100", "url": "https://cardano.ideascale.com/a/dtd/384668-48088", "category": 26239, "amount": 1500, "description": "日本のSCAMやFUD（ADAはギャンブルコインなど）に対応するチームがありません。", "funded": 2, "upvotes": 142915932, "downvotes": 11429946, "votes_result": 131485986, "votes_cast": 365, "f6_no_assessments": 9, "f6_rating": 3.6296296296296293, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal meets the challenge ask.  It is very specific to Japan and maybe would be better suited to be in that challenge fund, but it does meet the requirements of this one, just not as scalable as other proposals in this group.", "q0r": 4, "q1": "This proposal details the 'what' that the proposal is intending to solve, but there is little in regards to the 'how' this will be done.  Some of the items mentioned are very high level and doesn't detail enough to give very strong confidence in implementing successfully.  In addition, although understandably the group is planning to remain anonymous, there is a little lack of details on the experience of the team, besides one general sentence.", "q1r": 3, "q2": "Not enough data on how the project can be executed and transparency on how it can be measured are detailed in the proposal.", "q2r": 2, "assessor": "z_assessor_13", "no_vca": 23, "ne": 1, "ng": 16, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the challenge and aims to give additional communication channels in Japan to report possible scam and fud about Cardano. The idea is to set up a phone line and to do manual searches on the internet twice a week, the reason to set up a phone line being, that \"older\" people would use the phone rather than the internet to report scam/fud.", "q0r": 5, "q1": "The team is active in the community and since the proposal asks funding to set up a phoneline and to do manual searches twice a week I find it likely, that this proposal can achieve it´s metrics. I´m not well informed about the need for people to repport scams through the phone, so I cannot assess if this is relevant. \r\nThis is also basically the roadmap which is achievable and the set budget for this proposal is very low. ", "q1r": 4, "q2": "The proposer provided an email address as a contact option for any questions and the project itself will not be developed further, so I think there will be no website or github for the community to track progress. The team states that they want to provide a documentation of their findings to the community. Auditability is not that easy without a repository of sorts or a website.", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposer outlines the need in Japan for a dedicated team to help dispel misinformation about Cardano and ada. They describe the problem and the need for their solution with great reference to the history of Cardnao in Japan.\r\n\r\nCreating a dedicated crew to 'fire fight' disinformation in in Japan fits exactly with scope of the challenge and will be a boon for the Cardano Ecosystem. If successful their ability to continue the work without further funding from Catalyst is doable because the fundamentals  of the Phone Hotline and other communication channels and the volunteer network will be in place. The option, should they decide to expand the operation is there and additional funding, though not mentioned, could be sought. ", "q0r": 5, "q1": "Being a primarily volunteer based project means the likelihood of success is high as it seems the project will go ahead without Catalyst Support - and that they are looking for infrastructure costs only. The proposer is a long term Cardano supporter and has a role as an official ambassador.\r\n\r\nI am personally aware of the long term participation in Catalyst and community supporter. I believe they are genuine and that the project is feasible. More information could have been given in relation to the presence of and/or need of further team members.\r\n\r\nThe budget it outlined sufficiently, however seems low. This is however justified by the community support desire of the proposer and they are looking for minimal funds to over initial costs.\r\n\r\nFurther details could cover the risks of the project - For example how do they stand out and prove that they are not also a scam? Perhaps working with other similar projects to form a network to cross check each others validness could prove valuable in the long term.", "q1r": 4, "q2": "The roadmap of six months is provided. A bit more of a breakdown of the milestones along the process with perhaps some KPIs associated with these could have helped with the assessment.\r\n\r\nSome general possible KPIs in the form of scam searches undertaken and blacklisted items are provided. Given cost of the proposal the risk to the treasury is rather low.\r\n\r\nThe proposer has offered their contact details to ask questions and obtain further details should any member of the community wish. This is unnecessary but appreciated. ", "q2r": 4, "assessor": "z_assessor_209", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "It is very important to have an initiative focused on the Japanese community as they play a central role in the Cardano environment. Even if the actions proposed (setting up a hotline, organizing team chats and actively searching for scams) are not the most effective ones they remain valid. Plus, they all are strongly aligned with the goals of the challenge, which are to make truth easier to be established even for newcomers, not having trust being eroded and having transparency enhanced. What could be included to enrich the proposal is to make information about Cardano treasury more accessible and making beginner-friendly content more easily available. All in all, the proposal does articulate how it will add value to the Cardano environment.", "q0r": 4, "q1": "Evidence is given about the relevant skills and experience of the proposer (no link to support those allegations were provided because they claim to work anonymously to protect their members). At first only one person would be necessary to start the project and an assistant would help in case they receive the funds. The predisposition of the author to work on a voluntary basis shows how committed he or she is and that in this case willpower is more important than the resources. The budget is modest and focus on technology costs instead of hours worked. The timetable is realistic and is in agreement with the work proposed. Also, the proposer has explained how each task is expected to be done and not only what the end results will be. Finally, more discussion could have been given regarding challenges and risks to the successful implementation.", "q1r": 4, "q2": "More milestones could have been defined in this roadmap, basically the only one mentioned is the conclusion of the project 6 months after the beginning, but at least the time horizon is reasonable. Some KPIs were provided such as the number of scams they expect to have in the blacklist and the percentage of scams withdrawn. In my opinion another one aiming to measure the trust in the Cardano environment would be very attractive as well. Finally, the solution does address the problem stated if successfully implemented.", "q2r": 3, "assessor": "z_assessor_341", "no_vca": 21, "ne": 5, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "I agree that the potential impact of this proposal is very large due to the significance of the Japanese market in terms of its historical role in the Cardano initial distribution and the potential for futher growth thanks to the tech-savy mentality of the average Japanese citizen. It is nice that the proposers have an array of overlapping proposals that they submitted to the Catalyst Fund 7 and this one is very narrow in its focus - creating a contact point for Japanese people to report FUD via phone or LINE, etc. The team also gives an example of an ongoing scheme where the Japanese have been identified as a possible target as seen in the \"Cardano Foundation's Position on Suspicious Activities in Japan\" issued to BTCNEXT. However, one problem is that I am not convinced that the Japanese citizen who does not use online tools to report these problems will be able to find this specific line and phone number for reporting FUD/SCAM and that they will do it. Not sure about the specific impact that THIS proposal will have, despite the importance of the Japanese market. How will the Japanese people in their 40s and 50s who are not used to reporting on the web, find this number? The other aspect of the proposal:  \"actively search for FUD/SCAM twice a week, search and list them on the blacklist, and plan and implement measures to deal with them\" seems more feasible in terms of impact. However, the key step might be the next one - what to do with this information. Creating a blacklist is good, but how will the following be achieved: we aim \"to have more than 30% of SCAM/FUD/Misleading Expressions withdrawn\"? How will be this be done? I would have liked to see a better plan with more forethought about possible pitfalls and problems to be more certain of the final impact.", "q0r": 2, "q1": "I think that the proposal is likely to be implemented successfully as it is limited in scope and the budget is reasonable to achieve the set goals. But implementation and having a desired outcome is not the same thing. Catalyst is not implementing proposals for proposals sake, the aim is to steer the ecosystem to a better place. Will it happen as a result of this proposal given the experience of the team and the plan that they laid out for themselves? As the team mentions \"To protect our members from repercussions, we operate on an anonymous basis.\" - I would have liked to see more information about these possible \"repercussions\". The proposer has not explained them, I do not see any possible \"repercussions\" that would require the anonymous nature of the team. I am not saying that there aren't any - but the proposer should have explained the need for anonimity clearly. I haven't seen sufficient information about the implementing team and its competencies that would make this project viable AND effective. The key to these projects is that they stand a reasonable chance of being effective. If they are just implemented - but the end result is not really anything material for Cardano, then it is doubtful whether we have done anything worthwhile. The proposers could have listed a few examples of specific FUD/SCAM that they aim to target - that is available now and how they intend to eliminate it through this system. The budget is limited to $1,500 and seems reasonable for a proposal of this scope. However, I have doubts about the value for the money, despite the low sum involved.  ", "q1r": 3, "q2": "Auduting this proposal should be relatively easy for a native Japanese speaker. The team proposes to (1) set up a line and phone number for reporting FUD/SCAM [this should be easily verifiable], (2) increase the number of teams and organize team chats [not sure how this will be measured without precise numbers and with the planned anonimity], and (3) actively search for FUD/SCAM twice a week, search and list them on the blacklist, and plan and implement measures to deal with them. [this will depend a lot on the team's transparency and creating traceable workflow and documentation about actions taken]. As with many proposals, it is not just the implementing of actions, but the quality of work that will be paramount and it will be up to the proposer to convince an auditor that the quality of the work has been high - as it is hard to ascertain from the side. As for myself, I've been a CA in every fund since Fund 2 and vCA since Fund 3, plus a proposer. I've been part of the ecosystem since 2017 and have even set up my own stakepool (without formally registering it) for fun and to learn how difficult/easy it is. I've been staking since the ITN and have a lot of Cardano general knowledge and experience and Catalyst insight. ", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 18, "ne": 7, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is within the challenge goal and if implemented will have a great impact on adoption of Cardano in Japan. FUD in Japan is a known issue , and having a community with the local language educating the people will positively impact the overall Cardano ecosystem. setting up a line and phone number for reporting FUD is about solving a local problem with a local solution. The team has stated the reason because a typical Japanese will not report it on a website. ", "q0r": 5, "q1": "I greatly understand the need for the team to operate anonymously, tackling FUD from a known communities require access to such communities. The money requested is also less for the voluntary work the team will do, It very feasible in my opinion make this work at a local scale ", "q1r": 4, "q2": "The scope of activity of the proposal is within 6 months from that date , Without funding , the team still want to tackle this FUD issue , because it affect everyone. The proposal does not require alot finances to achieve it goal. The metrics are not well defined", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "Interesting idea. Since Fund 7 is also focused on Japan looking for SCAM and FUD is a good way to get traction on this proposal. By combining the interest of 2 challenges this is surely a proposal to consider. It fits within the challenge settings but is focused on one side of the community.", "q0r": 3, "q1": "Interesting idea to choose a phone line instead of a community web. My concern on this is how will people know what number to dial. By choosing a phone number you are also limiting the proposal to locals in Japan and not those that are active in the Japanese community but live abroad. In my opinion, it would've been better to set up a hub or server where the FUD/SCAM can be reported. One thing we are missing in the proposal is information about the proposer. I get that you want to stay anonymous but there are other ways to stay anonymous.\r\n", "q1r": 2, "q2": "The proposer does not really provide a roadmap, they only mention that the phone would stay active for 6 months. The would-be beneficial to the project if more information is given on what the actual plan is and how you plan on doing everything.", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 20, "ne": 0, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "The proposal identifies a problem within the challenge which needs to be solved. The proposal well explains the problem and the importance of the Japanese market for Cardano and why it should have dedicated service. The proposal clearly articulates how it will add value to the Cardano ecosystem focusing on the Japanese market. The key metrics and goals are well aligned with the outlined challenge settings. \r\n\r\nFrom my experience as an en entrepreneur for 20 years, offering a localized solution is needed in many cases for success and it is well explained why it is also needed in this case. ", "q0r": 5, "q1": "Looking at the alliances and co-proposals FUD has for Fund 7, it definitely shows that FUD is well inserted and respected in the catalyst community, although the specific names are not shared. The proposer provides a lot of relevant details, it is part of \"Cardano Foundation's Position on Suspicious Activity in Japan\" and has a direct interest as an SPO in keeping the network safe. \r\nThe propers will operate on a volunteer basis with a low and symbolic budget. It shows the interest it has in the solution. It will make sense in the future to have a dedicated team and find the resources to pay them, hopefully through a business model. \r\nThe proposal offers a scope of work for 6 months and provides a good plan of action tailored to the Japanese market. \r\n", "q1r": 5, "q2": "There is action plan suggested is simple, reasonable, and achievable.\r\nKPI is clear, measurable, and significant blacklisting 100 SCAM/FUD/Misleading Expressions - which means $15 per reported SCAM.  It could have been helpful to know the estimated number of total scams in the period and what % is estimated to be captured.  \r\nIn addition, clear objective to have more than 30% of SCAM/FUD/Misleading Expressions withdrawn. There is a clear understanding of the problem and the solution well addresses it. \r\n", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 21, "ne": 4, "ng": 15, "nfo": 2, "vca_o": 1}, {"q0": "Nice to read your suggestions and also thank you for the idea of Japan's efforts to deal with SCAM and FUD. The team has identified the issue of preparation and will go in the future. But if possible. What if the group thinks about the social networking section or the YouTube platform that is developing very well these days?. I think the team should consider more about the 2 channels I just mentioned. The problem described by the group is quite important, however. you can add some specific examples, it will be better, hope next time the team will clarify. anyway thanks for your efforts.", "q0r": 4, "q1": "The proposed group stated that they had the necessary experience. However, they did not provide any evidence to support the experience claims that you have made. At the same time, the group did not come up with members. You say that you do it anonymously, I think that for the community to review a project, it needs a lot of factors related to reality. Is there an investor who invests money in a project of unknown origin or implementation like that? and maybe you need to add some more references or more concrete evidence about this proposal. hope you will pay attention to this issue next time.", "q1r": 2, "q2": "The proponent has given the steps and the main content that you are aiming for. However, the proposal is quite attractive in terms of problem. but has not given any concrete evidence to confirm. is determined to be highly transparent to the community, so how can I track your project as it is done. I am quite concerned about this you are also missing a realistic roadmap that needs to be added. about how you can implement the proposal.", "q2r": 2, "assessor": "z_assessor_644", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "日本のSCAMやFUD（ADAはギャンブルコインなど）に対応するチームを作り、可能な限り対応していきます。", "experience": "SPO、公式アンバサダー、FUDN2提唱者、EXPOメンバー、ステーキング説明資料作成"}