{"id": 381001, "author": "joshf", "title": "Cardano Mobile Hubs", "url": "https://cardano.ideascale.com/a/dtd/381001-48088", "category": 26244, "amount": 30000, "description": "Les besoins en capitaux importants pour un centre communautaire de type brique et mortier sont prohibitifs pour une adoption à grande échelle.", "funded": 2, "upvotes": 94025871, "downvotes": 9975942, "votes_result": 84049929, "votes_cast": 281, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "Dans le cadre du raisonnement de l'équipe, je vais souligner deux points : (1) les coûts associés à la mise en place d'une communauté de type brick-and-mortar sont prohibitifs dans de nombreux cas, et (2) les cas d'utilisation des hubs sont généralement ponctuels, comme la création d'un compte ou d'un portefeuille, ce qui rend les taux d'abandon élevés. Bien que ces arguments soient valables, ils ne sont pas forcément applicables à toutes les situations. L'équipe prévoit de s'attaquer à ce problème en créant une version innovante du \"hub\" avec pour principale caractéristique la mobilité, où l'accent sera mis sur les processus d'accueil des personnes totalement novices dans cette technologie. De même, je considère que le problème et la solution sont pertinents, et que les mesures de réussite proposées sont appropriées et conformes à l'objectif de ce défi.\r\n", "q0r": 5, "q1": "L'AMA a constamment et avec succès apporté de la valeur à la communauté tout au long de son histoire. Josh est le leader de l'organisation. Des références à son profil LinkedIn sont fournies, mais aucun détail n'est donné concernant l'équipe affectée à cette proposition. Il y a également une description détaillée du plan de mise en œuvre, qui permet de comprendre les actions requises. L'équipe décompose ensuite le budget en 5 composantes identifiables. Cependant, je dois admettre que, de mon point de vue, un plus grand effort aurait pu être fait. Par exemple, en ce qui concerne l'élément \"coût de l'équipe\", la communauté devra connaître le nombre de personnes affectées au projet, la description de leurs rôles, et le taux horaire attribué à chacun. Un domaine dans lequel je dois complimenter l'équipe est la section sur la gestion des risques, qui non seulement identifie les obstacles possibles au succès, mais suggère également des contre-mesures qui peuvent être prises pour atténuer le risque identifié.\r\n", "q1r": 4, "q2": "Enfin, l'équipe a fourni d'excellentes descriptions des sections qui sont pertinentes pour évaluer l'auditabilité de la proposition. Elle fournit les informations nécessaires pour comprendre les actions immédiates après l'allocation des fonds, ainsi qu'un aperçu de la feuille de route sur deux ans. À mon avis, cette section est appropriée et conforme à ce que l'équipe recherche. Dans la section suivante, les paramètres de réussite sont évalués, et là encore, un excellent travail est réalisé, car les paramètres sont liés à des jalons dans le temps. Le seul aspect qui me manque est l'établissement d'objectifs pour chaque \"métrique clé\". C'est essentiel pour que la communauté puisse effectuer un audit à tout moment pendant toute la phase de mise en œuvre.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 21, "ne": 12, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment. This knowledge gives me the skills to assess proposals in this challenge. The proposal identifies an important problem within the challenge which by adressing it, will provide a perspective to people in regions with weak infrastructure and give them Accessibility to the Cardano network and other services, aiding in onboarding an entire new group of people and giving them novel perspectives. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 5, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "The objective of this proposal is to create a MVP for a mobile hub. This seems like an effective solution to the problem stated which is the high cost of brick-and-mortar hubs and subsequent risk of abandonment i.e. inefficient use of human and material of resources. This fits perfectly within this challenge and, if implemented properly is highly scalable as multiple mobile hubs can be deployed across the world on demand and would significantly drive the adoption of users on the ground level. ", "q0r": 5, "q1": "The lead for this project is identified and demonstrates experience to manage the implementation of this project. We know that other members of WADA will assist on this project, but ideally more team members could have been specified, especially members of the design team and engineers, as their role seems critical to implementing this proposal. It is not clear what format these mobile hubs will take, is the intention to make use of existing local venues, or to deploy and actual full mobile vehicle unit or tent, or both ? This is important to know, at least for the first prototype you are designing, as the associated costs vary greatly depending on the options. It is also not clear were the first prototype will be deployed, somewhere in Southern Europe ? The proposal describes a detailed roadmap, with quite ambitious timelines (lunch of the first CMH within 60 days), but this seems feasible given the WADA team support. The budget requested seems appropriate and is itemized, although it’s not very clear which section of “Near-term Roadmap” + “2-year Roadmap” this intends to cover. The proposal presents an appropriate assessment of the risks.", "q1r": 4, "q2": "A roadmap is presented with clear and verifiable milestones. The key metrics presented are relevant, but given that the initial objective of this proposal is to create a MVP/prototype of a CMH, it would have been beneficial to describe KPI’s specific for that initial unit, so that the community could gauge the outreach potential of these units. Relevant and ambitious success criteria are described, although could be more specific on what “having contact with the Cardano Mobile Hub” means.\nThe nature of the problem is well introduced by the proposal, and likewise the solution is well articulated, including the description of use cases, target audience and impact on the ecosystem.", "q2r": 5, "assessor": "z_assessor_125", "no_vca": 21, "ne": 5, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal reminds me of the proverbial phrase involving a mountain and a prophet with the former deciding to climb it instead to present an alternative to the status quo. I provide strong agreement for its impact and alignment and for thinking out of the box. Communities, especially in Africa may find it more difficult to gather at a stationary meeting point; distances may be too far to travel and may be costly, or worse yet, transport is non-existent. What an ingenious way to solve the problem but to bring Cardano to the people instead. That this was presented by the WADA Alliance to me raises their pursuit for innovation even  higher whether this proposal gets funded or not. Commonly and in a pandemic-ridden world, cynics would say, well why not do it online instead? But therein lies the conundrum which brings Cardano to the African continent and is the reason why World Mobile is gaining traction. The proposal's presentation seems polished and aside from the specific requirements in terms of mobility and engineering, which is part of the initial steps anyway, it clearly explains the goals, the rationale behind the solution and the way forward, past the funding requested in Fund 8. Polished. Congratulations. ", "q0r": 5, "q1": "As mentioned, the WADA Alliance have successfully established four community hubs already and this is essentially the basis for my strong agreement with regards to this proposals feasibility. There will have certainly been lessons learnt over those processes which gives the confidence that giving a hub legs, pivots the difficulty to its mobility, as opposed to the establishment of the hub itself. Since this is a WADA Alliance undertaking it comes with the growing resources in terms of personnel, knowledge and experience that their leader Josh can rely upon. And as serial Catalyst proposers, funding winners and deliverers of projects they have a proven track record for the feasibility of their projects. The plan presented seems to be well-thought of starting with a pilot CMH with engineers and designers to come up with the hub-on-wheels rubric. Their near-term roadmap contains goals which are very doable (although with the current logistical issues we're having globally for equipment this timeline may need to be extended) but what impresses are their plans after this pilot where the idea, once proven, is expanded to a level that is self-funding with no reliance on Catalyst in the future. What essentially is being proposed here is not simply a truck with antennas for internet connection where people can gather around but a way to traverse that last mile where Cardano ends (with World Mobile's help) and people live. ", "q1r": 5, "q2": "The strongest point for this proposals auditability is WADA Alliance's eagerness to update their websites about any projects they are undertaking whether within or without Catalyst. I am sure we will see the progress of this mobile hub on their socials. In terms of this proposal's six-month timeline, there is also a mention of a new website specific to the CMH and the development of tracking capabilities, which I presume will pinpoint locations where the hub is parked. Their target audience at the beginning consists of universities, government locations, other hubs and conferences. Overall, a good proposal. I wish you success and possibly growth of similar mobile hubs in other countries and continents proposed by other Catalyst participants. ", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Créer un prototype minimum viable pour un centre mobile, qui pourrait être stationné dans les régions où la demande est la plus forte mais où les infrastructures font défaut.", "experience": "Responsables du hub du réseau Wada, conseillers en ingénierie mécanique. Une équipe rompue à l'ensemencement et à l'incubation de plus de 4 hubs communautaires Cardano."}