{"id": 383445, "author": "seedstars", "title": "Catalyst in Emerging Markets", "url": "https://cardano.ideascale.com/a/dtd/383445-48088", "category": 26244, "amount": 21500, "description": "85 % de la population mondiale vit dans des marchés émergents et frontières et manque d'informations sur Blockchain, Cardano et Catalyst.", "funded": 1, "upvotes": 78675484, "downvotes": 20956067, "votes_result": 57719417, "votes_cast": 365, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The team behind this proposal states that the majority of the population dwells in emerging and frontier markets, and at the same time these are the areas that possess the least information about blockchain technology. In order to address this problem, they plan to organize digital events to promote the Cardano ecosystem to Seedstars entrepreneurs. There is no doubt that there is a clear connection between the objectives of this proposal and the challenge. This could be an invaluable source of ideas for new proposals in future Catalyst cycles. Although the success metrics proposed by the team seem concise and appropriate, they do not state a target for each metric. As a result, it is not possible to estimate the impact in a precise manner. \r\n", "q0r": 4, "q1": "Seedstars and Catalyst School have created a fantastic partnership, as each brings a component that from my point of view could be disruptive to the Catalyst community. In this case, I believe it is not relevant to discuss the criteria for skills and experience. This budget and schedule request is for five events, one for each region of the world. This is broken down into four identifiable items. I must say that I would have liked to know the number of people and roles they will have, as well as the hourly rate. I believe the budget amounts requested are reasonable. \r\n", "q1r": 5, "q2": "Lastly, I have to point out that the fact that this proposal is easy to implement makes the information regarding the roadmap, although simple, sufficient in my opinion. The community may also verify the execution of this proposal in the first weeks with evidence of the launch of the marketing campaign, web page, and after the fifth week with the execution of the events. I recommend to the team that after the events are executed they make this material available to the community on platforms such as YouTube. Surely they have it planned but it is not specific in the proposal. \r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 22, "ne": 9, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal promesses to introduce its users to the cardano ecosystem. With more that 200 000 active users, according to their claims, it's needless to say that this will have a positive impact on the cardano ecosystem. The proposer network is mainly composed of entrepreneurs, which will definitely increase the value of the cardano networks as new builders join the community. I can fairly say that this proposal key metrics and goals are perfectly aligned with the challenge. The only part that I have some reserve on, is that I don't see how the project is going to scale in future challenges unless they can find ways to grow their audience. I think that the proposer should try to include this information in the proposal if there is actually a plan for that. \r\n", "q0r": 5, "q1": "The proposer has stated that their audience network is more than 200000 people, but there is no evidence of that. I would suggest to the proposer the add screenshots of the analytics of their website or other links that can confirm those claims. The good side of it is the partnership with the catalyst school which is well known and trusted in the community. I think that this is adding a layer of confidence about the credibility and feasibility of this project. Furthermore, the number of the team needed is precisely disclosed by the proposer. The proposer has also provided a timetable that we the community can refer to if needed. The proposer has provided all the informations such as what the project is all about, and all the resources needed to carry it out successfully. My only advice for the proposer is to mention challenges and risks that this project may face and what to do in case some issue arises. Apart from that, all the informations are on point for an eventual successful implementation.\r\n", "q1r": 5, "q2": "This project includes all the informations necessary to be audited correctly. The proposer has included a roadmap and milestone for the implementations. The proposer has also defined the metrics such as the engagement, the number of users attending and more. I think that it is easy to measure and track the success of this project. Altogether, I can say that this proposal is auditable and that the problem and solution has been broken down in order to be easily understandable.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Seedstars is a European based, globally facing company that supports Entrepreneurs worldwide through capacity building, events and resources. Their proposal engages the Catalyst School to promote Cardano to the Seedstars ambit worldwide as part of a dedicated series of workshops aimed at their audience. \r\n\r\nSeedstars evidently have a genuinely global reach and in terms of this challenge, it would provide value to the Cardano Ecosystem to potentially tap into this dedicated audience of entrepreneurs from across the globe. Depending on the success or outcome of this partnership it is likely that Seedstars could be a solid partner for Cardano into the future and potentially expand the reach of Cardano quite rapidly. ", "q0r": 5, "q1": "Seedstars are very polished, they have a successful track record providing opportunities to entrepreneurs and project managing markets and workshops. The team is experienced, given that Seedstars will take on the project management and the Catalyst School will deliver the content there's a highly specialised team behind it. There's no specificity as to who is running these events however or what content is suggested to be delivered so there is some ambiguity here. \r\n\r\nThe timeframe spans 8 weeks, there isn't a very detailed timeline included in the proposal but given the audience is already captured, this might not be a huge issue. Marketing to an established group about an online event is not necessarily something that requires a huge amount of time, however, it would be good to see a touch more detail around what is going to be delivered and when. \r\n\r\n\r\nThe budget is clearly broken down. It is a fairly big ask for a short timeframe however the quality of other Seedstars content is quite high, so it's likely a relative amount required for the team to execute a Seedstar online event. ", "q1r": 4, "q2": "A basic website will be made to serve as a landing page and to host the main information about the events and registration. this will make it easy for the community to audit.  Success will be measured by the number of people involved and the flow onto people involved in fund 8, the outcomes should be delivered within 2 months from funding.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Créez un partenariat : Seedstars et la Cardano Catalyst School font la promotion de leur contenu auprès de plus de 200 000 entrepreneurs de notre réseau.", "experience": "Nous aidons les entrepreneurs de plus de 90 pays à faire croître et à développer leurs entreprises afin de créer des changements significatifs et durables. seedstars.com"}