{"id": 383670, "author": "john.jackson", "title": "CardanoHTX", "url": "https://cardano.ideascale.com/a/dtd/383670-48088", "category": 26244, "amount": 3500, "description": "Houston et le Texas sont des économies majeures avec une communauté Blockchain, mais le réseautage entre les développeurs orientés Cardano fait défaut.", "funded": 1, "upvotes": 27668957, "downvotes": 22740721, "votes_result": 4928236, "votes_cast": 101, "f6_no_assessments": 4, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Je pense être compétent pour évaluer cette proposition car j'ai été actif dans le projet Catalyst depuis le fonds 4 et j'ai de l'expérience dans l'analyse des besoins d'affaires de plus de 5 ans de livraison de solutions logicielles pour les petites entreprises et les sociétés ainsi.\r\nL'énoncé du problème est clairement formulé et facile à comprendre. Il est probablement vrai qu'une plus grande mise en réseau serait bénéfique à l'écosystème.\r\nLa solution semble incomplète, elle ne dit que \"commencer par des réunions informelles\". Cependant, d'après le reste de la proposition, on peut déduire que la solution proposée consiste à organiser des réunions à Houston et à y créer un Cardano Hub. Essayez de faire attention à ajouter la solution aux propositions à l'avenir, car il est important d'attirer l'attention des électeurs dès le départ. Ils doivent voir la qualité dans les premières phrases qu'ils lisent.\r\nLe plan me semble logique. Le Texas, et plus particulièrement Houston, semble se transformer en un centre d'affaires, potentiellement fort dans le domaine de la technologie, surtout depuis qu'Elon Musk, Joe Rogan et d'autres grands noms ont commencé à s'y installer. Essayer d'y établir une présence de la communauté Cardano semble être une très bonne idée. Félicitations à l'auteur de la proposition. Ils ont également très bien décrit les avantages qui seraient apportés à Cardano. Présenter Plutus à la foule là-bas pourrait avoir un énorme potentiel pour nous.\r\nJe trouve que les objectifs de la proposition sont ambitieux, mais raisonnables, tout comme les mesures (2 réunions dans les 3 mois suivant le financement avec 50 visiteurs uniques semble très faisable). Si je peux me permettre de faire une suggestion, peut-être que fixer un objectif pour les adeptes des médias sociaux serait une bonne idée également, afin que nous puissions en faire le suivi. Même si la solution n'est malheureusement pas clairement formulée, je pense qu'il s'agit d'une bonne idée avec un bon plan d'action et je suis tout à fait d'accord pour dire qu'elle répond efficacement au défi \"Scale-UP Cardano's Community Hubs\".", "q0r": 5, "q1": "Je suis au regret de dire que la proposition n'est pas à la hauteur dans cette catégorie. Le proposant a seulement mentionné qu'il a occupé des rôles de direction dans des organisations servant des communautés d'intérêts spécifiques. Les électeurs voudront savoir qui vous êtes exactement et ce que vous avez fait, il aurait donc été formidable d'ajouter quelques références ici. Une page LinkedIn, une chaîne Youtube, voire un compte Twitter ou Facebook auraient permis de mettre un visage sur le nom et de montrer aux gens qui travaillent sur ce projet. De plus, il aurait été bon d'apprendre à quelles organisations vous vous référez et quelles étaient vos responsabilités là-bas.\r\nLe budget est à mon avis très raisonnable et il est également ventilé de manière compréhensible. La seule chose que je pense qui aurait pu être ajoutée ici est une section traitant des risques possibles. Cela montre aux électeurs que vous êtes vraiment sérieux dans votre planification. Par exemple, que se passe-t-il si de nouvelles fermetures sont imposées dans les mois qui suivent ? Une solution possible est de tenir les réunions sur Zoom, ou de les tenir en direct mais avec moins de personnes, etc.\r\nEn raison du manque de références personnelles et de l'absence d'analyse des risques, je ne peux attribuer que 3 étoiles à la section \"il est très probable que cette proposition sera mise en œuvre avec succès\". J'aurais aimé donner plus, mais ce sont des données cruciales qui manquent.\r\n", "q1r": 3, "q2": "À mon avis, cette proposition est très claire dans ce qu'elle veut faire et la feuille de route qu'elle fournit, ainsi que les indicateurs clés de performance, sont satisfaisants. Non seulement le proposant a fixé des objectifs réalistes pour les 3 à 6 mois, mais il montre également qu'il pense à l'avenir, en espérant obtenir un nouveau financement après 12 mois et étendre encore plus cette initiative. Je pense qu'il mérite 4 étoiles pour sa clarté et sa vérifiabilité. L'étoile manquante est due au fait que la solution n'est pas clairement décrite au début et que la proposition manque un peu d'informations sur le proposant lui-même. J'espère que nous verrons tout cela dans le prochain concours. Bonne chance, j'aimerais que cela se produise !", "q2r": 4, "assessor": "z_assessor_546", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The proposal seeks to create a foothold in Houston, TX. Considering the proportions of economy Texas holds and an already established presence of blockchain as a whole, it could prove fruitious to, and I believe this is key here, 'Identify future opportunities to establish a permanent footprint'. So for the requested amount, this can be viewed as a prospecting venture open to analysis at a later time. ", "q0r": 4, "q1": "The proposal is a pilot lasting for a 6-month period to determine if there is an opportunity to expand on this. What I did not see in the proposal is where the visitors would come from. Are you aiming for students or general public? Where will you advertise and how? Some additional information on the identity and organisational skills of the proposer could improve this proposal in terms of feasibility. ", "q1r": 4, "q2": "There is a roadmap, budget breakdown and KPIs present in the proposal. To improve the proposal, try adding some background information on the proposer and insight in how the meetings would get marketed. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 24, "ne": 2, "ng": 17, "nfo": 5, "vca_o": 1}, {"q0": "Establishing a cardano HUB in Houston is in accordance with the challenge goal. \r\n\r\nIts efficiency to output/budget is great.\r\n\r\nThe question arises - where these meetings will be held? online? since there are costs for beverages I expect it will be in person = you need to rent a space, or this space will be for free? This requires more details.\r\n\r\nRating given 4.", "q0r": 4, "q1": "The experience posted seems not to be in perfect accordance, so it is hard to tell whether he can deliver the final output. \r\n\r\nAlso, some linked in profile would be nice to see and maybe establish a team. Right now, it will be a one-man job where the likelihood of success is speculative. \r\n\r\nOn the other hand, some objectives seem reasonable and achievable. \r\n\r\nRating given 3.", "q1r": 3, "q2": "The budget is divided into different categories, seems reasonable.\r\n\r\nMetrics are also provided which can be audited.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal aims to increase awareness and adoption of Cardano among Houston and Texas communities, so it is aligned with the challenge's goal. Given the recent actions taken by Texas towards promoting blockchain initiatives in the state, it is a major opportunity to give Cardano a spotlight in this new scenario. Reaching more people and businesses would certainly add value to the Cardano ecosystem. However, the final objective of having 200 members by the end of the year could be more ambitious, as it does not explore the full potential on this new blockchain capital. Perhaps, setting up more monthly meetings in different locations across Texas could improve the reaching potential.", "q0r": 4, "q1": "The proposer is very brief about his relevant experience. Having held leadership roles in organizations should make him fit for setting up this hub, but it is vague concerning which areas of the organizations he was leader in, which industries those organizations were operating on and which specific communities of interest they were serving. Besides that, there were no words regarding neither which skills he has that could help him implementing this proposal, nor which skills would be needed. In the same way, he also does not specify the type and number of team members required to accomplish his goals. The budget is spectulative and does not detail what the coordination means, how the marketing would be done, what is the platform that he wants to set up and if there would be rent costs for the meeting places. The implementation plan could have more details about how each step is going to be done, such as which social medias would be used and which kind of content would be published, what kind of spaces the meetings would be held in, how he expects to attract people, encourage ambassadors and the timeline for those steps. On the other hand, the proposer indentifies as a teacher and proposes to include classes to the hub activities. That could be a powerful way to increase reaching with the average non-technical people, which is a key point in this challenge. Adding the details mentioned will certainly increase this proposal attractiveness.", "q1r": 2, "q2": "There is not a clear roadmap, as the steps are not detailed on how to be executed. There should be a specific deadline for each step. The milestones include number of meetings and number of visitors and members, which are tangible KPIs to quantify the success of the project. A more detailed roadmap with specific deadlines will give the needed auditability.", "q2r": 2, "assessor": "z_assessor_951", "no_vca": 17, "ne": 8, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "En commençant par des réunions informelles,", "experience": "J'ai occupé des rôles de direction dans des organisations servant des communautés d'intérêts spécifiques."}