{"id": 384284, "author": "tatzmiki", "title": "INDIGO, NFT & SUSTAINABLE FASHION", "url": "https://cardano.ideascale.com/a/dtd/384284-48088", "category": 26244, "amount": 50000, "description": "-La mode doit trouver un moyen d'être durable pour lutter contre les problèmes environnementaux.\n-La communauté du crédit a besoin d'un plus grand nombre de personnes d'origines diverses.", "funded": 1, "upvotes": 78961100, "downvotes": 12940857, "votes_result": 66020243, "votes_cast": 167, "f6_no_assessments": 6, "f6_rating": 3.0555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "(this proposal is repeated, so I decided to write the same assessment and rating. https://cardano.ideascale.com/a/dtd/INDIGO-NFT-SUSTAINABLE-FASHION/384284-48088. My recommendation for the Catalyst team is to eliminate one of them. ) In this proposal, the team proposes two solutions: improving the environmental performance of the fashion industry and increasing Cardano's diversity. The fashion industry has become increasingly interested in sustainable production, so this proposal is of great interest to me, as it would attract the community part of society, which is very distant from blockchain technology in general. Although I agree that this proposal is aligned with the challenge, without clear metrics it is difficult to objectively assess its impact.\r\n", "q0r": 4, "q1": "(this proposal is repeated, so I decided to write the same assessment and rating. https://cardano.ideascale.com/a/dtd/INDIGO-NFT-SUSTAINABLE-FASHION/384284-48088. My recommendation for the Catalyst team is to eliminate one of them. ) Based on the qualifications and experience of the author of the proposal, I believe they are satisfactory. Reference links are provided for verification. With respect to the budget, it is divided into four identifiable components, however, a better job could have been done with regard to the detail described. For example, I find a range of $5000 to $10,000 per event to be quite broad. The assessment becomes even more difficult if data on the size of these events is not provided. Another example would be the allocation of $13000 to NFT development; in this case, additional information such as the number of developers which are to be hired and their estimated time of development should also be included. The author should also provide a description of an implementation plan. It is vital that the community understands what needs to be done to ensure success of this proposal. Consequently, I cannot agree or disagree with its feasibility. \r\n", "q1r": 3, "q2": "(this proposal is repeated, so I decided to write the same assessment and rating. https://cardano.ideascale.com/a/dtd/INDIGO-NFT-SUSTAINABLE-FASHION/384284-48088. My recommendation for the Catalyst team is to eliminate one of them. ) Unfortunately, there are some elements missing in the auditability aspect of this proposal which would make it difficult for an accurate assessment. It is appropriate for the author to provide for future Catalyst cycle elements, such as a roadmap of the implementation. This is because it is only stated that this proposal will be completed in six months. In addition, the author should provide a description of the success metrics. Examples may include the numbers of events to be executed, the number of expected participants for each event, the number of new owners of NFTs as a result of participating in their events, or the number of pieces with NFTs generated. \r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 16, "ne": 7, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal tries to address the quite ignored issue of the fashion industry needing more sustainable ways to fight environmental issues and also the need for people with diverse backgrounds in the ADA community.\r\nThe proposer trying to address this issue with help of NFT Technology and add new diverse people through Dyeing events", "q0r": 5, "q1": "Based on the details provided the team appears to be well versed with the requirements and to have the essential expertise in the dyeing field but there is no mention of experience in NFT related or any similar projects. The proposer provides the voters with a detailed action plan, however, the success definition for these milestones and KPIs seems to be missing. With all the presented plan the possibility of successful\r\nimplementation of the proposal is less", "q1r": 2, "q2": "The proposal doesn't consist of Key performance indicator, a Definition of success, and a clear roadmap with the timeline. It also doesn't include detailed fund breakup. With this information missing it would be hard to audit the progress of the proposal and track its success.", "q2r": 1, "assessor": "z_assessor_317", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The project proposal is to create a series of dyeing workshops to promote non-oil based dyeing agents.  Secondarily it proposes to use NFTs to track information about the material and dyes used. \r\n", "q0r": 2, "q1": "The bulk of the budget goes toward a non-technical series of events that do not promote the Cardano ecosystem.  The secondary goal is to use NFTs and does have potential to promote the Cardano ecosystem.  The budget for the NFT goal is vague, and there do not seem to be technical people attached to the project. The proportion of the budget that goes toward NFT development is relatively small (13,000 of a 30,000 budget).  \r\n", "q1r": 1, "q2": "No specific KPIs are proposed.  The success of the dyeing workshops is arguably measurable, but really moot as they do not touch the Cardano ecosystem. \r\n", "q2r": 1, "assessor": "z_assessor_607", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is very exciting and promises to bring new and great value to Cardano. Sustainable fashion will be the trend of the future. Helping promote sustainable fashion and incorporating NFT technology into the project will be very beneficial to Cardano's reputation because it brings tremendous value to the community. In addition, expanding applications into areas other than those related to tech or finance is necessary to make Cardano more popular. The fashion area is a fascinating one and has the potential to bring new opportunities when successfully combined.", "q0r": 5, "q1": "The team has experience in the field of sustainable fashion, has worked in the fashion capitals and has a good understanding of the operation of NFT technology. They also show enthusiasm with the goal of achieving sustainable fashion and bringing value to the community through the new idea of combining with NFT technology. However it will be better if they include more detail plan of their actions toward that goal. For example they can include roadmap with more detail information.", "q1r": 4, "q2": "The proposal need to have KPIs to measure the success of the project: such as how many specific events they will organize, how many participants will join etc", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "I agree that this proposal addresses the challenge because the proposal can attract diverse people who care about fashion/ environment/ NFT users to Cardano community. Briefly, it supplies an organic method to dye clothing called indigo dyeing and creates NFT to contains all information of items. The idea of replacing petroleum-based dyes with natural indigo based one is just amazing for the environment. And the idea to link it with NFT & Cardano after each indigo dyeing workshop is creative!", "q0r": 5, "q1": "I have checked on Tatz Miki reference of skills and experience and I was blown by those beautiful workshops he did around the world. I think that the proposer has a team, and I suggest to list the team members onto the proposal. Budget should be broken down specifically. And, timeline must have been added.\r\nAnother thing that make me concern is that the action plan to create a community circle in each workshop remains unclear. The proposer should work more on this part since creating new Cardano's hubs is the requirement of this challenge.", "q1r": 3, "q2": "Although this proposal bring up an innovative idea, it doesn't provide me very sufficient information to assess its progress to success. I advice the proposer to spend time working more on writing. \r\nRoadmap with milestones, key metrics to measure and KPIs all must be added. ", "q2r": 3, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I think it is effective. There are many ADA holders in Japan, but many of them have little involvement in the community. Therefore, it is necessary to hold an event to activate their involvement. And I think the NFT distribution event through the experience of Indigo is very interesting. It is also appropriate for environmental conservation trends. In conclusion, I give a rating of 5.", "q0r": 5, "q1": "The feasibility is high. One of the proponents has successfully raised funds with Fund6 and has a high level of expertise in NFTs. In addition, we have already established a cooperative system with indigo producers. However, I think that team member information and roadmap should be included in the proposal draft as well as the attached slides. In conclusion, I give a rating of 4.", "q1r": 4, "q2": "Auditability is not sufficient. The roadmap and KPI settings are generally ambiguous. In particular, auditing is not easy because KPIs are not specified. In conclusion, I give a rating of 2.", "q2r": 2, "assessor": "z_assessor_867", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "-La mode peut évoluer grâce à la NFT qui garantit l'origine des matériaux.\n-Les événements de teinture peuvent attirer diverses personnes dans la communauté.", "experience": "Nous avons une grande expérience dans ;\nOrganisation d'ateliers de teinture à Paris, Milan, Tokyo...\nFabrication d'articles de mode teints à l'indigo avec détails des composants"}