{"id": 369557, "author": "", "title": "ADA giveaway or lottery", "url": "https://cardano.ideascale.com/a/dtd/369557-48088", "category": 26118, "amount": 10000, "description": "誰もがADAを大量に、あるいは全く手に入れることができないかもしれません。", "f6_no_assessments": 8, "f6_rating": 1.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Giving away money is obviously a great way to increase the community hubs, but would have loved to see the detailed plan, what lottery schemes will be kept, if DApps will be used which one, More constructive plan can be added in the future proposals as an improvement.", "q0r": 3, "q1": "Would be great to see the proposer's background, some social links maybe, or the links to previous works, and also some more details about the execution would have been great.", "q1r": 2, "q2": "Since the timeline is missing in the proposal, adding a detailed timeline like what we'll be able to expect in a timely manner would be great to see in proposals in further rounds", "q2r": 2, "assessor": "z_assessor_208", "no_vca": 9, "ne": 3, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "While the idea itself may be generous, it doesn't really address the challenge. From my experience giving away things doesn't bring much value usually. Even if a small percentage gets a bit interested, most of these funds will be lost-forgotten or instantly sold. Just like a classic type of cryptocurrency airdrops. Creating engagement campaigns with rewards in ADA, for example, could be a way better choice. Proposer could focus on that.", "q0r": 2, "q1": "Plan is very simple, very general and gives a feeling of being written quickly. I would suggest more official attitude during next proposals, also with more data included. Proposer experience is generally missing, in case of \"being a giver\" revealing your real name would be a plus.", "q1r": 1, "q2": "No precise KPIs or aim is presented so it will be really hard to assess the success. Maybe introducing some tool that will track the receivers wallets, whether they staked/put their ADA in use or just sold them or left unattended could be a nice option. ", "q2r": 1, "assessor": "z_assessor_324", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal does not address the challenge effectively. There is no mention of a creation community hub. ", "q0r": 2, "q1": "Since this proposal is the wrong challenge, in my opinion, I don't consider that implementing it is relevant.", "q1r": 2, "q2": "This proposal doesn't contain some KPIs that can be used to audit the project. For this reason the auditing will be difficult.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "Not enough analysis is given on how this can be achieved.", "q0r": 3, "q1": "The experience stated \"i do a lot of giving\" is a nice gesture and a lottery is a great idea but the funds must come from somewhere and there is no explanation of this in the plan.", "q1r": 2, "q2": "There is no plan for a successful outcome and no statement on where the funds will come from to support the lottery ", "q2r": 2, "assessor": "z_assessor_523", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Good concept. However it is too general and does not present a single idea. The idea needs fleshing out as well as the plan has too little detail. It is important to take into account how to market the giveaway and get the word out, as there is no point to this unless it engages the community. I suggest instead of a large giveaway, to have smaller giveaways to give more of a chance for engagement.", "q0r": 3, "q1": "No indication has been given as to how well the proposer can implement the idea. From my experience in digital marketing and fundraisers, it is very important to have sufficient marketing which is not provided here. I suggest that the proposer reach out to an expert to help develop the idea and provide a solid and executable plan.", "q1r": 1, "q2": "No criteria has been given to assess the success of the proposal. A way to assess this could be the numbers for each giveaway that participate.", "q2r": 1, "assessor": "z_assessor_525", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Although I agree giving is a great way to help others and improve the community at large there needs to be a structure about it and a mechanism to trigger such if its charitable donations or if its a lottery system thats a great idea that could work as a token within the blockchain. More details as to how to get there needs to be presented and perhaps some experience behind the project could prove helpful in realizing the potential of the idea.", "q0r": 3, "q1": "The experience is \"giving\". Although a noble altruistic nature I'm  unear how this would help develop a lottery token or a charitable token with this lavk of data about how the solution will be implemented and the funds used to achieve it.", "q1r": 1, "q2": "There is not much data as per roadmap, stage ny stage progress or kpis to audit the progress. The funds used are unclear as well as to what type of work is being undertaken to achieve the solution \"lottery\".", "q2r": 1, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This does not provide a plan to help scale up adoption and awareness. This seems like just a proposal to give away sums of ADA with nothing attached to providing value for cardano or its users.", "q0r": 1, "q1": "no experience provided besides \"they do a lot of giving\". No real plan on how to do giveaways, just stating giving away.", "q1r": 1, "q2": "This proposal does not provide clear or suffecient info to audit the progress and success of this project. We would have no data to measure where the funds went and if they were successful in scaling up adoption or awareness.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "ADAをプレゼントしたり、何かの抽選会をしたり。ゲームやトリビアのようなものもいいかもしれません。可能性は無限大です。", "experience": "私はたくさんの寄付をしています。"}