{"id": 383178, "author": "berzub", "title": "Forecasting Cardano Native Tokens", "url": "https://cardano.ideascale.com/a/dtd/383178-48088", "category": 26247, "amount": 9900, "description": "Small circulation compared to ADA and complex dependence on underlying factors make the valuation of the Cardano native tokens challenging.", "funded": 2, "upvotes": 53579626, "downvotes": 4073544, "votes_result": 49506082, "votes_cast": 139, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an interesting small project to use reinforcement learning to value illiquid tokens. Seems like a great project and its good to get projects using AI which provide a service to the community. It would be nice to have a more clearly defined deliverable than just design the model. Will it be tested and written up as a report? Will it be deployed and run continuously? Will the code be released?", "q0r": 4, "q1": "The plan is not very - detailed research tokens, design reinforcement model. The proposer claims experience in the space however doesn't provide any qualifications or references other than to the Photrek website.\r\nAs there are not really any details on what will be implemented, its hard to give it a high likelihood of successful implementation.\r\nWhat does Design the model mean? Are you actually going to fit the model to data and test it? Its not clear to me that reinforcement learning is the right category of algorithms for pricing illiquid securities. This is generally used when you have an environment you can repeatedly simulate and take different action each time to find the best course of action. Valuing illiquid tokens seems more like a classification problem. Find the correlation (or other parametric/non-parametric relationship) between coins and use that to change the value of an illiquid coin when coins it has a relationship with move.", "q1r": 3, "q2": "The proposer aims to research the tokens and design a model, however the outputs of this project are not very well defined. Will you implement the model. Train and test it? The proposer has not given any clear metrics for success which can be measured. They have stated that success would be identification of a set of potentially valuable tokens or a set of features useful for valuation. That doesn't line up well with the states goal of valuing the illiquid securities for which the metrics would be accuracy of valuation for an illiquid token which has not traded when a price event occurs against which we then have visibility.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 26, "ne": 6, "ng": 19, "nfo": 1, "vca_o": 1}, {"q0": "Working in the trade of consumer goods, it has come to my attention that the value of an asset in markets is primarily determined by their supply and demand volumes. Training a machine to detect and recognise patterns is an interesting approach. \r\nOverview of who launches what and when, accompanied by their initial values is needed in the ecosystem as right now it relies heavily on potential investors to do their own research in trying to find their options and what value those would hold. ", "q0r": 4, "q1": "The project is set to request 3 consecutive funding proposals, each spanning 3 2-month phases, so the entire project would request ~29700 USD over a timespan of a year and a half. The proposers have relevant experience to develop this, along with a team of academic collaborators found on their website. ", "q1r": 4, "q2": "There is a roadmap, KPI, periodic definition of success and budget breakdown. It isn't entirely clear how the budget breakdown applies to the phases as the timespan does not correspond with the prospected 12 months, so it would be an improvement to provide a short general overview on the entire project. A further improvement would be to shed some light on how the algorithm variables would look like as what you're aiming to do depends on that. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 26, "ne": 2, "ng": 23, "nfo": 1, "vca_o": 1}, {"q0": "Data gathering is always a good approach for AI and ML. The proposer plans on gathering data and researching all native tokens that exist and tokens that wish to launch on the Cardano ecosystem. This could improve the ecosystem and help investors because the data would be accessible.", "q0r": 4, "q1": "Regarding feasibility, the proposal has all the relevant information. The team has the relevant experience needed to develop this. They provide this information on their website. Looking at the detailed plan we see that the proposer plans on proposing again in F8 and F9. This shows that the team has thought about it and has decided to split up the proposal for a better chance at funding. Since this is the first step in their plan to build an AI service for native tokens, we are only focusing on gathering data in this proposal and the roadmap regarding this speaks for itself. The budget is also more than reasonable.", "q1r": 5, "q2": "We have a good roadmap, the budget breakdown is rudimental but does suffice. The proposal also states key metrics and defines what success is for the team. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "We propose the development of an automated valuation method for native tokens based on tools of machine intelligence for complex systems.", "experience": "Applications of reinforcement learning to improve actions (e.g. trading) in a complex environment (e.g. market for native tokens)."}