{"id": 384084, "author": "rsw33n3y", "title": "AI Resolution of Smart Contracts", "url": "https://cardano.ideascale.com/a/dtd/384084-48088", "category": 26247, "amount": 16000, "description": "Resolving smart contracts often depends on centralized data sources, non-experts & those with conflicting incentives.", "funded": 2, "upvotes": 38366255, "downvotes": 10280562, "votes_result": 28085693, "votes_cast": 119, "f6_no_assessments": 4, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal for using staking to allow the resolution of outcomes for smart contracts. The proposers mention AI and ML a couple of times, but nowhere do they provide any detail on what algorithms they are using. The process they describes seems like it could be very simply coded up and not require any ML algorithms. Please provide some more information on how AI is being used here. Apart from the fact people need to stake to propose an outcome, there is no discussion on how malicious actors will be managed. How will you stop people betting on an outcome and then proposing their outcome happened. Sure they may have to stake a multiple of their winnings, but if the outcome it automatically resolved, what's to stop them railroading the opposing side in the resolution phase? Maybe this can be done with AI, but you have not discussed it. The term adversarial machine learning comes to mind.", "q0r": 2, "q1": "Whilst the proposers likely have the ability to build a system to weight votes and decide an outcome, they have given no details on what type of AI/ML system they intend to build. Thus I cannot give high confidence that we will receive an AI resolution of smart contracts system. They may deliver system which automatically resolves as discussed, but would we really view a simple system that just took the max staked proposed result as the answer AI?", "q1r": 2, "q2": "As the proposers have not discussed in any detail the AI system they are proposing to build, its not really possible to audit the delivery. They have also not discussed the elephant in the room, dealing with malicous players trying to game the system by betting then fixing the result. What does success look like? How will they measure if the results of their system match actual results? How much error is acceptable? ", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 29, "ne": 6, "ng": 21, "nfo": 2, "vca_o": 1}, {"q0": "The idea of using a betting platform to provide data for AI-ML is intriguing and could lead to a broad array of applications. Training a machine by rewarding the user when making a right decision through a tokenised economy creates a win for all situation, which we all aspire. As a betting man, myself, this system could have some future in a 'earn as you play' format. ", "q0r": 5, "q1": "The team is well documented on the website. What is unclear from this information is who has the experience in ML? Consider communicating this in the proposal if such a professional is needed or utilise the seek-tags. The requested budget seems adequate to develop this, although a bit on the lean side. ", "q1r": 4, "q2": "The auditability of this proposal is good. There is a clear set definition of success in terms of product release. The launch date has been defined and is realistically determined. The budget has been broken down. All necessary elements are present. To improve the auditability, some more depth could be added to the budget breakdown to ensure the requested funding would suffice. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 30, "ne": 2, "ng": 25, "nfo": 3, "vca_o": 1}, {"q0": "Interesting idea, using a gamified version to provide data is a unique way to attract a large community. This fits within the challenge settings although I am missing the direct link with ADA.", "q0r": 4, "q1": "Regarding feasibility, we get a reasonable amount of information. We get the relevant experience from the team on their website, in my opinion, this could've been presented on the proposal itself for more clarity. The roadmap is more than feasible and the budget request is sufficient. I included a bit more details in the roadmap.", "q1r": 4, "q2": "The proposal gives us all the necessary information for auditability. Providing the success metrics gives us a guideline that the team wishes to accomplish. As stated in the above rationale budget breakdown is present and reasonable. ", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The proposal team are looking to create a system that implements the right incentives for producing a source of high quality oracle data. They intend to use this service in their own application but it's uses apply to other projects.\r\n\r\nOracle data and its correctness is a vital part of the ecosystem, there is potential for this proposal to be of high impact if implemented well. The proposal team has not given any depth to why their system will be effective nor any mention to existing research or competitors in the space which they can make comparisons too. Due to this it is hard to gage whether their proposal will have a large impact on the ecosystem without clearly defining the benefits of their own approach. The team also lacks sources of their skill sets or example implementations so this also brings the potential for impact into question. With better market research and information on existing implementations and team background a higher rating could have been provided.", "q0r": 3, "q1": "The team give a good high level overview of what they intend to build but do not give any depth as to how they will use smart contracts, SingularityNET or machine learning in general. This makes it more difficult to assess how feasible their proposal is. \r\n\r\nThe team members are not listed in the proposal however images and descriptions are provided on the website. No LinkedIn or similar sources are provided so it is more difficult to determine whether the team actually has the skills they state they have as there is also no example implementations they showcased in the proposal.\r\n\r\nA basic break down of the budget and timeline is provided which for the budget size is acceptable but more information on the development overview would have been useful to better gage how feasible the proposal is. ", "q1r": 3, "q2": "The success metrics given are more of a timeline than being focussed on assessing the outcome or KPIs related to what they are building. The clarity of what they want to achieve is more clear however the proposal lacks demonstration of what key things they are looking for to know whether this proposal has been a success or not. The proposal team has also not mentioned whether any of the work will be open source, nor have any previous examples of open source work which in future proposals should be stated so the community is more aware of how to audit the progress of the proposal over time.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 18, "ne": 6, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Use AI (particularly ML) to evolve models for oracle data selection and verification with timely resolution and correctness incentives.", "experience": "Global team of professionals with experience in Software Development, DeFi, Betting, Machine Learning and Blockchain. See betallin.io"}