{"id": 381617, "author": "henno", "title": "Open Source for the environment", "url": "https://cardano.ideascale.com/a/dtd/381617-48088", "category": 26251, "amount": 4380, "description": "Природа - это внешняя сторона нашей экономической системы.\nЧем быстрее мы сможем взять у природы все, тем больше прибыли мы получим.", "funded": 0, "upvotes": 19070348, "downvotes": 27883141, "votes_result": 8812793, "votes_cast": 122, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=13945"], "media": [], "f6_assessments": [{"q0": "Проект предлагает новую валюту, которая будет соотноситься с природой через дополнительный измерительный компонент, изменяющийся в зависимости от способа производства продукта и от того, является ли этот процесс разрушительным для окружающей среды или нет.  Влияние зависит от принятия этого проекта, поэтому его очень трудно измерить самостоятельно. Этот проект, безусловно, поможет экосистеме разработчиков Cardano примером создания Dapp. В предложении указано, как он принесет пользу, но не указана экосистема кардано. Этот проект еще лучше вписался бы в задачу DApps & Integrations. Сможет ли предложение расшириться с ростом интереса, зависит только от автора, но, учитывая заявленный опыт, я не вижу никаких проблем в том, чтобы приветствовать вызовы и потенциальный рост.  ", "q0r": 4, "q1": "Влияние этого проекта зависит от его принятия. В первую очередь от того, насколько поставщики продуктов будут честны при описании процесса, который они используют. Для меня этот факт является большим недостатком проекта. Понятно, что автор проекта вложил в него много усилий, но я также считаю, что это слишком идеалистичный подход, чтобы работать на практике, основываясь на видео, размещенном на канале youtube, где говорится, что соотношение между тем, сколько нужно платить за продукт, косвенно зависит от того, насколько честно поставщик отвечает на вопросы о происхождении воды, используемой для выращивания продукта, об используемых фурилизаторах (разрушительные для окружающей среды или нет) и ряд конкретных вопросов для каждого вида продукта. Я вижу два основных практических вопроса, которые нигде не были упомянуты: 1. Как гарантировать, что поставщики будут честно отвечать на вопросы, которые потенциально могут нанести ущерб их бизнесу. 2. Кто решает, какие вопросы задавать для конкретного продукта. Из-за этих двух основных причин я не верю, что этот продукт осуществим. Если автор предложения не планирует собрать команду для будущих предложений, опираясь на это предложение и поддерживая его, будет очень трудно воплотить эту идею в жизнь. Бюджет разбит на статьи, но мне кажется, что для достижения поставленных целей необходимо большее финансирование. Я говорю как разработчик, который проделал независимую работу, аналогичную данному предложению. В предложении нет расписания, поэтому я бы сказал, что это критическая точка улучшения данного предложения. Имеется обширное описание конечной цели, что замечательно, но я не нашел в предложении конкретных шагов по ее достижению и графика реализации всего плана.  Технические аспекты не были достаточно подробными, чтобы я смог их понять, хотя я просмотрел несколько видеороликов, размещенных на канале автора предложения. Что-то вроде whitepaper было бы отличным способом ознакомить людей с фактической реализацией идеи. В предложении только говорится, что токеномика для этого проекта сложная, без дальнейших объяснений. Я бы предложил подумать о соответствующих рисках для успешной реализации, например: нужна ли мне команда? есть ли у меня конкретные шаги, дорожная карта и расписание для выполнения задач?", "q1r": 2, "q2": "Автор предложения не упомянул никаких KPI или способа отслеживания хода реализации предложения, поэтому мое предложение - сосредоточиться на четких практических примерах и целевых KPI, чтобы сообщество cardano могло помочь и понять всю идею проекта.  Как уже упоминалось, нет никакой дорожной карты или вех, о которых можно было бы говорить. Мне с трудом удалось найти четкое описание вопроса \"как я буду реализовывать проект?\". Решение кажется отличным, но я не понял плана фактической реализации и бизнес-интенсивов.", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is a novel and a Nobel attempt to create an open-source system that will enable value creation by following nature-preserving options in any walk of life. However, its direct impact on the open-source echo system is debatable. This proposal may have limited direct impact directly but may act as a catalyst to force the open-source community to delve more in this exciting area. ", "q0r": 5, "q1": "The proposer is developing a model to monetize nature preservation measures, this is a much-needed revolutionary concept and needs to be taken up. The proposer has been following the idea in a passionate manner and created a centralized website that is able to demonstrate the idea. This is a novel and complicated mechanism and needs substantial oracle support in a decentralized setting. The deliverables of the proposal are not explicit and may not create an immediately usable system. ", "q1r": 4, "q2": "The proposal has listed 7 features that he aims to develop in this fund these are clear software features and will be released in open-source. The project can be audited based on the quality and the number of deliverables successfully created. There is a need for creating more documentation on how the tokens can be made valuable and how they will be pegged to fiat. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Your statement, \"The quicker we can take everything from nature, the more profitable we will be.\". The above information would be easy to confuse the reader about your project's working progress intention if not read through your entire project. It should be clearer where and how the community will access your results output and the availability channel. ", "q0r": 4, "q1": "With 20 years plus in database development back and front and website design and implementor. I am not quite sure why your crucial performance and course breakdown only create a small website functionality, draw some pictures on objects and research, research, and a small questionnaire to be developed for $4380. I believe you would deliver better with your skill-set in database and web services. As the proposer stated, it is a proof of concept. I think in the next three months, with the key performance indicator, the proposer would be able to deliver the promised PKIs.", "q1r": 4, "q2": "The proposer should have highlighted clearly whether the community will benefit from your project available in Cardano ecosystem open-source packages or your project using available open-source resources for your project. Once the progress is evident and nailed down agenda, the committee has a more transparent view to audit your project progress. This also helps the current Fund 7 Challenge team easier to make a report for the next three months if your project is being funded.", "q2r": 3, "assessor": "z_assessor_726", "no_vca": 15, "ne": 4, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "В жизни. В этой жизни все связано.\nСвязать окружающую среду с транзакциями сложно?\nМожно ли это сделать в Cardano?", "experience": "Инженер-технолог, 20+ лет разработки (базы данных, веб-сервисы, фронт-энд и бэк-энд).\nПровел годы в электронной коммерции и бизнесе"}