{"id": 382199, "author": "highlander", "title": "Smart Contract Library - Phase 1", "url": "https://cardano.ideascale.com/a/dtd/382199-48088", "category": 26251, "amount": 45000, "description": "Cardano не имеет библиотеки смарт-контрактов с открытым исходным кодом, которую разработчики могут использовать для быстрого создания прототипов.", "funded": 1, "upvotes": 47711176, "downvotes": 17707950, "votes_result": 30003226, "votes_cast": 200, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Этот проект направлен на создание и открытие исходного кода набора шаблонов смарт-контрактов для ускорения общего развития cardano. Это будет большой вклад с еще большим влиянием, если это произойдет, из-за толчка, который это даст любому разработчику для тестирования и знакомства с экосистемой cardano и тем, как все работает. Предложение определяет проблему, подходящую для постановки задачи. Есть четкое представление о том, как это повлияет на экосистему кардано. Нет ни одной ключевой метрики, которая соответствовала бы описанию задачи. Я бы посоветовал добавить их в будущие предложения. Я имею в виду, что авторы этого предложения имеют серьезный и значимый опыт в создании смарт-контрактов в Эфириуме, и я уверен, что они смогут принять любые будущие вызовы, идущие им навстречу.  Если это предложение будет реализовано, оно многое добавит в экосистему в плане многоразовых шаблонов смарт-контрактов, что необходимо для растущих сообществ, таких как сообщество кардано.   ", "q0r": 5, "q1": "Планируется нанять разработчика open plutus pioneer, который имеет опыт работы с умными контрактами, но этого еще не произошло, поэтому никаких документов не может быть предоставлено или связано, что является препятствием, поскольку конкретный человек, который мог бы достоверно выполнить работу, привнес бы доверие к этому предложению. Бюджет довольно прост, в основном, это выплата зарплаты одному человеку для выполнения работы. График мог бы быть лучше, так как нет никаких вех, кроме выпуска бета-версии. Осуществимость проекта будет зависеть от того, сможет ли команда найти разработчика для выполнения этой работы или нет. Хорошо то, что есть четкое понимание и план того, сколько членов команды потребуется для реализации предложения. Бюджет достаточно ясен, понятен и разбит на части, чтобы описать шаги, необходимые для достижения цели. Может возникнуть необходимость в дополнительных технических задачах и этапах на этом пути. Существует реалистичный график, и если авторы предложения будут следовать ему, то не должно возникнуть проблем с выполнением работы в соответствии с планом. Есть описание необходимых элементов для реализации, но нет дорожной карты, которая четко объясняет последовательные задачи, над которыми будет вестись работа, что могло бы помочь сторонникам этого проекта в реализации.  Я, как разработчик, ожидал увидеть какую-либо архитектуру или план технологий, которые будут использоваться. Это помогло бы мне понять, насколько легко будет найти человека для выполнения этой работы. Без конкретики я не могу дать правильную оценку успеха на основе того, что описано в предложении. У авторов предложения есть опыт разработки смарт-контрактов на Эфириуме, что будет полезно, несмотря на то, что экосистема и парадигмы на Кардано отличаются.  Возможно, есть возможности для сотрудничества между этим проектом и другими, которые я видел в рамках задачи \"Экосистема разработчика\".", "q1r": 4, "q2": "Поскольку команда планирует, что весь код будет открыт в репозитории, я не думаю, что для любого заинтересованного лица будет проблемой следить за ходом проекта. Не указаны KPI, что помогло бы любому члену сообщества оценить успех предложения. Я бы предложил добавить более конкретные KPI и, возможно, разбить предложение на несколько различных задач, которые будут реализованы в течение нескольких фондов.  Дорожная карта - это безусловное предложение для будущих предложений фондов, это просто неотъемлемая часть любого хорошего проекта.  Можно было бы дать больше объяснений по технической стороне вопроса, но в целом я верю в этот проект!   ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This is a brilliant and game changing idea to have a smart contract library available to help speedup the developments proocess on the cardano ecosystem. This is game changing it will help speed up the process of application development on the cardano blockchain since developers can easily use already build open source templates which will ease their burden of having to start writing smart contracts from the scratch.", "q0r": 5, "q1": "The team have the required expertise to execute the project. The budget sits well though not so detailed but it is reasonable to guarantee a successful project execution.", "q1r": 4, "q2": "The proposer has outlined a timeline for project execution but has failed to include key metrics/KPI's, which is key to be able to help audit the progress and success of the project when funded. ", "q2r": 3, "assessor": "z_assessor_799", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal clearly and concretely answers the most important guiding question of this challenge, “How can we ensure future developers benefit from the work that is funded today?”. Its plan is simple to describe and understand, but its impact could be substantial, not only for existing Cardano smart contract developers, but also it could prove a great resource for attracting new developers to the platform by making their transition much easier with a prebuilt library of smart contract templates, which is the aim of this project. Overall the proposal could have a big impact on the ecosystem if properly executed as it could make the experience of smart contract developers on Cardano much smoother.", "q0r": 5, "q1": "The team clearly has experience with building blockchain related applications, as is evident from their website, which hosts multiple NFT related mini-games. But, from the looks of it their current smart contacts run on the Binance Smart Chain & Ethereum and it’s unclear if they have Cardano specific experience, as that’s not mentioned in the proposal. However this may not have a great impact on the feasibility of the proposal as their plan is to hire an external developer part-time to write the Cardano specific smart contract templates, in fact this is where most of their requested budget is allocated towards (40 out of 45K).\nTheir goals are realistic, the proposal is written in a very down to earth manner and the requested budget seems feasible. The very reasonable amount of $30/h is given, and a full year of part-time development is factored in.", "q1r": 5, "q2": "The audibility section of the proposal is the only one that leaves a few things to be desired, like a clear description of the KPIs and of the exact intended launch dates. However these can be easily deduced from the proposal, as they are mentioned. Thus the progress of the proposal according to the given timeline, as well as the completion of the smart contract templates could be easily monitored and verified by the community auditors. However if a future submission of the proposal will be required I would recommend including these elements.\nI would like to mention that in the case of this proposal specifically the community would need to audit the quality of the technical output as well as the overall completion of the project. We certainly want to be vigilant about wasting community treasury funds, but perhaps in this case it would be even more important to assess the quality of the smart contract templates generated by the project. It would be far worse to release a set of flawed smart contracts in the community carrying the stamp of approval of project Catalyst.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is clear and concise which aims to build and publish a series of smart contracts templates, similar to Ethereum's Open Zeppelin which Cardano developers can use. Laudable idea and it addresses the challenge effectively.", "q0r": 4, "q1": "The team is behind the Highlander platform and they have written smart contracts on Ethereum already, and are capable of implementing the project. The plan depicts that they aim to build an introductory series of smart contract templates for token issuance, NFTs, and governance protocols. They will then release the contracts to the public and refine thm based on user feedback. The team can successfully implement the project based on the valid facts in the proposal.", "q1r": 4, "q2": "The budget is well broken down and timeline clearly showing 3, 6 and 12 months. The amount requested is also reasonable for the project.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 23, "ne": 1, "ng": 15, "nfo": 7, "vca_o": 1}], "solution": "Создать и опубликовать серию шаблонов смарт-контрактов, аналогичных OpenZeppelin от Ethereum, которые смогут использовать разработчики Cardano.", "experience": "Мы - команда, стоящая за платформой Highlander. Крис является нашим ведущим разработчиком и имеет большой опыт написания смарт-контрактов на Ethereum"}