{"id": 396578, "author": "rootsid", "title": "RootsWallet - Presentation Exchange", "url": "https://cardano.ideascale.com/a/dtd/396578-48088", "category": 26443, "amount": 20600, "description": "Identity wallets require Presentation Exchange protocols for advanced interactions while requesting and providing verifiable information.", "f6_no_assessments": 5, "f6_rating": 4.866666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 8253, "q0": "Yes, this proposal effectively addresses the challenge by delivering the first open source credential wallet on the Cardano blockchain. To ensure a broader range of functionality, the team will develop and implement presentation exchange protocols to include more complex situations and streamline user experience. A major challenge facing the shift to digital identity is getting people to see the benefit of switching from more legacy systems to digital, however the focus on improving user experience can work to mitigate this while increasing adoption. \n\nThe RootsWallet team has a variety of proposals in Fund8 that address different components of their plan, which are all standalone pieces but that work in concert within the final solution. This may increase the impact of the proposal itself by not making it success dependent on the others, rather the components are complementary. \n\nAnother significant impact factor is the team's excellent job of partnering with a variety of different projects across Catalyst that will act as use cases for its functioning. By developing additional presentation exchange protocols the team is providing it's collaborators the option to deliver more advance DID capabilities, while documenting the entire process for future adoption by other projects. This means that the solution being presented here will not only impact the RootsWallet team but instead will have cascading effects across each of the projects, further driving overall impact. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. The team has shown their track record and ability to deliver in multiple ways throughout the proposal. The documentation on RootsWallet shows that it is largely developed and the team is now shifting focus to its optimization and feature development. The beta version is to be launched during Fund8 and the features to be added upon successful funding. This indicates that they are well on their way to delivering their solution which is a good sign for voters. \n\nThe plan as outlined appears reasonable and the infographic of their staged approach offers a good representation of where they are within the process, including next steps. Each milestone and deliverable highlighted is then broken into its smaller components with descriptions of the tasks required; a level of granularity that implies the team's intricate knowledge of the necessary steps. \n\nAnother strong feasibility indicator is the Team's explicit commitment and participation among bodies that are working to standardize processes and best practices, including the Trust over IP network, and the Decentralized Identity Foundation. By working closely with these partners and aligning their development decisions to the latest information, the team is likely to have a final product that is effective and useful. \n\nFinally, the team's commitment and collaboration to a variety of partners within the Catalyst ecosystem also strengthen the feasibility of this proposal by having direct use cases which their solution can be tested against. This group will also work as a sounding board for the documentation developed and allow the team to make refinements that are clear and understandable for end users, which is the principle challenge for adoption. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. In line with all their other proposals, the team commits to being open-source by default, which includes transparent tracking and reporting through a public repository. The team will utilize github to track github issues, project views, commits, and development sprint percentages of progress. This approach is always a welcome sign in a proposal as it indicates the team's willingness to face public scrutiny and feedback.\n\nAnother strong audit feature of this proposal is the workflow alignment with the standardization bodies and partners. Each of these entities will perform its own audit function on the proposal itself as they look to integrate the solution within their own projects, a benefit of this approach is the iterative nature through which the solution will be developed to ensure that the final product is actually useful. By maximizing these relationships all teams are more likely to succeed and support each other to become their best versions. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 602, "q0": "This proposal is another bite sized chunk of the SSI elephant that RootsID is working on.  In this one they have laid out a project to develop Presentation Exchange Protocols to enhance the RootsWallet (their PRISM SDK identity wallet).  Think of these protocols as expressions of the relationship between the Verifier and Holder of something like a DID.  In fully implemented SSI, a Holder should be able to pick and choose what Verifiers see when verifying a proof that the Holder has the proper DID, and Verifiers can pick and choose what they ask for when requesting a proof.  In order to do that, the Verifier and the Holder have to \"talk\" to each other: at a minimum the Verifier needs to be able to describe the requirements that it considers to be the proof of that DID, and the Holder needs to be able to describe what it has submitted to meet the requirements for that proof.  The Verifer presents its requirements, the Holder presents its submission to meet those requirements, the two exchange those presentations...voila, Presentation Exchange Protocol.  The proposer says these protocols \"matter the most\" in SSI, and that is a fair statement.  Without them, verification is all or nothing, and in order to have selective privacy you would need to break SSI up into a vast number of discrete IDs, leading to redundancies and wastes of processing power.  Having these protocol standards in place will help anyone building with these tools to bring that functional versatility to their wallet experience, and beyond the protocol documentation, RootsWallet will be developing and implementing their version of it.", "q0r": 5, "q1": "The challenge here is the moving target that they are trying to hit, but to the degree that they can keep it in their sights, this should be a pretty straightforward project.  The team is going on 3 funds now of being supported by Catalyst in creating a homegrown SSI solution, and the team are all PRISM Pioneers, with credentials heavily tilted to the development side.  They lay out the timeline clearly and in conjunction with their development schedule, with phases outlined by the week and an overall delivery schedule of 12 weeks.  They have provided a nice buffer of time at the beginning to get the documentation of the protocols right, which is good.  As mentioned the standards being set for these Presentation Exchanges is a work in progress across DFI, Hyperledger and ToIP (or at least, that is where the most robust, thoughtful work is being done...sometimes these things show up from elsewhere) and so there is likely to be some iterations of the protocols as they are getting into development.  The budget is the standard one shared across all of their proposals in terms of hourly developer compensation, and the hours listed, particularly for the 8 weeks of development sprints and testing, are accurate (and I should note it leaves room on the weekly for other hours being logged from their other projects.  I sometimes worry about teams that are spread across too many projects, and after reviewing all their proposals in SSI and Accelerate Decentralized Identity, I got curious and put the different sprints in a spreadsheet.  Lo and behold, all the hours fit a standard (for Catalyst) workweek, fitting together like a puzzle.  The team has clearly mapped this project out well.)", "q1r": 5, "q2": "The roadmap has been clearly stated with discrete phases that line up well with the beats of an audit:  documentation and delivery of the standards first, workflow design next, big development sprint with testing(in Agile on GitHub with sprint burndown for meeting %complete metrics for those progress reports), and finally project documentation and a deliverable wallet.  With all the code and documentation going opensource into Github, this is not only an easy project to track, but other projects will have resources to lean into if they desire (and there are many AtalaPRISM Pioneers who have an eye on these repos, I assure you).  The proposer's experience with Catalyst is showing with this auditing profile.  The community should have no problem keeping up with RootID progress.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 7142, "q0": "The proposers plan to improve their current version of RootsWallet which is an open-source wallet with the final goal that the wallet will be used for AtalaPrism. \n\nSince it is an open-source solution, we can expect the impact to be enormous, regarding the current Cardano community, and possible future newcomers, developing their solutions. RootsWallet will then increase the speed and if built flawlessly, the efficiency of the future projects, increasing the adaptation both of Cardano blockchain and AtalaPrism. \n", "q0r": 5, "q1": "The proposers were funded in the previous funds, delivered their products, are active members of the community. Based on their Github and deliverables, we can conclude that they possess the required skill and experience to deliver the final outcome. Also, linked in profiles and multiple funded proposals are inducing confidence about the team and its capabilities. \n\nThe roadmap is set to three months, with the list of end tasks, and their weekly estimations. The budget is then calculated based on an hourly wage, and this level of detail is one of the best across many proposals I have seen because it provides to highest detail possible. ", "q1r": 5, "q2": "The progress of the proposal can be tracked by GitHub since it is an open-source project (number of issues solved, commits), and a shared depository for additional documentation. Extra auditing can be performed using the offered SprintBurndown method - displaying the percentages of the progress. \n\nThe success will be audited by their beta version. Additionally, we can measure the success by the number of implementations of RootsWallet to external projects.\n", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7881, "q0": "Decentralized identity solution is an urgent need of any technology field when the situation of personal information exploitation and manipulation by some organizations has raised concerns about the security of personal information. confidentiality of personal information in the 4.0 decade. However, we need really excellent, outstanding proposals and a team with enough experience, academic proof or full research before implementation to avoid unnecessary mistakes. That key thing I haven't seen in this project. Although I agree with your ideas.", "q0r": 5, "q1": "\"They said that they are currently implementing many different proposals of catalyst at the same time, so the time allocation is a bit difficult, not sure how to guarantee the progress. I recommend that you deal with few proposals but go into depth to create products that are truly applicable to the digital life and reach a large number of users.\nTheir plan for 3 months, they just outlined a few sketchy ideas about the plan, this is not enough to convince me much. You need to make a more detailed plan and have a detailed explanation for the technology solution and its application scope.\"", "q1r": 5, "q2": "\"This group applies Agile methods referenced from github sources for project progress reporting. The project is tracked in progress and has metrics that can be checked via github.\nThe project is committed to developing applications that bring the privacy of personal information on defi environment. Really the technology solutions and what they present are not too impressive for me. Hopefully they will provide more complete and scientific information in the following rounds.\"", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 9970, "q0": "This is an continuous proposal from the Fund 6, Fund7 and continuous at the Fund 8. This is a very usual identity wallet to creat the trust credentials in the trustless environment. The problemed was already clearly defined in the previous fund setting, this is more focus on the Beta release solution with the promising step of  providing the first open source wallet for Atala Prism. Paradoxically the team is very lean and propose 3 months to solve and complicated protocol with more customization instead of standardization. The is also a direct call out on the team members support as the core team only have 4 members. The honest concerns and callout from the team should be highly appreciated.", "q0r": 5, "q1": "This part is really stretching timeline action with 12 weeks and high intensity of working level. The cost is a bit luxurious $100/hour for the 4 team members instead of the outsource and different mean of allocation of the budget should be highly encouraged. The total budget is 20,600$ which is roughly around 4% of the toal challenges settings. The Linkedin and git hub repo is highly reliable and the team got funded for the past 5 proposals since the Fund 6 which proven their experience in the Cardano Decentralized Identity community. Rodolfo Miranda and Esteban García is very well known and prestigious in teh LATAM community with a rich experience in the open source projects. There is less doubts in the project leaders, more over the team members who actually deliver the planned workload is stretching and worried from the objectives point of view.", "q1r": 4, "q2": "This is simple and stated very clear in the Open Source Code and Documentation which should be found in the main website https://www.rootsid.com/rootsid and the team github repo. There should be a more weekly updates so that the community can have a more frequently update instead of putting everying at the deadline of the proposed timeline. Such transparent updates such as iohk status  update in the cardano https://roadmap.cardano.org/en/status-updates/ is highly recommended and building the trust for the whole Catalyst community.", "q2r": 4, "assessor": "z_assessor_782", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will continue to improve our Open Source RootsWallet by adding more standardized Presentation Exchange protocols.", "experience": "The team is fully engaged on Self-Sovereign Identity projects in the Cardano community with several projects already funded and delivered on F6 and F7. They've developed RootsWallet, the first open source Identity wallet for Cardano's Atala Prism platform and beyond."}