{"id": 396593, "author": "rootsid", "title": "RootsWallet beta - Social UX", "url": "https://cardano.ideascale.com/a/dtd/396593-48088", "category": 26443, "amount": 33600, "description": "There is no Cardano - Atala Prism open source identity/credential wallet mobile app focused on Catalyst grass roots identity project users.", "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 604, "q0": "This is one of those last mile upgrades that truly moves a project from the alpha to the beta stage, ready for testing in the community.  The proposers envision an identity wallet experience where the identity relationships (I am a student at your university, I am a citizen of your county, I am a customer of your store, etc) are the main operating interface with the user.  Besides being something a lot of users are deeply familiar with, it also leverages unique aspects of SSI (like DIDcomm) and expresses a deeper truth about the self-sovereign Identity revolution:  the expression of our identity in a secure way only matters because we have relationships with others in a world where trust has become prized.  Take away those relationships, whether through a lack of social cohesion or an imposition of a strict structure of arbitrary relationships (and the legacy of our institutions is a sad combination of both), and there is nothing for SSI to build out or on.  The RootsID team is suggesting here that using a messaging platform, with characteristics of discord/slack/telegram combined with SSI architecture like peer to peer connection and encryption, will be the most effective way to onboard new users to the wallet effectively and with the most stickiness.  It will be interesting to see their ideas for the actual DID and VC management within a messaging environment, as I wouldn't describe any of the suggested formats' ability to manage things like files or documents as particularly engaging or robust.  This proposal brings home the reality of how close we are getting to having a community born and bred identity wallet.  If funded, we could be running the Beta for this by 4thQtr 2022.  Imagine the conversation around the dinner table at the holidays as you show the people you love what the future is going to look like, and how much better it can be.", "q0r": 5, "q1": "The piece of this proposal that really caught my eye was the close involvement of Butch Clark, the Technical Liaison for DISH, and the overall team lead for all DISH blockchain-related development.  You remember DISH, right?  The big partnership announced at the 2021 Cardano Summit?  This wallet looks to be the interface that we can expect for that implementation, which means that there shoud be some excellent energy around the team rolling this out.  RootsID works with both Atala and IOG, and now DISH, not to mention some of the most influential members of the SSI community, such as wallet OG and SSI godfather Darrel O'Donnell, whose Sovrin project contains abundant experential learning to benefit the RootsID community.  Between the plan for execution and the budget, it is easy enough to construct the timeline for the project, expected to deliver in 13 weeks (that's 60hrs a week, folks.  Woof.)  The team has enough developers working that this actually seems possible, and the budget takes this into account, with 2/3 of the funds reserved for the development sprints.  Between the excellent team and its supporters, both professionally and in the communities of SSI, Catalyst and Cardano, the real resources needed for the success of the project, feedback and engagement to get the UI/UX iterated properly, should be abundant.", "q1r": 5, "q2": "All of the RootsID project development phases include the same auditing architecture, as opensource projects with high levels of public oversight.  They assign tasks and manage workflow through Github and Jira, meaning you or I could provide feedback on commits.  While measuring of success for this project is closely integrated to success of other RootsWallets implementations (ie, delivery of the wallet in Beta), there will still be many opportunities to quantify progress towards this Ux:  sprint burndown will give us %complete for each development workflow, monthly progress reports will keep us up to date on where they are on the timeline.  On top of that, RootsID maintains an overall roadmap for the wallet as it moves to beta, and beyond, and is deeply interconnected to and in communication with the community.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2, "reply": "Yes!  Thank you so much for your thoughts and review!  We can't wait to get RootsWallet into the hands of the Cardano community :)\nWe have accounted for every hour across all of our proposals so I can assure you that even if all proposals are funded we will be able to work the hours.  For instance this proposal is budgeted for 336 hours over 13 weeks.  That is 26 hours per week.  We are actually already working that much time per week on the RootsWallet front-end (without full funding), so hopefully we get this funding so we can continue our awesome momentum :)"}, {"id": 8255, "q0": "Yes, this proposal effectively addresses the challenge. The proposal builds on previously funded efforts to develop the first open-source identity/credential wallet (RootsWallet) on Cardano, leveraging Atala Prism. The team has submitted numerous other proposals that work in tandem with what is being presented here. The purpose of this proposal is to build into the wallet a more user-friendly interface to facilitate social engagement with the application, similar to what is available on Discord or Slack. \n\nThe RootsWallet team shows a high level of success already through their project and the introduction of more user-friendly interfaces can work to advance the adoption and effectiveness of the application. By creating more direct social channels within the application, users will be able to engage in a conversational manner compared to one that is more static or unidirectional. This will likely be familiar to many users and can mitigate the immense learning curve. \n\nAnother reason how this UI improvement may drive impact is the by creating clear guidance for users with prompts for completing registration and verification activities. This is impactful as users will not be reliant on cumbersome instructions or lack thereof, but instead is intended to guide users in an intuitive and natural way, including through tips and hints, as well as prompts for how to send/receive credentials. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. As mentioned above, the team has already developed their application which will be launched in beta version over the course of Fund8. As there is already a user interface on the beta version, this project would seek to improve the experience for the user through implementing this new feature, which is highly feasible given what is presented. The team has demonstrated their skills and credentials that confirm they have the capacity to deliver.\n\nAnother strong indicator of feasibility for this project is its integration with leading digital identity entities such as Trust over IP foundation and the Digital Identity Foundation, and other projects within the community. This approach increases the feasibility due to the desire to align efforts and reduce duplication or redundancy of solutions. It also provides real work feedback loops into the process to show what is working and what isn't in real time, which can allow the team to test and implement solutions across a variety of use cases. \n\nLastly, the team is developing their chat and guidance functions in line with existing platforms in this space, such as Slack or Discord. The benefit of this is that they are not starting from scratch but instead have an extensive repository of solutions and improvements that have been made to those systems and can mimic the best components of these. By taking this approach, the app will not only feel familiar to users but can avoid obstacles that affect the user's experience, as seen through these different platforms. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The team commits to being open source by default which can give voters confidence that the team is open to scrutiny and feedback from the community. The use of github as a repository for their code not only provides voters with opportunities to scrutinize the team's activities, but allows the team to provide regular updates and progress reports, including issues, project views, and commits. \n\nThe strongest audit factor for this proposal is the collaboration with other projects who are seeking to incorporate credential wallets into their own applications and solutions. These groups are relying on the RootsWallet team to create a product that is easily integrated into a variety of different applications across a variety of different use cases. This direct feedback throughout the process provides the team with real-time information on what works and what doesn't. It will also allow the team to fine tune their solution to include appropriate and accessible language that appeals to the broadest audience possible. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Thank you so much for your thoughtful review! We really appreciate how supportive and encouraging the Catalyst community has been.  We can't wait to to provide this Social UX enhancement to breath life into all the feature that mobile users will have. "}, {"id": 7885, "q0": "The current wallets are all wallets without identity verification. Confidentiality is still guaranteed, but this will not be accepted by most governments and some agencies, companies, organizations.. that want to control the transaction volume or transparency of a person's assets. individual who owns the test electricity. Or also partially protect users in some cases. So this project developed RootsWallet. It is the first open source identity/information mobile wallet using Cardano's Atala Prism. If there is this wallet, many agencies will easily approve it, and it also opens the way to develop the application of electronic money in business, commerce, elections... that need KYC verification.", "q0r": 5, "q1": "They will implement a user-friendly interactive user interface such as a forum or a talk page; and build official information transmission channels of the project such as discord, slack, telegram..\nIf yes, can you add details about the goal of how many community members you will have to participate, for how long..\nAnd survey how many people benefit from your project.\nThe budget part is a bit high but I think well worth it if the project is serious.\nTechnical members who are bachelors and masters of computer science are also a prerequisite for the project's implementation.", "q1r": 5, "q2": "This platform with 3 main tasks:\nInteractive user guide, using Rootswallet app.\nBuild app store available on Rootswallet.\nUX/UI chat features.\nThey will apply Agile methodology (github) to evaluate and track project progress.\nCustomers/users can use Rootswallet to create a wallet, enter information to authenticate their identity, but all information is still confidential. This wallet can participate directly and pay, buy and sell.. in other platforms.\nBasically, I find it pretty easy to gauge project progress.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to review our proposal.  We will provide more details about impact in our future proposals :)\nIt will be very interesting to see who is interested in RootsWallet, beyond our grass roots partners.  As we gain momentum we will continue to evaluate how to help the Cardano/Catalyst community :)"}], "solution": "RootsWallet beta will enhance the UI/UX development from Fund7, providing Catalyst grass roots users an easier and more familiar social UX.", "experience": "RootsID is a group of Cardano/Prism/Identity specialists who are Atala Prism Astronauts and funded in Catalyst Fund7 to build RootsWallet: the first open source identity/credential mobile wallet using Cardano's Atala Prism for Catalyst grass roots proposals."}