{"id": 396670, "author": "aharon", "title": "DID for Democracy on the Blockchain", "url": "https://cardano.ideascale.com/a/dtd/396670-48088", "category": 26443, "amount": 12500, "description": "Coin voting is not democratic. DAOs need a wider range of decision making methods and influence power allocations, as quadratic voting etc.", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 607, "q0": "It can be difficult to quantify an anticipatory project like this.  Essentially, the proposers have a document editing program that allows everyone working on the document to comment and make suggestions, which is like \"voting\", and the protocols of the document (which I expect will be parameters that can be adjusted) ratify propositions of the document as they are discussed, essentially creating consensus around propositions, which then creates consensus around sections of the document, which eventually creates consensus on the document itself.  This proposal anticipates issues with a particular class of disagreement: malevolent actors who wish to undermine the protocols established for the consensus in order to get their way when they will be outvoted.  The proposal wishes to create an interface for the document (or its platform) where a DID with properties that match the protocol (for example, for a \"one person, one vote\" protocol, the DID would be proof that you could only vote once; for a \"weighted by reputation\" vote, you would have a DID that was proof of your reputation, etc) would be required to engage with the voting mechanism of the document, and partiipate in its ratification.  This all sounds great.  The issue with it being anticipatory is that this landscape (DIDs, VCs and SSI) is changing rapidly, and we might just be paying this team to wait for someone else to deliver their solution.  There is no way to measure the value of the team preparing themselves for the future (as commendable a goal as that is to have), or to grade the feasibility of a plan not presented.  To the degree that a plan is implemented under this proposal (and it might be), the opportunity to digitally verify ratification procedures for documents is a valuable resource for the community.  But I'm concerned with the value directed here that would be better allocated to the solutions that would actually be used to solve this issue.", "q0r": 4, "q1": "They indicate clearly that this is a research project with the goal of preparing the software to accept a solution, but the variance in the solutions possible makes this a questionable task, and a question of how that variability lends itself to a 36 week development cycle, with a budget for developer hours.  There could be a fully SSI compatible identity wallet with didcomm ability to integrate (which the proposer notes would be beyond the scope of this proposal) or on the far side of the spectrum there could be a Holder with an offchain DID who pastes the DID in the document to be verified manually by an editor with power to kick duplicates.  I would have liked to see an expression from this proposal about some of the fundamental architecture at play and what solutions that suggests.  For example, whether the solution is high tech (full SSI environment) or low tech (manual verification of offchain DIDs) you need to have an Issuer and that Issuer has to have certain characteristics.  Are they looking at any Issuers in particular?  The makeup of the team indicates they expect to partner with something like the CA DID initiative (if it is funded), and that has implications for what development would need to be done.  Basically, I would have liked to have seen anything that indicated what the plan was here, especially since they have devoted a sizable portion of the budget to implementing...something.  I can picture a lot of possible solutions, as I am sure they can.  But I think it matters which one it is, or is likely to be, in order to get funding to do it.", "q1r": 3, "q2": "Though I have doubts about whether this project can be successful, I am more confident that they will be able to effectively report progress, especially if a particular angle of approach is developed that can fit within this budget and timeline.  To that end, the more difficult portion of this process is that first step:  \"Create a plan for Atalla[sic] PRISM use as a base layer for DID on consenz platform - 8 weeks\".  This is really the whole proposal, right here.  This is a two month reporting window for establishing whether the project can move to the much easier to audit development cycle (assuming opensource here, not sure about that).  They have no KPIs listed for this phase, as the first KPI is for a login function for Consenz (and this is an issue:  a very real solution that is a possibility in the near future is something like the Pace Community Credential funded in funds 6 and 7, paired with the RootsID wallet which might be in Beta in 2022, and this solution would not function with any kind of login system...it would in fact be anathema to it.  The hard commit to this login as a budget item and a deliverable KPI is either a commitment to a particular path forward, or a lack of insight into  the possibilities).  They really need a measure of the first two months of the project.  Can I suggest that the proposer consider this to be a period for either developing partnerships that can stipulate what the design criteria need to be, or listing the documentation for the solution's buildout if done in house?  They will obviously have to do one or the other in order to file the first two progress reports.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 8256, "q0": "Yes, this proposal effectively addresses the challenge by exploring novel ways that DIDs can be integrated into decision making frameworks and processes beyond business or financial paradigms. This is an exciting proposal as it is somewhat niche when compared to others in this category. The team highlights the need for identity across a variety of activities where existing on-chain representations (one coin = one vote) are inadequate, such as DAO governance decision making. This focus sets the proposal apart from others within this same category but could have cascading effects into the business and financial structures of entities. \n\nThe tool that this will be integrated into (Consenz platform) will offer interesting use cases in collaboration and decision making. Existing platforms often present users with an overwhelming amount of information that is not easy to track and attach ideas or opinions to specific individuals or groups, they are also not conducive to proliferating ideas in a meaningful way. Their platform is designed to address such issues by creating clearly structured content that users can support/not-support, and using voting to reach a decision. The integration of identity into this platform would allow those individuals or groups who provide the most value to be recognized appropriately. \n\nIf successful, it is easy to see how the findings could be useful for broader Cardano processes, such as proposal submissions, CA reputation, and community DAOs facing governance issues. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. The team has completed the MVP of their Consenz platform which is a major component to this project being successful, and so voters can be confident that this additional component could be added. The platform has already shown its value by being used in real-world scenarios, such as the development of teaching guidelines in Israel in light of COVID-19, as well as by organizations working with governments to address climate-related issues, which are strong indicators of feasibility. \n\nAs outlined, the project plan is not supposed to start until the MVP is publicly launched but it is unclear when this is going to happen. Nonetheless, upon launch the team lays out a clear path for integrating Atala Prism into their solution. In total the team plans for the project to last 36 weeks to completion, with milestones at the 8, 16, 20, and 32 week intervals. By the end of the 36 weeks the community can expect the integration of DIDs into the decision making apparatus of Consenz. \n\nThe team's credentials support all the claims made throughout the proposal and give confidence in the their capacity to deliver. The materials provided on their previous works also give strong indication that it will be successful. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The team commits to making all documentation, data, and research available to the community to help refine and adopt to their specific needs. This final output will require the team to include the broader community in the solutions development, including the potential areas of focus. What can give voter's confidence is the commitment of the team to engage and collaborate with other groups working in this same space. This will reduce the likelihood of acting in silos and improve the overall product overall by acting as a challenge function to their approach.\n\nAnother audit strength is the high visibility of the team members within the Cardano ecosystem, and community members can easily identify these individuals and follow up with them directly. While not clear, it would be interesting to know if this project will be conducted via open-source tooling such as github.", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9876, "q0": "This proposal offers to develop an alternate method for decision-making in DAO than the usual 1 coin = 1 vote. As stated by this proposal, this usual voting method is derived from companies’ stakeholders’ decision, but blockchain offers the opportunity to explore other paths, like quadratic voting. As other methods imply to identify the voter, this projects wants to explore what Digital Identities ATALA PRISM can bring to Consenz : agreements building platform. As this proposal is based on this project funded in Fund 7  “consenz: agreements building platform”, a large part of the brief focusses on explaining what is this platform.\nThis project could be a useful proof of concept for the use of DIDs in a DAOs on Cardano.\nI strongly agree that this project effectively addresses the “accelerate decentralized identity” challenge.\n", "q0r": 5, "q1": "This project is led by a talented team that has already proven its ability to deliver a product. The project is well organized, with a 8-9 months’ timeline including intermediary milestones and a budget break down in 4 parts. \nWhy I cannot give a 5-star score for feasibility is that the risk analysis is lacking details, and the team recognizes that the complexity of this project is high. Partnering with a other teams and individuals from the community is a good mitigation axis, but without having this partnership concluded there is still a risk that this complexity could not be overcome.\n", "q1r": 4, "q2": "While Fund 7 funds are used to build a MVP of consenz platform, funds requested in this Fund 8 proposal are dedicated to research and design. The success is defined as a detailed plan and design ready for implementing diverse decision making and voting mechanism in the consenz platform.\nProgress monitoring offered for this research work is basically the deliverables themselves: DID login design, modules map, UX. This is good for auditability, but it could have been better : as this is a research work for 9 months, I recommend the proposer to commit on regular (monthly as a minimum) progress reports to enable a better monitoring of the progress by the community. Also co-design public sessions could be offered to the community.\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Develop infrastructure for Atala PRISM implementation on \"consenz: agreements building platform\" to practice on-chain democratic system", "experience": "10 years of working with governmental officials and municipalities to build and promote apps for public participation in decision making. Fund 7 funded proposer. A team that build prototype of the app proposed, Partnered with ADAGov - F4 (Completed) + Funded F5, F6 Proposals."}