{"id": 397146, "author": "mauryshenk", "title": "PeopleCert DevOps Pilot on Cardano", "url": "https://cardano.ideascale.com/a/dtd/397146-48088", "category": 26443, "amount": 46200, "description": "Cardano is seeking significant partners for Atala PRISM. PeopleCert is a leading global certification company without a blockchain solution.", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=5790"], "media": [], "f6_assessments": [{"id": 612, "q0": "In any implementation of SSI one hurdle that must often be overcome is the onboarding of Issuers to a platform or solution.  This is a fantastic instance of an Issuer coming into the space and asking for the tools to start creating secure, verifiable, privacy-protecting credentials.  That makes things a whole lot easier, partly because when an issuer comes into a space of its own accord, it usually already has its trust registry in place (sometimes implicit, sometimes explicit, but the pieces are almost always there).  This is important because a lot of time can be spent building out those trust registries in order to build *authenticity* into the credentials that eventually get issued.  With PeopleCert bringing its robust credentials marketplace into the ecosystem ($1million expected users in 2022) and partnering with Learnershape's Cardano integration protocols (under development and expanding in the current fund, if approved) along with the tooling of ProofSpace (no-code SSI SaaS tools, also iterating at a rapid rate and integrating Atala) this looks like a high impact pilot project.  Think of it this way, if a pilot project is looking to onboard a few thousand users, and the immediate market (let alone the wider market) needs 7 figures to be measured, this is a project that can make its mark on Cardano.", "q0r": 5, "q1": "We discussed the team a little bit, but what is clear is that they have partnered up exactly the right combination of skills to create this deliverable.  I particularly appreciate, given the teambuilding, how much space they are providing early in the timeline for everyone to get on the same page, with iterative collaborations to build modules, and then larger collaborations to start stitching the whole package together.  It looks really sharp and the vision here is readily apparent.  They list out a full 6 months of deliverables, but the real work here is the first five months, and they have laid out deliverables clearly, starting with what I would call analysis and design (but jumping into that API integration quickly!  this makes sense: they all have platforms already) and finishing up with onboarding their certification cohort.  I added up the budget and found myself surprised that it came in well under $50k: they have definitely trimmed all the fat.  None of the development amounts seem light, despite basically paying for 3 teams for 3-4 months...I think we are getting a lot of collab-work for free here.  They note a concern with marketing, but feel their connections with PeopleCert promise to promote the pilot adequately, frankly I don't think the pilot will be an issue and later marketing isn't our concern here.  Lastly they also note a concern with scalability... Proofspace has delivered at scale, and they are approaching this as a true SSI platform (based on their other work, it is not made explicit here) which has a built in scalability to it.  Again, I'm not to worried about this.", "q1r": 5, "q2": "They list their key metric as the onboarding of 1000s of certifications, which will be useful, no doubt, but which is a long-tail type metric that could take 12 months or more to realize.  The real success metric to measure for this proposal is to actually deliver the pilot and close out the funding.  Continuing to report to the Catalyst community is desirable and welcome, but this proposal is for a pilot that can be scaled and emulated with other partners that want to bring their Issuance capacity to Cardano.  The suggest they may present at Townhalls or breakout rooms as well (It would be good to see Proofspace in a general breakout room every so often, just because they have so much going on in the Cardano SSI space).  Overall, I would say the community should have no trouble keeping up with the crew, and I think the crew has plenty of milestones and deliverables to report progresson to keep the funding flowing.\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2, "reply": "Thank you for the positive review. On your comments about the budget, you are correct that we aimed to make this super-efficient. LearnerShape and ProofSpace are offering their services at cost, and PeopleCert will not be charging anything (they will get the benefit of the pilot, but will have to invest team time and third-party marketing expense in the pilot). "}, {"id": 252, "q0": "Managing certifications with DIDs is a key entry point for utilization for non-native blockchain users. PeopleCert has the domain experience to drive maximum impact from day 1 with their history in certification assessment & management. I would be interested to see how they plan for repeat usage and value from these certifications beyond the acquisition and occasional verification by an employer.", "q0r": 5, "q1": "With the multiple domain experienced stakeholders it seems that the certification workflow and verification process will be easily implemented. Furthermore a 6mo timeline allows for them to have the time to manage the large company decision making needs. Budget is reasonable for a small pilot.", "q1r": 5, "q2": "The proposers have outlined clear and measurable deliverables along the way, with success defined in alignment with the challenge scope. I believe this is a good example of followup work with the previously funded proposals.", "q2r": 5, "assessor": "z_assessor_1122", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "Thank you for the positive review. On your last comment about repeat value, this is quite important for us. Assuming this pilot is successful, we hope to expand the cooperation with PeopleCert to many more of their qualifications, which would provide an ongoing flow of certifications (on a commercial basis).\n\nWe hope that this model can be expanded to many other organizations and individuals with skills authentication requirements.\n\nWe are already in discussion with the IOG Atala PRISM team about cooperation on the PeopleCert pilot, and we hope to broaden this cooperation over time."}, {"id": 6717, "q0": "PeopleCert has acquired the business rights for ITIL certification and is considered a world leader in the certification space. It is a major opportunity for Cardano and a recognition to associate with Peoplecert for exploiting the Cardano blockchain for verifying DevOps certification issued in Atala as a pilot project. This is in great alignment with the challenge.", "q0r": 5, "q1": "PeopleCert is a world leader in certification and training. The associated entities are also large enough. They have established teams and proven credentials which gives tremendous confidence that the proposal will be carried out in the best possible manner.", "q1r": 5, "q2": "The proposal is for approx 47K USD. The proposal has a specific aim and has a well-defined output. The budget expenditure is also fairly explained. The proposal has the potential to revolutionise the certification verification pan world and can be a major adoptor of Cardano and Atala. the proposal is highly auditable.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "Thank you for the positive review, and for taking the time to research the background of PeopleCert's acquisition of ITIL. Assuming this pilot succeeds, we would expect to expand these services to other PeopleCert qualifications including ITIL."}, {"id": 7143, "q0": "The proposal aims to establish a systematic process of collaboration between PeopleCert, which is a certification company, issuing more than 1mil certificates during 2022, LearnerShape, and ProofSpace.\n\nThe idea is that PeopleCert will be providing marketing of certificates stored on the blockchain, whilst another partnership with LearnerShape will record these certificates on the blockchain, and the last part is ProofSpace organization, issuing AtalaPrism DIDs. \nMaking these three organizations cooperate, a more robust scheme will be built, with a large outreach speeding up the adaptation of DIDs, as well as Cardano blockchain. \n\nThis proposal aims primarily to make connections between these three entities such as workflow, system design, marketing strategies, which is a requirement for the whole process to be functional. \n\nThe idea itself is very attractive regarding the outreach and the future possibilities, and when adopted, even larger attraction can be expected. ", "q0r": 5, "q1": "The team is represented by key persons from each of the mentioned organizations, thus since the collaboration is already agreed upon, the uncertainty of \"to be established partnership\" is solved. \n\nLearnerShape and ProofSpace were already funded in the previous funds, and are delivering their products, thus increasing confidentiality, that they possess the required skill and experience. This fact is also induced by their working products and services. \n\nThe roadmap is set to \"high-level tasks\" and a more detailed roadmap for the next 6 months. Each month is having some subtasks to be met. The level of these tasks is sufficient.\n\nThe budget is also divided into sections and the respective organizations are outlined, providing more clarity on who will be funded for what task. In the proposal is also stated, that some costs will be covered by PeopleCert because the estimated budget will be higher. \n\nOverall the proposal is containing all the required and necessary details to assess the feasibility, which in this state looks very good. ", "q1r": 5, "q2": "The metrics to measure progress will be reported on a monthly basis in relation to the tasks outlined in the roadmap. The success will be measured by the number of Issued DIDs/certificates and the working mobile and web certification infrastructure. \nBoth of these are quite straightforward, so auditability is possible on a high level. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the positive review. We particularly appreciate that you have recognized the attraction of future possibilities. Assuming that this pilot succeeds, we would hope to expand to a much larger cooperation with PeopleCert, and to deliver the same or similar model to other organizations."}, {"id": 8258, "q0": "Yes, this proposal effectively addresses the challenge and the proposers are explicitly addressing \"rapid growth of Cardano\" and \"education and emergent reputation primitives\". This project has the potential for a major impact on the Cardano ecosystem given the well-established partnership with PeopleCert, \"one of the world’s leading testing and certification companies, focusing on business and language skills\". The fact that this partner is already a leader in DID certification, integrating Atala DIDs into their system would expose the technology to a broad set of international issuers and users. \n\nAnother strong impact indicator is the collaboration with groups in the DID space also working on Cardano, specifically the LearnerSpace and ProofSpace platforms that focus on educational and career certification. The partnership and integration of the solution across these entities will provide additional exposure for the solution by allowing users to port their DID across these applications. Assuming they are successful, the findings from this integration could likely be extrapolated to other such integrations from different groups working on similar issues. This will increase the amount of users which will end up stress-testing the solution's resiliency in a variety of different settings. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. The team does an excellent job at outlining their vision and the path to success. Not only do they provide a high level task list for completion, their roadmap is granular that voters can clearly see what is required at each step. This reduces the need for voters to fill in the blanks or interpret the intent. \n\nOver the next six months, these teams will work to integrate the solution across all three listed platforms. Their commitment to starting slow to design and implement the workflow will decrease the likelihood of errors reaching the final product, and will allow them to deliver the best version of the product possible.\n\nAnother strong indicator supporting the feasibility of this project is the in-kind resources provided by PeopleCert, who will not receive any of the Catalyst funding. As this entity is already well established, it is a good sign that they are willing to take on the integration of Atala at their own expense. This indicates, at least to me, that they are fully committed to the project and already believe it will be a success. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The team has a very strong grasp of their goal and how they plan to reach it, and by articulating it so clearly they have created numerous opportunities for auditing. A strong indicator for the auditing section is the necessary collaboration between the three entities included in this proposal. The requirements of each system  will force the team to continually examine their solution to ensure it fits within and across the three entities. This sort of built-in feedback mechanism will allow the team to iterative develop and refine the project to ensure it's meeting its goals. \n\nAt each stage of the plan, the proposers have also provided key deliverables that will be completed. The community can expect to engage the team during regular Catalyst update meetings and the final close out report. I would be interested to know what auditing processes the PeopleCert project has in place on it's own that will be leveraged for this project. However, given their commitment to see the project through without receiving funding, one can assume they will be scrutinizing all stages of the process. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the positive review. You are correct that we have taken great care to consider the interactions and integration of the teams of the three participants. And indeed PeopleCert are committed to the success of this proposal -- this pilot is the result of extended discussions about the potential of a blockchain solution for PeopleCert, and they are convinced that this presents significant opportunities for their business."}], "solution": "PeopleCert will pilot deployment of its DevOps certifications on Cardano, using technology developed in Catalyst Fund 6 and 7 projects.", "experience": "PeopleCert is fast-growing global certification company delivering >1M certifications in 2022. LearnerShape and ProofSpace have funded F6/F7 projects for complementary certification tech. Together the 3 companies have huge experience with certification / associated tech."}