{"id": 397135, "author": "henrik.metsamaki", "title": "Recruitment Utilizing Atala PRISM", "url": "https://cardano.ideascale.com/a/dtd/397135-48088", "category": 26443, "amount": 48500, "description": "Ethiopia is a rising star in blockchain in Africa but verifying competence in recruitment still labeled by lack of technology and corruption", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The team behind this proposal represents Fairway, a company in Ethiopia that offers recruitment services for businesses looking for employess, and they propose here to address issues of corruption, malinvestment and fraud for employers by adding the ability to Verify AtalaPRISM credentials of students' educational records.  On its own, this proposal is a necessary part of what Cardano wishes to accomplish with its Ethiopia program, as Verifiers make up a vital quarter of the \"trust diamond\" of decentralized identity.  By addressing this specific issue in this way, they will be delivering real value to employers, though when that value can be realized is unclear.  The businesses that Fairway services are typically looking for professional graduates, so the planned credentialing of HighSchool students in this first cohort for Atala is not really in their demographic.  Additionally, the PRISM rollout in Ethiopia is on its own timeline, so it is unclear when we will have even the highschool credentials.  Paradoxically, this actually could create an opportunity for this project.  Though the project in its current iteration does not look to be opensource (I could be wrong about that...I could find no repos for fairway or the developers listed here, but I did find some references to them being built from opensource code), they could develop this project as a general verifier protocol for the education DIDs, ready to implement whenever, wherever.  It is an easy enough pivot to make if necessary, and guarantees impact in Ethiopia as everything from tradeschools to universities will be wanting to verify those highschool credentials.  Meanwhile, the team could continue to develop their platform to interact with the DID data in meaningful and innovative ways, to make a great matching protocol that could be proprietary.  The best of both worlds.", "q0r": 4, "q1": "The team has a website, but no functional app yet, though they say it is ready and just needs Atala integration to finalize the Beta release, which is expected to begin in Q2 2022 and finish by Q4.  The budget is primarily the development work for the integration, with a little less than half dedicated to increasing the marketing team for establishing more relationships and getting the word out.  Despite the risk that this timeline is in large part determined by the rollout of Atala in Ethiopia, the team believes that they can build into the rollout, and be fully prepared for when it happens, and while they have indicated existing market connections for onboarding businesses who seek professionals, there is less indication that they have significant outreach yet for the jobs and opportunities more relevant to highschool credentials.  The assigned marketing budget should be enough to address those issues, and is in line with the rates they are paying the developers, so it seems to be a priority for them.", "q1r": 4, "q2": "The ability to audit this project will be challenging.  Without it being opensource there are no Github repos to post issues to or track commits on.  Their first deliverable is approximately 2 months out (rollout of the app without Atala integration), which means they will need to provide at least one month of progress on that development sprint.  It is recommended that they use a tool like Jira to track workflow for the progress reports.  But the real issue is going to be the 3-5 month space where Atala integration is being developed, and where we don't have a lot of insight into the process for the Ethiopian Ministry of Education (where there could potentially be significant setbacks if more political upheaval occurs).  I am not sure how they will be able to keep the project on track if the Atala program becomes a blocker during that period.  One mitigating factor would be to move marketing into that period, and start onboarding partners in the youth space, and conducting the highschool student outreach and research on the UX, at some risk if an Atala block changes anything about the protocol.  During this period, communication with the community will be critical, as significant tranches of funding could be delayed for the project over those months.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "I really thought this proposal was fantastic in terms of impact, it is fully aligned with the objectives of the challenge and I'm sure it will generate good results for Cardano. Proponents begin by contextualizing readers about the context, which takes place in Ethiopia, and the problem situation to be faced. Ethiopia is the pioneer location in relation to the adoption of the Cardano blockchain, as a large-scale project to implement the Atala Prism DIDs was developed there. By several educational institutions in the country, decentralized identities are being coined and are used to record the data of their students. This process, as we are told, is called “The Cardano Deal”. Theoretically, this sounds perfect, but proponents claim that there are still several difficulties to be mitigated. For example, not all families in the country have access to technology. Companies still have some difficulty in trusting such a technological identification process; often preferring manual, outdated and corruptible resources, unfortunately. The idea here so that this situation can begin to be resolved is to implement a system of integration of Atala Prism DIDs with the students' curriculum. In this way, the information would be completely reliable, non-corruptible and could be verified by the companies. The platform would be called Fairway, and would have as its main objective connecting “atala PRISM educational records and credentials to our recruitment platform and running a pilot to achieve the first proven recruitments carried out using these VCs in the Ethiopian market”. With this, “Ethiopian students who have educational records on Atala PRISM will be able to have their VCs verified on the Fairway platform and directly prove their educational records to recruiters using our platform as part of the recruitment process”. Summarizing what has been proposed, the group intends to evolve a project that has already been launched in Ethiopia, allowing companies and students to benefit; as well as, of course, the Cardano ecosystem, since the DIDs will have one more use, causing more students to be motivated to be part of the project, more institutions too, and companies to recognize more functionality provided by technologies of the Cardano ecosystem, which can generate a good image and greater adoption of our blockchain in the country. Therefore, I think that the impact here will be maximum, and this part of the proposal certainly deserves maximum marks. \n", "q0r": 5, "q1": "In terms of roadmap, first the activities are separated into some groups (called milestones), in these milestones are described very specifically what would need to happen for the project to come to fruition. In relation to temporality, just below the proponents provide a timeline, so that we can then have an idea of ​​how these activities would be organized in relation to the passage of months. However, this temporal organization is not as precise as I would like. In my opinion, the ideal would be for these two parts to be merged, so that a more practical roadmap would be provided to us. If the milestones were determined according to the passage of months, and it was detailed what would happen in each of them, I believe that our visualization of the process would be more logical and simple. So I think this part of the proposal is good, but it's not perfect because its overall visualization is still a bit confusing. Talking now about the budget explanation, I think this part is just satisfactory, we know how the total amount would be divided into parts and each of these parts is detailed in an average way. For example, in “50% of a Fairway sales team member for 3 months: 50% of 3 x 3800$ = 5700$”. We know what the Fairway team member's salary would be, but we don't know exactly how many hours per month he would spend on this project, so we can't conclude whether the hourly rate of work is fair or abusive. Under “Hire 2 additional sales and marketing reps for pilot which is 3 months = Hiring costs 2000$”, the same thing happens. How much time would these professionals dedicate to the project so that the value can be better analyzed? In “Additional pilot testing and running costs for the Fairway team: $3,000”, why would this step be necessary and why would it cost that amount? Regarding the team, this is definitely the best part of the feasibility, as we know a lot of details about all the members involved. Their names, we also have their resumes, with their specialties explained, which projects they have developed so far, how they relate to Cardano, their linkedin profiles; in short, everything necessary for a good trust to be passed in relation to them. Therefore, I consider this part to be perfect, with no improvements being necessary. In general, the proposal is viable, but some improvements could be made, as I mentioned throughout the analysis of this topic. \n", "q1r": 4, "q2": "Finally, when it comes to the auditability of the project, the proponents start by stating what should be expected as results over time (second quarter of the year, third quarter, etc.). They also attach some KPIs that are very relevant for us to understand if the project would be achieving the expected results, such as “number of checks done for proof of education credentials and number of hires made for people who have proof of education credentials”. However, I don't think this part of the proposal is that complete, because 1) the proposers are only concerned with reporting the partial results, and not with the oversight of the process that would be behind it. How could we monitor their work routines? 2) it is not so clear how these KPIs could be constantly checked by the Cardano community. What will be the platform that will bridge the gap between the project and the community? Would updates be posted on any website? Any social network? I think if these improvements had been made, the project would ideally be monitored against the process. Now, focusing on the final results, the recruitment by the companies with whom they had their DIDs attached to VC's would be the most objective way to perceive the success of the action. And the real success would be, as I understand it, when this type of recruitment is happening on a large scale, so that the full potential of the Atala Prism DIDs is utilized. Despite the proponents claiming that this data will be available in the first quarter of 2023, we don't know where. I think it is very important that they define the platform for communication with the community, both for the delivery of partial and final results. Another thing, I think we could pay a little more attention to the consequences of all this for Cardano in Ethiopia. Has this project captivated young students to research and study more about our blockchain technologies? Could it be that companies, realizing some solutions provided by Cardano, are interested in investing in our currency and adopting other technologies as well? I think that this study should be done and disseminated as well as the direct results of the project. I think the auditability is good, yes, it can be improved only in a few points. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "In order to exploit the school certification and other credentials in Blockchain to its fullest, there is a need to build addon applications to build upon the features. Recruitment of people based on the qualification certified using Cardano is the next best step and the proposal aim to precisely this. Therefore the proposal is in alignment with the challenge. ", "q0r": 5, "q1": "PRISM in Ethiopia and its implementation time frame is still not very clear. However, it may not be prudent to wait for the complete implementation of PRISM to start the work on the follow-up systems. The proposal is from an experienced team, and with support from IOG, which they had promised for all PRISM pioneers, it is possible that eh sam could be achieved. ", "q1r": 4, "q2": "The quantum of work required to complete the proposal is likely to be staggering and active support of IOG and others is likely to be required. With the amount of work expected, the fund required is very reasonable. The expected output of the proposal is straightforward and can easily be measured. Therefore the project is highly auditable, and the success can be measured. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "Yes this proposal effectively addresses the challenge by integrating DIDs as verifiable credentials into their Fairway job recruitment site, focused on Ethiopia. The team does an excellent job positioning their solution as a complementary component to the IOG Ethiopia deal: removing dependence on paper credentials that are susceptible to fraud and difficult to maintain. Currently, businesses looking to recruit new talent do not have the tools to do so in a simple and verifiable way, but instead are forced to rely on more traditional methods. The goal then is as IOG begins issuing all educational records for Ethiopian high school students, and potentially university students, these credentials could easily link to the Fairway platform, thereby improving recruitment processes. \n\nThis is an exciting real-world use case that could provide an excellent proof-of-concept for how DIDs can improve recruitment. It is likely that the results of this project, assuming they are successful, would also be easily extrapolated to other jurisdictions that face similar issues. Given the many functions that will come online with Atala Prism, this type of cross platform collaboration would provide users with a seamless information-sharing process, whereby students could submit their credentials that are immediately verified by the recruiter, saving time, effort, and overall costs for both parties. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. The platform which this solution will be integrated into is already complete, which gives significant weight to the feasibility of this project. This also means that the team is already well established and has an effective track record for bringing their solutions to fruition via Catalyst. \n\nAnother strong indicator of feasibility for this project is the direct connection with IOG leadership (John O'Connor and Dynal Patel) who encouraged them to submit the proposal based on their discussions. This implies that the team is on the right track and working towards objectives that align with the broader Cardano ecosystem. This is further bolstered by the credentials of each team member provided that show extensive capacity to undertake these efforts. \n\nThe timeline goes into the beginning of 2023 with the majority of the work completed with 2022, such as the development of the product and recruitment of participants. In 2023, the team plans to have the full project operational and the first students recruited through the platform. What challenges this feasibility timeline is the reliance on IOG to finalize the roll out of Atala and their \"Ethiopian deal\", however the team does acknowledge this delay. This is also not specific to this project alone but of the entire challenge. \n\nOverall, the team clearly articulates their plans, including the expected deliverables at each stage and the expected costs for completing the work. I appreciate the detailed budget and cost breakdown so voters can easily see, and follow, where and how the money is spent. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. As the main platform to be used is already built it is very simple for the community to check it out and ensure that it is actually functioning. The team also plans to have a working product by the end of 2022 so they can start recruiting students beginning in Q4. Throughout the development and implementation the team will engage users on their platform to better understand and test the functions being proposed. \n\nThe primary success indicator is whether or not this project is able to improve the recruitment processes for millions of students and employers in Ethiopia. While a lofty goal and potentially hard to measure, the team will track the number of verifications done and the number of hires due to the use of DIDs on their platform. I wish the team had of provided specific targets they wish to reach so we could better identify success when it's reached. How many verifications? How many hires?\n\nAs this is a resubmission of an earlier proposal it is clear the team took the feedback from the assessment stage and refined it to a much stronger level. I would like the team to identify how they could incorporate different types of feedback from the community throughout their efforts. However, this is a very strong proposal and deserves serious consideration from voters. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "With practical and engaging Fairway software, PRISM based educational Credentials are easily accessible for ordinary businesses in Ethiopia", "experience": "Fairway:\nIs established in Ethiopian market with good connections to local businesses, universities and governmentHas understanding and practical experience of modern hiring processes and methodsIs enrolled on PRISM Pioneer ProgramHas experience in SC's, Dapp's and NFT's"}