{"id": 397182, "author": "essbante", "title": "WAL-CLI Presentation Exchange", "url": "https://cardano.ideascale.com/a/dtd/397182-48088", "category": 26443, "amount": 20000, "description": "The Presentation Exchange protocol required to coordinate interaction between RootsWallet and WAL-CLI instances needs to be implemented.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7708, "q0": "The proposal identifies a problem within the challenge which needs to be solved, they actually identified a problem that: “needs to be covered before a DID ecosystem can be built”. While DID and Atala Prism is still relatively new and while I am not an expert in DID technology (but definitely interested in the model) the proposer clearly articulated why the proposed solution is important to be able to serve the challenge goals. It basically provides another fundamental technology that will help to develop the challenge objectives. While the proposer well explained the relationship between RootsWallet and WAL-CLI it could have been helpful to also include Atala Prism and a digram including the various solutions. Another way to explain it to nontech people (like myself) is through a simple use case. (I review the proposal as it is the last day and you have only three reviews - so giving my perspective, I am active with Catalyst for about 9 months now)\n\nWhat is missing for me is the long-term vision of the project and financing model. What will be the goals within 6 or 12 months and further? Would it be a service for the community or product/features that could be commercialized? How many applications will use the solution within x period? How it will be offered/ promoted? This is why I gave only 4 stars. \n", "q0r": 4, "q1": "While I am able to review the technology solution, based on my experience as CA & VCA since fund 6, I can evaluate the proposal based on the information provided. \n\nThe proposer provides evidence that he knows well the subject and provided information about his involvement with Catalyst as well as with Atala Prism as part of the first cohort of the Atala Prism Pioneer Program. The proposer provided LinkedIn of the two key members. The proposer already got two proposals funded in fund 7 and it could have been good to share some progress report if any as they are related proposals. The proposer knows, in an identifiable manner, the type and number of team members required to implement the proposal. The information provided in the proposals as well as the coordination with other related developers https://www.rootsid.com/rootsid , indicated good knowledge of the subject. \n\nThe budget is outlined clearly and broken down into identifiable items and seems reasonable to achieve the set goals and offers a realistic timetable to complete the work. The plan describes the resources necessary to implement the proposal. Again not being a tech person, I evaluate it based on the way the information is provided and not on a deep tech understanding. The proposer has considered challenges and risks relevant to a successful implementation.\n", "q1r": 5, "q2": "A roadmap with milestones and a time horizon for achievement is well presented. The deliverables are presented within the roadmap. It would have been good to have a separate section summarizing the deliverables. Also estimating some KPIs for usages would have been important to understand the scope and vision of the solution and how it will provide a solution that will be well distributed to be able to address the problem which is well defined. Overall the community will be able to audit the proposal through the Github links and open source approach of the prospers. A progress report on previously funded proposals could have been helpful here to reflect audiatability going forward (however taking into account that funds were provided less than one month ago). \n", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 613, "q0": "There may be some questions about the difference between this proposal and the other RootsWallet Presentation Exchange proposal.  That proposal was more focused on a verifier--holder relationship and of characterizing relationships, while this one is the secret sauce for the Issuer, which is the next step up from the root of trust for the platform.  As such, these protocols allow the Issuer to overlay a transport agnostic protocol for defining similar characteristics and requirements to to verifiers and holders, so Issuer--verifier/holder.  The issuer has more possible states, and interactions with it create a much larger state map to contend with, so this chunk of the SSI puzzle is larger and just as critical as the other.  Without these protocols, an Issuer loses the ability to present different requirements for the same credential exchange, which breaks true SSI which requires the ability to send a credential in multiple verifiable ways to the same party based on why they are asking for it.  These are the types of modules that take broad digital identity concepts and start to slice and dice it with enough complexity to allow for true self-sovereign identity, with its attendant privacy, security and functionality.", "q0r": 5, "q1": "The timeline and workflow were so well detailed that the protocol almost compiled while I was looking at it!  These timelines that RootsID has been including in their proposals really raise the bar for me when assessing other proposal's implementations of known protocols.  The team has already been working on the CLI for the Issuer wallet so this integration is not a new issue but one they have been preparing for.  The budget is for a full 3 months and is broken down into hourly rates for the different sprints, so it is easy to parse, with the hours lining up well with the tasks.  There are not really any issues that they should face in execution...they mention the standards can change, but these Presentation Exchange protocols are pretty solid, and the kinds of changes that can be expected (having protocol differentiate between null states, for example, \"server failure\", \"timeout\", \"cancel\", that kind of thing) shouldn't have any bearing on rolling out working code.", "q1r": 5, "q2": "Opensource means never having to say \"you're sorry but you can't find it\".  They have included links to the repo it will be tracked in, the workspace they will be using to assign tasks and built an announcements page for the repo to curate the commits for anyone following along.  Success on this one is easy to measure, full presentation exchange functionality in the Issuer RootsWallet.  All in a I don't think the community will have any issues staying on top of this.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2483, "q0": "The proposal has a clear focus on Decentralized Identity, but looks to fill a gap and meet a need that has been identified with PRISM, where issuer and holder tools are not yet available, this proposal is for a tool that helps to issue credentials, and supporting provision of an open source technology to build on, that will facilitate additional solutions in DID space. \n\nThe solution addresses the challenge by providing a pathway that allow for PRISM and Cardano to interact with ecosystems, and the more of this that can be done, the greater the ability for Cardano to increase its market share. \n\nThe project clearly outlines its roadmap and timeline, which seem reasonable, and the associated KPIs around research, design and implementation are relevant to the project and the challenge. ", "q0r": 4, "q1": "The proposing team is already working on funded DID projects and this project is looking to further develop these. It is clear from the information provided that the team has the necessary skills to deliver having experience as project architects, in the DID space, and having been on the Atala Prism Pioneer Program. \n\nThe plan is very detailed by week and with actionable tasks, and the project funding requested seems reasonable for the work that will be done, within the timeframe (330 hours for research, design, implementation, testing and documentation for just over $19k).\n\nThe resources and technical requirements are all made clear, and the team has also identified risks (standardization and time) which they aim to mitigate with interoperability and additional team resourcing", "q1r": 5, "q2": "The proposers offer a way for the community to keep track of progress via Github and give a detailed account of what they will be working on, and when. The roadmap and timeline is clear, even though there are no specific metrics (which is why the rating isn't as high as it could be), the intended outcome and what success looks like is clear. ", "q2r": 4, "assessor": "z_assessor_1511", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7144, "q0": "The proposal aims to expand the current version of RootsWallet (holder wallet) and Wal-CLI (institution/organization wallet) by the proof presentation and credential issuance between a WAL-CLI instance and RootsWallet,  which is understood as messages interchanged between wallets to perform an action, such as, requesting the issuance of a credential or requesting the presence of a credential.\n\nThe solution developed by the proposers is open source, thus they aim to affect everyone who will be interested in building DID projects using Atala Prism, therefore I am assessing the impact as high. There are no restrictions and the outreach is on a global scale. ", "q0r": 5, "q1": "Based on the fact, that the team already got funded and developed during F7. Also, a thorough description of team members is provided, with the relevant links, for verification. such as LinkedIn profiles, Github repo, working webpage, or a video. \n\nThe budget seems reasonably set and is based on an hourly calculation of tasks performed. \n\nThe time frame is set to three months, while works performed are mapped weekly. A better detail could have been provided by linking tasks with the person. \n\nBut overall, all required details are provided, and successful delivery is expected. ", "q1r": 5, "q2": "KPIs measured are clear and allow an easy audit - an open-source code enables to keep track of the project, and regular metrics such as a number of commits will display the progress of the proposal.  The proposers also commit themselves to publish the weekly reports. \n\nThe success of the proposal in a form of the completed and delivered product is definitely a relevant metric, yet, I think the adaptation and number of implementation would be nice to keep track of. \n\nNevertheless, the best way to track any project is an open-source code, which this proposal is having, thus the auditability of the proposal is high. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8259, "q0": "Yes, this proposal effectively addresses the challenge by expanding the use of DIDs to individuals through RootsWallet and for institutions through WAL-CLI. The proposal attempts to address the missing components that are necessary to fully realize a DID ecosystem, which their solution is designed to do. \n\nI think the proposers could have done a bit better of a job explaining the exact problem they are seeking to answer and how their solution fits. For example, they say that having WAL-CLI being compatible with RootsWallet will close the existing gaps but it is not clear why or how it will do this. I am left wondering what exactly are the gaps you are seeking to address? \n\nTo get full marks here, I would have liked to see the proposers explain the potential of extrapolating their findings to other groups working in a similar space. While I appreciate that this is challenge given the iterative space in which they are working, it is left to voters to assume that the outcome of this proposal would work across different wallets, not just RootsWallet. ", "q0r": 4, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. The proposers do an excellent job at providing a granular breakdown of each stage of their plan, including the deliverables and tasks. From the plan presented, it is clear that the proposers understand the problem in-depth. While there is still some education to be completed, their credentials indicate they are well-positioned to undertake this work and can begin immediately. \n\nI also appreciate that the proposers have directly aligned each of the stages in the plan to a budget item and explain in detail each of the components that will be covered. This showcases to voters the breadth of work to be undertaken and can give confidence that the proposers know each piece of the project that will be developed in order to move to the next stage, thereby increasing the overall feasibility score. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. I always welcome proposals that start open-source by default. This approach implies that the proposers are open to scrutiny and community feedback, which gives confidence that the project is auditable. The team commits to managing the project's development via github and weekly reports and progress announcements published and disseminated to the community. A bit more detail on the actual KPIs to be measured (# of commits; # of reports provided; # of projects using your findings) would provide more tangible for tracking the project's success. \n\nThe one measurement that is provided, \"delivering a complete, tested and documented open source solution that covers the functionality presented on this proposal\" is quite easy to track and will be a yes/no answer, which is simple for the community to measure. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Expand WAL-CLI implementation to include the protocols required for credential presentation and verification between WAL-CLI and RootsWallet", "experience": "The team is fully engaged on Decentralized Identity projects in the Cardano community with projects already funded and delivered on F7. They've delivered WAL-CLI and are currently working on development of RootsWallet."}