{"id": 397648, "author": "altimario", "title": "Lifelong Learning certif+AtalaPRISM", "url": "https://cardano.ideascale.com/a/dtd/397648-48088", "category": 26443, "amount": 20000, "description": "A certification is a snapshot of your knowledge at a certain time. This old snapshot doesn't say anything about your current competencies.", "f6_no_assessments": 7, "f6_rating": 3.857142857142857, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, this proposal effectively addresses the challenge by using DIDs to track the course of learning for an individual throughout their lives, and beyond the limited formalized methods we see today. The team wants to provide users a tool that can not only hold and store their educational attainments but that can be updated easily and consistently so that their information is always accurate. This is an exciting objective as learning does not stop once an individual leaves the institution. \n\nAnother exciting component of this proposal with massive potential impact is the support that it could provide to self-directed learners. With the internet there is a seemingly limitless supply of free ways to obtain knowledge, however, individuals who undertake these self-directed learning often are not rewarded with certification of completion. This solution could resolve that. Say, MIT puts a course online and a user completes each of the modules and passes all of the exams, would their education not be valid since they didn't go to the school itself? What if they could prove that they completed the course? This type of new case study is extremely exciting. Although the team does highlight their solution as a way to mimic and follow academic and scientific leaders, it is easy to imagine other potential use cases that could make this project even more impactful. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely this proposal will be implemented successfully. Over a four month timeframe, voters can expect the team to deliver their web and mobile interface for their credential tracker and integrate it with a learning management system. The roadmap provides clear milestones and deliverables at each stage and will be done concurrently by three developers, two of which are explicitly named in the proposal. However, the team still requires some education on the Atala Prism operation and functionality which could threaten the feasibility of this project. \n\nAnother issue affecting the project's feasibility is the team's capacity to onboard new team members within the budget requested. The team is explicit about this challenge but I wish they have of included the amount required to pay the going rate for this type of expertise. The idea is really strong and the focus should be on making the project as effective as possible, even if this means paying market-rate for the necessary developers. I worry that by taking this approach that the team may not attract the necessary talent to complete the work. \n\nNonetheless, should the team be able to meet the timeline and deliverables stated within the proposal it is likely to be implemented successfully. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The team is building this project open source by design, which should be a strong indicator to voters that they are open for auditing and external scrutiny. The commitment to using github strengthens their plan and allows for easy tracking at both the project and ecosystem level. To reach the common user, the team will also develop their website to present all information, including progress and success. \n\nBy the end of the project it will be deemed a success if the team has integrated their solution with one learning management system. While I do think that they could have listed some potential partners here, it is not enough to reduce the score. I look forward to what the team will deliver! ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "I cannot complain about such a nice review, but I just want to clarify the feasibility issue.\nI could understand the other way around, a too high cost for the value promised. In this case, the salary can be considered \"low\" in general, but the people who decided to cut their salary, decided also to prioritize something that is more important than personal remuneration, this proposal truly fit a few Sustainable Development Goals (SDG) extremely valuable for the society in developing countries. We thought that a reasonable lower budget required could have been more appealing for voters. \n\nI hope the vCA can take into account this good faith, adding the missing star."}, {"q0": "The proposal tries to create a platform that shows the learning journey of scientists, academics that people can follow and emulate using Atala PRISM. I found the idea very interesting and can add value to the Cardano ecosystem. The proposal has provides a clear plan of how they implement the ideas. The proposal gives information on the challenge that they face, that is the difficulty of finding a Plutus/Haskell developer and uncertainty about how Atala PRISM works, however, with the experience and the thorough plan they have the team has the abilities to sort out those challenges.", "q0r": 5, "q1": "The proposal has clear 4 milestones with a roadmap on a specific time horizon, totaling in 4 months. The team provides budget information and a breakdown of how they will use the proposed budget, but some items need to be elaborate more, for example, the proposal only stated 2.5K$ used to paid developer/month (a very reasonable rate), is there not need any server cost to host the website? or to buy a domain name? I have a concern the project may have additional cost other than remuneration to the developers that have not written on the proposal. The proposal gives detailed information on the background, relevant skills, and experience of each team member, even a link to the publications they have, they also provide a LinkedIn profile and personal GitHub account.", "q1r": 5, "q2": "The project is fully open-source and provides a GitHub repository so it will be easy for the community to track the project's progress, furthermore, the proposal will also have a website containing information about the progress and the status of the development. The proposal provides indicators of success that are a usable version of the project, however, it can be elaborated in more detail, for example, how many daily active users to be considered a success? or how many API queries are requested per day to be considered a success? As a community tool, it's important not only the tool is working but the community uses it.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "What a shame, a potential full 5 stars rating ruined by incomplete reading. I clearly wrote in the auditability section this question \"What does success for this project look like?\" and the answer is \"Release of a usable version able to show a learning journey from a couple of different online e-learning courses but only one LMS.\"  I cannot use as a successful parameter something related to (for example) a marketing campaign proposal (like increase by X the active users or registered) because this is a software development proposal. The goal is about what you build and not increase/define user traction.\n\nI hope the vCA can take into account this CA missed section to properly add the missing star."}, {"q0": "The world has become a very different kind of place, where lifelong learning is no longer just a fanciful idea but a requirement for survival. An individual can hold multiple simultaneous professional roles and they can take on many different careers throughout their lives. The old structures don’t support this new reality. In this proposal we can see one of the best ways to frame a problem — “A certification is a snapshot of your knowledge at a certain time. This old snapshot doesn't say anything about your current competencies.” — and a related solution: “Atala PRISM can certify Lifelong Learning by tracking granular exposition to any learning material.” Just by reading that, I was sold to the impact of this proposal. Yet, it doesn’t stop there. This proposal not only lists the financial impact but it also nicely connects to the UN social development goals. The Atala PRISM based “proof of learning” solution can be updated over time. It can synthesize courses from different institutions and learning platforms. And it can be shared and trusted. It all sounds great but is this proposal too good to be true? Perhaps it is.", "q0r": 4, "q1": "After a promising start, it turns out that there are no developers in the team to make it happen and no understanding of how Atala PRISM functions. It’s a bit worrying that they recognize it’s hard to find Haskell / Plutus developers but they have only budgeted a monthly salary of $2,500 each. Nonetheless, the team is willing to learn and they are already familiar with functional programming (Clojure). Mario’s proposal of a universal e-learning connector was funded in Fund7 (https://cardano.ideascale.com/c/idea/382026) and this proposed solution is designed to work in conjunction with that.", "q1r": 2, "q2": "Unfortunately the plan is not very clear yet. It would be better to come back to Fund9 with a full team and a plan that extends beyond mere website. If the proposal gets funded, the developers are found and the project gets off the ground, the development will be tracked via Github commits, pull requests, and bug tracking.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to leverage on Atala PRISM to deliver the Lifelong Learning Program to certify the journey of skills acquisition, instead of taking a snapshot of a knowledge, as all the certifications do today. \nSo the proposal addresses the challenge as it associates a decentralized identity to an another set of metadata associate with a certified set of skills, where the certification is accredited worldwide.\nMoreover the learners will micro-pay for their learning experience, so information will be accessible worldwide equally, and the learners will also get paid whenever someone wants to see their learning history.", "q0r": 5, "q1": "The idea is great, although the team has zero knowledge about atala prism, and is currently seeking for two Plutus experts.\nAlthough Mario and Alfredo, the two main members are well experienced in the deep learning, cybernetics, cryptography and IT, the lack of Plutus developers is worrying. ", "q1r": 2, "q2": "The team provides a poor budget breakdown, listing the need for 20 thousand dollars distributed over a period of four months, to cover developing costs and a tester.\nSome of the key milestone are listed like for example reaching a setup of an API connected to a Learning management system, there is also the intention of communicate progress by keeping the code on on open GitHub repo, but still there is lack of expertise in the team and I am not sure about the modality of communication of the new hired developers.", "q2r": 3, "assessor": "z_assessor_530", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "As an ATALA Prism 1st cohort pioneer and an educator myself, I do agree that this proposal aligns well with the Challenge objectives, specially in the \"Education, Career, and Emergent Reputation Primitives\" goal and the following patterns: Establishing Individual Reputation, Community as a whole group Interaction with an external party, Community member as an individual interaction with an external party and Community medium of exchange.\nThe proposers aim to provide a platform that provides digital proof of lifelong learning, by integrating the previously F7 funded Proof of Life Learning (PoLiL) app with ATALA Prism. ", "q0r": 4, "q1": "Even though the PoLiL app was funded in F7, and has a timeline of 3 months, there is no mention or link provided to understand the progress and status of that app, and as it is the base for this proposal, I found that a critical piece of information to be able to properly assess this proposal. The team seems to be knowledgeable enough with the proper experience to lead the project, though the developers and QA are going to be hired, and as the proposer clearly state that is a RISK, because of the difficulties to found and hire developers, a mitigation was provided, to hire less senior developers and train them, but that  could produce some impact on the project timeline and objectives. The timeline provided and its milestones doesn't seem to be feasible, as integrating the app with ATALA Prism framework, could fairly take more than the allotted time, specially if the professionals that will do it are yet to be hired. The requested budget is in line with a fair market rate of US2500 per month per developer, but its breakdown is general, as it is the milestones provided, so it is quite difficult to be able to assess the proposal with just that information. I suggest to the proposers to first, provide the community with an understanding on the status of the PoLiL app and timeline to be delivered, so this \"continuation\"phase to integrate it to ATALA Prism can be better understood and supported. Also to add a more detailed timeline and milestones, with further research on the complexities of the Self Sovereign Identity framework and the ATALA Prism platform complexities. If the proposal gets voted, those informations will help a lot to manage the project and also to be able to report progress to the community as required for a funded proposal.", "q1r": 3, "q2": "There are no KPIs provided within the proposal, but a promise of  \".. create a website containing information about the progress and the status of the development\" and \"an open-source solution, which means the audibility is guaranteed by definition through github commits, pull requests, bug tracking.\" Which on their own are not formal indicators for the community to be able to properly audit this proposal. So I recommend to the proposers, to start developing those KPIs, both for project progress auditing and also to measure and demonstrate outcomes (Return of Intention), so the project can formally demonstrate the impact it brings to the Cardano ecosystem. The project seems promising, but it will be a complex one, so it is of outmost importance to be able to properly manage its progress and future outcomes.", "q2r": 3, "assessor": "z_assessor_288", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is great and corresponds very well to the specific objectives of this challenge; as the proponent himself states, from the work developed here, better inclusive education would be guaranteed, opportunities for jobs and entrepreneurship would be increased. The idea is that students can make small advances in their professional and educational training processes in their Atala Prism DIDs, from what I understand. The contextualized problem is that current certifications are totally focused on the result of a certain achievement and do not take into account all the steps taken until that point is reached. So the solution is to keep the entire learning journey up to date on Atala Prism. This initiative would be free and carried out by the students themselves. I think that in order for us to understand well how this would work, it would be interesting for the proponent to explain how the update process would be, done by end users. However, it is an excellent and extremely relevant initiative that can attract new users to Cardano.", "q0r": 5, "q1": "The script provided is very shallow. We know what was going to happen very superficially. My suggestion is for the proponent to go further into explaining each of the activities - we know what would happen and when, but not how. This detailing would certainly increase the level of quality of the explanation of the process. Talking about the budget, I found that the amount requested (20 thousand dollars) is quite compatible with the complexity of the proposal. The money would be used for developer salaries. However, I think we would need to know more about their work routines, including whether they would be working part-time or full-time on the project (so we would know the value of their work hour). I'm doubtful about not having a designer and publicist involved here. In my opinion, these professionals would be as important as the developers - as they would work on the ergonomic interface and project dissemination. The duo of professionals involved is very well presented. We have their linkedin profiles and long explanations of their CVs. But it would be better if the whole team was already defined (this would convey more security in the whole).", "q1r": 3, "q2": "Auditability is the weakest part of the proposal, unfortunately. About the process, it is said that it can be followed through platforms such as github, pull requests and bug tracking. It is also said that a website would be created for updates on the development process. But everything is still pretty abstract. What would be posted on the site? How often? How would the Cardano community be aware of this news? I think the information was only half given, unfortunately. Proponents seem aware of the need to keep the community up-to-date but don't explain well how this process would be. Talking about the ultimate success, I thought they focused only on the project, and didn't mention how the consequences for Cardano would be measured. Really, in my perception, we need to have quantitative and qualitative data to analyze the impacts of all this on our blockchain, and that was left aside here. For these reasons, I consider that auditability is inadequate and deserves a good review.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal clearly explains the goals of the project and the rationale for a different way of thinking about the organic presentation of modern-day learning and to leverage ATALA Prism to met their goals aligns this proposal to the challenge's goals. This proposal reads very realistically particularly in its honest description of the risks and how they will mitigate these. As a former assessor of projects for a university, these two novel ways of thinking about a project are normally recipes for success. I do hope that the ATALA Prism SDK once released will enable the kind of updatable credential system they are aiming for.", "q0r": 5, "q1": "The background of the proposer is in line with the specifics of this project and includes links to bona fides in linkedin. The fact they were funded in Fund7 indicates strong chances for success in this proposal as well and hence I strongly agree its highly feasible. The plan presented looks logical including their stated goal of securing the expertise they require to develop the solution. If they go with acquiring a senior developer who could quickly adopt the required language skills then this project may well self-qualify as the first template for their updatable credential system. ", "q1r": 5, "q2": "The proposer has not presented a github on these pages but have however stated their solution will be open source and a future repo will be communicated for people to audit the code. They also intend to create a website to inform of the progress and the state of each phase. I highly agree this project is auditable and given the qualifications of the proposer, this aspect of funding submissions is fairly familiar and will be abided by. Good luck. ", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Atala PRISM can certify Lifelong Learning by tracking granular exposition to any learning material.\n\nThe journey not the arrival matters!", "experience": "40+ years in IT industry which includes:\nSoftware consulting for large enterprises and governments (Italy and UK)Tech-StartupAI & Machine LearningOpen-source contributionEdTechResearchScientific publicationsInternational patents\nA proposal funded on Fund 7"}