{"id": 398408, "author": "elementarysoftware", "title": "Visual DID & Credential Builder", "url": "https://cardano.ideascale.com/a/dtd/398408-48088", "category": 26443, "amount": 25000, "description": "We need intuitive no-code tools to ensure adoption of decentralised digital identities (DIDs)", "funded": 2, "upvotes": 125276050, "downvotes": 981839, "votes_result": 124294211, "votes_cast": 355, "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 645, "q0": "Compared to some of the robust full SSI platforms, and deep, integrated DID/VC platforms that you will see in this challenge and in the SSI challenge, this proposal comes across as a lean, mean DIDmaking machine.  It is sort of like a \"casual DID\" program, and I like it.  This won't be the kind of DID platform that you might use to do your banking or vote in a public election.  Rather this looks to be accommodating people who have an idea for how they might use a DID to create a members only working group, or to mark graduates of a private class, or to organize a charity event.  While it will use the did:prism method, which means encryption and security, there won't be a lot of the deep SSI features like DIDComm messaging or selective data release (at least in this version...it won't be incompatible with such things down the road), but in my book that can be a good thing.  This is meant to be simple, intuitive, comfortable, so that someone can sit down and be issuing credentials for their book club rewards program within minutes.  The proposer is also seeking funds for another proposal that will allow them to build out an opensource template library for credentials that are W3C compliant, meaning that book club rewards program is either already available, or easily created and added by the community.  If I have a concern it is about general SSI compliance, but from this and the other proposal I have concluded that this proposer is an advocate of SSI principles as well, even if this tool doesn't seek to be a full feature SSI platform.", "q0r": 5, "q1": "The budget and timeline line up well, but I have a question about the technology stack.  I appreciate the proposer's reasons for building out the desktop app first, and for avoiding a web-based app (which would introduce a 3rd party middleman into the process, which is decidedly anti-SSI).  But I don't think this project reaches the finish line without a mobile app.  I think the proposer is aware of this, and wants to keep the development schedule tight and the budget reasonable, but I expect he will be back eventually in order to get the funding to flesh out the full functionality he envisions here.  The reason being, those holders are going to want and need a PRISM wallet from the start, preferably with a little functionality for viewing, scanning and organizing their credentials.  As well, the Verifier is rarely going to be sitting at a computer.  They are going to be at the door of the nightclub, or behind the bar, or at the library, or in the grocery store, and they are going to want to be able to scan as well.  (note that the peer to peer DIDComm woud be a nice add at this point :))  This isn't a major reason to mark down the proposer in my eyes, because Atala will still be testnet only (the proposer is well aware of this) by the time the desktop app is ready, so users can experiment with it and give it a healthy workout, and then while we are waiting for mainnet for Atala, the proposer gets another round of funding to get the mobile apps running.  They won't need to be robust...simple, intuitive, fun, with the desktop as the main way to issue credentials to start with.", "q1r": 5, "q2": "The roadmap is clear and the development sprints are mapped out well.  Because it is no-code, there is the issue of whether it wil be proprietary or opensource, which I was not clear about on this proposal.  Their other proposal is clearly opensource, and it is meant to mesh with this one, but usually there are clues in the provided KPIs (commits, issues, etc) that indicate whether a project is opensource.  Those clues aren't present here, so I will guess and say it is not opensource.  With that in mind, it does introduce some challenges to community oversight and progress reporting.  The proposer does include good KPIs for their reports to IOG, and the deliverables and sprints are made clear in the roadmap, as noted, so it should definitely line up well for the monthly reports.  I don't anticipate that there will be any problems with the ability of this project to report progress on the milestones listed.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 10, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Thank you for your comments! I laughed when you called it a \"lean, mean DIDmaking machine\" :D This is just what I want this to be. You understand this will be a first version with just the required functionality for being operational. This is correct, but the plan is actually to make it into more that just a proof of consept. Extensions will come later to introduce DIDCom and credential sharing."}, {"id": 141, "q0": "Proposal fits nicely into the challenge. Easy to use, graphical tools like this would have great impact for the community if voted. Clear and inspirational introduction setting the scene and describing the terms nicely. Great articulation about how the tool will benefit non-coders with example personas for how the tool can be used. Key metrics and goals align with challenge.", "q0r": 5, "q1": "Reference links provided and shows relevant skills and experience. Budget is reasonable and is broken down into identifiable items. Realistic time table. Proposal contains a graphic picture of what to expect from the proposal delivery. Proposal has clearly and defined scope.", "q1r": 5, "q2": "Clear description of targeted problem and how the solution address it. Nice illustration showing overview of how the tool will be. Really like how the proposal describes the though process behind design choices and what will be delivered on what technology. Roadmap shows how this proposal fits into the big picture and what to expect with this release and future.", "q2r": 5, "assessor": "z_assessor_1075", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1, "reply": "Thank you for your comments and thank you for the support"}, {"id": 7148, "q0": "The proposers are identifying the problem of the Atala Prism in the fact, that it is currently used only by IT people with coding knowledge. \nThe proposal aims to deliver a builder that will be used by everyone - intuitive, no coding knowledge required. \nIf such a builder is developed, I believe that both Atala Prism and therefore Cardano exposure would increase resulting in larger adaption. ", "q0r": 5, "q1": "With the experience and the plan presented it seems likely that it will be delivered successfully. There is only one team member, which poses the question of whether this is a one-man job. Even though the application seems to have only the basic functions, and the time frame is set to one year, it would be beneficial to see the \"similar project\" reference and details, that the proposer claims to have, in order to verify it. \n\nLinked in profile is posted, which is increasing the confidence in the proposer, the budget requested seems reasonable for 6 months aswell.\n\nWhat I am missing is that budget could have been divided in more detail and assigned to each section. Since the budget is requested for 6 months, months 3-6 are lacking detail of tasks or possible subtasks to be done + assigned amounts. Also, milestones 1-3: the stated plans could have been assigned a closer time frame. If milestone 1 = 1st month, and it is divided into subtasks, an estimate of these subtasks could have been stated. \n\n\n\n\n\n", "q1r": 4, "q2": "The KPIs stated would require a slight modification - is there a BIG difference between DIDs created and Credentials issued? I find them similar, if not the same - both monitoring the number of DIDs. \n\nPossibly, cooperation with other entities or use by non-individuals could be monitored aswell. \n\nAnd the last modification - periodic progress reports sent - is it once per month? twice per month? once per week? Needs to be specified closer aswell. \n\nThe success will be monitored by its adaptation in the real-life - and by the working product? :) \n\nDespite these small drawbacks, that are not mentioned or are lacking a specification, I am keeping the score in full, because both progress and success can be audited. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thanks for the comments and suggesting additional KPIs. The comment will be used for modifying and enhancing the reporting back to the community"}, {"id": 8266, "q0": "Yes, this proposal effectively addresses the challenge. The team is planning to develop a no-code DID issuer and verifier application for desktop. Such an application has the potential for creating a major impact in Cardano as it will remove the need for technical expertise to issue and verify DIDs. I agree with the proposers that this is the main challenge to adoption, when it's too hard for people to understand or the skill set is too high for most people to reach. By improving accessibility to DIDs via this application, there are likely many more use cases and users who could benefit. \n\nAnother strength of this proposal that will increase it's impact is the availability of the app on Windows, Linux, and Mac. The inclusion across all three of these different operating systems will expand Cardano's reach beyond its own ecosystem, and instead will integrate Cardano into these broader and more entrenched systems, allowing users across all three to benefit from Atala DIDs. This level of interoperability will likely pay dividends if successful. ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. This project will be rolled out over the next twelve months with the majority of the work happening in the first three months while developing the app, with launch planned for October 2022. The roadmap not only lays out key milestones but includes granular tasks to confirm at each stage. This provides voters with a clear path to completion and success. The team also includes their forward looking agenda to improve and refine the application as more specs and improvements of Atala come online. \n\nThe team will also ensure that their solution meets all the requirements for Atala functionality but as a member of the first Prism Pioneers cohort, this is likely already within the skillset of the proposer. They also commit to documenting all development components and will use existing community venues to share and receive feedback on their work. Based on the experience presented by the proposer and their already built connections within the community, there is a high likelihood of being implemented successfully. \n\nLastly, the budget is more than reasonable for the potential return of this project. For a price tag of $25k there is a massive upside to this proposal. The inclusion of a mock-up of what the interface could look like highlights the proposer's deep understanding of their solution and keeps the end user in mind. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The proposer does an excellent job taking the guess-work out of auditability by clearly articulating their success measurement (use by everyday people) and provide a suite of KPIs to measure it. Providing tangible and measurable indicators allows the community to know exactly how well the project is doing and whether it is reaching the goal it set out to reach. \n\nAs highlighted in the feasibility section, the proposer also commits themself to providing the community with various opportunities to engage with the project and provide feedback. This type of exposure may give confidence to voters that they will be able to follow up on this project, should the be wanting to provide feedback or participate in the development. \n\nLastly, the evergreen nature of this proposal will require ongoing auditability as changes to the Atala system come online. As its specs and functionality changes, these will be integrated into the application, implying that updates will occur on a regular basis (as needed) and will reflect the latest developments of Atala. This will safeguard against the solution becoming ossified or outdated. \n\nExcellent work. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you for your comments and thank you for the support"}], "solution": "Desktop application enabling non-developers to create and issue (send) credentials to DID contacts with intuitive graphical user interface", "experience": "Atala PRISM pioneer first cohort, background from defence and maritime technology industry with in-depth knowledge about secure handling of personal information. About 20 years experience as application architect, developer and consultant."}