{"id": 398764, "author": "rodolfo.miranda", "title": "Universal Resolver for did:prism", "url": "https://cardano.ideascale.com/a/dtd/398764-48088", "category": 26443, "amount": 6425, "description": "There are no drivers available to resolve Prism DID methods for the popular Universal Resolver of the Decentralized Identity Foundation", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 8268, "q0": "Ye, this proposal effectively addresses the challenge and by focusing on increasing the interoperability of Cardano DIDs by integrating Atala DIDs into the Universal Resolver. From the Decentralized Identity Foundation, \"The Universal Resolver resolves Decentralized Identifiers (DIDs) documents across many different DID methods, based on the W3C DID Core 1.0 and DID Resolution specifications.\" Currently, no driver exists for Atala, so this project seeks to change that. \n\nGiven the central role of identity in many transactions that occur across the internet, the integration of this driver in the Universal Resolver will make Cardano DIDs easier to integrate in these transactions. In order to accelerate adoption of Cardano DIDs, solutions need to appeal to a broad audience of developers and users, by integrating Cardano within existing tooling and libraries these solutions can be used across a variety of use cases. This is likely to have a major impact given the heavy reliance on the Universal Revolver as the de facto method for platforms resolving DIDs. ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. The proposer has already built a similar driver to the one being proposed which gave them insight into the requirements for this project. The benefit of this is that the proposer is able to clearly articulate the specific components and steps to be resolved. It is obvious that this knowledge is within the bailiwick of the proposer. \n\nAnother strength of this proposal is that it only last four weeks and from what is presented, this seems completely reasonable. The proposer's experience as member of the first cohort of Atala Prism Pioneers also adds weight to the feasibility given their pre-existing knowledge of the Atala system, including it's requirements and technical specifications. This also provided the proposer with a broad network of peers who will be able to help with bringing this project to fruition. Moreover, the link of funded proposals that the proposer is also a part of shows their commitment to realizing DIDs on Cardano. \n\nFor a price tag of only ~$6500, the potential upside of this project is huge particularly as it seems so easy, at least as presented. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. The proposer clearly grasps the necessary requirements to complete the task and provides voters with a very simple and easy-to-follow plan. The project will be open source by default as it will build on the Universal Resolver Driver, which is also an open source initiative. This means that all documentation and coding will remain open source and can be fine tuned as needed by the broader development community, giving strength to it's auditability. \n\nThe proposer also commits to providing the community regular updates through github issues, project views, and commits. Given the open-source nature of github, this is another way the community can audit the proposal. With only a four week window to completion, this project also will be very easy to audit by seeing whether the universal resolver for the Atala DID is complete. \n\nExcellent work. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 144, "q0": "The proposal fits nicely into the challenge as it will give publicity for and access to PRISM on the Universal Resolver site together with all of the other DID drivers of other blockchains.", "q0r": 5, "q1": "The proposer has developed similar functionality in the past and will only need to port this. Reference links provided and shows relevant skills. Budget is reasonable and broken down into identifiable items. Realistic time table, although no date for delivery is provided. Proposal has clear and defined scope. Relevant risks are identified and have reasonable mitigations.", "q1r": 5, "q2": "The proposal provides clear insights into how the progress and success can be audited by the community. Proposal also contains good reasons for why it should be funded and what the benefits are for the ecosystem.", "q2r": 5, "assessor": "z_assessor_1075", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"id": 534, "q0": "The proposer and the team around RootsWallet is heavily already heavily involved in the Cardano-Ecosystem around Atala PRISM. With their research and growing understanding of the topic around SSI they identified, a small, but very helpful component to integrate PRISM into already existing SSI solutions outside of Cardano. The direct and short-term impact is likely not very high, but it is a long term it is a simple but important building block. Definitely a must have.", "q0r": 5, "q1": "The proposer has already experience in developing a comparable solution and is deeply involved in the SSI-Topic. The expected timeline seems realistic, maybe even pessimistic – which is also fine. The output of the proposal will be an open-sourced, as well a hosted on AWS for at least a year. Overall, I do have a very high confidence based on the presented reference, that this proposal will be completed successfully.", "q1r": 5, "q2": "The proposal is very understandable and no questions remain unanswered. The proposal is in line with the requirements of the challenge setting. Due to the fact that the result will be publicly available the project could be audited with out any problems.", "q2r": 5, "assessor": "z_assessor_1184", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 654, "q0": "File this one under \"Critical Infrastructure That I'm Shocked We Don't Already Have.\"  The Universal Resolver is like being introduced to your new boss by a friend who already works at the company.  In true SSI, no one assigns you an identity, you assign it to yourself.  In this instance, the self is the Cardano blockchain, and the identity assigned is did:prism.  The Universal Resolver can allow did:prism to interoperate with any other identity that it understands.  It understands identities when it has the \"drivers\" in its protocols that give it all the relevant information to understand it.  Rodolfo has correctly sussed out that while the Resolver can introduce ether to bitcoin, and they both have IPFS on speed dial, Ada isn't invited to the party, so the answer is: create the drivers for did:prism so that Cardano has full SSI interoperability for identities.  A simple problem with a simple solution.  The only problem with this proposal is that it you haven't voted for it yet.  Let's fix that, shall we?", "q0r": 5, "q1": "3 weeks.  That is how long we have to wait for this critical connector to allow Sovrin and BTC based DIDs to interoperate with Atala.  I know, I know, however will we make it?  All I can say is that we couldn't ask for a better community member to be taking this task on.  He has already delivered a similar set of drivers for Cardano Sidetree, and he provided enough documentation here for the Resolver that I could probably develop the drivers myself, and I haven't written code for twenty years.  His 3 week timeline has more details than a couple of 12 month budgets I have seen this fund, and the budget is straightforward, broken down by the hour for 4 deliverables.  This is the easiest Feasibility assessment I have ever tried to write.  I think I'll take the time I saved and go check out the repo for this...oh wait.  Dang it, still have to wait 3 weeks....", "q1r": 5, "q2": "Easy to audit this one, too.  He has more deliverables than he has weeks in his timeline, which is just plain greedy.  Some proposers don't even have ONE good KPI and this guy has to list 6.  Well, I bet he isn't accountable to the community, is he?  Oh, completely opensource.  With all repos in Github, and a running version hosted in the cloud...  Fine, fine.  BUT, he probably doesn't know his way around the auditing protocol, eh?  That'll trip him up for sure.  What?  He has 5 previously funded proposals, all 100% up to date?  AND the timeline barely requires a single audit before completion?  Alright, alright.  He's definitely got this.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7149, "q0": "I find the proposal in accordance with the challenge set due to the fact, that they aim to implement Atala prism to universal resolver - this will cause DID Atala Prism will be accessible on the Decentralized Identity Foundation - thus increasing the exposure. I see an added value for the DIDs in general and Cardano blockchain in particular. ", "q0r": 5, "q1": "The proposer is an active member of the community, got funded and delivered in the previous funds, provided linked in profile aswell. \n\nThe budget and the roadmap are provided in a detail - 6425 / 4 weeks, with an hour detail of the work performed. Visited the git hub repo, the driver is present. At the same time, the technical aspects are stated, increasing the confidence that the proposer is having a clear idea about \"what it takes\" to deliver the final product. \n\nThe proposed also devoted a paragraph to possible risks, on which he reflected.\n\nGiven the information provided, the proposal is meeting the full five stars rating regarding feasibility. ", "q1r": 5, "q2": "The problem solution is clearly articulated and it is obvious that the proposer is using his experience as CA/vCA - audit section is covered in reasonable detail -The five deliverables are stated, where the first - open-source code - will allow both tracking the progress and the success of the proposal - commits, errors solved, project views can be used, along with the Sprint Burndown (KPI metric for displaying the progress in percentages).\n\nThe other four are mainly focused on the final stage of the product.\n\nI am wondering if we would be able to measure \"somehow\" the acceleration of the Atala Prism DIDs resulting from this proposal. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will develop the driver so worldwide users and platforms can retrieve Prism Decentralized IDs using the well known Universal Resolver", "experience": "The team is fully engaged on Self-Sovereign Identity projects in the Cardano community with several projects already funded and delivered on F6 and F7. They built RootsWallet, the first open source Identity wallet for Prism, and a Universal Resolver Plugin for sidetree-cardano."}