{"id": 399040, "author": "allisonfromm", "title": "PRISM DIDs for Catalyst CA Process", "url": "https://cardano.ideascale.com/a/dtd/399040-48088", "category": 26443, "amount": 21000, "description": "\nHow do we increase accountability & transparence, build reputation systems, and experiment with voting while maintaining privacy for CAs?", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem solution is clearly described by the fact, that CA process requires further modification due to the increasing number of CAs, and that we need to increase accountability and transparency of these CAs. For the last fund, there were so many filtered assessments, but even if some restrictions would be applied, nothing prevents from applying again by using a fake name, or a nickname and creating a new wallet address. Implementing Atala prism DIDs could solve it.\n\nAnother positive effect can be a showcase of the Atala Prism.\n\nYet, the proposal is less in accordance with the challenge. The challenge goal is to fund solutions that are implemented using Atala PRISM to have the most positive impact and opportunities for the rapid growth of Cardano - and this proposal will accelerate Cardano catalyst primarily. As a result, we can find a connection between the improvement of Cardano Catalyst, funded projects, and therefore positive impact on Cardano.\n\nNevertheless, it is not aiming on a new people or new cooperations, and therefore the impact when successfully funded is more narrow.  Also, it is an R&D proposal, focused purely on the research, whilst planning to ask for funding on Fund 10 with the prepared proposal (based on the section \"success of the proposal\").\n\n\n", "q0r": 3, "q1": "The team members are without a doubt sufficiently experienced and skilled to implement the proposal successfully. LinkedIn profiles are also present, increasing confidence. \n\nRegarding the roadmap, from the proposal, it is not clear for how many months is funding requested, what are the subgoals/subtasks, and only the sections/areas of the budget breakdown are provided. Even though the team is looking top-notch, the other areas regarding feasibility are less elaborated. ", "q1r": 4, "q2": "The progress will be monitored by recording the hours spend, which I personally do not consider as a relevant metric, due to the very low possibility of verification. On the other hand, shared documents from the performed research bring a much higher value. Since the roadmap/timetable is having no set subgoals, only \"research\", I am not really sure how we will be able to identify, whether the project is on schedule, or if the output is progressing in a reasonable manner unless inspected on a frequent basis - I would suggest weekly. \n\nRegarding the success...we will see in fund 10. \n", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Yes, this proposal effectively addresses the challenge. The proposers are specifically focused on: supporting the rapid growth of Cardano; driving interoperability, and; creating alternatives to accredited education and career paths. The team does a good job at explaining how their proposal meets each specific component by effectively integrating PRISM in the CA community; making the system interoperable with Hyperledger Indy ledgers, and; developing new systems for reputation. Each of these components likely could have their own proposal and the success in one area would likely have cascading effects in the others. \n\nAs many of the issues facing the community are already known (as per the iterative dropbox shared) I am questioning a little why this level of additional research is needed, particularly as the majority of input has arisen from outside of the project team itself. To get full marks, the proposers should clearly articulate the expected impact of this research component alone, and not just the overall objective of bringing Prism into the CA process. In its current format, the proposal seems to conflate this research component with PRISM being integrated. ", "q0r": 4, "q1": "Yes, given the experience and plan presented it is highly likely that this proposal will be implemented successfully. \n\nThe team is comprised of very strong community members within the ecosystem who have well documented external credentials. The two primary proposers listed have also filled important roles within Catalyst as CAs themselves and Catalyst Circle representatives. This type of exposure can give voters confidence that they can contact these individuals to express concerns to support their initiatives. Knowing both these individuals personally, there is not a doubt in my mind with their competence to complete the task. \n\nGiven that this proposal is only focused on research and is not tied to the adoption of the proposed change in order to indicate success, it is very likely to be completed as per this plan. Where I find it falls short, however, is in the actual roadmap. The proposers suggest that completion is expected by the time Fund10 arises but this is very abstract and doesn't provide enough details on the specifics, including timelines and deliverables. Also, given the iterative nature of the CA process, how will you ensure your findings are still valuable over time? What if the changes you seek to explore are experimented while you are researching? Will those findings be included? \n\nIncluding this type of granularity in future submissions would add strength to the overall proposal. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. To measure the success of this project the team will use meeting attendance and project partner relationship-building. They also commit to having a \"solid, well-craft proposal submitted in Fund10, which has its roots in the process improvement work of the CA community, and which has the broad support of a significant number of CAs, as well as the support of IOG (both the Catalyst Team and the PRISM Team)\". \n\nI commend the proposers on these objectives but would have liked more specific measurements by which to gage their success. How many CAs equal a \"significant portion?\" What does the \"support of IOG\" actually look like in practice? How would you measure it? Given these measures of success, I think a better connection to the KPIs on how each will specifically be measured is important. \n\n", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The problem raised by this proposal is well known by experienced Community advisors: can we be anonymous and accountable? this project aims at using ATALA Prism DiD to solve this issue and make CAs accountable while preserving their privacy. As for the other project from this team “PRISM DIDs for CA Onboarding”, this project can be a little bit dividing for the CA and VCa community, because the solution as far of today has been a strong VCa task force. However, as a VCa since Fund 6, I share the idea that the general quality of assessments is at stake and that some of today’s VCa extra work can be avoided.\nThe impact section is very convincing, and this proposal clearly meets the challenge criteria.\nI want to underline one specific example : the fight against CA bots. Considering the link with this other proposal (https://cardano.ideascale.com/c/idea/399036, DIDs for CA onboarding), I appreciate the value that DID can have in the catalyst process and in a reputation system.\n", "q0r": 5, "q1": "Details are provided about the ProofSpace team members, some have been funded previously and have already shown results. Evidence is given that this team has the necessary skills to develop this project.\nI particularly like the risk analysis section of the proposal. For voters, I want to underline one specific risk that I think is representative of how this team works: catalyst process is currently under the control of IOG, so external initiatives like this one might be inefficient. To mitigate this risk, the team has been discussing with IOG Catalyst and IOG Prism to be integrated in IOG roadmap. They have secured that the community will be given a chance to influence the direction of our project, as step forward to Voltaire’s era !\n", "q1r": 5, "q2": "This proposal is about pursuing ongoing research works, to be able to submit a project/concrete proposal in Fund10. The budget breakdown is defined accordingly and is reasonable, as required for such a proposal that does not targets directly a prototype or MVP.\nTo enable a good monitoring by the community, the team offers to track hours spent on the project and a monthly report. \nI think the proposal could have been improved by providing details about the timeline, i.e. for how long this research will be conducted (apart from up to Fund 10 proposal submission)\nBut based on the reputation of the team, I strongly agree that the community will be able to monitor the progress of the project.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "\nDecentralised identity can improve the Catalyst CA process. Using Atala PRISM in Catalyst supports broader adoption of Cardano technology.", "experience": "\nAllison Fromm - https://www.linkedin.com/in/allisonfromm/\n\nKenric Nelson - https://www.linkedin.com/in/kenric-nelson-ph-d-7495b77/\n\nProofSpace - www.proofspace.id\n\n\n\nSee below for additional details about the team"}