{"id": 399036, "author": "allisonfromm", "title": "PRISM DIDs for CA Onboarding", "url": "https://cardano.ideascale.com/a/dtd/399036-48088", "category": 26443, "amount": 75000, "description": "\nAnyone can be a CA & review proposals. While wonderful in many ways, this radical inclusivity can contribute to low quality assessments.", "f6_no_assessments": 8, "f6_rating": 4.708333333333334, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=26910", "https://youtu.be/xvfZDnPU0SQ?t=26910"], "media": [], "f6_assessments": [{"id": 8269, "q0": "Yes, this proposal effectively addresses the challenge by specifically focusing on rapid growth of Cardano, the need for interoperability, and the creation of alternatives to accredited education and career paths. The proposers suggest that the successful completion of a CA course through which one becomes \"approved\" to be a CA would be bolstered by introducing DIDs. \n\nThe proposal does a good job at highlighting a key problem within the existing CA process (people scamming the system) and then explaining how a DID would be used to address this. By having CAs need to go through this course and have its completion linked to their DID, there would be less opportunities for bad actors to game the system. However, while this would certainly have an impact for vCAs who end up filtering out all inadequate proposals, the effects on the broader ecosystem are less clear. Nonetheless, given the significant weight that CA scores have on being successful during the funding rounds, the impact of improving this process with DIDs could likely result in benefits that are currently unknown. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is highly likely that this proposal will be implemented successfully. The proposers do an excellent job of showcasing their credentials to voters through LinkedIn pages and descriptions of their backgrounds. In addition, the two primary proposers listed have fulfilled key roles within the ecosystem, as elected representatives on the Catalyst Circle. This level of exposure can give voters confidence that these individuals are up to the task. \n\nThe position of the proposers within the CA community also gives weight to the feasibility of this project. While the risks identified suggest there may be community opposition to such an course of action, the team appears well-informed on the current sentiments and calls from the community for such a proposal. Personally as a CA and a vCA, the introduction of a minimum standard for assessments is an important missing component that could be addressed through verified credentials for CAs. \n\nThe roadmap and deliverables are well articulated and granular enough for voters to know exactly what will be completed at which stage. One way to strengthen this section would be to better delineate who from the team will complete each task. This is important since there are strong similarities between this proposal and other ones submitted by the team members yet all individuals are listed on each. How will you determine who works on what? \n\nOne thing I would have liked to see explicitly stated is the list of potential educational institutions that would be tasked with running the course and implementing the VC? Would you be looking for more formal academic institutions (say a university) or more online-Cardano specific institutions (such as the Catalyst School)? ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. The team is very clear in their KPIs and success measurements. The team's track record, as visible community members, can give confidence to voters that they will have opportunities to engage with the team on this proposal.\n\nThe main strength for auditing this proposal will come from the community itself given that CAs play such a pivotal role in Catalyst. CAs are a group of very committed actors who are working to improve the overall Catalyst system and are active in solution identification and experimentation. The team explicitly states their intent to engage the CA community early on and regularly which will by nature open the process to ongoing audit. \n\nWhile I don't think this is worth reducing the score for, I slightly question the \"number of quality reviews submitted in pilot challenge compared to other challenges\" as going through the course alone is likely not an accurate measure. How would you attribute these differences to the course on its own? Some further thought could be put into the question going forward, but overall great job. ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 145, "q0": "I think the proposal sums my thoughts up, so will leave the mic to the proposal team: \"The Catalyst CA Onboarding pilot provides the perfect use-case for implementing PRISM technology\".\nThis will only be a first step, but its an important step forward. ", "q0r": 5, "q1": "The proposal team looks very competent and to have relevant skills for a successful proposal according to the description given. Budget also look reasonable according to the proposal delivery. Timetable looks too optimistic because of all the moving parts and different tasks and dependencies on each other for a complete success within July. Also the fact that Atala Prism still runs on testnet will require all CA's in the test group to create testnet wallet to contain the prototype credentials. \n\nWould optimally wanted this proposal to be split into two. One proposal for fund8 for the planning, door opening, working the governance and developing the CA course. Then in a later fund, do the integrations part as a second proposal for the verified credential when Atala Prism mainnet date is known. This way, mainnet VCs can be issued instead of testnet credentials.", "q1r": 3, "q2": "Kudos for a well prepared and well written proposal. KPIs, budget, roadmap and clear definition of what successful delivery looks like. It will be easy for the community to follow and assess both progress and success of this proposal", "q2r": 5, "assessor": "z_assessor_1075", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 818, "q0": "This proposal does effectively address the challenge as well as provides an immediate use case for not only DIDs but for other innovative forms of \"identity\" or \"reputation\". I think this proposal is synergistically in line with many other promising proposals and on going projects in the cardano and Catalyst ecosystem. ", "q0r": 5, "q1": "Going off the material provided in the proposal, the team behind it seems more then capable of successfully and methodically working to correctly research and guide community implementation. Proposers seem to be very involved in catalyst so they should be able to connect and collaborate with other synergistic proposal teams.", "q1r": 5, "q2": "The information provided and the KPIs to be recorded along with the open discussion and implementation of governance framework will make it easy to assess and audit the progress of this proposal.", "q2r": 5, "assessor": "z_assessor_1221", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 5603, "q0": "This is an interesting idea that could certainly significantly increase the quality of the examinations, but on the other hand also represents a certain barrier. However, it would be crucial to improve the CA onboarding process as a whole and to explain it better. At the moment, everything is very decentralized, and you have to gather information from various sources to understand what it's all about, what the rules are, and how it works. Accordingly, I would not be so sure about the impact of this proposal as a stand-alone measure. A comprehensive approach, which I believe would be necessary, would require intensive collaboration with IOG. However, the proposers are also trying to do this and are fully aware of the problems and challenges.", "q0r": 4, "q1": "The plan is very clear. The budget is in proportion to the plan and takes into account not only the technical considerations, but above all the inclusion of the entire community and all stakeholders. The proposing team is very well positioned.", "q1r": 5, "q2": "The preparation of the proposal is absolutely understandable. All possible risks and concerns are addressed. Based on the presented KPIs, a very good progress monitoring of the project can be done.", "q2r": 5, "assessor": "z_assessor_2024", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5638, "q0": "The proposal directly addresses the challenge question, and the use case for Atala Prism within the Catalyst community it clearly described in the proposal. Having all CA's using and becoming more familiar with Atala Prism will also contribute to wider adoption and knowledge of the benefits that Atala prism can provide. We do not want to limit the ability of people to join Catalyst if they desire to, however it is reasonable to take steps to improve the overall quality of the proposal reviews. ", "q0r": 5, "q1": "The proposing team is highly experienced in Catalyst governance and the overall Cardano ecosystem, including Atala Prism, and Decentralized Identity solutions. Their combined skills, and contacts with IOG means they should be able to implement the proposed solution. They have identified the team responsible for the work, and provided detailed information about the teams experience and qualifications that align well with this proposal. They have included a clear budget outline with actionable steps and itemized expenses. The team has acknowledges some of the risks involved, such as integrating with Ideascale, Prism not being on main net, and requiring support of IOG, however they have taken steps to mitigate the risks and should be able to work closely with these parties to solve any problems that may occur. The budget and timeline to complete the proposal by fund 10 appears reasonable and feasible. ", "q1r": 5, "q2": "This proposal has a clear timeline with an aggressive target of fund 9 implementation and a conservative implementation in fund 10.  The deliverables will be available to the community, and the KPI's are clearly outlined in the proposal, and will be available to the cardano community. The overall goal of improving the quality of proposal reviews will be determined by VCA's after the project is completed. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7150, "q0": "Altough the proposal aims to improve the CA quality (educational course and Verified Credentials) and Cardano catalyst, it is actually not in high accordance with the challenge goal, which aims to have the most impactful on Cardano using Atala prism, because it is not aiming to new potential users, no new cooperations but rather to improve the current process within Cardano catalyst - which work. The current process SHOULD be improved but assessing the impact based on the challenge goal I can not score high.\n\nWill Atala prism be implemented? Yes. \nCan it be used as a showcase? Yes.\nDoes it directly aim for new people or new cooperations? No.\nDoes it directly increase the adaptation of Cardano? No.\nDoes it directly increase the adaptation of Atala Prism? Up for discussion...is it another use case? Yes...but is it actually spreading directly to the broader audience? No. ", "q0r": 3, "q1": "Given the provided experience and skill, the team is definitely qualified to deliver the proposal. Also, the roadmap is detailed but I would love to see some subgoals or subtasks.  e.g. May June = two months = three tasks...we have no idea of its distribution over these two months. The budget is detailed, yet it is hard to pair it with the tasks performed and people performing these tasks. The total budget of 75k per 3 months = 25k per month. Since the proposer managed to prepare such a detailed budget, I believe you can pair it also to tasks over time and people conducting the named tasks. \n\nit is feasible, yet some clarification is missing. ", "q1r": 4, "q2": "The progress of the proposal can be tracked by mentioned KPIs which seem sufficient and thorough. \n\nThe main success should be the implementation of Atala Prism into Cardano Catalyst, and the increase of the CA quality should be just a side effect. If this challenge would be about improving the Cardano Catalyst, I would have no objections whatsoever.\n\nNevertheless, I keep the audit score at 5, because based on the information it is evident, that the team plans to be transparent and use every possibility to allow high auditability. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9892, "q0": "This project aims at maintaining or increasing the quality of Community Advisors contributions to project Catalyst by partnering with an education team and issuing DID Credentials that will certify that a CA did attend the course. \nAs far as today, there is no verification that CA have read the CA assessment guide, which is the main document describing the job. As a VCa myself, I can confirm that many poor-quality assessments exist. \nThis proposal wants to set the conditions to enable a change to the radical inclusivity, which I think is indeed wonderful. But, whether we have to rely on an army of VCa or we need to secure the quality of assessments is not what I have to assess right now.\nThis proposal is indeed an impactful use case for DiD, and it matches the challenge on several points: digital identity, verifiable credential, trust registry etc. As a bonus, the proposal mentions that it can be a proof of concept to improve the delivery of education credentials.\nI strongly agree that this proposal effectively addresses the challenge F8: Accelerate Decentralized Identity.\n", "q0r": 5, "q1": "A good risk is well identified : that the community does not agree with the approach. As stated in my impact rationale, I can confirm this risk exists as I personally disagree with this approach because I consider that the VCa solution combined with a strong reputation model may does the job and let us keep our inclusive principle. Several other risks are identified, and the proposer has thought about a relevant mitigation plan for every risks.\nDetails are provided about the 7 team members (ProofSpace team) with very well know names in the community. Some have been funded previously and have shown results already. This list shows without any doubt that they gather the relevant skills to develop this project and adding confidence to the feeling we have when facing the general good quality of writing of this proposal.\nThe level of details for project plan is very high, with multiple tangible milestones in the timeline. The same can be said for the budget breakdown which shows that this project has been structured, and thoroughly evaluated in terms of ressource.\n", "q1r": 5, "q2": "There is a clear commitment that the progress will be transparent for the community, through a list of several indicators and through the publication of the deliverables. \nWhether the project catalyst will go that way or not is another story, but this is definitely a very good quality proposal that deserves being funded.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10535, "q0": "\"Catalyst is one of the best parts of the Cardano ecosystem, and this proposal's implementation would go a long way toward it's sustainability in the long term. Community Advisor work is critical to screen proposals and keep the treasury funds to good use. \nI strongly agree that a minimal qualification such as the one described in the proposal would be very positive, and purely technical knowledge credentials  would also enrich the experience for all Catalyst stakeholders. However, I think there should be a very conscious effort to steer clear of any temptation to vet CA's according to their preferences or views on the ecosystem.  It's very important to foster diversity, and the credential issuing institution biasing the CA community with it's own perspective can become a problem. \"\n", "q0r": 5, "q1": "The project plan is sound, albeit possibly over-optimistic in the late stages (the actual integration of credentials in a single challenge). Soft skills are in my opinion the most important for this proposal. Those are harder to assess than technical skills, but I'd say the team has those, judging by their participation in the various Catalyst outlets (discussion groups, town halls...).\nCompletion of the plan if also dependent on the completion of other (already funded) proposal, and the involvement of actors beyond the control of the proposers (Educational institution, IOG, Ideascale), but even if any of those \"moving parts\" fails, there's a lot of value to extract from the work in this proposal, so I would consider it feasible only based on the plan and team capabilities. \n", "q1r": 5, "q2": "The proposal plans to provide updates on progress on community channels. I think it's an appropriate way to do it in this case. Proposed KPIs would measure involvement in the process at the different stages, and finally compare CA reviews with and without the credential requirement.\n", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "\nPartner with a community-led education team providing CA onboarding and issue DID Credentials verifying CA participation in the course.", "experience": "\nAllison Fromm - https://www.linkedin.com/in/allisonfromm/\n\nKenric Nelson - https://www.linkedin.com/in/kenric-nelson-ph-d-7495b77/\n\nProofSpace - www.proofspace.id\n\nSee \"Team Members\" section below for additional details."}