{"id": 399396, "author": "sean.kelly38", "title": "Work Based Learning Credentials", "url": "https://cardano.ideascale.com/a/dtd/399396-48088", "category": 26443, "amount": 20000, "description": "Rapid expansion and growth of Atala PRISM & Cardano cannot occur without identifying & leveraging high-value credentials.", "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"id": 668, "q0": "The team does a pretty good job of lining out the problem (though I would argue that the labor shortage is primarily an issue of poor economic fundamentals that result in the inability of employers to pay a market clearing wage, with the demographic issues a distant second) and regardless of why there is a labor shortage, the fact is it is here, and it seems to be persistent.  What I really love about this proposal is recognizes a critical middle ground that is ripe for Cardano and Atala:  higher ed is a regulatory quagmire with a lot of vested interests to sort out in order to try and deliver any kind of new solution.  Similarly, primary and secondary education has a similar regulatory profile.  But in between is the blossoming field of apprenticeships, work-study and vocational training, the kind of work that makes the world go 'round.  At this level, schools are much more likely, and even eager, for onboarding opportunities to become Issuers of credentials, and the students are much more likely to need the versatility that a VC can provide, including validity and currency.  And the verifiers are bound to be more numerous too, since some certifications, such as an electrician or plumber, might need to be verified by customers every day (and can you imagine the potential of adding an Angie's List type protocol to a VC re-issuance scheme, where reputation can accrue to certain VCs that consistently deliver positive results?)  A huge untapped and largely forgotten market from the tech standpoint may be one of the early adopters of SSI solutions for the workforce for something like this.\n", "q0r": 5, "q1": "The team has a longterm roadmap laid out, and they clearly are delimiting the scope of the work they want to undertake in this first phase of the project.  With a healthy amount of breathing room for research they are looking to roll out a whitepaper, along with a detailed Proof of Concept project design, and to start work on a UI/UX (that can likely serve as the project landing and communication page going forward).  The budget isn't broken up into too much detail, but it works out to approximately $5k per month to get the project launched, with an expected funding proposal for Catalyst Fund9 to implement the PoC in the final month, alongside development of the UI/UX.  This seems to be a good use of the time, though a bit of a slow start for an overall project that expect to deliver a final version in less than 12 months.  They have considered a suggestion to onboard some highschool students into something like a \"pioneer\" cohort, in order to accentuate the need for the research to provide value to its intended targets, likely highschool students or newly enrolled vocational students choosing a career path outside of higher ed.  To this end, the team seems ideally suited with the team lead actively working in Education, as an administrator for a technical college.  With a slow and steady approach, the team has brought the beginning of the project at least within their scope.", "q1r": 5, "q2": "The team has provided a list of measurables and milestones for the duration of the 4 months that line up well with the audit beats that they will be experiencing.  They may find themselves facing deadlines for the things like the PoC and White paper, on the grounds that there may not be a way to report partial progress on them, however, if they make the research opensource, and link it in a gitbook, they may be able to show incremental progress, in order not to cause a blocker for funding.  One the Ui/UX goes into development, they will be able to track development sprints.  There is a note of confusion when they talk about PoC, but I think it is clear from the body of the proposal that we are not talking about an mvp rollout on the UI/UX-Atala integration at the time of closing this proposal out.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 2075, "q0": "Knowledge is the first tool to break down barriers. Validation in scalability is blockchain's greatest potential, A way to accelerate the implementation of tools and accelerate decentralized identity needs nurture and methodology. Rapid adoption of self-sovereign identity (SSI) and Atala PRISM would mean great results for the group in its long-term goals. The proposal challenges the understanding on how critical education and marketing are to overcome the challenge of sustainability into scalability.", "q0r": 4, "q1": "Budget is fair for the challenge first step. Small words, simple explanations for a big challenge. breaking down the challenge into fnds make a reasonable idea for such a tack and make the proposal real and simple in words for my understanding, profiles participants fit the purpose of the task", "q1r": 4, "q2": "Not having KPI and SDG metrics for understanding the fair square of attention education needs to be part of the blockchain agenda, this shouldn't be a problem to comprehend the relevance. there's more to come from actions. First proposal on catalyst for the team, education needs a fair square, as it is my first (tryout) assessment for an educational implementation of the tool.", "q2r": 4, "assessor": "z_assessor_1451", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5609, "q0": "The proposal seems more focused on allowing schools and employers to train and hire more effectively rather than on accelerating the adoption of DID. There was a small mention of how work based learning credentials or credentials more generally could be used to enhance one’s DID. Perhaps a different challenge category would be more applicable or highlight how your approach could better convince educational institutions and companies to issue credentials compared to other methods of issuing credentials on blockchains.\n\nThe bigger issue is probably what the team aims to do for this round which is to “focus on research, access to Atala PRISM Pioneer program, develop a white paper and proof of concept, develop strategic plan/ branding/ and initial UI/UX”. The value add seems minimal given that Atala Prism already explicitly lists credentials under their use cases for education and enterprise and no new usable product would be done.\n", "q0r": 2, "q1": "The team is made up of experienced educators but their plan for this round of funding is only to “focus on research, access to Atala PRISM Pioneer program, develop a white paper and proof of concept, develop strategic plan/ branding/ and initial UI/UX”, which they could do. But voters should decide if this is really worth $20,000, even if it is feasible to carry out these tasks.", "q1r": 3, "q2": "The team will submit reports which seems fair enough for auditability given their deliverables which mainly involves creating a lot of documents.", "q2r": 3, "assessor": "z_assessor_2026", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5927, "q0": "The proposal has a great potential as the solution to the targeted problem could add value to the Cardano ecosystem by making good use of the DID benefits that it can provide. The proposal lacks in providing info about the necessary interaction with the government or business entities that can provide these types of verified credentials and what can be done to benefit from their expertise. It is recommended to follow the Primitives and the Patterns defined into the Challenge brief thus identifying the best direction for this proposal. Based on how is presented, seems that the proposal misses some aspects that could make it fits well into this Campaign.", "q0r": 3, "q1": "There are some evidences for the skills and experience that 3 (out of 4) members of the team have but it is unclear who of them has the necessary knowledge to understand and make use of the Atala PRISM benefits as the team gained access to the Atala PRISM Program and SDK.\n\nThe phase 1 of the project is presented in a vague manner and it is somehow unclear what are the deliverables of this stage. (What is to be researched and what is the output of this action? - develop a white paper and proof of concept - PoC should be already be done as, at the time of the proposal was written, the proposer should have known if this principle has a real world use case.).\n\nIt seems that for the other phases of the proposal, additional funding is required but, the proposer has not provided a verifiable plan in this regard.\n\nThe budget for phase 1 is broken down into identifiable items but for some of them it is unclear who is gonna do the work ($2500 for a technical writer - it is unclear if the work is done by one of the team's members or is someone else). It is recommended to have the requested amount as a multiplier of price for working hour and the working hours that are to be done.\n\nThe proposer has not considered challenges and risks relevant to a successful implementation (any legal constrains (at least) for use of VC (DID)?)", "q1r": 2, "q2": "The proposal, in the actual form that is presented, looks more like a concept than as a working product. Relevant information are missing thus making difficult to assess the progress and the success of the proposal.\n\nNo KPI/metrics are defined to measure the success of the proposal. (A final report is necessary but is not sufficient to have a feasible project).", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We will develop a DApp that leverages high value credentials issued by work based learning programs such as internships and apprenticeships.", "experience": "Team of 4 individuals with diverse skillsets and talents in the education, work based learning (WBL), technology, and marketing fields."}