{"id": 399710, "author": "khilona.radia", "title": "Address Verification Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/399710-48088", "category": 26443, "amount": 24000, "description": "Multiple KYC SSI use cases start with ID verifiers but no address verifiers.\n\nInability to verify unbanked/unaddressed population groups.", "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 675, "q0": "This proposal is a mesh of two separate ideas and as a result is a little rough around the edges.  The first concept is nailing down the ability to validate a physical address using gps or what3words (awesome little app if you haven't tried it).  This idea forms the connection to the AtalaPRISM use case, but it is unclear how that connection is to be executed, or what protocol will be used to onboard the usecases as PRISM wallets.  The second concept is an interesting approach to increasing nurse productivity in remote regions, where they must travel to see patients, and where issues with validating patient location leads to waste of precious time and resources.  Most of the proposal focuses on this second case, as a high priority project, while the PRISM concept in the background is forecast as useful in a lot of areas, but without a clear vision of the execution.  If a protocol were designed that effectively tied a physical location to an issued DID (which means establishing the trust registry of an issuer and the governance protocol that determines how to populate the trust registry), than this could indeed become an excellent use case, with other applications anywhere a verified address protocol is valued, such as state issued IDs or KYC concerns.  Without the follow through for the Issuer and Verifier requirements, this proposal looks to come up short of the challenge.", "q0r": 3, "q1": "The technology required to roll this out is presented in this case as the use of third party apps in a mash-up to provide basic \"finding and locating\" protocols.  There aren't, however, critical infrastructure concerns regarding a framework for establishing the trust registry of an issuer, or the wallets required by those being \"located\", or how to integrate the results of the \"locating\" with the DID capabilities of PRISM or a PRISM wallet.  As such the $80k budget seems heavy to administrative concerns, such as almost $30k resolving to the capturing of use-case data for measuring nurse productivity.  While this information no doubt could prove valuable in establishing a monetary value for the use of the suggested protocols, it would be irrelevant to reapplying the usecase to other fields as suggested.  The budget also calls for acquiring the (presumably) mobile data needed to bring the nurse and patients into the protocol.  But is this sustainable?  Outside of establishing this use case, has the impact been realized if the protocol must be dropped?  This introduces a hesitant note of moral hazard.  It is suggested that the proposer consider a more sustainable approach to delivering the impact that the nurses and patients are looking for, without neccessarily feeling like they have to lean into PRISM or DID protocols just yet.  Perhaps consider collaborating with this fund 8 project: https://cardano.ideascale.com/c/idea/396850 where GPS based NFTs can be placed and picked up, and keep the focus on the real impact this project promises.", "q1r": 2, "q2": "A road map and time horizon are included, but there is a disconnect between what they intend to do, and what they will be able to deliver under this proposal.  The included KPIs for the tracking of nurses' data and finding the efficiencies and leverage provided to them by this project belie the need to make a case for this being an example that can be applied in other areas.  Whether the nurses realize productivity gains or not doesn't help us understand how KYC providers might cut costs or speed up transactions, or whether there are enough use cases for a FICA or RICA rollout (in fairness there is a decent amount of overlap for package delivery data that a use case may be able to be drawn from the nurse numbers).  They also suggest a KPI of 100 users onboarded, but the real KPI lurking in that number is how many people want to be onboarded?  How many users want to have a digitally verified address, or end up opening identity wallets on Cardano.  This measures how useful or user friendly the onboarding process is as well, which helps drive other adoption.  If the proposer focuses this project in more on the specific use of gps/blockchain integration, and perhaps considers a better challenge setting, this proposal could be better setup to succeed.", "q2r": 2, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 9, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 5522, "q0": "The proposal describes the implementation of a localisation service using GPS coordinates used in conjunction with an SSI wallet or WhatsApp channel, to help nurses find their patients faster in locations with unbanked and unaddressed people.\nThe team wants to implement a pilot with 100 people and analyse the results of the project after the prototype ends.\nThe idea of the proposal has a lot of potential, it could stand to benefit a lot of people, and having it first tested on a small scale to see the benefits and drawbacks of the first POC is a very good idea, because if it proves successful, it could extend not just to a larger healthcare services base, but to other important services as well, that would stand to benefit from bringing aboard unaddressed populations.", "q0r": 5, "q1": "The detailed plan and timeline are set up for a period of 4 months, covering most aspects of the project’s implementation, from identifying the team to the close-out reports to Catalyst. The POC and the testing of 100 participants is scheduled for the next phase, that is not included in this proposal.\nThe budget is split into 2 main categories, “Design thinking sprint” and “Administration and co-ordination”, with no further explanation and details on why these sums are being requested.\nThe team members have provided only a very short description of themselves with no social profile links and no description of the remaining team members needed to be hired for the completion of the project, and the skills they are required to have.\nWithout a proper budget description and team description it is hard to assess the successful implementation of this proposal.", "q1r": 2, "q2": "The progress question hasn’t been answered, the proposer has pasted the same answer as for the detailed plan and timeline question in the feasibility section, without adding any measurements or specific details on how the community could verify that these steps have actually been implemented.\nThe success definition is broad, and describes the success after all phases of the project (this proposal covers the first phase only) have been completed “A tested prototype that demonstrates”and no numbers as milestones to be clearly identified by the community.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8272, "q0": "Yes, this proposal effectively addresses the challenge and focuses on identifying repeatable use cases that can be applied across different jurisdiction and works to solve the last mile problem. The team highlights a problem that is largely overlooked in other proposals, specifically, how do you provide services to individuals when they cannot provide accurate location and identity data. This is the first project in this challenge that I have seen addressing this specific component of the challenge. This is an exciting focus and would likely be able to be extrapolated to a variety of different settings: the exact goal of this challenge. \n\nThe impact also has a massive upside given its focus on the unbanked and unaddressed. This focus aligns with the core ethos of Cardano by providing solutions to those that need it most. Moreover, given the ever changing state of the globe through war and other crises, this solution would likely have the potential to resolve massive migrations of people across the globe who may no longer have the luxury of proving who they are. \n\nThe team also does well to highlight more than just an impact on the community but highlights the medical, individual, and state-level benefits. This multi-tiered approach indicates the team's long term vision to provide benefits across the entire value chain and not only top down. One could imagine that the outcomes from this proposal could be applied to all groups or allow for more in-depth exploration of each group, and could be the focus for a variety of other projects looking to explore each component. ", "q0r": 5, "q1": "Given the experience and plan presented here it is neither likely nor unlikely that this proposal will be implemented successfully. The team could have done a better job at explaining who they will need to attract to the project for the design thinking team. What is the process that you will follow to attract new people to the team and what type of individuals will you be looking for? How many people will be on the team and will you engage Cardano community members or others working in this space specifically? \n\nThere is also a lack of any sort of credentials for the proposers. They do provide very sparse and high-level descriptions on their skills but there is no way to verify their truth or the depth of the skills. The community deserves to know, and be able to validate, who the team members are that will receive the funding.  If you are taking the majority of the budget for the design thinking sprint, there should be more details fleshed out into what it entails. I would encourage the proposers to provide the community with links to this information in order to obtain a higher score.", "q1r": 3, "q2": "Overall, the information provided is sufficient to audit the progress and the success of the proposal. The community can expect the team to deliver their proof-of-concept for address verification using DIDs followed by testing and refinement. The majority of the auditing opportunities appear to arise during the testing phase of the proof-of-concept where the 100 service providers will be onboarded to using the app. This process will likely require continual updates and tweaks to address user errors and concerns. \n\nI think the proposers could have better explained how the Cardano may be involved in the ideation phase to align their efforts to others in the space. Given that the goal of this project is to extrapolate findings to other similar jurisdictions or use cases, I would encourage the proposers to engage early and often with the community in their design. They do commit to providing the close out video and report, this comes at the end of the project. What opportunities will be created early on? \n\nOverall this is a very strong project and I look forward to the results. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Digital solution to issue proof of address for transacting and providing linkages and support to healthcare/financial system processes.", "experience": "Global healthcare in infectious diseases, healthcare innovations entrepreneur, biotech start up founder, retail banking solution developer, business process outsourcing and improvement. Connected with leaders in blockchain identity/SSI and African blockchain expertise."}