{"id": 399879, "author": "benji.kok", "title": "Verifiable Digital Receipts", "url": "https://cardano.ideascale.com/a/dtd/399879-48088", "category": 26443, "amount": 144000, "description": "Insurers and Creditors can't utilize the valuable spend data captured in invoices and receipts at scale.", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=7448"], "media": [], "f6_assessments": [{"id": 679, "q0": "This project intends to create the following value propositions for users:  If you are a business, you can sign up for free for a program that allows you to overlay value-added customer experiences to the sale of your products (things like loyalty programs, or warranties, or 3rd party deals, or fintech such as instant credit), and you can overlay these while respecting the data privacy of your customers.  If you are a customer, you can download a free app-wallet that allows you to make purchases, create an encrypted record of your purchases, manage household budgets, join other consumer groups for leverage and take advantage of value-added experiences through your favorite vendors, while maintaining your privacy.  If you are trying to reach customers with a value added service like insurance or a 2nd hand goods marketplace, you sign up to be seamlessly connected to customers actively looking for your services.  For all of these principals, this project aims to issue on-chain credentials at the point of sale in a dedicated SSI scheme for data privacy and encrypted validation, all without the end users needing to onboard into the complicated world of SSI.  This \"one click\" approach to SSI is a refreshing approach to the conversation about new ways for business and individuals to handle personal data, and could have huge implications for smaller businesses.  On top of these propositions, following DIDComm protocols means that private, encrypted, platform agnostic communication directly between engaged principles becomes possible, which enables increased participation and stickiness for customer loyalty.  Going forward the proposer sees possibilities for this protocol to be scaled to suit business models on their backend as well, dealing with vendors and suppliers, and for groups of businesses or individuals to even form DAOs. ", "q0r": 5, "q1": "The proposer has a clear view of what kind of team will need to be assembled, with solid estimations of how much time on each UI/UX and backend deliverable will be required.  The expected budget outlays for those hours is mid- to high-range, which should allow a quality team to be found and resourced if funded, but it does push the budget up about 35% higher than would be its most competitive rate in this challenge and fully 29% of the funds alloted for the entire challenge budget.  The budget description is limited to just the hourly rates for the developers, with nothing arranged for project management.  It is also unclear whether there is an expectation to run this first on test-net, or how it will be rolled out.  If this plan is to be settled after funding it would be good to see the addition of a project manager to the team requirements.  The proposer does seem to have a good idea of what technologies and integrations are required to build this out, and they appear to be looking at HyperLedgerINDY interoperability with Cardano, which should give them good governance framework protocols for their trust registry, and an assumption that they will be adapting a PRISM wallet to function with their app.  A 3-6 month timeline has been indicated, but there aren't any details on what is expected when.", "q1r": 3, "q2": "All of the tech they expect to be able to rollout in parallel, so a wallet, website, SC database, and issuance modules all under development at the same time.  I'll say it again:  it would be great to see a Project Manager resume for this.  Linked profiles don't give any clear indicators of who the Project manager on the team is or what projects they have lead development on, though there are a number of high quality (Sovrin) and interesting (Yoma) projects they seem to be connected with.  They expect to take one to two quarters to simultaneously develop their deliverables, but it would be nice to see where the milestones like payment integration or decryption module implementation fall on the timeline.  It is difficult to estimate just where the audit points fall, but the proposer notes that they intend to track github commits and get regular in person updates on progress from the developers.  The KPIs listed are somewhat limited:  number or users signed up and number of credentials issued.  To truly measure the impact here we would like to see feedback not just on opportunity and ease of use, but to get feedback on the value of privacy protection provided, i.e. consumers want to have their cake and eat it, too:  can we measure the benefit of adopting privacy protecting SSI while also enjoying the consumer sprawl of warranties, loyalty programs and consumer group leverage?  It would also be good to specifically see how much grouping and networking was occurring, so some stats on that would be a good measure of impact as well.  ", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 9, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 8274, "q0": "Yes, this proposal effectively addresses the challenge by delivering a full service solution for retailers and consumers to track and verify digital identities and receipts. What I really value about this proposal is that it's focused the entire spectrum of users and not just issuers. From major companies seeking more direct relationships with their consumers to a family managing their personal finances, this solution could have a major impact in a multitude of settings. The team does an excellent job at outlining the benefits for the different parties involved (issuers, users, verifiers) and the value they can expect from the solution. \n\nThere are also some emergent impacts that could be realized through this project, such as the organic formation of DAOs through consumer spending habits, and opening up the broader Cardano ecosystem to large companies entering through the DID platform. While this latter component is not an objective of the proposal in itself, it does showcase the long-term durability of the solution should it be successful. To this end, it is likely that the project could have a significant impact. ", "q0r": 5, "q1": "Yes, given the experience and plan presented it is likely this proposal will be implemented successfully. Over the next six months, voters can expect the team to complete a mobile wallet app, a website, smart contracts to enable verifier pays transactions, and language specific modules for other groups working on similar initiatives. \n\nThe list of milestones and deliverables are easy enough to follow and showcase the proposer's understanding of what is required to achieve their objectives. They also provide links to all team members which validate the claims made in the proposal regarding their ability to deliver. The budget does leave a bit to be desired as they identify the project costing between $90k - $144k but they do not justify why they chose the higher of the two prices. Given this is a significant amount of money, at 1/4+ of the total challenge fund, it should be better justified. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. In the plan outlined the team provides clear milestones and deliverables that can be checked against for audit purposes. Their app, website, and smart contract development are all yes/no completion indicators and are easy enough to measure. \n\nThe team commits to using github to track their progress through commits and will also hold regular stand ups to gather feedback on their approach. These types of open-by-design projects go a long way to increase confidence of the community as the team makes itself available for scrutiny. By doing so, the community can not only participate but can see if their input was incorporated or not and then engage the company as to why/why not. \n\nOne way to make this section stronger would be to give actual thresholds for your levels of success. It's fine to use a complete/no complete for some items but when it comes to the use of the solution how will you measure it? If success looks like \"signing up issuers/holders/verifiers\" as well as \"issuing credentials through verifier-pays scheme\" how many will indicate success? Is one enough? Ten thousand? These types of measures make it easy to know what success actually looks like in tangible ways rather than highly abstract goals. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2572, "q0": "\"The topic \"Verifiable Digital Receipt\" is good, pragmatic for society, and it fits the challenge, has a large impact.\n\nIt solves the problem of creating digital identities in exchange for verifiable digital receipts to spend, targeting 3 audiences: Sellers (data publishers), Consumers (data owners), Insurers/creditors (data verifiers).\n\nThe smart solution is to make purchases through a mobile wallet, which has a digital identity verified and the Purchase Receipt also verified on it. Both convenient and seamless payment, transactions are optimized to retrieve clear information and avoid fraud.\n\nIn addition to individual identity verification, the proposal also provides solutions for groups or businesses. Each participant in the digital identity ecosystem can establish a reliable indicator that translates into more opportunities for themselves in this ecosystem.\n\nIn this proposal, Cardano will be used to set up trust registration as well as to revoke credentials.\nWith many solutions offered, most of the problems of the challenge are solved. Aim to help the Cardano ecosystem to develop in a variety of states. Open up the ecosystem for distribution networks, allowing sellers to access an open ecosystem of service providers with a closed-loop supply chain.\n\nDeploying an SSI solution is a big challenge. The project outlines some risks when implementing, and also has specific solutions, solid and reliable arguments. This makes risk management easier if the proposal is funded.\nWith 18 years of Data Science Platform experience with a particular focus on credit and insurance risk models. Highly experienced and professional team, I believe they will overcome the risks and conquer challenges easily.\"\n\n\n\n", "q0r": 5, "q1": "\"Clear roadmap, specific detailed plan. Outputs and human resources are also available. Everything seems to be getting ready to launch for success.\nI am quite impressed with the outputs such as:\n(1) Mobile Wallet App, (2) Website, (3) Smart Contract Suite, and (4) Language Specific Coding and Certificate Modules\nAccording to the roadmap, these products can be developed in parallel within 3 to 6 months\n\nThe total budget set is 144k $, 20% more than the target of the challenge. However, the proponent also has a clear and specific explanation of the costs used for project development, which is highly convincing.\nThe team has at least 3 years of industry experience. As the introduction, the team consists of product managers, UI/UX designers, developers, and coders/developers. Having experience and exposure to SSI, POC, and Verano co-developing.\nWith a casting team with extensive experience, I'm really curious to find out how the characters are, but on the proposal, I can't find documents to look up their information. I regret that it was not easy to look up the human resources for this project. Hopefully, the proposal will update more detailed personnel information next time.\"\n\n\n\n\n", "q1r": 4, "q2": "\"Plan progress metrics are made through commits on Github, which can be easily tracked.\n\nThe project has entered the \"\"Implementing final works\"\" phase.\nWith the experience and plan presented, this proposal will likely be successfully implemented.\n\nThis is a new project. I appreciate your project.\"\n\n\n\n\n\n", "q2r": 5, "assessor": "z_assessor_1534", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5526, "q0": "The scope of the proposal is to develop a wallet on the Cardano blockchain, that would create a DID, save receipts from purchases and enable password logins amongst others.\nThe receipts would have the same benefits as the physical ones that are provided today - warranty, proof of ownership, loyalty/rewards programs etc.\nThe proposal could open the door for a plethora of new developments, both on the DID side as well as on the dApp side in the Cardano ecosystem.\nAs such, I find the proposal to be highly impactful, relevant and fitting the challenge brief.", "q0r": 5, "q1": "The plan and timeline are in-depth and comprehensible. The budget is realistic, covering the expenses of 3 different developers with different skillsets. The team members necessary to complete the project have a concise description, confirming the knowledge the proposer possesses regarding the actual development of the proposal and have also provided links to their social profiles on LinkedIn to prove their previous works and skills.", "q1r": 5, "q2": "While concise, both the development progress and success description turn to the very detailed deliverables in the feasibility section as points of reference for the entire auditability section, with the mention of having as project advancement measurements GitHub commits and regular standups. The Information provided is enough to assess the proposal, and consider that the community can verify the progress and favourable outcome independently and with no difficulty.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Enable retailers and consumers to create digital identities to exchange verifiable digital receipts for consumption.", "experience": "18 years background in data science, with a specific focus on credit and insurance risk models.\n2 years SSI exposure, POC's developed with Veramo.\nTeam consists of product manager, UI/UX designer, developer and cryptographer/developer."}