{"id": 400341, "author": "proofspace.nick", "title": "Token-based PRISM credentials", "url": "https://cardano.ideascale.com/a/dtd/400341-48088", "category": 26443, "amount": 29267, "description": "It is hard to use blockchain-based transaction data to trigger useful interactions in real-world scenarios.", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 695, "q0": "Full marks to this proposer for thinking outside the box.  This is an intriguing R&D proposal that imagines a new use case for did:prism, and I have to be honest, I'm having a hard time getting my mind totally around it.  I am going to try to assemble a use case, probably badly (apologies to the proposer if I'm not getting it).  If you were to get a hotel room, you could potentially pay with ada via a smart contract transaction (welcome to the future!).  The logic of the tansaction would basically be that \"You\" have securely purchased entry to the room and if \"You\" go to the room, it will unlock for you and only you.  The security of a DID to prove its you and that you paid is a laborious transaction.  But what if the output of the transaction, based on your private wallet key for the transaction, could create a DID for access to that room, and that DID is a representation of you as payer, and at the door it represents you as a verified opener of that door.  I probably butchered that a bit, but you get the idea.  Basically pulling a known cryptographic proof forward to validate a new token issuance.  Many questions come up for me, which indicates to me this could be fertile grond for some research and experimentation.  For example, what does the trust registry look like in this case?  Do I miss the mark by thinking this sort of obviates the need for one?  You have the smart contract logic, based on an elegant language, tied to the blockchain protocol...d the terms of the purchase become a proxy for the governance framework?  Maybe way off, but there is no doubt this concept is interesting, and I think it is highly likely to bear fruit.", "q0r": 5, "q1": "With no guarantee of success here, purely from a research point of view, and with the high cost of that research I find myself unable to pull the trigger on the highest grade for this proposal.  But it is close.  The team seems well suited to working this out, with a scientific researcher, and 2 experienced developers.  The budget is hefty, and chunky, but it makes a certain sense:  the R&D is modest, but it is going to be iterating that R&D that leads to a solution, so the implementation budget becomes a case of \"X\", as in, something, based on what R&D produces.  This budget may have been better submitted as double the ask for the research, and leave the development for another day.  If the research is opensourced in that scenario, they may even have added to the team.  As it stands, it is a big ask without a lot of clarity on the roadmap.  As far as the roadmap goes, there is some good discussion here of how to approach the R&D, which functions as a guess at the timeline.  The risks are, of course, that the R&D phase creates some definitions that just can't be realized in practice, but that is what research is for.", "q1r": 4, "q2": "This previously funded proposer has a roadmap that shows at least 8 deliverables, so if it gets off the ground they should have good development sprints to report on.  As an opensource project, the access to the research and the repos will be easy to report and gives plenty of transparency.  The team is currently up to date on previously funded proposals, so it can be expected that they will be able to follow through here as well.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 7, "ng": 6, "nfo": 0, "vca_o": 2}, {"id": 7154, "q0": "The proposal aims to implement a solution to merge DID with a transaction (executed smart contract), to provide proof of the token ownership (transaction). This solution could be used in common real-life situations such as payment for the hotel or similar situations, where verification is required. \nThe real-life adaptation would positively impact both DID and Cardano exposure, which is the aim of the challenge. \nAs required by the guidelines, the proposers are also discussing the metrics measured such as the number of users, the number of verifications performed. \nAnother output that I find relevant, and is mentioned by proposers, is research material acquired from the implementation, which can help other projects to build on. \nI find this proposal in accordance with the challenge goal.", "q0r": 5, "q1": "The information about the team seems sufficient enough from the perspective of competence, experience, and skill required to deliver the final product.  I have tried to google some, I found some. I would love to see some links in the future for easier verification of the information. Even for articles. \n\nAltough the budget/work performed is clear, I am missing a better detail of the expected duration of each phase. The proposal is divided into R&D and Implementation phase, both of duration of two months, but these two months could have been divided at least on weeks, because it is unclear, how long e.g. te exploring of two strategies will take.  It would be better, if we could see e.g. exploration of two strategies 3 weeks, schema definition 3 weeks, template 2 weeks - and it would result in more confidence, that the plan is well thought out. Now it is open for interpretation. \n\nBased on these two small drawbacks, I am decreasing the score by one star. \n", "q1r": 4, "q2": "The audit of the progress of the proposal will be performed by the monthly reporting (I would suggest every two weeks), where the documentation, demo of no-code setup, and the partnerships will be shared, related to the state of the project. \n\nThe audit of the success of the proposal will be performed primarily by the number of use cases and collaborations. Also, the final deliverables will be shared such as finished documentation, deployment of the credentials, and arranged collaboration partnerships. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8276, "q0": "Yes, this proposal effectively addresses the challenge. The team is seeking to \"invent a way to represent transaction data (e.g. proof of token ownership or proof of a payment) as a PRISM VC - a “token-based credential” which they will then integrate into their ProofSpace App. \n\nThe proposers do an excellent job making explicit what they set out to do and explaining how it will impact the broader community. Their solution will allow users to represent ownership as a verifiable credential, which will open up numerous use cases that would require such confirmation in a transaction, such as wallet ownership or subscription services. \n\nThe integration with the ProofSpace platform is also an interesting test case in itself since the Hyperledger credentials are also able to be stored there, offering more interoperability for the system overall. Given that mass adoption will require integration with legacy systems, this may be an easy way to build the bridge into those structures. \n\nThe team does highlight the risk that this solution may not work in smart contract solutions, however, this is a valuable endeavour that could result in large returns for the community. ", "q0r": 5, "q1": "Yes, given experience and plan presented it is highly likely this proposal will be implemented successfully. The team has already built their ProofSpace platform which they will use to test and refine their Atala Prism solution, this gives confidence that the plan they have laid out is feasible since a significant portion of the work is complete. \n\nThe team plans that the development and integration of their solution is set to take four months from April to July 2022, which will be followed by piloting of the solution. By spending the first portion of their efforts on research, the team will explore different methods to integrate DIDs into transactions via token based credentials. The team articulates a strong research forward agenda to work out the finer details of will and won't work. This is true to Cardano fashion and is a good sign. \n\nThe budget, timeline, and roadmap make it very clear what voters can expect from this proposal. I would encourage the team to include direct links to their credentials. Although they outline their skills in text there is no way for voters to confirm this information. It may sound simple but this will go a long way to building confidence that the team is up to the task as without this confirmation voters are left to rely on what is written, which some may not be keen to do. ", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and the success of the proposal. Over the course of the project the team commits to providing community updates in June, July, and August. They will publish their documentation for community scrutiny and peer review, which will followed by demo videos of their project, and then will announce pilot partners. \n\nThe proposers could have done a better job at separating their deliverables from the indicators of success. As written, they are the same and it may be challenging to know what is actually measured to be deemed a success. While announcing pilot partners is a good outcome, how will you deem it a success, just the announcement? How many partners will you seek? How many users will you attempt to reach? Without more specifics it is unclear and may leave voters wanting more. \n\nThe proposers do include a project sustained success measure to grow their project beyond the pilot to increase collaboration within Catalyst via the use cases, and to deepen the effectiveness of the proposed solution. This forward vision does provide confidence that the team is committed to seeing this project through and to build on it's findings. If successful, the proposed solution may provide ongoing returns across multiple projects which would create a positive feedback loop that further fine tunes the solution. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Issue PRISM VC based on Cardano blockchain-based transaction or token data, bound to DID as an answer to a smart-contract transaction.", "experience": "Engineering team with 80+ yrs full stack dev and distributed systems research. Business team with 60+yrs legal, sales, product and ops across industries and geographies."}