{"id": 400892, "author": "misterchaos42", "title": "ATALA Prism Basic Income Protocol", "url": "https://cardano.ideascale.com/a/dtd/400892-48088", "category": 26443, "amount": 29500, "description": "Lift humans around the world from poverty and reduce the impact of inflation on life savings using Defi and Atala Prism", "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a fascinating high-concept proposal that introduces a \"reserve currency DAO\" that aims to pay out a universal basic income stipend to DID holders who participate in the protocol.  At its heart is the idea of a DAO that uses a basket of assets (in this case a basket pegged to indicators that form the CPI: the main measurement of official \"inflation\" areas in the US) to back a token, which in turn is bought and sold within the DAO to maintain a pegged value of another token that functions as a stablecoin.  A similar protocol which inspires this proposal is OlympusDAO, so there is plenty of research a voter can do to understand the finer, technical points.  The upshot is that extreme yields of the stablecoin can be generated, much like treasury bonds if bonds were held and never sold or used as collateral or rehypothecated.  Because the blockchain means rehypothecation (double-spend) can't happen, and because DAO governance can create holding periods (usually 5 days), there are theoretical base yields that can always be realized, and herein lies an approach for UBI.  Where the AtalaPRISM protocol comes in is to create an identity layer for the delivery of the \"bonds\" in this case UBI stipends.  Initally these would be low, but participation in governance would allow users to \"work\" and make the UBI higher.  In this case the \"work\" would be voting on parameters like how often the inflation snapshot is taken, which inflationary indicators are taken into account, and could be scaled to include integration with shopping apps and Adapay, which would create hyperlocalized inflation metrics, where the participants normal economic behavior informs the parameters and helps dial in the best yields for the bonding mechanism.  Governance is critical, and the community that gathers around implementations of this DAO are the source of that governance, so it is very intriguing to what Cardano in emerging markets could accomplish.  If it comes anywhere close to matching OlympusDAO in growth, then we are talking exponentially adding PRISM wallets and protocols to the chain.  There are some concerns about how deflationary circumstances affect this idea, but it needs to be noted that the yield requires only movement, not movement of a particular direction: if the governance protocol correctly accounts for this, they can move from an inflationary basket peg to a deflationary one...and with a community discovering and voting, there is a real chance that this critical piece of information is far more accurate than any ossified legacy institution's politicized metrics.", "q0r": 5, "q1": "With a model of this idea already running on Ethereum, with a dedicated community and loads of communication, it should not be hard for the proposer to work up a model for executing on Cardano.  The integration of PRISM will require some hands on knowledge, and the (very reasonable) budget makes room for team members for this job.  Creating the governance protocols is the heaviest lift, as they need to be rock solid to avoid exploits.  Using the DIDs to avoid sybil is the first step, building out specific protocols in smart contracts would be the next step.  There is no doubt that the initial discovery and design process is critical, and the proposer has dedicated two phases to this, with the second phase taking an emergent approach to applying early design decisions.  There is a good timeline of actionable items, from simple things like creating a name and building out a community, to compex deliverables like integrating DIDs or data harvesting automation.  Many things have been considered and room has been left for the (many!) emergent qualities that will need to be discovered.  There are risks beyond just typical crypto volatility concerns:  there are certain assumptions built into the OlympusDAO model, things like burying the us dollar under the DAI token, and thus considering that a disconnect from dollar problems in the stablecoin, but it is still there, lurking two tokens away.  Additionally, deflation (real deflation which isn't accurately understood in Capital E Economics...an offshore shadow money phenomenon) may require more than governance gymnastics to avoid, with real potential to wipe out multiple levels of treasury issuance.  But these problems can't be solved without a deeper engagement with the principles involved, and a measured, thoughtful approach, over a WenDAO? mindset is encouraged for the proposer.", "q1r": 4, "q2": "The roadmap, as well as a roadmap could be realized for something with this many emergent qualities, is clear and well laid out, beginning with a phase 0.  The final iteration is murky, but that is to be expected, as the design will determine a lot of that, and the design is going to be emergent.  It would be nice to see a test-net rollout schedule for a few of the items, particularly the PRISM integration, and SC involved in the DAO governance.  An early litepaper that can be rolled up later into a full whitepaper is a critical early deliverable, and probably defines the website design, alongside onboarding DID participants.  There will need to be a tokenomics, probably iterated in the DAO governance, but a litepaper should be issued for that as well.  All the work will be trackable on GitHub and the Agile framework (sprints, user stories) means that auditable protocols can be defined for the monthly progress reports.  The main success metrics included in the proposal are...interesting.  But one can look closer to home for real success and impact, and forgo static numbers in some far off future:  does the adoption of UBI DIDs have a good rate of increase or decrease?  What participation rates are we seeing with the voting protocols?  Is the UBI yield keeping up with participation rates?  When in an inflationary mode, how well is it tracking with things like CPI reports or CPI tracking ETFs?", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This project would accelerate Atala and D-IDs, however there are several large assumptions that are not fully addressed. Mainly the retailer adoption, there isn't anything mentioned for a plan to acquire these businesses into the network. Additionally the income is not specified outside of CPI correlation to create a commodity stablecoin. This Basic Income project would be a wonderful addition, though currently it is a rough gem that needs polish. ", "q0r": 4, "q1": "There is little chance of one person completing all of this roadmap on time. There isn't any description of how this project would hire or find the listed talent. Full Stack development isn't enough for a complete Cardano protocol. Nor is only 200 hours for the core code. \nThe roadmap does mention third party delays, yet is underestimating these delays. The largest question in implementation is how the treasury will be funded, outside of grants and donation.\nThere is an abundance of detail in this plan, it is well thought out. However there needs to also be traction. Realistic stepping stones that can be used to build a mountain of adoption. ", "q1r": 2, "q2": "This spot is always the most difficult section of proposals. However, this is unrealistic, has no timeframe, and isn't easy to verify.\nThese goals need more work and definition. Needs to be measurable, and have a source to verify progress. Voters should be able to look back and find an obvious goal that is being worked toward.", "q2r": 1, "assessor": "z_assessor_1326", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Project aims to accelerate the adoption of decentralized identity by offering universal basic income (UBI). But the proposal doesn’t seem very strong as it does not have a very concrete plan on how to raise enough funding to provide UBI for a meaningful number of people in order to drive adoption of DID. Just an example here, let’s say the goal is to provide $12,000 a year per person and an average return of 5%. That would mean $240,000 in the endowment fund to provide basic income to one person to onboard to Cardano and DID.\n\nWhile it is a noble goal, perhaps it does not drive the adoption of DID as well as one might hope. The proposal is also very focused on how UBI could work with Cardano and existing projects so it might be better off under another challenge category and maybe consider teaming up with other proposals as I’ve seen some myself too.\n", "q0r": 3, "q1": "Proposer has a lot of experience in very senior roles at Instacart and Workato so it would no doubt be very helpful and could probably build all that he wants to. Proposal is also very meticulous in the breakdown of the work required and timelines.\n\nOne thing to note however is that it is currently a one man show, so it does seem like a lot of work to carry out. The discord invite for potential collaborators put in the proposal has also expired so I can’t say how many potential collaborators he might have found.\n", "q1r": 4, "q2": "The proposal is a little vague in this regard, it did not mention if the code will be open source for inspection but only mentioned that it would be broken down into 1-2 weeks worth of work, which I presume he could update the community on?\n\nMaybe unrealistic but there is ambition in his goals and wants to be the most downloaded crypto mobile app on android which can be tracked and to provide basic income to 1 million people.\n", "q2r": 3, "assessor": "z_assessor_2026", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Yes, this proposal effectively addresses the challenge. The proposer does a good job at identifying the specific components of the challenge brief they are hoping to address, primarily: launches in 2022, discovery of repeatable patters, number of issuers/verifiers, and number of verifications performed. \n\nFirst off, I want to commend the proposers on an innovative idea that has the potential to deliver sustainable universal-basic-income (UBI) solutions. The creation of a DAO that is open source and non-profit will allow a large collective of people to grow and participate. Through the DAO, members will be included in investment decisions and earn rewards for participating. The treasury would then follow the decision of the DAO and make the corresponding investments, after which, all members of the DAO would receive some sort of payout from the profits. \n\nSecond, I think the team brings in an interesting aspect to this proposal by pegging the reserve currency to the consumer price index which would be verified by on-chain oracles. This type of autonomous information gathering will ensure that the indexed price remains static and reliable, with clear intervals at which it will be updated. The use of oracles in this way is interesting and I would have liked more details to be provided on the specifics. \n\nIf the team is successful and is able to structure the DAO in this way, and show that a UBI is possible through this proof-of-concept, then the impact would likely be significant on the community. ", "q0r": 5, "q1": "Yes, given the experience and plan presented, it is likely that this proposal will be implemented successfully. The team does a good job at breaking down this monumental task into smaller quarterly milestones with deliverables. Their initial efforts will focus on getting the DAO, tokenomics, and overarching plan structured and in the hands of members to refine the material. The development of their litepaper will help answer some of the outstanding questions so I would have liked to see more of a skeletal outline for the litepaper (even just broad headings). \n\nThe majority of the work will come in Q3 2022 where the team will implement the reserve currency protocol, and they will use existing open source protocol designs to avoid duplication of work. This adds some weight to the feasibility of the project because they can identify which protocol works the best for their case. However, the feasibility is somewhat called into question given the reliance on outside entities for its completion. Additional detail should be provided regarding the process to make the DAO a legal entity as well as the audit and certification permissions. I appreciate that the team admits these can impact the timelines but more could be shared regarding the plan to pass these milestones. \n\nOne final issue that may challenge the feasibility of the project is finding other likeminded individuals who are motivated to work on the project. As it stands, it currently seems like a one-person team that is trying to expand, however there is no strategy for attracting more individuals other than a call to participate. I think a little more forethought into the types of people you are looking for and for which items would strengthen this section. ", "q1r": 4, "q2": "Unfortunately, the information provided is neither sufficient nor insufficient to audit the progress and success of the proposal. To audit the proposal the proposer commits to using a simple agile backlog to manage deliverables in 2 week sprints. They will then issue written user stories ahead of the sprint start. However, what they will actually be measuring in the backlog and what the user stories will include/focus on is unclear. There is also no indication of how many user stories will be needed. \n\nAnother issue which voters may take here is the KPIs/success measurements provided. There are no real KPIs highlighted and the success measurements are abstract and highly idealistic. Other than the stories stated above, it is unclear what sort of indicators would be used in the proposal. With a heavy focus on the website and dApp, I would have suspected that these would be tangible measurements for the project (number of users, visits, transactions etc..) but they are not included. In addition, the success measurements to \"become the most downloaded crypto mobile app on Android store\" and \"provides basic income (of some degree) to at least 1 million humans across multiple countries\" really are not tangible. For example, do you mean most downloaded of all time? Within a particular time frame? How much income equates to \"to some degree\"? and what if you don't reach one million people? Is it a failure?\n\nThe proposal is strong and is on the right path with some innovative thinking, however more information is needed in this section to increase the score. ", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a DAO token which will be pegged to Consumer Price Index, treasury would be invested in Defi and share profits with holders & humans.", "experience": "15 years in Web 2.0, currently a software architect at a silicon-valley startup, experience in Engineering, Product and Customer Success. This includes 6 years at Instacart as a Sr. Solutions Architect working with complex enterprise, payment systems, high throughput Web apps."}