{"id": 401428, "author": "catsper", "title": "Boost Personal & Business Adoption", "url": "https://cardano.ideascale.com/a/dtd/401428-48088", "category": 26443, "amount": 18506, "description": "The rate of adoption of decentralized ID & Verifiable Credentials is limited by the amount of people who have a good user experience.", "f6_no_assessments": 6, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 724, "q0": "The suggestion here is that people will want a transaction history for themselves, or that a business will want a transaction history for itself.  I'm not really seeing what the role of DIDs and VCs are in this implementation.  Presumably the proposer wants either Identity wallets that make transactions, or transaction wallets that can hold identities (not as easy as it might sound).  Even if the solution is two wallets interfacing with eachother, or an Identity wallet working with a transaction backend (a user goes to the trouble to have an identity wallet, but not a regular crypto wallet?), I am still not seeing the incentive for the DID.  Tx history is already available to both parties, and DIDs and SSI don't give access to that information for others unless the protocols call for it, but that would be a massive privacy bust.  One of the solutions that the proposer says they are pursuing is to make the whole experience better for end users, but I fail to see how adding complex DID mechanisms as an overlay to just a plain, anonymous, crypto-wallet transaction makes it better.  The claim here is that it adds security, but what security is provided that you don't already have with crypto?  Digging into the FOS whitepaper they include only muddies the waters even further.  With multiple technology rollouts stacked on one another I saw glaring weaknesses that are never addressed, particularly the need to onboard stakeholders that in my mind would have absolutely no incentive to onboard to the technology. They give the example of scanning a QR code to pay for a cup of coffee, the implication that this would work for everyday stuff.  No mention of where the QR code comes from or what funds you tapped to pay for it, but ignore that for now.  The real issue is that this \"Infinity\" protocol has to be the system both parties are using, not just one.  That means either the coffee shop is running their BTS protocol, or your freaking bank is.  The implication throughout the whitepaper is that banks will be running this.  How else to get the transaction qualities he is suggesting?  The other implication is that big exchanges like Coinbase will be using this.  Again, what possible incentive do these guys have to abandon Visa, or standard wire transfers?  Fees?  They don't pay fees, they COLLECT them, users pay fees.  And of course users want something else, that is why they adopt crypto and see promise in ideas like this, but unless the other side also adopts it, these everyday use case just aren't going to happen.", "q0r": 3, "q1": "There isn't enough explanation of just what the technology stack is as presented in this proposal.  After doing my own leg work to dig up their past proposal and find their whitepaper to try to understand their references to \"Infinity\", I have come to the conclusion that DIDs are not something that can integrated into the stack as they are describing it, and furthermore have no role in the stack.  The included timeline gives no actual architecture buildouts, no descriptions of what is needed to create the decentralized ID wallets.  The wallets, a UX, and Infinity development are all listed as if they were standard line items ,and the budget doesn't help either with little granularity and costs broken down into just monthly salaries.  For the claims provided of executing POS transactions out of an Identity interface of some kind, with no suggestion that both parties need to be using all the same protocols, and explicit suggestions that they certainly don't need to be using the same currencies (implying crypto is on the table), the technology explanation simply needs to be made clearer, especially the part about the DIDs.  When you take into consideration that this is a one man team (maybe with one friend added) the scope also seems to start seeming like too much.  The budget doesn't seem unreasonable for a mid-level project, even as just one phase of funding, but I would have liked to see much more granularity, especially around the development sprints to give an idea of what exactly is being built out here...", "q1r": 3, "q2": "They tell us that the execution phase (basically all of the development work, I think) is broken into submodules, but they haven't been included.  It is possible that one missing element may help explain much of what doesn't line up here.  They don't list any relevant KPIs except for the release of a Beta to test, but that isn't until almost 2 months into the project.  Also, that beta seems to be the deliverable for the project, presumably with some successful testing layered on, but they don't indicate exactly makes for a completed project except to note that it will be used by end users.  Something that would be handy here might be the expected test cohort for the Beta, or the onboarding of specific businesses to be running the POS, or a target for how many businesses they want running it.  The onboarding of the businesses and whoever is the holder of DIDs, especially is the make or break element to the underlying protocols, so a deeper explanation of their incentives and how many could be onboarded with those incentives would be a KPI for sure.  They indicate they will be keeping the community up to date, and the whitepaper suggests that they will be seeking as much funding through Catalyst as they can, so no doubt they are incentivized to follow through.  The biggest concern is the unknown state of the underlying Infinity architecture, the reliance on that for this proposal, as it was only just funded in Fund7.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2552, "q0": "This proposal seems like a great idea to bring businesses more potential growth from the Cardano network and ecosystem, but what makes it differ from the already existing Atala Prism? Having businesses and personal transactions on chain with identifiable credentials is reassuring to the buyers and sellers, though it may be more difficult finding those interested to partake and the adoption into another Cardano based system (Infinity). What's the key differences with this app compared to the existing Atala Prism app already developed? The proposer seems to have a better understanding of the challenges than the average person might come to realize in with the future use case of said app developed. Explaining this to a business owner on how they could potentially benefit from using a Cardano based application, might leave them scratching their heads. With an easy to use App for these individuals who want a secure and verifiable way for transactions and identity, will this app have any educational tools that explain it's importance to adopt blockchain technology over other resources? As we're still early to mass adoption on a global scale, it's unclear how this app could be implemented or advertised; at least to a broader audience beyond the existing Cardano community. Apart from adding value to the Cardano ecosystem, it is not clearly detailed on how much of an impact the proposed idea will have in the coming months, as it may take longer if not years for user adoption for proposed services.", "q0r": 3, "q1": "In regards to feasibility, this proposal seems to be lacking major detail. Credentials of one individual/proposer is not necessarily enough information to realistically accomplish the timeline given to be completed. As it states, an additional 4 members will be needed for the successful development of an App. What's the app's name? Are these members not yet acquired or has there been contact with said future developers for the completion of all phases? It would be beneficial to know what credentials they may have in regards to App development and UX Design and the creation of a \"user friendly\" interface upfront. Having some type of website that may outline such plans would be better to have within the proposal to follow the progress of the timeline defined or at least the existing infrastructure behind the capabilities of the app. With these details, it would be easier to say these are reasonably achievable feats to be finished within the set parameters from the proposer. As the proposer may be well versed in \"a clear technical understanding of Atala Prism, Self sovereign identity (SSI), verifiable credentials (VC) and decentralized ID\", these very crucial technical aspects are not present within the proposal itself and additional research is required.", "q1r": 2, "q2": "The proposer has made a clear and precise timeline that does give key dates that which development and phases will be pending completion. It is defined that this roadmap of development may take up to 5 months to complete if all goes well. One thing to note with uncertainty is presented here; \"The schedule of the project outlines major milestones and parts of the execution and deployment phases that have dependencies\". Basically, each phase depends on one's previous success to move forward, starting with planning within a 2 week period for an estimated cost. This period of planning could be explained by the proposer for the Catalyst voters to better understand what might be involved that merits such costs. Furthermore, the proposer understands the risks and challenges in developing the backend services this app will require, but any new unexpected challenges that may arise are not mentioned nor any solutions to them. Having a link to the Infinity Project of Catalyst Fund 7 would provide a better understanding and seems essential to this proposal's success. A more referenced background in the fields of expertise could be useful to the voter's decision on this proposal as it stands.", "q2r": 2, "assessor": "z_assessor_1529", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 5663, "q0": "The proposal fits well with the Accelerate Decentralized Identity challenge. The problem solution is clear: \"A Point of Sale interface that enables businesses and individuals to transact together with the assurance of identity credentials.\" This is a very high priority development for Cardano community. If successful this proposal will bring in many business and users into the Cardano ecosystem through the use of Atala Prism, POS systems and likely into Catalyst as well once these new users become more aware of Cardano. ", "q0r": 5, "q1": "The proposal includes relevant background experience of the proposer, including Plutus pioneer, Atala Prism pioneer (cohort 2). It is likely the proposer has the technical skills to deliver on this proposal, however, there is almost no explanation of the architecture or technical requirements for this implementation. It is not clear if the proposer has a firm understanding of the technical and legal challenges that would be present in this project. There is mention of \"the infinity project\" but no links to relevant websites or a detailed explanation of what this is. There is a budget breakdown for planning, development, and testing, but very little detail about what this requires. ", "q1r": 3, "q2": "The Auditability of this proposal is not clear how the community will track progress. They proposal includes; \"Regular updates will be given on the status of the activities in the project timeline so the community and Catalyst can measure progress. One of the major KPI’s will be a beta release milestone for testing.\" This unfortunately does not include specific quantifiable metrics that the community can track and audit. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5943, "q0": "The proposer has identified a problem and a solution to the problem but, from my perspective the proposal seems that it doesn't fit into the Challenge brief. It is unclear what is the added value to the Cardano ecosystem by developing a \"point of sale\" (what is meaning of it?) to facilitate transactions between entities using some identity credentials. There are some swap tools that can do transactions without people knowing who they are (trustless). Some goals for this challenge could be to create a system that uses Trust Registry, Community member recognition and onboarding process, Establishing Individual Reputation etc. in domains like Education, Food supply chains etc.", "q0r": 2, "q1": "From the references provided it is unclear if the proposer has the necessary experience to implement this proposal. Some developers will be hired but, from my point of view, other team members are required to support this project (marketing at least, to promote the app on the spotlight)\n\nThe budget is broken down into identifiable items and there is a timeline with achievable milestones. It is unclear what the Audit phase will check (it is a third party or just some internal QA?). Testing phase could last more than one month as it is necessary to collect and review enough data to create a viable product.\n\nThe proposal doesn't clearly explain technical aspects like architecture, language and technologies if they are crucial for implementation. (is there a framework that it will be used to develop the app? which one?).\n\nThe proposer has not considered challenges and risks relevant to a successful implementation. (any legal constrains for collecting and storing credentials - personal data protection; who is the issuer of the digital credentials? etc.)", "q1r": 3, "q2": "There oare no KPI/metrics defined to measure the success of the proposal (who is the specific target audience? How many people are expected to onboard in a predefined time frame? How many people are expected to stay for a period of at least 6 months since their onboarding?)\n\nThe proposer needs to clarify some aspects of the proposal to make it viable for funding.", "q2r": 3, "assessor": "z_assessor_309", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7711, "q0": "This is a very good idea and relevant for the challenge by trying to identify a way to promote DID to users and businesses. The proposal identifies a problem within the challenge which needs to be solved and articulates how to add value to the Cardano ecosystem.\nHowever, information is still missing to understand the impact on the challenge and how it connects/is aligned with technology development already available. For example, what are the key metrics for the proposal is not clear and how it will scale going forward. The proposal just focused on the development phase and unless I missed something all the commercial validation, POC and go-to-market are missing. \n", "q0r": 3, "q1": "The proposer seems to have a very relevant background and experience mainly as a developer and part of Plutus pioneer & Atala Prism pioneer (cohort 2). He also has a related fund 7 proposal (it could have been helpful to have the link to the proposal, but I found it https://cardano.ideascale.com/c/idea/384839). Linkedin profile is provided but not with a lot of info or connections (only 5). \nThe proposer is a sole proposer and it does not include more team members. Based on my experience as a tech entrepreneur interaction with other team members could be important mainly as the app focus on businesses and end-users and not only as a tech integration.  \n\nThe budget is outlined clearly and broken down into identifiable items. The budget focuses only on the development phase and does not include any feedback sprints from users or stakeholders. How do we make sure what is being built actually serves the users? The plan describes the resources necessary to implement only the technology part of the proposal. The proposer has mentioned the key important knowledge set needed as part of the challenges which is again is only part of the solution. What we will do with tech development without a marketing validation and go-to-market approach?\n", "q1r": 3, "q2": "The roadmap with milestones and a time horizon for achievement is mentioned but not in much detail. “One of the major KPI’s will be a beta release milestone for testing.” It is not clear when is the Beta release. “Progress can be measured by the project's developers to stay on schedule and complete activities.” - where and how the community can evaluate this? Is it open source?  “Success is ultimately measured by adoption of the product and the services it provides.” - how you are going to reach users? What are the KPIs and estimations for usage? \nThere are many details missing for me to have high confidence about the audibility of the proposal. Focusing on a specific use case with more details about the KPIs (including user KPIs) and deliverables world have been helpful. \n", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8283, "q0": "This proposal moderately addresses the challenge. The proposer suggests that the development of a dApp build on the \"infinity backend\" will allow identity to be integrated into personal and business transactions. Unfortunately, the proposer gives no indication of background on the infinity backend, what form this dApp would take, and how identity would be integrated via Atala Prism. This makes it challenging for voters to have confidence that this project would have an impact. What would be the motive for people to use your dApp compared to others being built? \n\nAnother piece of information missing is the linkages to existing efforts on Cardano. For example, the proposer suggests they will leverage payment networks being built on Cardano but none are identified and there is no evidence that these projects are not already undertaking similar efforts. In order to increase the impact score, I would encourage the proposers to provide more specifics as to why their solution is needed (such as due to a lack of viable options). In its current format, the proposal suggests that such a gap exists yet does not justify that claim with any information for voters. \n\nFinally, the proposers should provide a better mitigation strategy for their identified risks. Given that there are several components pivotal to the success of the project (a clear technical understanding of Atala Prism, Self sovereign identity (SSI), verifiable credentials (VC) and decentralized ID (DID). Product design, user experience and an essential understanding of how the Infinity project structures its transaction payload) I need to see how you plan to address each of these since the failure of one may threaten the impact of the overall project. ", "q0r": 3, "q1": "Given the experience and plan presented it is moderately likely that this proposal will be implemented successfully. The project is only expected to last 17.3 weeks as per the proposal, and is broken down into three phases, each to be completed sequentially. Given that the proposer does not necessarily have the required skills to complete the project on their own, I am surprised that there is not a discussion of how new members will be brought to the team, including identifying, onboarding, and working. This lack of information may have voters questioning the feasibility of this project as there is a level of trust needed, that I'm not sure has been met. \n\nAnother reason why I am only giving moderate scores here is that there is no explanation of what the dApp actually is, how it will operate, and how it will be placed into the hands of people who need it. It's good to say that identity will be linked to transactions through the dApp but is that enough? How will the identity be issued? Who will verify the identity? Why is this dApp preferable to others? Without more specifics on the shape it will take, it is impossible for voters to understand if what is intended is feasible. ", "q1r": 3, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. By structuring the proposal in phases, the community can follow along to determine whether they are delivering on their stated objectives. It is also a good sign that the proposers are committing themselves to regular updates on the status of activities, timeline, and progress. However, it is unclear which mechanisms will be used to get this information out to the community; including specifics on auditing opportunities for the community would be beneficial. \n\nI think where the proposal falls just a bit short of full marks for auditability is the measurement of success. The proposers say that success is ultimately measured by adoption of the product and its services but there are no indicators for what this actually means or how it will be measured. Would 4 users be enough? 400? What is the threshold? Would you be using transactions on the app? If the goal is to accelerate decentralized identity, there should be a direct indicator for the community to follow to know whether or not the project was a success. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A Point of Sale interface that enables businesses and individuals to transact together with the assurance of identity credentials.", "experience": "Many years experience in software and scientific research & collaboration.\n\n10+ Years Software Development.Smart Contract & Defi developer.PhD Mathematical Physics, BSc Computer Science.Catalyst 7 funded project - InfinityPlutus pioneer & Atala Prism pioneer (cohort 2)"}