{"id": 405198, "author": "dag062980", "title": "General Purpose Identification", "url": "https://cardano.ideascale.com/a/dtd/405198-48088", "category": 26443, "amount": 14000, "description": "With the creation of DAOs and other autonomous organizations, roles needs to be verifiable and unique.", "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"id": 5114, "q0": "Having a unique way of identifying and certifying someone's role is addressing a relevant issue, particularly that of credential verification in the context of community advising. This has the potential to further optimize the workflows within Cardano and ensure that trust and transparency is established in a public space. Moreover, the proposal addresses the important issue of conducting governance and voting, by uniquely identifying individuals with certain roles and permissions. It is however unclear to the assessor how this proposal aims to develop an optimal user experience interface for maximal engagement and adoption and how it will be integrated with Atala prism and other existing platforms.", "q0r": 4, "q1": "In general, the timeline for the implementation for the project is rather vague and there are no short or mid term goals. Moreover, it is not clear to the assessor how the \"one-time-locking\" of the minting script will be ensured. If this is not the case and minting can happen more than once than the whole idea is crucially undermined. There have been interesting proposals in this domain to ensure NFT's are uniquely generated minted for certain users but it is unclear whether the proposers have engaged with this. The technical background of the proposers is also not clearly laid out, even though the two team members have been in catalyst, no technical background is described and the linked GitHub page is unfortunately not accessible. Pushing for adoption and developing a community is an excellent goal, but the plans for using Discord are not laid out in any detail, so one is left to speculate what the proposers have in mind when trying to engage and build the community. The fact that additional team members are being sought is excellent, but there need to be more concrete and specific plans, particularly given the technical nature of the proposal. The fact that a PoC has been shown is great and seems to suggest that this idea has already taken shape.", "q1r": 3, "q2": "The proposers suggestions imply a lot of transparency with regards to assessing the progress and success of the proposal by suggesting that the reports will be onchain, as well as tracking the user engagement in Discord. The worry is however that given the vague nature of the initial proposal and its implementation, that it will also be hard to track what is actually being done and achieved. It is not quite clear what \"Community Engagement\" and \"token tracking\" are referring to and the assessor would have loved to read in a bit more detail about the ideas of the proposers. ", "q2r": 3, "assessor": "z_assessor_1860", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 757, "q0": "There are too many things wrong with this proposal to list them all, but let's just try the absolute lack of DIDs and the absence of any description of a trust registry.  I know, I know, if there are no DIDs why do we need a trust registry?  Because the implication here is that a time-locked NFT minting script could be used to create verified IDs, or to verify transactions, for admittance to a server channel or to release funds, presumably in a smart contract.  The only info needed is a 4 digit pin....  but how do we know the person transacting is the one we want to have the pin?  How are pins linked to the channels in the first place?  An issue with any attempt to use blockchain hashes for verification is that verified is only half the information we need for something be private and secure.  The other half is \"authenticated\".  We take the second half for granted when talking about NFTs and token tx, because the fact it confirms is proof of the underlying protocol.  Oroborous is what is authenticating those IDs.  But with \"identity\" transactions, the actual protocol isn't the blockchain transaction, it is the relationship between issuers, holders and verifiers, and these have to be authenticated by the logic (trust) of that relationship, whether it is DIDs or not.  For this DuckID, these roles are useless to apply, because authentication is taken for granted for one or more of the parties (and good luck parsing which one that is from the proposal).  I left it at two stars on the chance that I have completely misinterpreted this confusing proposal.\n", "q0r": 2, "q1": "The budget breakdown doesn't add up to what they are asking for, the timeline is for an already issued token and creation of a simple 6 line script, and there is no plan provided or any actionable items except handing out tokens in an unknown way to community participants for unknown reasons.", "q1r": 1, "q2": "Following the token issuance of a random minting script and searching around for activity in Discord servers is no way to measure the impact of DIDs or their absence.  Likewise, discord servers and token minting (see how I flipped those around to make them different?) also don't measure any kind of decentralized identity impact.", "q2r": 1, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7162, "q0": "I agree that such a proposal is in accordance with the challenge set due to the fact, that the proposal aims to provide a DID minted on the blockchain. Also, it has been already implemented. \n\nThe problem-solution is clear - verification of users or members of DAOs or other organizations. \n\nAnother positive fact is that target groups (DAOs, or other autonomous/decentralized organizations) are constantly evolving, so we can assume an increased demand for DID solutions. \n\nWhat I am missing, is that the proposer did not reflect on contribution and bringing value to Cardano, and since it is already implemented, not much is elaborated about the future progress - how do you plan to identify patterns? What patterns to begin with? Is it related to human behavior? If so, is it really in accordance with the challenge to accelerate DID? ", "q0r": 4, "q1": "The LinkedIn profiles are present, and I find them sufficient for achieving the goal- because it was already implemented. \n\nThe budget of 14k is divided into sections, which are lacking more details, the roadmap/timetable is missing and since the project is already implemented, the question is - why does it require funding? \n\nImplementation to discord and github is the only explanation, yet more details and technical aspects are missing. ", "q1r": 3, "q2": "Since we can measure and record on-chain data, it will be easy to audit the outcome. But it will be difficult to audit the progress since no roadmap or key metrics are provided. \n\nSince the project is already running, it would be nice to see some progress on users, where do proposers see these numbers in the future, and such. \n\nSuccess could have been elaborated in more detail aswell - how many users, platforms, organizations involvement?", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8290, "q0": "Yes, this proposal effectively addresses the challenge and is aimed at identifying role patterns in organizations with particular focus on the Catalyst ecosystem. The team proposes that their DuckId will allow DAOs, and similar organizations, to request unique custom verifiable credentials which add identity to blockchain transactions. \n\nBy linking identity to these transactions individuals will be able to use this system to release funds, assign roles, establish trust, and participate in voting. This continues to be a critique of the Catalyst process, as there is a lot of anonymity, resulting in increased workload and decreased efficiency. However, what I am lacking from this proposal is an explanation of how their solution will do that. What is the incentive to use DuckId rather than another solution being proposed? How would it be used to sign the transaction? What are the impacts for the ecosystem that your solution would deliver? \n\nThe links to the example identification are interesting but I think more detail could be provided to voters describing how it would be issued and used. If the proposal is \"aimed at identifying patters in Catalyst\" how does DuckId do this? What is the end product that voters can expect? I would also encourage the proposers to expand on their identified challenge of \"hesitation to applying identity to roles vs. people\". As behind each CA, vCA, Proposal, is an actual person, this point leaves me a bit confused. \n\n\nI ", "q0r": 4, "q1": "Unfortunately, given the plan presented it is neither likely nor unlikely that this proposal will be implemented successfully. There is no real plan presented but rather a high level idea \"begin issuing tokens to CAs\" and then follow up in Fund9. I fail to see how just issuing these tokens would be enough to run the pilot. What will you be looking for? Will you have particular instructions for how they use the system? Who will be issuing the actual IDs and where will that information be held? \n\nI would have liked to see the proposers also include some sort of insight into their current engagement with the community and what type of response they have received from the communities which they seek to study. Have you participated in any community discussions regarding the need for ID in the CA process? How would your solution be introduced and implemented? Will you focus on all CAs or just a sample? \n\nThe proposers should also have included a timeline for when this work will be completed. As written they suggest issuing tokens now to CAs and then follow up with a stronger plan in Fund9, but given there is no indication of this experiment being fully ready to go (at least not on the community side) I do not see how that would be possible. I'd encourage the proposers to make this explicitly clear so voters are not left to fill in the gaps. To that end, including specific tasks to be completed by the team as you work towards the final stage would also go a long way to explain to voters what you plan to achieve and how you plan to do it. ", "q1r": 3, "q2": "No, the information provided is not sufficient to audit the progress and success of the proposal. The proposers may have a good grasp on what they are doing and what they are trying to achieve, they have not adequately provided a clear path to realizing their solution. The proposal is a good idea but there are too many blanks that voters are left to fill in. \n\nWhile I appreciate that the proposers commit to listing their reports on-chain that can be audited via policy number, it is unclear what the community would actually be auditing. What are the targets you are trying to reach? How would you measure these targets and from what baseline? Currently, this information is absent from the proposal and leaves me with many questions. \n\nThe vision of success for the project is also very abstract and does not provide a tangible means by which to know if it has been achieved. \"Community engagement and token tracking\" is not really a success indicator. Are you only focused on CAs here as well? What is the ideal level of engagement? How many tokens need to be issued and tracked? Without this type of information the auditing section is incomplete and insufficient to receive higher marks. ", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create one time-locked minting script used to create an ID system that can be used for TX validation and account management. ", "experience": "Deryck Lance- Linkedin profile can be found at https://www.linkedin.com/in/deryck-lance-9405898/ Atala Prism Pioneer\n\nDominick Garey-Owner Nehemiah Construction. Current Plutus Pioneer Student\nwww.linkedin.com/in/dominick-garey-878a65117/"}