{"id": 381139, "author": "spiralway", "title": "Nourish LATAM: Spirulina & Cardano", "url": "https://cardano.ideascale.com/a/dtd/381139-48088", "category": 26242, "amount": 50000, "description": "Недоедание в Латинской Америке находится на самом худшем уровне, COVID-19 угрожает наличию продовольствия и экономическому доступу к качественным продуктам питания.", "funded": 0, "upvotes": 14841985, "downvotes": 22414535, "votes_result": 7572550, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 2.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "По мнению автора этого предложения, COVID-19 ухудшил доступ к качественным продуктам питания, что привело к высокому уровню недоедания в регионе, и да, я согласен с этой гипотезой. Однако я бы ожидал от такого рода предложений предоставления соответствующих данных в поддержку своих утверждений. В качестве решения этой проблемы команда уже разработала недорогие фотобиореакторы для производства спирулины, которые будут распространены в регионе для содействия децентрализованному производству. В предложении также упоминаются планы по интеграции с Coti-Pay, созданию DApp и интеграции с SingularityNet для генерации оптимальных моделей выращивания спирулины. На мой взгляд, предложение чрезвычайно амбициозно, но в случае успешной реализации оно имеет большой потенциал.\r\n", "q0r": 4, "q1": "Из предоставленной ссылки следует, что бизнес работает, поэтому с этой стороны я поздравляю команду. Однако не было предоставлено никаких ссылок для проверки навыков и опыта автора и команды. Что касается индустрии спирулины, я не беспокоюсь о знаниях и опыте автора, однако, когда речь идет о его знаниях в Haskell, Plutus или SingularityNET, нет никаких доказательств способностей команды или другого члена команды. разбивка бюджета показывает 3 основных раздела, где один из них предназначен для разработки dapp, но опять же не ясно, сколько разработчиков они планируют нанять и в какие сроки они ожидают разработку. Это затрудняет проведение оценки целесообразности. Для будущих циклов катализатора я рекомендую команде представить поэтапный проект таким образом, чтобы сообщество могло точно оценить осуществимость.", "q1r": 2, "q2": "Что касается проверяемости, то здесь говорится лишь о том, что ожидается, что технология будет готова к середине 2022 года. К сожалению, нет никаких упоминаний о конкретных показателях успеха в отношении воздействия, к которому они стремятся. Например, сколько PBR они планируют построить? Приблизительно сколько PBR они планируют распространить? В разделе идей они упоминают 3 разработки (которые, с моей точки зрения, можно считать отдельными предложениями). Не могли бы вы описать, на какой стадии разработки они будут находиться в это время? Какова будет структура отчетности? Чтобы обеспечить сообществу возможность аудита реализации проекта, я рекомендую команде задавать себе эти и многие другие вопросы в будущих циклах катализаторов.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 21, "ne": 11, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "Malnutrition in Latam is at an alarming rate, the proposal refers to creating a quality food source to improve immunity for the people here. The given problem statement is defined and involves most aspects of the challenge. Growing spirulina in decentralized bioreactors could be the solution to boosting the immune systems of millions of people in Latam. The solution given is reasonable and solves the problem", "q0r": 4, "q1": "This is a really good proposal, however, to get funded I think I need to have a clearer plan of the roadmap, the indicators to measure success, as well as the people who make the proposal. this. It seems that it is necessary to seek more cooperation of experienced people to make this project more feasible\r\nThe proponents did not provide any information about their skills and experience. More background and proof of your experience is necessary for the community to believe. The proposal does not take risks into account.", "q1r": 2, "q2": "As stated, auditability is low because it does not show the roadmap with development plan, detailed explanation of each step, milestones and delivery of each part. Not having a KPI would make it more difficult for us to audit.\r\nThe budget is not reasonable and is not broken down into identifiable amounts. In order to receive funding, I recommend clarifying the allocation of funds, the more detailed the better", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "I fail to see how this proposal is alligned with the challenge. It seems like a good business plan based in Chile and scalable to other countries in Latam but I don't see how it helps to grow Cardano's community or adoption (other than the payment to PBR operators and opening payment for product in ADA)", "q0r": 1, "q1": "The proposal doesn't provide any details on the market they plan to sell to. It would be a good adittion to the plan to talk about the demand they expect and the price the customers would be willing to pay. Comparing this to their estimated cost of productions could give the reader a better understanding of the feasibility of the project.\r\nIt would be good to see clear KPI's are provided that can be used to assess success torwards growing Cardano in Latam.\r\nThe budget requested (50,000) seems elevated and no details are provided so justify the amount.", "q1r": 1, "q2": "The proposal could use a section adressing how the community could verify the promised use of the funds and how the implementation and success go.", "q2r": 1, "assessor": "z_assessor_740", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "Спирулина, выращиваемая в фотобиореакторах децентрализованным способом, может стать решением для укрепления иммунной системы миллионов людей в Латинской Америке.", "experience": "Предприниматель с многолетним опытом выращивания спирулины и технологий IoT, блокчейн и фотобиореакторов."}