{"id": 382189, "author": "fhilip.k", "title": "Spanish/Portuguese Voter Survey-AIM", "url": "https://cardano.ideascale.com/a/dtd/382189-48088", "category": 26242, "amount": 10500, "description": "Информация об избирателях, специфичная для Латинской Америки, недостаточно хорошо изучена, необходимо больше внимания уделять глобальному вовлечению избирателей Catalyst.", "funded": 2, "upvotes": 70969382, "downvotes": 13669170, "votes_result": 57300212, "votes_cast": 335, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Это предложение очень интересное и актуальное, хорошо отвечающее целям задачи. Важно учесть, что данная команда уже перечислила важные инструменты сообщества, такие как инструменты для CAs и vCAs, которые очень полезны для работы этих членов сообщества. Идея здесь была бы продолжением проекта, основанного ранее, на f6, который заключался в проведении голосования среди избирателей - потому что у них определенное поведение и так далее. В данном контексте идея заключается в том, чтобы возобновить это исследование для португальского и испанского языков, на которых говорят в Латинской Америке, чтобы понять, как это сообщество понимает и взаимодействует с Catalyst. Это принесло бы большую пользу жителям континента, поскольку улучшило бы процесс распространения коллективных решений, в большей степени ориентированных на латиноамериканскую общественность. И, конечно, это принесло бы большую пользу экосистеме Cardano, особенно если исследование будет проводиться несколько раз и совершенствоваться. Этот проект, безусловно, улучшил бы качество процесса финансирования Catalyst, что оказало бы положительное влияние на все сообщество Cardano.", "q0r": 5, "q1": "О сценарии: начиная с того, что очень полезно, чтобы они заранее сделали доступным исследование. Хотя это не совсем то же самое, это даст нам очень прочное начальное представление о том, что этот процесс должен создать, в приблизительном виде. Мероприятия, которые необходимо разработать для осуществления проекта, относительно просты, и можно прекрасно понять процесс, основываясь на сценарии и приведенных деталях. Положительным является то, как быстро этот проект даст результаты: по словам авторов, к концу февраля мы будем иметь то, что они исследовали и сообщили. Положительным моментом является и то, что они включили некоторые вопросы, которые можно было бы включить в опрос, поскольку это позволяет нам иметь более четкое представление о том, с чем мы имеем дело. Команда, задействованная в данном случае, безусловно, полностью способна успешно выполнить процесс. В этом можно убедиться на основании двух фактов: во-первых, поскольку они очень подробно рассказали о том, кто они такие, нам сообщили их имена, профессиональную биографию, то, что они уже сделали для сообщества Cardano (как я уже упоминал во время удара, они уже сделали инструменты, широко используемые CA и vCA, а также первую версию этого опроса, помимо других проектов). Таким образом, возникает полная уверенность в возможностях участников, поскольку помимо того, что они очень технически способны, они уже продемонстрировали на практике, на что они способны. Что касается бюджета, я считаю, что это справедливая стоимость проекта, он очень подробный, мы смогли понять, сколько идет на каждую вещь, и хорошо представить, как будет использоваться бюджет; на мой взгляд, в этом проекте нет пробелов, темы очень четкие и вызывают полное бюджетное понимание.", "q1r": 5, "q2": "Предложение легко поддается аудиту, авторы предоставляют ряд информации, касающейся аудируемости. В частности, это касается темы \"процесс\", где мы можем отслеживать ход разработки проекта, а также части \"показатели успеха\", где мы имеем информацию об ожидаемых конечных результатах. Поскольку это относительно короткое и простое предложение, которое в целом будет разработано за 2 месяца, если все пойдет хорошо, я считаю, что команда могла бы связаться с сообществом в два момента: как в конце разработки исследования, так и после получения его результата. Можно было бы провести опрос, оправдались ли ожидания, и представить его всему сообществу. Я также думаю, что может быть и третий контакт: через некоторое время, в будущем, команда могла бы собрать информацию о том, как исследование повлияло на изменения в Catalyst, как это пошло на пользу экосистеме Cardano и т.д.; это также должно быть доведено до остальной части сообщества. В целом, я считаю, что это очень проверенное предложение, отвечающее всем необходимым требованиям в этой теме.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 20, "ne": 14, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "The proposal focuses on consider region and community(Latin-America) based voters who are voting for the community proposals for funding, and the proposal indicates to improve survey by incentivising the voters and also by translate the same into Spanih and Portuguese. This would inturn improve the engagement of the Latin American community thus improving the increased number of voters as shown from fund 6 to 7", "q0r": 5, "q1": "The team AIM is has been responsible for one good Community tool kit and have delivered it in a great way. Also it has active members from community/catalyst working together as mentioned in the proposal, and have experience previously working and delivering in the same fashion", "q1r": 5, "q2": "They have provided a detailed information in the proposal including details of their previous work and surveys and corresponding results, They have also mentioned success parameters, road maps and milestoes. The proposal also holds details on budget breakdown and relevant info.", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 24, "ne": 4, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "I strongly agree the proposal is impactful. A survey about interaction between voters and Catalyst in Spanish and Portuguese will help us better understand about how the LATAM Cardano community sees, understands and interacts with Catalyst. These information definitely benefit Catalyst as well as Cardano ecosystem to improve over time. Additionally, the proposal is able to scale to address future challenges (executing in another regions for example) because voters play an important role in our system.", "q0r": 5, "q1": "This proposal is following the Incentivized voters survey which funded in Fund6 (link included), now the team aims to update and translate it into Spanish and Portuguese, so that feasibility should not be a big deal. \r\nSince the Fund6 proposal was successful, I compare between budget of this proposal and budget of the previous one in details and my conclusion this proposal's finance is very reasonable to achieve the set goals. The updating content is more diverse about voters behaviour, looks promissing about a more successful result in the specific region survey.\r\nTherefore, I trongly agree the proposal is feasible.\r\nI recommend the team should consider challenge and risk relevant to the successful implementation.\r\n", "q1r": 5, "q2": "The proposal provides roadmap with milestone and time horizon and time KPIs are outlined clearly, easy to see and easy to audit the progress of the implementation. \r\nI would like to know more clear about this: 'Fifty randomly-selected participants will receive $60 each. One respondent will receive $500'. So, is the $500 randomly also? Or any criterias for that?", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 17, "ne": 5, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The value of understanding Latinamerican Voters in undeniable, but I believe the contribution of this to the challenge of growing cardano in Latam is quiet limited since is aims at the already participating community. the main challenge is awareness in the region.\r\nOf course the insight gathered in the survey would only be valuable if there is a way to translate it into actions, it would be great to include suggestion on how that information would be used in that sense.", "q0r": 3, "q1": "-The proposal is very well structured and detailed.\r\n-The team behind it has the credentials to make it happen except for the lack of spanish and portuguese opening a risk of intepretation of the results. I'd respecfully suggest including local talent in the proposal.\r\n-The budget requested seems a bit high for the task at hand. Quite a bit of the budget is \"lost in translation\" from english to local language and then back to english. ", "q1r": 3, "q2": "The proposal is clear and detailed, easily auditable since the deliverables and timeline are easy to track.", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "It describes a good solution to resolve two actual problems, the first one: to improve the Catalyst Project Ballot trough numbers and data analysis; And the second: to make known the Catalyst Project to people like me that five weeks ago, I owned Ada but I didn't know anything about the Catalyst Project.", "q0r": 5, "q1": "They are active members of the community and their experience has been proved day by day through the Telegram groups and their active participation in the Town Halls. They have experience and Knowledge about what they are talking. I don't have any doubts that they are able to achieve it.", "q1r": 5, "q2": "They have described with detail what they pretend to do. They already have started on the last Fund and they are about to release the results,  they need support to finish and improve their project getting money in this Fund.", "q2r": 5, "assessor": "z_assessor_765", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Создать стимулирующий опрос на испанском и португальском языках для получения информации и использования этой информации для поддержки будущих улучшений Catalyst.", "experience": "Члены AIM являются командой, стоящей за созданием набора инструментов для сообщества."}