{"id": 383689, "author": "cole.vt", "title": "Sustainable LatinAmerican Use cases", "url": "https://cardano.ideascale.com/a/dtd/383689-48088", "category": 26242, "amount": 12000, "description": "Следует больше внимания уделять историям проектов Cardano, реализованных в Латинской Америке, их региональным проблемам и решениям.", "funded": 2, "upvotes": 65414323, "downvotes": 1711347, "votes_result": 63702976, "votes_cast": 191, "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Я нашел этот проект очень интересным и необходимым, часто существует барьер между теориями, рассказывающими о положительных изменениях, которые Cardano может реализовать в реальной жизни. Идея заключается в том, чтобы поделиться историями, в которых наш блокчейн сработал в Латинской Америке, что может принести пользу как континенту, так и экосистеме. Континенту благодаря тому, что после распространения таких историй все больше и больше людей будут знать Cardano и смогут вступить в сообщество тем или иным способом, либо через Catalyst, либо приняв ADA, используя наши NFT и многие другие возможности. Точно так же, как экосистема выиграет от такого рода пропаганды, целью здесь будет популяризация блокчейна и превращение его в нечто более осязаемое для латиноамериканского населения. Как утверждают сами авторы предложения, распространение этих историй повысит уровень доверия к блокчейну, что повысит вероятность присоединения новых участников.", "q0r": 5, "q1": "Команда, которая предлагает разработать проект, состоит из пары, они предоставляют подробное описание каждого, в котором мы можем понять их сферы подготовки, а также некоторые предыдущие работы. Хорошо, что у обоих есть исследования в области блокчейна; это дает нам уверенность в их способности успешно продвигать проект. Также здорово, что они разместили свои профили на linkedin, что дает нам возможность узнать их получше. Что касается бюджета, то они разбили общую сумму на более мелкие части, и каждая из них хорошо объяснена, за исключением темы цифрового маркетинга. Это очень скромная сумма, но было бы здорово, если бы мы поняли, что за кампания будет здесь продвигаться, как они будут использовать эти деньги для рекламы проекта и так далее. И, наконец, мы видим, что дуэт занимается предоставлением запланированного маршрута на месяц, причем каждый месяц достаточно подробный, то есть у нас есть задачи, которые будут необходимы для того, чтобы месячная цель была достигнута. Благодаря такой детализации мы смогли четко понять, как будет происходить процесс. Поэтому я считаю, что команда предоставила очень подробную информацию о том, кто они, как они будут использовать запрошенный бюджет и каким будет этаж проекта.", "q1r": 5, "q2": "Когда речь идет о проверяемости, команда предоставляет нам несколько способов отслеживания успеха проекта. В теме \"Как выглядит успех\" они подробно описывают, какого сценария они намерены достичь с помощью этого предложения. Я бы сказал, что в основном это признание этих историй, донесение их до членов сообщества и посторонних людей, как я понимаю, продвижение определенной сети контактов между командами и так далее. Они также предоставляют нам несколько KPI, которые могут быть полезны для составления более количественных и точных данных о том, чего вы хотите достичь. Таким образом, у нас есть много содержания, когда речь идет о мониторинге конечных результатов. Поскольку они также предоставляют очень подробную дорожную карту, можно также проследить за процессом, то есть за тем, действительно ли происходят те действия, которые обещали выполнить такие-то люди в такие-то сроки. Я предлагаю, если построить мост между этой командой и сообществом Cardano, вдруг они смогут участвовать в Town Hall, точнее, в дебатах после Town Hall, продвигаемых группой Catalyst Swarm, чтобы немного рассказать о процессе, например, о ходе деятельности и так далее. Таким образом, будет установлен постоянный мост, который позволит нам контролировать средства, а не только цели. Но да, я думаю, что команда способствует хорошей проверяемости с помощью того, что предоставлено на данный момент.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 11, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Sharing of stories of Cardano projects that have been implemented, and create a better tomorrow. According to the proposal, they are going to share stories of empowering people taking actions in life changing ways, Challenge addressed.", "q0r": 4, "q1": "Plan highlights sharing the wonderful projects and stories throughout Latin America; Provide resources for community members and non-Cardano community members; share feedback and stories , focusing on progress from funded proposals . The team of  members have experiences and skills in Economics, Sustainability, Humanities, Video editing, Figma, Canva, AdobeCC and they are capable of implementing the proposal.", "q1r": 4, "q2": "The budget is broken down showing details for easy editing. The timeline is also showing that work starts from February  to May , making auditing easy and effective.", "q2r": 4, "assessor": "z_assessor_270", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": " Relation to personal qualifications: Since I don't have any direct personal connection to any Latin American country, I can only assess the non Latin America specific parts of this proposal.  I however have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal brings up the approach of telling positive stories to help the adoption of Cardano in Latin America. It is pretty sure that this will be both beneficial to the Cardano Ecosystem and to people from Latin America. It is also appreciated that it takes SDGs into consideration. The key metrics and goals of the proposal align with the outlined challenge settings. By potentially onboarding new people the proposal will also help towards scalability of Cardano.", "q0r": 5, "q1": "The proposers are very transparent about themselves. I is highly likely that they are up for the challenge. The proposers define the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. Even a certain buffer is planned in. The proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This challenge seems to meet all the requirements of effectively addressing the challenge. A Latin America focus that will research and report on sustainable use cases of Cardano. Has great potential to value add to the community and spread the word further. Looking at this proposal it would appear that a considerable amount of work/collaboration and networking has already occurred which makes this a good candidate proposal.   ", "q0r": 5, "q1": "The team brings excellent experience and energy to the community. The website looks great and has value content. The plan is ambitious but not extreme and matches the budget asking. This team really seems to be working on clever ways to embrace sustainable real pathways for creating meaningful change. I see a lot of ongoing potential in this project.  ", "q1r": 5, "q2": "The information provided is of excellent quality and gives the reader a great understanding of what this team is trying to achieve. The links add value to the proposal and overall this is a great presentation. The budget is straightforward without too much depth but the amount is appropriate. The KPI's are manageable and due to the teams previous work seem very achievable. Excellent submission.", "q2r": 5, "assessor": "z_assessor_53", "no_vca": 19, "ne": 3, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "There's already projects (e.g. Like \"The WHITE Project\" stakepool) who are leveraging Cardano's ecosystem for generating social good and promoting a better tomorrow through technology. So it'll be a good idea to raise more awareness about this kind of projects developing in Latin America, and tho showcase and make emphasis on Cardano's long-term commitment with sustainability goals.", "q0r": 5, "q1": "Team member backgrounds are presented and they seem to have good knowledge and expertise to develop the project.\r\nHowever, the detailed plan for achieven its goals it's kind of vague in my opinion. They only talk about what they've already made in the past (which is important of course) but there's practically no roadmap ahead. They only mention that, if they get funded, they'll start to contact hispanic community members to join the sustainable ADA project and to share the change agents in the region. Which is no a really in-depth plan to succeed in my opinion.", "q1r": 3, "q2": "Budget breakdown is not really well described in my opinion. They ask 9000 USD for content creation, but no specific breakdown of how it'll be spend such amount of money.\r\nMarketing is not also well explained how it'll take place for me, since they ask for 1000 USD for 12 months (not too much) but they don't say how or which social media plaftorms they're planning to onboard.\r\nBesides from that, KPIs are ok and they'd help to audit project progress and success/failure of it.", "q2r": 3, "assessor": "z_assessor_833", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "It is clear that the scoring criteria and assessment guidelines were not applied or understood by the CA, and that their bias is present. \r\n"}], "solution": "Поделитесь историями агентов перемен в Латинской Америке, которые вместе с Cardano участвуют в каскадном разрушении, создавая лучшее завтра уже сегодня.", "experience": "Экономика, устойчивое развитие, гуманитарные науки, социальные науки, НПО, социальные предприниматели, писатели, ведение блогов, редактирование видео, Figma, Canva, AdobeCC"}