{"id": 384181, "author": "gonzalocamps", "title": "Test DAO at Latam Public Spaces", "url": "https://cardano.ideascale.com/a/dtd/384181-48088", "category": 26242, "amount": 24000, "description": "Принятие Cardano в Латинской Америке развивается медленно, учитывая слабую осведомленность и недостаточную осязаемость ее использования для рядовых граждан.", "funded": 1, "upvotes": 28370420, "downvotes": 22929252, "votes_result": 5441168, "votes_cast": 120, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Идея очень интересная и очень соответствует целям задачи, поскольку она направлена на установку цифровых мониторов в местах с широким распространением (расположенных в Латинской Америке), через которые будет распространяться контент, имеющий отношение к экосистеме Cardano. Здорово, что команда уже запустила идею на f6 и получила финансирование, это передает уверенность в их способности успешно реализовать ее, а также в самом процессе, т.е. идея была предварительно оценена и одобрена сообществом, поэтому я не вижу причин, по которым качество контента и ваши потребности снизились. Также очень позитивно то, что команда предоставила ссылку на предложение в предыдущем фоне. Я считаю, что такая форма рекламы очень эффективна для охвата людей, не имеющих контакта с экосистемой Cardano, потому что поначалу трудно привлечь внимание людей и убедить их искать дополнительную информацию подобным образом. Я думаю, что стоит идти к ним, чем продвигать кампании, которые, возможно, убедят людей, опросят и сориентируют на наш блокчейн. Кроме того, есть люди, у которых нет знакомых, которые уже участвуют в криптовалютном мире; для достижения этой аудитории, в частности, эффективнее продвигать такую рекламу \"по старинке\", чем планировать мероприятия, dApp, которые они стремятся привлечь, и т.д., о которых они, возможно, даже не узнают. Поэтому я думаю, что эта идея может принести большую пользу местному населению Латинской Америки, так как они будут знакомиться с технологиями, относящимися к экосистеме Cardano, и, очевидно, с самим блокчейном, так как к нему будут присоединяться новые люди.", "q0r": 5, "q1": "Сценарий очень насыщенный, они разбивают деятельность по кварталам, хотя я всегда считаю, что авторам лучше делать меньшее разделение по времени (например, ежемесячное), я не думаю, что в данном случае квартальное разделение было проблемой. Я думаю, это потому, что в каждом из кварталов много деталей, перечислено множество видов деятельности, так что у нас есть полное представление о том, что делается. Однако, что касается финансовой разбивки, я думаю, что она могла бы быть более подробной. Команда сообщает, сколько денег потребуется в каждом квартале для проведения мероприятий, но было бы интереснее, если бы эти деньги объяснялись отдельно по каждому мероприятию. Таким образом, мы бы на 100% понимали, как будет использовано запрашиваемое финансирование. Это не так уж плохо, но, на мой взгляд, могло бы быть еще лучше. И, наконец, что касается команды, я считаю, что уровень детализации вполне удовлетворительный, мы знаем имена каждого члена команды, их основные профессиональные роли и ссылки на их профили linkedin, что дает нам возможность узнать их более глубоко. Очень важно иметь члена команды (Gon), специализирующегося на блокчейне, для обеспечения технической безопасности в технологиях, имеющих отношение к экосистеме Cardano. Единственная часть, которую, на мой взгляд, следует улучшить, - это финансовое объяснение.", "q1r": 4, "q2": "К сожалению, команда не выделяет в предложении место специально для измерения КПЭ и установления рисков проекта. Это дало бы нам материал, полностью ориентированный на аудируемость, поскольку мы бы точно знали, какие результаты ожидаются в целом по проекту, на той стадии, на которой он находится. Однако, поскольку в сценарии много деталей, можно проверить, действительно ли предлагаемые мероприятия выполняются; таким образом, мы должны контролировать предложение, делая его проверяемым. Было бы интересно выбрать несколько участников из экосистемы Cardano для сопровождения проекта, предпочтительно из стран, выбранных для получения мониторов. Они могли бы иметь более постоянный прямой контакт с командой и проверять, что деятельность осуществляется в соответствии с планом. Такая обратная связь должна быть передана остальному сообществу, это может быть сделано либо самой командой, либо теми людьми, которые следят за процессом, через письменные отчеты или через участие в Town Hall. Я считаю, что да, эта тема затронута, даже если она не была так сильно подчеркнута во время детализации предложения.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 15, "ne": 11, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "First of all, i note that this proposal brief is quite long and voters will struggle to read through all of it when there's hundreds of proposals to chose from. So this would benefit from a more succinct brief. The specific problem this proposal is tackling is the lack of access by local entities to advertising platforms, which is identified further down the proposal but is not well reflected in the \"Problem Statement\", again making it difficult for voters to quickly grasp the purpose of this proposal. This proposal fits well within the challenge and even though it's focused in Chile the proposers demonstrate the ambition to expand further. As a local activity with small budget, this is off course will initially only have a small impact, but testing the approach at smaller scale first makes sense and sets a good starting.", "q0r": 3, "q1": "The proposal seems to be backed by an experienced and motivated team. The experience evidence is available for most users, except for Ian (engineer) and Matias (UX/UI desing). Given that a lot of the project is reliant on design/manufacturing and UI/UX design it would have been relevant to demonstrate experience of these two members. A timetable for implementation is presented, with the objectives at each step well explained and with realistic timings. The only worry i have from the plan is the requirement to design and manufacture your own OOH displays, which seems like a lengthy process, a bit more details in this area would be re-assuring. The budget breakdown is a bit lacking, with only estimates for each quarter presented, rather then costs by activity and man hours required. The proposal is also lacking in description of technical details in some parts e.g. you mention that you will provide a \"easy to use platform\", but what will this platform be based on ?", "q1r": 4, "q2": "A number of relevant and measurable milestones for each quarter are presented as well as relevant KPI's such as number of users added and OOH displays activated. These will allow the community to audit the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_125", "no_vca": 24, "ne": 5, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "I'm giving this project a 5 star rating because I feel this project fits perfectly with growing (testing) DAOs in Latam places. Having a digital display in public areas is a great way to create public awareness, and by adopting a DOA structure, local advertising could be more accessible to smaller, mid-sized businesses where it's needed to most...    ", "q0r": 5, "q1": "I've giving this area a 4 star rating, while the team has grown from fund 6, I would've liked to have scene a little more variety in the designs to help appeal for a wider audience. I believe the talent and motivation already exist within the team, but the appeal seems to be directed more towards an underground crowd, for mass adoption, there needs to be appeal for a wide variety of people...    ", "q1r": 4, "q2": "In the category I strongly believe their roadmap will be easy to follow to be able to see their progress of success. I think their expectations and what they hope to achieve are very detailed, I would've liked to have seen a timeline when different quotes would be available for displays, but other than that, this project should be esy to follow... ", "q2r": 5, "assessor": "z_assessor_418", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Proposers have already received funding in F6 and going around the web and documents I would say that this proposal addresses the challenge but I would hesitate if really effectively. \r\nMy point is that the word in the title 'Test...' brings no responsibility for the result. I would rather expect a shorter project but showing as a result vivid community-integrated around Cardano. \r\nThis 'Test' might be indefinite in time with a very vague final result.\r\nI really appreciate the high-caliber individuals involved but this makes me, even more, expecting a revolutionary project.\r\n", "q0r": 3, "q1": "In short words - Yes. These Team members guarantee that the proposal will be implemented successfully.", "q1r": 4, "q2": "The information provided is barely sufficient to audit the progress and the success of the proposal. \r\nThe problem is that it looks like proposers at the moment of submitting the proposal had no detailed plan to achieve the result shown as a measure of success. \r\nIt would be very interesting to see the realistic plan and the measures of success for each three-month period.", "q2r": 3, "assessor": "z_assessor_527", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Местные жители, сообщества и предприятия могут представить свои материалы и инициативы в общественных местах с помощью цифровых дисплеев DAO-OOH.", "experience": "Мы - латиноамериканцы, которые исследовали и тестировали эту модель в течение двух лет в Чили.\nСообщество F6 Catalyst финансировало нас для первоначального тестирования."}