{"id": 384614, "author": "linconvidal", "title": "Introductory Blockchain MOOC PT-BR", "url": "https://cardano.ideascale.com/a/dtd/384614-48088", "category": 26242, "amount": 9150, "description": "Отсутствие курсов PT-BR, объясняющих, какие задачи призван решить блокчейн с исторической точки зрения, указывающих на Cardano как на потенциальное решение", "funded": 2, "upvotes": 162412637, "downvotes": 1679736, "votes_result": 160732901, "votes_cast": 701, "f6_no_assessments": 7, "f6_rating": 4.904761904761905, "videos": [], "media": [], "f6_assessments": [{"q0": "Команда разработчиков предложения займется проблемой отсутствия аудиовизуальных образовательных материалов на португальском языке, которые объясняют исторический контекст блокчейна, а также экосистему Cardano. Бразилия является развивающейся мировой державой со всех точек зрения, поэтому это представляет интерес для сообщества. Поэтому совершенно необходимо, чтобы качественный контент Cardano был доступен для ее населения. Команда намерена разработать массовые открытые онлайн-курсы (МООК), которые будут открыты для публики бесплатно и представлены на португальском языке. Тот факт, что курсы будут доступны только на португальском языке, можно считать недостатком. Однако, учитывая, что в Бразилии проживает более 200 миллионов человек, это компенсирует его. На мой взгляд, довольно ясно, как это предложение связано с постановкой задачи. Я вижу только один недостаток: можно предположить, что если люди будут знакомиться с образовательным контентом, они будут более склонны присоединиться к сообществу, однако невозможно определить, станут ли они членами сообщества на самом деле.\r\n", "q0r": 4, "q1": "Что касается оценки осуществимости, то автор предложения проделал отличную работу. Раздел, который выделяет это предложение, - это краткое описание содержания различных модулей, которые будут в этом курсе. Заметна не только работа, проделанная при составлении предложения. Но и то, что в команде есть человек с опытом работы в образовательных методиках. Что касается остального, все контрольные точки на месте, вы можете проверить навыки и опыт членов команды, а бюджет очень четко определен и соотносится со стоимостью. Единственный момент, который не прописан в предложении, - это оценка рисков, препятствующих успешной реализации. После быстрой оценки рисков я обнаружил один, который считаю критическим. Команда предлагает метрику успеха как \"коэффициент отсева\", в предложении следовало бы описать, какие действия предпримет команда, чтобы гарантировать, что эти коэффициенты будут поддерживаться в соответствии с планом?\r\n", "q1r": 5, "q2": "В разделе проверяемости команда снова смогла обеспечить отличную работу. Таким образом, в дорожной карте были выделены четыре основных элемента. Каждый раздел описывает результаты, которые команда планирует достичь, чтобы сообщество могло отслеживать прогресс по сравнению с планом в соответствии с процессом разработки. Кроме того, я хотел бы поздравить команду с тем, что она смогла представить метрики воздействия в такой ясной и лаконичной форме, что, на мой взгляд, делает их хорошо подходящими для проблемы, которую они пытаются решить.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2, "reply": "Great feedback! I agree with everything that was presented. The comment about \"dropout rate\" was a great suggestion that unfortunately we didn't think of in time to put in the proposal text, and we should definitely create ways to prevent people from dropping out.\n\nI strongly agree about the potential size of the audience in Brazil and I think it is a great audience to attract for Cardano, but there are also other Portuguese speaking countries that may consume the course content.\n\nAnd about people being inclined to join Cardano after being exposed to the content, I think it's more about them understanding blockchain and this whole universe to be able to make decisions on their own, so that they can create projects with it, and grow the community as a whole. It would be amazing if everyone chose Cardano, but more important than that is for people to have enough information and education so that they can choose the network that best suits their needs and also their political, personal, ethical and integrity decisions. It's about them being able to choose their network regardless of whether the network is famous, or can generate quick profits, or any of that spurious stuff."}, {"q0": "Рассматриваемая проблема рассматривается подробно и эффективно. В целом, говорится о том, что Бразилия является экономической державой, которая могла бы многое добавить в экосистему Cardano, если бы получила адекватное направление. Это необходимо сделать с помощью различных инициатив, и в данном предложении мы имеем отличную идею для решения этой проблемы. Предложение идеально соответствует целям задачи, поскольку оно предполагает создание бесплатного курса на португальском языке, который объясняет грани вселенной Cardano (включая технологические и социальные, как сообщают его авторы). Это вполне логично и соответствует задаче, поскольку предоставит качественный материал на родном языке жителей Бразилии (крупнейшей латиноамериканской страны), давая им возможность узнать о Cardano и работать с ней. Таким образом, и континент, и экосистема, несомненно, выиграют. Появились бы новые возможности для наших бразильцев, новые люди, обученные работе на блокчейне, а также увеличилось бы количество транзакций и, возможно, наших проектов. Вот почему я считаю, что это отличное предложение, которое, скорее всего, даст отличные результаты, если будет профинансировано\". Знание курса, предлагаемого в Бразилии является бесплатным является еще одним положительным моментом, это то, что это часто факт, и я живу в бразильском обычае), потому что определенная элитаризация бразильских фактов. Если сделать эту деятельность доступной для всех, это также позволит людям из разных социальных классов и покупательной способности иметь эту возможность улучшить свою жизнь через возможности трудоустройства.", "q0r": 5, "q1": "На мой взгляд, этот проект находится в хороших руках; им будет заниматься команда стартапа EveryBlock Studio, команда, которая утверждает, что ведет свою деятельность с 2019 года, продвигая проекты, связанные с Cardano. Как по мне, они очень опытные и квалифицированные люди для создания курса и проведения занятий. Они вселяют уверенность в своей работе, поскольку предоставляют нам примеры некоторых своих предыдущих работ, а также ссылки на другие предложения на f7. Крайне положительно, что команда представила своих членов в индивидуальной и очень подробной манере. Это позволяет нам быть полностью уверенными в их способностях и глубже понять, кто есть кто, чем они занимаются и так далее. В дополнение к подробному описанию предоставляются профили linkedin, где мы можем узнать их еще глубже. О сценарии: можно очень хорошо понять, что и как будет делаться. У команды есть много деталей о том, каким будет (и не будет) курс, какой будет целевая аудитория, какие модули будут составлять курс (включая их порядок и конкретные детали по каждому из них). Все, что я сказал о том, ЧТО будет сделано, важно для понимания предложения. Про COMO тоже много информации, сценарий разбит на месяцы, и в каждом месяце есть список необходимых мероприятий. Благодаря этому можно на 100% понять процесс, который будет здесь разработан. Наконец, что касается финансирования, команда также разъясняет, как будут использоваться запрашиваемые деньги. Она делится на несколько частей, из которых складывается целое, начиная от маркетинга, видеомонтажа и заканчивая оплаченными часами задействованных специалистов. Вот почему я ставлю этой теме наивысшую оценку.", "q1r": 5, "q2": "Предложение хорошо поддается аудиту, команда предоставляет нам конкретные KPI, которые служат для отслеживания результатов (достигнуто ли то, что было обещано?). Кроме того, есть и другие способы мониторинга развития этого проекта. Поскольку они объясняют, что именно будет в каждом модуле, можно проверить, что модули строятся и проходят так, как было запланировано. Также можно проверить, выполняются ли работы, которые обещали делать каждый месяц, и как они выполняются. Поэтому я считаю, что команда предоставляет нам достаточно информации для очень точного аудита предложения. Общине достаточно установить этот мост и поддерживать постоянный контакт с командой.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 27, "ne": 15, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "В настоящее время существует много блокчейн-контента, но очень мало на португальском языке, в то время как Бразилия имеет большой потенциал для изучения, как это объясняется в предложении. Поэтому курсы по блокчейну с упором на Cardano на португальском языке действительно необходимы и должны иметь большой эффект. Важно отметить, что в этом фонде есть и другие предложения, направленные на разработку курсов на португальском языке, но я не увидел ни одного в формате MOOC, который становится все более распространенным, поскольку курс всегда доступен, и студент может проходить его самостоятельно. Я также вижу большое соответствие с метриками задачи и осведомленностью о блокчейне и Cardano, что может увеличить число латиноамериканцев, присоединившихся к Cardano, и в то же время распространить его на другие части мира (с переводом). Еще одна вещь, которая усилит это влияние, заключается в том, что курс будет бесплатным, поэтому он может охватить студентов с низким уровнем дохода (с доступом в Интернет). Предложение также очень хорошо написано, содержит полную информацию и уже имеет все содержание, которое будет преподаваться в курсе, что значительно упрощает оценку его влияния.\n\n Мне также понравилось, что целевая аудитория уже четко определена. Единственный момент, который можно было бы улучшить, это пункт \"Потенциальные пользователи Cardano\" - можно было бы лучше объяснить, кто эти потенциальные пользователи (студенты STEM, люди, работающие в данном секторе, и т.д.). Если немного лучше определить эту аудиторию, то с ней будет легче общаться. Одним из предложений здесь было бы включить студентов с низким доходом/бедных студентов, так как это большая реальность в Бразилии, и блокчейн/технологии в целом имеют большой потенциал для улучшения их жизни. Это будет соответствовать ЦУР ООН 1, 4 и 10, по крайней мере. Чтобы охватить эту специфическую аудиторию, потребуется определенная коммуникация (и поддержка).\n\nЧто касается коммуникации, то здесь также можно было бы лучше изучить, как будет рекламироваться курс, чтобы привлечь новых людей. На платформах MOOC существует множество курсов, и для того, чтобы они привлекли к себе внимание, необходима правильная коммуникация с ключевой аудиторией. Это может включать, например, маркетинговые кампании в социальных сетях.\n\nПоследние два моих предложения по улучшению касаются самоокупаемости курса и взаимодействия со студентами. Что касается первого, я бы включил в предложение, как курс будет самоокупаемым/финансируемым в будущем (поскольку предполагается, что он будет бесплатным). Было бы важно указать, например, будет ли курс включать рекламу или финансироваться из средств толпы.\nЧто касается последнего, я понимаю модель MOOC, но было бы важно включить в рамки проекта создание канала связи со студентами для ответов на вопросы или проведения дебатов между ними. Это может быть простой телеграм-канал, аккаунт в twitter или instagram. Я не уверен, есть ли у платформ MOOC функции, позволяющие это сделать, но если да, то очень важно их изучить!\n\n\n", "q0r": 5, "q1": "В целом, проект кажется действительно осуществимым. Команда является частью стартапа, который уже работает с подобными проектами и разработал продукты для Cardano. Люди из этих команд в предложении очень хорошо описали свой опыт с ссылками на Linkedin для подтверждения информации. Два человека уже приняли участие в проекте, и их опыт в области блокчейна/программирования/технологий является солидным и разнообразным и кажется достаточным для запуска подобного проекта.\nНа сайте стартапа также можно узнать больше о самой компании и людях, которые в ней работают.\n\nЗдесь же описан очень разумный и расписанный по времени план с задачами, над которыми будут работать в каждый период. Важно отметить, что 4 месяца на полную разработку и публикацию курса - это очень хорошо. Бюджет разбит по полочкам и общая сумма невелика. Единственное, что я бы сделал, чтобы немного его улучшить, - это распределил бы значения по срокам.\n", "q1r": 5, "q2": "KPI хорошо определены и разумны, а их цель ограничена по времени, что замечательно. Я бы только добавил сюда некоторые KPI для измерения качества курса (я действительно оценил измерение уровня отсева). Это можно сделать с помощью опроса студентов, \"экзаменов\" до и после курса, отзывов и т.д. Я понимаю, что количество записавшихся может быть и непрямым способом измерения качества - я бы только добавил более прямой способ убедиться, что это достигается. Другим возможным KPI (но более сложным для измерения) может быть количество (бывших) студентов, которые присоединяются к катализатору и подают предложения, получают одобрение своих предложений, разрабатывают приложения и т. д. Это помогло бы подтвердить влияние на экосистему.\nЕсть также некоторые этапы, которые можно извлечь из временной шкалы, я бы просто выделил наиболее важный для автора предложения (который для меня кажется последним в каждом периоде времени).\n\nНаконец, что касается управления рисками, я бы включил сюда проблемы, связанные с соблюдением предложенных сроков, проведением курса с высоким качеством, тем, что он не достигнет целевой аудитории, тем, что проект обойдется дороже, чем предполагалось, и тем, что он не будет самоокупаемым в будущем. Было бы важно увидеть некоторую стратегию смягчения этих рисков, но я вижу, что она может быть лучше проработана на более поздних этапах проекта.\n\nВ целом, проект кажется действительно осуществимым, и в нем есть специальный раздел для определения успеха, который очень хорошо резюмирует его проверяемость.\n\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 25, "ne": 13, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "On-boarding new users is always a difficult, but a self-paced educational course made by Brazilians for Brazilians can make the process much easier and enable the team to reach a much larger audience. The proposal effectively addresses the challenge goals of grow the Latin American Cardano community by allowing people to learn at their own pace and consequently create a new stream of people entering into the Cardano ecosystem. The proposers emphasizes how local Brazilian communities can use and benefit from Cardano ecosystem.", "q0r": 5, "q1": "This proposal team has been participating in the Cardano community for a while and has several proposal for the Brazilian community. I believe they have the technical skills and qualifying relevant experience to inform and educate new members about the Cardano ecosystem. The plan is comprehensible and layout the structure of the course and topics, but I would love to see a module focused on how the average (non-technical) Brazilian can contribute to the community for after completing the course.", "q1r": 5, "q2": "The road map and timeline are broken down into clear and concise details that will help the community follow along with the progress of the project. The main team members behind the proposal are clearly identified along with their relevant experience, this will help the community build trust in the project as there are people that can be held accountable for the success and failures of the proposal. The proposal clearly defines the KPIs for success which the community can use to track and audit the proposal. I believe this proposal will be one of the easier project to audit due the detail in the proposal.", "q2r": 5, "assessor": "z_assessor_338", "no_vca": 18, "ne": 7, "ng": 11, "nfo": 0, "vca_o": 1, "reply": "I love the suggestion of a module focused on presenting the ways to actively contribute to the community, we will definitely take it into consideration! I'm also glad with the final comment because for us it means that we were able to convey the idea of the project in a clear and concise way. "}, {"q0": "Free Online Courses that will guide interested individuals thru a introduction to blockchain to    electronic payments to explaining Smart Contracts and NFT and Limitation then to the Cardano approach and the future of blockchain technology. ", "q0r": 5, "q1": "Already has an organized company called EveryBlock Studio with Highly Skilled Team members who's objective is to deliver digital products and services.", "q1r": 5, "q2": "Well Defined Video Course Materials, defined what will be in each Module 1 thru 6. Defined what will not be in the course materials. Roadmap is clearly defined Month by Month. KIP's are defined, and Budget breakdown is well defined.", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 30, "ne": 1, "ng": 16, "nfo": 13, "vca_o": 1}, {"q0": "Great job done by the proposer.  The proposal effectively addresses the challenge, very detailed and elaborative and has a great potential of bringing value into the cardano ecosystem by providing the people of Brazil the right blockchain knowledge to effectively to help them maximise the opportunities blockchain presents.", "q0r": 5, "q1": "The proposer has provided relevant links to team members and they seem capable to execute the task when funded per their details provided. Furthermore,  the budget is on point and reasonable enough to execute the project when they are funded.", "q1r": 4, "q2": "The proposer has clearly outlined the roadmap, KPI's and has defined clearly how success will look like after project execution when funded.", "q2r": 5, "assessor": "z_assessor_420", "no_vca": 23, "ne": 2, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "The proposers hope to onboard new Cardano users by creating a free online course in Portuguese. The massive online open courses are interesting because they don't have a limit on the number of participants, so it has theoretically infinite scalability. This idea would meet the criteria in the challenge statement because it directly onboards individuals into the cardano ecosystem who would normally not have the knowledge to enter it. After onboarding new users, the cardano ecosystem would grow because there would be a pool of new future voters, proposers, and CAs. (score given: 5)", "q0r": 5, "q1": "Given the experience listed by the proposers, I have full confidence that the proposal will be successfully implemented. The team has provided thorough experience that is relevant to the proposal. \n\nThe plan outlined seems likely to be successful because the proposers have listed a very detailed roadmap. There are good breakdowns by the month that all seem feasible in the given time period. The proposers also listed a plan for the content to be taught in each module. I appreciate that the proposers thought to plan this out in advance because it allows voters to have a more tangible view of the outcome of the project. \n\nThe budget seems reasonable given the scope of the project and the work that will be done by the proposers. (score given: 5)", "q1r": 5, "q2": "Given the information listed, I think that the proposal will be auditable by the cardano community. The proposers listed some 3, 6, and 12 month key performance indicators that are good milestones for the community to track the progress of the proposal. There are also great quantitative KPIs that the community can use to track the project, such as total number of enrollees. One thing I would be interested in is seeing if there can be a KPI regarding the number of course enrollees who go on to become active members of the cardano community. That would be interesting to track because it would directly relate to the long term goals of the challenge. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 22, "ne": 6, "ng": 16, "nfo": 0, "vca_o": 1}], "solution": "МООК PT-BR \"Введение в блокчейн и Cardano\", объясняющий их основные технологические и социальные аспекты, доступен бесплатно", "experience": "Команда с опытом подготовки образовательных материалов (включая blockchain и Cardano) и преподавания как физических, так и виртуальных классов."}