{"id": 382485, "author": "kareemb", "title": "A Second-Chance Cardano Hub", "url": "https://cardano.ideascale.com/a/dtd/382485-48088", "category": 26244, "amount": 90000, "description": "Ex-Offenders are locked out of many ways to earn a good living. ~77% of former prisoners are rearrested in five years.", "funded": 0, "upvotes": 15744838, "downvotes": 20411014, "votes_result": 4666176, "votes_cast": 108, "f6_no_assessments": 3, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Everyone is aware of this problem of re-incidence, and it’s great that someone (in this case Weld Settle) is looking out for this often-forgotten community. I assume that the stats mentioned in the problem statement refer to the USA, that could have been included. The solution is innovative and refreshing, and I do see the potential of introducing blockchain to this community as many of these people will be looking for new purposes in their lives. This aligns well within this challenge and if Cardano (and blockchain in general) would be responsible for turning the live around of just 1 person, then that would already be a massive positive impact to the ADA community. It’s great that proposal intends to use Cardano as the vehicle for introduction to Blockchain.", "q0r": 5, "q1": "We know that this proposal will be carried in Weld Seattle, and the proposer mentions some experience but there’s no way to verify it, typically a LinkedIn page or the profile within the company website would do. I also couldn’t find any mention of this proposal within the website provided. In general, it is good to add this type of information as it acts as re-assurance for voters. It also seems like that current the team is lacking experience in Blockchain/Cardano, and you mention that you are seeking funds to cover the salary of a competent/experienced staff ? is this for existing staff or do you intend to hire someone new ? some clarity here would help. If I understand correctly the proposal seeks to build a Cardano Community hub within the Multimedia Tech Hub, and the proposer mentions a number of terms they intend to cover (NFTSs, smart contracts, DeFi, etc) which all seem appropriate. Setting up an SPO as a learning project is a great idea. A timetable is provided, but this includes steps related to building the new resource centre which distracts a bit from the purpose of this proposal. You have indicated where you intend to spend the budget (partial salary of staff+ cardano infrastructure), but ideally some sort of budget breakdown should be provided, even if just rough estimates e.g. what is the salary of the competent/experienced staff ?", "q1r": 3, "q2": "As mentioned before a timetable/roadmap is provided but includes many non-relevant steps for this specific proposal, appreciate that some of the steps mentioned are pre-requisites, but these should have been mentioned as such. The important milestones here would be allocation (hiring?) of staff for this project, developing the specific curriculum for Cardano/Blockchain hub (already mentioned) and setting up the Cardano Community hub. Attached with timelines, these would have been easy for the community to follow. There are also no KPI’s or metric of success provided. Examples of KPI’s could be X students onboarded into Cardano Community Hub 3 months from lunch; SPO successfully set-up 6 months from lunch. Examples of metric of success to measure could be the number of students who have become blockchain developers through the Hub, students who have joined Project Catalyst and so on.\nThis is a great and unique proposal, and with a few tweaks and clarifications the feasibility and auditability scores could be greatly improved. If you are not funded this time around, please reach out to the Catalyst community for tips how on to improve your proposal\n", "q2r": 2, "assessor": "z_assessor_125", "no_vca": 22, "ne": 13, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This is an interesting approach - to marry emerging Cardano blockchain earning opportunities with providing second opportunities to ex-offenders. The proposer has given a very insightful look at the problem facing released prisoners into society and the lack of opportunities they face, as well as the benefit for society of re-engaging them in productive activities. Indeed, the challenge does call for implementation of local community hubs for approaching the proverbial \"average person\" to take part - and this proposal does identify a cross-section of society that could benefit from leapfrogging traditional avenues for returning into society. This proposal, in my opinion, misses some more focus on how can the program birdge the gap between the average person and Cardano. Yes, a specific curriculum for Cardano-specific development will be developed in three months. By whom and who will be the judge? Maybe it would be easier to use available resources from the Plutus pioneer program or Marlow? It cites that the proposers see Cardano development as a viable path to income creation and community inclusion for system-impacted individuals. However, it is difficult to jump straight into Plutus programming, if one doesn't know Haskell, while not knowing Linux makes it difficult to enter easily the Haskell world of functional programming. Developing on Cardano might be easier if one uses the EVM and Solidity - but these issues are not addressed in the proposal. Maybe the idea is to train former inmates for performing the role of CAs (low entry barrier and may seem more realistic for the majority of Cardano outsiders initially), but that is not explained. The proposed Cardano hub is being proposed by a Weld volunteer (mentor, 15-year Fortune 50 Supply Chain leader), but the proposal fails to articulate a key moment - how it will specifically add value to the Cardano ecosystem. I would suggest - if the proposer fails this time around - to resubmit the proposal next round but providing equal thoroughness to the Cardano aspect. Right now the desire to help former inmates shines through, but the proposal could benefit if it could prove a greater beneficial impact for Cardano. \n", "q0r": 3, "q1": "The proposer (as a volunteer certainly seems to have - or leaves the impression of having - the skills and experience from Weld to help realize the non-Cardano specific aspects of the project. Such as completing structural upgrades to the building, looking for partner organizations, completing construction, etc.. However, I fail to see an equally strong and feasible plan for developing a specific curriculum for Cardano-specific development for the proposed Cardano Community Hub. The proposer does suggest that the proposal would \"would offer Cardano classes in all of our service languages\", however it may be difficult to bridge the gap from Cardano classes to ... the proposed solution of development on blockchains - as a fresh start way to earn money and contribute. The proposal would have benefited from the inclusion of verifiable information about the proposer and his status with Weld Seattle and whether he as a volunteer is in the position of seeking out financing for completing structural upgrades to the building and related activities. A joint proposal authored with Weld might lend more credence to the proposal in the next funding round, if the proposal is not approved this time around. The $90,000 budget may be suitable for the plan that involves a lot of construction and repair activities, but there is no budget breakdown that would allow voters to see how the lump sum will be precisely allocated among all the planned activities. If additional funding is being used to complete these projects for the 1426 reentry resource center, it would be helpful to list all those other funding sources that will be used for the project ... and a consideration of risks if these additional funds are not secured. The proposal does not explain the technical competencies and experience of people who will be developing the programs for the Cardano hub, which is a missed opportunity. ", "q1r": 3, "q2": "Although we have a roadmap (3, 6 and 12-month timeline), to me it is unclear whether the entire roadmap will be fully financed from the $90,000 lump budget that is requested or whether aspects such as \"completed construction which will include, at a minimum: Creative Spaces, Coffee Shop, Multiuse/Multimedia spaces, Tech Hub, Breakout Rooms, Pantry\" will be financed from other sources. I would venture a guess that these construction activities are being co-financed, but as there is no budget breakdown, this hampers auditability and I do not see how this proposal can be realistically audited - in a successful manner. Furthermore, we do not see some metrics/KPIs that are aligned with the challenge. For example, as the proposer states in his solution that \"development on blockchains offers a fresh start way to earn money and contribute\", it would be logical to include a metric and a goal for a certain number of developers that this new hub would train for the Cardano ecosystem? Or a certain number of successful proposers in Project Catalyst. Even simpler metrics could have been included such as the expected number of new users of Cardano that were onboarded, as is suggested by the challenge. Without metrics and specific outcomes, it will be hard to audit the success. Maybe the number of ex-offenders who have successfully earned a supplementary income from Cardano after 12 months? \n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 24, "ne": 14, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "This idea will open a new life for miserable prisoners that is just returned to normal life, and if it is successful and being spread wider it can inspire a lot of people about the Cardano communities. \r\nThe proposal is lacking key metric to help identify that is it align with the challenge setting or not. ", "q0r": 3, "q1": "The proposal doesn't have basic info that can help to assess its feasibility, it should provide some of these infos: \r\n- Detail roadmap - that will help everyone assess its implementation plan that is fittable with what it explains above about the activities or not. Their phases in the proposal are what they expect, so I assume that they're not a roadmap. \r\n- A budget breakdown that should reasonable with the roadmap it provides. \r\n- People that hold executive positions and better is the detail which task they will do\r\n- Some risks that can be met and how it can solve them. With this project, I think there is a lot of risk that relevant to government, society, event organization... \r\nThe proposal includes a good idea, good vision, good expectation, and motivation but for being funded, it should have the above detail. ", "q1r": 1, "q2": "For auditing the proposal, we need:\r\n- Detail roadmap and realistic timeline for running the project. It doesn't have any roadmap in the proposal - as I explain in the feasibility comment it is like their desired goals than a roadmap. \r\n- Key metrics that align with the challenge, will help Catalyst community know where you want to go. \r\nThe good thing this proposal has is the solution detail that includes the context and activities that will help and with a lot of successful images that the team expects. \r\nIt also includes some ways that can help to audit but I think it is additional, at least it must provide some basic above first. ", "q2r": 2, "assessor": "z_assessor_670", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Development on blockchains offers a fresh start way to earn money and contribute. We will host a Cardano hub inside of our program @ 1426.", "experience": "Entrepreneur, mentor, 15-year Fortune 50 Supply Chain leader. \nI volunteer at Weld. We have the space and will have the infrastructure."}