{"id": 383730, "author": "danov.optela", "title": "Cardano Community Hub Bulgaria", "url": "https://cardano.ideascale.com/a/dtd/383730-48088", "category": 26244, "amount": 75000, "description": "The Bulgarian blockchain communities are in initial stage of development and Cardano is not very\nwell known, yet.", "funded": 0, "upvotes": 17026975, "downvotes": 19849075, "votes_result": 2822100, "votes_cast": 100, "f6_no_assessments": 3, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "An author of the proposal presents his arguments in favor of the opening of a new hub in Bulgaria, one of the key arguments being the estimate of people who are actively involved, ranging from 2500 who attend meetings to 180000 who are observers (when making statements of this nature, I recommend including links to references to support them). The proposal lists several activities that could be conducted at the hub. While I am generally in agreement with the alignment of this proposal with the challenge's objectives, there are no impact metrics provided. Though I am generally in agreement with the alignment of this proposal with the challenge objective, unfortunately no impact metrics are provided that would allow me to make an accurate assessment. Aspects associated with the scaling challenges that the project would encounter in the future are not addressed.\r\n", "q0r": 4, "q1": "Positively, the author identifies 8 types of initiatives that may be implemented in the hub, ranging from courses to lobbying for favorable legislation. He does not, however, provide enough information to enable a complete assessment of the feasibility of the project. The following recommendations should be considered by the author for future Catalyst cycles. (1) List the members of the proposal implementation team, including a description of their skills and experience, and references to verify the claims made in the proposal. (2) Identify and describe specific expenses that should be broken down into identifiable line items, e.g., site rental costs, site maintenance costs, estimated hourly wages for people who will perform key tasks, amount set aside for education professionals, key note speakers, etc. (3) Include a risk section that identifies potential risks to the success of the proposal and countermeasures to eliminate or reduce those risks.\r\n", "q1r": 2, "q2": "Finally, it was not possible to identify the necessary data to evaluate auditability. The following are some recommendations that the author should consider for future Catalyst cycles: create a roadmap explaining the steps that must be taken in order for this proposal to be successful. A timeline should be provided at least every three months. Furthermore, it is essential to establish some success metrics and ideally link them to dates, for example, XX conferences will be organized within a period of XX months; XX new members will join the community due to their participation in the hub's events, etc. For the community to understand the status of the project and to be able to contrast the actual information with the planned information, this information is vital. \r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The idea of this proposal is good and it identifies the problem within the challenge. The proposer wants to create a community hub in Bulgaria which will introduce many people to the cardano ecosystem. This will add value to the cardano ecosystem as many developers, entrepreneurs and other profiles enter the space and help build the community up. But although the idea is good, a lot of information is missing in this challenge. For instance, I think that this proposal doesn't include key metrics that the proposer should add to improve this proposal. I feel, nevertheless, that the proposer has made the effort with this proposal. I think that the proposer can greatly improve this proposal by providing informations such as a roadmap, milestones, and KPIs.\r\n", "q0r": 3, "q1": "This proposal doesn't include enough information to be audited successfully. It will be very difficult to track the progress of this project overtime as the proposer didn't include clear milestones nor a roadmap. There is also no evidence of the skills and experience stated by the proposer as the proposal doesn't contain a profile link or any other material about this. Furthermore, the proposal is missing a timetable which can be used to measure the completion of the work. By adding the missing informations, I think that this proposal can do really good in the future as it has successfully identified the problem in the challenge.\r\n", "q1r": 2, "q2": "The proposal doesn't contain a roadmap nor milestones. KPIs are also missing, which make the project hard to audit as there is no reference that helps track its progress. Although the description of the problem in this proposal is understandable, the execution of it is the missing part. I suggest to the proposer to add these missing pieces and better structure the proposal in order to increase  its chances of being funded in the future.\r\n", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The idea is good. The team point out the opportunity to bring Cardano enter a new and promising market. However the idea is still in high-level stage, which not include any detail break-down that ensure their action in transform the good idea into realistic project.", "q0r": 4, "q1": "The proposal says the team has wide experience with IT education, development of blockchain applications, online platforms and tourism but it's just saying, not detailed explain who are they, what they did that bring experience on the table. The plan need to have detail timeline/ milestone and KPI to measure the success. The proposal  doesn't include explaination for what 75000 ADA will be used for.\r\n", "q1r": 1, "q2": "There is no metric to measure is mentioned or milestone/ phases to audit the progress.", "q2r": 1, "assessor": "z_assessor_809", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "Creating a local community Hub in Bulgaria for dissemination and education of Cardano ecosystem,\nin collaboration with digital nomads.", "experience": "Our team has wide experience with IT education, development of blockchain applications, online\nplatforms and tourism"}