{"id": 383975, "author": "profd2004", "title": "Cardano Blockchain Lab in Kenya", "url": "https://cardano.ideascale.com/a/dtd/383975-48088", "category": 26244, "amount": 38255, "description": "Although Kenya is at the forefront of technological innovations in the region, Cardano is still scarcely known among the public & Devs.", "funded": 2, "upvotes": 106120920, "downvotes": 2583699, "votes_result": 103537221, "votes_cast": 247, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem identified in this proposal conforms with the challenge expectations. Keyan is a country in Africa where global adoption of blockchain technology needs to happen in order to help the local community solve some of the major issues they are facing. Creating a hub to mentor developers will add a lot of value to the local community as well as to the cardano ecosystem. The end game should be those developers being able to build dapps in the cardano ecosystem, that will solve problems that Africans are facing right now. Furthermore, the proposer has added key metrics that perfectly align with the challenge. I did not identify a scaling plan for future challenges, but in my opinion, there can be at least 2 ways to scale this proposal - one being replicating the same hub in other parts of the country, the other being enlarging the existing hub. (Rating 5)", "q0r": 5, "q1": "The proposer has mentioned having experience in development and in blockchain technology, but failed to provide evidence such as a linkedin profile or even a previous work in that regard. I suggest to the proposer to add these information as they are really important to judge the feasibility of the project. Apart from that, the budget has been broken down into identifiable items. All the items needed to carry out this project have been outlined, but I'm not able to know the correctness of the prices stated. But, based on my sole intuition, I believe that the prices are correct. Furthermore, a timetable has been provided by the proposer. But I didn't identify, in this proposal, a plan in case additional funding is required. I suggest to the proposer to keep this in mind as the budget more than likely will never be exactly precise. Altogether, I have strong confidence, based on the informations outlined in this proposal, that the project can be successfully implemented.(Rating 4)\r\n", "q1r": 4, "q2": "This proposal has a high likelihood to be audited based on the information given by the proposer. The proposal includes a roadmap and reasonable milestones. The milestones can be tracked in 3 months, 6 months and 9 months. The community has been given all the details including the KPIs in order to track the progress of this proposal. Altogether, I can say the problem outlined in this proposal has been described clearly and the solution as well.(Rate 5)\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Impact:\r\n\r\nThe problem statement:\r\nKenya is at the forefront of technological innovation, but Cardano remains largely unknown amongst the public and Developers in the region.\r\nTo solve this issue the proposer has laid out a plan to introduce a Cardano Blockchain Lab in Kenya.  This endeavor is designed to address the lack of awareness of Cardano in Kenya and will serve to bring our eco-system to the forefront of technological recognition in the region.\r\nThe plan calls for working with successful Non-Government Organizations to form teams of young Kenyan professionals focused on the Cardano eco-system.  \r\nDemographic information: \r\nThe project aims at onboarding new developers, translating Cardano content into Swahili and conducting blockchain development work hosted by lidonation.com a cardano-based stake pool (LIDO) and introductory website.\r\nThis projects seeks to drive ground level adoption with a robust plan to conduct strong community outreach with active and beneficial onboarding of several recent college graduates. \r\nAn Action plan:\r\nThe proposers plan starts with acquiring computers used exclusively for running Cardano and facilitating mentorship, developer work and training.  With the start of the mentorship program, the team then plans to form monthly meet ups run by two community outreach officers who will also host office hours and participate/establish Swahili Cardano channels on social media platforms. \r\nPart of the plan includes getting the Lab to become self-sustaining by find ways to tap into the Cardano eco-system and its opportunities.  Things being explored include:\r\n1.\tAlumni donation\r\n2.\tRunning a stake pool \r\nThis proposal addresses the challenge to Scale-Up Cardano's Community Hubs by employing bold innovation combined with concrete planning to achieve its stated mission. I strongly agree that this proposal effectively addresses the challenge:  ASSESSMENT SCORE 5.\r\n", "q0r": 5, "q1": "Feasibility:\r\nThe proposer of this assessment uses a sound plan and expert regional knowledge to communicate a vision of success of this project.  \r\nKey Performance Indicators (KPIs): \r\nThe project is already underway and if successful.  The Hub launch in the next 6 months will be the first of its kind in Kenya. 5 developers are already standing by to be a part of the mentorship program.  Once the current developers are trained, they will transition to management of the lab. \r\nThis project has the backing of Friends of Ngong Road (FONR) a U.S. Based non-profit that does fundraising for NRCF and Ngong Road Children's Foundation.  NCRF is a Kenya-based NGO that provides quality education opportunities to children affected by HIV/AIDS who live in the Dangoretti slums of Nairobi Kenya.  \r\nKaribu Techmates is a program sponsored by NRCF to help recent college graduates with technical skills access training and employment opportunities. The new Elimu Hub study center offers learning and job opportunities in the online economy.  This project is working to become a strategic partner in this enterprise by developing a strong Cardano community outreach and development.\r\nThis proposal could benefit from exposure to FONR/NCRF's large donor base thereby increasing the overall reach of the project.  These well-established NGOs provide the needed credibility for this project. \r\nA Roadmap:\r\nThe 3 Month goal is to have 5 Dedicated workstations, 2 developer interns, and 2 community outreach officers who would have hosted their first Community Event and are set to continue with monthly events.\r\nThe 6 Month goal would see the first cohort of developers graduating from the program and the second cohort getting started with community events happening each month and reports to the Catalyst Community with updates on attendance and events feedback.\r\nThe 9 Month goal calls for veteran Mentees leading ongoing developer mentorship programs with the lab engaged with the Catalyst Community.  This would also spawn opportunities for new partnerships and funding for ongoing maintenance at this point.   \r\nSkill required to complete the project:\r\nThe main people behind this project are:\r\nDarlington Wleh - a Dev/Ops Engineer with 3 years of experience who is described as having a deep understanding of cloud technologies, computer programming languages, and blockchain technologies. His profile is verifiable via LinkedIn.\r\n\r\nStephanie King does not have a professional profile so it is difficult if she has the skill, expertise or background in achieving the states goal. \r\nThe Budget breakdown:\r\nThe budget breakdown for this project is itemized and explained very well. It outlines costs for:\r\n1.\tDeveloper Mentees\r\n2.\tComputer Stations\r\n3.\tWebsite for the Lab\r\n4.\tMentorship Director\r\n5.\tCommunity Outreach\r\n6.\tOffice space, supplies, marketing, event hosting\r\n7.\tCardano Hub Coordinator and Administration\r\n8.\tInternet usage\r\n9.\tElectricity.\r\nThis cost breakdown is comprehensive and lends itself very well to establishing transparency and credibility with the Cardano Community. I agree that given the experience and plan presented it is highly likely this proposal will be implemented.  ASSESSMENT SCORE 5\r\n", "q1r": 5, "q2": "Auditability:\r\nBecause this project is still in its infancy, Key Performance Indicators have not yet fully developed. However, there is enough information between the road map and the detailed budget breakdown to follow the success of this project using these two documents to accurately the progress of the program. The program uses:\r\n•\tDeveloper Mentees - $4,500 Interns in the developer mentorship program are paid $250/month for a commitment of 30 hours/week \r\n•\tComputer Stations - $11,000 3 New Developer Workstations with capacity to run all of the the cardano architectural pieces: db-sync, a node, graphQL server, ogmios, hasura, a wallet backend and the plutus application backend.\r\n•\tWebsite for the Lab - $360 This would cover the cost to create a new website for the Ngong Road Cardano Lab in Nairobi Kenya, and to host the site for 1 year\r\n•\tMentorship Director - $6,000 Darlington runs the mentorship program and spends 5 hours per week coaching the mentees in the program, including a 3hr pair programming session. Darlington is already mentoring 2 recent grads. He have also successfully mentored 3 students into full time software engineering positions at Yelp, electricbikereview.com and the Colorado Department of Game and Fishing (they are all still employed at the respective organizations).\r\nCommunity Events and Outreach\r\n•\tCommunity Outreach - $6,000 Pays for 2 Community Outreach officers in Kenya, plus Coordinator support from the Lido Nation Team. We will plan and host monthly meetups, office hours with community members who are interested in Cardano, and participate in Social Platforms to help create and grow Kenyan/Swahili content channels for Cardano.\r\n•\tOffice Supplies, Space Rental, Marketing Enablement, Event Hosting - $2750 Pays for Zoom and MailChimp Subscriptions, Office Furniture and Supplies, and refreshments for monthly events.\r\nUtilities and Admin\r\n•\tCardano HUB Coordinator and Administration - $3,200 Pays for Lido Nation and Elimu Hub staff to hire staff, coordinate objectives, plan for future revenue streams to sustain the lab beyond the 9 month launch.\r\n•\tInternet - $4033.00 This amount covers 60% of the cost of internet for the facility for 9 months. Getting good internet in Kenya is challenging and expensive; being able to help NRCF with this is key to reaching this region with blockchain tools!\r\n•\tElectricity - $412.00 This amount would cover 50% of the electricity bill for the facility for 9 months. The new Elimu Hub is being built to run on solar power!\r\n•\tI agree that The information provided is sufficient to audit the progress and the success of the proposal. ASSESSMENT SCORE 4\r\n", "q2r": 4, "assessor": "z_assessor_479", "no_vca": 15, "ne": 9, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "This is a really incredible project that seeks to empower the local community in Kenya through a partnership with a well established community hub - Elimu Hub. The premise of this project is to provide the physical resources and education required to teach local community about Cardano and grow awareness about Cardano within a safe and nurturing environment. \r\n\r\n\r\nThe team have an array of experience and are already engaged in delivery of Swahili translation on Cardano. They will mentor 5 new Cardano developers and introduce many to the cardano ecosystem through community based events and workshops. The project is locally focussed in an impoverished area of Kenya, the scalability of this project might be possible through implementation of similar models and partnerships in other community spaces in slums across the world. To do so would require excellent documentation to build a case study of the impact of this project.", "q0r": 5, "q1": "The community hub that this project team are partnering with have been based in this area since 2003 and have developed a long term vision for how they could benefit children and young people in this area through education and indeed, through providing hope for the future. \r\n\r\nThe team have a detailed plan to add on to the existing education hub and will have the support of a dedicated team with Cardano experience. The plan for executing this project is also really solid with budget to pay for the participation of the mentorship which will remove significant barriers for the young participants in this area and moreover will motivate and educate them to contribute as much as they can to the program in terms of their time and energy. \r\n\r\nThe timeframe, budget and overall program are really clearly laid out and make a great deal of sense considering the context that the team are working in. It provides for physical resources, stable internet access and support for community outreach and basic supplies. ", "q1r": 5, "q2": "This is definately a project that could be improved by having ongoing profiling within Town Hall meetings to assist with the delivery and ensure the project remains on track. At this stage there is very little indicated in the proposal pertaining to how they would report back, however there seems to be a great interest in Cardano and this would present opportunites for exchanging ideas and inspiring more life changing projects such as this throughout the world. The KPI's and milestones are clear and measurable. The delivery dates are not specific however it's time based milestones to allow for project commencement to be in tune with the outcome of funding and likely a myriad other considerations for execution of a project of this nature. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 11, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "I think this proposal effectively addresses the challenge since it wants to create a hub/ lab in a NGO (Ngong Road) in Kenya to introduces and educate graduated students of this NGO about Cardano/ blockchain. Target community is good since fresh graduates are sensitive about technology. They can form a hub and sharing information with others.  ", "q0r": 5, "q1": "Timeline, budget, team, resources are all fine.\r\nThe only thing that makes me concern is the sustainability of the lab since it asks to be invested facilities ($11k for computer stations) but I don't see how to generate the lab's own money to continue operating after 9 months being funded. ", "q1r": 4, "q2": "Roadmap with milestones is clear. I advice team to add KPIs to the proposal, for example: number of people joining offline meet-ups, numbers of engagement Swahili social channels, people attracted to Cardano via the lab, etc.", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Extend existing NGO community student hub to add a Cardano Blockchain Lab with dedicated computers, developer mentorship, & community ed.", "experience": "14+ Yrs Software & Cloud Engring, Blockchain development, business consulting, world languages, technical writing, teaching, mentored 3 ft ."}