{"id": 384016, "author": "bitcoinbay", "title": "Cardano Hub West Africa", "url": "https://cardano.ideascale.com/a/dtd/384016-48088", "category": 26244, "amount": 29500, "description": "There is a limited Cardano community in west Africa. People lack awareness of Cardano as an option;  as well as the business opportunities.", "funded": 0, "upvotes": 16326078, "downvotes": 19768167, "votes_result": 3442089, "votes_cast": 106, "f6_no_assessments": 6, "f6_rating": 2.2222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem and the solution to the problem have been identified. West Africa is a wide region (17 countries) and it is unclear if the proposer is aware of the existing Cardano hubs in this area (Ghana is the first example that came in my mind). If the proposer aims that region, it is recommended to find a country (couple of but not more) whose inhabitants are interested to gain knowledge about Cardano ecosystem and no hub is already assembled. \r\n\r\nIf the target audience is identified the proposal can have a good starting point for its path to success.\r\n\r\nAnother aspect that is unclear represents the language in which the materials will be presented. An assumption can be made (French or English I presume) but is not clear if the materials will be presented in one or another or in both.\r\n\r\nIf the assumption is valid, that people in West Africa speak French or English language and not in their original dialects than, the proposal fits in the challenge objectives, otherwise it needs to be rephrased to comply with the campaign requirements.", "q0r": 3, "q1": "Based on the statements of the proposer the team that will implement the project have the necessary experience for doing this job. It is recommended to sustain the statements with links to trails/evidences (links to social media, projects completed etc.)\r\n\r\nIt is unclear what is the number of events that will take place. In the proposal it is stated that the pace is bi-weekly but in the end the number of total events is 26, thus making the pace twice a month (a year has 52 weeks). This aspect needs further clarification.\r\n\r\nThe budget is broken down into items but additional information is required as is necessary to present how many events will be held online and how many are estimated to be face to face, as additional funding is required for the last category (venue rental, catering etc.).\r\n\r\nThe proposal doesn't offer a realistic timetable to complete the work. (i.e. week 1 - team assembling; week 2, 3, 4 - topic preparation, audience gathering for the meeting, events holding; week 5 - impact evaluation, feedback analysis, adjustments/improvements phase etc.)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (are there any other hubs in place in West Africa? how can you coexist if there are any?)", "q1r": 3, "q2": "The proposal lacks in providing relevant information about the implementation of the project.\r\n\r\nNo KPIs/metrics are (clearly) defined (how many users are expected to attend the events? how do you measure the user adoption of Cardano? etc.)\r\n\r\nIf the proposal will be presented after the current issues are cleared it may stand a chance for future funding.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 19, "ne": 6, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The idea of this proposal is really good. It clearly identifies a problem within the challenge. The proposal, on the other hand, lacks some critical information that needs to be added. For instance the proposer has not clarified how this proposal will add value to the ecosystem. There is room for improvement in the way the proposal is structured. I would add a roadmap and clear metrics to say the least. However if the proposer adds all the lacking information. I can visualize a successful and scalable proposal in the future. (Rating 3)", "q0r": 3, "q1": "The proposer hasn't provided links of the skills and experience mentioned in this proposal. The proposer claims to have experience organizing events since 2013 but there is no evidence to back these claims.The proposer could add video or linkedin profile to add evidence. I think that the proposer should also add a roadmap and also breakdown further the budget. Some items in the budget section are pretty vague. Furthermore I didn't identify a comprehensible timetable to track the work completion. Altogether, this proposal lacks the details needed for me to give it a positive feasibility vote. I think that if the proposer can add these items successfully, I can see this proposal getting funded. (Rating 3)\r\n", "q1r": 3, "q2": "There is not a roadmap in this proposal. The milestones needed to track the progress of this proposal. I would suggest adding metrics and KPIs as well. I think that this proposal has a good start as it has clearly identified and described the problem in this challenge. Nevertheless, the lack of details and crucial information have it very difficult to audit. I think that the proposer should consider adding those missing information such as a roadmap, strong KPIs and detailed budget breakdown, in order to give this proposal all the chances that it deserves. (Rating 3)\r\n", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This proposal effectively address the challenge because it gives a clear solution to the defined problem statement.\r\nHowever the budget is not very clear and is lacking detail.  On the other hand future scalability is huge and potential impact on cardano Ecosystem could be very rewarding.\r\nDue to the above I agree with this proposal.", "q0r": 4, "q1": "The team could present themselves more professionally so that CA could have more detail whether the team is capable to organize an event(s) with considerable level of success. However since they show their previous experience in creating similar events I think they can achieve it. \r\nOn the other side detailed plan is also not shown due to which and the above I can only neither agree or disagree to the proposal.", "q1r": 3, "q2": "Proposal's progress can not be easily audited. Deliverables are not clear (roadmap and timings are not presented) and transparency is vague. KPI and metrics should be updated . Also risks and possible challenges are not mentioned inside this proposal and that is the reason I have to neither agree nor disagree with this proposal. Missing points should be updated by the proposer.\r\n", "q2r": 3, "assessor": "z_assessor_605", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The mentioned problem is within the challenge, and their solution is to address it. This team wants to make a hub in West Africa for hosting regional events and providing educational workshops, delivered by local community members for solving the limitation Cardano community in west Africa. \r\nAs they want in the proposal, they want to gain the support of Bitcoin Bay and other Cardano communities. \r\nUnfortunately, the team doesn't have key metrics to show how much the team considers the challenge settings. My recommendation to this team is that should be a number of events, attendees in their event, or how many members in those communities... ", "q0r": 2, "q1": "This is a community, which means that there will be a lot of things to do include: organize events, member management, marketing, content creator...  but inside the proposal there is no explanation about which activities the team will do, moreover, no roadmap. \r\nI recommend that team should visualize some goals that they want this Hub will become, then write down some key activities and identify what they will do there. Then stick with the challenge setting, they will make some KPIs, key metrics that align with what the challenge gives. This will help their idea be funded and come true.\r\nTherefore, this proposal is not enough to evaluate the feasibility. ", "q1r": 1, "q2": "For auditing the proposal, the team should provide roadmap with detailed and a realistic timeline that is fittable with the team's ability, some key metrics that team wants to lead the project there, or can be KPIs, or goals...  \r\nMoreover, Catalyst community wants to know how you can acknowledge the problem, and clarify the way you solve that problem. Hence, that is one of the basic info the team must-have in the proposal, too. ", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 4, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The solution of this proposal will potentially help to grow the community of Cardano in West Africa. But it doesn't have info about it will impact on Cardano ecosystem. \r\nIt also doesn't have any key metrics or plans to measure whether what this idea brings is meet the challenge or not. ", "q0r": 2, "q1": "This proposal lack all basic info for assessing the feasibility. The short brief is not enough for assessing. They should inclcude: \r\n- Detailed implementation plan for knowing what they will do with their solution to address the problem. Not just about the features, but also includes use cases, technology explanation, marketing, activities... the more detail is great\r\n- Detailed roadmap and budget to assess that are they reasonable with plan or not \r\n- Team info to clarify the ability to execute the plan \r\n- Relevant risk to know that the team experiencing and well-preparing for the idea. \r\n", "q1r": 1, "q2": "Cannot scoring the auditability of this proposal because it lacks everything for that. For auditing the progress and success of the proposal, it must have: \r\n- A roadmap with milestones and a time horizon for achievement. And metrics/KPIs that define the success of the proposal. Those 2 will help Catalyst track and audit in periods. \r\n- Clear understandable description of the targeted problem. And the clear understandable solution that addresses the problem. These 2 will help to know what is this proposal expects up front. \r\nThis proposal have none of them. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "The proposer shows that this project can solve the important problem that could help to spread more awareness of Cardano into West Africa. But the proposer can't articluates how it will add value to the Cardano ecosystem and people in that community. Even the propose make some interesting goals for this project, but there is no plan to get these goals in reality. ", "q0r": 3, "q1": "Successfully deploying this idea is not just a simple proposal with some lines of idea only. This project needs a lot of detail for that but the proposer provides nothing but a few lines of ideas, budget, and goals. They must give more info about a detailed plan they will do, roadmap that with a clear timeline of activities will get, clarify team member info, fix the budget that suitable with the plan and roadmap, risk-relevant that team will face off. I rate this proposal for 1 because lacking these infos.", "q1r": 1, "q2": "No plan, no roadmap, no key metrics in this proposal. It means cannot track and audit this project. \r\nMoreover, the proposer is not clear about the problem and cannot explain how it can help to solve the problem, also the value that it gives to the ecosystem. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 17, "ne": 2, "ng": 8, "nfo": 7, "vca_o": 1}], "solution": "Fund A Cardano Hub in West Africa. will host regional events and provide educational workshops, delivered by local community members.", "experience": "Hosting Bitcoin meetups and workshops since 2013\nHosting Multiple crypto meetups globally.\nHosting Cardano meetups in Toronto."}