{"id": 384349, "author": "heinz.gassner", "title": "Grow MALTA, Grow Europe !", "url": "https://cardano.ideascale.com/a/dtd/384349-48088", "category": 26244, "amount": 25000, "description": "Malta is a small nation actively influencing the EU regulation, which is largely shaped in Brussels. Cardano is not yet sufficiently visible", "funded": 1, "upvotes": 60819734, "downvotes": 14060511, "votes_result": 46759223, "votes_cast": 234, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "The team claims that Cardano is not well-known in Malta, and they propose establishing a hub using the contacts they have with various colleges and professionals. How? By establishing a physical presence at the University of Malta's DTL center. The proposal makes a strong business case, explaining that this is just a part of their overall strategy; this poposal includes a defined value proposition, channels, and revenue structure. Although there is a clear connection between the team's approach and the challenge aim, the measurements do not always give clear targets, making the evaluation subjective.\r\n", "q0r": 4, "q1": "A brief but effective description of the team members is given and the necessary references for verification are provided. The budget section breaks down the final amount requested into 4 items, however, in some cases I think they could have provided more details for a more accurate analysis. You describe partners such as the Catalyst community, University of Malta and relevant companies, here too I think you should have provided more data. What do you mean by Catalyst community? Is it possible to know the contact within the University of Malta? What is the background and what value would it bring to the community? \r\n", "q1r": 4, "q2": "There is clarity on the problem, solution and alignment with the challenge. The roadmap presented includes actions between January and June; clear milestones and deliverables are described. 6 success metrics are defined; however, here the team could have made a better effort, specifically in the definition of targets for 3 of the 6 metrics.  \r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment. This knowledge gives me the skills to assess proposals in this challenge. The proposal identifies Malta as a new high-potential place for a Cardano community hub. With the background regarding Malta this seems likea very beneficial approach. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince Malta is such an important country regarding DLT technology, it can sure be said that this proposal will help with future scalability.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 5, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal includes some info shows that how it will impact the Cardano ecosystem development. The hub in Malta, as the info in the proposal, will have a strong effect on many communities as I understand. \r\nMoreover, in both of its KPI and roadmap, we can ensure that the team really makes it align with the challenge given. ", "q0r": 5, "q1": "The proposal has a very detailed implementation plan, including activities, relationships, even a detailed business model... it shows that the team has a serious long-term plan to develop. \r\nAnd its roadmap is short, but going with the details above, it is enough to understand what they will do in it. \r\nIt also clarifies the relationship and first step to developing the community that starts from the university in Malta. \r\nAbout the budget, it shows the reasonably detailed budget that suits to the plan and activities. \r\nThe lacking things are relevant risks and I think it needs to show here because the plan is complex as they describe. ", "q1r": 4, "q2": "- The proposal has a detailed roadmap in a realistic timeline. \r\n- Its KPIs and deliverable goals are clear met with the challenge setting.\r\nSo that they're enough for anyone to audit it. \r\nIt has a detailed explanation about things and activities that they will do to solve the problem, and it is easy to understand what they want to achieve with their vision and mission. ", "q2r": 5, "assessor": "z_assessor_670", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "Absolutely, it fits into the objectives set out in the challenge, if realized it will add significant value to the Cardano community in Malta or beyond.\r\nThe people behind the project clearly detail the impact, feasibility and auditability of the proposal.", "q0r": 5, "q1": "The proposal is realistic, adds value, and is sure to be successful. We can find the people in charge of the project, on their website or on linkedin, that is, we can find the people in charge of the project, which facilitates auditability.", "q1r": 5, "q2": "The roadmap is detailed, the budget expenses are disaggregated. We see a roadmap of milestones and dates to verify.\r\nThe proposal is worded correctly, I can see that the proponents have experience not only in the proposal but we can also track other successful projects of the proponents.\r\nGreetings", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "We have excellent access to universities and domain experts in Malta (and Brussels). Our goal is to establish a community-hub in Malta.", "experience": "More than 30 years of industry-leadership experience combined with direct access to an attractive network of domain experts"}