{"id": 384626, "author": "quasar", "title": "Culture Cubes", "url": "https://cardano.ideascale.com/a/dtd/384626-48088", "category": 26244, "amount": 5000, "description": "Community hubs need a way to build and share cultural resources.", "funded": 0, "upvotes": 16507850, "downvotes": 24877348, "votes_result": 8369498, "votes_cast": 113, "f6_no_assessments": 5, "f6_rating": 1.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I have reviewed a number of proposals from QUASAR in this fund, I did so for all in fund6 and they were all of a similarly vague format. Please provide a concrete proposal with clear deliverables and time frames ", "q0r": 1, "q1": "There is no clear plan presented. I remember reviewing all the ideas by QUASAR in fund 6, and reading all the other reviewers comments on their proposals in the voting stage. The proposals were all relatively vague, with difference expertise stated for each one with no evidence to back them up. They were rated poorly by all reviewers. I have little confidence this proposer will successfully deliver on this proposal given this history and the limited details provided in this proposal. ", "q1r": 1, "q2": "There are no clear deliverables or associate timeframes. No metrics for success have been presented. Please provide a clear timeline of what you will deliver by when so delivery can be audited. Please also provide some clear metrics with attached goals so that success can be measured.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 30, "ne": 1, "ng": 24, "nfo": 5, "vca_o": 1}, {"q0": "A \"work in progress\" draft proposal of just 56 words requesting $5k aimed to build an NFT platform for community hubs so they can share their values.", "q0r": 1, "q1": "The proposer is a well known Catalyst member but link to realized project and professional profile are usually better appreciated by voters than mere words and reputation.", "q1r": 1, "q2": "This is an unwithdrawn work in progress proposal so there is not enough information provided.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The goal of this proposal is not clear, so it is hard to judge how this would help scale up cardanos community hubs. It states it is necessary to share cultural resources, but does not explain how that will bring value to cardano.", "q0r": 1, "q1": "This proposal does not provide any information on how they will implement their idea, it does not provide information on who the team is comprised of and what their specific experience is, nor does it explain what their end goal is.", "q1r": 1, "q2": "There is no information provided that wouid allow us to measure the success and progress of this proposal. An audit would need a detailed roadmap, and a plan for the budget which is not provided in this proposal.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}, {"q0": "This proposal is still in the concept stage. Therefore, the proposer has not yet come up with specific solutions about the proposal's product. I hope to see the product of the proposal in the next fund.", "q0r": 1, "q1": "All we see in this proposal are ideas, not specific products or plans. Therefore, this proposal does not seem feasible", "q1r": 1, "q2": "There is no specific plan, goal the proposal wants to achieve, key metrics, ..... so the proposal cannot be audited", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 21, "ne": 0, "ng": 12, "nfo": 9, "vca_o": 1}, {"q0": "The proposal seems to fit within the challenge and has great potential to bring a bridge between all hubs and cultures but without more detailed information it is impossible to state wether the proposal effectively addresses the challenge. ", "q0r": 3, "q1": "There is no team or links listed and the budget is extremely vague. Please refine both for future proposals.", "q1r": 1, "q2": "There is no Roadmap or any mention of KPIs and therefore the project is no auditable.", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 14, "ne": 0, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Create an NFT framework or template that each hub can use to identify and share their values outside their hub.", "experience": "Catalyst veteran that moves amongst various communities and across the cardano ecosystem."}