{"id": 385068, "author": "wadaghana", "title": "MODEL ICT HUB FOR DEPRIVED STUDENTS", "url": "https://cardano.ideascale.com/a/dtd/385068-48088", "category": 26244, "amount": 24000, "description": "How can we motivate deprived young students in the North East region of Ghana to get educated in the present and coming technologies?", "funded": 1, "upvotes": 52316329, "downvotes": 18068206, "votes_result": 34248123, "votes_cast": 133, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=5295"], "media": [], "f6_assessments": [{"q0": "Building a local community hub for deprived students is a noble action needed to help the population in developing countries. The proposer has identified a problem that clearly fits into the challenge. The Community hub that will be built will help the introduction of cardano and the blockchain technology in general, to the local community. This can add massive value to the cardano ecosystem as many profiles, such as developers, community advisors, to say the least, can join and participate  in the growth of the cadano chain.I think that once a successful implementation of this project is achieved, scaling will be a matter of opening similar projects. This project has been written in a clear and concise way.(Rated 5)\r\n", "q0r": 5, "q1": "It's quite clear to me that this project has really high chances of a successful implementation, based on skills and evidence provided by the proposer. Wada is a reputable organisation that has conducted a lot of good projects in the cardano ecosystem. That alone can increase the confidence in the feasibility of this project. But the proposer has  managed to add details about the team needed, and an understandable budget breakdown. Since I can't verify the prices, my judgment on the budget is purely based on my intuition. Nevertheless, I didn't identify a plan in case additional funding is needed for this proposal. I think it can be a good improvement of this proposal. But, a detailed plan of the project has been provided in addition to the way they intend to achieve it and the resources needed as well. Nevertheless, I'll recommend to the proposers to add the challenges and risks they may expect upon successful implementation of the project.\r\n", "q1r": 5, "q2": "This is a highly detailed and auditable project according to the informations provided by the proposers. The roadmap provided in the proposal and the milestone are reasonable based on my intuition. The Metrics and KPIs that define the success of this proposal will be easy to measure in the future. Furthermore, the problem in this proposal has been described in a clear way, and the description of the solution is clearly understandable as well.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment. This knowledge gives me the skills to assess proposals in this challenge. The proposal identifies an important problem within the challenge which by adressing it, will provide training opportunities in a new region that will bring great benefits to the Cardano Network and the local people. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 8, "nfo": 9, "vca_o": 1}, {"q0": "Proposal is good and suitable for challenge. The problem is how to promote underprivileged students in Ghana to receive a modern-oriented education. I like the practicality of the proposal because it really fits with what the ecosystem needs right now as it is starting to grow.\r\nProposal proposes a legitimate problem and then provides an idea of a valid solution. Set up a community center in Nalerigu to provide students with IT services and basic training services", "q0r": 5, "q1": "Recommendations include experienced Wada members, who can easily check their dedication via Twitter or LinkedIn. So I appreciate the feasibility of the proposal.\r\nThe proposal gives many reasons to choose Nalerigu to implement this proposal, demonstrating the professionalism and dedication of the proposer to the project. The proponent has done a lot of background work and thought through the ideas that underlie the proposal, which adds to the feasibility of the proposal. In addition, there are detailed plans, and specific goals are set, that bring about the successes that this group has achieved. So make me believe this proposal will work\r\nTo further increase the likelihood of this proposal succeeding, I would like to see a list of potential risks and challenges.", "q1r": 4, "q2": "The proposal has a roadmap with clear objectives and allows for the development of the described audit.\r\n  The budget is described in great detail, ensuring the honesty and transparency of the proposal makes me completely agree that the team is competent enough to tackle the challenge.\r\nIt also presents key metrics to enable testability. The proposed data will certainly allow for the audit and tracking of the desired results", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 16, "ne": 3, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal will make a strong impact to this challenge because of strategic solution to solve the problem that within the challenge. \r\nIts detail about the context and current problem is very clear that will help the solution going well and make a good results to develop  the target community. Hence, it will help to develop Cardano community, too. \r\nThe proposal also include outlined factors that tell us how much this proposal can impact to Cardano communities. ", "q0r": 5, "q1": "The proposal have short roadmap that I think it should detail more. By the way, it has some info about done tasks that can help us assess the feasibility of the project better, and I think that these referral success stories can help us believe on the ability of the team. \r\nMoreover, the budget breakdown is very detail and somehow can be reasonable with their activities. ", "q1r": 4, "q2": "The proposal have a very detailed explaination about problem it met and implementation that will use to solve the problem. But, the proposal should detail some of these thing for better auditability: \r\n- The roadmap, compare with their detail solution and budget breakdown. I think more detail about roadmap will help people clear and support it better. \r\n- Relevant risks that it will face off when running in the scope of the funding, because I think that the project has to scale up the activity with funded budget. Different scope of work with before, more risk need to be controlled. ", "q2r": 3, "assessor": "z_assessor_670", "no_vca": 16, "ne": 3, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "This proposal by WADA is to create a hub in North East Ghana to educate and inspire students around technology of Cardano and improve the lives and education of students, teach skills to build and create employment in ICT. Nalerigu is a growing community that currently lacks acces to basic ICT services and this project aims to address that. \r\n\r\nThis project is aligned with the challenge and helps to educate non-English speakers and onboard new users that would otherwise experience barriers of access (such as language) to the opportunities provided by Cardano. The project is focussed in Ghana locally however the WADA group are running a number of initiatives across Africa and it's likely the emergence of these projects and their success stories would lead to some pilot projects that could be implemented in other emerging economies throughout the world. There's also capacity for well organised initiatives and community hubs such as this to attract greater investment and grow in size that way. \r\n\r\n\r\n", "q0r": 5, "q1": "The WADA team in Ghana have demonstrated a track record of delivering locally focussed projects aimed at improving outcomes for youth in their region. They have run several meetup events and hackathons already and have an established reputation within the Cardano community. Given this it's likely this project will succeed. \r\n\r\n\r\nThe plan is to set up a space with required utilities. Within 3-6 months the ICT hub will be up and running with recurring events designed around the needs of community. The budget is really detailed and timeline is similarly detailed. The project plan is really clear. \r\n", "q1r": 4, "q2": "The proposal includes an evaluation strategy for how the community can audit the progress of the project. The issue with the deliverables is that most of them are future based outcomes as a result of the opportunity being delivered, and are somewhat opaque as a result. It might be better to tie the KPI's directly to deliverable outcomes from this project eg. Completion of build ICT Hub in Nalerigu or Delivery of ICT training and Cardano workshops to X number of young people in Nalerigu. There are some metrics along this line but again they aren't quantified.\r\n\r\nIdeally a project like this would have direct employment outcomes locally, so measuring the number of jobs this funding would create now would be advantageous, rather than looking at future potential employment data. \r\n\r\nThat said, collecting data into the future and keeping track of and documenting the impact of a project such as this would assist in attracting additional support and funds from outside of Catalyst and Cardano community, which would widen the scope of understanding as to what it is that Cardano is achieving. ", "q2r": 3, "assessor": "z_assessor_699", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the challenge since it is going to be a a community based IT training and awareness on Cardano Blockchain. What I don't seem to get from this proposal is sustainability which would be assessed later. Although the project fits the setting, how will this project benefit locals or average people who do not know the English language but still want to gain knowledge in IT and Blockchain management. ", "q0r": 4, "q1": "I have taken a look at the attached links and it looks like the proposer has experience of Cardano Blockchain and the team can easily train new people and imart knowledge on Cardano. Nonetheless, the budget component spells out motivations trainees who will be assessing the facility, but has not clarified how there will be sustained funding for the project. For instance, will trainees pay for receiving training? If not how will the training be sustained? How will the project fund refreshments as motivation for trainees always? How will the facility be maintained if need be if trainees are not paying? So next time clarity should be made on project continuance or sustenance.", "q1r": 3, "q2": "The proposer outlines a road map for the project which is great. Metrics are also outlined which will help measure success or else failure of the project which is also great. The proposed solutions will impact the target community greatly. But I think what is lacking is the expected impact per stipulated period. For instance, if the project is successfully running, within what period do we expect job creation, and how many jobs withing the period? At what period can it measure the impact of the project and what will be the key milestones per period? I also missed out on expected difficulties and how to mitigate those difficulties. ", "q2r": 4, "assessor": "z_assessor_733", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Set-up a community hub in Nalerigu to offer students access to basic ICT training and services to compete with their peers in other regions.", "experience": "Wada: Consist of a team of skilled personnel with great experiences in development, education and Cardano Community practitioners."}