{"id": 368327, "author": "", "title": "Multi-Source Translation Pipeline", "url": "https://cardano.ideascale.com/a/dtd/368327-48088", "category": 26111, "amount": 5000, "description": "Allow more public content to be available in multiple languages\n\n\\- Developer Documentation\n\n\\- Tutorials\n\n\\- Blog posts\n\n\\- Catalyst Proposals", "f6_no_assessments": 7, "f6_rating": 1.6666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Whilst translating resources into different languages clearly meets the objective of the challenge, this proposal lack detail on what will be translated, how much will be translated and into which languages. ", "q0r": 2, "q1": "The proposer claims to have experience in translation pipelines, but does not give any evidence or go into detail. No evidence is claimed of blockchain or Cardano.\r\nThis proposal needs a detailed plan of what would be produced, evidence that the proposer has the capability to deliver this, and a breakdown of what the proposed budget would be used for. ", "q1r": 1, "q2": "As there is no detailed plan with deliverables and a timeline as it stand progress on this proposal could not be audited. The proposer should also set some goals for what this would achieve. How will this motivate non-english speakers to learn and grow Cardano in the next 3-6 months? How many people will this reach, in what languages?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Good idea with brad potential impact, not being limited to a single site or specific content. However, the plan needs to be developed more. What platform will be used? will it be developed from scratch or use an existing one by a 3rd party? Will anyone be able to propose and tranlastate? how to ensure quality in the translation? How the communication of it will be made to ensure people will know about it and engage? \r\nThere are already some services that provide this kind of platform and a becnhmark analysis could be done previously to see what theres on the market and what this would bring as differentiation.\r\nIt also lacks an implementation schedule divided in weeks or months.", "q0r": 2, "q1": "\"Translations Pipelines in international products\" doesnt say much. this experience should have more details as which projetcs or companies  he worked, what was his role and how many years he worked on it. Also, only asingle person working on it doesnt seem enough, specially if it will be developed from scratch, which would envolve creating a platform (developers would be needed). \r\n\r\nAlso, the plan is very poorly detailed and no cost breakdwon is explicited here. The budget could be broken down by the project phases, for instance.", "q1r": 2, "q2": "No kpi or milestones. It would be good to have indicators like number of content translated, number of translation requests, number of people translating, number of accesses, time spent on the platform, etc. \r\n\r\nAlso, the plan listed here should be divided over time with more specific deliverables", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "In order to judge what and how would be this project impact, the proposer should have put the step to step path in the proposal. It's complicated to judge if the idea would work and impact or not if we don't know how it would be done in the practice. \r\n", "q0r": 1, "q1": "It's not clear how the project would be built in the reality. What platform would be used? How many pieces of content would be released per week of month? How could the translators participate to start to contribute? Is it enough the proposer relevant experience to make this idea real? The budget is not clear for each part of the road map. It's not clear the languages that would be embraced on the project. \r\n", "q1r": 1, "q2": "Without the demonstration of specific goals about the languages embraced in this project, metrics and milestones pre-established it's impossible to know how to audit the project. \r\n", "q2r": 1, "assessor": "z_assessor_409", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal. There is no problem in the problem statement. The idea is related to the challenge, but there is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "They do have a plan stating what they want to do but a little bit more detail would be nice. There isn't a timeline or an explained budget. The idea of Cardano content in different languages in great and is a wonderful idea, but it needs some more planning and effort.", "q0r": 2, "q1": "This proposal did have a plan, but there wasn't enough details to actually execute it well. There wasn't many reasons or facts to support the idea and there wasn't much information given about the budget either. This proposer did have experience in this exact area of Translation Pipelines. This was a great proposal, it just needs some extra work.", "q1r": 3, "q2": "Without a clear plan or way to distinguish what order things will happen or having reason for your budget it is hard to audit the progress and success towards reaching your goal of allowing other people to submit their translations to your network to display information in other languages. Those might be some things to work on next time.", "q2r": 2, "assessor": "z_assessor_585", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "I neither agree nor disagree that this proposal effectively addresses the challenge because:\r\n1. The problem needing to be solved has been identified and articulated.\r\n2. This proposal fall within the scope of the challenge brief.\r\n3. This proposal shows clearly how it will add value to the Cardano Ecosystem.\r\n\r\nBut:\r\n   Key metrics and goals of the proposal have not been stated clearly.", "q0r": 4, "q1": "I neither agree nor disagree that given experience and plan presented, it is highly likely this proposal will be implemented successfully. Why?\r\n1. Proposer has included in his proposal that he's work with translation pipelines in international products but couldn't provide a link to some of these products and as well couldn't provide a link leading to his bio which the community could access and at least generate some level of trust. Number of years the proposer has had experience in the translation pipeline was also not stated which makes me quite uncertain.\r\n2. Budget could be reasonable but because it wasn't broken down into deliverable items, it poses a level of uncertainty  with regards to implementation.\r\n3. Detailed plan is provided but I feel it would've meant a great significance if these plans were dated chronologically.", "q1r": 3, "q2": "I disagree that the information provided is sufficient to audit the progress and the success of the proposal. Why?\r\n1. No roadmap was provided in the proposal. Roadmaps are time horizons that the Project Catalyst can use to keep track of project implementation.\r\n2. Clear Metrics/KPIs which aids in defining the success of a proposal is also not available in the proposal.\r\n3. No possible hurdles, challenges and difficulties were identified nor potential workable solution provided.", "q2r": 2, "assessor": "z_assessor_69", "no_vca": 9, "ne": 3, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "Building a translation pipeline is a good idea to increase the quantity and quality of Cardano multilingual content. Very little information is provided on how the solution will be developed. Is it the development of a platform? is it about building a partnership with some translation company? ", "q0r": 2, "q1": "The proposer claims he has been a user of translation pipelines, but provide no references. Having been a user is not enough to have the relevant skills to build a translation pipeline solution. Without more details on how the solution will be build, and the skill and experience of team members, I rate the feasibility score at 1.", "q1r": 1, "q2": "A project plan is given, but weakly described. The proposal lacks some important information such as details on the technical solution, challenges, budget breakdown. I recommend improving the proposal by adding this kind of information for a future application.", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Build a translation pipeline that allows collaborators to work on submitting new translations for content to be available in other languages", "experience": "I have work with Translations Pipelines in international products"}