{"id": 368686, "author": "", "title": "Translate NFT-MAKER to German", "url": "https://cardano.ideascale.com/a/dtd/368686-48088", "category": 26111, "amount": 3000, "description": "The entry barrier for non-English speaking people to Cardano products is very high, this slows adoption down significantly.", "f6_no_assessments": 7, "f6_rating": 3.2857142857142856, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a simple proposal to translate a current NFT creation tool from English to German. Whilst the proposers claim they are the most used NFT creation tools on Cardano, some number of usage would be great. It would also be good to see some reasoning behind why the current lack of translation is a barrier. The tool appears to be relatively simple, the FAQ is one page long. Is it not relatively easy to just just google translate on this? How many more German users do they expect translation to bring? Why did they choose German, have they received a lot of request for this specific Language?", "q0r": 4, "q1": "This is a relatively simple plan, so likely to be implemented. It would be good to see more details on exactly how much needs to be translated. How many words, and thus what does $3000 work out as in $/word. The proposers don't claim to have translation experience themselves, so this information would both enable estimation on whether it is feasible for the proposed budget, but also if it is good value. Do they have a marketing plan to reach German users?", "q1r": 4, "q2": "Delivery of a German version of their sites is easy to audit. However what is success? This proposal could be improved by setting some goals on the number of users and NFT's which would be minted by the German version of the site.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 16, "ne": 8, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Generally, somewhat tech-savy Germans have a decent enough understanding of the English language. The impact is not nearly as high as it would compared to many more other languages. Nonetheless, the proposal addresses the challenge.", "q0r": 4, "q1": "It is extremely likely that this proposal would be successfully implemented. The plan lacks clarity how the budget would be exactly spent.", "q1r": 4, "q2": "While the end-result is clearly to see, how would the community know about the progress of the translation?", "q2r": 4, "assessor": "z_assessor_22", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The proposal takes the challenge properly, due to it could attract more non English speaker and the German market is quite big. What would be useful to know its that whether the NFT minting page is enough for non Engish speakers to work with it and deploy them. Might be some whole process related info could be included.", "q0r": 3, "q1": "In the proposal the information is not given who will translate it, but since it is just a translation request it could be done by hiring any company.", "q1r": 4, "q2": "There is a 2 month time frame given once the found are received which is great. However additional information would be good to see, how much words are there to translate and what are the translation costs in order to match the requested amount with the work to be done and that it can be audited properly.", "q2r": 2, "assessor": "z_assessor_33", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The challenge of entry barrier for non-English speaking people to Cardano products is very high, which slows adoption down significantly. By translating NFT-MAKER to German, it will make the most used NFT-Minting platform more accessible to German users. The Proposal is simple and effectively addresses the challenge.", "q0r": 5, "q1": "The proposer is the team is behind NFT-MAKER and NFT-MAKER PRO - the two most used NFT creation tools on Cardano. In the Cardano space since 2017. Implementation would require a German translator.", "q1r": 4, "q2": "The information provided is short and sufficient, and easy to audit. Budget and timeline is reasonable as well.", "q2r": 4, "assessor": "z_assessor_340", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I believe this proposal definitely addresses the challenge; need of multilingual integration. In order to grow, we as a community need to be able to communicate with one another. Because we're dealing with a world adopted platform, it's be nice to see something that can translate into multiple languages. But this is something that needs to be done (German), and you are correct in saying how it slows the adoption process of minting NFTs.   \r\nThe reason I agree and not strongly agree, is because I'd like to see a alternative for the translation into more than just German. The more languages NFT-Maker can be translated to, the more minted NFTs which can be minted and can access the market.   ", "q0r": 4, "q1": "I understand this proposal is just for German, but when you refer to our team, I don't see a team listed. You also state, \"our team is behind NFT-MAKER and NFT-MAKER PRO,\" but it isn't clear what defines, \"behind?\" In the future, it'd be nice to see a list of your team, along with their accomplishments and any current profiles that I could have access to. I believe, we as a community, need to be able to conduct research on the proposers and their ability to complete the tasks they've set forth. I just think you could've been a little more transparent with your team and their abilities, and that's why I disagree with how likely the proposal will be implemented...  ", "q1r": 2, "q2": "It'd been nice if you could've provided a detailed description on how your team was going to translate NFT-MAKER. How are the going to implement a German setting? And in doing so, what would the roadmap look like? I know there's going to be a little more than just translating words. To be able to follow along and watch your team progress, I need to understand what is entailed, who exactly is going to do what, and how long it's going to take to do the task provided. \r\nI just think you could've done a little better than saying, \"2 months after receiving the funding we will have fully translated NFT-MAKER to German.\" \r\nWrite your proposal as if you're explaining it to someone who has no idea what you're talking about. Be as descriptive and as exact as possible. I completely agree this needs to be done,  I'd just like to know the process, and timeline of each milestone so I'd know what to expect...", "q2r": 2, "assessor": "z_assessor_418", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "In general, the typical user that want to create an NFT usually already have a good understanding of English. Should be nice to have some evidence that this site/service has an interesting flow of users that needs a German translation.", "q0r": 3, "q1": "The site/service is already running, so the evidence of the implementation is clear. Please double check the found requested as the site/service is quite simple and straight.", "q1r": 3, "q2": "The roadmap is clear: 2 months. It lacks a KPI & metrics", "q2r": 4, "assessor": "z_assessor_491", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "The idea was amazing but the proposal needs some work. There is no plan. How are they going to translate it to German, who will they hire, what will they use the budget for and how will they get people to use it. This proposal needs more detail", "q0r": 2, "q1": "The proposal lacks information. Planning, timelines, explaining. His team does have experience in this exact area and has been working there for 4 years so far. Next time they should add more details and a precise plan. It was a good proposal , but it needs more work.", "q1r": 2, "q2": "The information provided is not sufficient to audit the success and progress towards their goal of translating the NFT-MAKER to German because their is no exact plan, there isn't a timeline or reasons for their budget. They do have some nice facts and some great idea/s.", "q2r": 2, "assessor": "z_assessor_585", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}], "solution": "By translating NFT-MAKER to German we want to make the most used NFT-Minting platform more accessible.", "experience": "Our team is behind NFT-MAKER and NFT-MAKER PRO - the two most used NFT creation tools on Cardano. In the Cardano space since 2017."}