{"id": 368748, "author": "", "title": "Localize Yoroi in French", "url": "https://cardano.ideascale.com/a/dtd/368748-48088", "category": 26111, "amount": 2500, "description": "Yoroi light-weight is crucial as everyday users will use it to interact with the Cardano ecosystem at large.", "f6_no_assessments": 5, "f6_rating": 2.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Localization of Wallets of Cardano is extremely important to acceptance around the world. This is a simp0le proposal to continue a updating current French localization for another 12 months. IT would be great if the developers gave some data on the number of users and how this has been changing so voters can see how many people depend on it.", "q0r": 5, "q1": "The developers have already done this, they are just asking for a small amount of funds to continue, thus very likely to be successful.", "q1r": 5, "q2": "Very simple to audit, is Yorio continued to be localized in French over the coming 12 month period. It would be great to see some measurements on the impact this is having on Cardano. How many users does this localization have, is it growing?", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Draft proposal. There is no problem with the problem statement. The idea is related to the challenge, but there is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. The proposer described being actively working on localization and translation maintenance of Yoroi in French for the last two years as partners of Emurgo. However, there is no information to check this statement. I would recommend including more details about your experience and something that can prove your contribution to Emurgo.\r\nThere is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 10, "ne": 4, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "As a partner of Emurgo,  you should work directly with them to support all the language with them.  it seems to me that you already have completed the work .  ", "q0r": 2, "q1": "For sure you have the experience in doing this but I feel that you are choosing the wrong forum to ask for additional fund.  Please provide quantity of work remaining and timeline ", "q1r": 3, "q2": "Hard to gauge how much you have done thus far so need more clarity as to how this project can be a success. ", "q2r": 2, "assessor": "z_assessor_574", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "The proposer has not added a plan or a timeline and has done the bare minimum for information  and details in their plan to get Yoroi translated to French. It is an amazing idea but it needs more effort put into it.", "q0r": 1, "q1": "There isn't a plan, but they are keeping on doing what they are already doing, do they just need more money. As well as this they are also experienced in this area. It would be nice to add more details next time.", "q1r": 4, "q2": "It is hard to audit the success and progress because there is no timeline or plan, or set of steps or extra information. They haven't included much details about the budget either. This makes it hard to reach their goal of getting Yoroi translated into french. This proposal has lots of potential, it just needs some more work.", "q2r": 1, "assessor": "z_assessor_585", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "On the surface this fits the challenge.  But is this a good use of the treasury?  Will this get done anyway without funding from Catalyst by Emurgo? ", "q0r": 2, "q1": "No information about the team is available excepting for the statement that they are already doing this translation.  Yoroi already has a French translation.  Is $2,500 needed just to do updates? ", "q1r": 2, "q2": "There is no specific KPI or tracking in the proposal.  ", "q2r": 2, "assessor": "z_assessor_607", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Provide Yoroi with an up-to-date localized French (fr/FR) interface, in sync with each new Yoroi update.", "experience": "We have been actively working on localization and translation maintenance of Yoroi in french for the last two years as partners of Emurgo."}