{"id": 414705, "author": "ddlezu01", "title": "CLAP for impactful research", "url": "https://cardano.ideascale.com/a/dtd/414705-48088", "category": 26605, "amount": 30000, "description": "Social enterprise related projects tend to struggle when it comes to raising funding for important issues and this can affect their well-being as well as subsequent motivation to continue.", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1044, "q0": "From the announcements made by IOG and Cardashift, there was no indication of any further future challenges in collaboration, meaning that this might be a one-time event. The previous Catalyst Natives challenge was also a one-time event. As such, the scope of this proposal, to apply the findings and experience of the funded proposers from this funding round to a future one, geared towards Africa could prove to be, unfortunately, to no avail.\nMaybe the team should have consulted before writing this proposal, to make sure that the work they will be putting into writing this proposal would not be in vain, and could have used the opportunity to write perhaps another one.\nFor this reason, I find it hard to agree with the impact of this proposal, since I’m not sure that it could be implemented, especially since the Cardashift team has clearly mentioned in the brief that they will “in its discretion, determine the suitability of the project proposals selected by the Catalyst community and carry out any checks or diligence before engaging with such project teams”. ", "q0r": 3, "q1": "The proposers have identified 4 steps for the implementation of their project, each detailed with a description of needed actions. What I’m unclear at this part of the proposal, is whether the number of months in the parentheses details the number of months needed to complete those certain actions or if it is the corresponding month on the timeline when that certain step will take place. Regardless of this detail, the team goes on to describe each step of the project with a summary for each. The budget is split into 5 categories, and each category has a bullet list of actions for which the amount is allocated for. What would have been helpful in assessing the budget and timeline would have been the addition of a number of hours needed for each action and a corresponding rate per hour. Without these data, it’s hard for me to gauge the feasibility of the budget, in terms of finance as well as in terms of time allocated.\nRegarding the team members, there is some detail offered for each of them, with corresponding LinkedIn links and previous Catalyst experience, as such although I would have liked to see similar amounts of information for each of the team members, I do not see a problem in not having it and consider the team as being capable to implement the proposal.\nThe team has answered as having another proposal in this fund and from previous funds, yet, although specified in the proposal submission, they haven’t provided any details, like titles, links, descriptions or descriptions on how the team will manage their time in relation to all proposals or if any of the proposals are inter-related with information benefitting one another.\nGiven the information provided, I find that the missing details keep me from agreeing or disagreeing that the proposal can be successfully implemented, as such, I will rate it with a score of 3.", "q1r": 3, "q2": "I find that for the purpose of this proposal, there could have been additional metrics provided in order for the community to verify the progress of the project. For instance, metrics related to the database they are planning to build, or the number of questions answered by the funded proposers. The process described by them in the detailed plan section had a great focus on the first steps of implementation, namely, database creation, survey writing or research,  yet here in the auditability section, they are being overlooked entirely.\nThe answer provided for the vision of success offers a glimpse into how the team sees their project and values it. As such, I find this answer to be reasonable.\nIn conclusion, while the answer to the success question is well written,  I find the progress metrics to be incomplete, according to the information provided in the other sections of the proposal.\nGiven this, I can only rate it a 3.", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 11, "ne": 6, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 4078, "q0": "The problem is that social entrepreneurship enterprises frequently fail to secure money for pressing needs, which has an impact on both their drive to carry on and their overall wellbeing. By doing research to learn what works with those who have already submitted CLAP ideas and what can be improved to attract more submissions, the proposal seeks to address this issue and then apply what is learned to African proposers. These would enable more social entrepreneurship ventures to receive funding, address pressing challenges, and benefit the ecosystem. The proposal successfully resolves the issue.", "q0r": 5, "q1": "The proposal should be successfully executed because the proposer has experience in both research and catalysts. The proposal does include a well-defined plan for implementation, and it also accounts for the resources required. The $30000 budget does seem a bit excessive. The project has been broken down into phases, and the proposer has considered all potential risks and offered ways to mitigate them. These increase the likelihood that this proposal will be effectively implemented. ", "q1r": 5, "q2": "The proposal's progress can be tracked because the proposer has specified specific tasks, each with a timeline. Additionally, they included a budget breakdown that will be helpful for auditing. The provided key performance indicators and Sustainable Development Goals can be used to evaluate how well the proposal is working. The proposer has also described how it will benefit the community and what success will look like. All of this information ought to be sufficient to evaluate the proposal's development and effectiveness.", "q2r": 5, "assessor": "z_assessor_2516", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4345, "q0": "The proposal solve the goals set out in the Challenge and identify the problem that needs to be solved when pointing out the difficulty of projects related to social enterprises when it comes to raising capital for important issues and does the team have an overview that is research to find out what works for people who submitted CLAP projects and what can be improved to encourage more people to submit and then apply this for African proponents. Thus, the team identified the problem to be solved and came up with a plan to improve the problem. In my opinion, this is essential because until now there has been a lack of financial attractiveness of ecosystem impact projects, with a focus on potential African proponents. Moreover, this proposal is implemented on the Cardano blockchain platform, it adds value to the Cardano ecosystem and can scale and solve the challenge in the future. If implemented and successfully applied, it holds the promise of scalability (in the present and the future). Because social enterprises have more ability to access capital from the community to carry out production and business activities, create a stronger financial foundation and increase the ability to make money from people. participate (bringing up economic life). In short, the proposal has a certain impact on the Cardano ecosystem and society, promising to be able to scale and solve challenges in the future. I strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "The proposer and team have experience in Front End web development, cloud computing, cybersecurity, decentralized applications, PA at Fund 7, etc... These experiences will greatly benefit the team in implementing Cardano-related proposals. The team has also provided full documents related to the proposal (websites, videos,...). Especially the Linked social network link, has the effect of publicizing the identity of team members. I am impressed with this because the detailed listing of members and publicity through social networks does not work for all proposals. I applaud the team for making this clear and very specific. The disclosure of identity through Linkedin facilitates the community to look up the members' identities and verify the feasibility of the proposal. The number of members in the group is 2 people, I understand these are the key members, the team may also have other members or collaborators who are not convenient to identify.\nThe budget is divided by items and sticking to the goal. The team simply lists the budget and shows the key milestones, However, as a PA, I still want the team to show even more clear details about the budget required for each small job so that the community can look at it and be more confident about the feasibility of the proposal. It's perfectly understandable for the team to present the budget as it is to people who already know the team well, but I suppose for everyone from the community (some people are very new - they don't know yet). know nothing about the team and don't know anything about this proposal) can understand it easily, we need a more detailed, more understandable presentation. That's my advice on budget presentation. I have an additional question, if it hasn't been funded by Catalyst in Fund 9, will the team continue to work on this proposal? What other sources of funding does the team have to be able to implement this proposal (including funding that comes from contacting support from other organizations)? I ask this question because I want to demonstrate the clear feasibility of the budget.\nThe plan and how to do it has been stated with a process of 4 big steps to do the work (I will call it 4 big steps). Each big step will be a small task - the team has shown professionalism in planning implementation. This is also one of the important factors in clearly defining the feasibility of the proposal. And the team is doing a great job of it.\nRegarding the necessary resources for implementation, I temporarily divided them into two main resources: financial resources (mentioned in the above budget) and human resources. With the current people and good expertise, the proposal can be successfully implemented. However, the proposal presented is that some members are also working on another proposal in parallel with this proposal at Fund 9. I would like to ask if this will reduce the quality of work on this proposal. ? Because human resources are scattered when implementing different proposals. I understand maybe the team has other members/collaborators to work together. However, I think the team should demonstrate to the community that even though there are currently members implementing another proposal, the human resources are still sufficient for the successful implementation of this proposal. It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal. If doing so, the team has made sure that there is an abundant human resource to implement this proposal and affirms the team's belief and most importantly, the feasibility of the proposal to the community. I have the confidence and ability to successfully implement the proposal in practice.\nIn terms of technique, technology and language used when implementing the proposal. It is a collection of technologies and skills: survey, information transmission, and synthesis, Cardano blockchain, a management programming language that stores information in a decentralized way, web assessment, connectivity Cardashift, etc... It's done by 2 very knowledgeable team members, specifically with ADA, the Cardano blockchain and Catalyst. This is the basis for me to believe that the team will do a good job when implementing the technical aspect of the proposal implementation.\nThe team is also quite clear about the risks involved in implementing this proposal: Access to Cardashift proponents is difficult due to time constraints and is a solution to risk prevention. I add a second risk which is Ada's slippage - which will affect the budget to implement the proposal. I would like to analyze this risk more closely: We know that the digital currency market is in a downtrend phase, so the price movement in the downward direction of digital currencies takes place from time to time day. That is also the reason why Ada may depreciate when Catalyst funds are allocated to the team, then the team will face the problem of a lack of budget to implement the proposal. Therefore, my advice is for the team to review and consider the detailed budget related to Ada's slippage to make an appropriate budget request. Even if more funding is needed, the team can come up with a full plan to test.\nJust now are my positive questions, comments, and advice that I would like to contribute. I hope the team can consider improving this proposal (add publicly the identities of some other members and be more detailed in the presentation of the work done. Comment on the feasibility of the proposal, I vote 4 stars.", "q1r": 4, "q2": "The roadmap of the proposal is presented in quite detail by the group with a total time of more than 12 months (the battle research phase is about 6 months). This is a reasonable roadmap and milestone for a proposal that takes time to implement. The work steps to be performed in each stage are very specific and in a step-by-step sequence - containing all the necessary information. However, I still have advice for the team that the team should attach the milestone roadmap to specific months of the year. If so, it will make it easier for the community to evaluate the transparency and auditability of the proposal. As a PA, I have evaluated a number of proposals and have found that not many teams can do this and this makes it easier for the community to quickly assess the transparency and auditability of the proposal. fast and accurate.\nI am quite pleased to see the appearance of the job performance index (KPI). This proves that the team has carefully and specifically researched to come up with KPI criteria. The KPIs of the work associated with the proposal and the KPIs are macro - I am satisfied (Proportion of population in a certain age group; Volume of official development assistance lines). We all know the role of KPI in audit. This makes it more convenient for the community to evaluate and audit the proposal. I consider KPIs to play a certain role in demonstrating the transparency and auditability of the proposal. However, I am still looking for key metrics, the team also knows that key metrics are as important as KPIs. So my advice is to quickly add key metrics to the proposal. That would be great - the proposal would have even greater transparency and auditability.\nI think the team defines \"what the success of this project looks like\" in a clearer, more specific way to demonstrate auditability, I credit the team for stating each of the related definitions of success. regarding the question of what success is. If the team presents a seamless presentation at the same time answering the question, without quoting another question, it will be better for the audit.\nThroughout the proposal, problems and solutions were clearly articulated by the tissue group. We hope that the team will consult with me, taking note of the addition of key metrics. I agree with the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5538, "q0": "I can see an alignment in the problem described and the challenge. Fund raising has been a major challenge especially to social enterprises, and due to that, projects within that sector tend to develop slowly if not stopped  due to insufficient funds to run activities (these projects need resources to be effective). This issue is one that falls within the critical points of the challenge and it will be a big win to Cardano if it’s considered.\nRunning through the provided key metrics and goals, they appear to fit into the challenge setting. The proposal’s approach appears to be scalable and functional as more African people in the ecosystem would be encouraged to apply for CLAP projects and also engaging workshops and new content with potential African proposers all about Cardashift system and how they can apply with proposals that can make a difference. However, I was expecting to see a brief explanation on what CLAP is; probably the full meaning and a brief background. CLAP projects might appear to be known by people but some people definitely wouldn’t have heard of it. That should be a matter of inclusion in future proposals. The proposer has indicated that there will be a come back to catalyst for further funding considering the fact that other resources need to be created. The proposal will be sustainable especially financial wise. \nWith all that have been said, I believe that the proposal is impactful.", "q0r": 4, "q1": "Given information provided about the team’s relevant experience, their expertise and considering the relevant links and references attached, I am confident that they have the required skills to execute the project. The budget presented is good however, the description of the sub-items are not exhaustive. For example, there are a number of sub-items under “Research phases for 6 months” which sum up to an amount of $10,000 and I think that it shouldn’t have been so. Same appears in the other items of the budget. For a better auditing of the budget, each of the items should have had their individual costs rather than the way they are presented. Despite this vagueness, the amount requested is still sensible and reasonable to achieve the desired outcome considering that some researchers and report services will be needed. \nThe roadmap is detailed; there is clarity in the timeline and deliverables. The plan does not present technical aspects that will need further explanation. \nIt’s good effort that the proposer has foreseen some risk that may arise during the implementation of the project and has provided measures to mitigate it. Apart from the issues raised concerning the budget, all the other points agrees that the project is feasible. \n", "q1r": 4, "q2": "There is clarity in the roadmap’s milestones/deliverables and time horizon and hence makes auditing easy. The metrics/KPIs were wisely picked and I am confident that they are good indicators for measuring success as the chosen outputs indicate the level of interest by Africans in the cardano ecosystem. \nThere is clarity in the description of the problem and I believe with the proposed solution, the problem will be tackled. It’s not clear which platform the proposer would use to share the project’s development with the community, so therefore I will recommend that the team make use of the catalyst community channels on Telegram, Discord groups and the rest so that members can track the progress of the project.\nI am of the assurance that the project is auditable.\n", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6412, "q0": "I like the idea for this proposal. There are a lot of proposals for this challenge setting that are implementing specific plans for the Cardashift project. The challenge that is recognized by this proposal is similar to what Cardashift is doing. The challenge is that there are lots of good projects that don't know where to go for funding. This project plans to help this by conducting research on these projects and meeting with them to discuss things such as what went well, what didn't go as planned, and how the projects could have done a better job. This will help influence the long-term plan of this project. The different companies and projects reaching out to Cardashift will know how to write a better proposal and will likely be more successful. For all of these reasons, I give this section of the proposal 5 stars. This can help bring more innovation to the Cardashift project and all of their startup projects as well.", "q0r": 5, "q1": "It is important to note that the proposer has included their identity in the proposal. They included a Linkedin profile and gives information on all of their skills and accomplishments. This is important because it shows that the proposer is confident in their proposal. This is because if they didn't accomplish this proposal if funded, they would be held accountable for it. This proposal includes a specific roadmap that details all of the things the team plans to work on that will help the Cardashift Native projects. The requested funds will support this proposed idea for around a whole year. The roadmap gives details in different phases of their project. Giving specific details in a proposal helps the proposer to be held accountable and increases the likelihood of this idea being implemented successfully. These are important details because it shows that the team has thought about this plan and have an idea on what they want to accomplish throughout their proposal. The funds requested are highlighted in the budget breakdown. It appears that the requested funds matches up with their budget. It highlights exactly where the requested funds will be allocated and helps the reader of this proposal to monitor the feasibility behind this project. For these reasons, I give this section 4 out of 5 stars.", "q1r": 4, "q2": "I was satisfied with the amount of information included in this proposal. It was really great to see that the proposer included their Linkedin profile and listed their specific skills and accomplishments. Something that I would include in this proposal is how this proposal plans to grow a community. Or in other words, how they plan to reach out to other projects planning to utilize Cardashift. They should create a plan listed in this proposal that suggests exactly how they are going to reach out to these companies to provide them their impactful research. Without a community or following of a group. It can be hard to be held accountable for a proposed idea. It is important to recognize the specific dates included in their roadmap and budget breakdown. This will help the community behind this project hold the team accountable.  For these reasons, I give this section 4 out of 5 stars. There needs to be more consideration on how the team plans to implement this into their proposal. The idea is to bring utility to the Cardano and Cardashift ecosystem. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12661, "q0": "- Issues to be solved: Projects involving social enterprises tend to have difficulty raising capital for important issues and this can affect health and motivation to continue. their customs later.\n- Solution to the problem: do research to find out what works for people who submitted CLAP projects and what could be improved to encourage more submissions and then adopt this for African proponents.\n- Ask for a fund of 30000$\n- addresses the 'impact assessment & monetization' section that helps determine the number of proof-of-concept tests that can be done with impact-driven projects. it is possible to determine what financial value can be derived from impact-oriented projects. Teams from funded projects along with members of the Cardashift team will help determine the time needed to validate the impact.\n- create resources to help potential proponents understand the difference between 'impact-oriented solutions' and projects that focus solely on 'Environmental, Social and Governance criteria ( ESG)'.\n- Risk :\n+accessibility to current successful Cardashift proponents and their ability to communicate due to time constraints.\n- The scale of the project can be scaled up.", "q0r": 5, "q1": "- Proposing to provide detailed information, specifically with a link to the information of the group members.\n- Have a clear, detailed implementation plan, Progress and milestones are provided fully and clearly.\n- Budget broken down into definable items including funding for 6 Months Research Phases (Desktop Research & Interviews): $10,000, Outcome Reports $5,000, Marketing and Advertisement $3000, Cardano Partners, Advisors & Maintenance $10,000, Others $2,000", "q1r": 5, "q2": "Have a clear roadmap with clear, specific timelines. To monitor the progress of the project proponents will measure interest in their resources which will be posted in groups for Africans in the Cardano ecosystem. measure engagement by replies, views, and comments.\n- an easy-to-understand description of the goal to be achieved: Understanding what can encourage more Africans to submit projects in Cardashift and have the ability to work together to deliver solutions to the areas that really matter while still ensuring financial security.\n- This is a new proposal.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "We will carry out research to find out what works with those who have already submitted CLAP projects and what can be improved to encourage more submissions and then apply this to African proposers.", "experience": "Community Advisor | Catalyst Challenge Team Lead | Community Manager for the Catalyst Africa Town Hall and Catalyst Africa School | Cardano Advocator | Postdoctoral Researcher at Oxford University | Crypto analyst |"}