{"id": 414884, "author": "henno", "title": "Nature conscious transactions ❤﻿", "url": "https://cardano.ideascale.com/a/dtd/414884-48088", "category": 26605, "amount": 5600, "description": "Currently our consciousness is dominated by economy. 🌍", "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"id": 787, "q0": "The proposal is seeking to address the modelling for an alternate economy, in which ecologically constructive activity or the transaction will mint a token and a destructive transaction will burn a token. The proposer has named it Original Issue Currency (OIC). As per the words in the proposal, OIC is designed to bring the living world we depend on for survival into the consciousness of every transaction we do. This idea has the potential to create an environment in the Crypto ecosystem where there is a potential to incentivise ecologically good things for the world. The overall problem is very involved however the mathematical modelling sought to be addressed in the proposal is a core issue and is required to be robust for the entire economy. Therefore the proposal is in alignment with the challenge. ", "q0r": 5, "q1": "Henno Marais who is the proposer is a B Techinin Industrial engineering and has more than 15 years of experience in Software development. Therefore he will be able to write the simulation software as per his proposal. The explanation videos and task listing is detailed and the heart of the problem seems to be rightly identified and articulated. There are a large number of associated risks and requirements in achieving practical use for the proposal. However, research and strong theory which are the hallmarks of Cardano will bring fruit after a large number of small steps. This proposal also is a step in the right direction and the proposer seems to be motivated to complete the project with or without funding. ", "q1r": 5, "q2": " The proposal is to fund 112 hours of work at the rate of $50 per hours totalling to $ 5600. The rate of $50 per hour seems to be around the market rate for a developer with such experience as  Henno. The work schedule and d the scope of each leg are fairly clear and look achievable. The output of the proposal will be a mathematical model hence the audit of the work will be involved and will require substantial participation from the community for evaluation. In spite of the complexity of the audit, the output of the proposal is well defined and the quantum of effort can be easily ascertained. ", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2404, "q0": "We believe that this proposal is in line with the goals of the challenge, as there is the development of a token that will be used in transactions with the aim of protecting the environment. In fact, if successful, this project has the potential to increase the visibility of Cardano's ecosystem. However, it seems that much work still needs to be done to get it to a level of completeness where it can scale. And despite being an innovative idea, the question also arises as to whether the public will adopt this model widely. All this makes it not so easy to see the impact of this project.", "q0r": 3, "q1": "In the project timeline we find actions that are relevant to what you want to build, it is also interesting to see that special attention was given to the mathematical modeling part, since this will be one of the main parts of the system. However, it would be interesting if the curriculum of the mathematician involved in the project had also been made available. As mentioned before, this is a project that seems to involve considerable risk regarding its future adoption, but we also see that the budget being requested is not too high. In addition, the budget breakdown demonstrates consistent capital allocations. We can then see this project as a prototype of something bigger that could be established, but for that, it seems that the current logic of creating and destroying tokens could be more refined to a simpler idea.", "q1r": 3, "q2": "Regarding the perception of success described by the project, we noted that more details could be provided so that we could better understand how the impact managed to generate impact with its new transaction model. Some targets could be provided, even if approximate, of the expected number of users that the project aims to obtain or an average monthly volume of transactions to be reached in the future. Furthermore, regarding the monitoring of the project's evolution, it would be nice if there were more parameters indicative of the general progress. For example, the tool that will be used to share the results could have been indicated.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "This proposal as an outcome has nothing to do with the expected number of users or monthly volume as suggested by the assessor. This is a building block needed to get to that stage. In previous challenges I was asked to break this project up into smaller pieces and this is exactly what this proposal aims to do. The assessor also missed the goal of the auditability for this proposal. This is centred around building a model that is viewable and can be executed by the community as a working model developed in Javascript. To get the model working this is not needed. The only reason this is going to be developed is so the community can audit the outcome of this project."}, {"id": 6413, "q0": "I found this proposal to be very interesting. To start off the assessment for this section. It is important to include that the proposal aligns with the challenge setting of Cardashift. Without recognizing this, it may have come across as not as useful. However, I appreciate that the proposal included this in their proposal. The challenge is that the current consciousness in the world is focused on the economy. This proposal plans to change that consciousness to having more of a focus on nature and our environment. The proposed plan is to create a new economy based on the Original Issue Currency or OIC. This would become a token that promotes the idea of supporting nature and our environment. The idea is that this shift on the community's consciousness would shift their focus from the economy to nature and the environment. This could benefit the Cardano community by introducing more community members who find these principles to be important. For these reasons, I give this section 4 out of 5 stars.", "q0r": 4, "q1": "There is a good amount of information included in this proposal. There is a Linkedin profile for the proposer. This is important because it allows the readers of the proposal to verify who exactly will be working on the project. This helps ensure that the proposer will be held accountable for this project. I enjoyed reading that the proposer still plans on accomplishing this project even in the case that they are not funded in this process. There is a specific roadmap that splits their process into 4 steps. 1 step for each month. Meaning that this project should be implemented within 4 months. There is also a detailed budget breakdown that includes a lot of specific information. It shows where all of the requested funds will be allocated and given to each section they will be working on. It shows the amount of hours that will be worked on this proposal. This is important because it holds the proposer accountable to this information and will likely include the community helping ensure that these nature conscious transactions are implemented successfully. This plan appears to be feasible and includes specific information that allows for the verification of this process. For these reasons I give this section of the proposal 4 out of 5 stars. ", "q1r": 4, "q2": "The proposal was well-written and included sufficient information. It was important that the proposer included their identity. As stated above, this allows for the proposer to be held accountable for their proposal. However, there needs to be someone or a group of some sort that will be able to hold them accountable. For this reason, it is important for the proposal to have a community behind the project. Or just a group that is interested in the proposed idea. In this case, it would be people that are excited about the Nature conscious transactions. The proposal included specific information and was very detailed in many of the questions. This helps audit the potential success of this specific proposal. There is still another important metric that should be carefully considered by the team behind the proposal. This has already been mentioned several times above. The metric is accountability. This is mentioned a lot because without it. There is no way that the decentralized space can hold anyone accountable to the proposal. The individual could walk away with the funds without benefitting the Cardano ecosystem at all. For these reasons, it should be considered and implemented into this proposal. I give this section of the proposal 4 out of 5 stars because I believe that it can have a loyal community and bring more utility to the Cardano blockchain. These members just need to be found first.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14146, "q0": "The author is addressing the problem that the current economic system is built for abstract profit only without considering the real world implications of the pursuit of profit. \n\nThe proposal’s problem statement addresses part of the challenge settings, namely that the monetary value of projects/products is not necessarily in line with their value to society. This project is a creative marketplace solution to the challenge. In a way this project goes above and beyond this challenge, because it aims to be applicable not only to impact projects, but to every transaction (still including those in impact projects), incorporating its impact into the transaction.\nThis proposal fits very well with the two points for what success in this challenge means. It is an innovative way of creating financial value out of the impact of projects/transactions (first point) because it gives more financial value to environmentally friendly transactions, so projects that aim at protecting the environment have more potential to generate large profits. It also increases transparency and traceability of the impact generated by impact projects, and also by any transaction, by allowing the customer to see in which ways the product affects the environment and how that determines price.\n\nThis proposal could be improved by giving more detail on how this project is integrated into the Cardano ecosystem. It is not explicitly spelled out how this project will add value specifically to Cardano.", "q0r": 4, "q1": "In terms of feasibility, a lot of work has already been done on the project, as well as a trial at the school. This is promising because it shows the author is motivated, has necessary technical capabilities, and has already completed important prior steps. Another strength is a detailed breakdown of costs and time, for example 8 hours to develop the variable framework for $400. Given the expertise involved in the coding and creation of the mathematical formula, the base rate of $50 per hour is reasonable. \n\nThis proposal could improve by clarifying who the mathematician is that the proposer will be working with. What is their experience? ", "q1r": 4, "q2": "This proposal does give a roadmap with milestones and how many weeks it will take to achieve each milestone, which is a strong point in its favour. \n\nA weakness of this proposal is that the indicator of success mentioned does not take into consideration the scale at which the token is adopted. This can be addressed by giving an indication of how widely the token should be adopted for success. Also a way to measure the scale (eg. number of users) should be included.\n\nFor community tracking, the proposer should also specify where model and equations will be shared.", "q2r": 3, "assessor": "z_assessor_3925", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15340, "q0": "I have to say I’m torn about this proposal, especially after watching the introductory video of the OIC project. OIC is labeled by its creator as a new form of monetary system that prioritises nature in every transaction. The reason why I said I’m torn is because even though everything presented in the premise of the project is very sensible, the actual implementation plan is lacking and I found it to be very vague.\n\nFor instance the proposal mentions that “we need to build out a mathematical model in a way that also destroys or burns tokens when the environment is damaged” but doesn’t give any example of what would constitute damage to the environment done by an individual participating in this new monetary system. As presented in the introductory video of the project, it’s not individual humans, but companies and the way the general macro economic model is incentivised and operates is what causes the vast majority of the environmental damage not individuals. But individual human would be using this new model, not corporations or companies. So, as of now, I’m unconvinced of the impact this project could have in practice, and in turn what impact it could have on the Cardano ecosystem.\n\nHowever, I would like to encourage the proposer to keep iterating on this project, as it is definitely a worthwhile effort and a very important project to solve. And potentially resubmit an improved version of the proposal in a future fund.", "q0r": 4, "q1": "The implementation plan is suitable for an MVP/developing a concept of the project to be further refined. It covers a period of 4 months.\n\nThe presented budget is broken down by tasks which are budgeted for at a reasonable rate of $50/hour. However I have found the time estimates for most tasks to be highly underestimated, unfeasibly low. For instance I think it would be highly unlikely that the “developing the variable framework” task would be completed in just 8 hours. This has me a bit concerned about the feasibility of the project overall. I make this observation as a project manager with over 15 years of experience.\n\nThe proposal has one main implementor, the submitter himself. Judging by the provided LinkedIn profile, the proposer seems like an accomplished professional with considerable experience in e-commerce. Mention of hiring a mathematician is made in the proposal, but no exact name or reference is given and that would have certainly been a plus, considering that the proposal places such a great emphasis on “getting the mathematical equation correct” - something that is even mentioned as a risk to the project if not successfully implemented.", "q1r": 3, "q2": "Unfortunately the auditability section of the proposal is by far the weakest link.\n\nAs it is presented now the Auditability section, lacks sufficient detail and clear metrics or KPIs.\n\nA few suggestions of what is required to turn this into a successful Catalyst proposal: clearly described, objective, trackable metrics and KPIs that enable easy monitoring of progress; a more detailed description of the problem it aims to address, namely how the OIC system will function; an easy to follow conceptual plan for achieving the stated goals of the OIC.", "q2r": 2, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We benefit from a fabulous 4-billion-year-old legacy bequeathed by the Earth. 🌍 Let's bring this into consciousness with every transaction we do. With a fungible token on Cardano this can be done.", "experience": "Studied as an industrial engineer and have been working in e-commerce for many years.\nRead more here: https://www.linkedin.com/in/hennom/"}