{"id": 416182, "author": "altimario", "title": "e-Learning DAO,Revenue share policy", "url": "https://cardano.ideascale.com/a/dtd/416182-48088", "category": 26605, "amount": 10000, "description": "Content and course creators are poorly paid.\nDevelopers don't own the e-learning platform and cannot claim revenue.\n75% (on average) of the student money goes to Ed-Tech giants, such as Coursera.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 8850, "q0": "As Ed-Tech giants are ruling the countries all over the world by holding monopoly of E-learning , where it sometimes denies poor people from education, and it even pays very much less to its developers or Teachers, Hence to overcome such scenario the proposer wants to make the research and introduce an idea where DAO Ed-companies in the future, where he wants to decentralize the ownership among the developers so that , everyone gets well paid and where every student can gain good education in most economical fashion. Hence ,This proposal effectively addresses the challenge.", "q0r": 5, "q1": "Since the team here is not about building E-Learning platform, it is about developing a scheme on  decentralizing e-Learning platform, the rules to share revenue streams will be of very difficult hence to build solutions that can be used in other projects of future  or proposer's other project which is mentioned here, the proposer has 22+ experience years in the IT industry ,where he has even worked in Ed Tech industry, hence with the relevant experienced gained in working all industries, the proposer's team can come up with a solution to overcome market giants monopoly .Hence, with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has provided proposed solution in very detailed manner and has tackled the issue caused by Ed-Tech and their monopoly in the current world, the audit has provided the details of all the members who'll be participating the project development and their experience in web development.\nThe proposed solution has detailed budget breaking scheme , with distributed cost on hourly basis, the proposed solution even has well structured timeline to complete the project , with the experienced provided the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9702, "q0": "This proposal addresses an situation which they deem unfair in the e-learning sector. The goal of \"sharing the cake\" in a more equitable manner is valid and honourable There is a lack of detail regarding exactly how this would play out, in relation to tokens, Cardano etc but it seems that gathering the relevant information and expertise is part of the goal if funded. This project would be of broad benefit to those directly involved in creating and managing online courses and would also benefit the Cardano commu ity as many members would fall into this category and it is line with the general Cardano ethos of creatin fairness and improved living for all. There is a risk of big companies taking all the profit in the e-learning space - this initiative would contribute to this not happening. If this concept became a working solution it could definitely be applied on a larger scale.", "q0r": 4, "q1": "The team players involved are experienced and have many applicable skills for the tasks at hand. Mention is made of the need for a Cardano expert, and hopefully this person will be found. The timeline is for the first three months and there is no description of what will happen after that. Similarly, the funding requested is to cover salaries for 1 or 2 months for different participants, but there is no further information on how the project will continue. The timeline seems too short with regard to creating and implementing this project but maybe this is just to get it up and running and after that other means will be used.", "q1r": 3, "q2": "There is a clear explanation of the ultimate goals regarding compensation for all involved in the creation and maintenance of content but the the path to achieving this is less clearly laid out. The progress is transparent due to the nature of the technologies involved and the creation of a website. I think the people involved know how they will get there, but haven\" explained it all in the proposal. Perhaps.", "q2r": 4, "assessor": "z_assessor_3085", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11055, "q0": "Currently developers don't own e-learning platforms and can't claim revenue, so course content creators are underpaid. On average 75% of student proceeds go to giant Ed-Tech companies. Thus, the ratio of benefits between stakeholders is too big (average 25% and 75%). Your proposal solved the above problem by building an e-Learning DAO platform that will share the revenue among all involved stakeholders, determine the ownership of the e-learning platform among the developers. develop. In my opinion this is a very good proposition because it clarifies the revenue among stakeholders, the percentage of profit each party enjoys and it raises awareness about the e-Learning DAO and its social potential. The proposal mentioned a possible risk of finding human resources to code. The way you explain to reduce the risk is that creating an \"e-Learning DAO\" is about providing not only remuneration to the developers but also ownership of what they have created. I agree with your explanation.\n", "q0r": 5, "q1": "I have read your proposal very carefully, I see that you build an e-Learning DAO platform that brings benefits to stakeholders that are: Expanding the scope and scale of learning, creating opportunities for learners to have more option; defines the benefits for content creators and developers in a peer-to-peer manner as it is determined based on the activities of each contributor. On-chain learning data proves the learning process, more transparently verified and traceable. The proposal gave a detailed budget analysis, I see your project is planned for 3 months but the expenses are in 1 or 2 months, I don't quite understand this. I would like you to clarify more how you will profit through this project? Socially, I think this proposal has great potential as an important part of building a fully decentralized e-learning platform managed by the DAO. I see that the proponent has provided quite enough information about the two co-founders of the project, but in my opinion you need to find more partners to increase resources for the implementation of the proposal in the near future.\n", "q1r": 5, "q2": "As you describe the e-Learning DAO is fully open managed and includes open source modules, you will create a web page containing information about the progress and status of the development. Currently, you do not have a WEB address, so it is difficult for voters to evaluate the measures of the proposal, you need to provide specific metrics equivalent to the blueprint so that they I can check the progress of the project. I hope you add more to make the proposal more complete\n", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 13879, "q0": "This proposal is a section of a 3-part e-Learning DAO being developed. This specific proposal focuses on the revenue sharing policy and clearly fits within this challenge criteria of demonstrating and monetizing impact. \nAlthough the smallest budget request of the series of proposals, $10,000, I believe this revenue sharing policy is vital to the success of the entire e-Learning DAO. As an overly general statement about human nature, people will voluntarily contribute, however, this is finite, and for a system to ensure quality and longevity there needs to be financial or other rewards in place. \nThe possible impact of this idea is tremendous, no ‘big company’ to take 75% of the revenue - instead it’s funneled to content creators, knowledge evaluators, developers etc. and the community all get rewarded for supporting the platform. \nAs long as the pieces of the other projects come together successfully, I can see content creators ‘jumping ship’ from other platforms to earn a fair wage and be actively involved in the distribution of their educational materials. For this main reason I rate the impact for this proposal as 5 stars.\n", "q0r": 5, "q1": "When considering the feasibility of this project there is one initial concern that has been slipped into the proposal, but hidden amongst the impact brief. The proposers have conducted indepth research regarding online learning models, and have created several good hypothetical models how the decentralized funding structure could work. However, they also honestly admit that they do not have the relevant experience and that they will require the support of a functional analyst to design a detailed solution for the problem. Within the timeline this is the initial item to begin with, and budgeted for, however, this staff member is not listed in the briefing below. Effectively, the proposers are saying they have a problem with achieving the challenge - and ‘hope’ to find someone who can fix it for them.\nApart from the functional analyst, the other staff members are adequately described and planned for. Full biographies, LinkedIn connections and a list of possible developers on Github is provided. \nThe timeline of 3 months fits concurrently within the timelines of the other connected e-Learning DAO proposals. The months each have 4-5 itemized achievements, but there are some fairly significant decisions needed during the process. I wonder whether there will be mass community voting, decision or involvement at this early stage, when deciding ‘splitting the revenue cake’ and the platform % ownership dilemma. On one hand, it’s simple for the functional analyst to make these decisions. On the other hand, this project is about community involvement, open-source and giving back. Why not start early and use the community members to vote on several proposals? Getting buy in at the early stage, people feeling their voices are heard will definitely help further down the line to quell revenue distribution arguments.\nOverall, the proposal clearly lays out the timeline, the team members (and proposed addition) and a sensible funding plan to achieve this component of the overall plan. I give it a feasibility rating of 4 stars.\n", "q1r": 4, "q2": "In one very simple way we can check if this project has succeeded - are people involved in the e-Learning DAO receiving some sort of payment! This includes content creators, like teachers such as myself, receiving payment when new students join a course. Software developers are paid passive income for the code they created and are maintaining constantly. As well as the small portion of revenue heading to the DAO treasury.\nWithin the development of the project the team through items on their action plan will openly share information with the public or Cardano community members interested via Github commits, pull requests and bug tracking. They also have communities on different platforms and channels, such as Discord. Finally, during the construction process they plan to create a dedicated website that will showcase their progress in relation to the developmental stages.\nFrom the simple standpoint that this proposal is a ‘success’ if someone can ‘show-me-the-money’ they have earned, I am rating it 5 stars for its ease of auditability and transparency.\n", "q2r": 5, "assessor": "z_assessor_3840", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 15224, "q0": "This proposal is connected to “e-Learning DAO, Builds the platform”. The two proposals complement one another. Together they will propel the development of an e-learning platform based on a DAO, where the revenue stream is equitably distributed between several members: the developers, the content creators, the knowledge evaluators, marketing, publishing and the DAO treasury. This proposal is focused on drafting the revenue stream calculations and a possible tokenomics model. Based on this system, not only does the content creator get a much bigger share of the content revenue, but there are several other individuals involved in this split, whereas in the current format, the split is only between the content creator and the distributor - who receives 3/4 of the revenue.\nThe e-learning market is growing by the day, and besides that, it’s a very important one. Education, if done by actual professionals, not just YouTubers with relative expertise, can help grow the knowledge of interested individuals. I, for one, have learned a lot from the Lynda.com (now on LinkedIn Premium) courses and as such, I am excited about the prospect of this proposal and its impact on the Cardano ecosystem. ", "q0r": 5, "q1": "The plan is divided into 2 big milestones, together totalling 3 months of work. In the first milestone, the team will be focusing on defining the workflow for the revenue stream, calculating the fixed costs and the tokenisation model. In the second milestone, the team will be focusing on more practical items like a website and marketing strategies across several social platforms.\nThe budget has a monthly salary approach for 3 months plus one-time payments for jobs that will be shorter than the entire span of the plan - like designer and marketer. However, what is unclear here, is the fact that the detailed budget totals a much larger amount than the requested sum. There is no mention of the possibility of having the budget split between the two proposals, as such, I am unsure what to make of it.\nThe team members are highly skilled, I was able to look through the information provided and given the knowledge and experience they have, I see no impediment in the implementation of the project. \nBecause I am unclear about the budget, I cannot rate this section the maximum score.", "q1r": 4, "q2": "The auditability of the project’s progress is very easy to execute by the community. The team will be providing all updates on the proposal through a specially created website and besides that, the project is open-sourced, as such, the progress of commits, pull requests and bug tracking can easily be done on GitHub.\nThe success definition is very detailed. The only missing detail from this answer is a clear, quantifiable metric attached to each goal. But, since the rest of the proposal provides ample information, I do not see this omission as being impactful on the auditability of the proposal. Therefore, I will rate this section a 5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "e-Learning DAO will share:\n\nrevenue among all of the stakeholders who participated, such as teachers, verifiers, content creators and publishers\nownership of the e-learning platform across developers\n", "experience": "22+ years in the IT industry which includes these fields:\n\nSoftware consulting for large enterprises and governments (Italy and UK)\nTech-Startup\nAI & Machine Learning\nOpen-source contribution\nEdTech\nResearch\nInternational patents\n\nProposals funded on Fund 7 and 8."}