{"id": 419097, "author": "sheltersontheblock", "title": "Impact NFTs for the Homeless: SOTB", "url": "https://cardano.ideascale.com/a/dtd/419097-48088", "category": 26605, "amount": 14900, "description": "Los Angeles has the highest homeless rate in the U.S. and has the second-largest homeless population. The city is facing a multifaceted humanitarian crisis that has many potential solutions.", "f6_no_assessments": 5, "f6_rating": 3.866666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3895, "q0": "The issue being Los Angeles having highest homeless rate in the U.S and second largest homeless population and it is facing a multifaceted humanitarian crisis. The proposer is trying to resolve it by raising fund thorough a non-profit NFT project that provides awareness about various solutions to homelessness. These proposal does help to resolve issue to some extent but for short term and they have to keep raising funds to keep going.  This won't be helping in growth of cardano ecosystem. The proposal does addresses the challenge but works for short term", "q0r": 3, "q1": "Based on the details given the proposer already have experience in NFT space, photography, social media marketing, and community building. Which should be sufficient to carry out this proposal. The have provided a clear understandable plan to execute the proposal. Without the clear budget breakdown it is hard to say if the budget demanded is justified. The proposer have considered all possible risks that could affect proposal implementation. it is likely this proposal will be implemented successfully", "q1r": 4, "q2": "The proposal do consists of a clear milestones and detailed time horizon even though Air Drops phase may vary depending on the NFTs sales and these have also provided details on how projects progress can be measured all this should be enough to track the growth of the proposal. The proposal also consist of sustainable development goals which will be useful for the auditors. The proposal also consist of how success of the proposal would look like. all these will be helpful to audit the success of the proposal. With these info the proposal's progress and success can be audited ", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9938, "q0": "The proposal suggests to alleviate the homelessness problem, record interviews and monetize through NFTs. Documenting the success of the process as evidence of impact responds to the challenge. I like the idea of clear focus on some specific area of a wide problem. Measuring impact and making it an attractive investment opportunity is becoming really viable only with ongoing digital asset revolution and a lot of brave experiments are needed to find the right systems and parameters in place. \n\nCapturing information about value creation in NFTs is a new and rapidly expanding topic. All the experiments on that area push in the direction of finding the most effective solutions. This proposal’s approach to record interviews catches the evidence of what has been done as well as the person's subjective evaluation of the perceived utility. This responds specifically to the measurement side of the challenge. The success of incentivizing to remove homelessness problem through NFT based market dynamics would potentially translate into solutions for solving other social problems as well. \n\nThat said, I don't see empathy, donations and philanthropy to have a scalable and long term effect of eliminating this problem. The challenge asks for tooling to bring the impact and the market mechanism together for creating incentives and information systems to work at scale. The tokens should carry this impact-information as efficiently and functionally as possible.  \n\nSome thoughts for the future considerations to impact more effectively on things like verifiability, traceability and monetization (as the challenge states) of the created impact:\nHow to make informational metadata of the NFTs as versatile as possible. How to keep NFTs connectable to each other within the same story when the story evolves and new impact and information becomes available. How to apply self sovereign identities and zero knowledge technology for a possibility to remain anonymous but being able to prove certain things. How to make information as verifiable as possible (signing them with DIDs of different participants perhaps). How to make information easier to analyze and evaluate with automated tools and AI. \n", "q0r": 3, "q1": "Information about team members is well available and they are definitely capable of accessing the core of the homelessness problem and recording evidence of experienced impact. However, in my eyes, there is still a lot of uncertainty in being able to technically design and make the NFTs effective investable assets.\n\nThe implementation has been divided into very logical and intuitive phases with tentative time estimates. The budget breakdown is similarly clear and reasonable. It is a great advantage that the work is already going so many first step risks are mitigated. \n\n\nBeyond the NFT sales, so far, the future funding seems to be dependent on Catalyst. Developing the NFT infrastructure and impact token solutions further is a great challenge to this project and a successful implementation of the scope of this proposal would likely amplify the funding opportunities. \n", "q1r": 3, "q2": "The implementation plan is pretty detailed with time estimates so it would be possible to measure the progress against this schedule. The proposal does not describe any specific progress reporting but their social media content is likely to give a view where the project is going.  \n\nThe main goal and indicator of progress/success is the number of NFTs sold to raise funding. There is also a plan to regularly post content about homelessness on social media and track the number of followers. Technical development steps of the blockchain and token components are to be determined. \n", "q2r": 3, "assessor": "z_assessor_3138", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 15080, "q0": "The proposers have established partnerships with local nonprofits in Los Angeles and proceeds of the planned NFT sale go directly to these organizations. As the proposers put it: “Our goal is not to solve the whole homeless crisis, but to focus on one solution and educate the public about that specific approach”. The money collected is only going to house a fraction of the 60,000+ homeless people in the city, for a limited duration, but it’s a good start (16 people for five months). This project makes people think and shines light on the issues and those delivering solutions. Obviously, although not highlighted by the team, this will also bring goodwill benefits to the Cardano blockchain and community.", "q0r": 5, "q1": "I watched the recording (https://youtu.be/kRsT8QOX4VM) where Shelters on the Block discussed their proposal. Based on what I’ve read and heard I can say that there are no strings attached, no profit motive. This is pure philanthropy and the team volunteers their time. Yet it is not a one-off deal: 20% royalty is charged on any sale in the secondary market and this goes directly to Uncle Dave's Housing. This way, the benefit can last longer (and if a wealthy crypto investor buys one of these NFTs one day, the resulting impact can be huge). The team is pure at heart and committed to the cause. Their existing partnerships and network guarantee safe delivery. And, needless to say, the plan is just brilliant. The long-term goal is “to turn this NFT project into an official club at the University of Southern California so other students can carry on the mission and have an opportunity to gain experience in blockchain”.", "q1r": 5, "q2": "The way this proposal addresses the challenge is unique. It’s basically a Proof of Concept for NFT Philanthropy where the power of blockchain shines through: all transactions are made public and nothing goes to the organizers’ pockets. Moreover, the (US) participants even get a receipt for tax deduction purposes, directly from the smart contract. The team goes to great extent to ensure auditability: they update their social media channels, post videos of the residents and even commit to upload a proof of residency once the tenants have settled into their transitional homes (and ultimately, hopefully, to permanent housing).", "q2r": 5, "assessor": "z_assessor_2156", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15106, "q0": "The proposal has the aim of creating an NFT project centred around homeless people in Los Angeles, California. By telling the success stories of some who have succeeded in breaking free of homelessness with the help of the organisation called “Uncle Dave's Housing” and then minting those pictures shot with a film camera as NFTs on the Cardano blockchain they will use all the proceeds from the mint to fund the housing of 16 other men or women and help them on their transition to permanent housing. \nI find the plan provided to be well thought out and the impact it could have, first of all on the homeless people and then on the Cardano blockchain, to be very positive. I agree with the team that the perception regarding homelessness needs to be changed and having this project tell the stories of successful individuals means the first step in that direction has already been taken.\nGiven the information provided, I will rate the impact of the proposal a 5/5.", "q0r": 5, "q1": "As a filmmaker and NFT project creator myself, I find the plan provided by the team to be well thought out and reasonable. The 5 phases to be implemented are well drafted, starting with the first one that has already been completed - finding a Non-Profit organisation aligned with the team’s goals - and ending with a potential continuation of the project in the future - finding a new organisation and starting a Club at the University of Southern California, where the proposers are currently studying.\nRegarding the budget, however, I see that the amount set aside for smart contract development is only $5000, yet none of the team members seems to be a Plutus developer. Since I know the rates of Cardano blockchain developers to be around $65-$90/hour I wonder how the team will be able to accomplish this. Because of this, I would have liked to have more information to be able to judge if the budget is feasible or not.\nAs mentioned, the team includes no Plutus developer and that would have been no problem if the budget would have been thought out according to the community rates - or an agreement already set up with a developer willing to work on a lower rate for an NFT project of such intent.\nBecause of this, I cannot fully agree with the implementation of the proposal, but I think there are solutions to the problem I mentioned, therefore, I will rate this section a 4.", "q1r": 4, "q2": "Given the nature of blockchain, the auditability of an NFT project is very transparent. By setting up an address for the Non-Profit organisation, anyone will be able to track the profits of the sale. The team will also do an airdrop with the story of a new individual who has been successfully housed due to the NFT sale and as such, the people who have bought the NFTs will receive proof of their investment. A proof that is visible to anyone on the Cardano ledger.\nThe success of the proposal is well articulated, having sold all 500 NFTs would generate $50000 for the organisation and they would be able to house all 16 intended individuals.\nGiven the auditability of the proposal and its success measurement, I will rate this section a 5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15326, "q0": "This proposal seeks to use NFTs to raise funds to help 16 needy recipients receive 5 months of housing. This is indeed an impact project but it does not constitute an answer to the guiding question of the challenge, namely, “What kind of tools, interacting on-and-off-chain, can we develop to measure and value impact financially?”. The challenge setting prompt lists a few examples, mostly related to various form of tokenizing impact. I’d suggest that the team tries to figure out how these impact NFTs can be linked to the success of the people supported. Perhaps, the buyers can receive some tangible benefit by holding these NFTs. For example, the NFTs could represent a share in some liquidity pool that the recipients contribute to once they’ve got a job and a stable income. This way, the positive impact is monetized.", "q0r": 1, "q1": "The team is diverse and have relevant experience. For example, one with a 30k Twitch following which could be immensely important for the sales of these NFTs. The project founder Angel Dominguez has a business school background. However, they do not have a blockchain developer on the team nor someone with technical background. This should be something they could solve but speaks against the feasibility at this stage. Plutus developers are scarce as it stands so if they don’t already have it then that’s a big drawback. NFTs can be minted seamlessly through various platform services, however, but the fact that the proposers do not indicate awareness of this could be a sign of a lack of involvement in the Cardano NFT ecosystem. ", "q1r": 3, "q2": "The auditability refers to the ability for the community to continuously track the progress of the proposal. The community can follow the progress through published videos of the interviewees, they propose to airdrop a second set of NFTs to NFT holders (though I don’t understand how that proves that the project is indeed progressing as intended) and they propose to post content on social media to spread awareness about homelessness twice a week and the number of social media followers. It is unclear what the social media they refer to is. Assuming the goal is simply raising funds for these homelessness NFTs, then these metrics are broadly speaking reasonable because they do measure both progress and outcomes (social media could proxy sales). However, general biweekly reports on what the team has done would probably be more informative in general. ", "q2r": 4, "assessor": "z_assessor_2447", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A non-profit NFT project that raises awareness about the different solutions to homelessness. The proceeds from the sale will be used to give housing to those struggling to find a place to live.", "experience": "We are a team of dedicated USC students that want to give back to the LA community. Our team has experience in NFT investing and sales, film, photography, social media marketing, and community building. We have the skills and experience necessary to make this project a success."}