{"id": 419685, "author": "petr.smelik", "title": "Professional close-out video report", "url": "https://cardano.ideascale.com/a/dtd/419685-48088", "category": 26605, "amount": 29800, "description": "Every project has to create a final report. Despite the effort, the message is long and badly recorded on web cameras. Usually doesn't have the outreach even though the project is great.", "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"id": 10580, "q0": "In my opinion “Professional close-out video report” is a good idea. The proposal has mentioned the issue that is attracting a lot of attention today, which is: \"Every project has to create a final report. Despite the effort, the message is long and badly recorded on web cameras. Usually doesn't have the outreach even though the project is great\". The proposal identified the main objective of creating professional videos with actual interviews and footage based on the nature of each project to prepare broadcasters and internet platforms thereby spreading knowledge about impact projects, Catalyst, and Cardano. I think the idea that this proposal gives is reasonable and necessary. Catalyst and the Cardano ecosystem have more and more applications in real life, but that is only a small part or only focuses on a few specific areas. Currently, the concept of Catalyst and Cardano is still relatively new to many people, not everyone is introduced, oriented, and deeply researched, which makes Cardano not popular in many places. Hence the idea to create 4 short videos, presenting 4 different completed projects in Catalyst. In it, each video contains content related to the founder's interviews and footage based on the nature of each project. I think this will be an effective solution to communicate Catalyst and Cardano to the community because watching videos and clips summarizing the main content will avoid the phenomenon of people being bored and distracted like when they read articles, articles about lengthy and without highlight, keywords. Moreover, each story is summarized, simply, well and logically, with high accuracy, which will be a plus point to attract many viewers because through that they don't take too much time and still grasp its content and receive the necessary and accurate knowledge. Besides, this video is made in English, which is a common language used by many countries, which will help expand the market and scope of the project. Not only that, but now that technology is increasingly modern and constantly developing, these videos are prepared for television stations and internet platforms will be a good opportunity to expand the scale of communication to many people and many places. Moreover, these videos are not created with a rigid structure, but on the contrary, the videos convey two contents: interviews and scenes with quite a flexible layout, meeting the requirements of broadcasters in case they want to use the entire video or separate each part to suit their end purposes. The solution proposed by the proponent I found identified the problem of the challenge. To successfully implement the project, the proponent has foreseen the risks they will face. There are 2 main risks mentioned, First, The risk is the timeline and scheduling because it depends on the duration of the projects, they can't guarantee to meet one video per month and they just try their best. Second, they have difficulty choosing a project to film because many projects coexist and they are relying on their judgment. I think, in this section, the proponent should add more specific measures to proactively handle difficulties instead of just promising to try their best, such as having difficulty in choosing a project, In my opinion, in this part, the proponent should build a tool and a set of criteria to screen and select the best and most optimal projects, arrange the projects by difficulty - easy, complexity or sort by topic of projects. This will help them make the right choice quickly, ensuring the time and quality of the videos.", "q0r": 4, "q1": "The proposal presented a very detailed and clear implementation roadmap. The project is planned to last for 4 months to create 4 videos showing 4 different stories. The cycle of each month will be repeated so it is easy for everyone to follow. I think it is reasonable and necessary for the proponent to break down each month's work into smaller timelines by week. By breaking down the phases and clearly defining the goals and specific work of each week, it will make it easier for everyone to track and capture information, and also help the project team easily control the progress and quality of each part. Here, the proponent also mentioned the fact that it is unlikely that there will be 1 video every month because there may be reasons in the production process that cause everything to be overlapped and delayed. By grasping the situation and sharing these limitations and bad things of the proponent, I can see that they are very enthusiastic and ready to face their difficulties. Regarding the project's budget, the proponent presented a reasonable way to allocate and use the specific budget for each project and each week of implementation of each project. However, in my opinion, when implementing any project, it is impossible to avoid unexpected difficulties, so if possible, the proponent should deduct a small part of the budget or apply for additional funding to set up the project reserve fund, minimizing risks. Regarding the participating team, the proponent provided information about 4 positions, their name and experience are presented, the proponent also provided additional social media links of the team members so that everyone can easily access, search and evaluate the accuracy of information if needed.", "q1r": 4, "q2": "To measure the progress of the project, the proponent indicated that they would measure video production within the timeframe allocated as part of the implementation roadmap. Their goal is to create videos without focusing on views, downloads, etc. I do not completely agree with this opinion, because the criteria of the number of views and the number of downloads, show the quality of the video and also assess the community's interest in the products, determining whether their results meet the needs of the community. The success of the project is also clearly defined by the proponent that regardless of the type of platform sharing their work is considered a success. I think that's quite reasonable because if only the quantity can be guaranteed but not the quality, it's not attractive enough for viewers to care and share, then in my opinion it's not successful and won't be sustainable. This is a new project but I can see the impact and positive impact of the proposal if it is approved and funded.", "q2r": 3, "assessor": "z_assessor_3190", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1069, "q0": "The proposal describes the intention of finding 4 funded proposers from Catalyst and just when they get ready to submit their close-out reports, the team would go to their location (for now, it will be restricted to Europe, where the team is from) and interview the proposers and edit the footage into a more professional-looking video.\n As a funded proposer myself, I view the close-out report as part of the documentation and progress tracking towards and by the Cardano community. Because of that, I don’t see the need for it to necessarily become a professional short video. How would the community start perceiving these videos? Will they consider it to be a sign that the chosen project is more special than the others?\nWhat could have probably worked better in this context, would have been a proposal to help the members working on close-out reports to make better videos themselves. As a filmmaker myself, I have actually started directing people over Zoom, on different occasions. And as a result, if they got a chance to rehearse with someone, they actually performed much better when needed.\nOtherwise, if the videos were not necessarily presented as close-out reports videos, but as a selection of funded and successful projects from the community, I think that could help attract the attention of not just the Cardano community at large, but of people outside the space as well.", "q0r": 4, "q1": "As mentioned, as a filmmaker myself, I can attest that the project planning and timeline look reasonable. The proposer has thought out all stages of video production, from pre-production and production to post-production and marketing and distribution. The presented timeline is an example for a story/video and as such, the same planning and timeline would apply to all the 4 videos - with some minor delays and adjustments for each.\nThe budget is broken down per video as well. All stages of production are covered, all expenses have been added, and I find it looks reasonable and well detailed.\nThe team behind this proposal is composed of skilled filmmakers, with a lot of background in the TV industry, as such I have confidence that they are capable of implementing the project as planned.", "q1r": 5, "q2": "While the rest of the proposal is well detailed, I find the auditability section to be quite lacking. I understand that the team doesn’t want to register the number of views and downloads of their videos but instead wants to focus on producing the videos in the allotted timeframe. I would think the same, the number of views is a metric of success not of project progress. As such, I would suggest thinking about the question differently. How would they monitor the progress of making each video?\nFor each of the described steps in the detailed plan field, how can the community verify that they have indeed been finalised? For the production stage, for example, how can we check that they have the material and interviews they need and can start the next stage?\nIn regards to the success question, the team would still be better if they were to offer some metrics of success. For example how many media outlets would become interested in the videos etc. I know that European filmmakers are not used to thinking about the success of their films and views in regard to that, but for the purpose of this proposal, such metrics help the community assess the proposers’ vision and objectively assess whether a proposal has been successful or not.\nBecause of several aspects missing entirely from this section, I cannot, unfortunately, rate it more than a 3, as I find it hard to assess its progress and success.", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9038, "q0": "The goal of this proposal would have a positive, reasonable impact on meeting the challenge goals. This proposal aims to provide a professional quality broadcast video to summarize the success of 4 Catalyst projects completing in the next four months following funding. These videos would be high-quality and available in a variety of formats to be able to be used for a variety of purposes. These videos would help to spread the word about the success of the four projects selected, and highlight the benefits of project Catalyst funding. However, the reason for giving this proposal a score of 4 and not 5 is because while this would be impactful there are other proposals that would likely have a higher impact. But showing off the success of fully funded and finished proposals would be a significant benefit to the Catalyst community.", "q0r": 4, "q1": " I believe this proposal is fully feasible and deserves a score of 5. The primary reason for this is the skill of the proposer. They have significant experience in creating short and engaging content relating to the success of cardano projects. The example video on the website was fantastic. I believe that if fully funded this proposal would create 4 videos with a similar feel that would highlight those projects. The budget makes sense though it could be more detailed. But it covers all the required areas for accomplishing this task. The time frame lines up with my experience in media production. There are no questions regarding feasibility or about the team, the time frame, or the budget. This is why I'm giving this the highest score for feasibility.", "q1r": 5, "q2": " The goal of this proposal is clear, to create 4 videos highlighting the success of 4 proposals finishing this fall. The metrics for success however could have been more clear. The proposal states that they have no intention of measuring the video stats in terms of viewers or reach. but the goal of the challenge is to see an impact. So while I appreciate the team's desire to focus on the production of the videos over the marketing of the videos, to really gauge success in terms of the challenge the team should have made an effort to document how they plan to measure the impact. overall though the metrics are reasonable Enviable indicators of the successful completion of this proposal. I do not doubt this team will be available and transparent, however I wish there had been more detail. That is why I'm giving this a score of four.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15204, "q0": "Well, perhaps making videos of impactful projects could be classified as ‘demonstrating impact’ but that’s not exactly what the challenge is about. In its own right, the proposal helps the entire Cardano ecosystem forward, but since the match with the challenge is so poor, I cannot give more than three stars. Neither agree, nor disagree.", "q0r": 3, "q1": "Mr Smelik has proven his skills as a videographer: quality of the footage on adatruth.com should be enough to convince anyone. Video project design, pre-production, production and post-production can be costly but the proposer has somehow managed to keep the costs down. He has addressed the risks—possible delays and the ‘centralization’ of project selection—but he commits to inform the community of any changes in schedule and even invites the community to share ideas for selecting the projects to be filmed. He says he would have to come back for Catalyst funding but should this be funded and implemented successfully, he will surely have proposers lining up to commission him for their projects. And it’s not only Mr Smelik alone doing this. He has help enlisted for photography, sound design and marketing.", "q1r": 5, "q2": "The proposer is not interested in tracking distribution or views of the videos. He only commits to make them. There is not much in this section to go about. We know what the aim is: four videos made. And the progress will be communicated in the monthly reports. That’s it. It’s probably enough for this scope but would have liked to see a bit more meat around the bones.", "q2r": 3, "assessor": "z_assessor_2156", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15283, "q0": "This is an impactful proposal for the marketing of projects sponsored by Catalyst and developed in the Cardano ecosystem. The proposer wants to create professional videos about projects that have been funded by Catalyst and successfully developed in the Cardano ecosystem. Each video will contain live interviews with the project founder and other footage related to presenting the project professionally. Then, the proposer will approach TV channels to broadcast these Videos. This helps more people know about Cardano and attracts more good projects to Cardano, Catalyst.\nAlthough the marketing impact of this proposal is quite large, this proposal does not seem to fit the requirements of this Challenge. As the proposal will have an indirect and complementary impact on the development of Catalyst-funded projects, funding prioritization considerations are likely.", "q0r": 4, "q1": "The proposer intends to work with Catalyst, Cardano to select the outstanding project that is preparing to make a final report for filming. The goal will be 4 documentaries made in 4 months. The experienced proposer has created a detailed plan, with the work item and the time required for each work item very specific.\nThe budget is 7450 USD for a documentary, and the total budget for 4 films (4 projects) is 29800 USD, accounting for 15% of the total budget of this Challenge. This is also a point of Catalyst to consider. Because the cost of creating professional documentaries as shown in the budget table is not too high compared to the market, the cost is making up a lot of the total Challenge budget.\nAbout the project development team, the team gathers experienced and talented experts. Information about the experience and evidence of experience is provided in full. Therefore, the development team is fully qualified to make this idea a reality.\nThere is no concern about the feasibility of this project, however, Catalyst and the sponsor need to consider the priority of the projects to be funded.", "q1r": 3, "q2": "The proposal has a clear and understandable roadmap and implementation plan. Quantitative KPIs are 4 documentaries for 4 projects sponsored and selected by Catalyst. The qualitative KPI is the quality of the documentary. The proposer makes every effort to produce high-quality documentaries within the timeframe mentioned in the plan. However, the proposer should add some more detailed information about the impact metrics of the proposal to Cardano which will increase the credibility of the project.\nThe community can track project progress in a monthly report, however, the proposer will further report on project performance upon completion and distribution of these documentaries. Because the marketing effect will come after these documentaries are widely available.\nThere are no concerns about the transparency of this project.", "q2r": 4, "assessor": "z_assessor_2578", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create professional videos with real-life interviews and extra footage based on the nature of the project. Prepare the videos for broadcasters and internet platforms that can take it and share easily.", "experience": "Petr Smělík\nDocumentary filmmaker and editor with 16 years of experience, works for TV & film, for independent companies and for Cardano community, holds several awards for his editing skills and one main award for documentary directing"}