{"id": 420359, "author": "antonistheofanous", "title": "NFT Non-Profit Organizations (NPOs)", "url": "https://cardano.ideascale.com/a/dtd/420359-48088", "category": 26605, "amount": 28500, "description": "NFTs can establish new standards for the accountability of Non-Profit Organizations (NPOs). Gender Unicorns aims to be the first registered NFT-NPO to serve ESG goals via a new NFT economy", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"id": 506, "q0": "Love that this excellent idea is being experimented with in catalyst. Love that the ESG impact model is the subject of experimentation here. While the proposal identify several groups that would be impacted by this proposal, it would be a stronger proposal if it spoke specifically to points from the Challenge's \"Key metric\" or 'Definition of success.\"\n\nThe proposal comes just shy of spelling out exactly how it plans to build a solution for valuing or monetizing impact. Many passages and paragraphs reads like aspiration insight statements instead of a proposal for a body of work. \n\nSome questions that isn't clearly answer, whose answer would make the impact of this proposal more apparent:\n* What exactly is the role and mechanics of the NFTs? Are they holding ESG records? Why would a business mint them or their communities acquire them?\n* What is \"a scalable framework?\" Specifications? Documentation? Code? Website? What are the nouns?\n\n* How will the community and businesses be able to use the result of this proposal to value and monetize impact? Do they read a document and implement its content? Do you sign up for something at the website? Do they attend networking meetings? What are the verbs?\n\nThis is a really cool idea, love the aspiration! Would love to see more clear details about how it intends to help Non-Profit Organizations  use NFTs to establish new standards for the accountability and facilitate the new NFT economy.", "q0r": 3, "q1": "The proposal has clear monthly deliverables. The team posses most of the core competency to execute on the proposal. They plan to higher a lawyer for the rest.  The budget seems low given the length of the project and that it is a separate body of work to create the framework, then test whether or not the framework works.  The team did state that they research cost so i'm incline to accept their judgement. \n\nWould have given a five star if the proposal provided a more concrete and less whimsical plan to mitigate the risk of \"hostility to anything related to NFTs from the  legal system of the main markets.\" How exactly do you plan to push? Maybe getting a second opinion from an additional lawyer not affiliate with the one helping with the draft to make sure all I's are dotted and T's are crossed?  Any concrete along this line would go a long way.", "q1r": 4, "q2": "Auditing the proposal is straightforward. The team plans to use their website and social media to provide updates to the entire community.  The team has success target of having at least 3 of NFT projects succeed in becoming legal NPOs (in the first 6 months of what?). The first 8 months of the proposal is dedicated to bootstrapping, developing the framework, then apply  Gender Unicorns. It's clear what how the community should be tracking this 6 months period? From final launch of the framework? From NFT project starting the the application project?", "q2r": 5, "assessor": "z_assessor_2098", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1475, "q0": "This very well written proposal requests funding to create a free and open source pathway for non profit NFT projects to evolve into non-profit organizations. The potential to attain non-profit status creates significant impacts, tax benefits and fundraising opportunities. Upon completion, this project could also help other projects unrelated to NFTs similarly gain non-profit status. As open source tools and development, as well as innovation are stated strategic goals of this funding round, this proposal aligns well with the challenge setting.", "q0r": 5, "q1": "Brought to you by the same folks who created Gender Unicorns, this project features an extremely diverse team that has delivered in the past. The CTO has eight years of experience as a developer after completing his masters in Advance Software Engineering. Business and Marketing skills are abundant throughout the group and the feasibility of completing this project is relatively high.", "q1r": 4, "q2": "An intricate and thoughtful timeline provide a solid background for an array of metrics that translate into KPIs. Progress verification is also enhanced by weekly website updates and discord communications. Community feedback will be solicited and interactions with the team will be facilitated. Gender Unicorns will be the pilot project to transition to a non-profit organization and other NFT non profits will be able to transition using the same methodologies. The team plans outreach to at least 5 other candidates to onboard to become non-profits and reports that at least 3 such transitions will occur within 6 months.", "q2r": 4, "assessor": "z_assessor_2252", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1553, "q0": "The idea of creating a framework for NPOs in the blockchain space is a really ingenious one that will further contribute to democratizing blockchain. This will have a very positive impact on the Cardano ecosystem, on the challenge and will probably help a lot with the scaling of future NOP initiatives in the blockchain space. Good job to create a proposal that will have a notable positive impact (and by the way, cool cardgame ;-) )", "q0r": 5, "q1": "The proposal is overall feasible. They present their team members, have a credible implementation plan and explain the main technicalities of their proposal. They have a budget that seems apropriate and an explanation of where the money goes to. The separate tasks have been explained and seem implementable. The team is transparent about their members and seems competent to deal with the tasks ahead. They could however have provided some more links to their credentials, it was a difficult task to find out some more backgound infos. While the team has discussed risks, they have not presented a proper mitigation plan unfortunately.", "q1r": 4, "q2": "Both the problem and the solution description are very clear, so it is obvious what the proposalencompasses and what will need to be audited. The KPIs are logic and auditable, and a proper, detailed roadmap facilitates auditing even more. The proposers have presented clear success criteria and are overall transparent. They have provided information about the platforms where updates will be given.", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 5546, "q0": "This appears to be an interesting idea. The problem statement doesn’t appear clearly like a problem, it looks more like a response to a problem or in simple terms a solution. However, the problem idea can still be seen. If legal frameworks and partnerships can be established for Non-profit NFT projects I think it will help maximize their Environmental, Social and Governance impact. Imapact valuation is a very critical aspect of this challenge and since the proposal is aimed at some impact evaluation of this non-profit NFT project, the proposal addresses the critical points of the challenge and hence the problem aligns with the challenge. Through the Gender Unicorns m, users of Cardano and even other blockchains can evaluate the impact of NFT projects; this is a big win for the Cardano ecosystem. \nComparing the key metrics of the proposal to that of the challenge, they are in alignment. The goals also align with the challenge. The proposal appears to be scalable and functional as there can be the assessment of impact value of these NFT-NPOs.\nThe proposer has indicated that they do not foresee coming back to catalyst for further but will however request for funds to develop the complete smart contract for the NFT which currently being worked on. It means that financially, the amount requested by the proposer will be able to sustain the project.\nThe proposal is one that will make impact.\n", "q0r": 4, "q1": "Information provided about the team and their relevant experience, and considering details about their individual expertise and relevant links provided, I am confident that the team is capable of executing the project. The proposer actually knows the people to be worked with a great deal. The budget is well presented. The amount requested is reasonable and sensible to execute the project considering the fact that there would be an engagement with the Attorney’s office which involves a lot of cost and the rest. There is clarity in the roadmap, the timeline and also the deliverables. The plan itself does not present technical language that will need further explanation; that’s fine. \nIt’s good effort that the proposer has foreseen some risk that may arise during the implementation of the project and has provided measures to mitigate it.\nWith respect to what have been stated above, I believe that the project is feasible.", "q1r": 4, "q2": "The roadmap has milestones to be achieved within each of the 12 months of the project’s execution. It’s good these milestones are definitely stated. There is clarity in the time horizon. \nThe metrics were thoughtfully picked and I am confident that they are good indicators for measuring success as the chosen outputs indicate the number of nonprofit projects joining the course on becoming legal NPOswithin the first 3 months of finalizing the framework and atleast 3 of them succeed in becoming legal NPOs within the first 6 months.\nThere is clarity in the problem identified and I am confident that the proposed solution is effective to address the problem.\nThe proposer has also indicated that weekly updates will be disclosed on Discord and continuous communication and collaboration with Cardashift’s team. Also the proposer states that there would be frequent updates on social media channels. I think this will help community members track the progress of the project.\nAll the above being said, I am sure that the project is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9050, "q0": "This proposal would have a large impact at helping NFT related  nonprofit organizations become registered.  This would especially benefit the gender unicorns NPO.  However, based on the text of the proposal and the text of the challenge in which it is submitted I have a hard time seeing how this would have a positive impact on achieving the goals of the cardashift  challenge.  The goals of this challenge have to do with monetizing impact and developing an ecosystem towards that end. There's mentions of services and methods to issue impact credentials in a decentralized way. Or certification bodies for analyzing and validating data points provided by impact oriented projects. There's on-chain tools or on-chain marketplaces. None of these goals are mentioned in this proposal. And while this proposal and this organization have a large positive impact on the community, there is no evidence in this proposal that they intend here to address the issues of this challenge. That is why I'm scoring this at a 1.\n", "q0r": 1, "q1": "In terms of feasibility, I am uncertain as to whether or not this proposal is feasible. There appear to be two distinct parts of this proposal. Part 1 is getting the gender unicorn set up as in NFT-NPO,  or non-fungible token nonprofit organization. The second part appears to be developing a framework to help others go through this. I understand the concept, but there are so many differences in organizations and locations and legalities  of jurisdictions, that I'm uncertain as to whether or not a framework would be feasible based upon a single NPO.  The team is clearly well experienced and they have a good plan to accomplish what they're setting out to do. But it looks like they are expecting an undue amount of work from the lawyers in terms of developing a framework for others to use. This may be feasible but I'm not sure that it is. Overall I would have liked to see some more specific information regarding how they plan to develop a framework. What does that framework look like, how is that framework going to be developed or marketed. What are the goals of the framework, and how would that help to accomplish the goals of this challenge?  Due to my own uncertainty I am scoring this at a 3.\n", "q1r": 3, "q2": "This team has a clear goal in mind and a clear plan for being transparent. They are well experienced and connected to the Catalyst community. They're willing and planning on creating a business plan on disclosing all of their team members on providing weekly updates on their website and on Discord and providing more communication. This team has a really strong sense of how to accomplish this task in a way that allows the community to see what's going on. I have no questions regarding the audit ability or clarity of this proposal that is why I'm giving it a five. \n", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9523, "q0": "In terms of the articulated impact potential and articulated benefits for the Cardanod ecosystem, NPOs/NGOs, and legal framework for NFT technology, there’s a level of brilliance behind this proposal that earns a solid 5. In principle, this proposal has links to impacts on existing non-profits that are operating in the NFT space AND all non-profits elsewhere, while enabling transparency and fundraising  mechanics that can effectively transform the existing issues with non-profits. This section of the proposal also provides various KPIs through which voters can get a sense of magnitude from this proposal by quantifying its impacts. I think further quantifiability could be brought to this proposal by providing existing data about the nature of the status quo, which would give voters a greater sense of the urgency needed for this type of proposal. The fact that most non-profits fail (about 70% over a 10 year period) and that there is wildly inefficient spending in the industry now shows me that the world NEEDS this proposal and it would be a privilege to see it done on Cardano. It may also help to provide some information on how many NFT nonprofits exist on Cardano now, to give voters an initial sense about the immediate audience/beneficiaries of the services that this project has to offer. I might also like to see some greater consideration of risks (some of which I’ll suggesst further into this proposal). These are all minor suggestions for improvements as this section is very well organized and articulated to demonstrate a well-formulated impact analysis for a slightly lower than average requested funds. ", "q0r": 5, "q1": "For a very well-equipped core team, a clearly outlined long term plan, and a reasonably efficient spending budget, I rank this section a 4. The plethora of talent that is given in the core team members list might not include LinkedIn profiles for each member but I don’t dock any points for that because their very easily accessible on the provided website links. Where I draw some slight concern is the shortage of legal education and experience (only one team member with a law BA) for a project that’s supposed to be creating standards for legal compliance. However, based on the budget information, it seems like there is some legal work that is outsourced to a practicing law firm. As a central part of this budget and intent of operations, I think the disclosure of information about that legal entity would benefit voters to thoroughly evaluate all related parties. On the budget, spending seems perfectly reasonably allocated mostly towards legal fees but there doesn’t appear to be a lot of money going towards the core team. It’s not often that I criticize a proposal for not requesting enough money, or not paying themselves enough for their work, but this proposal demonstrates a lot of positive impact that voters may want to see sustainable internal operations that retain the large team. It may even be considered a risk to reserve funding away from team member salary and I think this team is worth it. I assume they’d be generating revenue elsewhere in their pursuits but I’d like to see more clearly that this team is going to keep going. ", "q1r": 4, "q2": "For extremely thorough measurability throughout the proposal, clear target performance metrics, and high SDG versatility, I rank this section a 5. In theory, this proposal might actually have access to all SDG points via the variety of NPOs/NGOs missions and intents. They don’t take credit for this (which is appropriate) but I wanted to point it out to express the massive potential of this proposal. The KPIs that they do evaluate are well quantified and well measured for performance in a way that links to impact potential. I very much appreciate the quantified measure of success that is perfectly reasonable to aim for 5 NFT projects to be onboarded for these services. This section provides voters with a clear outlook of how this team is measuring/defining success. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12041, "q0": "The authors propose to create a scalable framework and network that for Non-Profit Organization to assist in the legal registration their NFT projects. This is to help non-profit organizations reduce legal processes and make the distribution of funds more transparent. Donors support NPO is also easier. Besides that, the wider Cardano Community will benefit from a series of transparent non-profit projects that will bring new awareness to the Cardano Ecosystem and its inherent advantages regarding transparency, Decentralization, equality, eco-friendly and scalability. With these effects, the number of NFTs increases, thus increasing the number of participants in the blockchain sector. This authentication service provision satisfies the requirements of the challenge. The authors have identified the risks of the impact as well as the action solutions, although in my opinion, it is still not very clear. The objects of impact of the proposal are groups, donors, beneficiaries, volunteers for charity projects.", "q0r": 5, "q1": "This part of the proposal I consider good. First of all, it is the team of the proposal who have many years of experience in the field related to the proposal. The cost estimate is divided into 6 categories, mainly related to hiring lawyers to establish the legal basis for the project's goals. The action plans are explained monthly in a year, showing that the team has a clear understanding of the steps to do and has a clear and specific plan.", "q1r": 5, "q2": "The project's auditability is well written. Regular progress updates on the website are a good way for the community to keep track of the progress of the project. In addition, KPIs are clearly given at the end of the project to help the community evaluate the usefulness of the proposal.", "q2r": 5, "assessor": "z_assessor_3329", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Establish the legal framework & partnerships for Non-Profit NFT projects to register as NPOs. The NFT-NPOs will maximize their ESG impact while offering incentives / NFT gifts to their donors.", "experience": "We are proud of our diverse and multi-cultural team of 10 people from 7 countries(also available to view at: https://genderunicorns.com/#team ). Our team comprises project managers, financiers, developers, marketing experts, legal consultants, advisors, data analysts and more"}