{"id": 420625, "author": "impactscopemehul", "title": "Verify2Earn", "url": "https://cardano.ideascale.com/a/dtd/420625-48088", "category": 26605, "amount": 14970, "description": "There are not enough tokenomics models which focus on advancing SDGs through tokenizing and incentivizing behavioural change.", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 5620, "q0": "The problem statement involves some sort of challenge-matched impact assessment. Tokenomics is important when it comes to the value of cryptocurrencies and deters bad actors, builds trust, and builds a strong long-term ecosystem. I believe that if this tokenomics model is implemented, it will encourage and reward sustainable behavior and impact behavior; it will be a big win for the cardano ecosystem. Proposals to address the weaknesses of the challenge speak to the impact assessment. By comparing the main measures and objectives of the proposal with the measures and objectives that pose a challenge, they are agreed upon. The proposal seems to be extensible and working as it can be deployed by  individual members of the cardano community to measure any personal sustainability challenge or  protocol developed on cardano for use. use in their own ecosystem. From what has been suggested by the proponent, the project is a long term partnership with the Cardano community and for this reason they will be going back to the catalyst for more funding to keep it viable. financial exam. With all of the above, I believe  the proposal has\n", "q0r": 5, "q1": "Given the information provided on the  relevant personal experience,  expertise and qualifications of the team and considering the relevant links and references attached, I am satisfied that the team is well equipped in carrying out the project. The proposer has knowledge and information about the team members, which is amazing. The budget presented here is clear and easy to understand and due to the cumbersome nature of the project (actually some engineers and developers will have to build a thing or two), I am certain that the  amount is required to be reasonable and reasonable to obtain in its entirety. accomplished. Target. The plan is presented briefly and the timetable is clear (should last  6 months). However, I see  the roadmap as looking more like deliverables  than a scope of how activities will be carried out; it's still a great approach. The plan doesn't really present any technical language that needs interpretation. The proponent has foreseen certain risks that may arise during the implementation of the project as a good effort and has put in place measures to minimize them. Given what the Impact scope (the team) has done  and what has been stated above, the project is feasible\n", "q1r": 4, "q2": "Roadmap milestones and timelines are clear. Indicators / KPIs have been carefully selected, and the results selected include the number of interactions from community members, demonstrations of effective behavioral changes, the number of verification2Earn mentions, and how social media do it. Indicates whether it can be applied to. The problem identified is clear and I think the proposed solution effectively addresses the problem. The proponent said that the analysis of the results collected by pilot test group \n would include participants from the impact-oriented SPO and  Cardashift communities, but  not  enough  to track the progress of the project. .. Proposers should use the Telegram community channels, and other platforms to help community members track their projects. The project is auditable.", "q2r": 4, "assessor": "z_assessor_2722", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6712, "q0": "Verify2Earn aims to be a deep dive into the design of tokenomic models of rewarding good behavior. Although the name might make us believe it aims to be a game or an application, that is definitely not the case, since the deliverables will include use cases, flow diagrams, identification of subsystems and commonalities between projects. So it’s definitely a research proposition.  These kinds of projects usually go hand in hand with Cardano’s research focused ethos, and therefore five stars for potential impact. ", "q0r": 5, "q1": "There is an excellent team behind this proposal, with extensive and diverse backgrounds in traditional finance, blockchain technologies, fintech and technology development. The timeline isn’t really a timeline, rather a bullet list of deliverables and a time for completion, but with no way of knowing if any of them can be executed in parallel or they have to be staggered. The budget is fairly well explained. Total hours necessary for project completion is around 220, with a 65 to 85 USD hourly rate charged. Given the modest budget requested, the very targeted area of research and the multidisciplinary team backing it up, five stars are the way to go here.", "q1r": 5, "q2": "The team knows very well what it wants to achieve, and offers a full and very comprehensive list of deliverables: lists of use cases, diagrams, generalized framework and analysis of a pilot test. \nThey also do a very good job at setting clear targets for success: the creation of a standardized token mechanism, 100 interactions with community members (hopefully all of them documented) and 500 social media mentions of their study. A solid approach for a small and targeted study. Five stars. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9054, "q0": "This proposal will develop a well researched verify to earn proof of concept. This “verify to earn” proof of concept seems to be a tool that would precisely meet the goals of this challenge. They would brainstorm a variety of ways that this tool could be used. They would then develop those pathways into a development plan and then develop that into a proof of concept. This process of research prior to development would enable this tool to be used in a variety of different contacts. This would further the challenge goals by creating a single verification system that multiple projects could use to verify the positive impact other projects are developing. Overall this would be a highly impactful proposal that would require further funding to implement their proof of concept into a variety of projects.", "q0r": 5, "q1": "This project is feasible but there are some lacking details for me to fully agree and give it a five. What's really nice is that this team's details are listed and available for assessors to evaluate. They have a broad scope of skills and experiences and seem to be well suited for accomplishing this task. The budget breakdown is nicely detailed and appropriate for this proposal. There is a sufficient budget for the work proposed. The timeframe could have been more detailed, provided a month by month task breakdown. Apart from that, this proposal is sufficiently feasible.", "q1r": 4, "q2": "His proposal is clear and has a solid list of auditability goals. The metrics are measurable and achievable, and the team plans on providing reports that are transparent and public. These metrics align very well with the time frame and the goal of the proposal. The catalyst community would have access to these reports and be able to stay on top of what this team is working on. This means that this proposal is highly auditable and very clear. I give it a full score of five.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9706, "q0": "The proposal outlines the recording and incentivising of good actions in various fields, mostly environmental awareness and personal behaviours which align with global goals for minimising our negative impact. The project is in a conceptual phase regarding impact; it definitely will be impactful if the necessary research and specifics are done and a functional tool can be developed. The proposal aligns with the ethos and broad goals of the Cardano community, the self monitoring of good behaviours could also be impactful as it is a self measure, of shifts in conduct. It is not possible to determine how broad use could be as this will depend on the technology used and accessibility - is this for people who already function in an environmentally friendly manner or is the goal to access a broader base and educate and integrate knowledge of Cardano etc? The project could scale up if more people used it but could be limited by incentives offered and interest - being a gimmick needs to be avoided. There are so many similar approaches so it really needs to address and focus on real change or meaningful actions - perhaps this is implied but not expressed. ", "q0r": 4, "q1": "The team involved are experienced and have a broad range of skills which are applicable to the proposal under discussion. The budget is broken down but, as some of the tasks involve brainstorming etc it is difficult to determine the appropriateness of the funds requested or the time lines included. This may be unavoidable as this proposal is in the early stages of development. There is information regarding potential risks which will be considered in the creation of the final product. Relying on good faith is a challenge but, hopefully can not only be assumed but intrinsic to how the project is designed - to avoid exploitation. But the nature of the project is not such as to attract those with ill intent.", "q1r": 4, "q2": "The goals are clear and measurable as, beyond creating reports on discoveries made and decisions reached, there will be the creation of the Verify 2Earn mechanism. This is based on people recording positive behaviours so there is transparency, once the project is up and running, as members of the Cardano community (and beyond?) will be engaged in the process. Part two of this proposal is sure to be both interesting and relevant.", "q2r": 4, "assessor": "z_assessor_3085", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "ImpactScope is designing easy-to-deploy tokenomics models which encourage and reward sustainable behaviour and impact verification.", "experience": "Core team of ImpactScope: 16 months of working together at the intersection of positive impact and blockchain. \nBlockchain, carbon finance and sustainability expertise\nClients include large US crypto mining companies and leading European crypto exchanges. "}