{"id": 421574, "author": "sustainableada", "title": "Impact Measurement For Businesses", "url": "https://cardano.ideascale.com/a/dtd/421574-48088", "category": 26605, "amount": 15000, "description": "A key challenge with funded proposals and companies building on Cardano is to track project progress + effectiveness with clear impact measurements, especially for Sustainable Development Goals SDGs", "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1079, "q0": "While I do agree in theory with this proposal, I see some potential issues, and I hope they won’t fire back.\nPersonally, as a Catalyst proposer myself, I don’t use the SDG tool often when submitting proposals. I have used it for some of them, but not for all. I read what it was about at first, but I couldn’t bring myself to paint an additional layer over the proposal to make it more appealing for reasons that were not the main focus of it, but rather a by-product. Personally, I agree with all SDG goals and am striving to make everything I do as impactful as possible. But I don’t like bragging about it and I imagine others might not either. \nAnother reason why I’m a little bit sceptical is that setting clear filters on how proposals or projects will be evaluated, could put some of the most impactful, resourceful and innovative projects at a disadvantage. That can happen if they don’t manage to tick the boxes that will put them in front of others projects, that do tick a lot of the SDG goals but don’t have any innovation to offer, just another recycled idea that usually gets good grades and funding.\t\t\t\t\t\nWeb3 is about innovation, decentralisation and about breaking free from the rules by providing full transparency. I think an important aspect to remember, is that in this space DYOR has an important meaning, that should be applied perhaps in this case, as well. While this tool could provide meaningful insight into some companies, it could also be used to detract from some activities being perpetrated by others.\nBut the proposal fits quite well in the challenge parameters and I do want to see how this plays out. I hope that my feedback will lead to some conversation amongst the team members and help them further refine it. I will be watching how the evaluation will work out for the first 10 companies and then how the Cardano community will be judging their accomplishments.", "q0r": 4, "q1": "The implementation plan and timeline are very comprehensive and clear. The project will be divided into 3 phases, with clear action points and a reasonable timeframe dedicated to each. The budget is very detailed as well, the team has divided it into 3 main activities, content creation, research and tool development. Each of them is clearly described, with clear tasks accompanied by numbered amounts and hourly rates. They all seem to add up, and the rates provided seem to be in the range of what I am familiar with across the community.\nWhen reading the members' descriptions, I find that there is nothing missing from their answer provided. They have included the names, descriptions and LinkedIn profiles of all team members. We know their past activities in the Catalyst community but also their outside skills.\nGiven all the details provided, I find the feasibility section remarkably well written, and as such, I will rate it a 5.", "q1r": 5, "q2": "I find the KPIs offered in the progress measurement question to be a reasonable answer. The task of the proposal will be to evaluate 10 companies/projects and as such, for the progress they will be measuring the number of POC trials, the time needed to validate the impact value and what the financial value is from the impact-oriented project. What I would have liked to see, is how and where will the team be keeping track of all these? In a spreadsheet posted on their website? Some clear infographics? That would have eased the community’s ability to gauge the advancement of the proposal.\nThe success goals are also well defined, they are grouped into 3,6 and 9 months each with different measurements, that show the clear vision the team has regarding their project.\nAs such, I see no impediment in assessing this proposal for progress or success, thus I will rate it a 5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2961, "q0": "If implemented in a way that gathers and responds to ample feedback from the projects being evaluated and from other potential customers of the product I believe the project has the ability to be quite \"impactful\". Establishing a methodology for evaluating impact that actually gains traction in the community is something that would benefit everyone, ", "q0r": 4, "q1": "The project does not seem terribly difficult to formulate on the surface. The reason I give the feasibility a three is because to do it \"successfully\" would entail it gaining traction and use, and for that it should be seen as legitimately bringing to light genuine impact (where it exists) for the projects it evaluates and it should be both clearly understandable, have clear indicators and be useful across a wide variety of project types. From my perspective the Phase 2 could likely bring about a LOT of information not forseeable in Phase 1 and it would be a great opportunity to refine method and assumptions. Because I do not see this in the road I'm giving it a three, however this is something the team can easily adjust if they win funding. ", "q1r": 3, "q2": "A much clearer metric for the success of this project from my perspective would be the percentage of projects that find the tool valuable enough to rate it above a 3 in a blind survey or something that gather honest feedback. In terms of financial value, the teams perhaps leaves \"value\" on the table by not clarifying how this could be monitized (e.g potentially, once clearly refined and having establised a sense of legitimacy with big actors in the cardano community, offering paid certification of impact rating or even offering impact audits to those projects looking to set themselves apart from competitors with 3rd party verification of impact). ", "q2r": 3, "assessor": "z_assessor_2373", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7473, "q0": "Tools like this are invaluable to making businesses more transparent to investors and future investors, not only on cardano, but in business as a whole. The fact is, Cardano is quickly bridging the gap between blockchain and the real world with it's solutions. We need tools and metrics that we can show real world investors that are not as deep into the ecosystem as most of us today that participate are. The easier you make it to access information like this, the easier it will be to reach out to the person that has never earned crypto. Building trust through metrics is one of the biggest things, in my opinion, that we should focus on as Catalyst. Giving developers like your team the funding to create tools like this will be what sets us a bar above the rest.", "q0r": 5, "q1": "Your team has been funded in multiple funds prior to this, so I feel comfortable giving you the funding for this proposal as well. Not only will it be money well spent, but it will in the end bring access to more people in the world to crypto. The plan you have in place seems to be well thought out, and your white paper is very detailed, yet concise. The open-source nature of your work is what makes cardano so special in the world of blockchain, and to see you carry on that legacy is a big plus for me as a PA. You stated in your auditability section \"We have conducted research in the past that will be integrated into these proposals and help us scale the Impact Measurement Tool. We also will be applying our research and doing the first impact evaluations with our chosen framework.\" What I gathered from this was your team has the experience and research in many facets of our ecosystem, that will help you flesh out a better product for the cardano ecosystem. I gave your team Kudos for this proposal, as this is what will grow us as an ecosystem sustainably. The projects you are working with, and the projects you will be using as your baseline are certainly impressive. I love to see collaborations with the projects in the ecosystem that are designed to help to make the world a better place. That is exactly why I am here!", "q1r": 5, "q2": "I gave you guys 5 stars in this section because of the fact that your proposal is so well thought out. There are a few pointers that I can give as a Project Ambassador of a socially driven project being built right now called Chain Lobby. Although we will be able to see your work through the tool and the website you are creating it through, I would like to see you build out a social media presence. If you record some of your progress and regularly upload it on YouTube, Facebook, and/or Twitter, and maybe even reach out on reddit, you could increase community awareness for what you are trying to achieve. I would like to see you guys dedicate at least a little time to helping the community get more eyes on what you are doing, so in turn the community can help bring awareness to what you are trying to achieve. As a result of building now, while you are building the tool, I believe you will have an easier time having your tool quickly become a standard in the Cardano ecosystem. A tool is as only good as the awareness around it, after all. I just know that with the ease and power that social media brings, it could be a total boon to your project long term. I wish you guys the best and great proposal!", "q2r": 5, "assessor": "z_assessor_2895", "no_vca": 6, "ne": 2, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 9708, "q0": "The proposal clearly establishes a practical method of following up on the impact of companies or projects. This  would facilitate the tracking of funding and the acquisition of support for good projects and companies who are focused on \"making this a better world for all\". The proposal is directly aligned with Cardano goals and would be beneficial to the Cardano ecosystem  as a tool for assessment and for broader clarity on how Cardano is being used as an instrument of change. The KPIs are clear and task oriented with specific area of research and consequent development of the tool clearly set out and explained. The problem and solution have been thoroughly considered and are discussed in a clear and comprehensive manner. This assessment tool could definitely be scaled up as it could be used for all Cardano related initiatives and would continue to be relevant and useful.", "q0r": 5, "q1": "This project is being run collaboratively by a large number of capable individuals, as discussed in the proposal. There is evidence of long term commitment and ongoing teamwork as they have been working together on the white paper which is clear and informative. With this in place, feasibility is high and there seem to be no real barriers to success being achieved. The budget provided is comprehensive and broken down adequately. The names of companies to be included in the research are not mentioned but this is seemingly not a problem as they have access to the broader Cardano community and it is likely that many organisations would be willing to be involved. The nature of the impact measuring tool is not explored. I assume this will depend on the information gathered and the design decisions reached - probably a proposal in the future! Risk mitigation is included but it seems the biggest concern is that the Cardano community will not be interested in ascertaining the impact of projects - this seems highly unlikely.", "q1r": 5, "q2": "The proposal has a clear timeline with measurable outcomes. The measure of success will ultimately be the existence of the tool for impact measurement which will be available to the Cardano community and be used by \"all in the Catalyst onboarding process.\" There is transparency and access to the project which is highly collaborative in nature. The team are invested in the expansion of Cardano and the proposal is rooted in meeting the broad objectives of the Cardano community with regard to creating change , awareness and improved ways of being on a global scale. This proposal ticks all the boxes.\n\n", "q2r": 5, "assessor": "z_assessor_3085", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12151, "q0": "A project that is made with detailed and clear planning details becomes the main basis for convincing investors to want to invest, but the current system does not provide flexibility for investors to track project progress, effectiveness with clear impact measurements, and especially for Sustainable Development Goals SDGs. So we need a measuring tool to help measure for companies to help define KPIs, measure, verify and report them, with a focus on SDGs impact. These tools are needed for the Cardano community because they have done a lot of funding from the catalyst project but there are no tools to measure success other than the data provided by the proposer. Making these tools can help investors could use the info as support for their engagement with the company. Its application can extend not only to the cardano ecosystem, but also to penetrate other industries to introduce blockchain technology that implements a transparent and trust system.", "q0r": 5, "q1": "They will take the first steps in providing a valuable service to investors by measuring the impact of 10 companies with a mission centered around impact building on Cardano. With the support of the Cardano community, it will allow them to continue the development of the model found in the Impact Measurement Tool whitepaper. This will allow them to finalize the structure of the Impact measurement tool and allow them to start the next steps of the process where they plan to track and trace the impact of companies on Cardano and use the research to finalize a model and create the impact measurement tools. They also plan to integrate this tool into the Cardano onboarding process. This will allow companies beginning to build on the Cardano track and measure their impact so that they can give another layer of validity to the Cardano project Catalyst project. This team has strong capabilities in carrying out its activities, especially their leader, Yoram, who has been focusing on combining impact and business for 5 years. A mentor with international board, operations, and startup experience. Yoram is an active catalyst member, CA, and part of the Cardano4Climate community. In Addition, active in promoting the Catalyst and Cardano community to impact companies and networks to connect them to the ecosystem (i.e. seedsstars.com) and of course assisted by other teams who have expertise in their respective fields who can help sustain this project.", "q1r": 5, "q2": "The roadmap/milestone stage will be in 3 phases with a total of 14 weeks of work. The main concern is the talk with the Catalyst team to integrate our tool into the onboarding form for funded proposals and businesses, and Integrate into the SGT platform. The KPIs for this project are the number of POC trials that can be run with impact-oriented projects, Time required to validate the impact value, and How much financial value can be derived from impact-oriented projects. This project was successful by creating the impact measurement tool, and evaluating 10 impact companies to help increase transparency and traceability on the impact generated by these specific projects. This will be the first steps into publicly releasing a tool to evaluate impact. From this they will make changes to the impact measurement tool where we can then publicly share the information of these first projects. Then making this tool available to all in the Catalyst onboarding process.", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14052, "q0": "This is an excellent proposal that perfectly meets the challenge to develop a tool to measure and value impact. Developing a model for Impact evaluation of companies provides a great way to assess proposals funded in previous rounds and check whether or not they’ve delivered the promised results, establishing a level of trust that is currently lacking in the ecosystem. The proposal points out what’s lacking in the current system and provides a simple yet effective solution which is based on previous work and research. ", "q0r": 5, "q1": "A link to a white paper (Impact measurements platform) prepared by the team and funded in fund 7 is provided which shows they have already done the groundwork to carry out the proposed solution. The team has also built a SDG Proposer Tool to measure impact which they aim to develop further in this round. They provided a timeline and the deliverables for each stager are clear. The budget breakdown clearly shows how the funds will be allocated and is reasonable.", "q1r": 5, "q2": "The proposers aim to measure the success of their proposal by evaluating the impact of 10 projects they aim to work with by providing them with a model to verify progress. The detailed timeline clearly points out what they hope to achieve at each stage which makes it easy to keep track of. They also have a clear way to measure financial value of impact-oriented projects by comparing the value in a company to their actual impact evaluated with the impact measurement tool they’re developing. ", "q2r": 5, "assessor": "z_assessor_3879", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Creating the Impact Measurements process and Tool for companies to help define KPIs, measure, verify and report them, with a focus on SDGs impact.", "experience": "Sustainable ADA connected to a 200+ team of active Cardano community members. Partnered with Cardano AIM team (voter-tool, CA-tool, vCA-Tool, SDG Proposer Tool, SDG Search Tool). Global diverse multidisciplinary team of professionals: Catalyst, impact research. Funded in 5,6,7,8 "}