{"id": 422843, "author": "silvia.ecclesia", "title": "Impact monetization 4 entrepreneurs", "url": "https://cardano.ideascale.com/a/dtd/422843-48088", "category": 26605, "amount": 20000, "description": "Lack of knowledge on needs and practices of using blockchain to value and monetise impact among social entrepreneurs in developing countries.", "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1585, "q0": "I think this is quite a valuable project, as collecting data from so many impact-drivven shareholders on different levels has a very high potential of using collective intelligence to identifiy common goals, needs and problems regarding blockchain technology. I think bot the Cardano ecosystem and general society will benefit from it, as it has the potentialto bring on new positive usecases to blockchain technology and should also help with the scalability of blockchain based approaches of measuring and documenting impact.", "q0r": 5, "q1": "The proposers introduce themselves, and it can be seen that they know what they are talking about and are competent to deal with the task at hand. Their implementation plan seems credible and feasible, as they will use a pool of already interested and networked sharholders and have some mitigation stategies for the risks and hand. The budget is defined and seems reasonable, I appreciate the proposers not charging too much for this probably cumbersome task. A time-defined roadmap exists and gives this whole thing a look of good planning ahead.", "q1r": 5, "q2": "The Problem and solution description are logical, clear and straightforward, and the KPIs and success metrics are clear, appropriate and measurable by very definitive statistics. Relations to SDGs have also been mentioned. A grain of salt is that no way for the community itself to track the progress has been disclosed. I expect the proposers to still provide some link or similar in the comments to some kind of progress dashboard or similar.", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12166, "q0": "The proposal rais the issue of a lack of knowledge on the needs and practice of using blockchain to value and monetize impact among social entrepreneurs in developing countries. This proposal is created in synergy with other approved and submitted proposals to Project Catalyst planning surveys, workshops, focus groups, and events on blockchain for business in Africa, Asia, and in Geneva to understand the opportunities for entrepreneurs to adopt blockchain and participate in Project Catalyst. This proposal offers a comprehensive approach for understanding the best frameworks for impact valuation and monetization for impact-driven companies, through blockchain, based on analysis of best practices, combined with insights from the entrepreneurs themselves. ", "q0r": 5, "q1": "This project will use the Geneva Impact Hub platform to carry out this project. they attach a link that can be accessed to see how far the progress of this project is. They are Starting by understanding the already existing research and methodologies available for using blockchain technology for impact measurement and monetization, expanding by assessing the needs and gathering the insights of impact entrepreneurs across the globe on impact monetization and combining them with the innovative solutions proposed by experts and investors. To offset this challenge they are planning on distributing this specific survey in combination with another one on the topic of blockchain for business. they have 4 stages in working on this project, the plan is that in each stage it is quite clear what they will do at that stage and there are main outputs at each stage to be continued at the next stage. The budget they propose is still in a reasonable stage and there is a breakdown of the budget allocation. The team in this work is qualified enough to carry out this project.", "q1r": 4, "q2": "A successful project for them would be one where they can get a significant number of responses from the initial survey and meaningful insights from desktop research, interviews and focus groups in order to: Establish the needs and interests of entrepreneurs in using blockchain technology for impact valuation and monetization through impact tokenization; Gather valuable insights from experts and investors in the field; Produce a First Steps Guide summarizing state of the art, opportunities and challenges and first steps to approach the use of blockchain for impact monetization to support impact-driven companies; potentially testing the possibility of creating an Accelerate2030 impact token to support our network of entrepreneurs in their businesses for impact. The Accelerate2030 team has extensive experience in impact management, having managed complex logframes with partners in development agencies, and a dedicated impact management team. At project inception, we will set up an M&E plan to track the progress based on the project plan and KPIs outlined above, and copied here", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12459, "q0": "This proposal addresses the challenge directly, in a part of building clear and understandable infrastructure for project founders to start, build and monetise their impact projects. The goal is to research existing projects in ecosystem and create guidelines and after that disseminate it.\n\nThis approach addresses effectively at least two of success definition:\n1. Impact projects could test hypothesis faster.\n2. Impact projects could invent monetisation models and orient themselves to self-sustainability.", "q0r": 5, "q1": "The team is very experienced in areas of NGO, impact startups, acceleration programs, innovation, coaching and project management, which are crucial for this kind of activity. \nPlan is pretty simple and common sense (briefly: design the survey, do focus groups, make guidelines), although one of that things we often think \"why is it not done yet?!\". Sure it requires expertise and deep connections within community, which proposers have. ", "q1r": 5, "q2": "We can see clear plan and KPIs, which are related to the main goal of the proposal, divided by steps of the plan. \nFor the first step we could see some numbers of involved in surveys, later — spreading of the Guide. So the path is clear.", "q2r": 5, "assessor": "z_assessor_3419", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12559, "q0": "In the proposal, one wants to create a framework which helps to understand the best practices for impact valuation and monetization for impact-driven companies, through blockchain, based on analysis of best practices, combined with insights from the entrepreneurs themselves. Therefore, this proposal is perfectly aligned with the Challenge as it seeks solutions for impact investing. This proposal will have a tangible impact as it will engage companies from around the world and help establish new values in the corporate world. First, a survey will be conducted among 450 companies from 33 countries around the world. Then, those interested in Cardano-based solutions will be trained in workshops. I think this is a better way to engage companies in the Cardano ecosystem and Project Catalyst. Moreover, the proposer also provides some key metrics that really alight with the challenge KPIs and are suitable with what they describe in the solution content. They also state out the challenge about a common problem that will appear on all survey activity, but they had a plan for that which I believe will work well. \n\n", "q0r": 5, "q1": "Given the experience and plan presented, it is highly likely that this proposal will be successfully implemented. The team is already active in the world and is familiar with the United Nations Development Program for Sustainable Development Goals. The team details can be viewed on the website. The stated timeframe for implementation of the proposal is realistic to complete the survey and conduct the workshops. The budget requested to execute this proposal is realistic and broken down into identifiable tasks. The team is experienced and therefore knows what resources are needed. The core of the proposal is to conduct surveys paired with workshops. As mentioned by the applicant, they encourage business participation in Cardano initiatives by bringing them together through conducting workshops. This is one of the best ways to bring Impactful businesses to Cardano. \n", "q1r": 5, "q2": "The information provided is sufficient to review the progress and success of the proposal. Each step of the proposal can be tracked, such as the progress of the survey and its outcome, the participation in the workshops and its outcome, and finally the provision of support to the selected companies. The budget is also tied to each stage of the proposal, which is clearly defined. This makes it easier for the auditor to verify the execution and disbursement of funds. The stage objectives are clearly defined in the proposal and how long it will take to achieve them. As stated in the proposal, the project will be completed between early 2023. This is a reasonable time frame. The success of the proposal can be measured by clear numbers.\n", "q2r": 5, "assessor": "z_assessor_3435", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Needs assessment of 450+ entrepreneurs on impact valuation and monetization, desktop research, and focus groups with experts.", "experience": "Impact Hub is a global network of 24,250 people driving change – made of 100+ communities across 5 continents, with significant presence in Asia. In 2016, Impact Hub & UNDP from Geneva launched Accelerate2030: a global program supporting 450+ entrepreneurs from emerging markets. "}