{"id": 423151, "author": "dimitri777", "title": "Fundraising for Impact Initiatives.", "url": "https://cardano.ideascale.com/a/dtd/423151-48088", "category": 26605, "amount": 47000, "description": "There is no proper fundraising mechanism for impact Initiatives in Cardano Community. Cardanians want to give but have no fun options to do so by buying tickets to fun events", "f6_no_assessments": 5, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 2130, "q0": "The proponent's idea is very good, according to the author there is currently no proper fundraising mechanism for Impact Initiatives in the Cardano Community. The Cardano community wants to give but there are no interesting options for doing so. The solution was to create fun events like sponsored walking and eating challenges where authors would run challenges to raise funds. The event will be streamed live for ticket holders. Tickets are only sold by ADA. Also, for loyal supporters, there will be a loyalty program, When they buy a ticket (NFT), their purchase will be tracked and points allocated. As they buy more, the points will allow them to get a discount on the ticket price and after a certain amount when they buy a ticket they will get a free ticket. This will motivate them to support fundraising efforts regularly, buy tickets for others, and generally increase their engagement. Conceptually, the goals of the proposal match the goals of the challenge. A clear and understandable solution was provided in the proposal to clearly describe the targeted problem. The author has taken on a lot of eating and crawling challenges, and he's also raised as many charities as he can, so he wanted to bring the two together so that the Cardano community can fit in. can enjoy and fundraise at the same time. It's a very cool idea, and the results it brings are also very humane.\nThe downside of this proposal is that the proponent has mentioned the challenges and risks encountered, but has not given appropriate measures to overcome/minimize those challenges.", "q0r": 4, "q1": "The idea is great and the team also has detailed information on the implementation of their idea. A detailed roadmap has been presented, the proposal will be implemented in 3 months with the activities listed giving this proposal certain relevance. The $47000 required budget is also explained, but I think this section could be more detailed so we have an accurate view of what the money is going to be doing. Example Event cost $16,000: how many events will be held, how large will it be, where will it be held, and estimated how many people will attend the event?\nFinally, the team that implemented the proposal included authors Dimitri Fernando and Rishantha Welikadage. The details of the group are presented very well, we have all the information about them such as field of activity, experience, and connection to Cardano as well as a LinkedIn link so we can confirm the information above. Therefore, I believe that with what is provided they are competent enough to carry out this project.", "q1r": 4, "q2": "There are several goals with well-defined KPIs such as:\n-Number of tickets sold\n-Number of views\n-Number of shares\n-Number of likes\n-The number of retweets and likes on Twitter\n-Likes and shares on Instagram and Facebook\n- Charity fundraiser\nAll in all, the figures here are good enough and detailed enough. The clear, detailed plans and proposed milestones seem very easy to implement (based on team capacity) to achieve the set goals. And I think the community can completely track the progress of the project based on the: Twitter, Instagram, and Facebook page that the team provides. The success of the project is also clearly defined which gives us a clear understanding of its vision and goals. This is a well-established project, I highly appreciate this project, and hope to receive a lot of support from the community to get the project approved and put into practice soon.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 6834, "q0": "Consciously or subconsciously, fun and socialization is a needed attribute to our lives with some psychological benefits. The proposer intends to create a fundraising mechanism by providing/demonstrating those fun moments and then monetizing the services.\nThe solution will feature fun events like eating challenges, walks etc where ticket will be sold in ADA only and event will be livestreamed for ticket holders to watch. ", "q0r": 4, "q1": "The proposer provides an aligning implementation plan with a structured timeline. Although these solution is unique and interesting, but to ascertain the chance of a sustainanble model, we need some stats/data from the proposers previous events (like how many viewers, percentage of positive comments and what kind of audience are interested in such kind of events, what part of the world pays much attention to such events etc) because currently, the world is in a serious and critical situation, maybe not a large portion is interested in such events but those data will help us make a data driven decision which is a good thing. \nThere's sufficient information about team with roles and experiences that add up nicely to the proposed idea. Lastly, the budget, although explained, but requested budget amount is a bit on the high side.", "q1r": 3, "q2": "The information, metrics and KPIs presented is sufficient to track progress considering the nature of the idea. Social media is a key focus for measuring both progress and evaluating success and so the metrics includes number of views, number of tickets sold, like, retweets etc which is (if well accepted in the community) will be a great tool that'll set a new paradigm to demonstrative impact fundraising.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "\n\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 9086, "q0": "This project meets the challenge goals by providing an actor in the ecosystem capable of defining an impact, in this case helping to move throw-away food to those who have nothing to eat. This is a huge positive in terms of environmental waste going to be used to solve food inequality. The funding model is something that has seen successful use in other arenas, such as school fundraisers in the US that I have been a part of. This will also provide an on-chain marketplace. This is an innovative approach to raising funds for impact. This would have a positive impact on achieving the challenge goals, hence a score of 5.", "q0r": 5, "q1": "The fundraising goals are achievable. The funding method is not something that there is enough detail really fto give this a full score of 5. The proposer has the capability to accomplish this goal in the timeframe laid out. Ideally, they would have provided more detail regarding the development of the NFT funrading tool. The plan is straightforward enough that it is certainly achievable in the time frame. And as the team has the experience with hosting the fundraising challenges, this would be an innovative approach to accomplishing the goals of the challenge. I think this is feasible as the team has the capability to accomplish this and it is a fairly straightforward proposal. ", "q1r": 4, "q2": "The goal is to create live streamed eating and walking challenges that are raising funds for a non-profit associated with the proposer. I think this creates a clear and auditable goal. The metrics are measurable, the success goals are obvious and achievable. This could have received a score of five if there had been a bit more detail about where and how these metrics would be reported to the community. Also, it would be nice to know how the charity is auditable. Other than that this proposal should be feasible and achievable and the community should be able to audit this.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 15327, "q0": "This proposal seeks to raise funds for impact purposes through the organisation of events that center around doing challenges or walks. This is indeed an impact project but it does not address the guiding question posed in the challenge briefing, namely, “What kind of tools, interacting on-and-off-chain, can we develop to measure and value impact financially?” This proposal focuses on impact, but not on the measurement or monetization of impact. The proposal does contain some idea of monetisation in the sense that they suggest that 1km walked could equate to 10 ADA, meaning that a donor would pay 10 ADA to have the proposer walk 1 km but this would be far too generous an interpretation of what the challenge is about. They also suggest that the NFT-enabled access to various benefits constitute a monitisation of impact but this would be too generous too. ", "q0r": 1, "q1": "The two members of the team have a diverse set of experiences. Dimitri Fernando is a PA and vPA within the Cardano community and has extensive experience from other fields being a chartered accountant, marketer, and having worked with radio communication and broadcasting for many years. The second proposer is a hardware technician and has worked with freight logistics. Neither of the team members seem to indicate technical expertise, graphical design experience nor do they have a large social media following that could be leveraged to sell these NFTs. ", "q1r": 1, "q2": "They propose 6 clearly measurable metrics for tracking the progress of their proposal, e.g. facebook likes, IG follower and number of views and tickets sold. This refers to the outcome itself, the proposers would do even better if they also included some metrics on KPIs for their ongoing work and mechanisms by which the community can follow the work. ", "q2r": 2, "assessor": "z_assessor_2447", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15378, "q0": "This is a proposal by Dimitri Fernando, a member of Catalyst who has a lot of proposals in every fund (I think he has 9 in the current one). In this one, he asks for funds to organize social events like eating challenges and sponsored walks, which would be used to raise even more funds, part of which would then go to a charity he claims to own, called Five Loaves Two Fish. I say claims to own, because I’ve searched the internet and I’ve found no information at all about this charity except a facebook page which has some very unconvincing photos (none of them show Dimitri). As experience for organizing all of this, Dimitri cites the fact that he has been taking part in these types of challenges all of his life and has raised funds in various capacities. The only issue with this is that no proof is provided to back these claims. It’s also stated here that tickets to these events would be sold as NFT’s, which means it would be exclusive to people using Cardano, drastically limiting any possible audience for something like this.\nSome risks are listed, but no ways to mitigate them are stated. For example: “Bad Weather on the day of the project.”. Ok, understandable if the event for that day was a walk, but you also need to tell the community how you plan to mitigate such risks.\nTo sum up, I do not think this proposal effectively addresses the challenge. Score: 2.", "q0r": 2, "q1": "Dimitri says that he intends to create a loyalty programme where people who participate will eventually get discounts and free tickets, but there is no mention at all of how this loyalty system will be built (technologies are not mentioned, people who would implement it are not mentioned etc). The implementation plan is split into 3 months and only mentions general actions to be taken, without going into any detail. For example, in month 1, the intent is to create the fundraising tool with NFT ticket allocator, the loyalty programme, 5 separate challenges to be done in the next 3 months, seeking out sponsors and more. All this with only two team members: Dimitri (who has no technical expertise from what I can see) and another person, Risantha Welikadage, a person who Dimitri claims to have worked in software development in the logistics industry, as a hardware technician for the Minnesota USA state government, as an entrepreneur and more. They seem to have held a position there as a lab aide who helped with IT support, but that is not a developer background. I have 8 years of experience in software delivery and I can outright say that what they want to do here in one month, with a single person that is technical (without convincing credentials), is extremely unrealistic.\nThe budget of 47000 USD is broken down into multiple items, but the costs seem to be assigned arbitrarily. There are no explanations as to why NFT minting costs will be 2000 USD, no explanations on how a loyalty programme would be built with only 5000 USD, etc.\nBased on all the extremely concerning issues that I pointed out above, I do not believe that this proposal would be completed successfully if it were funded. Score: 1.", "q1r": 1, "q2": "The auditability section is severely lacking in useful information. Dimitri has listed several metrics for measuring progress, such as “Number of tickets sold, Number of views, Number of shares etc”, but he has not set any targets for these. Without a target, one could claim that any amount of tickets sold for example above 0 is satisfying progress. Next time, please provide clear estimates so as to let the community know what they can expect from you as a proposer.\nThe measures for success are also extremely vague: “Creating awareness in the local community that Cardano community cares for their needs” - how will this be tracked? How can the community verify this? The other 2 are in a similar vein.\nSumming up all of the above, I do not think that the information here is sufficient to audit the progress and success of this proposal. Score: 1.", "q2r": 1, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create fun events like eating challenges and sponsored walks where I will carry out challenges in order to raise funds, This will be livestreamed for ticket holders to watch. Tickets sold only in ADA", "experience": "I have been taking part in Eating challenges and sponsored walks and cycle rides all through my life. I have raised funds in various capacities. I want to bring both together for Cardanians to enjoy and raise funds at same time."}