{"id": 381136, "author": "mark", "title": "Trust Funds by Ada", "url": "https://cardano.ideascale.com/a/dtd/381136-48088", "category": 26250, "amount": 10000, "description": "Creating a Trust is expensive and complicated.As wealth is created in the blockchain ecosystem people will need ways to share and manage it.", "funded": 0, "upvotes": 15393595, "downvotes": 20882981, "votes_result": 5489386, "votes_cast": 92, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Creating a community-led trust via a smart contract seems to be a very good application of resources for this challenge and fits very well, especially as it is a smart contract (mini proposal) built on top of the Cardano blockchain with an overall budget that fits the challenge. The proposer states that he wants to pursue the development of core reusable smart-contract building blocks - that is a great vision for building value and for scaling. I would like to commend the proposer for his vision to provide a more encompassing Trust smart contract that can be parametarized by any user beforehand, plus he thought of the great inclusion of allowing the funds in the Trust to be staked. Also, the idea of making it open-sourced is an even more valuable addition to the Cardano ecosystem. This is not just a proposal for a smart contract, as our Plutus pioneer proposer also wants to include an educational facet by including live-streamed coding sessions by building it in public. I commend the proposer for including a future vision in the form of future work - which indicates that the current proposal could evolve into a much greater contribution - especially with the proposed support for other tokens besides Ada and the utilization of oracles. ", "q0r": 5, "q1": "A weakness of this proposal in terms of feasibility - generally speaking - is that the the proposal as its stands now, seems to be situated in no man's land between an advanced draft for an implementation proposal and a real implementation plan. The proposal as it stands lacks deadlines, a budget breakdown with clear items and specific verifiable links that prove the proposers statements about his software expertise. The proposer states that he participated (what about completed?) in the Plutus pioneer first cohort. I say that - as I was accepted in the Plutus pioneer cohort 1 (but didn't have time to finish it). One thing that attracted my attention is that this proposal seems to have been previously submitted in earlier funds (https://cardano.ideascale.com/a/dtd/Trust-Funds-by-Ada/366848-48088) as essentially the same proposal, but then it had a 6-month development arc and a budget of USD 25000. The earlier proposal (which probably wasn't approved for funding) had a budget breakdown and a timeline. However, this Fund 7 proposal that is now being put to a vote lacks the budget breakdown and a project timeline. So - this could be easily improved in a future fund. I am not sure that the proposer has sufficiently addressed challenges and risks, especially as this proposal does not seem to have improved (included more detail or more explanations - or in general progressed towards a more specific implementation plan) since the previous fund when it was not approved for funding. The proposer did ask for a lump sum of $10,000, yet under the budget heading inside the proposal, a breakdown has not been provided. It simply states: \"Budget tbd\" [to be determined]. ", "q1r": 3, "q2": "It would have been good to include a timeline, especially as these proposals in the challenge are supposed to be realized in three months time. The inclusion of some milestones and an implementation plan would have allowed the easy auditability of this proposal. The previous - almost identical (yet with more content) proposal from August 2021 had a lot of interaction and comments on Ideascale. If this proposal does not pass this time around, I would advise the proposer to include an attachment in the next fund that includes the questions from Community Advisors and his responses. In fact, it would be best to make a weekly or bi-weekly plan for work for a proposal of this scope, so that progress can be verified. Even a video presentation might help to bring your vision to life. For example, the idea to build the smart contract in public, including live-streamed coding sessions, and office hours to discuss the direction - will be much more effective if it is fleshed out. On which platforms will it be broadcast? How often? Some KPIs would be more than useful. Number of Trust funds set up with the smart contract in the first 3, 6 and 12 months? Number of viewers of the online live-streamed sessions? Or other KPIs that the proposer finds relevant. Lastly, one word of encouragement: this proposal seems to be on the verge of success with voters, it just needs several hours more of refining into a precise action plan with a timeline, metrics and KPIs. Add the verifiable experience, add the budget breakdown and resubmit if not successful in Fund 7. \n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 28, "ne": 20, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Trust funds for ADA is a great idea, however, in my opinion, the proposal does not address the challenge because the proposal does not clearly show a path to an end product useable by end users with in 90days. I would advise the team to create a detailed roadmap to show path to success in 90 days\r\n", "q0r": 1, "q1": "The leader of the team describes a good work experience but I would like to see links to LinkedIn or a github repository for validation. I would like to see the plan to success be expanded by building a detailed roadmap with milestones.", "q1r": 2, "q2": "I would like to see the team develop a simple 3month roadmap with milestones to connect the funds expenditure with the goals of the proposal. Furthermore, the I would like to see the budget broken down beyond a single line entry. I would like the team to develop KPI's to help track performance, example execute 10 test contracts by week 8", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "A template for a smart contract enforced Trust fund with mission is a novel idea. The idea needs review and a better execution plan. There is a substantial use case for this kind of model to enable contribution to the Trust which behaves in a codified manner. ", "q0r": 4, "q1": "The proposer claims sufficient experience as a Software developer and has taken on a full-time role in the Cardano ecosystem. References to his past work would have added value to the proposal. Moreover, there are critical details that are yet to be decided by the proposer. This casts some doubt on the implementability of the proposal. ", "q1r": 3, "q2": "The code is to be in an open domain however what to be built has not been laid down except the guidance to build a Trust powered by a smart contract. The requested fund can be assumed to be the compensation for the developer's time. Any clarity on these items would have made the proposal auditable. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Sound like a great begining of an idea and very important area. Missing some more detailed explanations about the problem and the solution. The proposal is not detailed enough to be fully evaluated - please check the CA guide to see based on what CAs are evaluating the rporposals. https://cardanocataly.st/en/community-advisor/guide.html\n", "q0r": 2, "q1": "The Proposer seems to have the right profile and experience for the project, however more information about projects or Linkedin profile will be important. It will be great to have such a proposer be part of the community and succeed but again more info is needed in the proposal re the roadmap, deliverables KPI and budget. One suggestion is to connect with other catalyst community members and work together for next fund. ", "q1r": 3, "q2": "With missing information re deliverables and KPI and timeline it will be difficult to audit the proposal. There are good success list factors as well as having it in open source will help auditability. ", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "A smart contract that implements a financial Trust on the Cardano Network that delegates and distributes your tokens as you describe.", "experience": "Plutus pioneer cohort 1 participant. Software engineer for 8 years."}