{"id": 381579, "author": "ranket", "title": "JP-Regional Revitalization Project", "url": "https://cardano.ideascale.com/a/dtd/381579-48088", "category": 26244, "amount": 10000, "description": "Деиндустриализация (высокое старение населения, депопуляция, нехватка инженеров в местных регионах) является серьезной проблемой для развитой страны - Японии", "funded": 2, "upvotes": 166625150, "downvotes": 4849345, "votes_result": 161775805, "votes_cast": 209, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is part of a previously funded project that established a community hub in Yoshinogawa City, a small city in Japan. This proposal aims to integrate Cardano further in that city to make the city 'smarter' by introducing CNFT-based product tracing. This could make Cardano's presence in Yoshinogawa more visible and accelerate community influx. ", "q0r": 4, "q1": "This project's previous phase has been funded in Fund 6. This is a follow-up proposal expanding on the community hub that was established then. They have expressed a desire to expand the project's reach beyond one city, further indicating a successful previous phase. One minor concern in the proposal is that you aim only one product as a pilot instead of expanding the reach with several products. This might be an improvement to consider as it can provide you with data faster. ", "q1r": 4, "q2": "The proposers have learned a lot from last fund and have now adapted their proposal format to an international public. It has also been further clarified that there is indeed an intention to expand beyond the city after the funding of this proposal. A roadmap, budget breakdown have been added to assist the plan. Unfortunately at the time of this assessment, the Kittamu website was down. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "The proposal has some good parts but it seems that is heading on too many directions that will make it difficult for implementation. The proposer should separate the activities (NFT use case should be on its own way as it requires a DApp build or at least a platform when the NFTs can be used as required) and make a clear statement about the project direction.\r\n\r\nThe Challenge Brief says \"Local Community Hubs across the world where the average person can take part in their own language and with their own cultural understanding\" and the proposer should follow this path and build something to achieve the set goals.\r\n\r\nIf the proposal goal is to deliver presentation materials to the community, then it follows the challenge objectives, if it is something more complex to deliver, then the proposal should ne rephrased and presented in a more appropriate campaign.", "q0r": 3, "q1": "The proposer already has a proposal from Fund6 that was funded and is on its way success thus the experience for assembling meeting is covered. It will be nice to see the progress of the previous proposal to make a good point about the capacity to complete a project.\r\n\r\nFor an outsider is somehow difficult cu understand what is the purpose of this phase of the project (STEP2) as \"Citizens will know Cardano is good and special.\" doesn't emphasize the usability of ADA or Cardano ecosystem.\r\n\r\nThe budget is broken down into identifiable items but, as I said previously the NFT creation and use for tracking an original product (plum liquor) requires more resources to make it viable. If is just a presentation for the concept the proposal has to clear out these aspects.\r\n\r\nThe principal activities presented are: a \"Festival based on Cardano Suppport\" and a \"Enhanced Seminar Scale\" without providing additional information (virtual or face to face? how many participants are expected to attend? etc.)", "q1r": 3, "q2": "The proposal itself reads very poorly. It reads like a concept more than as an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "I strongly agree that this proposal effectively addresses the challenge as it plans to hold seminars about ADA for the local people in Tokushima and Shikoku - Japan. Additionally, it also aims to make people use blockchain for traditional products in the areas like Plum Liquor, Beef and use NFT to keep track of their origins. If all these activities can be held successfully, I think it will attract many people to Cardano. ", "q0r": 5, "q1": "I checked Kittamu project's website and could tell the team is very good. The development is clear. I just want to suggest two things:\r\n1. Budget should be broken down more since it's is now quite general.\r\n2. The team should consider some challenges from local people when presenting about cryptocurrency of ADA. ", "q1r": 4, "q2": "I advice team to make KPIs more clear into figures, for example, after 3 months, how many seminars are held, how many citizens join, how many of them get to buy ADA, etc. \r\nKey metrics to success should be written in a separate part also. ", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "Мы обеспечим принятие технологии БК на основе Cardano для граждан и правительства местных районов Японии, что расширит возможности использования ADA.", "experience": "Мы уже провели семинар Cardano BC для местных органов власти и граждан и уже получили положительную реакцию, в том числе и в других районах."}