{"id": 383297, "author": "markv", "title": "Musicmerge - Decentralized ( Song )", "url": "https://cardano.ideascale.com/a/dtd/383297-48088", "category": 26244, "amount": 15700, "description": "Новичкам и любителям криптовалют образование в области блокчейна может показаться \"скучным\". Их трудно заинтересовать истинным потенциалом DLT.", "funded": 1, "upvotes": 29051465, "downvotes": 23586942, "votes_result": 5464523, "votes_cast": 117, "f6_no_assessments": 3, "f6_rating": 4.0, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=10800"], "media": [], "f6_assessments": [{"q0": "This is a proposal to promote blockchain applications through music. Although music is easy to spread, spread, and access, in-depth knowledge cannot be promoted in this way. Moreover, only those who go deep, considering programming on blockchain as a profession they will seriously look for courses, not through blockchain music.", "q0r": 3, "q1": "Proposal needs more practicality, making music to promote content is good but it's introductory content, not in-depth programming content that can be conveyed through music.", "q1r": 3, "q2": "Blockchain music projects can be easily checked through the number of music products released, the number of views, the number of likes... So testing the effectiveness and impact of this proposal is pretty easy.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": "This project is very interesting and creative. Getting people more interested in Cardano in particular and crypto in general with music is a brilliant way because along with social media, good music can make everything go viral. The more these songs viral, the more it's likely that many new commers join Cardano Catalyst community. However I think it would be better if there are many version of these songs in many languagues or at least they have accurate subtitles for them.", "q0r": 5, "q1": "He has the enthusiam and have experience in project implementation, especially he's the winner on Fund 5 and Fund 6. The spending is also carefully planned and persuasive. The plan is well-thought with detail activities on each phase. However there is risk that the output/ the song is not good enough to be viral or the community response is not good. ", "q1r": 4, "q2": "The proposal includes clear timeline and KPIs, which make it easy to track the progress of the proposal and measure the success of the project. Moveover, since the output (the songs) is published on media so it's really transparent and easy to audit.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "This is an interesting idea with using music and songs to spread and market blockchain technology, and Cardano. With the idea of using platforms such as Spotify, I can see this as a solid marketing tool to bring in new adoption.\r\nOverall and objectively, this proposal is a wonderful idea.", "q0r": 5, "q1": "The proposer has some seemingly strong experience in business. However, some verification on specific music industry knowledge would be directly beneficial for this proposal.\r\nIn the plan, there are ambitious goals of attracting the various types of experiences persons to create and product a song. However, it would be helpful to be able to read if there is any current partnership traction.\r\nI am concerned that the ambitions here may be challenging, given the above thoughts. On the same note, producing several songs is not an unsurmountable goal.", "q1r": 3, "q2": "Simply put, the metrics and KPIs explained make sense for this proposal. It is a matter of 1) Showing proof of the required artists and talent to achieve the goal. 2) Demonstrate the step progress of the songs. 3) The actual delivery of the song. The one metric that could be difficult or interesting to demonstrate, would be the main goal of this challenge. And that is to bring in new adoption and awareness.", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Используйте страсти людей, чтобы разжечь искру осведомленности, участия и вовлеченности: музыка NFT обращается к двум из них", "experience": "Рик получил степень магистра экономики в 1991 году, имеет 25-летний опыт продаж в сфере бизнеса-6 лет в качестве предпринимателя + победитель Фонда 5 и 6."}