{"id": 383975, "author": "profd2004", "title": "Cardano Blockchain Lab in Kenya", "url": "https://cardano.ideascale.com/a/dtd/383975-48088", "category": 26244, "amount": 38255, "description": "Хотя Кения находится в авангарде технологических инноваций в регионе, Cardano все еще малоизвестна среди общественности и разработчиков.", "funded": 2, "upvotes": 106120920, "downvotes": 2583699, "votes_result": 103537221, "votes_cast": 247, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Проблема, определенная в данном предложении, соответствует ожиданиям задачи. Кейан - это страна в Африке, где необходимо глобальное внедрение технологии блокчейн, чтобы помочь местному сообществу решить некоторые из основных проблем, с которыми они сталкиваются. Создание хаба для наставничества разработчиков принесет большую пользу местному сообществу, а также экосистеме cardano. В конечном итоге разработчики смогут создавать dapps в экосистеме cardano, которые будут решать проблемы, с которыми африканцы сталкиваются прямо сейчас. Кроме того, автор предложения добавил ключевые метрики, которые полностью соответствуют задаче. Я не определил план масштабирования для будущих задач, но, по моему мнению, существует как минимум 2 способа масштабирования этого предложения: один - это тиражирование такого же хаба в других частях страны, другой - расширение существующего хаба. (Рейтинг 5)", "q0r": 5, "q1": "Автор предложения упомянул о наличии опыта в разработке и технологии blockchain, но не предоставил доказательств, таких как профиль linkedin или даже предыдущая работа в этом направлении. Я предлагаю автору добавить эту информацию, поскольку она действительно важна для оценки осуществимости проекта. Кроме того, бюджет был разбит на идентифицируемые статьи. Все предметы, необходимые для реализации проекта, были описаны, но я не могу знать правильность указанных цен. Но, основываясь исключительно на своей интуиции, я считаю, что цены верны. Кроме того, автор предложения предоставил график работ. Но я не нашел в этом предложении плана на случай, если потребуется дополнительное финансирование. Я предлагаю автору предложения иметь это в виду, поскольку бюджет, скорее всего, никогда не будет точным. В целом, основываясь на информации, изложенной в данном предложении, я уверен, что проект может быть успешно реализован.(Оценка 4)\r\n", "q1r": 4, "q2": "Данное предложение имеет высокую вероятность прохождения аудита на основании информации, предоставленной автором предложения. Предложение включает дорожную карту и разумные этапы. Этапы могут быть отслежены через 3 месяца, 6 месяцев и 9 месяцев. Сообществу были предоставлены все детали, включая KPIs, чтобы отслеживать прогресс этого предложения. В целом, я могу сказать, что проблема, изложенная в этом предложении, была описана четко, и решение тоже.(Оценка 5)\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Воздействие:\r\n\r\nПостановка проблемы:\r\nКения находится на переднем крае технологических инноваций, но Cardano остается практически неизвестной среди общественности и разработчиков в регионе.\r\nДля решения этой проблемы автор предложения разработал план по созданию в Кении блокчейн-лаборатории Cardano.  Это начинание призвано решить проблему недостаточной осведомленности о Cardano в Кении и вывести нашу экосистему на передний край технологического признания в регионе.\r\nПлан предусматривает сотрудничество с успешными неправительственными организациями для формирования команд молодых кенийских профессионалов, сосредоточенных на экосистеме Cardano.  \r\nДемографическая информация:\r\nПроект направлен на привлечение новых разработчиков, перевод контента Cardano на суахили и проведение работ по разработке блокчейна на сайте lidonation.com - пуле колов на основе Cardano (LIDO) и ознакомительном сайте.\r\nЭтот проект направлен на внедрение блокчейна на базовом уровне и предусматривает активную работу с сообществом, а также активное и полезное привлечение нескольких недавних выпускников колледжа.\r\nПлан действий:\r\nПредлагаемый план начинается с приобретения компьютеров, используемых исключительно для работы с Cardano, и содействия наставничеству, работе разработчиков и обучению.  После начала программы наставничества команда планирует организовать ежемесячные встречи под руководством двух сотрудников по работе с населением, которые также будут проводить офисные часы и участвовать/создавать каналы Cardano на суахили в социальных сетях.\r\nЧасть плана включает в себя перевод лаборатории на самоокупаемость путем поиска способов использования экосистемы Cardano и ее возможностей.  Рассматриваются следующие варианты:\r\n1. пожертвования выпускников\r\n2. запуск пула ставок\r\nДанное предложение решает задачу масштабирования центров сообщества Cardano, используя смелые инновации в сочетании с конкретным планированием для достижения заявленной миссии. Я полностью согласен с тем, что данное предложение эффективно решает поставленную задачу:  ОЦЕНКА 5.\r\n", "q0r": 5, "q1": "Целесообразность:\r\nПредлагающий данную оценку использует продуманный план и экспертные знания региона, чтобы донести видение успеха данного проекта.  \r\nКлючевые показатели эффективности (KPIs):\r\nПроект уже реализуется, и в случае успеха.  Запуск хаба в ближайшие 6 месяцев станет первым в своем роде в Кении. 5 разработчиков уже готовы стать частью программы наставничества.  Как только нынешние разработчики пройдут обучение, они перейдут к управлению лабораторией.\r\nЭтот проект поддерживают Друзья дороги Нгонг (FONR) - американская некоммерческая организация, которая занимается сбором средств для NRCF и Детского фонда дороги Нгонг.  NCRF - это кенийская НПО, которая предоставляет возможности качественного образования детям, затронутым ВИЧ/СПИДом, живущим в трущобах Дангоретти в Найроби.  \r\nKaribu Techmates - это программа, спонсируемая NRCF, помогающая недавним выпускникам колледжей с техническими навыками получить доступ к обучению и возможностям трудоустройства. Новый учебный центр Elimu Hub предлагает возможности обучения и трудоустройства в онлайновой экономике.  Данный проект стремится стать стратегическим партнером в этом предприятии, развивая мощную информационно-пропагандистскую деятельность и развитие сообщества Cardano.\r\nДанное предложение может выиграть от взаимодействия с крупной донорской базой FONR/NCRF, что увеличит общий охват проекта.  Эти хорошо зарекомендовавшие себя НПО обеспечивают необходимое доверие к этому проекту.\r\nДорожная карта:\r\nЦель на 3 месяца - получить 5 выделенных рабочих станций, 2 стажеров-разработчиков и 2 сотрудников по работе с населением, которые проведут первое мероприятие для сообщества и будут продолжать проводить ежемесячные мероприятия.\r\nЦель на 6 месяцев - выпуск первой когорты разработчиков из программы и начало работы второй когорты, которая будет проводить ежемесячные общественные мероприятия и отчитываться перед сообществом Catalyst о посещаемости и отзывах о мероприятиях.\r\nЦель на 9 месяцев предполагает, что ветераны-подопечные будут вести постоянные программы наставничества для разработчиков, а лаборатория будет взаимодействовать с сообществом Catalyst.  Это также создаст возможности для новых партнерств и финансирования для текущего обслуживания на данном этапе.   \r\nКвалификация, необходимая для завершения проекта:\r\nОсновными людьми, стоящими за этим проектом, являются:\r\nДарлингтон Влех - Dev/Ops инженер с 3-летним опытом работы, который, по описанию, обладает глубоким пониманием облачных технологий, языков программирования и технологии блокчейн. Его профиль можно проверить через LinkedIn.\r\n\r\nСтефани Кинг не имеет профессионального профиля, поэтому сложно сказать, обладает ли она навыками, опытом или знаниями для достижения цели штата.\r\nБюджетная разбивка:\r\nРаспределение бюджета для этого проекта детализировано и объяснено очень хорошо. В нем указаны расходы на:\r\n1. подопечных разработчиков\r\n2. компьютерные станции\r\n3. веб-сайт для лаборатории\r\n4. директора по наставничеству\r\n5. помощь сообществу\r\n6. офисное помещение, расходные материалы, маркетинг, организация мероприятий\r\n7. Координатор и администрация Cardano Hub\r\n8. пользование интернетом\r\n9. электроэнергия.\r\nДанная разбивка расходов является исчерпывающей и очень хорошо подходит для обеспечения прозрачности и доверия к сообществу Cardano. Я согласен, что с учетом опыта и представленного плана высока вероятность того, что данное предложение будет реализовано.  ОЦЕНКА 5\r\n", "q1r": 5, "q2": "Контролируемость:\r\nПоскольку данный проект все еще находится на начальной стадии, ключевые показатели эффективности еще не полностью разработаны. Однако между \"дорожной картой\" и подробной разбивкой бюджета имеется достаточно информации, чтобы следить за успехом проекта, используя эти два документа для точного отслеживания хода программы. В программе используются:\r\n- Подопечные разработчиков - $4,500 Стажерам программы наставничества разработчиков платят $250 в месяц за 30 часов в неделю.\r\n- Компьютерные станции - $11,000 3 новые рабочие станции для разработчиков с возможностью запуска всех архитектурных элементов cardano: db-sync, node, graphQL server, ogmios, hasura, wallet backend и plutus application backend.\r\n- Веб-сайт для лаборатории - $360 Это покроет расходы на создание нового веб-сайта для лаборатории Ngong Road Cardano Lab в Найроби, Кения, и размещение сайта в течение 1 года.\r\n- Директор по наставничеству - $6,000 Дарлингтон руководит программой наставничества и тратит 5 часов в неделю на обучение подопечных в рамках программы, включая 3-часовую сессию парного программирования. Дарлингтон уже является наставником двух недавних выпускников. Он также успешно устроил 3 студентов на должности инженеров-программистов в Yelp, electricbikereview.com и Департаменте игр и рыбалки штата Колорадо (все они до сих пор работают в соответствующих организациях).\r\nОбщественные мероприятия и работа с населением\r\n- Работа с населением - $6,000 Оплачивается работа двух сотрудников по работе с населением в Кении, а также координаторская поддержка со стороны команды Lido Nation. Мы будем планировать и проводить ежемесячные встречи, офисные часы с членами сообщества, которые интересуются Cardano, и участвовать в социальных платформах, чтобы помочь создать и развивать кенийские/суахили каналы контента для Cardano.\r\n- Офисные принадлежности, аренда помещений, маркетинг, проведение мероприятий - $2750 Оплачивается подписка на Zoom и MailChimp, офисная мебель и принадлежности, а также прохладительные напитки для ежемесячных мероприятий.\r\nКоммунальные услуги и администрация\r\n- Координатор и администрация Cardano HUB - $3,200 Оплата услуг сотрудников Lido Nation и Elimu Hub по найму персонала, координации задач, планированию будущих потоков доходов для поддержания лаборатории после 9 месяцев запуска.\r\n- Интернет - $4033.00 Эта сумма покрывает 60% стоимости интернета для лаборатории в течение 9 месяцев. Получить хороший интернет в Кении очень сложно и дорого; возможность помочь NRCF в этом вопросе является ключевым фактором для охвата этого региона инструментами блокчейна!\r\n- Электроэнергия - $412.00 Эта сумма покроет 50% счета за электроэнергию для центра на 9 месяцев. Новый центр Elimu Hub строится для работы на солнечной энергии!\r\n- Я согласен, что предоставленной информации достаточно для проверки хода и успеха предложения. ОЦЕНКА 4\r\n", "q2r": 4, "assessor": "z_assessor_479", "no_vca": 15, "ne": 9, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Это действительно невероятный проект, направленный на расширение возможностей местного сообщества в Кении посредством партнерства с хорошо зарекомендовавшим себя общественным центром - Elimu Hub. Предпосылкой этого проекта является предоставление физических ресурсов и образования, необходимых для обучения местного сообщества работе с Cardano и повышения осведомленности о Cardano в безопасной и благоприятной среде.\r\n\r\n\r\nКоманда имеет богатый опыт и уже занимается переводом суахили на Cardano. Они будут наставлять 5 новых разработчиков Cardano и знакомить многих с экосистемой Cardano через мероприятия и семинары на базе сообщества. Проект ориентирован на местное сообщество в бедном районе Кении, но его масштабируемость может быть обеспечена путем внедрения аналогичных моделей и партнерства в других общественных местах в трущобах по всему миру. Для этого потребуется отличная документация для создания тематического исследования влияния этого проекта.", "q0r": 5, "q1": "Общественный центр, с которым сотрудничает команда проекта, работает в этом районе с 2003 года и разработал долгосрочное видение того, как они могут принести пользу детям и молодым людям в этом районе через образование и, более того, через предоставление надежды на будущее.\r\n\r\nУ команды есть подробный план по расширению существующего образовательного центра и поддержка со стороны специализированной команды с опытом работы с Cardano. План реализации этого проекта также действительно солидный и включает в себя бюджет для оплаты участия в программе наставничества, что устранит значительные барьеры для молодых участников в этой области и, более того, будет мотивировать и обучать их вносить максимальный вклад в программу с точки зрения их времени и энергии.\r\n\r\nСроки, бюджет и общая программа действительно четко прописаны и имеют большой смысл, учитывая контекст, в котором работает команда. В нем предусмотрены физические ресурсы, стабильный доступ в Интернет, поддержка работы с населением и основные материалы.", "q1r": 5, "q2": "Это определенно проект, который можно улучшить, если постоянно проводить профилирование на встречах в мэрии, чтобы помочь в реализации проекта и убедиться, что он остается на верном пути. На данном этапе в предложении очень мало указано, как они будут отчитываться, однако, похоже, что интерес к Cardano велик, и это даст возможность обмениваться идеями и вдохновлять больше проектов, меняющих жизнь, как этот, по всему миру. KPI's и этапы являются четкими и измеримыми. Даты выполнения не являются конкретными, однако это временные вехи, позволяющие начать проект в соответствии с результатами финансирования и, вероятно, множеством других соображений для выполнения проекта такого рода.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 11, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "I think this proposal effectively addresses the challenge since it wants to create a hub/ lab in a NGO (Ngong Road) in Kenya to introduces and educate graduated students of this NGO about Cardano/ blockchain. Target community is good since fresh graduates are sensitive about technology. They can form a hub and sharing information with others.  ", "q0r": 5, "q1": "Timeline, budget, team, resources are all fine.\r\nThe only thing that makes me concern is the sustainability of the lab since it asks to be invested facilities ($11k for computer stations) but I don't see how to generate the lab's own money to continue operating after 9 months being funded. ", "q1r": 4, "q2": "Roadmap with milestones is clear. I advice team to add KPIs to the proposal, for example: number of people joining offline meet-ups, numbers of engagement Swahili social channels, people attracted to Cardano via the lab, etc.", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Расширить существующий студенческий центр сообщества НПО, добавив лабораторию блокчейна Cardano с выделенными компьютерами, наставничеством для разработчиков и обучением сообщества.", "experience": "14+ лет Разработка программного обеспечения и облачных технологий, разработка блокчейна, бизнес-консалтинг, языки мира, техническое письмо, преподавание, наставник 3 человек."}