{"id": 384621, "author": "jeffghome2020", "title": "Cardano FIT - Africa", "url": "https://cardano.ideascale.com/a/dtd/384621-48088", "category": 26244, "amount": 34100, "description": "НФЛ не набирает таланты из Африки. Мы хотим создать в Африке футбольные тренировочные программы для обучения молодежи футболу.", "funded": 0, "upvotes": 16839913, "downvotes": 23493724, "votes_result": 6653811, "votes_cast": 103, "f6_no_assessments": 4, "f6_rating": 1.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal fails to connect the two issues. The role of sport as an instrument to strengthen the spirit of young people in any society is indisputable.  However, the only thing I can visualize are parents sneaking out of the meeting room where Cardano is being discussed to go watch their children play.  \r\n\r\nI think Cardano as an organization could financially sponsor sports activities in the communities as a form of social contribution.  However, producing NLF players and engaging local communities in the Cardano ecosystem are two different businesses, each with their own numbers and characteristics. \r\n\r\n", "q0r": 1, "q1": "For the reasons describe above, I don't think the proposal is based on the objectives of the campaign.  However, I send my best wishes to the proposers in their mission.", "q1r": 1, "q2": "For the reasons describe above, I don't think the proposal is based on the objectives of the campaign. However, I send my best wishes to the proposers in their mission.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "As mentioned the idea is great but more information is needed on how this project would be accomplished and planned. This Inter-country football development solution will increase community connections and help many Cardano countries and ecosystems.\r\nThe problem and solution presented are within the scope of the challenge. I love this proposal. The problem you have stated still in many other African countries.", "q0r": 3, "q1": "I'm sure the team on this project is able to run it successfully. I emphasize the feasibility of the scheme. It would be good if it was taken care of and taken seriously.\r\nBut we don't know important details such as: his name, his field of training, examples of previous work in the field he says he is involved in, how active he is in the community (does he participate in Catalyst? Does he hold? Does he participate in any pool). Unfortunately when the team identity is sketchy. You can add to increase feasibility.\r\nTo further increase the success ability of this proposal, I would have liked to see a list of potential risks and challenges. I advise you to provide risks to increase the transparency of the scheme.", "q1r": 2, "q2": "A budget breakdown was presented, but there are no details on the allocation of resources that would allow for an appropriate assessment of feasibility. It will be much better if the budget is reasonably explained.\r\nThe proposal has no roadmap and single line budget. I recommend that you specify the timeline.\r\nAnother thing that would have been nice is to have KPIs like how many devs do you expect to start using your API or how many shared portfolios for a year, or something relevant. I recommend the scheming KPI", "q2r": 2, "assessor": "z_assessor_642", "no_vca": 21, "ne": 1, "ng": 10, "nfo": 10, "vca_o": 1}, {"q0": "The proposal does mention the Cardano community however it seems to be a very thin veneer over a football training camp. I would like to see a more detailed outline of how this brings value to the Cardano ecosystem as a whole.", "q0r": 2, "q1": "The proposal's Team has obvious experience within the football field but I'm uncertain wether they hold experience with video editing and the Cardano ecosystem as no further links are given. The funds are broken down but due to the amount I would like to see a more in depth breakdown. ", "q1r": 3, "q2": "No Roadmap is provided. Nor are any Key performance indicators given and therefore it is impossible to audit the success of this project especially in terms of the Cardano ecosystem.", "q2r": 1, "assessor": "z_assessor_745", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This proposal wants to recruit young people to football training programmes and educate these people's parents about Cardano. It doesn't inform me what to educate them and how football programmes can contribute values to the Cardano ecosystem. Therefore, I rate 1 since I do not see that this proposal make impact for Cardano.", "q0r": 1, "q1": "This proposal doesn't have a timeline. Target demographic remains unknown since it just mentions Africa and I think that's too big. Budget doesn't include cost for venue since the training programmes are offline. ", "q1r": 1, "q2": "This proposal doesn't have key roadmap, milestones, key metrics for success, and KPIs. It doesn't provide me sufficient information to audit.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Мы хотим разработать футбольные программы, которые будут бесплатно передаваться странам, чтобы помочь обучить их молодежь стать профессиональными футболистами.", "experience": "Бывший игрок NFL, действующий игрок Varsity, бывший военный тренер и элитные спортсмены - все они вносят свой вклад в эту программу."}