{"id": 380952, "author": "rodolfo.miranda", "title": "Grow Latin America, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/380952-48088", "category": 26257, "amount": 500000, "description": "Comment pouvons-nous développer l'écosystème Cardano en Amérique latine ?\nComment pouvons-nous donner aux habitants de l'Amérique latine les moyens d'avoir un impact sur la région et le monde ?", "funded": 1, "upvotes": 84070060, "downvotes": 22885201, "votes_result": 61184859, "votes_cast": 579, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Avertissement : mes points de vue sont façonnés par mon expérience de plusieurs années dans la gestion de produits et le développement de logiciels.\r\n\r\nCe défi vise à accroître l'adoption de Cardano dans une région comptant plus de 660 millions d'habitants, ce qui va dans le sens des objectifs stratégiques du Fonds 8 : accroître le nombre de contributeurs et développer l'écosystème de développement et d'applications.\r\n\r\nEn même temps, il serait formidable que le défi fournisse une analyse et une discussion sur les fonds nécessaires pour réaliser un progrès notable et une comparaison coût-efficacité (coût par utilisateur, coût par développeur) avec d'autres défis régionaux (Grow India, Grow East Easia).\r\n\r\nJ'ai fait les déductions suivantes :\r\n- 1 point pour l'absence de discussion sur la capacité à obtenir un impact notable.\r\nMa note est de 4.", "q0r": 4, "q1": "Compte tenu du défi existant du Fonds 7 avec 70 propositions, il y a certainement une communauté prête à contribuer aux objectifs du défi.\r\n\r\nEn même temps, la proposition serait plus forte si elle fournissait une discussion sur les meilleures pratiques pour l'accueil des utilisateurs et des développeurs à partir des expériences des initiatives précédentes dans ce domaine et de leur rentabilité respective.\r\n\r\nJ'ai fait les déductions suivantes :\r\n- 1 point pour l'absence de discussion sur la suffisance des fonds demandés pour obtenir un impact notable.\r\nMa note est de 4.", "q1r": 4, "q2": "Les mesures proposées (le nombre de propositions, la qualité des propositions et le nombre de nouveaux cas d'utilisation) ne fournissent que des mesures des activités, mais pas de l'avancement vers l'objectif des défis.\r\n\r\nPar exemple, la prise en compte de certaines mesures parmi la liste suivante pourrait rendre la proposition plus forte :\r\n1) le pourcentage d'utilisateurs et de développeurs intégrés dans le cadre de cette initiative.\r\n2) le coût par utilisateur et développeur embarqué.\r\n3) le pourcentage d'applications et le pourcentage de développeurs dans l'écosystème cardano provenant de l'Amérique latine,\r\n4) le nombre de projets open-source de développeurs latino-américains visant l'écosystème Cardano.\r\n5) la satisfaction et l'engagement des utilisateurs et des développeurs intégrés dans les projets de cette proposition par rapport à d'autres initiatives.\r\n\r\nJ'ai fait les déductions suivantes :\r\n- 1 point pour le manque de métriques évaluant l'impact relatif sur l'écosystème Cardano.\r\n- 1 point pour le manque de mesures évaluant la satisfaction des utilisateurs et la compétitivité des solutions.\r\nMa note est de 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 41, "ne": 21, "ng": 11, "nfo": 9, "vca_o": 2}, {"q0": "At least two of the three strategic goals defined for fund 8 are aligned with this proposal. The number of proposals for Fund 7 for this challenge was the third most in terms of the number of proposals submitted by the community. This indicates the enthusiasm that the community has for growing the region and the Cardano ecosystem and I am certain that this is only the beginning. Consequently, I agree with maintaining this challenge for the next fund.\r\n", "q0r": 5, "q1": "The quality and quantity of proposals submitted by the community is sufficient proof that Catalyst is capable of addressing this issue. This amount of funding seems appropriate to me. Additionally, the fact that there is a challenge team dedicated to the support of all proponents makes it even more feasible.\r\n", "q1r": 5, "q2": "The success metrics suggested by the author of the proposal seem appropriate to me; they seem to have been developed in a more refined manner than those presented in the previous challenge. An area of improvement that I would suggest is a metric that allows us to examine the sustainability of proposals that are coming from the region. \r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 26, "ne": 5, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "The challenge aligns with Fund 8 Strategic Goal of prepare a group of people willing and able to make contributions to the ecosystem. To improve challenge: better articulate how the challenge aligns with more than 1 of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The challenge does an excellent job describing the interest, skills, and demand for the challenge. The $2.4 million in requested funds demonstrates proposer capacity to easily meet the $500,000 budget requested.", "q1r": 5, "q2": "The success criteria and metrics are adequate for measuring progress in addressing the challenge. To improve challenge: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "This challenge is directly related to Cardano's mission. Clearly, we need the help of community members from around the world. The Latin American region with the largest percentage of the world clearly needs to be allocated adequate resources to develop the community here.\r\nTherefore, based on the given information, I strongly agree with this proposal's alignment.", "q0r": 5, "q1": "With what is happening at Fund 7, I think that the community has been waiting and responding enthusiastically to this challenge. This should be further promoted.\r\nI strongly agree with this proposal's feasibility,", "q1r": 5, "q2": "The key metrics are convincing and effectively measure progress in addressing the challenge and layout the different perspectives for reviewing the success and efficiency of this challenge,\r\nTherefore, based on the given information, I strongly agree with this proposal's verifiability.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 21, "ne": 1, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "The challenge is about growing Cardano ecosystem in Latin America, which is aligned with the first goal in Fund8 strategic. This challenge follow to the success of itself in Fund6. Therefore, this challenge is definitely critical to achieve Cardano mission.", "q0r": 5, "q1": "As we can see this is one of active campaigns with 84 proposals in the category. That is clearly the first success which can show the idea is truly great for Cardano community's development in the region as well as in the entire world. We will have many quality proposals which get funded among these 84 proposals. Besides, many of them will not have chance to be funded this time. So, it makes sense completely when the team keep proposing the idea for Fund8 challenge setting to raise the success and to give the second chance for talented and passionate proposers.\r\nIn my opinion, $500K requested fund (3.9% of the total available for Fund8) is suituable due to the challenge's diversity and the large number of participating projects ( in Fund7 – and that number will be increasing if this challenge is successful). I believe the Catalyst community has the capacity to address this challenge. Bonus this team is  challenge team as this challenge was successful in Fund6.", "q1r": 5, "q2": "Success criteria and key metrics are set correctly and easily to measure progress in addressing the challenge. I strongly agree the challenge is verified clearly.\r\nI would like to ask the team a question: one of your metrics is 'The volume of proposals originated by Latin American people', how about the quality proposals which are submitted by outside Latin American people but the goals are for the growth of Cardano ecosystem in Latin American countries (and they are not about new application as the last metric mentioned)? Should we add that as a key metric in this challenge? (just a question for me to understand more about the challenge, please pass if it is not suituable for the goals of the challenge in Fund8.)", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Within the same frame of mind which has made Africa the main geographical target of Cardano adoption, all geographical Challenges within majority developing-country areas of the world are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. Having said that, Latin America has the characteristics of a high inequality region, with many informal workers and approximately half of the population going unbanked. This is a region ripe for disruption via the cryptoeconomy, specially given the high inflation rates in many countries, and the use of Cardano-led projects will ensure a predominant market position for Cardano from an early stage, the spread of SPOs, maximization of transaction volume and onboarding of new members.", "q0r": 5, "q1": "The high engagement within the Fund7 iteration of this Challenge (with 84 proposals, third in amount of proposals received after Dapps and Integration and the Miscellaneous challenge) show the enormous potential for projects and onboarding within the Latin American community. The team is highly experienced and motivated, with a verifiable track record within the Community, and have done a very thorough exercise of community management and engagement, both on the physical and virtual level, with Latin American TownHalls already in the making, plus Telegram and Discord channels for the Latam community already in place.", "q1r": 5, "q2": "The key metrics identified (volume of proposals, impact on their local communities, number of new local Cardano communities in LatAm) are consistent with measuring the progress of the proposals set forth within the Challenge. As in Fund7, it would be interesting to also incorporate as KPIs the transaction volume increase and augmentation of SPO activity in LatAM. The fact of having an already established Challenge team also helps enormously in ensuring the verifiability of a second iteration of the same Challenge, where the experience pbtained from the first version will undoubtedly assist in refining concepts, engagement strategies and project onboarding after the voting process.", "q2r": 5, "assessor": "z_assessor_787", "no_vca": 15, "ne": 7, "ng": 8, "nfo": 0, "vca_o": 1}], "importance": "L'adoption massive nécessite une vision globale. Les initiatives qui se concentrent sur les économies émergentes telles que l'Amérique latine sont la clé d'un engagement exponentiel.", "success": "Un large éventail de personnes originaires d'Amérique latine ou ayant des liens avec l'Amérique latine se réunissent et forment des équipes pour développer notre écosystème."}