{"id": 381169, "author": "vladimirp", "title": "Cardanomics", "url": "https://cardano.ideascale.com/a/dtd/381169-48088", "category": 26257, "amount": 250000, "description": "Comment pouvons-nous aider la communauté à analyser et modéliser de manière indépendante les relations économiques, les incitations et les tendances dans l'espace financier de Cardano ?", "funded": 1, "upvotes": 30617002, "downvotes": 15596621, "votes_result": 15020381, "votes_cast": 205, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe proposal's aim of providing a deeper economic analysis of the Cardano's ecosystem does support the Fund8's objective of growing the number of contributors.\r\n\r\nAt the same time, the proposal does not provide an explanation why specifically economic research should be a dedicated focus area in comparison with other areas such as social, governance, technological, etc. of broder challenges such as Open Research.\r\n\r\nThe proposal would be stronger if it provided historical success stories of economic research driving impact  within Cardano/blockchain ecosystems, which could help drive inspiration and provide a vision for the ROI on this initiative.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this segment of research can bring high ROI to the community.", "q0r": 3, "q1": "The cardano community does have economists and scientists capable of contributing to economic research, so the challenge can be addressed.\r\n\r\nAt the same time, this proposal without an analysis of historical success cases and a vision for high-ROI areas of research looks risks with regards to its ability to bring noticeable impact from the funds requested.\r\nFor example, how likely this initiative to drive more voters, proposers, developers into the ecosystem compared to Dapps & Integrations, Open Research, or regional growth-focused challanges?\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal defines some measurements (the number of forecasting models, the number of economic analyses) that can track activity within the initiative.\r\n\r\nHowever, those measures do not provide insights into the overall impact on the cardano ecosystem. In my opinion, considering the following metrics and ideas would make the proposal stronger:\r\n1) the % of Catalyst proposals that reference the conducted research within this initiaitve.\r\n2) the % of developed apps that use ideas sparked by the research within this initiaitve.\r\n3) the ROI of apps/proposals targeting use cases uncovered through the research in comparison to those that do not.\r\n4) the satisfaction of the research made within the initiative vs the research made in other ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 30, "ne": 6, "ng": 14, "nfo": 10, "vca_o": 1}, {"q0": "As Cardano moves towards it's Voltaire era of self-sustained and decentralized governance it becomes critical that the Cardano community learn to take decision making from IOG. A challenge, like the one presented here, that will promote individuals and teams to independently analyse Cardano's economics and incentives will greatly enhance the capability of the community to make informed decisions and increase the resilience of the whole Cardano ecosystem. The challenge aligns fully with the first strategic goal of Fund 8 (\"Prepare a group of people willing and able to make contributions to the ecosystem\")", "q0r": 5, "q1": "The Cardano ecosystem is still in it's relative infancy i.e. it's smart contract capability is still being rolled out with most significant projects planning on going \"mainnet\" sometime during 2022. This uncertainty will make it challenging (at this stage) to perform meaningful economic or trend analyses. Saying that it's probably a good time for teams to start forming and putting thought into this topic in order to \"hit the ground running\" when the Cardano ecosystem fully takes off. Cardano has one of the most active communities out there and between whales, community advisors, developers, stake pool operators, etc there is plenty of brainpower out there to address this challenge. ", "q1r": 4, "q2": "This proposal is well written, unfortunately no measurable metrics have been proposed. In the \"Key Metrics to measure\" the proposer describes possible topics that future proposers of this challenge could explore. Key metrics for this challenge could be e.g. \"Number of analytical tools developed 6 and 12 months after funding\" or \"How many Cardanomics expert teams created\"", "q2r": 2, "assessor": "z_assessor_125", "no_vca": 25, "ne": 5, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "The challenge does an excellent job clearly stating how it aligns with the 3 strategic goals of Fund 8.", "q0r": 5, "q1": "The community has the technical talent required, the budget is moderate and based upon discussions in the Town Halls there seems to be interest in addressing the challenge. There are no apparent overlapping challenges.\r\n\r\nTo improve challenge: Community capacity to address a challenge includes budget considerations. Better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The success criteria for addressing the challenge is clearly articulated however the key metrics section is an exposition instead of metrics to measure progress. There are some measurable metrics that can be gleaned from the section.\r\n\r\nTo improve challenge: better articulate how the metrics can measure progress towards the success criteria", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "I agree with the fact that educating people in the economics field would contribute to the Cardano (and the worlds economy) overall.\r\n\r\nSince most people are NOT YET in the crypto space, somehow educating them can boost this and shift the tide.\r\n\r\nWhat I am afraid of, is that it will end up with proposals of \"ytb channels\" which is not a way to go. \r\n\r\nAlso, analysis is always just a form of prediction, which can lead someone to gain, and someone to lose.\r\n\r\nRating given 4.\r\n\r\n", "q0r": 4, "q1": "I believe that the community is able to deliver products from this scope since we are talking money :) There are plenty of economics and financially specialized people in the space, who can contribute to such a challenging fund.\r\n\r\nRating given 5.", "q1r": 5, "q2": "Detailed metrics are stated which will allow us to measure the progress addressing the challenge. \r\n\r\nKPIs are posted in reasonable detail.\r\n \r\nWell elaborated.\r\n\r\nRating given 5.", "q2r": 3, "assessor": "z_assessor_54", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}], "importance": "L'analyse indépendante des tendances, des scénarios et des incitations économiques renforcera la stabilité du système, informera les parties prenantes et fournira de nouvelles données.", "success": "Les effets économiques complets des politiques et de la conception actuelles/futures de Cardano sont clairs. Les modèles, études et simulations sont accessibles au public."}