{"id": 381216, "author": "juststaking", "title": "Grow India, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/381216-48088", "category": 26257, "amount": 150000, "description": "Comment pouvons-nous favoriser le développement et l'adoption de Cardano en Inde ?", "funded": 2, "upvotes": 75493366, "downvotes": 14983552, "votes_result": 60509814, "votes_cast": 337, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Dans le même état d'esprit qui a fait de l'Afrique la principale cible géographique de l'adoption de Cardano, tous les défis géographiques au sein de la majorité des pays en développement du monde sont de la plus haute importance pour l'adoption et la diffusion de masse de Cardano. Ce sont eux qui génèrent les projets les plus visibles pour les nouveaux membres, qui génèrent la première approche et la forme la plus tangible d'embarquement pour les nouveaux membres des économies émergentes. Cela dit, l'Inde présente les caractéristiques d'une région à forte inégalité, avec une très grande population, un pourcentage élevé de personnes non bancarisées et un fort engagement envers les nouvelles technologies. Il s'agit d'une région mûre pour être perturbée par la cryptoéconomie, et l'utilisation de projets dirigés par Cardano garantira une position prédominante sur le marché pour Cardano dès le début, la diffusion des SPO, la maximisation du volume des transactions et l'embarquement de nouveaux membres.", "q0r": 5, "q1": "Le proposant a un historique d'engagement avec la communauté et de multiples propositions déjà soumises, toujours centrées sur l'Inde comme une zone géographique mûre pour le développement de Cardano. La présence d'EMURGO Inde pourrait également permettre de développer certaines synergies avec les propositions financées et les organisations/DAO/Dapps qui en découlent. Il serait intéressant de savoir, pour une prochaine itération, si d'autres membres de l'équipe pourraient constituer l'équipe du défi pour ce défi proposé, peut-être avec des membres de la communauté d'autres régions de l'Inde, afin de donner un panel plus diversifié à l'équipe du défi et de permettre des rencontres physiques et le développement de la communauté dans différents centres du pays.", "q1r": 4, "q2": "Comme pour les autres défis géographiques, la proposition est centrée sur des mesures clés autour du nombre de propositions présentées et du nombre de Dapps/DAOs/services centrés sur l'Inde qui sont mis en avant et potentiellement financés par ce mécanisme. Dans les différentes itérations du Fonds, les défis géographiques ont généralement attiré beaucoup d'attention et un grand nombre de propositions, en particulier lors de leur première itération ; on peut donc supposer qu'un défi Grow India, Grow Cardano dans sa première itération attirera de nombreuses nouvelles propositions, dont certains exemples sont mentionnés par le proposant dans la description. Cependant, il serait intéressant d'inclure dans les indicateurs clés de performance du succès du défi l'augmentation du volume des transactions Cardano dans le sous-continent indien, l'augmentation du nombre d'OPS basés en Inde, entre autres.", "q2r": 4, "assessor": "z_assessor_787", "no_vca": 15, "ne": 8, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nIndia is big target market with a population of 1.4 billion people, so growing the adoption of Cardano and participation in its ecosystem supports the Fund 8 strategic goals of growing the number of contributors and growing the dev and app ecosystem.\r\n\r\nAt the same time, the proposal defines the objectives as \"Indian focused\" projects, which could limit the potential global impact of developed solutions.\r\n\r\nI believe that considering the following points could make the proposal stronger:\r\n1) reformulate the proposal from requesting Indian-focused projects to projects that target use cases needed in India but potentially helping other regions too!\r\n2) Provide an analysis of use cases that could be a great growth points in India based on technological readiness, regulatory readiness, and the local demand.\r\n3) Provide several examples of a successful adoption of blockchain in India to provide insights into potential impact and the complexity of projects.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discusion about the ability to achieve a noticeable impact.\r\nMy rating is 4.", "q0r": 4, "q1": "Given the broad skillsets of the Cardano community and experiences with growth-focused projects targeting other regions, the community is well positioned to address the challenge.\r\n\r\nThe proposal would be stronger if the challenge team included members that new the region well and could provide experience-based insights and feedback to the participants.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a challenge team experienced with the region, reducing the ability to provide advice and experience-based insights to participants.\r\nMy rating is 4.", "q1r": 4, "q2": "The proposal sets metrics (the number of projects, the number of apps) that can track the initiative-related activity.\r\n\r\nHowever, those metrics are not sufficient to track the progress towards the underlying objective (broader adoption of Cardano in India, more contributors to Caradano ecosystem coming from India) and supporting the strategic goals of Fund8. To make the proposal stronger, I'd suggest to consider some of the following metrics:\r\n1) the % of walltes created from India.\r\n2) the % of voters from India.\r\n3) the % of proposers from India.\r\n4) the % of apps built by developers from India.\r\n5) the % of cardano users using apps built by developers from India.\r\n6) the satisfaction of users of apps built within the initiative vs that of competirors.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 30, "ne": 6, "ng": 18, "nfo": 6, "vca_o": 1}, {"q0": "It is common knowledge India has an immense pool of English speaking human resources with very low entry barriers in the IT world. It is the second populous country in the planet. To open an Indian themed Catalyst Challenge can indeed become quite fruitful. Opening  doors to expand Cardano community in  India, can form over time another branch of developers and incentivize a significant app ecosystem intrinsically rooted in India use cases. We should keep in mind large chunks of India population suffers from the same problems Cardano seeks to address throughout Africa and Latin America, such as economic development, financial and social inclusion. ", "q0r": 5, "q1": "As far as we know Emurgo - one of the Cardano founding entities - has boots on the ground  in India for some time. Perhaps there could be room for collaboration on  community initiatives arising from this Challenge. The bottom line is Cardano community has capacity to address this challenge. We have living examples on the ongoing Africa and Latin American themed challenges. India has a  larger pool of resources with lower entry barriers. The Challenge relative small budget of 150K seems prudent looking for first engagement.\r\nIn a final note  being a complete new challenge proposal on Catalyst, would be more beneficial if the proposer have introduced a Challenge team. There is still a chance to do so once Challenge proposal receives voters approval.", "q1r": 4, "q2": "Key metrics could have been more expanded to measure success and progress, however being a first time challenge proposal I sense caution by the author. Challenge brief lists future project  examples based on education, marketing among other community events introducing Cardano. It is great  inspiration for future proposers!", "q2r": 4, "assessor": "z_assessor_1016", "no_vca": 24, "ne": 8, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "Along with Africa and Latin America, India represents another area with potential that has not yet been addressed by Project Catalyst. It is known that India places a high emphasis on science and technology, recognizing its importance for economic growth. In terms of scientific research, India is one top nations around the world, and it is also among the top nations in terms of space exploration. I agree that this challenge is critical to achieve Cardano's mission.", "q0r": 5, "q1": "It has shown that this type of challenge pays off very well, so I believe it will be able to tackle it successfully. A budget of $150000 appears reasonable to me. Depending on how the community responds, we may increase funding in the future. ", "q1r": 5, "q2": "Both the proposed definition of success as well as the metrics proposed make sense to me because both will allow the community to be updated on the status of the proposals as they are implemented. I believe the success criteria and suggested metrics are appropriate for tracking progress towards meeting the challenge.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 24, "ne": 4, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "Targeting a specific region for Cardano growth is a common method for aligning with Cardano's mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "This challenge overlaps with many others seeking to grow specific regions. The budget is typical for this type of challenge. The community has the capacity to address this challenge individually however collectively these region specific challenges will need to be prioritized as it is unlikely there is the capacity for all of them. There are some concerns about the India regulatory environment which has recently announced potential laws against cryptocurrencies. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The success criteria and suggested metrics are adequate. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 3, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "India is known for its dynamism, innovation-ready qualities in Asia right now [similar to the qualities Cardano looks for in Africa]. This proposal's argument convinces me much that India should be focused on.\r\nI agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 4.", "q0r": 4, "q1": "Community members who come from Asia, as a whole, (and Southeast Asia in particular) are increasing through time. However, I did not see this readiness in India. This proposal should explain this more in detail for clarifying if the Catalyst community has the capacity to address this challenge. Based on the given information, I am still neutral with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 3.", "q1r": 3, "q2": "Suggested directions and metrics are logical to measure progress in addressing this challenge, except the metric of \"Increased interaction between Catalyst and Indian focused projects\", since \"interaction\" is still unclear of how to measure this. After all, based on the given information, I still agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}], "importance": "1,4 milliard de personnes. 55 % ont moins de 30 ans (estimation 2016)\nLes développeurs/entreprises Cardano locaux sont nécessaires pour résoudre les problèmes locaux.  \nPauvreté importante/non bancarisée", "success": "Le succès est d'avoir de multiples soumissions pour le Catalyst Fund8 pour des projets axés sur l'Inde, avec des projets réels financés et construits."}