{"id": 381894, "author": "pace", "title": "Cardano Contributors League", "url": "https://cardano.ideascale.com/a/dtd/381894-48088", "category": 26257, "amount": 800000, "description": "Comment faire en sorte que davantage de personnes travaillent à temps plein au sein de Cardano ?", "funded": 1, "upvotes": 37992266, "downvotes": 14825360, "votes_result": 23166906, "votes_cast": 216, "f6_no_assessments": 5, "f6_rating": 3.733333333333333, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=25101"], "media": [], "f6_assessments": [{"q0": "Ce défi est plein d'objectifs et de mécanismes contradictoires. 1). le brief du défi demande aux évaluateurs d'aborder l'impact. Les instructions pour cette section sont intitulées \"Alignement\" (et non \"Impact\") et placent la barre très haut. Il est demandé aux évaluateurs d'être d'accord ou non avec le fait que le défi est \"essentiel à la réalisation de la mission de Cardano\". En tant qu'expérience, c'est intéressant. Mais sans exiger des \"objectifs critiques pour la mission\" comme base d'attribution, le dossier de défi ne répond pas à ce critère. Si nous considérons l'impact, (en laissant de côté l'alignement), le mécanisme général (financement d'un emploi à temps plein pendant 6 mois dans l'espace Catalyst/Cardano, bien qu'attrayant, l'impact probable de 16 personnes sur la communauté poursuivant des objectifs très généralement définis peut ne pas être significatif. Il y a d'autres aspects contradictoires, mais ils sont suffisants pour justifier la note la plus élevée que je puisse attribuer, 3 étoiles - je ne peux pas être d'accord ou pas d'accord.", "q0r": 3, "q1": "Une fois encore, le cahier des charges semble contradictoire. Les critères de sélection (le vote de la communauté pour approuver une demande de financement est un pont trop loin. Les engagements ne sont pas clairs. L'attente d'une personne ou d'un groupe qui \"assigne des tâches\" à court terme suggère (comme d'autres aspects de ce dossier de défi) une autorité qui peut ordonner à une personne financée de changer ce qu'elle fait pour travailler sur un problème précédemment inconnu. Que la personne financée ait les compétences adéquates pour attaquer et tenter de résoudre ce problème ou non. Qui décide ? Serait-ce l'équipe du défi ? Et de quel ressort ce comité de 5 personnes environ tire-t-il son autorité pour rediriger une personne financée vers une nouvelle tâche. Dans l'ensemble, ce défi tente d'inclure trop de choses en même temps. Une trop grosse bouchée. Je peux voir que s'il est approuvé, tel qu'il est présenté, le défi sera très rapidement paralysé dans sa mise en œuvre. Pendant que 16 personnes collectent 50 000 dollars. Ou bien leur financement est-il coupé s'ils ne font pas ce qu'on leur demande ? (Extrait du briefing : \"Flexible - Les contributeurs auront un impact plus important s'ils sont capables d'être flexibles dans un environnement qui évolue rapidement et de se déplacer là où ils peuvent avoir un impact important\".", "q1r": 3, "q2": "Une fois de plus, le cahier des charges est contradictoire. Les rapports hebdomadaires sur les progrès réalisés peuvent être dénués de sens, même si la personne financée fait quelque chose d'utile. De nombreuses mesures semblent décrire les personnes financées comme étant simplement utiles. Regardez attentivement le dossier dans la section intitulée \"Qu'attend-on des candidats retenus ?\r\n\r\nSoutenir l'écosystème - Les contributeurs doivent se concentrer sur le retour de la plus grande valeur à l'écosystème et chercher à résoudre les plus grands problèmes auxquels la communauté est confrontée à ce moment-là. [Qui décide de la nature de ces problèmes ?]\r\nSoutenir la communauté - Les contributeurs doivent comprendre l'écosystème et être capables d'aider la communauté là où elle en a besoin. Il peut s'agir de répondre à des questions, d'orienter les gens vers les bonnes ressources ou de faire connaître les différents secteurs de l'écosystème qui ont besoin d'aide.\r\n\r\nUne collaboration étroite - Les contributeurs ont le pouvoir d'être le ciment de la communauté et d'identifier les chevauchements et les doubles emplois. La communauté bénéficie du fait que les contributeurs passent du temps à comprendre les différents projets connexes et à les rassembler lorsque cela est bénéfique pour eux et pour l'écosystème.\r\n\r\nParticipation élevée - Pour être très efficaces, les contributeurs devront comprendre au mieux ce qui se passe dans l'écosystème. Les contributeurs peuvent raisonnablement se concentrer sur un ou quelques domaines de l'écosystème où ils s'assurent d'être à jour et de connaître les problèmes, les projets, les équipes et la feuille de route.\r\n\r\nFlexibilité - Les contributeurs auront le plus d'impact s'ils sont capables d'être flexibles dans un environnement en évolution rapide et de se déplacer là où ils peuvent avoir un impact important.\"\r\n\r\nLe programme similaire le plus célèbre est la subvention de la Fondation MacArthur (sans conditions) de 250 dollars pour 12 mois. Ce qui n'est pas beaucoup plus que 50 $/6 mois. Elles n'exigent AUCUN rapport. Mais elles sélectionnent des personnes exceptionnellement talentueuses. Et personne ne peut postuler. Extrait de leur site.\r\n\r\n\"Attribution de bourses sans restriction à des personnes talentueuses qui ont fait preuve d'une originalité et d'un dévouement extraordinaires dans leurs activités créatives et d'une capacité marquée d'autodétermination.\r\n\r\nÀ PROPOS DU PROGRAMME\r\nLa bourse MacArthur est une récompense de 625 000 dollars, sans conditions, accordée à des personnes extraordinairement talentueuses et créatives, comme un investissement dans leur potentiel.\r\n\r\nLes critères de sélection des boursiers sont au nombre de trois :\r\nUne créativité exceptionnelle\r\nLa promesse d'avancées futures importantes sur la base d'une série de réalisations significatives.\r\nLe potentiel de la bourse à faciliter le travail créatif ultérieur.\r\nLe programme MacArthur Fellows a pour but d'encourager les personnes au talent exceptionnel à poursuivre leurs propres penchants créatifs, intellectuels et professionnels. Conformément à cet objectif, la Fondation attribue des bourses directement à des individus plutôt que par l'intermédiaire d'institutions. Les bénéficiaires peuvent être des écrivains, des scientifiques, des artistes, des spécialistes des sciences sociales, des humanistes, des enseignants, des entrepreneurs ou des personnes travaillant dans d'autres domaines, avec ou sans affiliation institutionnelle. Ils peuvent utiliser leur bourse pour faire progresser leur expertise, s'engager dans de nouveaux travaux audacieux ou, s'ils le souhaitent, changer de domaine ou modifier l'orientation de leur carrière.\r\n\r\nBien que les candidats soient évalués en fonction de leurs réalisations, la bourse n'est pas une récompense pour l'ensemble de leur carrière, mais plutôt un investissement dans l'originalité, la perspicacité et le potentiel d'une personne. En effet, l'objectif du programme MacArthur Fellows est de permettre aux lauréats d'exercer leurs propres instincts créatifs au profit de la société humaine.\r\n\r\nLa Fondation n'exige ni n'attend de produits ou de rapports spécifiques de la part des boursiers MacArthur et n'évalue pas la créativité des boursiers pendant la durée de la bourse. La bourse MacArthur est une récompense \"sans conditions\" qui soutient des personnes, et non des projets. Chaque bourse s'accompagne d'une allocation de 625 000 dollars pour le bénéficiaire, versée en versements trimestriels égaux sur cinq ans.\"", "q2r": 3, "assessor": "z_assessor_251", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe underlying problem of incentivizing high-contributing members is important and supports one of Fund8 objectives - grow the number of contributors.\r\n\r\nAt the same time, I believe that the specific solution of introducing full-time roles is not aligned with the strategic objectives of Fund 8 because spending a chunk of budget of full-time positions, minimizes the chance of part-time involvement of new contributers and new contributors provide a higher chances for spreading word of mouth (due to uniqueness of each individual's private networks).\r\n\r\nIn my opinion, the current project-based model is already flexible enough to fund individuals (they just need to propose problem areas they plan to work on + KPIs) for 6+ months. Furthermore, the project-based model makes it much easier to deliver the return-on-intention for the funds allocated (a clearer connection between funding and outcomes).\r\n\r\nTo make this proposal stronger, I would suggest a much more thorough analysis of how and in which-cacses full-time positions can bring more return on intention! The arguments about tax benefits, etc are not sufficient since solving the right problems orders of magnitude more impactful than saving 20-30% on taxes.\r\n\r\nI have made the following deductions:\r\n- 2 points for not directly supporting any of Fund 8 strategic goals.\r\n- 1 point for suggesting a solution instead of clearly articulating problem by providing relevant analysis and the eveidence of impact.\r\nMy rating is 2.", "q0r": 2, "q1": "The proposal is feasible and simple to implement, since all it requires is for contributors to submit proposals for funding, which is already a widespread practice in the community.\r\n\r\nAt the same time, I have reasons to believe that proving full-time positions would solve all the community problems with regards to incentivizing more members for contributions since it is likley to affect only a small fraction of them due to the limited funding.\r\n\r\nI have made the following deductions:\r\n- 1 point for the limited influence on the behavior of all the contributors in the community.\r\nMy rating is 4.", "q1r": 4, "q2": "While some of the metrics (the number of contributions, events, etc.) help track the activity, the proposed metrics don't provide insights into the efficiency of the full-time model as compared to the project based funding - which is the key assumption behind the proposal.\r\n\r\nThe proposal can be stronger if it considered comparative metrics as well: the number of contributions(commits, events,etc.) from from full-time community vs the project-based comminuty and the satisfaction of the community with the incentives scheme.\r\n\r\nI have made the following deductions:\r\n- 1 point for not tracking the impact on the underlying objectives (more contributions from the community).\r\n- 1 point for not considering competitiveness and community satisfaction.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 6, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This challenge pays a small group of contributors which at least partially aligns with Cardano's mission.  To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "This challenge heavily overlaps with the Catalyst Circle and potentially the proposed Catalyst Technical Council. The deliverables of participate, collaborate, support and report seem rather light for a self-defined 6 month contract, especially given the large budget request. I doubt the Catalyst community has the capacity to address this challenge given the large budget request.", "q1r": 3, "q2": "The key metrics and success criteria are adequate but a little light in measuring progress in addressing the challenge.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since human resources are required to upgrade this ecosystem, therefore, full-time community members, especially full-time CA and vCA play a very important role. Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Undoubtedly, the Catalyst community has the capacity to address this challenge. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested metrics are logical and measurable to measure progress in addressing the challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Of course having more people working full time as their main job will help the Cardano Catalyst community to become more stable and grow faster, at least in the early stages. However, Cardano appeals to participants because of its transparency and freedom, which, with a more focused and specific group of people, can create a bureaucratic system. Moreover, there are now many people working full time for the benefits of the community and I believe that just increasing the benefits will increase this number of people.", "q0r": 3, "q1": "The Catalyst community can assess which candidates are suitable for the challenge. The number of people participating in the challenge is also promising because the challenge creates new serious jobs and will attract existing people who already have an interest in the activities of the Cardano community. However, there is a risk that the number of people who want to work full-time is small, people only participate in the community as a hobby or part-time job.", "q1r": 4, "q2": "The challenge is very well defined with key metrics, what should be included in the proposal, what is expected from successful candidates, what should contributors report, what sort of candidates are most suitable, what candidates may be less suitable etc", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "importance": "Cardano a besoin d'un plus grand nombre de membres de la communauté travaillant à temps plein dans l'écosystème pour pouvoir atteindre son potentiel.", "success": "Les membres de la communauté qui résolvent des problèmes importants dans Cardano sont financés afin qu'ils puissent travailler à plein temps dans l'écosystème."}