{"id": 382067, "author": "felixweber", "title": "Grow East Asia, Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/382067-48088", "category": 26257, "amount": 150000, "description": "Comment développer l'écosystème Cardano en Asie de l'Est d'une manière inclusive et solidaire ? De la même manière que nous le faisons en Afrique, par des initiatives ciblées !", "funded": 2, "upvotes": 105098195, "downvotes": 9979164, "votes_result": 95119031, "votes_cast": 527, "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nEast Asia is big target market with a population of over 1.6 billion people, so growing the adoption of Cardano and participation in its ecosystem supports the Fund 8 strategic goals of growing the number of contributors and grow the dev and app ecosystems.\r\n\r\nAt the same time, the proposal defines the objectives as East-Asia-focused projects, which could limit the potential global impact of developed solutions. \r\n\r\nI believe that considering the following points could make the proposal stronger:\r\n1) reformulate the proposal from requesting East-Asia-focused projects to projects that target use cases needed/important in East Asia (but potentially helping other regions too)!\r\n2) Provide an analysis of use cases that could be a great growth points in East Asia based on technological readiness, regulatory readiness, and the local demand.\r\n3) Provide several examples of successful use cases of blockchain adoption in East Asia to provide estimates of potential impact and necesary resources.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a discusion about the ability to achieve a noticeable impact.\r\nMy rating is 4.", "q0r": 4, "q1": "Given the broad skillsets of the Cardano community and experiences with growth-focused projects targeting other regions, the community is well positioned to address the challenge.\r\n\r\nThe proposal would be stronger if the challenge team consistend of multiple members that new the region well and could provide experience-based insights and feedback to the participants.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a larger challenge team experienced with the region, reducing the ability to provide advice and experience-based insights to participants.\r\nMy rating is 4.", "q1r": 4, "q2": "The proposal sets some measureable metrics (the number of projects, the number of wallets) that can track the initiative-related activity. However, some of the measures are quite ambiguously defined, such as \"Are we on track to improve the lives of people using Cardano in East Asia?\", making it hard to precisely and regularly to track progress.\r\n\r\nFurthermore, the defined metrics are not sufficient to track the progress towards the underlying objective (broader adoption of Cardano in East Asia, more contributors to Caradano ecosystem coming from the region, etc.) and supporting the strategic goals of Fund8. To make the proposal stronger, I'd suggest to consider some of the following metrics: 1) the % of walltes created from the region. 2) the % of voting wallets from the region. 3) the % of proposals coming from the region. 4) the % of apps built by developers from the region. 5) the % of cardano users using apps built by developers from the region.\r\n6) the satisfaction of users of apps built within the initiative vs that of competirors.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 27, "ne": 9, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "Yes, this \"Grow East Asia, Grow Cardano\" challenge is critical to build foundation for Cardano to be accepted in East Asia Region. In my opinion, this challenge will provide a springboard for Cardano adoption, especially in East Asian countries such as, Japan, Korea, China and Taiwan.", "q0r": 5, "q1": "At the moment, I saw several proposal coming from Japan, China, Korea, and also several South East Asia countries (such as, Vietnam, Indonesia, etc.). This means that the local community hubs are rising and they need some place to put their proposal and get funded to grow Cardano in their specific region. We have several Cardano Ambassadors to from East Asia and South East Asia region, plus CA & vCA from these part of the world. Moreover, if I'm not wrong, we have now Eastern Hemisphere Town Hall where Cardano Community Hub from East Asia, South East Asia, Australia are gathering there. So yes, they have capacity to address this challenge.", "q1r": 5, "q2": "The suggested metrics from this challenge setting are quite clear. Starting from checking the number of proposals originating from East Asian participants in Project Catalyst, until increasing the number of Stake Pools and Stake Pool Operators based in East Asia. It would be great if have some data on the current state about Cardano in East Asian countries, to be compared later on after the project is funded and running.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 21, "ne": 5, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "Getting East Asians involved in the community aligns with Cardano's mission. The final paragraph is a bit preachy and presumes a prejudicial motivation that can potentially alienate some voters so consider rephrasing the paragraph. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The budget is small compared to the total budget and is less than most similar challenges despite having a very large demographic. The community has the capacity to address the challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "Onboarding different localisations is a vital part of Cardanos global mission. I think it is absolutely vital to pursue this goal. It will also have a huge societal impact.", "q0r": 5, "q1": "Since there is a vibrant Cardano Community in East Asia, they should be more than able to adress this challenge. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 5, "q2": "The metrics are setup well for this challenge and should allow for many impactful projects.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 21, "ne": 1, "ng": 11, "nfo": 9, "vca_o": 1}, {"q0": "East Asia is no brainer for Cardano Community to put the focus on, the demographic, friendly countries to crypto environment, and very small SPOs number currently which make a huge room for improvement. ", "q0r": 5, "q1": "Yes, i believe Catalyst Community understand and know the potential of East Asia and it just a region that Cardano Foundation and IOHK lacking attention of, but the community are growing FAST!\r\nWe need to learn from Africa, what's good there might just work in East Asia, and v.v . Not everything working in Africa will fit the East Asia culture etc. But they share almost common demography, diversity, hundreds thousands tribe/cultures - and recognition are one of the main ones, Africa & East Asia cannot be forever \"consumed\" by the western world - this is our chance to level the playing field. Give them a chance!", "q1r": 5, "q2": "The proposer give just enough criteria, and many rooms for improvement later on regarding participation rates, etc. ", "q2r": 5, "assessor": "z_assessor_646", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Asia is known for its dynamism, and Southeast Asia is home to many of the most dynamic, innovation-ready qualities in Asia right now [similar to the qualities Cardano looks for in Africa]. Check out the following survey: https://www.statista.com/chart/18345/crypto-currency-adoption/; accordingly, 02 countries in Southeast Asia, Vietnam and the Philippines, are ranked in the top 3 countries with the popularity of crypto. Meanwhile, Northeast Asia has less of those qualities. It is not clear to me how the proposed \"East Asia\" is currently defined in this proposal, however, if it covers Southeast Asia, I think that, through this challenge, Cardano's mission will be closer to the destination. \r\nAfter all, based on the given information, I  agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 4.", "q0r": 4, "q1": "Community members come from Asia as a whole and east Asia, in particular, are increasing through time. As a result, the Catalyst community has the capacity to address this challenge; many potential challenge teams are ready, I suppose. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested directions and metrics are logical to measure progress in addressing this challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 4, "ng": 8, "nfo": 5, "vca_o": 1}], "importance": "La communauté Cardano est fortement orientée vers l'Amérique du Nord et l'Europe. La croissance ailleurs nécessite notre soutien et notre initiative en tant que communauté.", "success": "Un large éventail de personnes à travers l'Asie et liées à l'Asie, se réunissant et formant des équipes pour développer notre écosystème."}