{"id": 369458, "author": "", "title": "Blockfrost prometheus exporter", "url": "https://cardano.ideascale.com/a/dtd/369458-48088", "category": 26117, "amount": 23500, "description": "SPOs need blockchain metrics from a 3rd party source to be able to react on discrepancies with their local node.", "f6_no_assessments": 5, "f6_rating": 3.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Metric analysis boosts productivity as it unveils possible problems with components early on. Creating such a tool independently from 3rd parties provides freedom of design, making the tool even more efficient. This could help SPOs and in extension the stability of the ecosystem, benefiting the entire community. ", "q0r": 5, "q1": "Since the tool would be in demand by SPOs and Five Binaries is a well known entity within the ecosystem specialised in developing tools like this, there shouldn't be any hurdles in terms of feasibility of success. ", "q1r": 5, "q2": "There is some key data missing in the proposal in terms of auditability. The development timespan is set to 5 weeks total, but there is no roadmap that comes with it. Some clarification about the fund request amount would be an improvement. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal doesn't quiet fits in with the goals of the challenge which are specifically to test and prepare for disaster. Information about the state of the network is important to recognize active or impending disasters and this is important - but it is not \"helping SPOs tackle risks & plan, develop and participate in disaster recovery tests\". This being said I feel that the scope of the challenge is very narrow and the project looks to offer information about potential issues on the network - which although not in the letter of the challenge I consider to be in the spirit of the challenge. Added functionally like this to an already active SPO user base can lead to better decision making. ", "q0r": 4, "q1": "Five Binaries is developing a host of resources and APIs for the Cardano network.Their designs are clean, tools useful and track record well on the way to being proven. Although, like many things these days discoverability is the difficult part getting your project out there and known and used. Further, the lack of specifics about the way the funds will be spent hurts your proposal and brings the score from a 5 to a 4. Consider adding these details to give the community and voters a better picture of your plans.", "q1r": 4, "q2": "The community requested additional information on the 30th of Aug. No answer was received. I've added this to the comments in Ideascale and it can act as my assessment rationale: \"Your experience leaves little doubt that you can and will deliver on this project should funding be given however, the lack of details as pointed out by Nori already a few weeks ago really are letting this proposal down. So, please give a more full explanation of the budget breakdown. Had I seen this during the edit phase I would have asked for it to be included in the proposal. If you could outline in more detail how the 23500 will be spit up and some sort of metrics the community can use to gauge success it'll be possible to up our assessments.\"", "q2r": 2, "assessor": "z_assessor_209", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposing team identifies an existing problem within the Cardano ecosystem and proposes a solution which is aligned with the Challenge, since it intends to tackle issues related to attacks to the system trying to modify the transactions. The proposal doesn't present key metrics and KPIs, which could increase its Challenge alignment evaluation, and it mentions that there is some budget allocated to maintenance but it seems to be just in the first year. It would be good to know about how it would be sustainable after that, if there is a plan for this or not. Score: 4", "q0r": 4, "q1": "The proposing team has provided enough information for us to trust that they would be able to implement the proposal, based on their past deliverables and the experience mentioned in the proposal itself and website. Although, the proposing team doesn't identify how many individuals would be required in this specific proposal in order to implement it, and how it would relate to the budget, since it only mentions that it would take 3 weeks of development and 2 for maintenance. Also, the budget could be broken down and linked to a roadmap of development, which is missing, since in the 'Deliverables and roadmap' section the proposer only provides a milestone and a deliverable 6 weeks after funding. This proposal doesn't seem to have any big risks or challenges, but it would be good to have this at least discussed as well. Score: 3", "q1r": 3, "q2": "This proposal doesn't provide a roadmap, but it gives a time horizon for the delivery of the first version of the software after 6 weeks after getting funded. It's good but for accountability, more information could be provided, such as smaller steps in the roadmap, but since this is a very short project, it may not be so necessary in this case. Although, some metrics are missing regarding the impact of the proposal, such as the number of SPOs using the software, number of threats identified, and other relevant KPIs. Also, the budget breakdown could be improved and better explained, for example, how many people would be paid with it, are there any extra costs besides labor hours, etc. This information mentioned here could be added in order to improve the proposal's auditability. Score: 2", "q2r": 2, "assessor": "z_assessor_31", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "It is not clear how the problem relates to the challenge, this needs to be made more explicit, it is not up to the readers to fill in the gaps. The use of software to monitor data such as nodes and relays is a way to improve security, but the proposal is still a draft, is very vague and does not make clear its impact potential.\r\n\r\nMetrics and KPIs that could allow the quantification of the impact on the challenge were not included, making the evaluation subjective.", "q0r": 2, "q1": "The Five Binaeries team has contributed positively to Cardano through projects such as Blockfrost, which has been used by several projects/developers in the community.\r\nThe Five Binaries team has been developing several projects on Cardano and several of these were funded by Catalyst, as can be seen here: https://catalyst.fivebinaries.com/\r\nDespite the notorious contributions and achievements of projects on Cardano, i would recommend including more details about the team, references of the people responsible for the project and their qualifications. (On the website there is no such information either)\r\n\r\nThere is no detailed plan, the proposal is a draft and has a concept that in theory can address the challenge, but the lack of details and success metrics prevents an indication of feasibility.\r\n\r\nThe first version of this software must be delivered within 6 weeks after funding, including documentation and tests.\r\n\r\nHow can Prometheus cause a significant improvement in blockchain monitoring? And what kind of problems could be avoided?\r\n\r\nThere is no budget breakdown.\r\n\r\nI recommend including the items required for feasibility assessment as per the documentation for creating proposals in Catalyst.", "q1r": 2, "q2": "It is not clear how the problem and solution are aligned with the challenge. Improving data monitoring in the blockchain can improve the security of SPOs, but this needs to be communicated more clearly, so that it is understood how the outcome of the proposal will address the items established in the challenge brief, allowing for an objective audit.\r\n\r\nThe first version of this software is set to be delivered within 6 weeks after funding, including documentation and tests, but there are no details on what kind of documentation or tests will be performed.\r\n\r\nThere are no metrics/KPIs to audit project development.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 12, "ne": 5, "ng": 2, "nfo": 5, "vca_o": 1, "reply": "From this comment, it is clear we could do a better job to explain what Prometheus is used and how it is used within the Cardano ecosystem. However, we also feel this is up to the reviewer/voter research before reviewing/voting for a specific proposal. A question like \"How can Prometheus cause a significant improvement in blockchain monitoring?\" when Prometheus metrics is the most used monitoring framework for Cardano (native in cardano-node or cardano-db-sync) shows that the reviewer does not have knowledge of this system. While it is our fault this wasn't explain better, we would really appreciate having such comment during the comments phase and we are flagging this we think it is not fair to decrease project's feasibility rating just because of this."}, {"q0": "The proposal needs no further explanation. This is a massive help for developers on the platform. Making sure newly developed dApps are secure by providing the necessary metrics will expand Cardano.  Although this idea could've easily been placed in de developer ecosystem challenge it fits this challenge as well. The goal you wish to accomplish really addresses the challenge. What I do find missing is some key metrics, there are none included in the proposal. Like do you feel Prometheus would be a success if 1 developer used it on your platform or ...%? ", "q0r": 4, "q1": "Experience in this team sheaths no doubt that you guys can deliver on this proposal. Seeing the number of funded proposals in the previous funds and which ones are already delivered I have full confidence in this proposal. Given the background in proposals, I believe the budget asked for is reasonable but it is missing a breakdown which makes it troublesome to know why you need it and where you plan on spending it. One thing I would've like to see is a clear perspective of when the proposal is successful. I believe this is a good usage rate among the users. This gives the question what would you do if you see that the usage isn't desirable?", "q1r": 4, "q2": "The delivery date is given but there is no roadmap and milestones. This makes it hard for further assessment later on in the project. Even if the delivery is only within 6 weeks after funding a roadmap is crucial to make a good assessment. As I've given above a budget breakdown is also missing so we can't really see if a certain aspect in the proposal goes above budget or not. Because of this, I can't give a clear view on auditability and I will neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_471", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Develop Prometheus exporter, which will expose various Cardano blockchain metrics directly from Blockfrost.", "experience": "We are the creators of Blockfrost, creating services and tools lowering barriers to entry for developers."}