{"id": 369608, "author": "", "title": "Stake Pool Reachability Dashboard", "url": "https://cardano.ideascale.com/a/dtd/369608-48088", "category": 26117, "amount": 1000, "description": "When a network failure occurs, it would be useful to know which SPO are reachable from different locations in the world.", "f6_no_assessments": 3, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal clearly states a possible threat and provides a simple way to improve a general safety protol that could add value to other initiatives to support SPO´s.", "q0r": 5, "q1": "The provided resources give an overview that the proposer has been working on related topics for an extended amount of time and has been acquiring knowledge to add value to the overall general security measures that should be taken. Since the budget goes directly to the proposer and the milestones are delivered and seem actionable and have estimated realistic timeframes, I think it is very likely that this dashboard is going to be set up. I expect, that basic knowledge about necessary privacy issues was considered.", "q1r": 5, "q2": "Yes, it is a very clear goal that has a dashboard that would be auditable.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal offers up a tool to be used to understand the extent and severity of communication issues between stake pools. This is a very useful tool to have on hand when things are going wrong in the network, it is under attack, or there is a large scale event (such as an AWS outage, or backbone failure) that takes down a significant portion of the stake pools.", "q0r": 5, "q1": "The scope of the proposal seems to be relatively modest and well within the scope of a software developer with 30 years of experience. The proposal outlines specific technologies (S3 buckets, cncli-ping, json files) and is well thought out in architecture and implementation details. I don't think there is significant amounts of unknown or ambiguous challenges to be solved, this just needs to be coded, tested, and deployed.", "q1r": 5, "q2": "Having a working dashboard will prove success, but there is a lack of milestones and KPIs that would be nice to see to understand how the community can audit progress and success better. Although for a small (tiny?) proposal of this size, the scope is small enough that the final output might be sufficient as a milestone.", "q2r": 4, "assessor": "z_assessor_285", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal addresses a niche which and is solving a specific problem that may not need resolution. They aim to build a simple, durable dashboard to show the reachability of stake pool nodes from the perspective of different locations in the world.", "q0r": 3, "q1": "The proposer has plenty of technical experience with implementing these types of solutions, so success seems assured. The plan, roadmap, budget, and timeline are reasonable. ", "q1r": 5, "q2": "This proposal may be difficult to audit as the main deliverable is after 2-6 months, users utilize the software to host a publicly-available dashboard of stake pool reachability. More clearly defined metrics are needed.", "q2r": 2, "assessor": "z_assessor_449", "no_vca": 13, "ne": 2, "ng": 5, "nfo": 6, "vca_o": 1}], "solution": "Build a simple, durable dashboard to show the reachability of stake pool nodes from the perspective of different locations in the world.", "experience": "30-year professional software dev. \n\nMASc thesis included failure mode analysis of computer networks (See http://ghost.eth7.net/AdHoc/)"}