{"id": 370011, "author": "", "title": "ADA SPO ITsec Label", "url": "https://cardano.ideascale.com/a/dtd/370011-48088", "category": 26117, "amount": 12000, "description": "In a decentralized world, you need a label that you can trust. It is important for companies and service providers.", "f6_no_assessments": 4, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "A self-audit based label would be a quality and trust enhancement tool for SPOs. It would support in an emergency situation if an SPO complets a questionnaire but there will be some privacy issues which are not addressed in this proposal. Who will have access to sensitive information about an SPO, like an emergency contact, pyhsical address....for instance. I think data protection issues should be addressed more clearly for this proposal.", "q0r": 3, "q1": "From what the proposer has described as background, it is highly likely that he would be able to make a questionnaire that is based on certification criteria. The budget does not include rewards for SPOs to participate in the questionnaire so I´d advice to include an incentive in the budget.", "q1r": 4, "q2": "The milestones are rather broad and do not give specific actionable steps, for instance how the proposer would reach out to SPOs and how a trust label/certificate would be rewarded to the SPO. The proposer did not include any ideas on why it would be attractive for an SPO to increase trust if it does not go together with any official recognition. Again - the proposal should include information about how sensitive data from SPO´s will be handled (physical address, emergency contacts...). ", "q2r": 2, "assessor": "z_assessor_19", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal identifies a problem with the trust of SPOs regarding other problems besides the usual ones, such as health issues and personal accidents, which I have not seen mentioned anywhere else, so at least for me it's very innovative. It also mentions that in the future the market would like to have something like this, and I agree with it, but I also believe that in the worst case, what would happen is that the SP would be abandoned and its users would realize after some time and migrate to another SP. Even so, the proposal is relevant and it addresses a real problem. It could have added some more information about possible KPIs and metrics to properly evaluate the impact of the proposal, but anyways, I believe the impact of it would be very positive to the ecosystem. Score: 4", "q0r": 4, "q1": "The proposer's background is aligned with what would be expected from this proposal, and it seems that he/she has the relevant experience to implement it. The milestones are presented and and combined with a timeline, they make up a simple but efficient road map, which also seems to be feasible. The proposer could have added some information about some risks or challenges he/she may face during the project implementation, and it could be discussed within the proposal, for example, if the mentioned label is valid for 1 year but something happens before that, how would it be addressed? The budget seems reasonable and appropriate, but I would like to see it broken down in smaller pieces and better explained. Score: 3", "q1r": 3, "q2": "Some milestones and a timeline are presented, which make a good roadmap that the community can use to track the development of the project. Some KPIs could have been added into the project to make it possible to properly measure the proposal's success, and the budget could have been broken down in smaller pieces to make it possible for the community to track the expenses. This mentioned information, if added, could help to increase the proposal's auditability. Score: 3", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal highlighted a problem and proposed a solution but use abbreviations without expanding them and will require more details as suggested by https://cardano.ideascale.com/a/member/Paymahn-Moghadasian/3058279-48088 on the comment of this proposal.However , i do understand the solution and the context being a software and system engineer (https://www.linkedin.com/in/omojo-akawo-80a846a0/).\r\nMore details will be needed.\r\nI agree.", "q0r": 4, "q1": "The proposal did not provide verifiable links to given experience but provided a detailed implementation plan.\r\nI can neither Agree nor disagree given the above considerations.", "q1r": 3, "q2": "Some information that can help audit progress was provided but the less detailed cost breakdown is a concern and will make it difficult to track expenses.\r\nI do not agree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "There is no clarity on the problem presented. I would recommend providing more context on the importance of labels for SPOs and how this aligns with the challenge. The solution presented is not a structured plan. There are no goals/metrics and KPIs, which makes it difficult to assess the potential impact of the proposal.", "q0r": 1, "q1": "There is not enough information about the proposer and his qualifications. The plan has little information to indicate feasibility. There is a roadmap with milestones, but not detailed enough. There is not enough information on budget allocation to judge feasibility", "q1r": 2, "q2": "There is no clarity on the problem to be solved, the alignment of the proposed solution with the challenge is not clear.\r\n\r\nThere are no metrics, KPIs and team details. There is a roadmap but it is too vague.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "The idea is to create a self-audit based on TISAX and ISO2700. The SPOs can log into a website and complete the self-audit.", "experience": "Security Officer of a ISO 27001 and Tisax certified automobile service provider."}