{"id": 396621, "author": "dominik.tilman", "title": "IdeaFest & ChallengeFest by Swarm", "url": "https://cardano.ideascale.com/a/dtd/396621-48088", "category": 26441, "amount": 10000, "description": "Challenge and proposer teams and need a place to connect and to align ideas and actions", "f6_no_assessments": 10, "f6_rating": 4.200000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 1856, "q0": "The proposal seeks funding for the continuation of the IdeaFest & ChallengeFest that was established in the past Funds. The impact of this project being funded depends on the cooperation and willingness to participate in the events. The benefits are directly to the new proposers, because they could have an early feedback on their proposals and have a tribune where they can present and or ask questions that need answers. Indirectly the benefits are spread to the whole community. \nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "Feasibility section of this proposal is very short, a month for the scheduling and execution of each event.\nThe budget for this proposal is outlined broadly, no specific hours or positions or remuneration per hour. The voter just knows that one event costs $5000, $2000 for organization, $2000 for execution and $1000 for post tasks. The voter should decide if the events bring sufficient value to cover the cost.\nThe feasibility of this project is very high, it is backed with history of completed projects and the community trusts the team of Swarm. Unfortunately the proposer does not outline the individuals that will comprise the exact team that will work on this project.\nThe proposer has the financial incentive to complete the project in order to receive funding next time, because this is a recurring event. \nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "This project is easy to audit, because everything is out in the open and the community will see it happening. The success is simply defined and the only thing needed for this proposal to be defined as a successful is for the events to happen. This is a little low hanging fruit, but at least it is a concrete metric.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10736, "q0": "The proposal is requesting funding to a ideafest and challengefest events, hosted by Swarm (Active community of Cardano) in order to meet Cardano teams and proposers \"to connect and to align ideas and actions\". I do think that such events are beneficial for community, it can strengthen relationships and form collaborations, and move the whole community forward. ", "q0r": 5, "q1": "The technical aspect of the even is not required a hard skill knowledge of any sort (teams/zoom meeting - could have been stated what platform will be used), therefore it will be implemented easily. A budget of 10k is requested and the team is described as Catalyst Swarm. Things to improve - a budget could have been described in more detail - 2k for organization - organization of meetings online? How many people will be involved? is it calculated on some hourly wage/ or how it is made? Also, even that it is stated that there is CatalystSwarm - it would be nice to see some representatives, 2-3-4 people,  and the most ideal would be - a list of people who will be involved from CatalystSwarm on these meetings. ", "q1r": 4, "q2": "I think that auditability of the progress is irrelevant in this case, because there is no start-end progress of any sort. So auditing the final success by proposer KPIs as number of attendees (basically] is enough to check whether there was a traction. \n\nSlightly off-topic suggestion -  maybe a questionnaire sent to all participant at the end, with some questions regarding their satisfaction e.g. whether it was helpful, if they formed new collaborations, if they would join the next time, and such, to reflect better whether the community is finding appreciation in such \"fests\" and at the same time, give community the possibility to provide ways how to improve. (assuming you will want to host it again in the future, via catalyst funds, having such records can increase the overall impression of the proposal). It could be then used as metric, as well to emphasize the impact. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10743, "q0": "This is a good proposal that will help provide valuable and rich feedback for proposers in challenge 9 fund.  This will likely be a voluntary-type of event and could have limitations regarding availability of proposers, but in general is a positive, value-adding proposal", "q0r": 4, "q1": "The Catalyst group is a highly engaged group, very well connected, and have the ability to setup and host an event of this magnitude and scope.  They have done similar events in the past and will be building on the event with funding from Catalyst.", "q1r": 5, "q2": "The metrics are limited, given it being an event thrown and held for those who are interested.  Some other KPIs or how they are planning to spend the fees beyond the high level breakthrough they given would help give a stronger score.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10752, "q0": "The idea itself is very good and is in line with the challenge, as it is very useful for the Cardano ecosystem as a whole, since meetings would be held with the proponents so that they can be guided from the beginning, which would generate proposals for better quality and would benefit our blockchain as a whole. What worries me here is the cost. Each event would cost 5 thousand dollars, 10 thousand dollars are requested, that is, 2 events would be covered with this funding. I think the events are very beneficial because better proposals can generate better projects, which will have a better impact and thus help Cardano to expand as a blockchain, help consolidate Ada, etc. But I don't know if the price is justifiable, I will comment further on this in the topic of feasibility. So, although I like the core of this proposal, I think it could be a little more affordable and that part could be better detailed as well.\n", "q0r": 2, "q1": "Unfortunately I found this part very insufficient. All parts are said superficially. The roadmap only mentions what will be done in certain months, but these activities are not explained, despite being quite complex, constituting the entirety of the project: \"Scheduling and execution of Challenge Fest Fund 9\". What happens in pre-production? Who will do what? Regarding the budget, I think it is also explained in a very basic way. Why is $2,000 needed for organization? Who will do what, in what order, and why? Now talking about the team, it is said that the members of Catalyst Swarm are very experienced and engaged. But who are they? What are your names, what jobs have you done before? How can we prove that they are prepared for this? I think it would be necessary for more detailed explanations to be attached to each of these parts.\n", "q1r": 1, "q2": "Like the previous topic, this one leaves a lot to be desired. All metrics chosen to measure progress are numerical. It would also be important to have qualitative information, that is, to understand in a more human way how things are happening. Were all the professionals involved carrying out their tasks properly? And how can we prove this? What advances can be measured in pre-production, how will the Swarm team make this information available to the Cardano community? And talking about the final success, no scenario is drawn, it is only said that the success would be considered when the event took place. But I think that's the basics. In addition to knowing if it happened, we also need to know how it happened, what impacts were generated for Cardano and how this can be measured directly. I believe that this part needs to be revised and improved, it is not possible to monitor well neither the process nor the results of the way the information is dictated here.\n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10783, "q0": "This proposal is actually a request for funding in continuation of an existing project in the community. It does align the challenge settings and this is a project that should be continually supported as it continues to ensure quality engagements, cohesion and collaboration amongst community members with the aim of adding value to the catalyst process to ensure the creation and promotion of quality ideas and project's within the community.", "q0r": 4, "q1": "The proposer's team are well known within the community comprising of highly engaged and experienced community whom have been piloting the events since fund 6. However I must say that the budget breakdown and analysis is too superficial and not well detailed at all considering the fact this proposal is an existing project and the team should give better details based on experience. The Risk factor is also vague and not much to take home, asking for community inputs in case of any shortcomings. In addition, we would expect that some statistics regarding past events showcasing the efficacy of the events and what needs to be done for more effectiveness and efficiency. There was no mention of adequately promoting the events across all channels in the budget.", "q1r": 3, "q2": "The proposal being a continuation of an existing project should be able to provide detailed success metrics and KPIs to adequately assess the progress and success of the project by virtue of the team's experience Though some information and rationale were provided to assess the project but not quantifiable to really monitor to the progress and development of the project by the community.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10807, "q0": "This proposal address a major gap in the project catalyst cycle where it gives proposers a chance to interact with the community at large. It suits in the Cardano ecosystem as well as the challenge team.", "q0r": 5, "q1": "IdeaFest is a platform where proposers are given a chance to express and outline their ideas to the community at large. This actively has been successfully executed in previous funds and proposers have been very grateful for the opportunity hence the need for continuity.    ", "q1r": 5, "q2": "The budget is well laid out and the project is also executed by communities members with vast knowledge of issues pertaining the to the community thus making it viable.", "q2r": 5, "assessor": "z_assessor_270", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10832, "q0": "The catalyst swarm can play a role in the improvement of the future proposals by facilitating the connection between proponents and the challenge team. I know that most challenge team members have experience doing CA work which means that they know what a good proposal should look like. The challenge team members have the ability to give guidance to the proponents on the best way to write their proposals. Based on that I think that the proposal will have a good impact on the cardano ecosystem.", "q0r": 5, "q1": "The catalyst swarm is already known in the community - they have a website and have hosted events before. However, they should have done a better job writing the proposal by adding past experiences and/or adding team member linkedin profiles links. The budget breakdown is too vague and should be detailed more. (5.000 USD for each event: 2.000 USD for organization 2.000 USD for executing 1.000 USD for post tasks). This is what the budget breakdown looks like. On the other hand, they have provided a timeline to complete the work between May and June 22. The proposal should be written better, but because I know what the catalyst swarm represents, I’m willing to give it a positive rating", "q1r": 4, "q2": "The proponents have provided a roadmap with a time horizon to complete the work. They will organize the event and will measure success by the number of challenge teams and proposers participants. I think that this is an easy project to track and they included all the necessary information to monitor its progress.\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10862, "q0": "As a user of the Swarm communication system, I can attest to its usefulness as a means of connecting community members.  And communication is the glue that holds us together as a community, that makes the Catalyst community a living organism.  \n\nThere is no doubt that with the passage of iterations (of funds, of cycles, of experiments) many elements are depurated: excesses of greed, excesses of humility, excesses of realism, excesses of idealism. However, this beautiful process does not occur without scenarios that dynamically facilitate it: that make possible clashes and consensuses, that eliminate what is left over and highlight what is missing, all in real time.  \n\nHaving participated in Swarms and Town Halls in the 5 continents, I can say without a doubt that the work done by the Swarm has positive and productive effects on the entire ecosystem, to the point of making its model completely feasible and reproducible, which means the eventual disappearance of its creators as owners of their own creation. This is the fate of good ideas: to dissolve into the system, in absolute silence. \n\nI know the work of the proponents and how it has proven its own value in practice.  Therefore, my qualification is not directed at the proponents, it is directed at their work.    ", "q0r": 5, "q1": "It is evident that the Roadmap and budget descriptions are short on detail.  The details about the team members suffer from the same weakness.  As a user, I don't mind, I'm already getting a good product.  However, as a reader and analyst, I would prefer to know more about the secret sauce: I would prefer to know more about each of the Roadmap activities (what is the planning and execution process for each of the two related activities, what are the sub-activities that are carried out).  In the same vein, I would prefer to know more about the related activities in the budget and details about the team executing the proposal.  \n\nI hazard a guess that this is simply an overconfidence in a product that the proposers already know works and not a desire to withhold information in a decentralized environment of which they have demonstrated full awareness.    \n\nSpecific recommendation for the next IdeaFests and ChallengeFests: eliminate the division by Rooms.  The attendance per Room is very low, therefore the exposure of the proposals to the public is reduced (most of the attendees in each room end up being the same proponents).  However, with all proposals in the main room, the exposure of each proposal to the number of community members is increased.  Reducing the speaking time for proposals to 2 minutes and establishing 5-minute question sessions for several proposals at a time (in a methodology of, for example, three presentations in a row and then a 5-minute question block for those three presentations) is a strategy that would increase the benefits for each proposal, in terms of being likely to be known by a larger number of community members.   The above strategy was implemented at TH East Asia's recent IdeaFest Reels2.  Each proposal was exposed to an average of 60 people, 6 times the average number of people in the format per room.  In turn, such a rapid fire format reduced audience fatigue significantly.  \n\nAdditionally, a way for non-proponent audiences to attend the events should be created: examples of success cases are the weekend Swarms and weekly Town Hall.", "q1r": 3, "q2": "Given the nature of the IdeaFest and ChallengeFest events, the KPIs in the proposal are quite clear and promote a practical measurement of results.  However, given that the proposal is part of an ongoing series, the opportunity to compare performance data with previous versions of the proposed events should be provided.  The iteration-by-iteration performance of the events should speak through the numbers, like any other project subject to iterations.", "q2r": 4, "assessor": "z_assessor_541", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10979, "q0": "Idea and challenge fest are already existing events in catalyst and I agree that financing it essential to keep them up and running. The value proposition of these events are clearly stated in the proposal (e.g. collaboration and partnering up, showcase ideas, empower proposals, increase quality of  proposals and so on). It is also essential for new member to receive early feedback on their ideas.\nProposal makes sense to be in miscelaneous challenge since it's a valuable and impactful product for catalyst community and it doesnt fit any other challenge.\nJust to better illustrate the relevance of these events, it would be nice to see here more numbers related to engagement of proposers in the events (number of attendees in past meetings, feedbacks, etc).\n\n ", "q0r": 5, "q1": "As the events already takes place regularly, I dont see major feasibility risks.\nThe plan is more related to really running the events in F9 but more details on how the preparation for it is done could be provided.\n\nThere's an ok budget breakdown that matches the standards event acitivites but they seem a bit generic. For instance,  II'l bring more detail on what is included in \" organization\" and in \"post tasks\". This would make it easier to assess the budget and even more transparent. Moreover, it could also include how many hours each activity takes. \n\nLast, catalyst swarm team is a well known and experienced team from the community, that have always been holding several catalyst events. However, more information on the individuals could be provided here, mainly for those new memebrs who still dont know their work.", "q1r": 4, "q2": "The kpis are fair and make sense for this proposal. However, they could have some targets on them, mainly becuase there's already experience from previous funds so proposer should know how many people to expect. It would also be very nice to have some way to measure feedback from attendees. This would help to improve the sessions for next funds, attracting even more participants and verify the effectiveness of these events.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11002, "q0": "    The Catalyst Swarm Community Events provide open spaces for newcomers to directly get in touch with Community veterans and projects, to build first relations and to find collaborators for their own ideas and visions. These events are moderated by highly engaged community members which also empower newcomers to engage in the Catalyst ecosystem. The proposers further admit to the risks that may occur and give reasonable and doable solutions to them. Due to the fact that that there is no specific challenge for this proposal, it fits the miscellaneous challenge well.", "q0r": 5, "q1": "The proposers give a budget that is broken down enough as well as the team involved. Due to the fact that Idea & Challenge Fest are already established community events since Fund 3, it is most likely to be implemented successfully.", "q1r": 5, "q2": "The measures by which the proposers plan to check the success of their proposal is good, and for the fact that they can compare it to the previous ones, the progress and success of this proposal can be measured efficiently.", "q2r": 5, "assessor": "z_assessor_292", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "IdeaFest & ChallengeFest offers proposer & challenge teams a stage to build relations & connections to increase proposal qualities & impact", "experience": "Catalyst Swarm organizes and hosts successful community events since Fund 3"}