{"id": 396865, "author": "chadle", "title": "NFT Search Engine on Cardano", "url": "https://cardano.ideascale.com/a/dtd/396865-48088", "category": 26441, "amount": 35000, "description": "Currently, Cardano applications search based on token policy ID and name and don't search based on metadata characteristics specific to NFTs", "f6_no_assessments": 5, "f6_rating": 3.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 4974, "q0": "This proposal seems to fit DApps and Integrations rather than Miscellaneous challenge. The proposal stated, “Our search engine will address the challenges by facilitating a responsive, easy-to-use website for deep metadata search”. However, the proposal could explain better such as their feature for searching NFT (search/sort out by name, artist, characteristics), how fast the result will return, why people will use this search engine instead of the traditional method? In my opinion, the proposal should come up with more unique and effective features that can attract more people using it. For example, input an image and search for similar NFTs. ", "q0r": 3, "q1": "We don't have any information on the team. We know the team will include two members: an engineer and an operations/management specialist., but the specific information about them is missing. Thus, I believe it is vital to provide their name, their roles in the proposal and a brief of past projects/works and their experience in the Cardano ecosystem. In addition, the profiles available on LinkedIn are also useful and enable initial trust with the team. The proposal project had implemented 90% of their goal in the first milestone. A few items are remaining which is fixing UX/UI, but who will be responsible for doing it? Other roles such as developer, system administrator, management should be declared on what they will contribute to the project. I am not sure why they need more than 2 months to refine UX and test bugs, then the estimated time required to deliver the project is in the next 3-to 6 months. There is no specific date that the complete system will be launched. Thus, I give this feasibility 2 out of 5.", "q1r": 2, "q2": "The roadmap seems to repeat the same steps after milestone 1 which is the core idea of this proposal, the remaining milestones just to improve the performance of the project. According to the budget breakdown. However, the proposal did not mention the total number of people who will be involved in the project. The requested budget is just a short brief and unclear but asked for fund $35,000. Since the role developer and sysadmin is calculated $8,866 for each position, at the same time the proposal also asked for another $8,866 for looking for another developer, so this has confused me why they need to look for another developer and how many developers will join their team? Therefore, I recommend instead of writing in a general way, the proposal should break down the amount of $8,866 into smaller parts by answering these questions: what is the hour price for each developer/sysadmin? How many developers/sysadmins is needed? Finally, the measurement of progress and development could be done better if the proposal explain what can be done in the first months? and which methodologies are adapted to this project to manage the progress? Overall, this auditability can get 2 out of 5.", "q2r": 2, "assessor": "z_assessor_1815", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2389, "q0": "when the whole world is developing strongly, all countries are moving towards 4.0 technology when data software begins to show signs of being overloaded. then it would be a very good idea to put the NFT engine looking for metadata in the Cardano blockchain into practice. As we know NFT is a unit of data on blockchain digital ledger. I see here team raised the issue that is indexable all NFT metadata, Search Engines This will be publicly open to anyone who wants to search Cardano NFT with metadata. I find the issues raised well suited to the challenge. This scheme is well-suited to scaling to address future challenges. in the solution section, the solutions that the team came up with were clearly defined that is. facilitate a responsive, easy-to-use website for deep metadata searching. problems and I found this solution very suitable to solve the problems of the challenge, the team also came up with very good evidence, research, or arguments. Besides, we also need to manage risks. In the project, I see that the team has mentioned two risks and has come up with a plan to solve those risks, I would like to add that if the application is hacked or compromised, the team will come up with a method. how to solve.", "q0r": 4, "q1": "in the section providing a route plan. I found the proposal identified a specific timeline. has been divided into three milestones. The target content of each milestone is also stated quite specifically. I think with this timeline is very reasonable to complete the set work. however, the progress of the project cannot be easily tracked by the community. I wish the group would have a link for the community to easily follow. with a budget of less than 10% of the total challenge budget and has been broken down into four categories as outlined in the proposal. I find it quite reasonable. However, I think the group has more plans in case they need to supplement the budget. about the list of team members. I see the new group has two members and is still missing. however, two members have also been assigned specific tasks for each person. members have a lot of experience with prestigious qualifications, very suitable for the proposed jobs. However, the identity of each person is difficult to verify. No documents are attached for reference. There is no link to the personal page. I wish the team would add this", "q1r": 3, "q2": "in the description of measuring the progress and development of the project. I see the team has not provided metrics yet. I hope the team will soon add a specific and earliest progress measurement. that will convince the community and more professionals to embark on the combination. successful description. The group also cited some fairly obvious successes related to the campaign's challenges. However, it is still sketchy. I would like the team to have a more specific report because this is a new project, so it has never been funded, but I find this project very interesting, reasonable, it is very necessary for the future. I hope this project will be more complete to convince the community and will be selected for disbursement for the project to be put into practice soon.", "q2r": 2, "assessor": "z_assessor_1486", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3688, "q0": "Search based on metadata characteristics specific to NFTs will allow people interested in Cardano NFTs to easily find NFTs with the characteristics they’re looking for and which is very good idea and the goal is to provide a fast and performant app that searches deep within blockchain metadata. The proposer has uniquely identified a need for the NFT search engine and has also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing NFT search engine based on the Metadata characteristics and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 35000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more buyers which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9669, "q0": "This proposal focuses on a NFT search engine, where users can get granual and rich information with respect to some search criteria. This proposal aligns in Mics, but could otherwise have been submitted to dApps and integrations.", "q0r": 5, "q1": "After checking the website posted in the youtube video. its a pity it doesn't resolve. Would have been nice to see what functionality already existed. The team however, seem quite far along in the project timeline. At a budget request for $15K, it doesnt seem unreasonable that they could produce the rest in time. Unfortunately i cannot find links to professional profiles or a webpage. ", "q1r": 4, "q2": "I cant see in the proposal a lot of metrics to measure the time line KPI of the team. However, in terms of what they have dont so far based on the youtube video, they seem to have a decent amount built. I would like to know if they are going to API some of the functionality so other website or apps can make use of their search engine?", "q2r": 3, "assessor": "z_assessor_750", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10701, "q0": "The proposer idea of building NFT search engine is appraisable proposal, Even I faced finding search engine and understanding NFTs, Building one cardano applications based on Tocken policy ID, by building one applications where we can search by name of Metadata characters  which will bring more value and name to Cardano eco system, which will be helpful even people leike me who faced problem at beginning,\nThe proposal is effectively addressed the challenge. ", "q0r": 5, "q1": "NFT search engine will allow users to find and access cardano NFTs by meta names , which will help all the cardano users, finding NFTs with characteristics will make easy accessible to everyone, This search engine will be open source and publicly anyone can search the NFTs by metadata, buy building responsive and easy to use website where all can interact with metadata will bring huge change, as development processes already going on, it might be completed soon, as they already have experience and plan to complete 90% of project ahead of time is impressive, with given experience and plan presented it is highly likely proposal will be successfully implemented . ", "q1r": 5, "q2": "Aa proposer is already following iterative, agile-based methodology implementing LEAN and Kanban techniques to build search engines, And planning to deliver in 3-6 months is nice, congaing all required data search bar and messaging options for interaction is nice, They have provided detailed expenditure cost for listed items which is great, since its having correct budget allocation and timeline map its great, If there is more people in team it would be great in there developing team, since proposer is ready to give all details on monthly bases which includes tracking, velocity review and prediction, and include a heavy focus on using LEAN techniques is admirable, The proposer has provided sufficient information to audit the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "We will develop an app to search metadata in the Cardano blockchain utilizing Cardano-node, Cardano db-sync, PostgreSQL, IPFS, and web tech.", "experience": "Our team consists of 2 team members with around 25 years each of IT infrastructure and application development expertise. We have run Cardano since early 2020 in the  beginning of the  ITN running the BBHMM stake pool.\n\n*Looking for at least one more developer. Join our team"}