{"id": 397124, "author": "badin", "title": "dTeach - building a donor pool", "url": "https://cardano.ideascale.com/a/dtd/397124-48088", "category": 26441, "amount": 20000, "description": "Lack of stable funding for the production of Open Educational Resources (OER) hinders their systemic approach to innovate education systems.", "f6_no_assessments": 5, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 157, "q0": "The proposal aims to set up an NGO and attract donors to then fund Open Educational Resources. The proposers aim to use Cardano for development service, international tenders, philanthropy and education and AD as the preferred currency for funding. The proposal is this challenge as it does not align to any other - there is no specific Education challenge in fund8. It aims to bring more users into Cardano by positioning it as a go to currency for donations to develop open educational content. The proposal is exponentially scalable, setting up an NGO and working with large donors can have a much bigger impact and proposers can position themselves to leverage the original funding to deliver something much larger down the road", "q0r": 5, "q1": "The proposer have a strong background in academia, research, developing (publishing books and PhD in education) and delivering educational content. The linkedin profiles corroborate this with more than 500 connections in each. The budget is reasonably calibrated at 20k over 10 months which includes compensation for time of proposers, legal and tax advise and web site and graphics. This is very reasonable. The highlighted risks are reluctance from organizations to dabble in crypto for which have mitigating steps of producing slide packs and other outreach material to bring the donor on the journey. The delivery schedule is articulated and links well to the budget, the key deliverables are registering an NGO and creating the mechanism to accept donations.", "q1r": 5, "q2": "The deliverable is clearly set out and KPIs defined based on the number of organizations committing donation, amount of crypto donations, number of educational material produced. This is a deliverable that is easy to audit given the clear plan and objective deliverable. Success is when NGO is established and a pool is funded by donors in crypto. If delivered at a 20k budget it will be very good value for money for the Cardano community", "q2r": 5, "assessor": "z_assessor_1076", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 2497, "q0": "This proposals focus is on developing a funding pool to support open educational resources.\n\nAs there are no challenges in this funding round that directly matches this projects ambitions within education I believe proposal is placed well in the miscellaneous category.\n\nThe proposal explains the reasons open educational resources can struggle due to the  lack of a systematic approach and a proper funding mechanism.\n\nDTeach Plan to address this by creating a sustainable donor pool. \n\nThey will encourage both donations and funds to be transacted using ADA.\n\nThis approach suggests the potential for a strong impact on both the open educational resource field and the Cardano ecosystem.\n\n\n\n", "q0r": 5, "q1": "The team is highly experienced in the relative fields to undertake a project of this type.\n\nThis is the second funding stage of a larger body of work.\n\nThe scope of the proposed funding is laid out within the provided budget with a detailed list of project milestones. An overview of the longer term goals of the project is also provided.\n\nA clear understanding of the scope of work to be undertaken within this funding proposal, a realistic consideration of the potential challenges and the relevant experience of the team provides confidence that if funded the aims of this proposal would be met.\n\n", "q1r": 5, "q2": "The milestones of this project are outlined in reasonable detail therefore it would be easy to track  progress as different milestones are hit. \n\nAs the DTeach website comes on line (The development of this is within this proposal). Evidence of several funded aspects of the proposal will be evident.\n\nThere are aspects of funded work that would not be obvious through the website and there is no plan of how progress in these areas will be transparent to the community. If given an understanding of how and if this information was to be presented to the community the star rating for this section could be adjusted accordingly. \n\n ", "q2r": 4, "assessor": "z_assessor_1513", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4891, "q0": "\"The background information and the problems are stated very clearly with greatly detailed explanation. The proposer seems to have a lot of insights for the problem in the way they express it, and they also provide a list of problem spheres, which makes the presentation more understandable and particularized. The proposer illustrates the solution in an elaborate way as they list out the abilities and features that their product can offer. They also show their targeted subject specifically. However, if they can deliver more technical information about how they would do to achieve the product's features, the proposal would be more valuable. \nA good point of this proposal is the detailed description of how Cardano ecosystem would attain benefits from the project and the reasons for it to classify itself to Miscellaneous Challenge. Besides, the proposer shows a stronger impact on Cardano ecosystem through their detailed and potential KPIs and marketing objectives. \nThe risks and challenges foreseen by the proposer are clearly stated, and their provided strategies to alliviate those are presented in a persuasive way. \"", "q0r": 5, "q1": "\"One strong point of this proposal is that they launch a lot of research before they build their platform, which is a proof for their careful characteristics and their wish to reinforce and verify the problems before dealing with them. Accordingly, the more exact the problems are defined, the higher the results are. \nThe milestones and roadmap demonstration is another advantage of this proposal. They are very exhaustive and specific as the proposer not only give detailed milestones but also a summary for that, and the milestones are in a very good order of task completion. The roadmap is clear and matches well with the whole plan with a vision coming up to 2 years. However, in this part, personally I prefer the milestones would be attached to the timeline so as to be easier to follow the time duration for those. Plus, if it is possible, I wish them to provide some more information on how they would conduct those numerous research and how those can be guaranteed in quality and accuracy. \nThe budget breakdown is considerably thorough with division for particular main tasks, hours of accomplishment and expense for each.\nThe proposer team are introduced with comprehensive profile of long-listed experiences related to their role in the project. All team members possesses Master to PhD degrees, which proves their competence in their fields. This team is constituted by a Master with background of managing philanthropic project, a PhD with multiple years in education and LMS courses, and a strategy and funding consultant, which is quite wholesome for the team to make this project feasible. Still, they lack of technical depvelopers or blockchain consultants or designers to help they buil the website; if there is one person in charge with that task, this team would be more complete. \"", "q1r": 4, "q2": "\"The KPIs of this proposal are quite enough with particular contents; but they are believed to be more informative and measurable if the contents are delivered in quantitative indicators. Plus, if they can provide the channel or tool that community can track those KPIs through, the clarity of this proposal would be way higher. \nThe description of success is quite clear with specific outcomes for short-term, mid-term and long-term time.\"", "q2r": 4, "assessor": "z_assessor_1796", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5807, "q0": "The dTeach team builds on their successful proposal in Fund7 ( https://cardano.ideascale.com/c/idea/383112) and now wants to create a pool of donor organizations to supercharge the production of Open Education Resources. Open Textbook Library has been around for a decade (and there's not a single book on blockchain, by the way). UNESCO has been lobbying for three years for the UN member states to adopt the use of OERs. But so far it has not become a major trend due to lack of incentives. Cardano as \"the RealFi blockchain\" is the obvious choice when finding an incentivized home for free, open and reusable education resources.", "q0r": 5, "q1": "The step-by-step plan is really solid and reasonable. I like the fact that it's not rushing for success but aims slowly towards the sky. Badin, Gustavo and Rebecca make a really impressive team. Since two of them work for the Siemens Foundation, I have an inkling that the first donor is secured. https://www.siemens-stiftung.org/en/media/background-stories-and-interviews/the-way-to-a-oer-platform/\n\nDue to the team's background this is quite research heavy approach. It might be that adding 2-3 movers and shakers with startup/business background might make the team even stronger.\n\nMy only improvement suggestion is that this screams for a native token! Donors could get it as a gift, content creators and distributors as rewards and teachers as income. Think about it. Immense potential. I'm also thinking about if the mentioned NFTs could be used as \"degrees\" or at least \"majors\" and \"minors\", so that the NFT holder would be dropped new digital books and course material in their wallet as the education progresses. Then again, the discussion regarding risks section echoes the fact that probably it's better to keep the technological solutions (DID, tokenization and blockchain) in the background and aim for as easy solutions as possible, focusing on the \"incentivization of open resources\" angle.\n\nAlso, since you mention \"pool of donors\", it brings to mind: have you considered a stakepool of donors? If the donations were converted into ADA and staked, it would make this approach also financially sustainable.\n\n(Just one more tiny point to add: currently dTeach.org is not supporting a secure https connection.)", "q1r": 4, "q2": "Milestones/timeline are well thought out, the budget makes a lot of sense and KPIs are good. Also the SDGs are nicely included and underline the positive impact of the approach. Apart from the development ideas listed above, I don't have any other improvement suggestions.\n\nIt seems that the team was about to include another proposal for a dTeach dApp (https://cardano.ideascale.com/c/idea/399405) but it was withdrawn. Let's stay tuned for that! :)", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7902, "q0": "\"Education in the blockchain field is really uncommon, if not a little rare. Because this is a new field, especially the government and people do not have the full awareness and necessary knowledge about this field. And education is also the fastest way to make blockchain go into quality depth. I also originally thought that there should be a separate topic for education, promoting formal education at universities.\nThe educational process needs to train a team of researchers, developers, especially technology teachers. And that process needs a fair compensation mechanism for pioneers. So I really liked your suggestion.\"", "q0r": 5, "q1": "This project has a methodical and tight plan. With a focus on in-depth research on the knowledge required for the entire industry, it brings together relevant ministries to promote and standardize learning materials. I think high quality educational products need to be extended globally. They intend to set up NGOs, media and fundraisers for the research and creation of such educational products. They have partners who are formally trained in the education industry, with extensive experience in educational research. All these factors will ensure the feasibility of the project.", "q1r": 5, "q2": "\"Through numbers such as: Number of organizations sponsoring educational activities, amount of money raised, number of members and number of interactions on the network, number of funded educational projects, cumulative fully integrate existing cardano platform features into their system, promote cardano payments...\nThese are the factors that can be measured numerically and set long-term goals for them. I appreciate goals measured in concrete numbers. Hope you will soon complete the educational promotion platform and educational products in the blockchain field if funded.\"", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Create pool of donor organizations to enable a decentralized, diligent and unbureaucratic funding mechanism for the production of OER's.", "experience": "International team of philanthropic professionals and education coordinators with experience in networks and project management, educational resource production, and a strong academic background in governance and education. Supported by highly experienced developers."}