{"id": 397250, "author": "gustapug", "title": "Who owns the blockchain?", "url": "https://cardano.ideascale.com/a/dtd/397250-48088", "category": 26441, "amount": 26000, "description": "Blockchain, Metaverse, NFTs, and AI don’t reach the classrooms. Information is available online, but not tailored to school students.", "funded": 1, "upvotes": 35853916, "downvotes": 15458853, "votes_result": 20395063, "votes_cast": 162, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 7520, "q0": "I struggle, as I am sure the proposer did, with determining if this proposal falls into the Film + Media Creatives challenge or is better suited here in the Miscellaneous challenge. A major concern about the former is the focus on Youtube and other very specific language in the challenge setting; the specificity of that challenge precludes any relation to this proposal. The author intends to create mixed-media educational resources for students across the globe (mainly LatAm, U.S., Germany and Africa) and ranging from 14 to 18 years of age. The education material is referred to as packs and will initially be focused on the following subjects: Metaverse, Web 3, AI, Machine Learning, Blockchain, NFTs. This will certainly broaden the awareness of not only Cardano but also the entire industry. The author does mention scalability, there are no discrepancies here since the program has the ability to scale at will. Risks are mentioned in depth along with mitigations but the author does not include the ever-changing nature of these technologies as a risk; deprecation and protocol changes happen frequently. It would have been nice for the proposer to address mitigations for these very real risks.\n", "q0r": 4, "q1": "The proposer has not listed additional team members but given the author’s experience as an actual author and educator, along with the vast number of contacts with teachers and media professionals leaves little doubt concerning capabilities. Given the various educational platforms outlined, the amount of research required and the scope of the proposal, the budget is within reason. One area of minor concern, as stated in feasibility, is the impact of an ever-changing industry and how best to mitigate those issues while likewise keeping the educational material relevant. Appending materials is not mentioned but is a common practice, the same for change notices. Overall, the proposer has a firm grasp on the requirements necessary to accomplish the tasks outlined in the 6-7 month. Coordination amongst the various industrial contributors will be a huge task in itself. The entire proposal is very detailed and well written.\n", "q1r": 4, "q2": "The author intends to create a project dashboard highlighting the progress and events as they become complete, however a platform or link are not identified. Conveying the dashboard’s location later does not provide the same reach as its inclusion within the proposal and is something the proposer may wish to consider for future proposals. The timeline has been mentioned previously in feasibility. The proposer intends to publish the material with a non-commercial attribution under Open Education Resources which falls under the Open Solutions system of open source materials. Other KPIs include scaling the project beyond these 6 core areas. There are many important areas not covered in these summary metrics and the voter is encouraged to read the entirety of this well-written proposal. Aside from the few concerns previously noted, this proposal is an excellent step in the right direction to educate the younger generations on important technologies in understandable and comprehensible terms.", "q2r": 5, "assessor": "z_assessor_591", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 822, "q0": "I found this proposal to be well organized, clear, and thoughtful.  And there is truth to the author's argument that educational resources proposed here offer to benefit Cardano by helping to generate a wider audience of people who are capable of actively being part of it.  However, it was also my analysis that this project aims to deliver general knowledge on a wide range of tech topics having no direct link to impacting Cardano.  And while I do think the project has some utility, I'm concerned that, a) I'm not sure it's Cardano's or Catalyst's responsibility to provide general tech/blockchain education to the mass market, b) I'm concerned that the speed of innovation in this space may cause content produced by this project to be outdated shortly after it is produced, and c) I didn't see any demonstrated evidence that the author was a stakeholder in the cardano community, other than having received funds for an education related initiative in F7.  If the funding requested represents the entire funding for this idea (as opposed to partial funding or co-funding by the proposer) I wonder if there is some non-bias was to proceed with a project like this, but give credit to Cardano/Catalyst as a way to ensure that it is included as part of the educational materials.", "q0r": 3, "q1": "The budget and roadmap breakdown are well structured relating to timeline, real deliverables, and reporting KPIs, indicating a high level of confidence that the proposer has the interest and capability to implement his plan.  The proposer's experience and related past performance (i.e. educational project managment, text book publication, teacher education workshops) also indicate that he is deeply familiar in his area of expertise, and is well positioned to do a good job.", "q1r": 4, "q2": "The proposal author is offering an open and transparent dashboard for progress tracking, and the project aims to deliver education materials which will be available online in attribute non-commercial format once completed.  And while I agree that the short term success to build the manpower and appropriate format is relevant, the medium and long-term visions for success are more subjective and repetitional.", "q2r": 4, "assessor": "z_assessor_1224", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "IMPACT: in the three concerns raised by the CA a); b); and c), he/she failed to understand that: A. Yes, Cardano and Catalyst can and should provide general blockchain education to the mass. Otherwise, how would it grow?? Relying only on the current early adopters?  \nB. The argument that things evolve so fast that we shouldn't create content to explain them makes no sense at all. So, how can people become up-to-date?  Will everything on the internet right now be useless by tomorrow? \nC. CA seems do not know that there's no rule that require people to be stakeholders in the community in order to propose projects. Anyone is welcome to come and pitch any idea. But yes, I'm an active member in the community (CA, vCA, CT in 3 challenges, TH, Latam Townhall, Telegram chats every day... it should be enough)."}, {"id": 6911, "q0": "Yes, this proposal will serve its  intended purpose because Blockchain, metaverse, NFTs, AI, and other digital technologies are not exposed to schools(classrooms) which is not good enough, so therefore this medium seeks to get to the basics with school children  and their teachers aswell to understand the positive impact(opportunities) it will bring to society and their personal growth and development.\nI personally had no idea about these technological advancements even after completion of college until quite recently I got involved through colleagues, so its a great idea that ought to be championed.", "q0r": 5, "q1": "The road map provided in this proposal shows that enough research,meetings,workshops,publications and other relevant  educative materials would be considered before final implementation is done to ensure accomplishment of the goals. \nPlans has also been laid out to make sure that funds will be used in accordance.", "q1r": 5, "q2": "Assessment measures, and other monitoring procedures will be conducted by students and teachers to determine the success of this proposal as stated. Also a longterm significance of this proposal to society is clearly mentioned.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 7905, "q0": "\"Education on Blockchain, Metaverse, NFT and AI has not been officially implemented in most universities in the world, although the technology has been around since 13 years - when bitcoin was born. Currently, technology platforms are starting to develop towards sustainability and have a foundation for developing applications on blockchain.\nA proposal for books and learning materials related to these areas. This is really a positive sign, it will promote blockchain technology education in depth, bringing more high-quality personnel, more professions in the future on the blockchain environment. These books and video materials (if available) would be great if translated into multiple languages.\"", "q0r": 5, "q1": "\"\n\nProposal writer has many years of experience in creating educational products. They work with a team of researchers and educators. They conduct seminars, research, and test educational products for different grades and ages. That's how they implemented the project to create books and other educational products. I see certainty in this progress when I read their plan. This whole process is possible and urgently needed if we want to make blockchain a global arena.\"", "q1r": 5, "q2": "The project will report in detail each stage of the project progress, publicizing the costs (ADA transfers, deliveries, assessment, deadline, and progress). And they develop educational products that go hand in hand with actual research on students' learning abilities and access to materials appropriate to each grade and age. They also consult educational and technical experts. This shows that the project is fully re-verifiable from the provided documents.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8140, "q0": "Proposal to solve the problem of wanting to educate Blockchain, Metaverse, NFT, AI for students in schools. Although currently, information about these fields is a lot on the net, but it is not suitable for students. The proposal wants to use methods from the aspects of technology, philosophy, digital media, the language of students to make it as easy as possible for them to access the content.\nAnother good point is that the proponent understands the risks and challenges when implementing this project. In addition, the stages of the proposal are clearly outlined, stating the action plan, making it easy for the community to check the progress of the proposal.", "q0r": 5, "q1": "The whole plan has been well thought out and presented, therefore I agree that this proposal will most likely be implemented successfully.\nThe requested budget is 26000$ which I think is quite convincing, the proponent has detailed it so it can be easily tracked and tested by the community. The nature of the proposal does not require a high technical level, but it does require the accessibility and participation of the community around the proposal, based on certain experience (doctor of education and also a author). educational materials) of the proponent and the plan presented, there is a high probability that the proposal will be successfully implemented.", "q1r": 5, "q2": "The proponent has outlined enough plans and KPIs to gauge the success of the proposal, identifying measurable outcomes that give us enough information to gauge project progress and performance. In addition, the proposal also identifies short-, medium- and long-term successes. One more reason why I believe this proposal will be successfully implemented is that this proponent has received funding from fund 7 by the project “Decentralized Education - dTeach” https://cardano. ideascale.com/c/idea/383112, Although This Proposal is not a continuation of fund 7 they are supporting each other, so I hope this proposal will also get funding so the author can make your project go as smoothly as possible.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "To offer relevant and tailored ed. content to students in a way that tech innovation meets the school. To speak the student’s language.", "experience": "Textbook author with >500k textbooks sold in Brazil. Author of online courses, didactic materials, and training programs for teachers and students. International experience interacting with over 3k teachers during in-person workshops. PhD in Education; F7 funded proposer; CA; CT"}