{"id": 397456, "author": "vcoincheck", "title": "Project Evaluation Website Ver 1.1", "url": "https://cardano.ideascale.com/a/dtd/397456-48088", "category": 26441, "amount": 19500, "description": "Many websites and social media channels evaluate the quality of the project, but these are only sketchy, highly subjective assessments and..", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 432, "q0": "Project Evaluation Website Ver 1.1 is an upgrade proposal that has been funded by Catalyst Fund at Fund7. If this proposal is successfully implemented, this is a very good source of knowledge to help the Cardano community around the world. From the basic knowledge that is disseminated, this will be an educational platform about blockchain in general, about the Cardano ecosystem in particular. In the long run, users will have the ability to self-assess projects, combined with the project reviews available on this platform will help users choose the most potential project.", "q0r": 5, "q1": "I see now that the proposed team is sharing knowledge about blockchain, knowledge about the Cardano ecosystem for free in the community in Vietnam. From the available knowledge, it is possible for the proponent to bring into this project. Each member of the team has their own expertise and is suitable for each task of the proposal, this is a strong point to help complete the proposal on schedule. With this team and the goal set for each month, I think that if you focus on doing it, you can complete more work. Due to the reason that the proponent set a low KPI compared to his ability, it is not commensurate with the amount of funding, so I give a score of 4", "q1r": 4, "q2": "The proponent clearly states the goal of completing the project in 3 months, but this is an upgraded website from the proposal that was funded at fund7. In Fund7's proposal, the first month the team proposed to build the web, UX / UI of the website; in the 2nd month will complete and launch the web, since the date of the proposal was funded nearly two months have passed, your project is just a set of DashForge templates purchased on themeforest.net for $ 20 ( Link: https://themeforest.net/item/dashforge-responsive-admin-dashboard-template/23725961# ). As of March 25, 2022, the website vcoincheck.io is still very sketchy, and I can't imagine the UX/UI of the website. Proposer, please focus on completing Project Evaluation Website Ver 1.0 soon so that the community can see that your team is a team that put a lot of effort into this proposal. I will be a regular visitor after this proposal is completed. For this reason, I only give 3 points", "q2r": 3, "assessor": "z_assessor_1151", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Thanks for giving assessment for the proposal,\nFeasibility:\nOur proposal aims to upgrade our website from version 1.0 to 1.1 one. The website will be integrated with more functions to make the website more diverse and more convenient for users. As follows:\n1. Create a knowledge library:\n2. Translate website content into Japanese language\n3. Integrate functions to help users interact well with the website such as: comment box, comparison chart, analysisic chart.\n4. Start building ideas on contributor lists to make the platform more decentralized.\nWith a lot of increased workload and a lot more KPI than the fund's proposal 7. We don't understand why the assessor assessed that I set a low KPI compared to our team ability and advised me to focus on \"evaluating the project\" job.\nAuditability\n1. The assessor clearly did not read the content of the proposal carefully, especially the Auditability section. In the proposal I have a very clear note at the beginning of the Auditibility -> Tracking source section: Vcoincheck.io (website) or Vcoincheck.com and Vcoincheck.net (in the case, Vcoincheck.io can not be accessed). Those 3 websites are belong to our team and use the same database sources.\npreparing to build a website platform that can integrate many extended functions, it takes a lot of time to build the back-end and core-database. That's why we choose the solution to run concurrently in the web domains that we own. In fact, website: Vcoincheck.net is always active and displays content. The assessor did not read my notes carefully, but did a rough check and made a review.\n2. Evaluating the success of the proposal is based on KPI's and many factors, the proposer just gives only 1 reason, which is based on the assessorr checked 1 of our website to evaluate. This is a personal assessment "}, {"id": 587, "q0": "- The project targets an extremely sensitive issue of the market in the current period. Blockchain information is still very messy, mostly small pieces of information that have not been codified and condensed. Taking advantage of this confusing information, many scam projects have sprung up to scam people who have no knowledge in the blockchain field.\n- The project helps the community synthesize blockchain knowledge in a certain logical order. Help readers save time and easily connect knowledge together. From there, build up a knowledgeable community about blockchain, Cardano ecosystem.\n- Knowledgeable community will not be easily fooled. They can self-assess projects and make their own decisions. This will limit scam projects because the number of people being scammed will be less and less, scam projects will no longer live.\n- In addition, a community that understands the Cardano ecosystem will help the Cardano ecosystem to thrive: There are many quality proposals, there are many CAs with extensive knowledge, knowledgeable investors will be able to accompany the project they choose to invest in in the long term.\n- After the market training is completed, the project is ready to hand over the management rights to the community. This is a great thing that not every project can do.\n- The project is translated into 3 languages: English, Vietnamese and Japanese, which will help many people around the world to seek blockchain knowledge.\n***Advantage/Suggest:\nDuring community training, the project can periodically organize Zoom meetings to share basic knowledge, objectively evaluate a certain outstanding project or\nsimply answering user questions will increase the connection between the project and the user. Users will trust the project more and refer more people they know.", "q0r": 4, "q1": "- The project has accompanying small projects to support\n- The project already has 2 active Vietnamese communities who love the Cardano ecosystem\n- The project has a clear plan for each month.\n- The project has a website and is in the process of being implemented\n- Specific budget allocation plan for each work item\n- The plan has also been detailed in 3 working months. This shows that the project has clear directions on the work to be done.\n- The team is large, has a lot of experience in the Cryptocurrency market, has in-depth knowledge of blockchain as well as the Cardano ecosystem, has good English and Japanese translation skills. There is also a member of the team with long-term experience in technology, which will help a lot in setting up the project's technology-related issues. With these skills and experience, it is possible for the team to complete the project.\n***Advantage/Suggest:\nThere is a work item on community management, care and development that has not been seen in the project yet. Engaging the community is very important. However, after attracting the community but not taking care and developing the community, it will also be very wasteful and maybe the community will no longer stay with the project. Therefore, the project needs to add more management, care, and community development as well as budget for this work.", "q1r": 5, "q2": "The project provides detailed commitment figures for each work item. These numbers are completely feasible and reasonable given the resources that the project has available.\n- The given project indicators are public, transparent, anyone can check\n- The project is also willing to share other internal information if required. This demonstrates a high commitment to transparency and clarity of the project. They are real people and want to create a good product for the community.\n- The project outlines a way to evaluate the success of the project through specific numbers. From there, it is possible to measure, evaluate as well as adjust the way the project operates according to each specific stage.\n***Advantage/Suggest:\n- The project does not have an index: the number of \"quality user\" to be achieved in each phase\nFor example, those who have quality sharing, useful knowledge for the community that are voted by the community will be awarded points. Reaching a certain point threshold will become a \"quality user\". The \"quality user\" are the assets of the project and also an indicator to evaluate the success of the project.", "q2r": 4, "assessor": "z_assessor_1192", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1597, "q0": "The proposal gives an idea for a website to evaluate the project and interact with users two-way. The proposal is suitable for the Miscellaneous Challenge given. I strongly agree on the impact of this project. Currently, the sources of knowledge are very academic, the reports of blockchain projects contain a lot of mathematical formulas that require readers to have a certain level of expertise to fully understand this information. Therefore, the number of people in the community who can access this source of knowledge is very small. However, the number of people investing in the crypto market is very large due to the profits it brings and the potential for future growth. And this is how scam projects use to scam investors. They take advantage of the lack of knowledge about the project, about technology in the blockchain world, build a team to push the price up to stimulate the FOMO of investors and then sell it to divest. Therefore, raising awareness from the community is essential for the blockchain space to develop more sustainably. And so the idea for a website where you can exchange, interact and exchange knowledge is really necessary.", "q0r": 5, "q1": "The proposal clearly outlines each work that needs to be done to achieve the proposed ideas. I strongly agree with what the proponent made.\nVery specific budget expenditures help voters to understand whether the idea can be completed or not.\nTeam members all have links to their personal profile pages, helping to increase transparency and member identification.", "q1r": 5, "q2": "The milestones in the KPI are all specifically measured, helping to standardize the success of the project. Present in detail, specific and clear. I strongly agree on the level of progress and success of the project.", "q2r": 5, "assessor": "z_assessor_1394", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 9972, "q0": "Under the Miscellaneous challenge, this proposal is received highly positive feedbacks, the proof that they receive almost 30 kudos. The problem is well identified, segmenting into 3 parts, the increasingly of the number of projects and the gap of textbook of Cardano Foundation, and the limited of quality website that provide an interactive peer to peer review platforms. The solution is breaking down into a library of blockchain as an industry; then zooming into the Cardano blockchain specifically. The risk is the part that this proposal could be improved as the clearer criteria to recruit the professional programmers/developers to participate into the platforms. The hook for reputation and non-profit is really challenging hindrances for the project to be successful. One very positive note of the project is the connection across community ranging from Vietnamese to Janpanese and  English-speaking communities. The team should also consider to current available platform in Cardano Community such as: https://www.cardanocube.io/  ", "q0r": 5, "q1": "The budget is 4% of the total challenge is reasonable for the whole challenge setting. The detail breaking down should be more transparent in term of working hours instead of monthly basic, There is also another proposal related to this proposal for the Library project which seems very intersting for the cross community in terms of language barriers. Milestones of the overal proposal is currently very high level milestones. The team is a very reliable and the team got funded in fund 7. This proposal is the further improvement of the vcoincheck.io basic version. The Japanese content team is the improvement from the previous fund. With the total of more than 20 core team members and advisors, there is highly feasible that the project team is serious and the milestones shall be completed in time. The telegram and Linkedin account of the team members are very credible and should be considered and recognised by the community.", "q1r": 4, "q2": "Once again, the big applause for the multi languages of the proposal. The backgrounds of native language core team members and the certificates of the supporting members (in Japanese) are well verified. The target are setting clearly on a 3 month roadmap, there should be a weekly/hour per week update so that the risk of putting everything to the very end of the deadline. The proposal has a website and 2 back-up domain names: Vcoincheck.io (website) or Vcoincheck.com and Vcoincheck.net; which shows the seriousness and can be tracked. From the time of this evaluation, the vcoincheck.io is going live in its commitment in the previous fund with Vietnamese language with 24 members and 10 evaluated projects on Cardano and toher blockchains. http://vcoincheck.io/vcoincheck/home/ The successful KPI is the number of the projects that will be evaluated and translated into different languages. The team also has a Youtbe channel to broadcast their updates and explanation in the video format to the end users.", "q2r": 5, "assessor": "z_assessor_782", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Vcoincheck 1.1 will upgrade many technical features to the project evaluation section to help the community easily interact with each other.", "experience": "Our core-team is vcoincheck.io team, 2 admin who driven large Cardano community on facebook, Japanese specialist teammore than 5 years of experience in translating and interpreting Japanese and English, working with Japanese people and, lived in Japanese"}