{"id": 397644, "author": "stevenwonder19", "title": "Affordable Real Estate Investments", "url": "https://cardano.ideascale.com/a/dtd/397644-48088", "category": 26441, "amount": 25000, "description": "Platform for people to own parts of real estate with lower amount of investment and better return through buying tokenized real estate", "f6_no_assessments": 4, "f6_rating": 1.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 9692, "q0": "Real estate property is an asset everyone wants in their portfolio. And increasing demands an prices have made it unaffordable to families with median income and hence the concept of fractional ownership of a property could be one solution to encourage property among all classes of family. Irrespective how intriguing the concept is, there is very little information regarding how effienctly the team proposes to achieve this. The proposer also tries to identify a few risks involved but do not  have any solutions or mechanisms in place to solve them. Considering that the proposal is submitted in the Miscellaneous challenge there is very little details available to draw conclusions regarding the type is issues the proposal is trying to tackle and how impactful the results could be on the Cardano chain.", "q0r": 3, "q1": "I have to disagree with the amount of facts available to me as a reader to assess the feasibility of the proposal. There are no solid milestones set to support the claims of the proposer. The proposer makes no effort to introduce himself or any other teammate that would be working on the project. With no information regarding the prior experience or the stature of the team it is highly unlikely the community can build a sense of trust and confidence in the proposal. The plan even though stretches to about 10 months, there is no clear-cut action plan nor the budget breakdown. Taking into consideration the gravity of the situation the team is trying to solve and the kind of idea they have, I suggest that the team goes back to their drawing board and come back in the next rounds with more research and set game plan to support their proposal. Also I would love to see the team get a few people on board and introduce them to us.", "q1r": 1, "q2": "Most of my points given in the feasibility section flows into this section as well. Looking at the success metrics, I feel still needs to work on their deliverables and timeline and then provide the community with how we can expect to monitor their progress. The KPIs are the only thing that helps the community understand the intensity of the proposal and its probability of success on the chain, which are clearly missing here. The success outcomes of the team looks very dull and do not complement any of the expectations of the challenge the proposal is submitted under. Provided its the Miscellaneous challenge, the team is at liberty to target any kind of issue and submit some brilliant success criteria, but I feel the team has missed out on such a great opportunity. Also the proposal being a new one, all areas are expected to be covered as they are going up some heavy weights who are returning for subsequent fundings. So I have to restrict myself to giving 1 out of 5 stars on the auditability parameters too.", "q2r": 1, "assessor": "z_assessor_751", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 565, "q0": "I can see the need for a platform like this and the proposal gives a proper solution to the problem. The platform would have a positive impact on Cardano, but the proposal would benefit if you express those more explicitly, community and CAs often vote Cardano focus projects. The proposal could be addressed in other challenge, for example, B2C is a great choice or dAPPS and Integrations. Also some solutions or ways of dealing with the challenges would add to the proposal", "q0r": 3, "q1": "On timelines and Budget, both are too general for my taste. We have no information about the proposer or any team member. Budget should have a clearer breakdown, rather than just costs and developers and marketers, is way to general of a concept without explanation, for next proposal I would give more attention on proposer information and if possible, team members. Always show information, LinkedIn is great.", "q1r": 2, "q2": "We have no social medias, at least on the proposal, no real names. The concept of web completion is too general in my opinion as a KPI, detail ones would be appreciated.\n\nConclusion: For next fund I would recommend addressing all the mentioned issues, mainly information on the proposers, its okey if the team is complete, but the community should be able to audit the process in social medias for example. I would recommend joining forces in Catalyst with someone that can help you address all of this issues. I would suggest talking to people in Catalyst Townhall, each Wednesday\nhttps://www.meetup.com/es/Cardano-Catalyst-Community-Network/\n\nGood Luck!", "q2r": 1, "assessor": "z_assessor_1190", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 825, "q0": "I believe this proposal belongs more appropriately in the Dapps and Integrations challenge.   The primary purpose of this proposal is to build and app that presents tokenized real estate investment opportunities to retail investors (read: DeFi), however the proposal and attachments are very basic ideas on how something like this could work.", "q0r": 2, "q1": "A very rudimentary timeline and budget is provided, however my experience developing complex financial tools makes me believe that there is no way the project can reach anywhere near an MVP stage with the amount of funds requested.  While I think the idea is good, I also think, based on personal experience evaluating involvement in a large scale tokenized real estate project, that the proposer is hugely underestimating the resources that it would take to bring a project like this to life.  There are limited (if any) comments about the regulatory, legal, or even KYC challenges that might be involved.  And that doesn't even start to consider compatibility with local legislations wherever they intend to implement this.  Overall, I believe tokenized real estate is something that we will see very soon, but there is no evidence provided in this proposal that is convincing to believe this is the right opportunity.", "q1r": 1, "q2": "The project potentially has auditability if it was done open source, or usable.  But related to my comments about implementation probability, I don't think the plan presented or the resources requested will get them anywhere near where they would need to be to present meaningful results that could qualify this project as auditable.", "q2r": 2, "assessor": "z_assessor_1224", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2012, "q0": "I was slightly confused when reading this proposal. I understand that problem and the concern that is at hand. It is difficult to purchase real estate investments with the current state of the market. My question while reading through the proposal was how Cardano and blockchain technology was involved. I want more details on how that will be implemented with this realverse application. Provide this information and it would make for an easier read and a more likely chance of being funded in the process. For now, I have to give this section 3 out of 5 stars. ", "q0r": 3, "q1": "I want to know who the team is. It is stated that there are 3 developers and 2 working on marketing. However, there isn't any names or experience given in this proposal. If the proposal included the names of these 5 members and the experience they have in this space, it could completely change the outcome of this proposal. For now, I have to go this section 2 out of 5 stars due to lack of information in that regard. There's not much more to assess here. ", "q1r": 2, "q2": "I did enjoy reading through the roadmap and budget breakdown. The roadmap is concise and straight to the point. The reader is able to understand what is planned to happen within the first 5 months and then the rest of the time frame. The budget breakdown could be more specific. Give more details on where the requested funds will go. Right now it is pretty general in stating Development and marketing. Talk about how those funds will be used in that respect. After these changes, the given score can be adjusted. For this reason, I give this 2 out of 5 stars. ", "q2r": 2, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "People can buy certain amount of tokens to own part of the house or real estate. IT allows people to invest in real estate with small funds.", "experience": "I have business experience in banking and managing projects. I also have experience in developing different technical solutions. In short I have both financial and technical skills to manage and bring a project to life. I also have testing & quality assurance skill."}