{"id": 397727, "author": "robert.oschler", "title": "NFT3D Live 3D Interactive Metaverse", "url": "https://cardano.ideascale.com/a/dtd/397727-48088", "category": 26441, "amount": 25000, "description": "NFT artists & their customers are hungry for a blockchain driven Metaverse platform that supports truly interactive, animated, 3D NFTs", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 2654, "q0": "What a concept!! I am just starting to get into the NFT space and this would be absolutely amazing for bringing NFTs to the masses, and best of all set cardano apart from the rest of the Blockchain ecosystem. The only worry I have is the \"allow friends and family access\" to the NFTs that someone purchased. I feel as if that takes away from exclusivity of the NFT, unless it is up to the owner of said NFT to control access (as opposed to the artist). Would also like to know how centralized this platform would be as the embodiment of cardano is decentralization.", "q0r": 4, "q1": "The only thing that worries me is the centralized nature of the platform. If there is a way to give more power to the users then I think you guys would have a home run.", "q1r": 4, "q2": "I would like to see more social engagement of your milestones. I am glad to see that your team has self funded the project up to this point, but maybe even VCs would join in backing your project if attempts were made to broadcast this to the general public.", "q2r": 4, "assessor": "z_assessor_1548", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3566, "q0": "Overall, I believe that this challenge does fit in the miscellaneous challenge setting since it doesn’t seem to belong in any other challenge settings. From what I’m given to understand in the proposal, apparently this proposal is a description of a VR 360 showroom dedicated to displaying and trading NFTs while ensuring the artists and followers are lawfully protected. I’m personally thrilled with the idea since to my knowledge, there are yet many successful virtual showrooms that fully captivate the attention and interest of both artists and the interested audience. Hence, enabling them to have just that is a remarkable success by any means, and especially when the project is migrated to Cardano, it should theoretically draw in more people to join our ecosystem. The proposer has managed to deliver a well-made demonstration of the functions and security features that this project possesses, and also lists of potential obstacles in the foreseeable future, followed by viable resolutions for each. The only tweak I’d add to this proposal is some mention of key metrics, preferably in figures (though I assume that won’t be too likely)", "q0r": 4, "q1": "From the timeline and plan laid out by the proposer, I do believe that the proposal will be able to roll out a desirable outcome. Given that this is not a large-scaled project, the requested budget sounds legitimate. However, the project currently seems to be short on the hands on deck, as I notice there is only one member listed. Nevertheless, that member does come with the information of relevant background and expertise (though I would prefer if the proposer also included some affiliated links or online profiles for further verification), and the proposer does claim to bring in more personnel, which shows promising signs of this project.", "q1r": 4, "q2": "Here in this section, the team notes down 2 versions of success in 2 different periods of time, and the KPIs for measuring those successes, which I find relevant. However, I would give this section a higher rating if there were some forms of progress tracking made available for public access, and apparently this proposal is lacking the benefits that Cardano is expected to gain from this project, which is a mistake that should not be made", "q2r": 2, "assessor": "z_assessor_1664", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 3690, "q0": "An NFT is a unique digital token that is created using blockchain technology. Selling NFTs allows content creators to earn recurring income on video games, 3D artwork, VR artwork, and more. It's a massive industry that shows no signs of slowing down. The market is so huge already and imagine introducing 3D NFT's into the marketplace. People would be so attracted towards it and is definitely going to make a major change in the NFT marketplace as it is the first time someone is implementing such thing. The proposer has uniquely identified a need for the 3D effect in NFT and has also worked towards the implementation which is impressive and by introducing 3D NFT and live marketplace it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. ", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing 3D in NFT's and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.\n ", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 25000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more buyers which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4538, "q0": "As metaverse project are getting more attraction day by day, almost everyone believes that future of the world completely relies on metaverse projects, even the proposer has clear idea of introducing to such project where he will be providing live auction room in meta format, where NFT3D live interactive room model will set as a best example to all people regarding the cardano's funding projects, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Achieving any 3D live interactive model is not very easy ,still many researches are going on this project ,But the proposer has produced a demo model of NEO 3D  which is definitely great , Neo3D Live was also a winner in the SocialFi (social finance) category of the recent Metathon Hackathon held by the Metaverse Alliance, even this is a great achievement of NEO 3D team, with great partners provided with the team, plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The presented idea contains introduction of all the partners with whom this project will be worked with , the proposal even contains a demo video of NEO 3D team and its achievements in Meta hackathons.\nThe proposal contains both pro's and con's of the project , and has presented every timeline of the project  with detailed budget breaking , the proposal even wants to increase the audience of 25 per room in presented meta, with excellent key indicators provided to measure the success rate of the project ,with the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4975, "q0": "First, the idea of the proposal is new and creative and well-fitted to Miscellaneous challenges. If this proposal will be ever funded, it would change the whole game of the NFT collector when the content inside the NFT is only available for the owner. The most exciting about NFT3D is viewers can view NFT with animation or interact with them, so this will add huge value to the NFT marketplace. NFT3D Live auctions are designed like a showcase room where buyers feel like walking in the museum but on the virtual platform. I believe this project will create a unique experiment and give the view of near future NFTs. For that reason, I give this impact 5 out of 5.", "q0r": 5, "q1": "The team presented in the proposal has only Robert Oschler who has experience with common coding languages such as Javascript, Python, Java, C++ and but not Haskell or Plutus, but Robert stated, “if need be, I will do the migration of the NEO smart contracts to Cardano myself”. The author mentioned that he would hire NFT design/creation and other animation, or 3D work as they had collaborated in the past, I suggest providing their name or link to their work would significantly improve your feasibility. Moreover, migration should be a priority since it takes a longer time to test and launch in a new ecosystem. For example, all the NFT creation and 3D works are ready and functional perfectly with NEO 3D Live, but it cannot be compatible with the Cardano ecosystem, then lead to a delay in the delivery date. The other limitation is that each conference can only handle 25 people while the growth of Cardano community is exponential. For this reason, I rate the feasibility 3 out of 5.", "q1r": 3, "q2": "The KPIs should be made clear with a specific number of key metrics to measure the progress and development, as well as the expected results should give more information (for example, the quality and quantity of NFTs, the influence of proposal on the Cardano community) to help the reader Imaginate how the success project look like. Moreover, describing how they will spend $25,000 fund through the timeline would be great to make your auditability more convincing. Thus, I would give 4 out of 5 for the auditability.", "q2r": 4, "assessor": "z_assessor_1815", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8143, "q0": "The purpose of this proposal is to create a blockchain-based Metaverse platform that supports 3D NFTs for NFT artists and their clients. The solution is NFT3D Live which brings Cardano's live NFT auctions in a 3D virtual world with integrated video conferencing. This will help protect the interests of both NFT artists and fans. A clear and understandable solution was provided as per the proposal to clearly describe the problem targeted. The idea of the proposal is quite good and perfectly suited to the challenge.\nThe proposal also measures the risks and challenges that may be encountered during implementation and also has suitable solutions for all of them.", "q0r": 5, "q1": "It can be seen that the proponents know how to formulate a reasonable plan of action. There is a very good explanation of the route. It is structured over 6 months and would be perfect if there were extensive explanations of what happens in each month.\nThe $25,000 budget request is reasonable, the numbers are well defined, allowing the community to clearly understand what the money will be used for.\nAbout the team behind the proposal Robert Oschler is mentioned with experience in graphics and natural language processing. He is also a veteran CA member of Cardano. The team description is great and there are links to his LinkedIn profile for information, which gives us confidence that they will be able to deliver on what they promise.", "q1r": 5, "q2": "An entire section with easy-to-follow KPIs along with a 3.6-month shortlist of plans increases the transparency of this project and proposal.\nFurthermore, this project is an award-winning and recognized blockchain technology industry that can be easily accessed by viewing https://metaversealliance.com/results. So I have no doubts about the success of the proposal. Again, the KPIs are very clear and fit the definition of success, leading to a clear understanding of the goal problem.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "NFT3D Live brings to Cardano live NFT auctions that are set in a 3D virtual world with integrated video conferencing", "experience": "Experienced Full Stack Dev, Natural Language Processing & Speech Recognition developer, Robotics, and more\nLinkedIn Profile:\nhttps://www.linkedin.com/in/natlang/"}