{"id": 398077, "author": "saurabhksinha9000", "title": "Smartex", "url": "https://cardano.ideascale.com/a/dtd/398077-48088", "category": 26441, "amount": 25000, "description": "With Web 3.0 dominating the tech news, we wondered how we, as technology enthusiasts, might contribute to this oncoming revolution.", "f6_no_assessments": 5, "f6_rating": 2.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This since the demo video shows a mobile/web application, which is a blockchain powered bill payment solution that stores account balances, this proposal would be a better fit in the Dapps and Integrations challenge.  Were it placed there, I could be in more agreement that the idea was at least interesting.  However, the proposal also comes with a limited amount of substance, only stating that it is a blockchain powered solution, and no additional depth.", "q0r": 2, "q1": "I think this kind of project is very creative, and ultimately necessary for the more mainstream adoption and utility of Cardano.  However, mass adoption of a project like this  is actually a massive undertaking.  The funding amount requested here is purposed for a single person team, acknowledges no challenges in delivery (perhaps more in the future), and simply mentions that it will take \"1 month\" in reference to the implementation timeline.  The author also makes no mention of any kind of business plan, business model, or marketing plan to that could be used to evaluate if their understanding of the project scope is reasonable.  Lastly, the website link provided goes to a page that requires some kind of login, so there was no useful information available to evaluate there.", "q1r": 2, "q2": "I believe that the level of detail provided here offers little to no possibility for a meaningful audit or progress tracking, because it offers very little developed/conceptual information about the project scope.  There is no mention that it is open source, and there is also no comment about tools, language, platform, collaboration, etc.  My recommendation to the author would be to develop this idea a little more, and make some indication (in the appropriate challenge) that this is a real project you have put thought into, and help to explain how this builds on the strength of Cardano by offering interesting new DeFi tools that can reach some level of awareness and utility within the community.", "q2r": 1, "assessor": "z_assessor_1224", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal tries to create smartex, an application that can help share expenses with friends and families. The smartex already has a working prototype demonstrated through youtube videos. I think the project is interesting and can bring value to the Cardano ecosystem. The proposal state they have no risks associated with the project, which doesn’t sound right. There is no project with no risks, there are risks associated with the project, for example, is there any project with similar ideas and solutions? how do you market the product to the users? what if the budget runs out? etc.", "q0r": 3, "q1": "The proposal just state they have one-month approximations to complete, without giving any roadmap or structured timeline. It will be much better if they provide what will they do at what time, for example, implement features A-C on the first week, features D-G on the second and third week. The budget information is not broken down into details and only state they need an approximation of 25k$. The proposer can give more details on the cost of the development, such as server cost, remuneration for the developer, or load balancer (if any). The proposal does not provide information on the team at all, no names or experience and skills are stated. It will be very helpful to the community to know to whom they are giving their funding, at the very least LinkedIn profile for the proposer are enough. Also, the proposal state they will onboard new member until the end of projects, if the team need a new member it’s important to give details of how many members and at what function to the team.", "q1r": 2, "q2": "The project has already a working solution that can be tested through the hyperlink given and youtube video. On the metric of success the proposer mention beside two additional features they will add more to the platform. If they already have an expansion plan, it is better written out also. For success indicators, it would be better if success indicators include measurable goals, such as, acquiring 200 users, or more than 75% of users satisfied with the product (from your own survey).", "q2r": 3, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is for a Cardano based service that will allow users to share expenses with friends and family, and pay the shared bills or restaurant meals in either cryptocurrencies or Fiat.\nThe service will be available for all mobile platforms, as well as for desktop PCs, as it has a cloud-based design.\nThe included YouTube video is very comprehensive and allows the viewer to better visualise the intended outcome.\nI find the end goal of the proposal to be actually useful to the Cardano Community and help accelerate the utility and ease of use of the token.", "q0r": 5, "q1": "This entire section has not been adequately addressed. The detailed plan and timeline are unfortunately missing, the mention that it will take approximately 1 month to finish the project is not sufficient to visualise the steps needed to implement the proposal.\nThe budget is not divided at all, the total amount of $25k is described as being needed for “the end to end solution” and there is no description of the proposer’s skills, past endeavours and links to social profile platforms, that would provide a clear picture of his ability to successfully implement the proposal.", "q1r": 1, "q2": "From the way this section has been tackled, I find it has also not been addressed by the proposer. The answers provided are not related to the questions asked and they look like a continuation of the impact speech from the beginning. He should have provided clear measurements of the development progress, probably after rewriting the feasibility section, the KPIs required there will offer a clear answer for this next phase.\nAs such, I highly recommend resubmission in a future fund.", "q2r": 1, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has identified a problem but it has no meaning as it doesn't look like an issue that needs to be solved. The provided solution aims to share some info about expenses among a group of persons but is hard to fine how this kind of app can be \"powered by Cardano\" or by any other blockchain. There are plenty of application than keeps track of expenses and they work just fine without a decentralized system. The only thing that drives this kind of activity forward is the will of the users to input some data periodically. \nBased on the info provided is unclear what will be the added value to the Cardano ecosystem.\n\nThe proposal seems that it doesn't fit into the Challenge brief, a more appropriate Campaign being F8: DApps and Integrations.", "q0r": 2, "q1": "There are no relevant references about the proposer skills and experience necessary to successfully implement the proposal. There is a link to some kind of platform but is inaccessible as the landing page is asking for logging in so the content remains a mystery for the people who want to peek for awhile. (a white paper explaining the working principle could be helpful if there is no desire to share the functionality of the platform to the general audience).\n\nThe requested amount is not broken down into identifiable items and seems that the proposer is not aware of all the necessary resources to make this project a viable product (human resources, stationery etc.)\n\nThe proposer has not considered challenges and risks relevant to a successful implementation (what if the one month to deliver the working product is not enough?). In the developing phase of an app a testing activity is required (how often should be conducted?)", "q1r": 2, "q2": "Based on the info provided in the proposal is highly unlikely that it will succed. First, the proposer should identify a problem and a solution that, with the help of the Cardano blockchain, can be solved. Second, the proposal should be drawn providing relevant info about what is to be done and how (and of course, by who) being aware of the risks and challenges that can interfere with the main course.\n\nRephrasing it as stated above and submitting in the next Funding Campaign could stand a chance for being funded.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "\" With Web 3.0 dominating today's technology news, proponents want to contribute to this coming revolution. The solution is Smartex, a decentralized system powered by Cardano that makes it easier for friends and family to share costs. In my opinion, the problem and the solution given are reasonable but not within the scope of the challenge. This proposal would be better suited to the \"\"DApps and Integrations\"\" challenge. I think in order to get funded, the author needs to rewrite his proposal in fund 9 in a more suitable challenge.\nIn addition, the proponent also did not mention the risks and challenges that may be encountered when implementing the project. And importantly, he needs to provide details on the roadmap, explain the budget and like to let the community know better who he is. Overall, this is a good idea but poorly presented.\"", "q0r": 2, "q1": "According to the proponent, this project was made by him. Aside from his name, I don't know how experienced and specialized he is. The proponent can provide more information about himself like Linkedin or Twitter or anything that highlights his skills to convince him he can get the job done.\nThe requested budget for the project is $25,000 but doesn't provide any details on where the money will go, so I don't know if it fits the proposal. The proposal's roadmap is also very crudely described as \"approximately 1 month of integration review and features to be rolled out\", adding that, with no actual plans in place, no one can check the progress or success of this proposal. For the above reasons, I do not agree that this proposal will be successfully implemented.", "q1r": 2, "q2": "According to the proponent, this project was made by him. Aside from his name, I don't know how experienced and specialized he is. The proponent can provide more information about himself like Linkedin or Twitter or anything that highlights his skills to convince him he can get the job done.\nThe requested budget for the project is $25,000 but doesn't provide any details on where the money will go, so I don't know if it fits the proposal. The proposal's roadmap is also very crudely described as \"about 1 month of integration review and features to be rolled out\", adding that, without an actual plan being put in place, no one can check the progress or success of this proposal. For the above reasons, I do not agree that this proposal will be successfully implemented.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Smartex is a decentralized system powered by Cardano that makes it easier for friends and family to share expenses.", "experience": "To connect to the blockchain, Cardano NodeJS SDK was utilized. We used NodeJS to construct APIs. The Front end was built in QuickBase (a low-code, no-code platform) and then merged with the platform."}