{"id": 398074, "author": "cryptoeye", "title": "Uncle Harmony", "url": "https://cardano.ideascale.com/a/dtd/398074-48088", "category": 26441, "amount": 3000, "description": "The students face these problems while doing an online course: No way to test their knowledge and Get rewarded for their knowledge.", "f6_no_assessments": 4, "f6_rating": 2.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 1506, "q0": "The campaign brief in the miscellaneous challenge is very brief and broad, however it does mention that \"The only constrain to submit a proposal in this challenge is that the proposal needs to be somehow related to Cardano.\".\n\nI fail to see the connection between this proposal, being a questionnaire for the Harmony One blockchain (built on Ethereum) and Cardano. Other than they both are blockchains, which is a far stretch. \nMy conclusion is that this proposal fails to address the challenge by not being relevant to the Cardano ecosystem in any meaningful matter. A suggestion couldbe to rebrand the solution and switch the focus to topics related to the Cardano community. \nBased on the arguments above, the proposal receives a 1-star rating in terms of impact.", "q0r": 1, "q1": "The app described in the proposal is simple in its nature and the author claims to have the required experience to successfully implement it. No other evidence to back up these claims are provided but given the simple nature of the app and the barebone project provided on Github it is deemed to be feasible. Although the author have not put in much effort at all to provide details, such as why the project would be feasible. 2 stars are deducted as a result and the proposal is given 3 stars in terms of feasibility. ", "q1r": 3, "q2": "The auditability section is lacking real KPI's and is confusing. The author mentions \"The progress will be measured by adding more interactive modules\" in this section. I fail to see how this is a measurement, and this should be clarified in the future if you decide to submit this proposal again. Overall the proposal lacks KPI's and unclear in the auditability section. A score of 1-star is given.", "q2r": 1, "assessor": "z_assessor_139", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2018, "q0": "I'm not sure if I understand what the problem is here. Education is always important, but I don't understand how this proposal will help address that challenge. Especially in the Cardano blockchain. A more profound explanation on this matter would be important to include in the proposal. From my understanding, Harmony one has little to nothing to do with Cardano ecosystem and may not help the cause of the funding system. For this reason, I give this section 2 out of 5 stars. ", "q0r": 2, "q1": "I don't see any information in regards to the team or individual that has proposed this idea. In order to increase the likelihood of getting funded, providing experience and names of the team would be one of the most important parts. Because of the lack of this information, I cannot verify if this proposal will be implemented successfully and for that reason, I currently give this section 2 out of 5 stars. ", "q1r": 2, "q2": "I don't understand how anything connects back to Cardano. The purpose of the funding process is to help different projects and companies to receive funds in order to work on something that will help Cardano to scale and be interoperable. The given information in this proposal will not help Cardano to achieve these things. In order to get a higher rating, I would include more information about how this project connects to the Cardano ecosystem. We can start from there. For these given reasons, I give this section of the proposal 1 out of 5 stars. ", "q2r": 1, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5286, "q0": "1. Yes, proposal provided a clear decription of studing Harmony.\n2. Yes, i've checked: the problem statement defines a problem within the challenge.\n3. yes, i've checked: the proposal has a positive impact on the Cardano ecosystem. I love the concept of gamification also some bonuses while studing will help students to keep their interest. \n4. yes, i've checked. The proposal absolutely will add value through the involving new and well educated people. I also like the design of what is done right now.\n5. I believe KPI in proposal match the ones in the challenge.\n6. The proposal absolutely able to scale! The more people study- the more will get in gamification into the process.", "q0r": 5, "q1": "1. Yes, proposal knows what experience required, moreover they have this experience. There is web site working already.\n2. Yes, poropsal provided link to their github account also.\n3. Yes, i believe proposal knows as there is something done already.\n4. Absolutely yes, budget is well understandable and broke down into identifiable items.\n5. yes, the budget is reasonable.\n6. Nothing was found about additional funding.\n7. I've checkes, the plan seems enough detailed and this project works already, so implementable too.\n8. Its seems that there is complete order of tasks.\n9. yes, the proposal offer a realistic timetable to complete the work.\n10. The plan describes the resources necessary to implement it. \n11. Architecture isn't crucial to this proposal.\n12. No big risks- the project is online already and budget is small.", "q1r": 5, "q2": "\n1. Some kind of concept roadmap is. Not complete.\n2. The KPI does make sense because number of users is easy to check.\n3. I believe the KPI may be used for quantity success of this project\n4. Absolutely yes, number of users is easy to check.", "q2r": 5, "assessor": "z_assessor_1914", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10081, "q0": "This proposal is creating Uncle Harmony, a solution that allows users to take a quick assessment to test their knowledge about the Harmony One and get rewarded for their knowledge. This proposal is intended to serve the users of another platform, Harmony One, and doesn't help the development of the Cardano community. On the other hand, the features in this solution are quite similar to those of other online courses that we often see (test and reward by certificate).", "q0r": 2, "q1": "The proposer doesn't not giving detailed implementation plan and expected time to complete project\nThe budget is divided into 2 parts: development and marketing but it is not clear what this fund will be used for. \nThere is no information about the team members of this project such as how many people are included, who they are, information about the skills and previous experience of the members. Based on the information provided, this project has an experienced one specialize in blockchain development, full-stack development, and UI design which is more about development side. How about marketing side? Does this team have any members with marketing experience? \nFrom given information, it is difficult to assess the feasibility of this project.", "q1r": 2, "q2": "Regarding proposer, KPI of this project the number of interactive modules. How about the indicator of the number of Uncle Harmony's users and their level of satisfaction with the test content & UI. I think there are also an important factor. And I suggest provide specific metric for each given KPI", "q2r": 2, "assessor": "z_assessor_792", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "The magical solution for the problem is Uncle Harmony, who takes a quick assessment to test the user’s knowledge about the Harmony One.", "experience": "Experienced in blockchain development"}