{"id": 398140, "author": "swhitenstall", "title": "ABC of Governance", "url": "https://cardano.ideascale.com/a/dtd/398140-48088", "category": 26441, "amount": 10135, "description": "No consistent community provision of governance training and research materials in Cardano", "f6_no_assessments": 7, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "In my opinion this proposal could drastically improve the quality of research and academic paper in the Cardano community, also if there isn’t specific challenge that supports governance research.\nThe proposal solution “ABC of Governance” will produced: Short summaries & soundbites of governance concepts, full presentations & workshops at After Town Halls and continue to maintain of Ekphrasis GitBook & updates to the Catalyst School website.\nHowever the objective of the proposal is very interesting and it’s good for growth the blockchain adoption, but I think it's important to enrich the proposal with other kind of support for users and related functionalities.", "q0r": 4, "q1": "The proposer to have the necessary experience, because he’s an active member of the Catalyst School . He currently develops, maintains documentation and provides technical project management support for Catalyst Swarm, Catalyst School, Catalyst Circle, Community Governance Oversight, Audit Circle & Eastern Town Hall.\nRoadmap and milestones are described. The budget’s information provided is described\nEkphrasis Gitbook has funded in Fund7 and has a complete roadmap described in the proposal.\nThe budget is very well described and cover all the realization activities.", "q1r": 5, "q2": "The metrics for the assessment are given: quantitative (update period, …) and qualitative (increased engagement in academic & philosophical issues, increased engagement in governance changes in Catalyst, …)\nThere aren’t a lot of KPI to identify the proposal goal, but ok to complete assessment.\nThis propoposal continues and expands upon the F7 Ekphrasis Gitbook proposal.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I appreciate that this proposal identifies jargon as a communications issue. While it can be an effective shorthand between people who are immersed in a subculture of specialty field, it also tends to present an uninviting facade to those who could be persuaded into crypto generally and Cardano specifically. Not only that, but certain words have effectively become marketing buzzwords. A user-friendly lexicon, alone, would be a welcome addition.\n\nAs Cardano distinguishes itself in part through its embrace of academic rigor, accessible discussions and analysis are important for both maximizing its value and limiting the shenanigans and fraud that can be buried behind walls of specialized language.\n\n", "q0r": 4, "q1": "With Ekphrasis, the proposer has effectively demonstrated all of the necessary skills to tackle the subject of governance. The main risk with regard to feasibility could potentially be the proposer spreading his efforts too thin between maintaining support for the F7 aspect of his project while taking on this new subject. The proposer may want to mention what happens to F7 era maintenance and support once Fund 8 begins. \n\nThe proposer identifies lack of engagement as a potential but unlikely risk factor, and I'm inclined to agree. Governance and DAOs are a very hot topic in the Cardano community, with no shortage of complex and confusing concepts in need of explanation and elaboration. ", "q1r": 5, "q2": "As this project has very tangible deliverables, there should be few obstacles to auditing it. ABC of Governance will inherit the QADAO auditing process that was used for the Fund 7 Ekphrasis GitBook proposal. \n\nThe qualitative goals will, of course, be more difficult to measure, though they serve well as statements of intent for the project. It could be helpful for the proposer to test the content with curated audiences consisting of people with different levels of technical knowledge and academic achievement since the breadth of the audience seems important here.", "q2r": 5, "assessor": "z_assessor_1251", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This is an excellent proposal coming up to address the challenges of providing a range of academic and philosophy materials. In the proposed solution, the proposer explain clearly about the context of coming up this idea, how it supports for community in standardizing their information. The intention of the proposed solutions was mentioned clearly by the proposer and how it serves to the beneficiaries. One strong point of this proposal is the case-studies which is going together with the explanation to let all readers understand easily. \nIn the proposal, information about how the project will be implemented is quite clear, which including both quantitative and qualitative expectations for results. Based on the proposed solutions, all indicators will be solved for the project’s matter. After the project completes, the proposer has written clearly about what they aim to get. The continuation of a lively community conversation is the interesting end picture. \nRisk is considered well by the proposer on how to let Catalyst members engage more. However, the proposer already provide the successful case-story where positive feedback has coming up in reality. With that evidence, audience can understand that risk has low possibility to happen and affect to the project \nThe project seemed to be a part of continuous project to enhance Cardano ecosystem. So the proposer can add some explanation about the linkage or connection will support for the sufficiency of this proposal", "q0r": 5, "q1": "The roadmap was developed and mentioned by the proposer already. Checking it, we can understand what the proposer want to do in concretely. However, it it is better to add some more information about how the activities are going to be implemented.  \nThe strong point of this proposal is such a very detailed information about budget for each activity and how the payment will be done for various items. The proposer already clarify the payment in not only for human resources but also for logistics or documentations. The details will help all participants follow the process easily and make it be more transparency. \nIn the proposal, information about the team member was provided very detailed. The allocation of the person who has practical experiences in implementation as well as currently under similar tasks will create the favorable conditions for implementing the project.  ", "q1r": 4, "q2": "The project’s end picture is mentioned well by the proposer, when it will be continuously monitor in another project which attached with this proposal. With the quantitative and qualitative results mentioned in the proposal, the audiences can trust more on the transparency and accountability to the project although fund is not big. \nWith the clear ending picture, it will support proposer not only to get fund but also play as the foundation for the next proposal which aims to work deeper on the project after this success.  \nThis proposal is a continuation of p previously funded project in Catalyst since 2021. So, this will be the supplemental of last project, to cover more range of people and sectors. ", "q2r": 5, "assessor": "z_assessor_1655", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has brilliantly executed the plan in ABC manner, since their is minimal research materials available on cardano community, which are mostly outdated ,with outdated data people mostly show less interest towards the data provided.\nHence the proposer wants to bring an idea where consistent Research and publishing of materials will be done , proposer wants to even set up workshops where interested people can join, and Continued maintenance of Ekphrasis GitBook & updates to the Catalyst School website is also a brilliant idea to execute hence this proposal effectively addresses the challenge.\n\n", "q0r": 5, "q1": "Since Ekphrasis GitBook has been providing this useful service since June 2021, it won't be much difficulty in maintaining the GitBook with the team provided.\nStandalone summaries & soundbites posting on social media can also be done consistently, where it doesn't require multiple people to do such task , the main challenge is for the research team, i.e to get the latest news of cardano  community to publish to the people.\nThe workshops also includes mainly presentation ,facilitation and documentation over the governance which can also be implemented successfully without any barriers therefore with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has explained clearly regarding all the aspects of ABC governance, where it begins with summaries , work shop and maintenance of GitBook.\nProposer has provided Timeline and Budget break down in best way that is possible, proposal also contains excellent key indicators to measure the success of the model,it also contains some of the previously maintained Gitbook links which are quite extraordinary hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal, in my opinion, is right for the miscellaneous category. I was going over the challenge list again, for the 1000th time now, trying to determine this. At first I was thinking onboarding new members but feel that anyone who would be using QA-DAO's Ekphrasis GitBook, or the Catalyst School is likely already a member or involved in the space. Sure maybe a new YouTube subscriber may relate to a new community member, but this proposal along with the proposers existing work is more of continued  education of members already in the community. If a proposal falls into the misc category, then that begs the question of maybe a new challenge for the next funding round? \n\n   It is hard to effectively address miscellaneous, and this project surely falls into a pretty specific area and that would be education. I am not familiar with all of the fund rounds, so that may have been a challenge in the past, but if not it sounds like a pretty good one to me. \n  Education is key to the success of anything and is important for completely new people to the space and also your crypto veterans. The team involved appear to be very passionate about the crypto space in general, and with the recourses that will come from this proposal will be very valuable for the ecosystem and I might add time saving for a developer or researcher.   ", "q0r": 5, "q1": "The proposal is very practical in what it wants to achieve and the budget it expects to need for it to succeed. The team appears to have been adding value to the cardano community for quite some time, before there was a resource to obtain community funds for a project. They successfully implemented a funded proposal in fund 7 Ekphrasis Gitbook. It is a collection of information about Cardano and the blockchain as a whole. It is definitely more geared to information about the cardano ecosystem, and not just a generalized crypto website. The Catalyst School is another website that this team is involved with, and besides its hard on the eyes UI, it seems to be a good place for people to form a community and learn, and teach on the topics of decentralization. They did mention an issue of lack of engagement within their projects, but this is a problem I believe will be fixed over time. New users are entering the space faster than ever before. The team has gotten off to a good start and  will only continue to improve these recourses if the the proposal receives funding.", "q1r": 5, "q2": "This team is very active in the crypto space, and the amount of value vs the proposals budget is a very fair one. They gave a very detailed budget breakdown, along with a concise roadmap. The team is very much in line with the values and academic approach that cardano is built upon. They have a presence on many social media platforms and seem to be very open about discussion and i have no doubt that they would be willing to communicate with the community if anyone had any questions about how their projects are going. This team is obviously passionate about crypto and decentralization, and I have a feeling that they would be happily doing most of these things regardless of this proposal. There is no reason they should not be paid for the huge value they add to the cardano community.", "q2r": 5, "assessor": "z_assessor_1959", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Provinding structured training and material about governance in Cardano and its concepts, alongside with research, is a very valid and necessary idea, specially as the ecossytem is growing really fast. \nNowadays, the information are mostly spread around many sources, in pieces, and some of them are even tacit.  Proposer addresses this problem in a solid manner. Moreover, I also agree with this proposal being allocated in miscellaneous as there is no specific challenge for governance yet (maybe this can be a challenge in the future).\n\nAs to the proposal itself, it is really clear the scope of it, divided into 3 major parts (A - summaries and shortbites, B - presentations and workshops and C - Ekphrasis GitBook maintenance). It is also provided enough details in each of this 3 topic on what is going to be done or developed - and how. it would be nice if the presentations in B were recorded so anyone can reference to at anytime. It also imporant that all this content is advertised and easily accessible in catalyst and cardano webpages and forums.\n\nChallenges and risks are correctly identified.\n\n", "q0r": 5, "q1": "There's a detailed time-framed plan, with acitvities and deliverables broken down by  month and project part (A, B and C). With this plan, it is possible to see when and how they intend to deliver each piece of the project.\n\nBudget breakdown is also well done, broken by type of activity that matced the plan. It is also provided how many hours will be spent in each, which makes it more transparent. Project consumes only 2% of challenge budget so it is not an expensive one.\n\nAs for the team, there's one committed person with experience in Cardano, quality and project management, which seems enogh for this proposal. Catalyst school is also part of this proposal, and, from its historic, it will certainly help a lot the project to be implemented.\n\nAll in all, I see great chances of success for this proposal.", "q1r": 5, "q2": "There are good kpis proposed, most of them with target. However, some in quantitative section seems to be written more in a qualitative manner, which makes it hader to measure. For instance, \"Promotion, engagement and communication on social media\" this is more an activity than a kpi itself. It could be turned into number of posts (promotion) and number of comments and likes (engagement) in social media.\n\nI also liked the qualitative succes criteria but it would be nice to have a way to measure them (else it will be too subjectve). Maybe measure the engagement of academic and governance discussion by using number of people accessing the github, attending townhalls or something in this way. The number of dicussions is hard to measure but the number of iniatives can be done. \n\nLast, I think it is also imporant to collect and measure the feedback from the community in the regard of the 3 project fronts (A,B and C), in order to evaluate quality and improve if necessary.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal will move Cardano further ahead on the road as the state-of-the art blockchain for decentralized governance, thus it is invaluable to the Cardano ecosystem. The solution statement shows that it has been well reflected and has a solid foundation that grasps the essential issues. This will also help to improve the scalability and intricacy of governance processes on-chain.", "q0r": 5, "q1": "Stephen is a valuable member of the Catalyst community, as ist the Catalyst School an irreplacable institution. The are a backbone of the community and will without a doubt provide positive output with this project. While the funds demanded are comparably low, they are at the same time well-justified and reasonable. The implementation plan is detailed and comprehensible and the contingency plan is well made. This proposal can be assessed vastly feasible.", "q1r": 5, "q2": "Since the proposers have reported reliably in the past, I see no reason to doubt the auditability of this proposal. Either way, the proposal checks all the boxes for good auditability: Clarity in both the description of the problem and the solution. Tangible milestones and both good qualitative and quantitative success criteria. A job well done!", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Provide governance training and research materials to the Cardano community.", "experience": "----------------------------------------------------------------------------------------\n\nStephen Whitenstall (QADAO) and Catalyst School - For further information see details of team members below"}