{"id": 398275, "author": "cenkner", "title": "Cardano Learning Conversations", "url": "https://cardano.ideascale.com/a/dtd/398275-48088", "category": 26441, "amount": 15840, "description": "There's a communication gap between end users and developers. This gap prevents potential stakeholders from getting fully involved.", "f6_no_assessments": 5, "f6_rating": 3.4, "videos": [], "media": [], "f6_assessments": [{"id": 638, "q0": "The suggestion here is the production of 12 video podcast episodes where the proposer invites guests to explore interesting topics within Cardano with him, and the proposal includes a possibility of expanding out into additional audio podcasts.  Pretty simple concept that aligns well enough with the challenge setting, but I have to admit that this proposal is my darkhorse for being one of the more interesting and viable options in this funding category.  For starters, the proposer seems like a pretty interesting guy.  In my interactions with him he has had an infectious curiosity, and watching his videos and presentations, he seems like he could be a good interviewer as well.  This may be a function of his experience as a teacher, because it seems like he balances listening, learning and engaging pretty well.  He also comes across as quite gregarious, maybe most comfortable when he is communicating and connecting with others.  I'm not sure how impactful his early interviews and guest could potentially be, but over the 4-6 months that he is proposing here, I could see a pretty steep rise in that \"impact\" factor being possible.  And with the number of ideas he is pursuing in other proposals, especially the SSI space, there is no doubt he will not run short on interesting ideas to cover any time soon.", "q0r": 4, "q1": "Based on his current videos, I would say the proposer knows his way around the toob well enough to get off to a good start here, and we have already talked about his credentials and how he carries them.  It doesn't sound like he has any intention out of the gate to expand his team, but it is a consideration for widening the coverage of the show if he finds success.  The budget breaks down to around $700 per show, which is a bit high for such a simple format, but it isn't beyond reason, especially when you consider that he may end up adding audio podcasts to the deliverables, which would pretty much halve the rate per show.  12 shows over the planned four months works out to less than 1 a week, so the pace doesn't seem too hectic.  He has noted the risk that I stated above, that early episodes of the show (and he worries it might be a problem that persists over the life of the show) may not be able to draw what he calls \"expert guests\" in order to fully explore topics knowledgably.  He suggests starting out with topic where he has more background and can lend his own expertise, but I have another suggestion for him, or advice really.  Victor Hugo, a French master of Literature, said that if you were to capture the truth of the simplest, lowliest man and tell that story, you would have an epic to end all epics.  You do not need an expert to dive into difficult or complex subjects in order for it to be engaging and interesting, you just need a desire to hear and explore someone's truth, and the topic is just there to help do that.  Cardano as a worthwhile subject for a podcast is possible because Cardano can change people's lives.  SSI can change lives.  An immutable ledger can change lives.  Self-verifying governance protocols can change lives.  And unless I miss my mark, that was like pulling the string on a chatty cathy doll, and this proposer is brimming with explorations of that topic, too.", "q1r": 4, "q2": "The project is divided up into clear phases and the first is to obtain and setup equipment, develop show protocols over the course of creating two episodes, while setting up social media channels.  Each of those steps could represent progress reports, and usage and social media statistics could start rolling in to baseline the KPIs going forward.  In the second phase, the videos should start being a steady release, and those deliverables will function fine as progress reports, along with growth trends in the KPIs.  Finally, the last phase where the project may expand or rollover into a new cycle can be addressed as a final report that assesses the success of the project and its viability going foward.  If my guess on the quality of this project is prescient, they very well could be looking to petition Catalyst for staff, better equipment and more content.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3040, "q0": "A podcast is being proposed which would suggest that this will fall under F8: Film + Media. The proposer highlights that since the podcast aims to “will engage with technical issues and the development community” it should fall under F8: Miscellaneous Challenge. I do not agree with this and believe that this proposal should have been submitted under F8: Film + Media as educational content via media will be produced. This proposal has the potential to “build bridges within the Cardano ecosystem” furthering the cause that this proposal should have been submitted in F8: Film + Media (FAM). \nGetting small business owners onboard to accept payment will be a major benefit as this will get small business owners and customers involved in the Cardano ecosystem. Improving the communication gap has the potential to get ADA holders to stake more and get involved in projects. The current ADA stake is 69.6% at this time of writing, source: https://pool.pm/. Wealth safeguard techniques will allow more people to move from fiat to ADA thus adding more liquidity to the ecosystem. If these proposed solutions are implemented it will allows more members and funds to flow into Cardano. ", "q0r": 1, "q1": "There are two team members but only links for one of those members are provided. The proposer’s background is in education technology and course development which is a great fit for proposal. There is a website (https://sites.google.com/view/michael-cenkner-portfolio) shows previous projects done. This website, however mostly shows screen shots with text for the past projects and only a few (2 out of 10(8 university level and 2 other work)) have links to projects. I would suggest that the proposer add links to past projects and the team member so that those can properly assessed.  \nThe risks and challenges introduced are identified and solutions are provided but they are not that relevant. Expert guests on a podcast is not a must. There are loads of material online from experts that can harvested and used for insightful podcast episodes.\nThe second risk is a bit confusing to me: “Over time a challenge will be the huge number of interesting guests and topics related to Cardano”. I think to propose this is a bit naïve. It is hard to imagine a huge number of quests standing in line for a newly stared podcast.  \nI would recommend that the proposer get in touch with other podcasters and ask them what risks they have experienced and how they have overcome them. I would suggest checking out this video https://www.youtube.com/watch?v=-osVNiP-ZX0 which outline “5 surprising things about podcasting no one is going to tell you”.\nThe proposer’s background and experience is a plus for this type of projects but the lack of reference links to previous projects and other team mate and realistic risks not identified leaves much to be desired.", "q1r": 2, "q2": "The budget on the pdf download is simple and clear and the KPI’s are easily trackable since most of them are numeric. There is no mention of a website, YouTube channel etc. so it’s hard to say where theses stats will be displayed or published. \nThe roadmap is clear and simply stated except for “Months 5 and 6”. From the proposal, I am unable to establish what is meant by “Transition to a wider project”. Also it is indicated that the team will be expanded. The proposer should indicate how this will take place. How many team members will be added? How will they get paid? What will be there roles?", "q2r": 1, "assessor": "z_assessor_1602", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3691, "q0": "By constitute a multimedia project that will be a venue for professionals, creatives, and the larger Cardano community to connect, collaborate and coordinate with other content developers will help everyone share knowledge among each other and this is a very good idea to gain knowledge about the system by discussing among each other as the sessions will be interactive. The proposer has uniquely identified a need for platform and has also worked towards the implementation which is impressive and this will attract a lot of people to get involved and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing a multimedia project and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 15840 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more buyers which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5001, "q0": "This proposal addresses an idea that is not covered in any other challenge. This proposal opens the door to more communication between people about Cardano. This communication will promote and push those in smaller towns, small businesses, or those who might otherwise be uncomfortable with Cardano to accept it, pushing the adoption more quickly.", "q0r": 5, "q1": "The team has a wide variety of skill-sets that apply well to the proposal. It would be interesting to know more about the teams background and history with Cardano specifically, as they will be teaching basics of this subject, per the proposal. ", "q1r": 4, "q2": "With learning based proposal, it is often hard to directly measure success. However with social media platforms, youtube, etc. it can be done by tracking new followers, watch time hours, etc. and that is what this proposal has stated. This appears to be the best wat to audit success for this project. ", "q2r": 5, "assessor": "z_assessor_1819", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5809, "q0": "I really like the problem statement: \"There's a communication gap between end users and developers. This gap prevents potential stakeholders from getting fully involved.\" I really do! Yet, the solution offered is basically a yet another podcast. The proposal fails to stand out, to defend its place among the multitude of Cardano-related media productions out there.", "q0r": 3, "q1": "Looking at Michael's website (https://sites.google.com/view/michael-cenkner-portfolio/home) it becomes obvious that he is involved with a little bit of everything. Paul's experience is briefly described but there are no links to check the background. Frankly, I'm not sure whether these 12 podcast episodes would be of any significiant quality, so that the production would in fact respond to the challenge set in the problem statement.", "q1r": 3, "q2": "The hard numbers are kind of vague. It will be a bit difficult to track and estimate the progress. The description of the proposed solution sounds like thinking-out-loud commentary that should have not ended up in the actual proposal. Next time, a little bit more meat around the bones please! Good luck.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Start a regular conversation-based production with wide community involvement, development-focused but bringing in various perspectives.", "experience": "Business automation, common and contract law, K-12 and adult education, website development, educational technology, media production, project management, and the arts. We actively translate between technical and non-technical audiences in our communities."}