{"id": 398381, "author": "andrewgoodwall", "title": "Young Cardano Entrepreneurs", "url": "https://cardano.ideascale.com/a/dtd/398381-48088", "category": 26441, "amount": 50000, "description": "Youth across the world are unaware of Cardano, the blockchain, and opportunities that exist, due to lack of credible video content.", "f6_no_assessments": 11, "f6_rating": 4.515151515151515, "videos": [], "media": [], "f6_assessments": [{"id": 567, "q0": "Really big potential for impact, if implemented successfully, the team´s user base could be game changing for Cardano´s ecosystem, Millions could be learning about Catalyst and could mark a before and after on Cardano. The proposal does in fact addresses the challenge objectives.", "q0r": 5, "q1": "The team and business behind seem perfectly qualified for the task proposed and showed evidence to  back it up. The budget and timelines makes sense, by the team size. If possible I would like more details about the budget breakdown.\n\"Program and challenges design, creation of challenge content $8770 \" Why that number, what is the reasoning behind it? Salaries, hour rates? \nThe proposal would also benefit by having a Catalyst or Cardano community member on board, maybe co-proposing or even in the team section. This would highly increase the confidence of Voters and CAs. Maybe the team are part of the community but It should be mentioned, maybe co-proposing with WADA, or Cardano4Climate would help.", "q1r": 4, "q2": "End project reports are a Great way of giving auditability to the community, the proposer gave clear and measurable KPIs, next time I would write when are these KPIs expected to be hit. Overall this project will be clearly auditable by the community!", "q2r": 5, "assessor": "z_assessor_1190", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1325, "q0": "The proposal tries to produce educational content about Cardano in various languages and formats, on the Goodwall platform. The proposal has articulated how they will achieve the purpose with the thorough plan they have ( Dialogue with Goodwall’s Student Council, Focus groups held regularly, among others) and demonstrate they can bring value to the Cardano ecosystem. The team also provides potential risks starting from lack of awareness to budgeting issues, however, the team has stated a reasonable way to overcome those challenges.", "q0r": 5, "q1": "The proposal has a roadmap and clear milestones for program preparation, program execution, and program results. The team provides a detailed and reasonable breakdown of how they will use the proposed budget (program design, partnership development, promotion, etc). The team also elaborates background and relevant experience on each people on the team and provide a LinkedIn profile for all member. The LinkedIn profile is very good to have since the community can easily verify they are giving funds to legitimate persons.", "q1r": 5, "q2": "Metrics for success are clearly defined by Impressions, Engagement, and challenge Entries. The team will also provide a project report which consists of project results and give an example of the report. The indicators of success are also outlined clearly by dividing Misc KPIs and Personal KPIs, each with measurable points.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 10738, "q0": "The proposers are a team behind app Goodwall - which serves to help young people 16-24 (that is their target group) with education, internships and jobs. It must be stated that they are already having this working product. Proposers identified problem, that young generation is not well educated about Cardano, and blockchain related topics, and they plan to solve it by creating a educational content, which will be made by users who will promote their plans, ideas. I think it is an interesting idea, given that community will educate community, and cardano can definitely utilize newcomers, who are already more educated, or more familiar even with catalyst (which is mentioned in the proposal, that one of their goals is also to invite young people to be part of catalyst).", "q0r": 5, "q1": "The team seems to posses all required skills, experience and there are also posted linked in profiles to increase the verification of their identity. \n\nThe timeline is divided into three main sections Program Preparation, Execution and Results, with related subsections, along with the estimated weeks. Even tough it appears that team based these on a relevant assumptions, for people not having more information, it lacks additional clarity e.g. section 1 - Preparation for 8-12 weeks - how much is expected for User Journey design? Is it one week? Or 2-4 weeks? \n\nThe budget of 50k, even tough it might appear detailed, and most likely calculated on some hourly wage - could have been paired to activities on the timeline.  e.g. first point -> Program design -> Program and challenges design, creation of challenge content -> $8770 - to what activities it is related? Is it related to the first two, in the first section User journey design and Promotional assets design? This part is unclear. At the same time, if you managed to calculated budget for one section, most likely based on the expected time spent, it could have been paired to the timeline, as mentioned above. \n\nAt the end of feasibility - since the plan is to use user generated content to create educational material, you need traction. But based on their twitter profile, there are only 3k followers, youtube channel posted video a year ago, which is actually making me less confident whether it can be implemented. My confidence was restored based on Instagram, 40k followers and the latest post 4 days ago, facebook 80k followers. ", "q1r": 4, "q2": "Based on the provided KPIs, I believe that it will be easy to audit the success of the proposal. An example of a report was provided, which contains a lot of useful metrics to verify the success as well. Nevertheless, these KPIs are checking only the traction/or a traffic on their platform, but what about the problem vs solution? There are no provided metrics to check whether we have increased education among young people. To mention one metric specifically - there is a plan that success will be also defined as a 2k video entries focused on Cardano. What can be added, is a metric to at least check the number of new people who joined Cardano/Cardano catalyst via the app. Or a similar cardano related metric, that would allow the verification whether the proposal success was actually beneficial to the cardano.\n\nWhat I am actually missing is auditability of the progress. Given the timetable and the plan, there is a lot of things to be done, but there is no mention how to check how is e.g. \"program design\" progressing, or how do we check how is \"comms and media\" progressing. I suggest that some weekly, bi weekly reports via some channels would be posted, or a blog about simple \"A week at Goodwall\" with some sections \"what was done\" would provide sufficient information. \n\n", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10744, "q0": "This is an outreach type of proposal that is looking to use a mobile video platform to help spread the word of Cardano through video and community engagements.  This could help move the younger crowrds to gain awareness of Cardano and help build the next generation of users, developers, and investors.", "q0r": 5, "q1": "The team is a relatively large sized team and they all seem to be qualified for the roles that they will be providing the team.  Developing the content and building a community to spread the word are challenging and can have some doubts into how they are executed.  The team has a solid plan outline, but there is little details on how some of the critical steps will be carried out.  ", "q1r": 4, "q2": "The team has some strong metrics on how they will measure success.  They also provide a rough timeline as well well how the budget will be broken down.  This proposal through execution has various metrics that they can be compared against to measure progress.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10765, "q0": "I don't think this idea aligns well with the objectives of the challenge, because in fact it fits better with the challenge of the mídas or even the new members on board, also launched in this fund. The proposal consists of creating a diversified portfolio with video content on blockchain, aimed at young audiences. Young people could also upload videos reporting their experiences with the cryptographic world. From what I understand, the objective is really to promote an exchange of knowledge and promote Cardano to entrepreneurial powers, technology students, etc. I think it's a good idea, but I would like to understand more about the differences between the Goodwall platform and youtube itself, for example. It is also positive that some prizes are distributed, which increases engagement. Another point that I think could have been cited better is some examples of videos/content that would be generated and promoted here. Therefore, I believe that in terms of impact, the proposal is neutral, in the scope of the challenge it is requested that proposals be posted here that do not fit with other challenges, although I think this one fits; it's still a good idea.\n", "q0r": 3, "q1": "This topic is perfectly fine. We know: very well what are the steps to implement the project; the roadmap is very well defined, activities are listed according to weeks and several are enumerated, so we have a deep understanding of the development process; it is also said in great detail the budget would be used, not only listed parts but also which small parts make up the larger part (for example in networking management, we know that it is about community management, moderation, engagement and support); We are also informed in a very detailed way who are involved, their names, their careers, previous experiences, linkedin profiles, etc., and with that, 100% confidence in the team is passed. That is, everything we need to understand the process, who are the professionals involved and how the money would be spent is very clear, generating a lot of confidence that it is a highly viable proposal.\n", "q1r": 5, "q2": "To measure progress, it is said that impressions and engagement will be used as parameters. We are also informed that reports will be produced (and an example of a report). However, will they all be in this format, or will different information be attached according to the phases? How often will these reports be posted and how will the Cardano community be made aware of it? I think the author is on the right track to audit the project well, but it still lacks detail. Talking now about final results, some numerical indications are given (1 million impressions, 30,000 appointments and 2,000 challenge entries) that say about the Goodwall platform itself. But this does not clarify how the reflection of this project on our blockchain would be measured. It is important that this is very clear, that we know how all this affected Cardano. So we have good and bad things here, and my opinion will be neutral.\n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10794, "q0": "This proposal is a good and complex learning implementation that could improve adoption on cardano blockchain for new users (students in details), because new users adoption and communication is a huge pain on Cardano Community. The proposal allow to overcome the lack of communication and the community engagement.\nAt the same time the statement of how problem is to be solved is well being specified with learning programs with inclusive video content that promotes education of Cardano.\nIn my opinion this is a good idea and very helpful, but there are many activities on Cardano Community and I think that there would need to be distinctive in the training program and in the content.", "q0r": 4, "q1": "The proposer is very well skilled about the whole context (communication and marketing skill, program management skill, social and design skill,…), but they don’t knows the Cardano community and seems that they had never worked with them. There are detailed link with the career of the proposer team (Linkedin profiles)\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be developed, milestones and so on…).\nIn my opinion the budget requested is high referred to the challenge (50k$), but coherent with the elapsed.\nThe proposer provides a detailed step-by-step plan for the production development\nOverall I think it’s difficult to define the complete success of the proposal.", "q1r": 3, "q2": "Success criteria is simple to identify and trace with key metrics to measure the success (misc KPIs and internal KPIs).\nI think that the successes and metrics are verifiable but that are very challenging (1M impressions)\nThe proposal  offers a  timetable to complete the work. The proposer has considered challenges and risks relevant to a successful adoption.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10796, "q0": "This proposal is definitely aligned with the campaign objectives and I do not think that it fits in any other campaign category. The proposal aims to promote Cardano Ecosystem and Blockchain technology in general to a platform that has more than 2 Million members of  young and prospective entrepreneurs. It plans to use the platform as a springboard to educate and onboard more users to the ecosystem with objective of greater adoption of Cardano ecosystem.", "q0r": 5, "q1": "This is a well  to articulated and well detailed proposal. The profile of the team shows that they are more than qualified to pilot and deliver this project. Every member of the team was detailed with specific responsibilities. The Milestones are well elucidated for the community to conveniently monitor the project development and activities in addition,  budget breakdown and analysis is well detailed and the cost is moderate and reasonable for a projects that the community will benefit in a long time to come. It is also imperative to mention that relevant risk factors had been considered with curated steps to mitigate them. Am more than convinced that this project will effectively implemented.", "q1r": 5, "q2": "The propoay has provided more than enough adequate and reliable KPIs and success metrics  for the Community to effectively monitor and assess the progress of this project. In addition to the fact, the platform is accessible to the community to judge by themselves, the progress made. The well articulated Milestones provided in my opinion, can also serve this purpose.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10888, "q0": "After studying the content of the proposal (including visiting the links provided) and downloading your app on my phone and browsing it, I must tell you: they are good, and I believe they are in a position to deliver what they promise.  And I say this from the position of someone who is not sympathetic to projects that stand on the shoulders of other projects to generate their own growth.  Unless they already have meat on the grill, smoking up the whole neighborhood. \n\nThese guys have the platform, they have the audience, they have the experience (they have worked with Unicef and Yoma, and if anyone knows who Yoma are they know that these people don't play games: they are in the hard business of finding a better future for young people).  \n\nThe user experience on the platform is pleasant: texture, speed, content, engagement, enrollment the first time ... pim pam pum, in a matter of seconds (and I don't like to wait in line unnecessarily).\n\nTheir target audience, the Gen z'ers, is an audience that the Cardano ecosystem is not paying enough attention to and is not being very ambitious about.  And that's a major strategic mistake. My eyes lit up a few days ago when I heard in one of the TH's (the East Asian community's IdeaFest Reels2) a young proponent funded in F6, proposing an F9 Challenge setting aimed at students, I thought I was listening to the most innovative idea in the ecosystem at the market level, only to realize that he, a 16-20 year old student, was also thinking like an old man, because he was referring to college students.  The question is: in this ecosystem we tend to get old? too many adult and brilliant ideas (discarding in this reflection those ideas that are just hot air that the system itself will end up depurating), too much search for the stevejobsian creativity, without space for the young stupidity from which eventually arise the outliers that shake the whole game? \"An exclusive challenge for young people between 16 - 20 years old, what a fantastic idea\".  Then, the clarification that it was for the young seniors of the universities.  Finally, the old questions of: \"how can you know that the person who is presenting himself in that category is really a student'\".  The short circuit in my mind was complete. \n\nI believe that the proponents have the tools and capabilities to deliver what they promise, with the infrastructure to execute a project like a challenge setting for true young people.  And if they deliver what they promise, they can potentially bring new blood to the Cardano ecosystem.  And if they bring new blood to Cardano, perhaps we can begin to realize that we are not in an old man's business: this is a business as young as the generations we are not paying attention to.  The complexity and current state of the world tends to overwhelm the consciousness and cloud the possibilities of a future that absolutely no one knows anything about.  \n\nAn important consideration for the voter to keep in mind: the proponents already have their own business, therefore, they already have their own concerns. Think of the proponents as potential good strategic partners in marketing, promotion and merchandising, not as Catalyst members involved in Town Halls or Cardano governance. Cardano would be their client, whose marketing budget would be $50,000 (total budget suggested in the proposal).  The evidence leads to the conclusion that the Cardano-proponent relationship will not go beyond those limits, which, from the position of task specialization, is quite efficient. So, no problem there.", "q0r": 5, "q1": "The activities in the Roadmap and the items described in the budget make sense.  The team member information also presents no difficulties.  Additionally, if you go to the \"About us\" section of their website, you will find information not only about their commercial partners, you will find information about institutional support provided by the European Union.    The thing is, these guys have a lot of skin in the game, so if they fail us, we have their address. But, I think we're dealing with professionals.  I recommend visiting https://youthshapeghana.goodwall.io/ to see a sample of their work and browse their app to get a greater perspective on it.  ", "q1r": 5, "q2": "At first, your description of key objectives in the \"Please describe how your proposed solution will address the challenge?\" subsection of the Impact section, based on engagement metrics, made me feel a cold proposition far from the passion of seeking together something higher.  However, after studying their legitimate motivations and the care with which they have developed their product, I came to understand that the suggested metrics are nothing more than a natural result of their business area and that such a situation does not prevent the development of a respectful relationship and common intention, in a meeting of ideas and common perspectives.  I conclude that the metrics are good, and being based on numerical results, the project execution can be followed efficiently.  In turn, if one reviews the report suggested in the url https://drive.google.com/file/d/1wyCjvMrHljOsA5C1dNwU2ps29-ULe9a5/view?usp=sharing it is possible to appreciate the wealth of information that the proponents are able to provide.", "q2r": 5, "assessor": "z_assessor_541", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10912, "q0": "The idea proposed is very laudable as the proposers have an already existing platform as leverage and expand Cardano/blockchain activities among the youth.", "q0r": 4, "q1": "The activities lined up and the action plan are implementable and team brings on board a very good experience to ensure successful implementation of the project.", "q1r": 4, "q2": "The project KPIs outlined by the proposes are very simple and concise to measure. This will enable monitoring of project progress without any difficulties. ", "q2r": 4, "assessor": "z_assessor_270", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10939, "q0": "This document presents a proposal that excites and inspires me, consisting of a variety of outreach techniques intended to increase Cardano's engagement with a key community. The problem they describe is universal to any Blockchain: a lack of awareness of the possibilities, and specifically of Cardano as the incubator for growth. Summarizing, I believe it is a proposal that, while it can be adjusted for a different challenge, meets the miscellaneous requirements, therefore I am in agreement. The metrics provided are aligned and one of the proposals' objectives that I find particularly interesting is that the funding allocated to this program will result in the submission of 200 new proposals in Catalyst by the end of 2022. In terms of impact, I give it a 5. Towards achieving success, I would suggest that they work with existing community groups such as Catalyst School, PACE and many others in order to compile the essential use cases.", "q0r": 5, "q1": "I believe that the team that prepared this proposal is a key part of GoodWall. They possess a great combination of skills and strategies necessary for this proposal to succeed. Indeed, I would have liked to see an advisor with a strong background in Blockchain and particularly in Cardano in the core team. Mainly because there is too much misinformation in crypto, and even more so when considering the position taken by the major crypto news portals with regard to Cardano. Regarding the implementation plan, I am able to discern that the team knows what it is doing and makes an appropriate distinction between the stages. It would have been preferable to read more about the educational content that they intend to develop, but I understand that perhaps the plan is to make preliminary analysis for defining the necessary requirements (in this respect, my previous recommendation becomes even more critical). I would like to add that Goodwall presents four additional proposals in addition to this one with exactly the same core team, although I can understand that they are an established organization capable of handling this work load, I would still like to know at least who will be the leader or project manager for each proposal since the skills and experience of this individual are critical. In regards to the budget, although several items have been broken down, they have been left at a very high level, making it difficult to make an accurate assessment in order to compare it with the objectives and activities to be executed.", "q1r": 4, "q2": "The team's expertise and professionalism are also demonstrated in this section. Each of the metrics is clear, easy to measure, and allows the community to monitor the plan's progress. They propose a reporting methodology based on their experience with previous projects. While \"200 additional entries to the Cardano Catalyst over the remaining months of 2022\" is one of the program's general objectives, I'm not sure if these proposals would come from Goodwall's core team or from people from the engaged community uploading proposals to ideascales as a result of this implementation; I'm left in doubt because it isn't listed in the metrics section. I hope that indeed the focus selected is to measure the second one. Congratulations on this initiative.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10970, "q0": "Proposal seeks to integrate young people to Cardano through goodwall, a platform to proivde knowledge and education content. Overall, idea makes sense as the target audience can bring a lot of value to Cardano community. People from the selected age (18-24) are choosing now what carreer path they want to take and having contact with cardano an catalyst now can help to bring a lot of professionals in the future to Cardano.\nThe goodwall platform seems robust enough to do this link, as content is seems to be available in many languages and formats (there's a demo video to showcase it).\nRisk strategy is well done, with 6 risks identified and having a mitigation strategy.\nI also think it makese sen to be in miscellaneous challenge since it is a potnetial solution to a mapped problem in cardano and doesnt fit in any other existing one.\n\n\n", "q0r": 5, "q1": "There's a sensible time-framed roadmap divided into planning/preparing, execution and results/closing, standards project phases in schedule. The only acitivity that could be more hilighted here is the marketing/adversitising part of the project since it is key to generate engagement in the platform.\n\nBudget breakdown is well done and matches the roadmap. it is divided into sorts of work packages with some acitivites trhat will be perfomed in each. To make it even more transparent, some hours estimations could be provided.\n\nLast, regarding the team, There are 7 committed people, with diverse capabilities, including project management, program design, entrepeneurship, product design and digital marketing. These competencies are very good for a project like this one. Their roles and linkedin links are also provided.\n\nAll in all, project seems feasible and I dont see any major risk or concern on feasibility.\n\n", "q1r": 5, "q2": "There are good kpis proposed, all of them with target, which is excellent. I also liked they define the meaning of each metric in advance and that a report will be provided when project is finished. It is important to include in this report the result of the survey that will be done in the last phase of the project. Moreover, it is also possible to extract milestones from the roadmap provided in feasilibility section. All in all, project is audtiable with the metrics provided.\n\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Encourage youth to become entrepreneurs on the blockchain via experiential learning videos, and connecting them to opportunities on Goodwall", "experience": "Goodwall is a mobile-first platform with 2M+ members across 150+ countries, guiding youth aged 16-24 through the world of education and work. Goodwall has hosted a number of wide-scale programs and challenges on the platform, with a recent program reaching 4.2M+ youth in Ghana."}