{"id": 398935, "author": "konmaorg", "title": "Cardano Food Forest - Permaculture.", "url": "https://cardano.ideascale.com/a/dtd/398935-48088", "category": 26441, "amount": 40000, "description": "Large scale adoption of blockchain solutions is not a reality due to its intangible nature & negligible integration in our social structure.", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "As an amateur in food forest designer and blockchain catalyst, I find the crypto-ecological system in this proposal intriguing with many merits in term of its impact. Firstly, its impact on prototyping a permacultural and food forest community sustained and connected to the mainsteam community via blockchain. From there, its open source and knowhows can help many existing or future off-grid communities to connect to the main grid of society through commercialization and value exchanges. And even more than that, connect to each others to collaborate on bigger projects with collective power. This will then address several main challenges preventing these types of sustainable communties to become a norm, and thus encourage even more sustainable communities to form. With this, it can pontentially change our social structure in a substantial way. Secondly, if successful, it would demonstrate clearly the power of blockchain and the Cardano ecosystem in forming and facilitating new ways of living and forming new social structures. However, I give the team only 4 impact, since the connection between the two sides, block chain and permaculture/food forest, even elaborated but not yet articulated in term of structure and technology. \n", "q0r": 4, "q1": "I find the team's profiles and extensive working history in permaculture and their existing land ownership (1 km2) substantial for the proposal. \n\nTo be honest, I am not an expert to know whether 495 USD for every 1000 sqm of land work, including design, earthworks, plantation, labour, accommodation, food and maintenance of the land during a 12 week period is reasonable or not. And I think many voters will have the same question. I suggest the proposer to break down this number and make a benchmark for voters to decide, especially considering two things (a) economy of scale doing this on a focused area of 80,000 sqm, and (b) the nature of permaculture that the land should in turn provide in short term and long term for its owners. \n\nFurthermore, I find it odd since there is no block-chain element/cost integrated in either that budget of US 495 per 1000 sqm or US 40,000 in total, considering this project is heavily focusing on developing blockchain as a difference and a base for development. Therefore, combining a lack of plan, budget, and measure of success for its core element of block chain, it is very hard to establish a sound foundation for its feasibility. Maybe the proposer should shed more lights in this in their next proposals. \n\nLast but not least, for clarity purpose, I also want to see how the team plan to continue this project after this 12 weeks of spending US 40,000. Would the land provide enough for them to continue, or would they need to acquire further to funding to survive? What is the big picture in spending that US 40,000 of the Cardano community?  \n", "q1r": 2, "q2": "As mentioned, combining a lack of plan, budget, and measure of success for its core element of block chain, it is very hard to audit and track down its core block chain element. Without that, this project will only become a normal permaculture project without any added values to the Cardano ecosystem. ", "q2r": 2, "assessor": "z_assessor_953", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The proposer is clearly pointing out a problem often thought about.  large adoption of blockchain solutions is not a reality due to its intangible nature & negligible integration in our social structure, and this is very true.  We see blockchain more on a technical basis with difficulty to apply it in everyday living. The solution proposed will help initiate similar projects across the world (solution: we need deep integrations into basic, everyday requirements & resources like food).  The KPIs of the proposal are aligned with those of the challenge and the project once implemented will definitely scale up cardano's growth.", "q0r": 5, "q1": "The team suggested in proposal has the experience to implement the project.  Links to the profiles have been provided for visibility. In the proposal a phase I is described during which the permaculture will be prepared.  Volunteers will also assist in implementing the project. The budget provided has been calculated based on the country's costs and was compared with professional estimations, therefore it is considered reasonable.  The implementation pf Phase I will take approximately 12 weeks and detail description of the work for each weekly block are provided. Risks and challenges have been explained and solutions were provided. In general, the proposer has provided enough information as to picture the amazing project.   ", "q1r": 5, "q2": "The proposal has been well addressed in the Miscellaneous challenge because it does not fit in any other challenge. A roadmap and detail timeline have been provided and KPIs are clarified.  I strongly recommend this proposal and I believe it will succeed.  I see the future of cardano in areas that we basically have never touched but most of all this project will also provide to the people by growing on cardano ecosystem.  I applause this project.", "q2r": 5, "assessor": "z_assessor_1434", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Nature things would be sexy discussion especially related with Technology that possibly have negative impact to nature and social living. I totally agree with this proposal solution to bring food as preferences. If Cardano funded this proposal fully, Cardano will be the game changer on Blockchain technology that supporting nature and help poverty. I would recommend this proposal after reviewing the expertise of the team on analyze the problem and getting more data to this proposal. Hope with this team capabilities could give more impact to nature earlier.", "q0r": 5, "q1": "I really believe this solution is a long term solution. But this proposal gives us more detail planning on how it will be done in the short term - in the baby step way - I really like this approach as collecting more and more data in the market pnetration is necessary in Product perspective. If I may give suggestion to the proposer, it would be nice if you also bring mid-terms on the milestone you already designed. this proposal also unique because can give us visibility to see the Vision behind the idea and concept.", "q1r": 5, "q2": "Bringing all the goals with subgoals are the excellent way to auditability process. The key matrix provided is also making sense and relevant with solution made based on the problems. There's one thing need to be added, it's the budget allocation to make this worked properly. Besides budget allocation in detail, I could say the auditability information is sufficient. Hope this can be fully funded soon!", "q2r": 5, "assessor": "z_assessor_1475", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Taking the 23 Challenge Titles into account, and having read their overviews, I find that this particular proposal fits best within the Miscellaneous Challenge category, as it is focused upon a unique real-life-use-case, which is sustainable farming. The farming method they are referring to \"Permaculture\" focuses greatly on ancient farming wisdoms, and a deep understanding of integrated farming practices such as crop companions, soil building, watershed design, and nature-drive pest control. All this coupled with the use of the Cardano ecosystems in order to decentralize and manage the activities, as well as grow a community around the concept. They also discuss integration with Food Traceability... my experience in Food Traceability is that is is usually undertaken upon Managed Blockchains, and in accordance with Government regulated SOPs. It would be great to decentralize this process.", "q0r": 5, "q1": "Starting with the Problem statement, I can understand that Blockchain Solutions for farming / food are currently \"intangible\" for the masses (both from a supply and demand side). We do know however, that the decentralized ledgers are the tangible technology of choice for data driven infrastructure. As such, utilizing the Cardano infrastructure in order to create a decentralized Food Traceability and Decentralized Permaculture farming Community & Food Processing Plant is surely exciting... as it is simply lacking at the moment.\n\nLooking at the Solution Summary, I agree that deep integration into basic everyday life holds vast potential for this concept. As such, I'd like to know more details about how this project intends to utilize Cardano sphere. I would also like to know more about what Web2 solutions this project aims to have for the non-techy crowd (which in this case would make up the majority of the target market).\n\nFrom a \"Relevant Experience\" perspective, I've checked out the partner entities that are involved in this project. Humm of the Earth are well integrated into the Permaculture and farming community. They are fluent in Permaculture Farming, Aquaponics, and Off Grid Living. They offer learning courses, design consultation, and project development. Their materials are on YouTube, Skill Share, Udemy, and The Better Academy ( good reach). With over a decade of experience, they seem to really be experienced professionals within the field. KONMA are an interesting partner. They are set up on various social media platforms such as Twitter, GitHub, Telegram, Discord, and others. From a technical perspective, they seem to have a good start. Their Marketplace is nicely structured. However, their market offerings are debatable. Their 32 food items are very niche, e.g. Mint Cocoa Nibs, Sprouted Greens... They seem to be focused on high-end specialty foods that are processed. This may bring in more of a profit margin per item, but I believe they would benefit greatly from having a couple of mass-market items. As to their Lifestyle offerings, they are definitely in need of upgrading, as they do not give even the basic amount of information required to make a commitment to their programs. Having said that, I see that this project may help them in making more mass-targeted offerings, both in food items and in lifestyle offerings.\n\nRegarding the impact of this project, I find that the overview paints a pleasant and value-adding vision, namely blending Ancient Farming Know-how with CARDANO-Tech. They also mention that their entire project will be an ADA-based solution (I wish they said a bit more about that).\n\nThe Land ownership part of the project has not been addressed to my satisfaction... what was mentioned is that they would have \"Guardianship\" over the land, and that  Mr. Suray of Land Bank Trust is making this land available to them in the Southern part of India. More clarity on this point is important, as it is vital for the sustainability of the project. \n\nUnder impact, they also mentioned that this project would benefit from the close proximity of a government proposed food processing corridor, as they have \"influence\". I am intrigued, but there wasn't enough information about this point.\n\nHere I have an unanswered question... what is already on the land? Any assets, infrastructure, trees, etc...?\n\nOne great point is that the project is highly scalable. From the micro perspective of the plot of land, this project is going to start by developing about 10% of this plot of land. From a global perspective, they have chosen 2 partner entitles which themselves have global expansion potential... and this concept is also copy-pasteable elsewhere. Amazing scalability.\n\nTheir Present Plan shows a good design process, which they broke down into \"unpredictable energies\" i.e. nature-based inputs.\n\nThey also have good sector analysis and tie ups to permaculture zoning best practices, as their plans include the required diversity of natural life (bees / mushrooms / seasonal plants / local plants / free ranging poultry (for natural pest control). They also have a Community Kitchen for the local community aspect of the project, and a Processing Center for the commercial aspect of the project.\n\nThey hold strong understanding of the Earthwork dynamics... which a re vital for the infrastructure of this project.\n\nAs to their future plans, it is nice to see how they have divided produce into raw for local/community abundance and sustainability, and processed for commercial sustainability. \n\nBreaking down the land into 1 SQM NFTs is okay, if they offer them up in bundles, as I believe that 1sqm in the scale of this project is just to small.\n\nI am intrigued as to how the they will use CARDANO for Food Trackability that is tied to government SOPs. They mention Blockchain tech integration at the grassroot level. This would be great... but is sounds more like a vision that an actionable plan or roadmap.\n\nThey are also looking at the tokenomics of their concept from a practical point of view. However, first they motioned ADA, then tokens... clarity would be nice here. \n\nTheir feasibility is well structured. Their timeline items are good, but 4 weeks for design and 3 for Earthworks? I think I'd flip them (unless there already is a good base to begin from on site).\n\nThe budget of US$ 495 for design, earthworks, planting, and labor is good... but they also added accommodations, food, and maintenance. By accommodations do they mean renting, tents, or building something new? And maintenance is a post-initial-setup running cost... I believe it should be separated. \n\nOverall, I find they are more than competent to implement their plan.", "q1r": 4, "q2": "I have listed the points which may benefit from more elaboration in the previous section. The team has over a decade of relevant farming and tech experience. Their farming experience is local (within the region of the project) which is of great value from an agricultural perspective. Their chosen partners are  a good match for each other, as they complete one another's offerings. I ran a discovery farm and an agritech consultancy for decades, having experienced a vast number of business models, agri-technologies, and setups... these guys have a wonderful project structure which makes the best of old and new tech, and that is globally scalable.", "q2r": 4, "assessor": "z_assessor_1793", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "To overlook the intangible nature of blockchain solutions, we need deep integrations into basic, everyday requirements & resources like food", "experience": "With more than a decade of Permaculture teaching, designing & consulting, Azlan started \"Humm of the Earth\" and has transformed acres of barren land into regenerative food forests. Konma's Founder Vinay with his Blockchain expertise & team will help establish necessary solutions."}