{"id": 398900, "author": "sergio.sp", "title": "ALMAGUA - Every ADA trap CO2", "url": "https://cardano.ideascale.com/a/dtd/398900-48088", "category": 26441, "amount": 28000, "description": "Current projects to offset co2 are developed in ethereum but do not take into account the high energy cost in creating blocks.", "f6_no_assessments": 3, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "I believe the idea is good, but it is still explained in a somewhat confusing way. In general, the ALMAGUA group wants to promote carbon offsetting (that is, the amount of pollutants that were generated will be rewarded with a way to clean the atmosphere, as I understand it), both for people and institutions. The argument of the problem situation is that this type of process is done on the Ethereum network and in itself already generates a lot of pollution, which is a fact, and Cardano would be a much more suitable blockchain for these NFTs to be minted and cleaning process atmosphere takes place. As I understand it, people/companies would purchase a CO2 removal voucher, and trees would be planted. Each voucher would generate an NFT. Some parts of the proposal are quite confusing, such as the following explanation: “ALMAGUA will collect data from solar-powered fishing boats and conservation of mature trees through the collective adoption of NFT trees. For each tree adopted, the non-fungible NFT token is received on the cardano blockchain”; what fishing boats will these be? How do they relate to the trees that will be planted? I concluded that trees would be planted because of the passage “in the processes of measuring the footprint in forest conservation or planting cataloged species, we want to implement an Environmental and Economic Accounting System to legitimize the records in the carbon offset markets (...) ”. In this case, it is not so clear whether these trees would be planted or whether they are specimens that already exist but are being adopted, sponsored. It's all a little unclear. I think the proposal relates well to the challenge as it doesn't really fit the scope of any other challenge in the present fund; perhaps if the application were better specified it could fit the challenge of the Dapps or the National Building Dapps, if it were specified in which country this project would be developed and how the local community would benefit. As for whether this would benefit Cardano or not, I believe so because of the NFTs that would be generated and processed on Cardano's network (hence, they would be CNFTs), however, I really wish that part of the proposal had been clearer. With that, I conclude that: it's a good idea, it's not so well explained and it's not so clear how it could have measurable consequences for our blockchain, so my opinion on the impact will be neutral. \n", "q0r": 3, "q1": "Several activities are reported, such as “Creating nft for tree adoption”, “Testing the prototype of the solar boat and the smart meter (...)”, “Creating NFTs with Carbon Neutral Certification (...)” and etc. . According to what is said, all these activities would be developed during that year, being delivered in 2023 when DAO would begin to be created. I think the schedule is even satisfactory in terms of being informed about what would happen, the activities are well explained, the level of detail is sufficient for us to understand well what is to come. The problem here is the timing issue, I think it's inappropriate for proponents to just leave these tasks assigned for the whole year. It would be important for us to know what is planned for each month, so we would have a much more accurate view of the process. That is, the script is just ok, it's not the way it should. The budget explanation is superficial, in my opinion, because the total amount is divided into parts that are not explained. For example, “-$Amazon AWS 1500 USD x year”, what is that, and why would it cost 1500 USD per year? “- $1,535 USD Facebook Ads”, how many ads would there be, and who would create them? How often would they be released? I think all parts of the budget needed a more precise explanation, especially the “-$Structure Development-15,000” part, which would cost the largest portion of the total amount. I believe that here are the salaries of the professionals involved, so I think it would be interesting for us to know what their work routines would be like, daily hours dedicated to the project and so on. Speaking of them, the professionals involved, are given very little information about the team members. We only know their names, what professional role they play and also linkedin profiles. It is not explained in detail what they have done so far in their professional lives and how they interact with the Cardano ecosystem. Therefore, I think that the feasibility of the proposal is not good, all topics (script, team and budget) should be better developed; especially the last two. \n", "q1r": 2, "q2": "The auditability of the proposal is average in terms of the process. I think this is because the proponents tell us ways to monitor the process - for example, the budget will be present in an open book, they also indicate an estimate of how long the application prototype will be developed and so on. I think the amount of measurable information is satisfactory, but what I think was pending was: 1) to explain more directly how the community would have access to such information 2) to determine shorter delivery times, for example, lower than 6 months mentioned, it would be interesting to have more specific metrics than a semester 3) I would also like to be informed of some way to follow the daily work of the professionals involved, that is, what would be behind the partial results delivered. Turning now to the final results, I think that this part left a lot more to be desired than the previous one, since all the proponents claim as a success scenario would be “the development of the prototype to be able to measure and certify credits”. is quite abstract information, I would like more objective and specific ways to understand if the application was successful, and if the expected environmental impacts were achieved as well as the benefit of the Cardano ecosystem. It would be necessary for the team to carry out a study, to understand how the users of this application would be contributing to improve the atmospheric scenario, if the desired CO2 offset actually happened; and regarding Cardano, it would also be essential to have well-defined ways of measuring the consequences of this project for our blockchain. How to verify if those involved have become active members of the community? Somehow, they started to relate more directly with the technologies gies of our blockchain, such as our currency, other NFTs, have they created digital wallets or switched to using other Dapps? Anyway, it is very unclear how success would be reflected for Cardano, which in my view is the main metric that we should consider. So I think the feasibility of the process was going well but in the final scenario part the situation leaves a lot to be desired. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal tries to create ALMAGUA, which will collect data from solar-powered fishing boats and mature tree conservation through the collective adoption of NFT trees. I found the idea interesting and can add value to the Cardano ecosystem. The team also has a prototype design and a patent. The team also provides potential risks that are the development of DAO and the certification process, but the team has several solutions that can overcome them.", "q0r": 5, "q1": "The proposal has clear milestones but lacks a detailed roadmap to achieve those milestones on a specific time horizon. It can get better if written like this, finish the prototype of the solar boat in the first three months, test the prototype following months, listing of Carbon Neutral Credit Tokens on the Cardano Marketplace the following 2 months, etc. The team provides a very detailed and reasonable breakdown of how they will use the proposed budget, from the AWS server to the panels and cables. The proposal stated the roles each team member has on the project and their respective LinkedIn profile. However, it would be better if they also provide concise information on the background and experience of each team member so the community can have a glimpse of who is the proposer.", "q1r": 4, "q2": "The proposal provides some milestones/deliverables to track the progress. However, it is better if they write the milestones on points rather than a paragraph. The indicators of success are concise and clear, that is the prototype can do measurement and certification of credits, however, it would be better if they also state how they will report on the progress to the community.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This proposal describes a problem statement and solution (carbon offsets, carbon market on cardano) and is very similar to another proposal by Luis Restrepo @larestrepomu https://cardano.ideascale.com/c/idea/400756\nThis proposal contains a great idea for a carbon market, however very little detail is provided on how this will be achieved. ", "q0r": 4, "q1": "The proposing team has said in the feasibility section \"Creation of NFTs with Carbon Neutral Certification through valid entities in Colombia.\" however, there is no information provided who these valid entities are, or how they will achieve certification, and what that process will include. There is no discussion on the fungibility of these carbon credits with the carbon credits of other marketplaces. The key team member involved with both of these projects has \"11 years of experience in Petroleum refining focused on Manufacturing Execution Systems\" (from linkedin profile) and it is not clear how this qualifies this team to create a carbon offset market. The proposal goes on to say \"We want to implement an Environmental and Economic Accounting System to legitimize the records in the carbon compensation markets\" But the website linked to in this proposal does not have working social media links or information about the team behind the company. I would suggest to the team that they first determine the details of how the certification process will happen, what organization will be doing this, and including this in the proposal. The creation of a $10,000 prototype for the solar fishing boat is another great idea, however it would probably work better as a separate proposal. It's not clear what the fishing boat project has to do with a carbon credit market. ", "q1r": 1, "q2": "The team has provided a roadmap with several different ideas and projects included, but it is not very clear or coherent. They have provided a budget breakdown with many specific items such as \"cables to convert direct current to alternating current of 120 volts - 50 USD\" but a cable does not convert dc to ac, that would require a transformer. The budget also includes \"Security audit and maintenance 500 USD\" which I believe to be a large oversight... I find it hard to believe a carbon market security audit would only cost 500 USD. For reference I have included a few links in regards to the Colombian carbon credit market. https://www.business-humanrights.org/en/latest-news/colombia-carbon-market-watch-launches-the-report-two-shades-of-green-how-hot-air-forest-credits-are-being-used-to-avoid-carbon-taxes-in-colombia/\nhttps://www.cercarbono.com/en/nosotros/\nI would encourage this team to focus their efforts on providing specific details about the certification process, so that catalyst investors and nft buyers can understand exactly what they are buying, and how they can be sure they are legitimate carbon credits. \n", "q2r": 1, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "ALMAGUA will introduce NFT bonds with carbon offset credits in the Cardano markets.", "experience": "My name is Sergio Gonzalez, I am a publicist with 4 years of experience in social branding with the Almagua Foundation for resource management through social and environmental campaigns."}