{"id": 399026, "author": "dimitri777", "title": "Solar powered Stakepool Sri Lanka", "url": "https://cardano.ideascale.com/a/dtd/399026-48088", "category": 26441, "amount": 90000, "description": "There is no stakepool for Cardano in Sri Lanka. Cardano holders stake with Binance. There is no local option to support local communities", "f6_no_assessments": 4, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Re: Problem statement - a quick online search reveals that there is a stakepool in Sri Lanka - CoinCeylon.\n\nRe: Proposal impact, my perception is that the proposal is trying to package too much into one project.  You're asking for Catalyst financing to a) procure hardware to operate your own stakepool, b) develop/operate a website to monitor and provide analytics on stakepool operators, c) create a use case for solar powered stakepools, and d) run marketing campaigns targeting cardano awareness in Sri Lanka, which partly involves launching a native token to incentivize referrals.  The ideas are interesting, but practically unrelated.\n\nWhile I don't dislike the proposed ideas, I'm leaning towards disagreement because the proposal isn't focused enough, and therefore voters will be unable to selectively support your initiatives.\n\nI believe you could be more successful by separating the ideas from this proposal, and asking the community to review, then support each initiative as an independent project.  Alternatively, you might consider to revise the proposal to explain in more detail how your initiatives are directly related, to make it feel like a more unified project.", "q0r": 2, "q1": "The proposal does provide for time/financial resources which I believe are overly sufficient for accomplishing the proposed plan.  However, I think a more important question is whether or not it is appropriate for Catalyst to finance stakepool operators at this stage - and simply for the purpose of providing geographic diversity.  While the team seems sufficiently large enough to execute the project proposed (perhaps even oversized), there are multiple comments in the proposal about fixed time commitments (maintaining the website, setting up and maintaining the stakepool), and it's unclear what happens after those commitments are completed.  Perhaps continued operation could be supported by the fixed/variable income from stakepool node operation, although the proposal does not clarify the fee model for their proposed stakepool.", "q1r": 3, "q2": "Other than measuring the success of this proposer's stakepool at attracting local stakers, as well peripheral benefits presumably earned through building value in a native token distribution aimed at incentivizing referrals, the auditability section completely forgets to include the solar element which was detailed earlier in the proposal.  In any case, the proposal seems aimed more at personal gain rather than community expansion.   And any positive outcomes regarding solar use case are shadowed by the up-front price tag for that system, and no evaluation on the economic model or cost saving value to run that system - especially as an independent, single pool set-up.", "q2r": 2, "assessor": "z_assessor_1224", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer wants to build a stakepool in Sri Lanka powered by solar power. The reasoning behind this proposal is that there is no native Sri Lanka stake pool and that is why the people stake with Binance. The voter should know, that Binance offers close to two times higher rewards than the native staking on Cardano, maybe that has something to do with the people staking there. I’m not advocating it, everything has a price and being outside of the blockchain has lots of risks. Anyway, the proposal is for a local stakepool in order for the local community to move out of Binance.\nIn the impact part of the proposal there is a huge explanation without any fact check on the text that is there. For example: “Cardano’s staking pools allow people to delegate their stake to a manager, who collects stake from multiple individuals then decides which validators to delegate to.” Why this text exists I could not tell you since there is no connection with the creation of a stakepool. Following down the text things really get out of sync and make no sence.\nI suspect the proposer has multiple proposals in this and previous funds and he pasted parts of another proposal in this one. I have checked my suspicion, the proposer has more than 20 proposals in fund 8 alone.\nThis proposal could have been placed in in B2B challenge. \nI agree that this proposal effectively addresses the challenge.\n", "q0r": 4, "q1": "The proposer has no experience in the field of engineering and software development. According to his CV his main occupation is a translation company.\nThe proposer has more than 20 proposals for this fund alone. This worries me a lot.\nThe proposer is elected member of the Catalyst Circle v3.\nThe proposal has a road map divided into months. The detail of this complex endeavor is nonexistent. And the time allocated for the different tasks is, to say it mildly, insufficient. I’m making these comments as an electrical engineer with more than 12 years experience.\nThe proposed budget is broken down roughly, without real offers for the hardware that is needed. There is no mention for an expense for electrician or design of the PV system, just some arbitrary numbers.  \nThe team is presented and has linked in links to profiles, although some of them quite new and empty, and there is a face book link to a personal page of a team member… which is strange. However I don’t see any electrician or electrical engineer in the team and the budget does not provide a slot for such person, so I wonde who and how will calculate and make the electrical drawings and the electrical project as a whole. \nI disagree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 2, "q2": "The auditing part of the proposal suggests that we can make audit by the metrics that a regular stakepool would measure and some extra. However I don’t believe this is the correct way to audit a project like this. The auditors should be able to track the progress of the paper work and permissions, planning and construction of the PV system and the computational system. If this is already done, it is obvious that it will work, the question is if the proposers could build it to that point. \nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the issue that there is not currently a stake pool operating out of Sri Lanka. This would promote more of a Cardano community in the region and possibly filter down to more education about blockchain/ defi in general", "q0r": 4, "q1": "This proposal asks for a rather large sum of money. The ability to set up a stake pool from a technical perspective is one thing, the ability to build the infrastructure for a completely off grid pool is another thing. I looks to me like one of the team members would have the technical ability to setup the pool. The rest of the members are business or entrepreneurs. My question is, why $90k. If the team wanted to setup a off grid pool in Sri Lanka, it would not cost more than $10-15K max for two laptops (relay and block producer), some deep cycle batteries and  some solar panels and internet connection. This would have a minimal electricity foot print. There is a large budget targeted at marketing. Is this necessary - other than to attract delegation easily (from all over the world)? wouldn't the money be better spent on community outreach if the mission is to build a Cardano community in Sri Lanka?", "q1r": 2, "q2": "I dont think that just providing the metrics that the stake pool provides (delegation and block production stats) is sufficient evidence that the project is on track. What about a website with images of the panels setup and power infrastructure etc etc and how more information about how you are creating a Community in Sri Lanka based around the pool. (just my thoughts)", "q2r": 1, "assessor": "z_assessor_750", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Stake pool has become very necessary, \nBy having local nodes everywhere place vital role, As nodes on the Cardano blockchain that have a public address, where other holders may send their ADA in order to delegate their stake. \nIts very sad that Sri Lanka doesn't have Stake pool and still use Binance for staking,\nproviding local support to local communities is need of hour, \nSetting up stake pool is great idea and running it with solar powered to be zero emission is great idea, \nThis is also main goal of cardano becoming carbon free ,\ntherefore a completely green stakepool,\nBuilding stake pool is great idea and using solar power makes it efficient great idea,\n This proposal effectively addresses the challenge.  ", "q0r": 5, "q1": "The experience provided by proposer being working in catalyst Active member of Catalyst Community - General ADA holder in Catalyst Circle V3, Community Advisor in Fund 6 and 7, Veteran Community Advisor in Fund 7,  Founder of South Asian Town Hall,\nHas magnificent experince,\n           As proposer already  setup multiple stakepools . Considerable experience in pool setup/management is great.\n\nThere goal to provide real time data on Cardano a stake pools on testnet and mainnet and providing open-source reference implementation for how to access and visualize stake pool information will help all sri Lanka users.\n\n         As they will increase awareness of ADA and Cardano blockchain and increase awareness of Catalyst and its funding opportunities,\nand of all main give existing ADA holders an opportunity to stake within a local stake pool,\n\n\nWith given   Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As proposer will be providing Number of wallets and ADA holders from the repective Channel whether Youtube, FB, Instagram, Linkedin\n\n,    Number of ADA in each wallet,    Month on Month increase of ADA,   existing ADA holders are promoting to new ADA holders,   Brining  more people into the Stakepook will crease ADA value also,\nAs user will be providing all data number it will be easy to audit the progress ,\n\nThe proposer has provided detailed budget breakdown which includes detailed cost of each items required,\nThey have provided detailed cost required   Stakepool Hardware including Computers, UPS,  Solar power system , Solar  panels, invertors, Setup and Maintenance costs everything which is great,\nThe information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "To set up Sri Lanka's first Stakepool which would also be solar powered to be zero emission and therefore a completely green stakepool", "experience": "Active member of Catalyst Community - General ADA holder in Catalyst Circle V3, Community Advisor in Fund 6 and 7, Veteran Community Advisor in Fund 7,  Founder of South Asian Town Hall,\n\n My team has setup multiple stakepools . Considerable experience in pool setup/management."}