{"id": 399266, "author": "milan", "title": "Upcoming Events - Cardano Cube", "url": "https://cardano.ideascale.com/a/dtd/399266-48088", "category": 26441, "amount": 6000, "description": "With the huge amount of projects building on Cardano, it's not always clear when public sales, ISPO's and more are starting/running.", "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 435, "q0": "Cardanocube.io is currently a project information platform of the Cardano ecosystem, it has a large user base (According to the announcement of 75,000 visits per month). This proposal, when completed will provide an overview of public sales events, ISPO, ICO, Mainnet... of the projects for users. Cardano is in the ever-growing Basho era, when the projects and the amount of information are increasing, this proposal is very useful for the community, as well as finding new users to come to Cardano. I am also a frequent user of Cardanocube.io, with the perspective of someone who often searches for information on development projects on the Cardano blockchain, this proposal is necessary. I give 5 points.", "q0r": 5, "q1": "The proponent has personally built and developed Cardanocube.io to be as strong as it is now, I believe his proposal to expand the Upcoming Events feature will be successfully implemented. From my perspective, Cardanocube.io can completely add Event functionality simply using the Eventbrite extension, or using another similar plugin from the Webflow marketplace at the following link: HTTPS://university.webflow.com/integrations-type/event-management. Now Cardanocube.io is also built using Webflow toolkit, so the integration can be completed smoothly. The publication of the content of events, I do not see the proponent mentioned after this proposal is completed. Proposers can do it themselves, or users can add events to the website themselves. For this reason I give 4 points.", "q1r": 4, "q2": "Cardanocube.io is an online website, when adding new components, users accessing it will easily see the change. Therefore, the proposed progress of this project needs to be clearer. With a website built with Webflow, when the proponent adds an upcoming Event section, it is very simple and can be completed quickly using the built-in Webflow toolkit component, the cost of the component this is very cheap, maybe the webflow price package the proponent is using already includes this extension, so the proposer needs a budget of 6,000 USD I find it unreasonable. I give 2 points.", "q2r": 2, "assessor": "z_assessor_1151", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1868, "q0": "This proposal is regarding the problem, that due to the large number of projects developing on the Cardano blockchain, the community is not clear on when the ISPO’s and public sales are starting and finishing. The proposer wants to build a feature in https://www.cardanocube.io that will summarize that information in one place. This will be indeed a very convenient thing to have as a Cardano active investor.\nI strongly agree that this proposal is best hosted in the miscellaneous challenge due to the lack of better matching challenges in fund 8.\n", "q0r": 5, "q1": "The proposer does not present a road map, does not present a timeline except that the functionality will be ready in q2 or q3, depending on other features.\nThe proposer presents a budget breakdown of two categories, design 40h and development 80h, both of which are rated at $50/h. \nThe proposer just states that Milan will do the design and the development There is no presentation, no link to a CV, no connection to the site in question. I went to the site to research, but there was no information to be found on any connection with Milan. I don’t know Milan and I believe it is irresponsible to trust someone without any proof of existence or relation to anything really.\nMr. Milan, I hope you are an honest guy who wants to do good and useful things, it looks like it by the meaning of your proposals. However please spend some time in writing these proposals and provably presenting yourself to the community that will vote for your proposals to be funded. You will have much better success. \nI strongly disagree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 1, "q2": "Auditability of this proposal is impossible. The proposer seems to agree.\nMeasurable metrics for determining the success of the project are not provided.\nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 1, "assessor": "z_assessor_1417", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2026, "q0": "I would love to see this implemented! This will help people that are using Cardano Cube to find more information on some of their favorite projects and even to learn about new upcoming projects. Currently there isn't a place to find the different ispos. Most people have to ask in different discord chats and ask each other what stakepools they are in. This will help users to find important information. I would love to see how the UI and UX will look.", "q0r": 5, "q1": "Given that this proposal was left unfunded hopefully gave this team enough time to look into how they can implement this update into Cardano Cube and be as effective as possible. I would give more information on Milan. Most people don't know who he is. There could be a better way to introduce yourself and to write about your skills and experience. This will give you a higher chance of being funded.", "q1r": 4, "q2": "The proposal makes sense and can have a huge impact on the community and ecosystem. However, I would include more information talking about how this will be executed. Give a more detailed roadmap so that the funders and voters can see a more clear proposal and understand how these potential funds will impact the ecosystem positively. ", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2069, "q0": "The proposed idea is extremely vague and there is not too much description of how it will be executed. Having said this, I do think touches on a valuable theme and the need to give exposure to other successful (or unsuccessful) projects related to ISPOs and ICOs.\nKeeping in mind the low amount of the budget requested and the deliverable described, it looks like this proposal could be a good start to later extend the work to NFTs like suggested by the proposer.  \nI believe that adding a section to CardanoCube.io will take advantage of the target audience that is already landing on the site to look for information on the different projects of the Ecosystem. \nIt does solve the problem of where to look for information and the format of the Cardano Ecosystem Map is easy to navigate so definitely adds value to the community and gives exposure to projects in an organized structure.", "q0r": 4, "q1": "There is no team behind according to the reduced description of the execution plan but since the deliverable is so specific this proposal is highly likely to be implemented.\nIt would be great to have more information about the work done in the past, especially in CardanoCube's implementation of previous features.", "q1r": 4, "q2": "Unfortunately, the proposal does not describe a detailed roadmap on the execution of the projects. \nIt is also admitting it will be difficult to track, but I am not sure if the proposer is referring to the monitoring of the project execution or monitoring the result and impact of the end solution after being delivered. \nSince he is a professional UX/UI designer according to the experience description, it would be great to simply add the different milestones on the design and development following a timeline.", "q2r": 4, "assessor": "z_assessor_1450", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5287, "q0": "1. Yes, proposal provided a clear decription of an issue.\n2. Yes, i've checked: the problem statement defines a problem within the challenge. It'll help for a new members to find information at one place.\n3. Yes, i've checked: the proposal should have a positive impact on the Cardano ecosystem. I love the concept of having one place to get all information, not to searching all web..\n4. yes, i've checked. This will give comfort to use and speed. I mean user experience in generall.\n5. I believe KPI in proposal match the ones in the challenge as for the newbies it complicated to search for the information. Having 1 place, should help them.\n6. The proposal absolutely able to scale.", "q0r": 5, "q1": "\n1. Yes, proposal knows what experience required, moreover they have this experience as website is avaible to visit.\n2. Yes, proposal provided link to works. (web site)\n3. Yes, proposal knows, his way is to work alone, but as web site ready, i believe its ok he's alone.\n4. Absolutely yes, budget is outlined clearly, well understandable. Cost for 1 hour and estimated hours.\n5. Yes, the budget is quite reasonable.\n6. Nothing was found about additional funding at this fund 8.\n7. I've checked, the plan seems enough detailed so and implementable too.\n8. Its seems that there is no order of tasks but i believe its because of a small project.\n9. yes, the proposal offer a realistic timetable to complete the work.\n10. The plan describes the resources necessary to implement it.\n11. Architecture isn't crucial to this proposal.\n12. No big risks.\n", "q1r": 5, "q2": "1. No, there is no roadmap for achievements except the finished project at the end.\n2. Their KPI isnt quite clear.\n3. No, I believe their KPI aren's so clear to quantify success of this projeсt.\n4. Absolutely yes, its the short last project.", "q2r": 3, "assessor": "z_assessor_1914", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "We will build a feature in our platform that shows the community upcoming Public sales, ISPOs and ICO's. All in one place.", "experience": "A professional UX/UI designer with over 10 years of experience and 5+ years of experience in Cryptocurrency."}