{"id": 399550, "author": "welshie", "title": "Improve Catalyst Search-ability", "url": "https://cardano.ideascale.com/a/dtd/399550-48088", "category": 26441, "amount": 11130, "description": "Funded proposals are poorly organized and can’t be intuitively searched and explored when looking for solutions, answers, and inspiration.", "f6_no_assessments": 5, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1072, "q0": "This is a unique and well-thought out request that would not have fit elsewhere in another challenge. They also lay out a real problem and offer a proposal that could effectively alleviate that problem.", "q0r": 5, "q1": "These proposers were smart to generate an image demonstrating their chops at organizing information that can be clearly understood and intuitively navigated. They've put together a timeline that is ambitious and feasible and should demonstrate results promptly. The budget is not terribly large, and they request a fairly reasonable rate of pay for work that could prove impactful for how Catalyst itself is navigated by its whole community to learn basic information on funded proposals. \n\nThe information on the proposers themselves is regrettably minimal, but this team does have a track record to back themselves up including a well-organized website. They \"took initiative\" on their own, in their own words, to implement their tagging system in Fund 6 and are now requesting backing based on the popularity of their work. ", "q1r": 5, "q2": "The proposers are offering weekly data displays and videos to demonstrate their progress. This is above and beyond what proposers usually offer. They plan to release images they produce publicly as they come. So this project should be highly auditable.", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 1336, "q0": "The proposal tries to tag funded proposals, make them searchable, and create visualizations of them. Facilitate the exploration and discovery of funded proposals. The team has already delivered https://builtoncardano.com which is fully working and proven to be very helpful in searching many projects on the Cardano ecosystem. This time they want to create a tool that can explore and discover Project Catalyst funded proposals. With the experience the team has, I have confidence they can implement those ambitions. The team provides the main challenge of not receiving the required data, but the team has considered solutions to those risks.", "q0r": 5, "q1": "The proposal provides clear enough milestones with a roadmap, each with a specific time horizon. The team provides budget information and the broken down of how they will use the proposed budget. However, the proposal only stated the cost for remuneration of the developer, isn’t there any cost for the server? or cost for hosting the site? I have a concern the project has an unexpected cost beyond the written proposal. The proposal gives the names and short background of each team member. However, it would be even better if they also provide a LinkedIn profile for each team member so the community can easily verify the team experience and abilities.", "q1r": 4, "q2": "Metrics used to track progress is clearly defined, however, the proposer can decide the exact frequency of progress updates, rather than written as ‘weekly is suggested’. The indicators of success are concise and to the point, the tool and its API are working as intended. However, as the project is gonna be used by the community and is funded by the community, it’s important not only the tool is working but the community actually uses it. It can be measured by, for example, the number of API queries each day, so the proposer can add 50+ API query requests per day.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2032, "q0": "I would agree that this is an actual challenge that we face in the Catalyst community. It would be nice to have this improved search-ability. Organizing the funding process is something extremely important to improving the ecosystem. If we can find a way to help information be relayed out to the community in a secure way, we will need something additional to be built on the system. I think that this proposal addresses this challenge because they are also looking into other funds as well. Not just the current fund 8. For this reason, I give this proposal a 4 out of 5 stars. ", "q0r": 4, "q1": "The team has experience in this industry and has the abilities to carry out this proposal. However, I would include more information about the team and the accomplishments. This will help the voters to see what skills the team has and will be able to identify the likelihood of this proposal coming to fruition. For this reason, I give this section of the proposal a 3 out of 5 stars. ", "q1r": 3, "q2": "I like the information that has been included in this proposal. The roadmap gives specific details in regards to what they are wanting to get done. I like that it is split up into different sections with a specific timeframe. This allows the community to see what the team is trying to accomplish and can help the team to stay accountable. The proposal talks about where the requested amount of funds are going to be used in the tagging process of their proposed idea. I think this section of the proposal was well written. For this reason, I give this section of the proposal a 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3713, "q0": "Being able to use search is a great way to be able to do a lot more in a smaller amount of time. It lets you find what you need immediately. It allows you to better understand things, to better seek information. By Tag funding proposals, make them searchable, and create visualizations of them. Facilitate the exploration and discovery of funded proposals will help in faster discovery, exploration, and growth in Cardano ecosystem. The proposer has identified the need for Catalyst search ability and has also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has also mentioned the key metrics which will be helpful in the success of this proposal. The proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable.", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing Catalyst search ability and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and his team seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. he proposer has already pointed out the challenges they will be facing and also has alternate solutions to the challenges and the challenges can be scalable. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 11130 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more users which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8154, "q0": "The first word I want to say is to thank the author of the proposal because I think it is a meaningful proposal for the Catalyst community. The problem is that today's sponsored proposals aren't easily searchable and intuitive to discover when looking for solutions, answers, and inspiration. It would be helpful to create a user interface and ecosystem members use it to search for funded projects themselves, making it possible for anyone to discover projects and tools built on Cardano very easy and fast. I think not only me but the entire Catalyst community will love this suggestion.\nThe proponent offers a clear step-by-step plan with different milestones and potential challenges or risks he may face.", "q0r": 5, "q1": "The proposal provides a clear roadmap with milestones. All deliverables are specific, stages providing clear dates so progress and results can be tracked. can be checked by the community.\nThe team is described as having 2 members including Gabe and Ben. We easily know the role of each member in this project, I believe they have the capacity to implement the proposal. However, it would be more beneficial to the team if they provide more information to verify the team's experience like LinkedIn or the website...\nA well-defined budget with a reasonable amount. Budgets are thoroughly explained and realistic, making it easy for the community to audit.", "q1r": 4, "q2": "The downside of this proposal is that there are good milestones but no KPIs. However, we can understand that the result of this project is that proposals that receive funding from fund 7, fund 8 (about 779 projects) will be tagged.\nThe proponent also describes how the community can measure the progress and development of the project, and it is fairly easy to gauge the success of the proposal with the information provided. This proposal has not been funded before, but the results the team has done from tagging sponsored proposals since fund 6 shows that the community has been very excited about the idea. Therefore, I am confident that this proposal will be successfully implemented. Good luck.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Tag funded proposals, make them searchable, and create visualizations of them. Facilitate the exploration and discovery of funded proposals.", "experience": "Creators of Built on Cardano, an ecosystem explorer where we have implemented a detailed and intuitive tagging system and search UI through which people can explore the projects and tools building on Cardano. We have also completed the some of what we propose here for Fund 6."}