{"id": 399696, "author": "mushroommobnft", "title": "Collective Wellbeing via Cardano 🍄", "url": "https://cardano.ideascale.com/a/dtd/399696-48088", "category": 26441, "amount": 15000, "description": "People are suffering from mental health conditions, and we all pay the cost. Simple treatment can be effective, but access is limited.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": ["https://www.youtube.com/watch?v=xvfZDnPU0SQ&start=9958"], "media": [], "f6_assessments": [{"id": 384, "q0": "Here we have an idea with some characteristics that make it quite peculiar. The proposal aims to provide people with access to content and materials that deal with mental health at a low cost, using Cardano's blockchain for the commercialization of NFT's. These characteristics make the proposal fit correctly in this challenge, and the plan to help mental health with healthy organic growth of the Mushroom Mob project seems like a very innovative idea.\n\nThe success of this proposal implies an evolution in the way of diminishing the ills caused by mental illnesses and also contributes for Cardano's technology to gain another exponent of action. Regarding the structuring of the ideas presented in the proposal and the material already presented, the amount being requested of $15,000 seems consistent.", "q0r": 5, "q1": "We can see in this proposal that not only the initial idea about the project was well structured, the organization of the steps presented to make the platform reach a large number of people is well done. We can see this in part due to the cohesion that exists between the steps that will be carried out to promote the growth of the Mushroom Mob. It is not just about the commercialization of NFT's, the execution of workshops, partnerships between companies/health professionals and the creation of engaged communities are being planned so that the project gains body and notoriety in the area of ​​combating and preventing mental illnesses.\n\nWe noticed that there is already a website that is very well built to promote the project and that it has a captivating personality of its own. In addition, we see that several mushroom arts have already been designed to be marketed as NFT's in the future (including why they chose mushrooms as the central theme of the project is explained on their website). In addition, development objectives were organized into three phases, and the goals present in them become more complex over time. We realized that the most complex objective at the moment, which would be to exchange tokens for discounts on online health services, was left for the last step, after simpler goals had been achieved.\n\nAnother point that is a differential and helps to bring great credibility to the project is the donation of 7.5% of the revenue for research into new treatments. On the project's website, it is possible to locate the team that created the platform, and we were also able to find addresses for LinkedIn in the proposal. Regarding the budget breakdown, the expenses are well distributed and include not only the development of the website and NFT's, but also resources are allocated for other functions such as finding potential partners for the project and promoting the engagement of the online community. This last action even demonstrates the team's concern with publicizing the project.", "q1r": 5, "q2": "In a project that relies heavily on community engagement for the goals to be achieved, it is expected that well-defined metrics are established to measure the platform's impact. And what we realize here is that these metrics have been established. As a means of auditing the proposal, the team defined the monitoring not only of the NFT transactions that are being carried out, but also of the other factors that promote platform engagement and make these transactions actually happen.\n\nWe thus perceive a planning that allows the monitoring of the momentary results of the project, but which is also concerned with the factors that influence the continuity of the action. Such factors as the number of partnerships being made and the growth of the online community. Additionally, we see that the team's perception of success is also consistent with the phases defined earlier in the description of the project's feasibility.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4977, "q0": "Firstly, the idea of raising awareness of mental health through collecting Cardano NFTs is new. The author describes that the project would be beneficial for millennials who seek mental health support but have a shortage of support/resources. But I suggest the project should also target early Gen Z because the rate of suicide is increasing among this age group and the youngster. By purchasing an NFT, they will get free access to online health services and workshops such as positive psychology, nutrition workshops, etc. Nonetheless, the author did not explain how the project can these services differ from normal while there are many free health supports available online and attract people to invest in them apart from 7.5% of the proceeds will be funded to research psychedelic-assisted therapy. Overall, this proposal is well-fitted in the miscellaneous challenge, and I would rate the impact 4 out of 5.", "q0r": 4, "q1": "The proposal's information on the team is extensive and highlights each team member's skills. The provided experiences and previous work suggest that the team is completely capable of creating this project. The proposed project has started and is currently ongoing in the development stage. They had done with the concept, design artwork, establish a community and support 1-on-1 technical and health. However, with the completed work so far, I am not sure why they still need 6 months to launch the workshops. Thus, I give this proposal 4 out of 5 for the feasibility.", "q1r": 4, "q2": "The proposal requests $15,000 to fund 6 months of their project and describe how this budget will be spent within 6 months. The proposal details their progress, and the expected results are close to reality. Since this proposal promotes wellbeing, I suggest the audibility should give more detail on the impact of their health workshop on the attendance, which adds more value to your audibility. Overall, I rate this audibility 4 out of 5.", "q2r": 4, "assessor": "z_assessor_1815", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6114, "q0": "The problem identified fits well within the misc challenge as there's no challenge category for(alternative)  psychological well being or cognitive security (made, built or supported) by Cardano.\n\nUsing NFTs as a membership for a well being club, offering workshops and support channels is a noble and novel idea, at the same time the NFTs are well designed works of pixel art. The more individuals taking in the offers, the more resilient and strong the overall Cardano community will grow; attendance is additionally incentivised via NFT collectables in the form of achievements.\nAlleviating the psychological pressure of building a future proof and resilient protocol and dapps on top is a worthy cause and until now is receiving not enough attention. \nCollaboration and scaling efforts even look to encompassing other (systemic) health issues like heart disease and diabetes.\n\nBy creating a visible (through holding NFTs or badges) community of individuals aware of cognitive security and inner well being, the grassroots scaling approach seems very tangible and plausible.\n\nRecruiting fitting  health professionals is identified as the biggest risk and is being mitigated by partnering and collaborating with known networks that align with the projects (and Cardano's) greater vision of a just society living on a balanced planet.\n\nAccording to the team and what has been grown so far, scaling will happen organically in a grassroots fashion  from within the community and the greater network created on top.\n", "q0r": 5, "q1": "The project (mushroom mob) is already launched and working away without Catalyst funds so far, which shows that the team (thus all relevant skills)  and expertise necessary are available in basic shape and form.  The Discord challenges are worthwhile, make sense and give a glimpse about the solution oriented mindset this team brings to Cardano.\n\nCrucial for the projects success are the partnerships with health and well being facilitators for delivering the online workshops. Its reassuring to see they are planned for in the budget and timeline, as well as already engaged (Fungi Foundation and Mind Medicine).\n\nThe open ended nature of the project, the fact that it has started and will continue (with a bit more friction) also without Catalyst funding and the collaborative mindset are strong signals for successfully delivering this proposal.\n", "q1r": 5, "q2": "a 6 month milestone plan gives insight into the timeline and immediate road map of the project, tho only in very rough details (for example: what does \"grow partnership\" imply?)\nThe measurement criteria could have been a bit more fleshed out and oriented towards the projects goals. For example the number of partnerships doesn't give insight into the impact or success a given number of partnerships has. \nOn the other hand the distinction between short, mid and long term goals helps a lot with understanding the scope of the auditability.\nThe organic growth pattern of the (Discord) community seems a reasonable and good direction.\nIt's stated that the progress measurements will be documented but not where, that would be helpful but doesn't impact the rating at this point.", "q2r": 4, "assessor": "z_assessor_334", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8155, "q0": "According to the writer, currently, people are suffering from mental illness. The solution to this problem is an NFT project, the Mushroom Mob. This project will invest in mental health in every way:\n1. Raise awareness about mental health\n2. Implement promotion and prevention strategies\n3. Improve access to quality health care and support services\n4. Research funding to identify new treatments.\nMushroom Mob is a unique project because it uses the mushroom metaphor of a tight-knit, action-packed community to address mental health issues. The Cardano community and the Catalyst community will benefit from the Mushroom Mob as it inspires and stays healthy in an innovative way. Problem and solution statements are reasonable and within the scope of the challenge.\nThe proponent outlines potential challenges and also strategies for mitigating possible risks.", "q0r": 4, "q1": "The NFT Mushroom Mob project broke ground in December 2021 and there is a certain amount of work completed. It is possible to follow this project http://www.mushroommob.io/ and see it has had some remarkable achievements. From what was presented, the proponent had a clear understanding of what needed to be done for the proposal. The whole plan was very well thought out. This proposal is very detailed on time frame with all phases, with actions to be taken.\nThe requested budget of $15,000 was also described very clearly and succinctly and it was a reasonable request.\nThe proposed team consists of 4 members and we know each member's role in the project. They all have professional qualifications, 3 of them are doctors, in addition they have the necessary skills and experience that I believe they will do well on this project.", "q1r": 5, "q2": "From what can be read in the proposal, the proponent has invested considerable time and effort into this project, which demonstrates faith and dedication. The proponent clearly understands what he or she is doing to make the proposal successful. The team identifies measurable deliverables that provide us with enough information to gauge project progress and performance. Besides, they also presented the successful results of the proposal in the short, medium and long term in an easy to understand manner. Although this is a completely new proposal, with what has been presented, I am confident that the team will successfully implement this topic.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10083, "q0": "This proposal show detail about an NFT project, Mushroom Mob, that focuses on promoting wellbeing. This project benefits all 3 sides. From NFTs Mushroom Mob holders sides, they will get free access to online mental health workshops then workshop attendees will receive an NFT badge. For developers they will had a profit form this process and donate 7.5% to research mental health disorders to help community. From Cardano ecosystem, it's also the good way to grow communities. Thus this proposal is within the challenge.", "q0r": 4, "q1": "This is an ongoing project that had initial results, so the proposer has detailed plans for the next stages. I am quite impressed with the experience and skills of the team members. This is a pretty realistic and workable plan. However it would be better if the proposer has a detailed plan for the mentioned challenges like how to establish a team of health professionals and how to marketing to increase access.", "q1r": 4, "q2": "The detailed plan including roadmap, key metrics for short term and long term are provided that help Catalyst community tracking progress of the project. However, the budget allocation only show the total amount of spend for major purposes, does not specify how much the tasks in each major purposes need to spend. It's quite hard for auditing.", "q2r": 4, "assessor": "z_assessor_792", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Increase access and mental health awareness by innovative, collaborative action powered by Cardano NFT tech.", "experience": "Registered Clinicians:\nskilled with psychotherapy, behaviour change and lifestyle interventions, multidisciplinary networks, Canva, blog/article writing, online adult health education\n\nHaskell Software Developer:\nskilled with web development, wallet integration, smart contracts"}