{"id": 399746, "author": "b1tbyb17", "title": "knowcardaknow, a marketplace", "url": "https://cardano.ideascale.com/a/dtd/399746-48088", "category": 26441, "amount": 20000, "description": "Not everyone's capable of nor good at DYOR & the many Cardano resources available can overwhelm new members and no-coiners to our community.", "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposer has effectively mentioned how people fail to achieve the goal when they don't get proper resources or suggestions.\nHence this proposal will provide tour of knowledge for all the people who are interested in investing their money in cardano, even if they fail to invest they'll get proper knowledge as how their money is safe which helps in not spreading negative news on cardano in the future", "q0r": 5, "q1": "Since the team has stopped the work due to pandemic already once , it should not be repeated in the future if by chance any other wave of pandemic is seen.\nThe team has already have great experience from the past , which will be helpful in counter ing the issues which can be seen in the future.\nAs proposer has mentioned proper proper areas of marketing the proposal can be a successful one", "q1r": 4, "q2": "The proper hasn't mentioned what kind of learnings will be provided , whether it will be of fun learning using 3d images or learning where people has to attend the classes on the required time. Other than that proposer has clearly explained regarding the every months target and organization of work ,Even the submitted audit has provided clarity over what age people are targeted for this model hence the provided audit is sufficient to audit the progress and success of the proposal", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The problem of the proposal is that the knowledge about Cardano is still very much, making it difficult for those who are new to it or who do not have the skills to self-study knowledge related to CArdano. The solution is Knowcardaknow to provide a knowledge marketplace where someone with Cardano experience can readily assist and provide know-how to someone or an organization that may or may not want to know more. about DYOR (Do Your Own Research), creating a roadmap to increase engagement. Problems and solutions are presented clearly and easily and there is a detailed product plan. The proponent outlined the solutions to this proposal very clearly showing us how it would fit the challenge. It can be added that this, if successfully implemented, will have a positive impact on the Cardano ecosystem.\nThe good news is that the proposal also foresees all the risks that may be encountered in the project and also has measures to overcome those risks.", "q0r": 5, "q1": "About the detailed plan and time to deliver the solution: the plan of this proposal is very clear and detailed, presents a clear roadmap and expected results with timelines from 1 to 6 months. The requested $20,000 budget was also broken. The proponent has been very successful in explaining the budget in detail allowing the community to easily check what the money will be used for.\nAbout the team implementing the proposed project, described briefly, concisely but fully so that the community can know how many people the proposal includes, the role of each member in this proposal, the experience of each member. pellets. They also provide links to their personal pages (twitter, linkedin, IG..) so that we have more credibility in their work.", "q1r": 5, "q2": "What I like about this proposal is that all information is transparent, the community can easily track the progress and development of the project through Bitbook: https://know-cardaknow.gitbook.io/knowcardaknow -a-biet-dot- Marketplace/ or Twitter: @knowcardaknow\nThere are several goals along with well-defined KPIs, I fully agree that the success criteria and recommended metrics are precisely set up to measure progress in addressing the challenge. . Although this is a completely new proposal, from the information provided, I am confident that this proposal will be successfully implemented by the proposal team.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal we have here states about \nDYOR- common phrase used by cryptocurrency enthusiasts ( Do Your Own Research ),\nAs not everyone will not have idea about DYOR ,So there are many Cardano resources available which can be used ,\nWith all resources available it will overwhelm new members and no-coiners to our community.\nSo proposer wants to solve this by Cardano knowledge where Sharing marketplace between new users, who are not involved, Different users, \nAs they want to educate all these members and monetize their experiences.\nAs this marketplace will help solving the above issue,\nAs learning from someone directly will be more efficient ,\nThis proposal effectively addresses the challenge. \n", "q0r": 5, "q1": "As proposer are already building customized marketplace which is impressive, Now the want to expand it to Cardano community.\n..\nThis project will help getting  new participant in cryptocurrency, Many organizations will use Cardano etc,\n..\nThe detailed plan presented  explains neatly,\nin PHASE 1, In 1st month they finish securing account and  research configuration parameters, in 2nd and 3rd month designing landing page, In 4th -6th month beginning marketing activities ,\nThe team has previous experience in building a customized marketplace which will make them easy,\nWith all given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The detailed budget plan given with excellent and full detail including hourly pay,\nAs they will allocating budget to \nHuman Resource, Infrastructure, Marketing and promotions, \nEvery bit is informed in detail and it is reasonable.\n..\nThe team members provided have impressive resume,\nTeam includes of everyone needed for project from Project manger to Graphic designer to  Full stack developer.\n..\nFor Auditing the progress \nThey will be providing all details in public and social media that is good,\nIn PHASE 1 \nThey will be providing updates monthly which is great,\nin 6-8 months complete working project will ready,\nAs they will be providing all the progress reports in public domain and social media monthly given    information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_992", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "A Cardano knowledge-sharing marketplace between new, uninvolved or diffident users & educated members who want to monetise their experiences", "experience": "We were building a customised marketplace - Secretflag, which we abandoned due to the pandemic’s impact on the travel industry. We now want to pivot our learnings & experiences to the Cardano ecosystem\n\nYoutube vid - https://bit.ly/3IMKT7j\n\nBitbucket - https://bit.ly/3ssPtlC"}