{"id": 400058, "author": "heinz.gassner", "title": "DLT360: WEBSITE & Video - Next Step", "url": "https://cardano.ideascale.com/a/dtd/400058-48088", "category": 26441, "amount": 15000, "description": "WEBsite and Video-clips are major delivery-channels of DLT360. With Fund 7 we get to MVP quality, but easy RADAR-accessibility is lacking.", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"id": 7392, "q0": "I think the proposal is super relevant and will have a high impact for Cardano. DLT360 is a company that provides a kind of consultancy for companies that want to enter the blockchain universe, I think the role they play for our community is super important, since there is still a lot of prejudice and misinformation about what blockchain is. , cryptocurrencies, etc. I think most people, especially in places where this technology is not widely adopted, see the cryptographic world as an “easy and quick way to get rich”; we know that's not it, obviously we believe in the appreciation of Ada over time but there are many projects and many benefits about Cardano, as we active members of the community know. The role of DLT360 from what I understand would be precisely to better explain what the cryptographic universe is to different people and companies, they outline very well the goals they intend to achieve, for example in the topics: “ensuring that the millions (billions) are invested wisely + having the main trends, risks and opportunities precisely analyzed and visualized (collecting from various sources) + demonstrating this care to regulatory bodies and professional clients (...)”. The objective of this proposal would be precisely to make these services more accessible, transparent and auditable, as we can infer from the excerpt “we will make one more iteration in the design of our material (presentations, videos) and we will fully integrate the access of Radar DLT360 in our WEBsite”. In other words, the services that are already being provided will be improved, in this way the quality will increase and the results, of course, will also benefit. While the company is already working to promote the popularization of our blockchain for different groups, automatically they are already dialoguing with the objective of this challenge, which is to provide greater Cardano adhesion, the popularization, knowledge and appreciation of our technologies ( even if this is not done as specifically as in the other challenges). For these reasons, I consider this proposal to be of maximum impact. \n", "q0r": 5, "q1": "The way of explaining the script was not conventional, at first the proponents explain in a very long and detailed way how each aspect of the company develops, that is, the type of work they perform, from what I understand, being these: \" customer segments/target groups + value proposition + distribution channels + customer relationship + revenue streams). Up to this point of the topic, I was a little confused because I did not see the development phases being addressed from the current funding, however this doubt is resolved in topic 6, exactly which activities will be performed are said (from the third quarter of this year ) specifically at this stage of work. We know what will happen in a very well explained way, my only observation would really be that time is divided on a smaller scale, for example in months; if the bidders told what would happen in each of them, our visualization of the whole process would be more accurate. Turning now to the second topic of analysis, the budget, I think this part looks great. The asking price is compatible with the size and complexity of the project, and it is well explained, some parts are separated and these are detailed; for example in “general project management, MIRO updates (5 hours for USD 50/h) = USD 250.00”. We know exactly what would be done (management), by where (via the MIRO app) and for how many hours this would be work, as well as the hourly rate. The other parts are also explained satisfactorily. Finally, let's talk about the team presentation. I thought this part was good, however the descriptions of each member of this team could be a little longer, they could have explored each one's CV more, reported better past experiences and how they relate to Cardano (we know they are active members of the community, but it would be interesting to know about other projects they are involved in besides this one). It is good that your linkedin profiles have been provided, because with this we can verify all the information that has been said. In summary, I found the feasibility good, having only a few points to improve. \n", "q1r": 4, "q2": "I believe that everything is in agreement regarding the auditability of progress, both because the team of proposers is already familiar with the processes of monitoring Catalyst proposals (reporting, I believe meetings with the IOG coordinators as well) and because they provide several KPIs, which can serve as a direct way by which we can verify that partial results have been achieved. I think the bridge with the Cardano community would be through MIRO itself (it is not so clear whether it would be viewable by other people or only by team members), or through the aforementioned reports (if these would be forwarded to the Cardano community by telegram, discord and etc). As much as everything was not so explicit, I think that things would work that way, so I can be confident about the good follow-up of the process. As for the final results, the proponents provide KPIs similar to the auditability of the process, which are the performance of the activities mentioned in the roadmap, number of views on the website and RADAR and ratings. What could have been better clarified would be precisely how the Cardano community would track these metrics. Would it be through MIRO and reports as well? Or, because they are the final conclusions, so they would probably be more extensive explanations, would the proponents be part of some Town Hall, where they would expose the verified contents? I think auditability is good, but it could be a little better in that sense of bridging the Cardano ecosystem. Apart from that, I think that the data provided by the proponents is enough for a good monitoring of the evolution of this project. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2135, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: this proposal aims to bring updates to the DLT360 website and integrate the Radar tool within. So it is a cross - functional project that would provide support for the core parts of the project.", "q0r": 4, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: 60% of the budget goes towards web dev. Average rates USD 50/hour. ", "q1r": 4, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.\n\nSpecific part: basic KPIs are offered (website view frequency, NPS - net promoter score. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5823, "q0": "In Misc Challenge each team can define their own problem to be solved. The DLT360 team has got many of their proposals funded in Fund7 but to tie everything together and to make it easily accessible, they need to create video content and an updated website to bring the fruits of their labor available to the community. This is also a step on their roadmap, becoming a subscription-based service provider, independent of Catalyst funding. I would say this is a win-win-win situation: the team, the users and the community benefits, hopefully also the society.", "q0r": 4, "q1": "The DLT360 team has proven themselves already. Here, however, 80% of the budget goes to external service providers. It was a bit unclear who exactly is going to make the website. Is it the branding and media partner?", "q1r": 3, "q2": "The KPIs are very straightforward:\n\"- We have achieved all our activities & deliverables as listed above (100%)\n- WEBsite view-frequency (>1.000 per quarter).\n- Number of RADAR views (>1.000 per quarter)\n- Ratings (NPS > 8)\"\n\nI would say this is on a good enough level to track the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8161, "q0": "The fact that some of the ideas needed to be included in the Other Challenge was crucial to Catalyst becoming more democratic. Therefore, the proposal aligns well with Cardano's mission. The problem is that Websites and Video-clips are the main distribution channel for the DLT360 but lack easy RADAR access. The solution was to do one iteration of my document design (presentations, videos) and fully integrate the DLT360 Radar access into Webs (https://www.dlt360consults.com/). This on the one hand allows to keep the number of people working directly with the Radar Engine (ITONICS) very limited and on the other hand provides different levels of access to the Site. The goal of the proposal is to provide a very simple User Experience without having to be trained in a complex tool. Basic Setup of DLT360 Risk & Opportunity Radar is funded in fund 6 and heavily supported by several projects in fund 7, this proposal if successful implementation will support Cardano in many aspects like : Ensure that millions (billions) are invested wisely, Support future DREPs and Cardano governance bodies in making data- and fact-based decisions, There are trends It is important that risks and opportunities are correctly analyzed and visualized (collected from multiple sources). .... Although a section on potential risks to the success of this proposal is flawed. , the group's accumulated experience gives me confidence that this proposal will succeed.", "q0r": 4, "q1": "Well, given the presentation plan and the experience of the announcers, it is very likely that this proposal will be successfully implemented. The proposal provides a very detailed plan. The DLT360 team profile shows the right skills and experience to carry out this proposal, this project team consists of 6 members with specific roles. The author did a great job providing the team's credentials to the community for confirmation before voting. It is clear that they have the experience to offer and are veterans in the Blockchain/Crypto space. Here is proof of feasibility from the group profile. The budget is clear and detailed, the proposed $15,000 request and allocation details go straight to the point. Therefore, on the basis of the given information, I agree with the feasibility of this proposal.", "q1r": 5, "q2": "Yes, the information provided is sufficient to assess the progress and success of the proposal. The team did a great job outlining the current problem, presenting their solution, and discovering what steps and work should be completed within what timeframe. Key metrics to measure seem doable and are a good indication of a successful challenge setup. The success of the proposal is also clearly described. Although this is a new proposal, with the experience and contributions of the DLT360 team, I believe that the team will do a good job of what they are doing.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "The basic DLT360 content will become more transparently & comfortably accessible for the community (RADAR, Presentations, Videos).", "experience": "The DLT360 Domain Expert Team and the contributing network with many years of experience in this field.\nExternal experts for Branding and WEBsite design.\n\nDetailed information & links provided in 'Feasibility' section below."}