{"id": 400002, "author": "amint", "title": "Cardano: Solutions for Cannabis", "url": "https://cardano.ideascale.com/a/dtd/400002-48088", "category": 26441, "amount": 150000, "description": "Cannabis is a cash-only business; facing regulatory conflicts, loss of capital via theft, error, & inability to use POS systems and banking.", "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"id": 836, "q0": "The Miscellaneous challenge is quite broad, but I think what this project does positively is bring a number of subject matter experts together around a highly regulated industry in order to develop a solution that utilizes cardano (somehow) to provide compliance and convenience to cannabis business operators.  The actual solution however, using \"enterprise wallets\" to \"improve the efficiency of Cannabis operations\" is quite vague in that it lacks a clear explanation of WHAT that solution might actually look like.  Is it an ERP?  A financial tool?  How is Cardano involved? In the proposal section aimed at describing the solution in detail, the proposer instead describes the impacts that operators will experience as a result of \"the solution,\" which is still not so clear. Then in describing how the solution will address the challenges, the proposer only identifies the major cannabis industry challenges in more detail, as they relate to business operators. Again, I agree that the team may be very well suited to leverage cardano along with their focused experience in order to deliver a compliance/efficiency solution to cannabis operators, therefore I gave a neutral rating in regard to impact. However the proposal may benefit from improved transparency if it contained more details on how exactly the team intends to deliver the solution, other than using a \"relationship based approach\" or \"routine access.\" Further, based on my existing knowledge of the US cannabis industry, many of the challenges faced by operators are not only regulatory but also jurisdictional - i.e. there is still a federal/national restriction that prevents them from operating across state lines. So in evaluating this proposal's impact, I was also unclear if this proposal aimed to deliver only a localized solution (in Nevada), or if the team believes that whatever solution they are developing may be a pathway to legalization at the federal level after the proof of concept is expanded to new jurisdictions?  The proposal may be more appropriately placed in the Business Solutions or Lobbying for favorable legislation challenges.", "q0r": 3, "q1": "I think the team has a clear understanding internally of what industry challenges exist, and how their solution could help to overcome them.  A timeline is present, and the budget represents 30% of the total Miscellaneous challenge for Fund 8.  While there is not a great amount of detail on how the budget numbers were produced, I also didn't see any comments on if the funds requested in this proposal represent the total amount needed to deliver a no-cost enterprise solution for cannabis business operators, or if there was an operational element to the solution (management, updates, audits, etc) that would need additional financing in the future - and where that funding would come from.  Given this degree of uncertainty, I'm positive on the team/capability but still reserved about likelihood of implementation due to limited details on the scope. ", "q1r": 3, "q2": "This project has a large exploratory element.  And even though it contains limited details regarding solution development, and lacks a concrete list of licensure requirements, the proposed monthly progress reports could serve as a good indication of what progress is being made so long as those reports also included a detailed use of funds as a knowledge retention tool for scalability purposes.  My position is neutral on this however, given the lack of concrete deliverables, which may complicate the overall auditability of this project.", "q2r": 3, "assessor": "z_assessor_1224", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 990, "q0": "If I'm reading this correctly, the goal of this project is ultimately to deliver a crypto POS and inventory management system for the cannabis industry. There's certainly an opportunity here given the industry's inability to use credit cards for transactions, but the impact statement buries the lead; I had to scroll down to the Feasibility section to get a good sense of what this project is building. The proposal does make a reasonable case for an inventory management system that can handle regulatory burdens with minimal labor. Nevada, specifically, is mentioned. Is the project scoped specifically for Nevada, or will it be able to handle other states? There's a lot of information in this section, but it's not telling a coherent story at the moment.\n\nAdditionally, I think this project may be misclassified and a better fit for Business Solutions.", "q0r": 2, "q1": "I see two potential issues: 1, cryptocurrency gateways already exist that could be used for industry payments (although some, like Coinbase's, do prohibit it). 2. To what degree are existing inventory systems insufficient? As I mentioned in my Impact assessment, I'm also not clear on the scope of this project with regard to state markets. \n\nSince the project will be heavily dependent on dealing with regulations, it might be helpful to provide some additional biographical information on team members, particularly for Joel Kisner, Richard Forbus, and Kellie Skidmore. And since we have stake pool operators mentioned, what will be their role in the project? Will it be connected to specific pools in some way? Are they handling the code?", "q1r": 3, "q2": "The proposal lays out a reasonable process for tracking the project, which includes progress reports, submission of licensure and application dates, and stakeholder meetings. The main issue with this proposal is a lack of clarity with regard to what it is, exactly, that's being built. I'm pretty well convinced that the proposers know what they're talking about and know what they want to build, but I don't think it's fully coming across in this proposal with the way it's currently written. I'd suggest reworking it, starting with clearly defining what it is this project is building, and then getting into the weeds of how the proposers plan to contend with the regulatory environment.", "q2r": 3, "assessor": "z_assessor_1251", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1940, "q0": "The proposer is addressing the problem of regulatory conflicts, loss of capital and inability to use POS systems and banking in the cannabis business. The solution suggested is to Leverage Cardano and enterprise wallet technology to improve the efficiency of Cannabis operations and regulatory compliance.  It not clear how the project will add to the cardano ecosystem.  A number of legal issues  - regulatory matters - are present and this is understandable for such a subject.  The KPIs are relevant to those of the challenge but still there is a question or rather a vagueness as to whether it will address future challenges.  Reading the proposal, and although having a clear problem statement and solution, it does not bring out clearly the immediate need for implementing this project, rather I get the feeling of a struggle with controls, administrations, regulations etc.  ", "q0r": 4, "q1": "The team has the expertise to implement the project and the number of team members is adequate.  Furthermore, the timeline of 12 months seems adequate, although the proposer identifies a number of obstacles that may lead to delays.  The proposed budget could have been provided with more detail (e.g. development - how many developers, how many hours or weeks etc).  In my opinion the 150000 might be overestimated a little, if I take into consideration other projects related to development, but maybe I'm wrong.  As previously stated, the risks identified in implementing the project are related to delays in receiving licenses etc., therefore, I would think that what if the team is denied a license? What will happen then? ", "q1r": 4, "q2": "Auditability of the project is based on progress reports, licenses and approvals as well as meeting with the Catalyst. A timeline is provided with the tasks to be performed.  Metrics are not really quantified, they are presented in a more abstract way. It is not that the proposal might not be feasible, but because of its nature and the risks and challenges foreseen, the project might not be completed on time or other unexpected risks may arise that will affect implementation.", "q2r": 3, "assessor": "z_assessor_1434", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5588, "q0": "Given it is a very unique proposition, this challenge has been categorised more than correctly in the miscellaneous solutions - the team are trying to create a framework to allow legal Cannabis business operators to improve their regulatory support and improve their business processes to realize greater compliance and increase their revenues. Interesting and unique proposition that seems very well thought out, more in the next assessment question. ", "q0r": 5, "q1": "Where to start, from the complete and experienced team of people involved in the project to the planning out of the solution this project is like I said before one of its kind and will potentially revolutionise the Cannabis industry. I'm sure it will be a long project which is why a year seems reasonable with an extensive group of people working on it but the project seems completely doable given they have the right diverse team of people with the right knowledge and the right strategy/timeline in place. Budget presented is also broken down in detail which also seems reasonable given the price of lawyers and other advisors. Overall very complete proposal, and again a project that could benefit the industry immensely and help promote the cardano network outside of the Crypto world which is something much needed. Team should be proud of what they have come up with. ", "q1r": 5, "q2": "information provided is more than sufficient to make this proposal auditable, from the way they are planning to approach the problem to their timeline and budget. Hoping to see more game changing projects like this in Catalyst in the future.", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8104, "q0": "The Solutions for Cannabis proposal has fitted the Miscellaneous challenge well as there is currently no challenge that will serve this particular Cannabi market. The proposal has identified this niche market that is unserved by POS systems and banking and that Cardano strikes the team from its unique wallet, peer review, blockchain technology. The wallet solution has the potential to scale for cannabis operation. They also explain very well that the regulatory side might prohibit the operation of enterprise wallet that could bring project mission into jeopardy.", "q0r": 4, "q1": "The project timespan of 1 year comes with its own set of challenges. The first 3 months after obtaining funding will be used to locate a viable operator. It doesn't justify why it takes 3 month to locate the operator.  Although the proposal budget lists possible relevant costs, some of the expense items cannot be measured concretely ie. liaison support which involves travelling to Carson city. Some of team members are involved in the community as stake pool operators. Their YouTube clip gives the background of team and the glimpse into the project. The proposal will improve if they can provide clearer information on their timeline and how the budget is spent along with the link reference of team members would also be a plus side for the community to decide if the project is achievable. ", "q1r": 3, "q2": "The progress can be monitored via their submitted monthly report on various meetings that will incur during project period. The success of the project is highly dependent on the POS and banking solutions being accepted by department of taxation and financial institution division. The project success is not easily determined if the wallet cannot have a launch. It will be difficult for the team to respond to public questions as the success depends not only with their team ability to carry out the task but the regulatory environment they operate and their relationship with stakeholders.", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Leverage Cardano and enterprise wallet technology to improve the efficiency of Cannabis operations and regulatory compliance.", "experience": "Expertise: compliance, business process controls, audit assessments, regulations, investigative protocols, security designs, governmental liaison, legislative support, legal oversight of business operations in gaming, healthcare, other industries, AML & KYC operations & controls."}