{"id": 400295, "author": "wolfram.blockchain.labs", "title": "Wolfram Reimagining DeFi as RealFi", "url": "https://cardano.ideascale.com/a/dtd/400295-48088", "category": 26441, "amount": 50000, "description": "We need to move from current DeFi that is zero-sum in nature, to financing positive sum initiatives that create real wealth.", "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 273, "q0": "With this kind of research there will be a great platform where Cardano projects can stand out from other chains.\nThis proposal fits into the miscellaneous challenge because it does not fit anywhere else.\nThis proposal could help change the global defi landscape\n", "q0r": 5, "q1": "When funded the goals are so clear. The risks are clearly known and defined. These discussions are so needed as our environment deteriorates. \nThe timeline on the project is clearly stated with a clear and easy to understand budget.\nThe team knows exactly what they want to do and that makes success easier. ", "q1r": 5, "q2": "Some of the auditability is already happening. Look at the Lex Fridman podcast. Cardano is already benefiting from this. \nAlso all the output will be publicly available.\nThe proposal problem and solution is crystal clear and easy to understand.\n", "q2r": 5, "assessor": "z_assessor_1130", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 6272, "q0": "The proposal aims to help shape the DeFi or respective RealFi space in Cardano by supporting projects and entrepreneurs with knowledge, case studies and tools to create real world impact. As a former proposer I think workshops and tools by professionals who know the field could be handy for projects in early stages of their development. To improve the impact, it would be great if the material generated by the team would be available long term and not only for fewer participants in their workshop phase (expect for the research). All in all, the problem of short oriented tokenomics and a lack of real value add in upcoming projects would be improved for a better of the whole ecosystem.", "q0r": 4, "q1": "Wolfram Blockchain Labs is the entity behind the proposal. It is already an established company in the Cardano space as they have a contract with IOHK as far as I know. Their team for this proposal consists of multiple experts (economists, programmers and marketers) that can be found with a google search and are shown in an introductory video.  A 50k budget seems sensible for their services. Due to the reputation of the respective experts and the brand of Wolfram, it is highly likely the team will deliver to their promises.", "q1r": 5, "q2": "The proposers define clear goals: workshops, research papers and tools that will be taught and used by participants. They further added metrics to measure how many participants will do a Wolfram blockchain certificant for example. Still, it is not entirely clear how they will evaluate their success. They state it CAN be evaluated in a variety of ways. But it is not clear IF they will actually do it. ", "q2r": 4, "assessor": "z_assessor_380", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7258, "q0": "The leader of this proposal is a Ph.D Blockchain Research Fellowat Wolfram BlockchainLab. Both her expertise and the innovative vision of one of the Wolfram companies make this proposal highly attractive. The project is to produce research publications followed by workshops and lectures with the engagement of the cardano community on the topic of redefining the traditional blockchain finance (DeFi) to tackle positive-sum initiatives that create real wealth. There’s no doubt that research in that subject provides high value to the Cardano community in its path to governance and growth, and since there are no specific challenges that cope with these types of research and topic, I consider correct to be allocated in this Miscellaneous challenge. Moreover, I believe that after the workshops proposed, the cardano community will start conceptualizing projects with that view.", "q0r": 5, "q1": "As mentioned in the other section, the leader is a recognized PhD economist that specializes in monetary theory, complementary currencies and the history of economic thought. Additionally, Wolfram BlockchainLab is a subsidiary of Wolfram Research focused on enabling blockchain-based commerce and business model innovation. As a result of that project, they will deliver three research publications, with workshops targeted to our community and promoting engagement. They provided a well detailed scope divided on phases that will be repeated three times. Since educational programs are one of the four projects that Wolfram BlockchainLab is devoted to, I can not have any doubt that they can deliver them without problem. ", "q1r": 5, "q2": "The idea of the project is simple and clear: provide research about what they call RealFi and share and promote it to the Cardano community. In my criteria, the topic is of real interest and totally aligned with Catalyst long term goals. Auditability is guaranteed  since they have to publish the research papers and arrange workshops to the community that will take part to learn and engage in the topic, but at the same time validating the success of the proposal. I couldn’t find any gap in this well elaborated proposal, and that is the reason for my assigned scores.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8755, "q0": "It is a real shame that there is no DeFi category for this fund. The proposers, who were not funded in Fund-7, have therefore decided to propose again under Miscellaneous. In my opinion this is a mistake, as it reduces the pool for truly unconventional and maverick proposals that should benefit from this challenge setting. As the proposal is essentially not creating anything yet with this proposal, but is asking for funding of academic research, this may have been better suited for  Open Standards or even Cross-Chain Collaboration as it is not Cardano-specific and addresses problems that exist across DeFi everywhere.\nThe Wolfram community is very niche and making Wolfram language a part of this proposal adds an additional layer of specialization which may hold back the adoption of RealFi research outcome of this proposal, even if its finding may turn out to be potentially useful.", "q0r": 2, "q1": "Very little information is provided about the research that lies at the core of this proposal. It would have been very useful to link research and accolades of the project's lead economist. A Google and LinkedIN search do not reveal any academic breakthroughs or noteworthy innovation or novel ideas since obtaining a PhD in 2005. Using Catalyst funding to introduce Wolfram language to the Cardano community seems inappropriate to me as we already have a similar tool with the use of Haskell and diverting funds away from Haskell research and community building towards Wolframs seems counter-intuitive to me when we are targeting growth of Cardano.", "q1r": 2, "q2": "The research planned is quite diverse and may be of interest to Cardano DeFi, Cardano for Climate etc. A lot of weight is given to the Auditability section which is good and (sadly) unusual. The most important question is however unanswered: how do we use the suggested metrics to measure what success looks like over the life of the project and improve execution by making changes and focusing on the most promising aspects of the research? A lot of qualitative targets like breaking up silos and bringing together economists and crypto communities should have been linked to quantifiable targets and a timeline.", "q2r": 3, "assessor": "z_assessor_696", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9677, "q0": "THe propsal by Wolfram Blockchain labs addresses the issues of research into redesigning DeFi for real-economy use cases, which include:\n\n1. Special Purpose Currencies for Matching and Clearing\n2. Smart Accounting Systems with Self-Sovereign Data\n3. Universal Basic Income for New Economic Relations\n\nI would say based on a previous fund proposal and subsequent re-proposal in the Misc category, that this Research proposal aligns with Misc ", "q0r": 5, "q1": "This is a request for research budget IMO, The team have published work and have experience from financial engineering to economists. Im confident that the study would yield \"some\" information. But would request that any finding become public, published in a non-paywalled journal or website and the findinds are presented to the Cardano community. Potentially in a way that \"may\" describe some sort of protocol or result that targets a RealFi approach . I dont understand however why Wolfram is not funding this? ", "q1r": 5, "q2": "Its very hard to gauge research project procession. However the team have provided metrics for study groups, publication metrics focued on Cardano, workshops etc. It would be really good if they (the team) can provide the data on this in an easy to understand way to the community and how they plan on getting people to come to these events. ", "q2r": 4, "assessor": "z_assessor_750", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Research & Workshops to redesign DeFi for real-economy (not speculation) that protects our natural environment and supports human dignity.", "experience": "Our team lead, Leanne Ussher PhD, is a published academic and has taught finance and monetary theory at tertiary institutions for over 17 years. She has publications and research in alternative currencies and is developing new systems for ecosystem accounting and governance."}