{"id": 400297, "author": "vadim", "title": "EcoSeed", "url": "https://cardano.ideascale.com/a/dtd/400297-48088", "category": 26441, "amount": 500000, "description": "We proudly introduce the brand new ECOSeed Cardano token. ECOSeed is designed to encourage responsible waste management worldwide.", "funded": 0, "upvotes": 22652118, "downvotes": 22217596, "votes_result": 434522, "votes_cast": 104, "f6_no_assessments": 4, "f6_rating": 2.166666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1703, "q0": "I'm afraid there appears to be a misunderstanding of what the Cardano catalyst funding mechanism is to be used for. This proposal would use up all of the challenge fund, mainly to pay for assets related to do with waste management. Although Cardano is mentioned as a means of tokenising payments, there is no detailed discussion on how this would work e.g. a white paper. Therefore my first impression is that this is an existing proposal that has been adapted and submitted to Cardano, without any real understanding of the Cardano Catalyst ecosystem or funding mechanisms. \nThe sad thing is the underlying proposal for a waste management system appears really well thought out, and so was maybe submitted to a general purpose fund previously. \nIt would make sense to resubmit this in F9 and separate out the funding for non Cardano related assets, then go into detail on the Cardano development specifics related to tokenomics and value exchange and also how it could be re-used by others wanting to run a waste management system. As it stands this proposal is a one off that couldn't scale and doesn't really add value to the Cardano community.", "q0r": 1, "q1": "This assessment is based on me having 30 years experience working in software development across the lifecycle: design, development, test & support for large enterprise and government organisations. Similar to the impact review, I have the impression that the work list to be carried out and the parties involved shows this is from a prior submission elsewhere. Whilst the people mentioned appeared to be skilled in waste management and project delivery, there is no mention of anyone with Cardano related development skills such as Plutus or Haskell coders that would be needed to deliver the proposal using Cardano. The fact this isn't even recognised as a risk - i.e. that they need to recruit developers, and may struggle given that competition to find them is hard, means that its unlikely this proposal would even get off the ground. Whilst there is a budget proposed, it is very high level and doesn't cover any of the tasks related to Cardano. Even the \"build website\" hasn't been broken down into capital and ongoing hosting costs. Suggesting that it's really a initial cost estimate, not a detailed analysis required to obtain funding at this scale. ($500,000). The proposal is clearly lacking any details on technology or architecture so it is impossible to assess whether it is a good approach. The system that is being proposed doesn't appear to be something simple, but instead has multiple actors, multiple waste sites and processors, so some kind of high level design and architecture blueprint with wireframes is needed to assess the approach.\nLastly there is no project schedule of dates or deliverable work packages or time boxed deliverables. Whilst there are some stages mentioned this again indicates this is an idea for something that needs to be developed more to become detailed enough for a funding proposal.  One specific phrase stands out that make me think the proposers need to get a better understanding of blockchain technology before resubmitting \"All actions in the project - financial transactions, points and ratings - all this is clearly recorded in the database and displayed in the public domain and updated automatically.\"\nIt suggests a collaboration partnership with an existing blockchain development team would be a massive help, and then we could re-evaluate a proposal to deliver something using Cardano, where Cardano hasn't been added as an afterthought. I would advise the proposers to look through other app development proposals on Catalyst in detail, and see what is being funded and what isn't to gain a better understanding of how to apply to Catalyst. Many applications of similar scope are delivered for well under $100,000. If we were assessing the ability to deliver a waste management system it would score highly, but it's delivering a waste management using Cardano, where the proposal is falling short. Don't give up, but do take time to become part of the Cardano community attending townhalls and getting to understand what other proposers are doing. In relation to this proposal I would also suggest joining the Cardano4Climate community as it touches on some common themes.", "q1r": 1, "q2": "There are some metrics defined, which are objective and could be measured. However these are related to usage of the waste management system, and misses any of the project delivery metrics. I.e. how would we track if the funds to develop the waste management system are being spent wisely? Catalyst payments are not a lump sum in advance and instead are paid depend on showing progress against plan. With the lack of a plan in the previous section, then its of no surprise there's no metrics to measure progress either. Ideally what the proposers need to do here is work with a partner that specialises in systems development to break down the work into tasks that can be developed using an Agile development approach. This will provide regular updates of the code to a public github library that can then be assessed by the community as completed. The agile approach should ensure that completed application functionality is release periodically prior to the project completion so users can provide beta test feedback.", "q2r": 2, "assessor": "z_assessor_1406", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 840, "q0": "This Miscellaneous challenge is open to a wide range of opportunities, including anything that aims to expand the Cardano community/utility.   This proposal requests $500,000 USD in funding, the entire Miscellaenous budget for F8, around the theme of tokenized garbage/recycling collection in Russia and third countries.  While I do think the theme is valuable and important, it will transparency element utilizing Cardano is not well developed in the proposal or attached documents.", "q0r": 2, "q1": "The proposals massive budgets are purposed for (in rubles which is very volatile at the moment) a number of expenditures ranging from construction, recycling plants, petrochemical/product production, and more.  What's missing from a proposal or this scale, perhaps most essential to measure the feasibility of implementation, is a detailed financial plan for analysis.  Also, the proposal states that the collaborators (at least 1) is a public figure in Russia.  Others are involved in the petrochemical industry, or with various Russian government agencies.  A fund supporting those entities directly at this time, especially given the recent war with Ukraine and the potential that funding may violate international sanctions, could pose serious threats to Cardano's reputation or position the network as a target of expanded regulatory activity.  Overall, excellent project idea, but perhaps the wrong time, people, location, and scale.", "q1r": 2, "q2": "Of all the project materials prepared for this proposal, the auditability section is noticeably the shortest, indicating that the author prepared the least amount of thought towards measuring success and transparency in fund use and impact delivery.  Again referencing the scale of this project, I think it would take nothing less than a dedicated team of business analysts to evaluate and audit progress for this project, since it's also mostly off-chain work being done in a place where very few people are interested/able to travel currently.", "q2r": 1, "assessor": "z_assessor_1224", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 979, "q0": "Problem statement is to encourage responsible waste management worldwide.  This is a large order.  It seems that the Cardano ecosystem is involved through the EcoSeed coin.  There are articulations in the attached materials of separate unrelated ways that the team is willing to promote the Cardano brand (through gyms/MMA matches) but this seems disjointed from the problem statement.  There seems to be a lack of KPIs as the goals are vague and without measurable outcomes.  However, there seems to be no other challenge this would fall under, so it is appropriately aligned under Miscellaneous Challenge.  I rate this as a 1 out of 5.", "q0r": 1, "q1": "The plans for this project are quite huge, it looks like the proposer has put a lot of time and passion into this!  However, I'm not sure I understand how the EcoSeed coin will work.  It is given with raw materials?  There are points and a rating?  How does the value of the coin increase?  I would like to see this organized into a chart, something visual to show how this coin has value...and more visuals to communicate the goals and objectives of this proposal as a whole.  The budget is unclear and does not seem to add up to the $500,000 requested.  This is the entirety of the challenge allocation – The team may want to consider breaking this into smaller, more measurable ventures.  It also stops listing monetary amounts as each stage is introduced.  This project has a huge team, but paying these individuals is not addressed in the budget.  There are many items that are not addressed in the budget that should be represented.  I am rating feasibility at a 1 out of 5.", "q1r": 1, "q2": "I like the idea of transparency, records, and statistics for the programs and financial transactions being made in public domain.  I'd like to hear more about specifically how that will be done.  There is no roadmap presented, and “healthy planet, happy people...” are not measurable goals.  I'd like to see specific goals that can be objectively measured to present accomplishment of said goals.  I need more objective information, rating 1 out of 5.", "q2r": 1, "assessor": "z_assessor_1250", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6389, "q0": "The proposal identifies a problem that deserves atention. The proposers explain a roadmap that details about how the project would cause impact to Cardano ecosystem. I think it's relevant the concern abould sustainable issues because we want to cause impact to the whole world not only to our ecosystem. This way, I think we can start a attract movement of people that doesn't know about Cardano that would discover it through this project. ", "q0r": 5, "q1": "The proposers explain the project by a clear and detailed roadmap that shows what are the phases, goals and budget. The budget was exposed using RUB instead of USD. Because of that it's necessary to convert the amount requested to USD to the community assessment.  The team is very diverse, that means the members have different experiences and knowledge that complements each other and increase the chances of success. In addition, they know the resources will be needed to implement the project. The proposers pointed some possible risks and challenges inherent in the proposal but they have reasonable plans to manage and mitigate them. In conclusion, the proposal presents viability. ", "q1r": 5, "q2": "The proposal exposed the targeted problem and a coherent solution to solve it. The proposers presented a clear roadmap with the goals but they could have put the deadlines for each one. In my opinion, the KPI's that they have chosen make sense due to the kind of project. It's important to remember that the indicators works in the best way if we use numbers to measure the progress of each phase. This way, we can look at the indicators and see if the project is being done in the right way and reaching the goals we expected to. One of that KPI's (indicators) may be the number in days of late in each phase of the project. This is a example of indicator that would need the deadlines specification to work. ", "q2r": 4, "assessor": "z_assessor_409", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "People have a low level of social responsibility in waste management. Therefore we offer the product ECOSeed new marker Cardano.", "experience": "My experience, analysis of life observations of the problems that surround us. Environmental protection, industrial work, participation in all waste recycling cycles, participation in research and development, volunteering is what I have been doing for more than 8 years."}