{"id": 400206, "author": "metaversal", "title": "Cardano Caribbean", "url": "https://cardano.ideascale.com/a/dtd/400206-48088", "category": 26441, "amount": 25000, "description": "Few people in the Caribbean region are familiar with blockchain technology and how to utilize it within their professions and beyond.", "f6_no_assessments": 4, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 573, "q0": "The idea is great and there is potential for a solution to a problem that will benefit Cardano and people from the region, my main concern is that this proposal would fit very well on the Cardano Community hubs challenge. Besides that I think the proposal has a potential for impact", "q0r": 4, "q1": "The proposer didn´t show any evidence to back up claims on his/her experience, that would greatly improve the proposal. Links are always appreciated. About timing, I would suggest not using summer as a measurement of time, since voters come from all over the world, I would suggest using a month approximation, just a small detail. Budget seems reasonable, but for an event of that price I should guess there would be several dozens attendees, if not hundredths. ", "q1r": 3, "q2": "Since no information about the proposer and no social medias are created on the event, yet, it will be very hard for the community to track the progress being done, at least for starters. I would suggest creating a demo website first, if possible, or at least a social media. Showing more info about the proposer will heavily improve the proposal as well, maybe add a team member too (look inside Catalyst, there are many).\nFor KPIs I would suggest having measurables ones, like number of attendes, wallets created, etc.", "q2r": 2, "assessor": "z_assessor_1190", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 839, "q0": "While I appreciate the thoughts presented in this proposal, as well as the community that it is intended to support, I slightly disagree that the use of funds requested has any focused relevance to Cardano - even in this Miscellaneous challenge.  Bringing a community of artists together to learn about selling NFTs on Cardano could be an educational experience for that group.  However, flights, accommodations, and curated event productions offer a small impact to the development of the actual Cardano ecosystem when considering that the group requires such a level of training, entertainment, and gifts to recognize the opportunity that exists for them in blockchain.  Also considering that most of the art NFTs sold online right now are digital art format - meaning the artist already have some level of tech savviness - I'm not sure the target market is even appopriate, and no examples of the artists were presented in the proposal that could help to evaluate in more detail.  This proposal may be more appropriately placed in the challenge \"Scaling-up community hubs\" there the objectives are a) Delivering information to people who would not otherwise have the access, and b) Ensuring resilience and self-reliance within that community.", "q0r": 2, "q1": "There is little information provided about the team behind this project, and actually no information presented about the author of this proposal or why they are interested in and relevant to this project.  In a comment about collaborations required to implement this project, the author only vaguely states that they have \"a gentleman in mind to assist me with the Discord and front end web development.\"  They go on to state that they also require assistance from the Cardano community with content, but no additional information or details is provided in this direction.  I do appreciate that the proposal author has gone to such lengths to conceptualize and present this opportunity.  I would challenge the proposer to develop the idea and team a bit more, and provide more information in terms of profiles of the target audience, and how the that can build conficence in the Cardano community that the impact more closely matches the request.", "q1r": 2, "q2": "The author's passion for this project is fantastic, and I believe they are well intentioned.  In terms of auditability, I believe this initial idea could be difficult to measure in terms of success.  As the author mentions that \"I plan to pursue it with or without funding,\" I think that could be a great opportunity to build some traction among your local community, document what was done, then pitch the expansion on those successes back to the Catalyst fund once you have a more clear understanding of the impact and how this funding can be used to amplify your impact/success.", "q2r": 2, "assessor": "z_assessor_1224", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 904, "q0": "The proposal sets out to educate people in the Caribbean on blockchain and help them implement it into their businesses. Both the New Member Onboarding Challenge and Business Solution Challenges offer funding for this need. With that said, the project brings much value to the Cardano ecosystem by expanding visibility, usage, and business partnerships. In addition, revenue will increase for the hotels and businesses around the hotels, cultivating strong relationships between the brand Cardano and the Caribbean. ", "q0r": 4, "q1": "The detailed budget, breakdown of events, and main event location is clear. It would be helpful if there was a goal date or month attached to the summer timeline mention. Being an NFT artist himself and a clinical embalming professor for 7 years shows his experience in the ecosystem and ability to teach a very hands-on job. When onboarding a new person into crypto, this level of care and patience is needed. Knowing how long the proposer has been an NFT artist for and be able to check out any current projects available would provide a bit more transparency. The proposer is aware of how covid travel restrictions could impact his plan as well. There were technical and subject matter experts mentioned as a critical part of the events success and budget breakdown, but the individuals were not identified for expertise review.", "q1r": 3, "q2": "Implementing project updates on the website and identifying success by number of art pieces sold is clear. An initial target number to achieve would be helpful to measure against however. The fact he will be pursuing this endeavor with or without funding shows his confidence in the desired outcome is strong. The proposers willingness to any community project audits outside of his region also shows trustworthiness.", "q2r": 4, "assessor": "z_assessor_1231", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5005, "q0": "The proposal successfully addresses a topic that is not covered in any other category. By expanding the reach of cardano to a place that currently does not have good education on the topic, this proposal is furthering the adoption of Cardano and fulfilling Cardanos mission. ", "q0r": 5, "q1": "It seems the proposer has a great concept of what they want to do and specifics on how they want to achieve it. However, the pricing seems a bit high for what this proposal includes. It seems the idea would be just as feasible without flight/ferry costs. ", "q1r": 3, "q2": "The proposal explains how the audit of this project will take place, by seeing an increase in the amount of art NFTs that are sold from the Caribbean. Once the website is completed, it can be even more feasible to track visits to the website, sales, etc. \n\nPerhaps the proposer could consider social media as an advertising tactic for the artists that are participating. ", "q2r": 4, "assessor": "z_assessor_1819", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Conduct digital and in person workshops in the region. Where individuals (eg. artist/entrepreneurs) and entities are introduced to Cardano.", "experience": "I’m a Cardano NFT artist who is actively developing my art gallery/studio on the Caribbean island, Anguilla. Over the past two decades I’ve also practiced as a licensed funeral director/embalmer in NYC and thought clinical embalming for about 7 years as an adjunct professor."}