{"id": 400388, "author": "rhysstoic", "title": "StakingDAO: Sustainable ISPO Tool", "url": "https://cardano.ideascale.com/a/dtd/400388-48088", "category": 26441, "amount": 35000, "description": "ISPOs have had a huge impact on decentralisation and the stability of the Staking ecosystem, is there a better way to manage them?", "f6_no_assessments": 8, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is clearly aligned with the challenge given its characteristics. We have seen the impact that ISPOs have in the ecosystem and this seems like the perfect solution to work with them so that all ISPOs benefit from funding instead of just a few ones that get saturated, and at the same time all users benefit from all ISPOs and can make informed decisions of where they want to delegate their cardano. This seems the perfect solution to minimise the effort needed to stake in these pools and not have to manage multiple wallets while at the same time trying to minimise any potential effects to network decentralisation.", "q0r": 5, "q1": "Firstly, StakingDAO is already a project that is under development and the team are well known members of the community with the relevant knowledge and experience in the cardano ecosystem to execute on their proposal and more importantly on the timelines provided in the description of the proposal. The information about the team described in the proposal is deemed sufficient with links provided to their social media profiles so that people can see their experience and involvement in the community. Budget explained in the proposal provides more than enough description and justification of each expense and how it will be used to fulfill the project and seems realistic and fair. Timelines specified are also detailed enough to get a good idea of how the project will develop over time and what are the main milestones to ensure a stable platform and solid governance mechanism is put in place. Overall team seems very committed to see this project come to life which will add a lot of value to the ecosystem.", "q1r": 5, "q2": "As mentioned in the previous question on the feasibility of this proposal, the information provided is very detailed and clear, and informs the public on how they are going to make this project a reality, how the money is going to be spent in the right things and how long it is going to take them to complete each important milestone. Additionally the explanation of the problem they are trying to resolve and how they are planning to do that is also very clear and concise and is easy to understand for anyone that reads it. Metrics and KPIs are also clear and thought through which is also important. The proposers have done an overall outstanding job at presenting their solution to a very well known problem in the community and hope to see it become a reality soon.", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "It's really an interesting idea that there are some of our friends from the community think about this ISPO solution. This could open a lot of potential by giving fairer treatments for stake pools in any ISPO participation. And, it could also grow rapidly considering the growing transactions in Cardano.  ", "q0r": 4, "q1": "The proposer and his team have been experienced as stake pool operators and IT experts (and Plutus Pioneer). The timeline and budget are clearly mapped out. This is a long project and needs to be taken into any risks that could happen during the implementation. The success is not when the platform works, but the DAO can facilitate the correct staking. ", "q1r": 4, "q2": "The milestones and delivery schedule are clear. The project has its own website and Discord channel. Any extra explanation to the communities could be delivered using the YouTube channel.", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "Considering the large momentum that ISPOs have had in the movement of ADA to and from staking pools, the development of tools to enable more fairness and decentralization in the ISPO process.", "q0r": 5, "q1": "The development and skills of Rhys is already noted through his various contributions in the Cardano community and the development of an ISPO tool to assist with fair and equal distribution of rewards through ISPOs is highly likely to succeed.  The admitted challenge would be through balancing pools in the ISPO to ensure fairness, but with additional tooling/planning this can be overcome.", "q1r": 4, "q2": "This proposal has a detailed breakdown of the way funds will be spent as well as a roadmap to provide milestones for the development of the tool from Testnet to handover to the DAO.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The idea of the proposal is to create groups of stake pools to both 1. promote also smaller pools 2. provide summed information for stakers/users about existing pools. The idea is perfect. I agree that with the current number of stake pools, it is hard to keep track on all of them, thus, users wanting to participate but having no knowledge could be potentially solved. Or, some of stake pools are expired, and it might be not so hard to miss this information. The potential risks I perceive is that it will be difficult to fight the large mainstream stake pool operators, who are providing more \"worthy\" rewards, comparing to new/smaller stake pools who are providing rewards e.g. on dripdropz that have no value, so the final traction of people will be dependent on a good marketing, and on similarly \"valuable\" rewards. Or, if the target group will be supporters of decentralization, then we have even smaller outreach and impact. But overall, a very good idea. If it would be possible to create partnerships with the bigger stake pools to attract traction at the start, then, I assume, it would be easier to reach the goal. ", "q0r": 4, "q1": "The team mentioned in the proposal is composed of three people, = stake pool operators, who are all having experience in IT field, with provided linked in profiles. \n\nThe roadmap is set till the end of 2023, so we are talking about longer term project, with schedule divided by Quartiles. Although, some detail is provided in all quartiles, I would recommend to be more specific regarding the first (atleast) 3 months, preferably 6 months. The longer frame could be left less detailed, but the closest time frame is lacking clarity - in Q2  22 there are 3 sections planned, so each is one month? In Q3 there are only 2, so it is month and half for each? Weekly time frame could have been outlined. \n\nRegarding budget of 35k, which is divided into groups e.g. front end development, backend development and such, we are missing expected time spent on these activities. I am aware that it might be hard to put precise numbers, but estimated interval could have been posted. ", "q1r": 4, "q2": "The success of the proposal will be measured by number of stake pool operators in the portfolio, number of delegators. \n\nNevertheless, there is no information about auditing the progress - maybe github, and if it will not be open source - then some weekly/bi weekly reports, youtube videos, or a blog once per two weeks \"what was accomplished\". ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This is a great proposal and should be well encouraged. I must say that the proposal should have been listed in Stake Pool Operation business related category. However, the proposal aims to majorly support small stake pool operators in general and any other pool. The ideal is build a platform a common front of a group of stake operators where delegators can easily delegate without fear of any risk and most importantly, ensuring improved decentralization status of the network. The platform will be governed by a DAO to ensure equity and fairness in the scheme of the things on the platform. ", "q0r": 5, "q1": "The proposal has given a detailed information as regards, the team's profile which shows that they have cognate experience and skill to deliver this project. In addition, am most impressed with the detailed plans and the stated milestones to be achieved within the stipulated timeframe. The budget and cost analysis however reasonable did not provide quantifiable basis in relations to the task, to arrive the estimates provided. The proposal made mention a very important risk factor in regards to equitable distribution although, no mitigation was provided but I believe this is an issue that will be resolved with this foresight. In general, I am convinced that the proposal will be effectively implemented accordingly.", "q1r": 4, "q2": "The proposal provided the core basis for measuring the success of the project. In addition, the stated Milestones are also good measure to monitor the progress and development of the project. However there should have been some quantifiable metrics to really measure the progress of the project. In general, am convinced with the information provided, the project can be reasonably assess by the community.  ", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The idea doesn't really fit into any other challenge and seems to be something beneficial for Cardano, so it's in line with the goals of this challenge. It is about creating a platform that aims to improve activities for ISPOs, as it would launch a network, as I understand it, in which members could connect with other groups, and could also participate in specific DAOs, distributing tokens through pools. The idea, as the author himself points out, will contribute to better decentralization and will benefit small pools - which aligns very well with the general objectives of the Cardano ecosystem itself, in my view, as our focus is really on decentralization. The proposal is very complete, because in addition to explaining the general idea, the proposer talks about how the implementation would be, presents a white paper and even cites more benefits for users, in addition to the main one. Therefore, the proposal deserves maximum marks in this regard.\n", "q0r": 5, "q1": "The script is average, not bad, but could improve a lot. Instead of the author explaining what would happen each quarter and so briefly, he could have broken down the time monthly and given more details about each activity. It would be a lie to say that it is not possible to understand the process, but it could have been better broken down for a deeper understanding. Talking now about the budget division, a very high amount is requested, the parts are divided into groups and each of them is determined in smaller topics. As in the script, the level of explanation is more basic, and can be much more in-depth. For example, in the marketing part, you could have been told how this project would be publicized. Which marketing campaign would be adopted here and why. In the development part (front end and back end) we could know how much time the professionals would dedicate to the work, in order to calculate the value of their working hour, for example. Speaking of them, the professionals involved, this part leaves a lot to be desired because the information is even more superficial. We don't know their full names, it's not explained in detail what they've done so far and how they get involved with Cardano. Although we know its main functions and linkedin profiles, it would be interesting if more details were attached.\n", "q1r": 2, "q2": "Auditability, in my view, is inadequate. To measure progress and ultimate success, basically the same indicators are cited: the number of ISPOs involved in the platform, which are being managed through DAOs, etc. Okay, but this information says more about the final result, when it would also be important to know how the path there was. How was the work, the development of stages, if the activities planned for each quarter actually took place, and were carried out properly... That is, a greater observation of the development process, and not only of its fruits. I would like this to be traced with qualitative and quantitative metrics, capable of evaluating the process in all aspects, and for such information to be easily available to the entire Cardano community. In other words, I believe that this final part of the proposal deserved a revamp, a real improvement, as well as feasibility.\n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is to fund a tool on the StakingDAO platform which allows stake to be divided between the SPOs that are members of StakingDAO. This proposal is separate to another proposal to fund the creation of StakingDAO. These two proposals seem to have a lot of overlap and ask for a total funding of $67,000. The SundaeSwap and MELD ISPOs did create some real issues for decentralisation, and any solution which helps to decentralise the network is welcome, however, it is only these big ISPOs which have caused an issue and I wonder if the biggest projects would choose to use this service. For the amount requested in this proposal ($35k), I don't think this offers a lot of value to the community. As a staker on Cardano I don't think I would use this service, but it would offer some very real benefits to stakers.", "q0r": 2, "q1": "The project seems feasible, although the stated biggest risk is how stake will be divided between the stake pools. I wonder what costs might be involved in this process. The team is a group of stake pool operators. Linkedin profiles are given.", "q1r": 4, "q2": "There are no auditability metrics until the project has been completed. Progress through the initial build should also be measurable. The KPIs after launch to gauge success are easy to measure.", "q2r": 4, "assessor": "z_assessor_80", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "To be completely honest, this proposal raises a problem which should be addressed by the entire community as a whole. In recent months, we have seen the proliferation of ISPOs, which, on the one hand, provide an innovative way to invest that gives investors access to projects with great potential that they would otherwise not have access to and, on the other hand, pose a new type of risk that threatens the decentralization of the entire chain. The team provides a simple and effective solution to this challenge by developing a platform that aims to simplify the process of participation in ISPOs for both delegators and diverse groups of SPOs while preserving decentralization. There is a strong connection between this challenge and Cardano's purpose. Congratulations.", "q0r": 5, "q1": "This proposal's proposed budget provides sufficient information and justification about each item and how it will be allocated to complete the proposal, and I believe it to be reasonable. Additionally, the timeline provided is comprehensive to provide a fair understanding of how the project will progress and what the key steps will be. As for the team, I believe it is one of the very best, with relevant expertise and excellent execution skills. They have included sufficient links to their profiles so that others can see their experience and community involvement. To sum up, I am confident that this initiative will be executed effectively.", "q1r": 5, "q2": "In a nutshell, metrics such as the number of delegating users and the number of SPOs that are available in StakingDAO are clearly outlined and well-thought out. The proposers have done an excellent job of presenting their solution to the problem at hand in a clear and concise manner. Moreover, the plan and the major milestones are clear and straightforward to verify, which makes it very easy for the community to monitor the progress of the roadmap after funding has been allocated. ", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a tool in StakingDAO to support better, sustainable ISPOs, enabling greater participation without the cost of decentralisation", "experience": "We are a small team of SPOs, Developers, Plutus Pioneers & DAO Contributors"}