{"id": 400468, "author": "defidiscussions", "title": "Wifi Infrastructure Paraguay", "url": "https://cardano.ideascale.com/a/dtd/400468-48088", "category": 26441, "amount": 30600, "description": "Wifi is far from universally available in rural Paraguay. Without wifi, ADA could never be implemented or introduced in much of the nation.", "funded": 0, "upvotes": 18632281, "downvotes": 20780877, "votes_result": 2148596, "votes_cast": 102, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"id": 4572, "q0": "To get introduced with cardano projects or investing in cardano projects interaction is very important, where only interaction media we have is through internet, hence this idea of setting up WiFi in school is a great initiative , where students can learn to use computer and can also get connected to real world internet , where they can even explore new ideas for future beneficiary projects.\nBy this students will get to know the importance of the cardano projects , by which students can even educate family members , friends about future of cardano, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Setting up a Computer Lab and providing WiFi system is not a challenging task as it needs just funding , since there should be instructor who must provide basic knowledge on how to use the system without causing any damage to the system.\nThe proposal can even add the block chain libraries to the system in the local file where students can check and learn the basic importance of cardano and can educate among them ,hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has introduced himself and has mentioned all the team members with whom he'll be working with , and their experience has been mentioned here, the proposer has been working since Fund 4 to Fund 7 which shows his interest towards cardano projects .\nThe proposer has mentioned the budget breaking in a clear manner, could have added more timeline ideas that will be implemented, the proposer even has excellent key indicators to measure the success of the model , hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8112, "q0": "The Wifi Infrastructure Paraguay suits the Miscellaneous challenge well as there is currently no category that will serve the infrastructure need. The project scope is not broad enough to sit in the \"Nation Building DApps challenge\". It will bring Cardano early adoption to the school students and the infrastructure much needed to complete this mission. There is a few challenges but with the connection of proposers team, it should be manageable to iron out those challenges.", "q0r": 4, "q1": "The timeline to complete this project aims at 4 months with some troubleshooting expected for a full completion in September. The proposal budget is high but reasonable as it involves the infrastructure ie. computer, setup and travel cost. The proposal could elaborate more in detail on some costs which are deem quite high. Despite the fact that the project has its own merit, the community needs to know that the project will be carried out with full disclosure and accountability. ", "q1r": 4, "q2": "Although several key items of this projects are identified as KPIs, the team has not provided it in quantifiable item and also they haven't mentioned how they would inform the community for its implementation. The Wifi Infrastructure Paraguay has managed to grab the scope of challenge and exhibit potential for cardano adoption although the community will need more precise detail to audit the project and that the project can be completed successfully. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8167, "q0": "Proposal to solve the problem that rural areas in Paraguay do not have widespread Wi-Fi. The solution was to install and maintain wifi in rural schools in Paraguay. This will allow students to connect with the Cardano community sooner. At first glance, this proposal may not seem to have a positive impact on the Cardano ecosystem, however, it is a continuation of the \"Networking / Education LATAM\" project https://cardano.ideascale.com/c/ idea /38439 has been funded from fund 7, both of these projects are closely related, so this proposal is a perfect fit for the challenge.\nThe proposal reflects the main challenge of the project is the lack of infrastructure in the area, and they also provide measures to overcome that challenge.", "q0r": 5, "q1": "The proposal provides a roadmap that shows the publisher a step-by-step plan to achieve clear milestones.\nThe team describes the qualifications and experience of each team member, each with significant experience and some notable members of the Catalyst community. It would be great if it is suggested to provide more links to Linkedin or Twitter so that the community has a more basis to evaluate the experience and qualifications of this project team. The implementation plan is simple and all the steps the team intends to take will be clearly understood. The requested budget of $30,600 is explained in detail, in my opinion, the requested budget is reasonable.", "q1r": 4, "q2": "Several goals have been outlined to measure success, although it would be nice to see some set up tied to specific metrics to see how delivery compares to pre-launch expectations. . (e.g. the number of schools that have installed the internet, the number of schools that have successfully integrated the use of computers into their educational programs.)\nTo some extent, the information provided can be audited, but it is more vague than specific.\nThis project will operate in a tangential manner with the project fund \"Network / Adjustment Amplitude\" 7 of the authors currently working in Ecuador and Paraguay.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10713, "q0": "The Wifi has become fundamental right to all human, still  50% of world doesn't know about it, The proposer idea of providing wifi to rural parts of Paraguay is great idea , only with internet everyone can get access to ADA, for ADA to be implemented and introduced much needed task,\nBy providing funds ADA value will be increased, Introducing ADA to school children is best way to create future, The proposer idea of providing WIFI access to Rural Schools and kids and implementing ADA for kids is effectively addresses the challenge.    ", "q0r": 5, "q1": "the proposer has planned and maintain wifi  only for 3 schools which is not satisfactory for fund requested, But providing computer is really impressive idea and by providing internet and computer will increase the skills of staff and students , Proposer wants younger generation to get access to block chain Technology, so that helps in development of Cardano ecosystem in future, the plan does faces challenge and not addressed clearly  how they provide infrastructure to most interior places, getting both ISP and electric industry in interior areas is not easy, They have not addressed how they overcome challenges , With given experience and plan  presented has challenges only after overcoming the proposal will be implemented succssfully. ", "q1r": 3, "q2": "the proposer has provided information on cost estimation of computers and  internet correctly, they even informing 20 computers to be given each school which is actually more for enough to improve skills of  staff and students, There teams including CEO has enough experience working on this previously,  many teammates already have experience in catalyst from F5,F6,F7,\nthe team has more than experience and have provided sufficient information to audit the progress and success of the proposal. ", "q2r": 4, "assessor": "z_assessor_992", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "We would like to install and maintain wifi in Paraguayan rural schools. This will allow students to connect to our community earlier on", "experience": "Defi Discussions LLC partnership with Techademia, Plutus Pioneers, 20+ of years experience in software engineering, 15+ of years DEVOPS expertise, counseled by Business Advisors, Marketing advisors, and Deans of respected Universities, F4-F7 Project Managers, Access to BoE"}