{"id": 400526, "author": "prometheus37", "title": "Restorative Workplace Environment", "url": "https://cardano.ideascale.com/a/dtd/400526-48088", "category": 26441, "amount": 20000, "description": "Diverse perspectives can lead to conflicts. Cardano lacks tools for transforming conflicts into opportunities for innovation.", "f6_no_assessments": 2, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 7621, "q0": "Seeing as this is submitted under miscellaneous, you can't really assess whether or not effectively addresses the challenge. So instead here, I will note that it is a worthy challenge to address. There has been a lot of unfriendliness in the community channels of late and that has, at times, created a toxic environment where I have seen, personally, first hand, smart people scared to make their voices heard for fear of being \"on the wrong side\" or shut down or worse still, trolled. This sort of initiative is really worthy and worthwhile investigating if nothing else. The funds required are small in comparison to what it could deliver (although I will assess those in another section). The impact of this, if successfully implemented will be global and benefit everyone - especially if indeed, we create an environment where the \"leaders\" are the propagators of the inclusive environment. But, the ability to scale will be a limiting factor. The asynchronous elements will be easy to replicate and scale but the synchronous elements will be a challenge. Not least because of language, social and cultural differences and nuances, but also just in terms of logistics. This isn't necessarily insurmountable, it will just require a lot of iteration and following the data/feedback to get right.  \nEither way, it's a very valuable thing to explore to try and be more inclusive and create a safe space for people to contribute. In fact, it's of paramount importance to the growth of the community and of Cardano. Regarding voting, this proposal is really, really lengthy. As someone who has been involved in designing and evaluating MOOCs for nearly a decade, I found this very interesting to read and very absorbing. I worry with the level of detail, however, the average voter will not bother to read it all and might miss the important punchlines. What would be good would be to include the most pertinent information up top as a summary - as they say - you should start with the punchline/conclusion to get your message across. ", "q0r": 5, "q1": "Yes. This first round is not proposing to be the final issue/program. It is going to be used to test and get a proof of concept and iterate. Therefore, I do think this will be implemented. Additionally, the proposers have some good experience and collectively, I trust that they will be able to put something out that will deliver against their goals. \n\nRegarding the budget. Overall, the cost is small however, if I were to dissect it, the hourly rate (albeit discounted) has been applied as a standard across activities. So the charge is the same for both facilitating and administration - which isn't common in the real world. That being said, the overall cost vs investment vs potential reward is low so I think the team will be able to deliver with it. I do however think that they have underbudgeted for the ongoing administrative tasks and I see no provision (yet) for any sort of technology (aside from a standard LMS which will work for the asynchronous elements) that will aide in automating any of the administration. It would be good to think ahead as part of this proposal a little bit - even if it's just from a tech wish list. Obviously, they have catered for the fact that the offering will develop in line with the preferences of the early participants. ", "q1r": 5, "q2": "This is a particularly hard thing to measure. The metrics listed are sufficient in terms of activity output to assess whether the team is delivering on the actual training but it is lacking in terms of impact metrics. One thing that is potentially a little crude, but still effective is a simple NPS rating. It can be used to track content and delivery development over time to see if it's being received well and enjoyed. The metric around surveys of experience goes some way to cover this but a cold hard number might be easier to track and understand. \nThe proposers do go into a fair few risks along the way of their proposal but it'd be useful to see these risks explicitly mentioned in a section of its own seeing as the proposal is quite hefty. For instance, it might be elementary but accounting for key person risks explicitly would give me more comfort that the proposers had everything covered. ", "q2r": 4, "assessor": "z_assessor_620", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10126, "q0": "The project is about teaching Restorative Practices, which can applied to improve the relationship between colleagues. Two foundational tools will be taught. Teams will be trained to utilize circle processes as proactive measures to establish respect, trust, and psychological safety. From there, they will learn a practical approach for responding to conflict. The culture of cooperation in any community is also a key factor to connect people together and make that community grow strong and sustainable in the long run. Catalyst Community also need these tools for its success. The project is also in line with SDGs, which be presented in the proposal. Reaching the SDGs is also one of the goals that Cardano is currently promoting. If the project is successful, we can expect that the bond between community members will be higher, the working and exchange environment will be improved, leading to people being more active in all activities of Catalyst. These things will make Catalyst community more attractive that many new people will join the community.", "q0r": 5, "q1": "The proposal explain extremely well about the Restorative Practices methodology and how they teach it to Cardano community. They explain their course in an understandable way which show their knowledge on what they are going to do. They have a detailed, actionable plan to act on it. In addition, the team member experience are really relevant to the subject of the project, which is present completely on the proposal. The proposal is really complete, which illustrated by the charts, which makes the proposal convincing. Their detailed budget breakdown is really detailed, sufficient, and auditable. They also have the risk analysis and action plan toward these cases. ", "q1r": 5, "q2": "The proposal includes a well-though and detailed roadmap which states that in each stage what they will do with their course and the expected outcome of it. The success criteria is well-defined with 4 data points. All of these things make it sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Restorative practices build skills that enable teams to strengthen relationships and transform conflict into opportunities for innovation. ", "experience": "Our team has combined experience of 70 years in leadership, training, and consultation with professional communities. As published authors and data analysts, we have consulted with cities and companies throughout the US to implement restorative environments. "}