{"id": 400585, "author": "fractalfuzion", "title": "The Alexandra Project WEB3 Library", "url": "https://cardano.ideascale.com/a/dtd/400585-48088", "category": 26441, "amount": 10000, "description": "Human Knowledge is important and should be backed up on the Cardano Blockchain, there are few if any decentralized WEB 3 Library solutions.", "f6_no_assessments": 4, "f6_rating": 3.4166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Proponents do not make it clear what would actually be developed here. They claim to have a project, called Alexandra (TAP), in which they are already working towards the dissemination of Cardano technologies to a wider audience, through the revolution of “blockchain publishing, decentralized education, content distribution, file collections and other web3 solutions for the fields of art, information, literature, science and technology”. This explanation is just as abstract. What publications are these? What content do they distribute? What examples of decentralized information and education can they tell us about? In a direct and objective way, it would be necessary for the proponents to have cited examples of the activities they develop, explaining the projects in progress, who the target audience is, in which places (countries, cities) they operate, specific examples that can prove how they has contributed to the dissemination of Cardano to a wider audience. They start talking about developing a library in Web3, I think the idea is fantastic, but unfortunately they don't develop tesa, that is, they don't explain how this library would be built, where, how the target audience would be reached, examples of contents that would be present there, in short, we don't know the characteristics of this new project; nor how Web3 would be associated with it. It is not clear what they have done so far, what they intend to do with this funding, or how they involve Cardano with everything. Therefore, I cannot reliably visualize how this proposal would impact our blockchain. In this challenge, we seek to finance projects that do not fit well with the other challenges, which may even be the case, but it needs to be very clear how what will be developed will help Cardano, in the sense of integrating new active members, increasing the number of transactions and Ada and CNFTs minted on our blockchain, increase investment in our Dapps, in short, help spread the mass adoption of Cardano. Therefore, unfortunately, I think that, due to the lack of explanations and clarifications, it is not possible to adequately understand what would be done here or how this would generate positive consequences for our ecosystem. \n", "q0r": 2, "q1": "The feasibility of the project is better than the impact. We have a very detailed roadmap, in which we can understand well what are the tasks that would need to be developed in the process of creating this library. I thought it was very positive how the proponents placed these activities based on weeks, because that way we have a very specific understanding of the whole process. Unfortunately, understanding the tasks doesn't make us understand the final product properly, we know what would be done and how, but not what the project would look like when it was delivered and how it would work from there. So I stand by my position on impact, it's very difficult to know how all this will have direct consequences for Cardano. Turning now to funding, I think this part was also good, the total amount is divided into some parts and these are well explained, for example: “$2500 to develop CNFT records of important Marcos Cardano. 100 hours @ $25 per hour”, we know what the hourly value of the professionals involved in this part would be; “$3500 to develop infrastructure to catalog web library 3 in human readable format - programming, web development, video, content distribution”, we know by which smaller parts the infrastructure development would be guided. Therefore, I think that, financially, the project is completely understandable, and I agree that the asking price was fair. Regarding the team, I think this part could have been a little better, because we do know some basic information about those involved, but more detail would add value to this part of the proposal. For example, “Thiscrazylife - Programmatic and Digital CNFT Artist. Creator of @TheRefreshCNFT, powered by Cardano, going to number 1 and burning questions.” As I understand it, they appended their nicknames, not their names. I would like to know the real names of each team member, we know in a basic way how they work, that is, in which professional area (if they are developers, artists, etc.), but we do not have a good explanation of their CVs, nor do we know their linkedin profiles (or even their portfolios in the case of artists); in other words, we have no means by which to confirm the information that is reported. Therefore, I think the feasibility is good, only improving the part of the presentation of the professionals involved. \n", "q1r": 4, "q2": "I think proponents are a good principle of process auditability in “the project will document the number of posts, likes, comments, video views, to track engagement and make all data available to the public with full transparency”. However, some doubts arise: where will this documentation be made? How will the Cardano community have access to such information, in a transparent manner, as mentioned by the proponents? I think they are already well on their way, all that was needed was to develop the idea, provide us with more details on how this process would be in practice. It would also be important, in my view, for them to report the work process, how their routines would be, if there were challenges, if all team members fulfilled their roles each week and so on. This can be easily monitored since we already have a very detailed roadmap, so we have a base of content to go by. Speaking now about the final results, unfortunately in this part the explanations are much more abstract, we know that the goal here is to create a Web3 library, “expanding the scale and scope of Project Alexandra”. However, it would be necessary for us to be more precise with the information to be measured, with more palpable consequences about success. How can we measure the expansion of the Alexandra project? What indicators will indicate that really new active members have been added to the Cardano community? Which Cardano technologies are being most adopted (digital wallets, Ada, native tokens, etc)? It would be necessary for the proponents to carry out a more specific study on the impacts of this proposal, both for their own project and for the Cardano ecosystem; and just like the partial results, the final results must be accessible quickly, safely and practically for all members of our ecosystem. In conclusion, my opinion is that this topic started well, but it got lost a bit, essential information such as where the partial results would be documented is absent, and the explanations about the success are very abstract, which in my view makes this proposal difficult to audit. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I believe it is super important to have open-source community projects on the blockchain for everyone to be able to have access to these collections of informative educational material.  Especially to have to wildly and readily available open-sourced information hub at any given time in one specific place. As it can be frustration seeking out information from various random sources trying to combine the information together. I know how thorough you are when it comes to educating the community and I believe it is important part of sharing the information in a way that is understandable to someone who is new to the Cardano blockchain as well as our more advanced community members. Keeping it fun and engaging is a key component went education community members. I would have liked you to break the budget down individually instead of grouping the amounts together. I think it would have given a clearly indication if they were broken down into subcategories. And I would have liked to see how the 100 hours to develop CNFT records of important milestones and 25 hours for the creation of the art to promote the library would be broken down per the 16 week timeframe.", "q0r": 5, "q1": "I would like to see a description/model of the equipment needed and the price of each item to ensure you have calculated a proper budget and researched the equipment needed for this proposal. I believe it is important to document Cardano milestones as it is history in the making. I would like to see a collective of NFT artist art from the Cardano Community members to support this part of your proposal while educating the creation of art to promote the library. I really like the idea of a having a global library twitter/Instagram/YouTube where members can access this information in a way that most fits their learning style. I have no doubts that the members who submitted this proposal will execute it in the highest and most effective way possible. I would be amazing if there was Multilanguage versions.", "q1r": 5, "q2": "I think having a weekly breakdown of tasks and completion dates would be helpful when it comes to auditability. I think it would be great if you were able to hop into a few twitter spaces and give weekly 5 minute updates if community members are willing to share their twitter spaces so new members know where to go to find this information. Great way to direct Cardano newbies. I like how you plan on providing receipts for all purchases of equipment, I really like that idea for auditability. I am looking forward to seeing you guys grow this educational material and I have no doubt that you guys are the perfect team for this proposal and will execute it exactly the way it should be done.\n\n", "q2r": 5, "assessor": "z_assessor_1596", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The aim of the proposal is to provide a platform as a global library of the content on Cardano. The proposal also plans to promote the platform as a destination for publications. However there are existing platforms which are able to achieve the same. Hence a differentiating factor is not presented.", "q0r": 2, "q1": "The proposition neither plans on attracting the contributors to the platform nor incentivize their contributions. The self-sustainable business model has not been put forth. The budget break-up is not satisfactory; \"25 hours x $25 per hour=$1000\"; further breakup of the budget should have been detailed. The experience of all the team members(4) required to carry out the project cannot be inferred from the details provided. The name of the project has not been conveyed properly; it is mentioned as \"The Alexendra project\" in the title and again in the Auditing section, and \"The Alexendria Project\".", "q1r": 2, "q2": "The timeline can provided can be used as markers for auditing, however budget details are inconsistent and insufficient. Specific target values should have been mentioned for various parameters that have been proposed as the metrics for success measurement. ", "q2r": 2, "assessor": "z_assessor_1748", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The Alexandria Project Web3 Library proposal sits well within Miscellaneous Challenge by providing infrastructure \"web3 library\" with tons of info (popular content) to the mass audience. The proposal has also addressed the risk of not being able to deliver the highest quality content. However, the web3 library has a potential for the big impact on Cardano in term of knowledge storage, art, education, technology etc. However, a little note to the proposer that the project title has a bit of typo and should be correct when having a chance.", "q0r": 4, "q1": "The team has twitter and YouTube audiences ie. Cardano Noodz and Fractal Fuzion. Cardano Noodz has knowledge or background in archeology and the archiving skill of documents  should be natural for him. They provide the reasonable budget breakdown and timeline to complete the project of 4 months. The proposer team major experience is in NFT space and some of them are stake pool operators. They know their craft and could make this project a success. This proposal is different than the general influencer proposal come across earlier as it seems to make the library access and not just asking for a budget to run their own YouTube channel or twitter space. For future proposals, please elaborate more on the products (library wallet) that the team will create. The catalyst community would be more convinced to back up the project.", "q1r": 4, "q2": "The project progress can be viewed on the TAP library. The equipment purchase will come with the receipt. They are transparent on what they spend and the plan along timeline to execute the project look plausible. The proposer understand the challenge brief of Miscellaneous challenge and the Alexandria Project Web 3 Library team should be able to finish its relevant tasks.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "blockchain publication, decentralized education, & the write of human knowledge. committed to the growth & development of web3 libraries TAP", "experience": "Cardano Noodz aka Diarpii {Co}Founder: AlexandriaTAP ; {Co}Founder: @inFiPool ; Ambassador: Tokhun_io author, artist, dude, dreamer, creative developer in the kitchen.\n\nFractal Fuzion is a CNFT creator, Stake pool operator, Shill-A-mania Champion, Cardano Stonerz club OG"}