{"id": 400507, "author": "bobpeace", "title": "Los Ángeles Cardano Community", "url": "https://cardano.ideascale.com/a/dtd/400507-48088", "category": 26441, "amount": 3600, "description": "Cardano has yet to go fully mainstream, especially evident in cities such as Los Angeles, where Ethereum  dominates the NFT/Crypto convo.", "f6_no_assessments": 10, "f6_rating": 3.3666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal would have fitted very well into the \"Scale-UP Community Hubs\" category and does not provide any idea outside of community building that justifies being in Miscellaneous. Some references are made to the Ethereum community that it wants to compete with, where another dedicated challenge category would have existed (Great Migration from Ethereum). It is therefore a poor choice, does not address the challenge and may have been put here either by mistake or because it was deemed more likely to receive funding.", "q0r": 1, "q1": "The individuals behind this proposal are credible brand ambassadors and believably \"larger than life\" as claimed in the proposal. Given the modest amount of funding requested, it is believable that return-on-investment and \"return-on-intent\" can be delivered. Web searches for Yuki, NFTSpeakeasy, Bob Peace etc. return very credible references that the proposers are indeed who they claim to be, and possess both the ability and the intention to create a vibrant Cardano Community - even if that would be limited to NFTs, I see no problem with that and consider it a worthwhile project given the budget.", "q1r": 5, "q2": "Assessing this proposal quantitatively will be very hard, as 10% attendance growth will not be measurable by the Challenge Team or IOHK and no starting base is given for this figure either. I still give the proposal a \"neither agree nor disagree\" rating as it should be possible to quantitatively judge the proposal given the active social media presences of the proposers and increasing integration of real life and social media communities in the metaverse and world of NFT artists. The proposal could have been improved significantly by using some suitable metric like number of tweets, retweets, social media mentions, appearances in print, footage of appearances uploaded to Youtube etc.", "q2r": 3, "assessor": "z_assessor_1243", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses a problem and solution that is not covered in any other category. The proposal also covers a topic that is necessary to fix. With LA being one of the largest cities in the USA, there should really be better solutions to learning about Cardano. Congrats to the proposers for taking on this challenge. ", "q0r": 5, "q1": "The proposal describes the main goal to have weekly meet-ups where people can learn more and discuss Cardano. It would be good to explain more about what subjects will be addressed, as a meeting where the same subject is talked about every time can grow old for those who wish to attend weekly. It will also help with advertising purposes and keeping the meeting on a strict agenda. ", "q1r": 4, "q2": "10% audience growth, as proposed, is a very reasonable number and a good goal to strive for. It is relatively easy to audit success when attendance is taken at each meeting. It would also be helpful to see if new projects pop-up on Cardano, as a direct result of this group. ", "q2r": 5, "assessor": "z_assessor_1819", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is looking to develop additional chatter around Cardano through community engagements in Cardano.  The Los Angeles community is a large one and there are lots of opportunity to onboard and drive discussions there.", "q0r": 4, "q1": "Since this is going to be handled through scheduled meetups, it's highly probable that these events can go on as long as they are planned through the proposers.", "q1r": 4, "q2": "Attendance is the only measurable metric and although it's a good lagging indicator, it might not show effectiveness beyond physical presence.  Additional metrics should be used to try and measure impact.", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The intent of this proposal is to \"spread Cardano word\" throughout Los Angeles, which is a great target city, by creating a local hub there, to be lead by proposal. While I think the idea is valid, it could better fit \"scale up cardano community's hub\". I understand proposer might have put it in the miscelaneous challenge for some reason, as, for instance, better competition with funds, but it is said in miscelaneous challenge description that \"proposals (...) that don't fit well any other challenges.\"\n\nHaving said that, I also think it lacks more explanation or details on what will be done in this bi-weekly meet ups proposed. What content will be discussed? what is the final expected outcome? will there be invited people outside the hub to dicuss on these meetings?\nThe risk/challenge identified is sensible and does exist but mitigation strategy is presented.\n\n", "q0r": 3, "q1": "There's no detialed plan or timeline for this project. In the plan part it is mentioned that it is addressed in the impact section but the impact section just describes proposal solution. A proper plan should be time framed, with a planning part, having acitivites listed, clear deliverables and milestones and none of these things exist in the proposal.\n\nBudget is broken down by mini summit, each costing 150 dollars to pay for beverage. \n\nThere are 3 committed people at the project team, with diverse background which is more than enough to run meet ups at a bar. Howeverm, more information on their connection and experience to Cardano could be provided to understand how well they know it how they will onboard new members.\n\n", "q1r": 3, "q2": "There are good kpis proposed, all of them with target, which is very good. I liked they will track attendence and propose a clear and simple way to check if project reached its final objetive: having projects launched at cardano. \n\nOther metrics as social media engagement and quality of the meet ups (feedback surveys) could aso be followd up.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This proposal will probably fit best the Community Hubs challenge. The miscellaneous challenge tagline is: “How do we create a space for ideas and projects that do not fit any of the other current Challenges?”. The problem is well defined around how to create some concrete awareness for Cardano. The solution however is a bit less defined “Spend time at local, trendy ……Draw others toward Catalyst.” How spending time will attract people, what will be the content of the bi-weekly meetings are some areas that need more explanations. The KPI of at least 3 new projects ready to launch on Cardano by the end of the term is good but also here lacks some more explanations for example, will it be launched on Catalyst or Cradano and what type of projects. \n", "q0r": 2, "q1": "The team seems to be great for the proposal and will definitely seem to be able to arrange a fun ambiance and initiate discussions and interests. Seems knowledgeable about blockchain and Cardano. The 3 seem to be a great team to lead those meetups. The budget is mentioned for 6 months (although very reasonable) but the proposal, it is mentioned that: “3 month duration of the campaign”. I am not sure thou how they are going to achieve the KPIs of at least 3 projects' launch - will they have follow-up meetings with interested people? How they will further support interested people. The information could be quite overwhelming and meeting in a casual environment might initiate interest but need some follow-up work. The proposer has considered one main challenge but there are others as well such as following up on interest and providing additional information. The proposal could have great to consider some sort of a lead generator that can then continues to be processed by the proposer or other partners in the community.  ", "q1r": 4, "q2": "10% monthly attendees growth from which base number? Need more information. Also regarding the 3 project to be launched on Cardano by the of the term, we need more information as mentioned above. The problem is well understood but more details are needed in order to explain how the meetups will help to actually launch projects on Cardano. Sharing information is important and the first steps but need more in my view. ", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is aiming on promoting Caradano in Los Angeles establishments - and spread information about it, growing community. These meetings would be held weekly. Unfortunately, there is no more information whether it will be held in a bar, or bars, or dedicated discussion rooms. Also, the information about how to attract people is provided only by 150/night budget...which is used to inspire new people to come. So you feed them, they come. You talk cardano, and somehow they end up proposing in Catalyst. Unfortunately there is no description how to ensure or aim to attract people actually capable of delivering solid proposals. Therefore, people proposing in catalyst would be a completely random result.", "q0r": 2, "q1": "The team is consisting of three people, while organizing a meet ups is part of their experience. I find it sufficient. Nevertheless, more information to provide clarity is missing - at what places is it going to be organized? Will it invite some speakers, and have some organization flow? Or it will be open discussion? Regarding the budget - 150 for what? Is it just refreshments? And how long it is estimated for these meetings? 1 hour session? two? If we are talking purely about \"organizing meeting\" I think it is feasible. ", "q1r": 4, "q2": "The proposal claims, that the progress will be measured by attendance. Also, the number of projects launched from these meet-ups as a result. These are definitely useful metrics, but 10 % monthly growth is somewhat unclear - given that we have no idea what is the estimated number of people. What if only 8 show up? I would leave the \"specific\" increase/decrease metric not used, and rather just follow the trend. To ensure 10 percent growth, there was actually nothing mentioned how to expand, so it might be also element of \"hey, free food, come chat\". \n\nThe success is described to be measured as \"headlines\" about Cardano. Unfortunately, there is nothing in the proposal what would suggest that it is its aim, thus, even if there are headlines about Cardano, I am not sure how we would relate it to this proposal. \n\nFrom my perspective, metrics about attendance will measure progress. The success will be measured by active Cardano community members, who are not here for food. Additional metric could be to have some partnerships, collaborations, or having some speakers invited and attended, or, having a stable community. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is a great idea, a one of a kind, bringing together the Arts Music and Crypto together and the networking in a cozy environment sharing and discussing Cardano and it's values and possibilities in a city known to be prominent with Arts, Music, Media and creatives. With such combination, the potential benefits are limitless leading to more adoption of the ecosystem with nfts, music, arts, fashion etc. However it believe this proposal should be listed in Cardano Community Hubs related campaigns for a project that spans 6months dedicating to onboarding new members into the economy.", "q0r": 5, "q1": "The proposal is simple awesome idea in a highly social city and with a team that is well experienced and skilled in such ventures, it is pertinent to think that the project is worth giving a chance and of course, from the information provided, it is very likely that the project is good hands. The budget is reasonable and analysis is quite realistic coming from experienced hands in such field. The main risk factor presented was rigour of tracking the performance of the events regarding the attendance which shouldn't be a problem if the events are well planned. ", "q1r": 4, "q2": "The proposal has provided some core basis  to monitor and judge the progress and success of the project such as Cardano being in the Headlines, Media Buzz  and the connections leading to more adoption of the ecosystem from artistic and talented participants. In addition, there were some modest and relevant Success Metrics provided, that is more than enough to assess this project effectively if funded.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Unfortunately, this proposal contains several negative points. First, it doesn't fit the challenge, it should have been launched in the challenge of new members on board or even in the community hubs (after all, I believe the target audience here is very specific). Then we know the general idea of ​​the thing (which is great): popularizing our blockchain in Los Angeles, where Ethereum strongly dominates. However, it is not explained exactly how this would happen. What would be done? Who would? How would the target audience be attracted? How advances would be measured (proponents say there would be a measurement of ups and downs in terms of adoption of our blockchain and currency, but they do not explain where they would notice and monitor these variations). It is not clear what the weekly meetings would be like, where they would be, what topics would be covered in each; nor in the feasibility part, where the roadmap was expected to clarify this, are we aware of such information. Therefore, unfortunately the proposal is very abstract, despite being something that could be important for Cardano, it should have been explained much better, so that we understand how the main idea would be put into practice.\n", "q0r": 1, "q1": "The viability of the project is very low. as I mentioned in the impact, we don't know essential details about each meeting; where would they be; how the guests would be captivated to participate and keep in touch, who would expose the content (probably the proponents mentioned in the team, but it would be interesting to understand if they would invite outsiders as well); and the main thing in my opinion would be to define which subjects would be specifically addressed at each meeting, so that we could understand how the target audience would learn about Cardano and adopt the use of our blockchain. Talking about the budget, the asking amount is quite low, weekly meetings for 6 months would cost 3600 dollars, however we don't know how the money would be used. The proponents say that maybe there would be money left over, but what would they pay at first? How much would each meeting cost, would the rent of the meeting place be paid, would the professionals involved in the presentation of content be paid...? Finally, regarding the team, we know some information about them, but not enough to convey confidence, since it is not clear how they are involved with Cardano and why they would be prepared to carry out these events, disclosing our blockchain. It would be necessary for the curriculum of each to be better presented and for this relationship to become clearer.\n", "q1r": 1, "q2": "Unfortunately, this topic is also not good. The data traced to measure the process is very scarce, with the growth of participants in the meetings and the minimum of 3 projects launched on the Cardano blockchain during the 6 months, from what I understand. In my view, this says about the measurement of partial goals, but not what is behind it, we need to understand how the pre-production of the meetings would be being done, if the money was being used properly, if each professional involved would be doing the activities that were assigned to him... Anyway, really the construction process, little by little. Proponents would need to constantly inform the Cardano community about these updates, preferably weekly. And about the end result, the proponents don't make it clear how success would be measured, we know that popularizing Cardano is the goal, but through what palpable indications could this be proven? I would like them to analyze the growth scenario both qualitatively and quantitatively. In general, everything is pretty abstract, in my opinion.\n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "If one takes into account the profile of the exhibitors who are invited to web3 events, one can realize that artists and art in general are given a privileged space.  Art will always be one of the elements that started the fire.  Therefore, I find valid aspects in the proposal related to making artists a meeting and conversation point of our ecosystem.  However, I do not find a consistent implementation structure, a plan with specific steps to execute and measure, independent of the final result.  There is no spirit of execution, only of conversation.  \n\nI have to confess that my initial knee-jerk reaction was: total budget $3600? give them the money!  However, the more I read the content of the proposal and its lack of structure, the more the proposal reminded me that this is not about the money.  Every funded lovelace should have a mission.  At least we should try to make it so.  So without a plan there is no clear execution and without clear execution there is no measurement.   Without a plan, there is no clear purpose.     ", "q0r": 2, "q1": "The details provided in the Roadmap and budget are sparse.  A specific description of the meetings to be held on a weekly basis is absent.  Some sort of rationale behind the $150 per week for each \"mini-summit\" is equally absent.  What is \"Humble Records\"?  What will be the structure of the conversations after buying drinks to the fellow patrons? (it is ancient wisdom that a drink or two will never be enough). Many unknowns in the execution process. Some light would be shed by an initiative such as paying artists with ADAs which would force them to open a wallet, which would lead them to engage with the ecosystem, which would induce a conversation about Cardano beyond a bar conversation. ", "q1r": 2, "q2": "The KPIs provided by the proposal are more concrete than the KPIs presented by many other proposals. However, it is difficult to establish any certainty of achieving results without a defined execution plan.  Nevertheless, I must make it clear that I notice in the proposers a real intention to contribute to the development of the Cardano ecosystem and the growth of our community.", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "For the Cardano ecosystem to get to its right position within the blockchain fraternity there need to be a few relevant innovations to get it going. The idea of spreading at the time people are relax is a good initiative and the challenge seeks to embrace ideas to that effect, so this proposal fits in well.", "q0r": 5, "q1": "The proposal seems quite feasible because there is a number of people already involve in the entertainment arena. My only issue is whether these folks will be ready to absorb what is being relay to them as most of them will be there to relax and not ready to learn. ", "q1r": 4, "q2": "The number of years of experience of team and the plan outline makes the project viable. The requested funds and budget break down is reasonable, and the proposal had even stated the use of extra funds should there be any.", "q2r": 5, "assessor": "z_assessor_270", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Spend time at local, trendy establishments in L.A. to inspire new creatives to launch projects on Cardano. Draw others toward Catalyst.", "experience": "Thirteen years industry experience; performed with Jon Fishman (of Phish), NPR airplay, main reward in Pacifica pledge drive; released on Cardano 21-now performed at L.A. summit. Well positioned to politic with Los Ángeles creatives why Cardano is perfect for their next endeavor."}