{"id": 400695, "author": "nicoarqueros", "title": "Milkomeda Hackathon", "url": "https://cardano.ideascale.com/a/dtd/400695-48088", "category": 26441, "amount": 45000, "description": "Cardano TVL hasn't catch up with Cardano's position by market cap.", "f6_no_assessments": 5, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal may be more appropriately placed in the challenge titled \"Developer Ecosystem\" since it targets more technically inclined audiences to build a community around the theme of prototyping and solution development.  From a reviewer perspective, the proposer also talks about Milkomeda and dcSpark as if I should be already familiar with what that is and who is involved with it.  The idea is not developed in great detail and more structured plans would help to evaluate the impacts of implementation.", "q0r": 2, "q1": "The proposer comments that money is not purposed for the team, but will instead by used as prizes (misspelled as \"prices\" in the proposal) for winning teams.  There's limited detail about the implementation plan, target audiences, reach, or metrics to evaluate successes.  If the plan was more complete and used to gain support of the Cardano/Catalyst community, I would agree that a hackathon could be an excellent way to build the developer ecosystem around a project that supports Cardano overall.  My personal experience organizing startup pitch nights is that the sourcing can be the most challenging part, and I think the impact and implementation will be heavily dependent on the proposers ability to not only attract a number of applications, but to attract the right kind of high quality applicants.  So more detail on this initiative could give me confidence in an impactful implementation.", "q1r": 3, "q2": "I would love to see a project like this happen, and appreciate the proposer took the time to conceptualize and propose this to the community.  While the vision for successful delivery and positive impacts may be well developed among the team, I'm not convinced they have taken the time to develop an idea to pitch to the community which has enough substance to say for sure if the project was successful or not.", "q2r": 3, "assessor": "z_assessor_1224", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "[Note: This proposal is identical to \"DeFi hackathon\" ( https://cardano.ideascale.com/c/idea/400672 ), except a slight alteration in the problem statement. As a result, the assessments for both of these proposals will also be similar to a degree and discussed together in some sections.]\n\nHackathons are great events to connect people and bring new and exciting ideas to the Cardano ecosystem. Although, there is little details provided about the hackathon other than that it will help with the deployments of projects and boost adoption. Questions that arise when reading the proposal are among few: What are your target audience within the community? Existing projects that should be built on top of Milkomeda? New ideas that entrepreneurs are looking to implement but lack the technical knowledge currently? \nThis should ideally be stated more clear in the proposal. Lastly, this proposal does align with the Misc. challenge setting and is related to Cardano. But a there is questions that remain unanswered in the proposal and the score will be neutral. 3 stars given.", "q0r": 3, "q1": "The feasibility section of the proposal is sparse and not much details are given to increase the credibility of the proposal, which is unfortunate. The proposer have submitted their Hackathon idea in two different categories as mentioned. However their \"detailed plan\" overlaps and if both projects were to be funded, it is implied a website would be built (from scratch?) for each hackathon. The same issue can be applied to the planning and promotion of the event. The similarity is strong between the proposals and a lot of assets could be reused. More transparency regarding this matter would be strongly advised.\nAnother issue that is not addressed in the proposal is that the proposers asks for 40000 and 45000 dollars for the two proposals but it is stated that the funding will be solely used as price money for the top projects. That is, the proposers claims that they will spend 4 months of preparatory work + 2 hackathons without any compensation. This should be questioned, and the proposers should clarify why they are willing to spend this amount of time without receiving any compensation.\nThe proposal is not credible in its current state, therefore, the feasibility of the proposal has to be questioned. As a result it, has to be given the lowest score: 1 -star.", "q1r": 1, "q2": "From an auditing perspective, the metrics used to measure the success of the hackathon are clear and easily measured. However, the section is quiet sparse in the proposal and success is defined as \"At least 20 projects apply and at least 10 deploy their solutions.\". It can be questioned what the definition of 10 deployed solutions is, since it is a very general statement. Is this 10 successful and completed projects or is it POC's? When are they expected to deploy their solutions? Within a week, month, year? Additionally, depending on the definition of a deployed solution, setting a goal of 50% of all applicants providing a deployed solution sound pretty ambitious. It is not negative to set ambitious goals but it might be challenging to achieve. Overall, the auditability of the proposal measurable but the details provided in the proposal is sparse and the score will be set to neutral. Score given: 3-stars.", "q2r": 3, "assessor": "z_assessor_139", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement mentions an acronym that may be unknown to many (TVL), this ends up making it difficult for the community to understand the concept. TVL = total value locked, i.e. the amount of crypto is allocated in smart contracts of a given blockchain.\n\nIt is a fact that Cardano's TVL is far below other blockchains, as can be seen on the website https://defillama.com/ and that the development of a hackathon has great potential to stimulate the development of projects and consequently increase the TVL on the Cardano blockchain.\n\nI would recommend that the team indicate references of what a low TVL would be and reinforce that the implementation of smart contracts in Cardano is still extremely recent and that several optimizations still need to be implemented so that greater liquidity is provided in the dapps, today scalability is one of the bottlenecks that suppresses the rise of TVL, so I would recommend that the dcSpark team take more care in providing information so that the community has a good understanding of the proposal.\n\nit is difficult to carry out a proper impact assessment as the proposal itself is a draft and there is no structured and detailed plan. In my view, the goals of at least 20 projects being applied and at least 10 implementing solutions seem to be reasonable goals, but there are no qualification metrics for these projects, what to expect from them, what will be the output/impact? This proposal was built on the premise of a low TVL, why not put TVL as an output/target for impact assessment of these projects?\n\nIn summary, I see an idea with great potential, but due to the lack of details, metrics and KPIs its impact is uncertain, so I will set my score as 3.", "q0r": 3, "q1": "Although the dcSpark team is known, capable and has a great reputation in the Cardano community, this proposal does not contain enough details and references about the qualification of the team. I believe that community advisors should treat all proposers with the same criteria and unfortunately dcSpark has created several proposals, at least since Fund6, where there are few details and poorly structured plans and although I trust the ability of dcSpark members, Catalyst it should not be about blind trust, but about evaluating proposals.\n\nWith that said, I would recommend that the dcSpark team provide links and references to their work, so that the entire community (including new members who are not yet familiar with dcSpark) has access to their CVs and achievements, as this would only increase the trust of the community in the team's capacity.\n\nThere is no mention of how many and which dcSpark members will be involved in this proposal.\n\nThe only budget information described in the proposal is: \"The money will be used as prices for the top projects. No money will be kept by dcSpark.\"\n\nI assume \"prices\" would be a typpo and prizes is the correct word.\n\nAlthough the entire budget is allocated to the projects participating in the hackathon, there is no mention of the division of money among the participants or eligibility criteria for participation.\n\nThere is a timeline, but it is extremely vague and there is no solid plan that describes how the hackathon will be organized, without the detailing of this information it is not possible to support the feasibility of this proposal.", "q1r": 2, "q2": "I do not consider the roadmap and milestones described in this proposal to be reasonable and appropriate. 1 month to plan and create a website + 1 month to promote and the hackathon event itself doesn't have a clear date (would it be right after the end of the promotion stage?)\n\nThe goal/metric of at least 20 projects apply and at least 10 deploy their solutions are appropriate and reasonable, but as I mentioned in the impact assessment, there is a lack of goals/benchmarks/KPIs that allow indicating the success of the projects created in the hackathon, in addition to harming the impact assessment also compromises the ability to audit the success of the hackathon, so I would recommend adding these items to the hackathon award-winning projects, eg TVL of the developed projects, number of commits, number of users (unique addresses) that interacted with the scripts, etc...\n\nI clearly understood the problem and solution presented, but as the proposal does not explain what TVL is, I imagine that many people do not have/can understand the concept, so I would recommend that the team create a glossary whenever there are acronyms/abbreviations in the proposal .", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is proposing hackathons to promote developer onboarding and activity on Cardano, and hence promoting developers to build on Cardano. This will eventually bring up the TVL (total value locked) on Cardano blockchain. For the last few weeks Cardano TVL is reaching all time highs, however, given that Cardano is a top 10 blockchain, there is still a lot of gap to be filled (currently at number 28), which I am sure will happen sooner than we can imagine. \n\nWith new projects and proposals such as this, various teams are working tirelessly and onboarding more developers to help build on Cardano. DcSpark is the entity behind the Milkomeda (a Layer 2 protocol that brings in EVM interoperability to non EVM chains such as Cardano). \n\nThis project already has Milkswap launched recently, so I can assert that this organization is deeply involved in positively bringing a lot of value to Cardano. This proposal, in my opinion, is another step in this direction. Therefore, I strongly agree that this proposal adds value to the Cardano ecosystem.\n", "q0r": 5, "q1": "DcSpark has also organized several hackathons in the past, and as an active Community member and Plutus pioneer myself, I know that they are a very trustworthy team which has helped a lot of new developers onboard and build on Cardano. \n\nNevertheless, the plan that is provided there, in my opinion, could have been written better. It seems to me that this proposal was written in a hurry OR not much attention was paid. E.g. 1 month to plan and create a website, but what website ? What will this website show ? What do promotional events look like ? Such details are missing.\n\nTimelines, are realistic and other than the above points I agree that website development and promotion should not take more than 2 months, but the detailed budget allocation is not provided (e.g.  how the number $45k was reached). I would suggest to the proposal team that even though you have done amazing things for the Cardano community, It would be great to be as elaborate as possible in your proposal write ups. Additionally, the risk section is well explained and the proposer has proposed to collaborate with Milkomeda investors to promote these hackathon events.  \n\nExcept the above points that I raised, based on the DcSpark hackathon events in the past and their plan presented here, I agree that this proposal will be implemented successfully. I am not strongly agreeing however, because I think there could have been more efforts put into the write up of this proposal.\n", "q1r": 4, "q2": "The timelines are pretty easy to track in my opinion. There are mainly 3 points given, out of which first two are split each one month each, building website and promotion for the hackathon event. Third and final step is to organize a hackathon itself. I do not see any issue in tracking this work chart.\n\nAs a senior developer and active community member, I find it very helpful that they have provided details on how many projects will be built and finally how many they expect (minimum) to deploy on Cardano. In my opinion this will be just a beginning, because such events are crucial in triggering a chain reaction of more developers onboarding and building on top of Cardano. Therefore, I strongly agree that the information provided is sufficient to audit the progress and success of this proposal.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "Hackathon is a great idea! This proposal can to attract other blockchain developers to build on the Cardano Ecosystem. As defiprime.com mention that DeFi protocol on Ethereum networks are still on the top rank with 203 projects (BSC = 43 and Polygon = 45). With Hackathon, Milkomeda will be like first layer to filter great projects in DeFi, gameFi, etc in Cardano ecosystem.", "q0r": 5, "q1": "I personally knew Milkomeda and dcSpark track record in supporting Cardano's ecosystem improvement. But please, at least proposer can create better proposal following the guideline Catalyst team have been build. It would be unfair if other proposers took countless hours of work to come up with a better proposal, while the other proposers made proposals like this one. Come on, man! Put some link for your dcSpark website, detail budget for Hackathon winners (prize 1, prize 2, ...). With this kind of proposal, newly onboarding CAs will rank this proposal as low as they could! While we know you are some reason Cardano keep evolving!", "q1r": 2, "q2": "With hosting a virtual hackathon for individual developers and companies, it will attract the interest from other blockchain developers to create projects on Cardano. While the proposer not describing the roadmap and the KPIs, we can find two key metrics explained generally, but where can I track your progress / or key metrics? Any link about that is useful for us auditing your projects.", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Milkomeda Hackathon will help with the deployments of projects that and boost adoption in Cardano.", "experience": "The team behind dcSpark has worked organizing hackathons (AngelHack) and also acceleration programs. Also previously, one of the team members was leading blockchain investments at Emurgo."}