{"id": 400801, "author": "rg.admin", "title": "Research Guild: Outlier Report", "url": "https://cardano.ideascale.com/a/dtd/400801-48088", "category": 26441, "amount": 51609, "description": "Cardano values academic rigor; however, the Catalyst community lacks a coordinated macro-strategy to leverage outlying intellectual capital.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is appropriate for the Miscellaneous category, as none of the other categories focus on accelerating Cardano's capacity to engage in traditional research practices. That being said, it must also be noted here that this proposal is directly in-line with an important priority for the entire Cardano system: A commitment to academic rigor and a willingness to invest in it appropriately. As someone with professional familiarity with scientific institutions and academia, I find it quite promising to see a proposal here looking to fold these practices directly into the Catalyst system by establishing an entire new institution in the form of a Research Guild. ", "q0r": 5, "q1": "The proposal team appropriately lays out each team member's qualifications and research interests. The budget and pay system is carefully thought out and the mathematics of it is spelled out for readers, with sources to show the research done to arrive at the figures. The, quite expansive, to-do lists include every conceivable priority for a research project with an eye toward establishing an institution that can provide intellectual resources to their community. I dare say this team has demonstrated the value of rigor by practicing it here, for us to see.\n\nOne question I had, which does not detract from the value of their proposal at all: Will the draft reports be publicly available? I know this can be a touchy subject in academia depending on all sorts of factors, but in the interests of the open science ethos of blockchain I think it would be a nice bonus if drafts are announced and publicly shared as they were developed so that everyone can see the process in action. This could only enhance the credibility of the team as individuals dedicated to transparency and the Cardano blockchain.", "q1r": 5, "q2": "The KPIs provided by the team are numerous, from reporting templates to a dissemination portal to a concept map. As the project finalizes its impact on the community, with these numerous resources, should be visible and even measurable. The one thing I would like to see that is missing is a timeline with target dates, and if the project is funded I hope these will be added.", "q2r": 5, "assessor": "z_assessor_1275", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "NOTE for VCAs and voters: The Research Guild is a network that has launched 6 proposals during this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider Research Guild framework. My assessment takes into account aspects common across all proposals (the network’s organizational aspects, competency, research approach, workload, or similar reporting mechanisms and budget logic). You shall therefore find common parts across these proposals and parts specific to each proposal.\n\nKey takeaway: a somewhat weak problem identification (with so many already known areas that need funding), somewhat alignment with the challenge (very out-of-the-box anyway), unsure potential for added value for Cardano.\n\nThis proposal aims to deliver a report that captures outlying intellectual capital, defined as (1) ideas that reside outside of Catalyst’s challenge scope; (2) promising ideas that were not voted upon in passed funding rounds; (3) potential ideas that require support to become more fully developed, (4) promising ideas beyond the scope of this list.", "q0r": 3, "q1": "Key takeaway: A solid academic-oriented team behind the proposal, a clear plan and recruitment process for the actual researchers and a reasonable timeline for completion. But a rather fuzzy research topic to begin with. \n\nThe plan. The core team consists of 3 PhD / PhD candidates from Auckland University, Renmin University respectively University of Osnabrück, all currently undergoing blockchain-oriented activities. They would NOT conduct the research themselves, but instead they would extend invitations to their networks of academic and professional colleagues to participate in the actual research. Perhaps the standout of the team is the wide-net that they can cast within their own respective networks when searching for viable research candidates. They would subsequently undergo a recruitment / selection process based on received resumes / review of academic work published / blockchain experience. The actual work itself would be undertaken by this collective of independent researchers onboarded as above. \n\nBudget talk. 20% of the budget would go towards building the research network (research identification, outreach, project management, support, designing reporting templates, etc.). 80% of the budget would go to creating tailored research projects following a loosely based pathway which makes sense considering the knowledge-building capacity of the project. Payment for individual researchers would follow a determined base hourly rate, based on the average of online surveys already undertaken. There are extensive figures offered in the proposal, but the key figure to remember is the overall base pay of USD 32/hour and US 60/hour for highly specialized work.\n\nThe team estimates that the report will take six months to complete: from May 2022 until November 2022. There is a detailed project roadmap outlined in the proposal, with great granularity down to weeks necessary for each intermediary step.", "q1r": 4, "q2": "Key takeaway: very clear roadmap and extensive KPI list, great verification potential and clear communication channels for work undertaken.\n\nThis work will be delivered in the form of a public report with key research insights and recommendations that can be implemented by the community immediately, or pursued through future Project Catalyst funding proposals.\n\nThe project team will approach auditability in three ways: (1) establishing a set of project indicators, (2) engaging in internal peer review processes for each deliverable and (3) engaging in Project Catalyst community advisor review processes. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "R&D, in very organization that wants to take the lead both in technology and market revolutions, is essential. It allows to gather the best of intelectual capital (in terms of human capital and strucutural) and, in based on strategic objectives, discover, map and develop solutions to the world. Having said that, creating a team for researchers in catalyst to, in a coodinated manner, map and develop solutions using Cardano blockchain can help the ecossystem to grow a lot. \nIt can also solve some of catalyst nissuess, as a lot of projects overlapping and lack of sinergy among them. \nthe proposal is well structured, with a clear final deliverable (the reports with recomendation, at least for this funbd) and how this is going to be achieved (creating the guild of researchers/specialists).\nI'd also include in the report a reccomendation macro-strategy for Cardano in short, medium and log term, considering everything that was researched.\nthe proposal is also scalable. If this project is a success, the research team can help other proposers with landscapes, reports and technical-economizal analysis. A lot of proposals nowadays lack this kind of depth.\nAn extra suggestion would be to include in the proposal the communication plan for the guild. How to reach the best researchers? Where they are? how to engage them in the project? ", "q0r": 5, "q1": "There's a very detailned plan in place, with activities that help to understand what is going to be delivered in the end, both in forming the team phase and in buidling the report phase. It would just be nice to see these acitivties broken down in weeks and have some hourly estimation (even if some needed to be clusterized).\n\nBudget breakdown is also very detailed with a full rationale expained. Important to say though that it is indeed an expensiver project (10% of total challenge budget). R&D, however, does consume a lot of resource, specially because you need highly qualified people. If proposal does not get funded due to budget, I'd reccomend proposers to breakdown the scope in 2, for the next 2 funds.\n\nThe team is composed of 3 committed people, with experience in the academy, project management,  blockchain/Cardano and law. This seems enough to run such project.", "q1r": 4, "q2": "The kpis proposed are not truly kpis, they are more like acitivites or deliverables than indicators. kpis should be SMART and none of them are measurable in a quantitative way. Moreover, i think there are too many acitivities listed there and that can lead to wrong impression of development or lose track on what is indeed fundamental for the project. Instead, I would higligh only the key milestones (points in time/schedule with no duration) for the project (something around 5, at most), the ones who really help community/stakeholders to understand if project is advancing or not.\n\nAs KPIs, it could be included the number of researchers reached and enrolled, number of reports produced, quality of the report (could be done via a survey/NPS score), number of artricles/proposals reviewed, and so on. At least some of them should have targets.\n\nI liked though that a template for the report is altready provided.\n", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "The Research Guild will deliver a report that scopes gaps and strategies to leverage outlying intellectual capital within Project Catalyst.", "experience": "Three PhD candidates studying blockchain applications in land management, intellectual property and peer production; a PhD in Law and International Relations; expertise in research, project management, community development, governance, teaching, license compliance and auditing."}