{"id": 400906, "author": "ja10", "title": "SPO Incubator Rollout", "url": "https://cardano.ideascale.com/a/dtd/400906-48088", "category": 26441, "amount": 24600, "description": "SPOs are critical to the successful growth of the Cardano project, but they often lack the business skills to truly benefit from that growth", "funded": 2, "upvotes": 94001931, "downvotes": 4734656, "votes_result": 89267275, "votes_cast": 412, "f6_no_assessments": 2, "f6_rating": 5.0, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=25312"], "media": [], "f6_assessments": [{"id": 5656, "q0": "This proposal is well suited to the miscellaneous challenge, as it does not fit perfectly with other challenges, however is potentially a valuable addition to the cardano ecosystem. There is a clear problem statement, that SPO's often lack the business skills to grow their business, and this is something that I have witnesses as I have been watching the ecosystem and have been staking since the testnet era. There is a concerning trend currently of smaller spos shutting down, and stake becoming consoladated with larger pools and muliti pool operators. Helping smaller independent pools learn the business skills required to market their pools and attract delegators will help to balance the stake in the system and increase decentralization, which will be a net positive for the cardano ecosystem. The proposal includes clear KPI's that are:\n\nNumber of SPOs engaged in marketing \nNumber of applications received \nNumber of successful applications \nNumber of participants starting the programme \nNumber of participants completing the programme \nNumber of Alumni from MVP engaged with new Cohort\n\nThis proposal could potentially scale and become a widely adopted program for new SPO's and the potential benefit this could provide to SPO's and the Cardano Ecosystem, while difficult to quantify, could be huge and transformative of the entire network. \n", "q0r": 5, "q1": "This proposal is ranked high for feasibility because the proposing team is an experienced team that specialized in business coaching and development. They have all the required skills to deliver a successful SPO incubation program, such as: business coach specialising in full value-based impact innovation programmes for enterprises and organisations. Coached Fellows on the Cambridge University, Programme for Sustainable Development, \nCoached Fellows and Lectured for the Cambridge University, Centre for Entrepreneurial Learning - Social Enterprise etc. etc.\n\nThe budget to deliver this program (which is less than tuition for a typical collage course) is very reasonable considering the wealth of talent the team will be bringing to the table, and the educational content they will be creating. The budget is itemized and broken down into phases, with hourly wages and specific time frames provided. Some of the hourly wages are a little high ($200 per hour, but this is standard for professionals with the experience and qualifications of this team, and they potential value they can bring to small SPO, and the larger Community of ADA holders.) ", "q1r": 5, "q2": "The roadmap and key milestones and timelines are clearly presented in this proposal and the KPIs are easily quantified and auditable by the community. The team will be able to track the progress of the KPI's and provide the community with end of project reports. It may not be feasible for the wider to community to audit progress while it is in development, but the team has committed to providing detailed reports once completed. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10026, "q0": "The SPO community is about 3000 and will grow potentially with added K factor to larger amounts. The propsal is to train and guide new SPO to manage their business efficiently and track expenses/marketing/comunity metrics. \nI feel the SPO are a strong comnity and help each other out technically on a daily basis. They have open discussions on what version and optimization to the node setup. But no where have I seen topics addressed around the marketing / accouting and other challenges a small sPO can face. \nSupporting this essential backbone of hte cardano ecosystem is important and will be crutial to preserce the decentralization and single SPOs livability ", "q0r": 5, "q1": "The training offered will be 20 live interactive sessions arranged for pre-screend single small SPOs invitiaton or registered. \ni was pleased with the detail of the content that will be presented and discussed. \nThe team are familiar with cardano and catalyst fund and have been funded in F7. \nThe budget around the training hours and material to cover is well detailed and can be easily justified. \nI see a good potential for a recurring need for this project as the training will only target 20 small SPO's and many others may need a similar training furhter down the line (at a later date) ", "q1r": 5, "q2": "All the material and content tht will be generated will be posted and the attendance of the trained small SPO(20) will confirm their training has taken place. \nIn addition the budget is broken down into monhours for preparing the sessions and giving the interactive training. And the material/ reserach needed to combine the topic and relate it to the SPO field. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "To implement our proven incubation programme that ensures commercially and sustainable, impactful businesses within the wider SPO network. ", "experience": "We run high growth coaching & mentoring programmes from tech startups, thru to Global businesses & Universities. We have also developed an MVP in our funded proposal \"Small SPO Impact Business Programme\" in the F7 New SPO Business Opportunities challenge."}