{"id": 401081, "author": "otaviolima", "title": "Cardano Blockchain Brazil MeetupHub", "url": "https://cardano.ideascale.com/a/dtd/401081-48088", "category": 26441, "amount": 19800, "description": "The Cardano community in Brazil is growing rapidly and we need to bring hybrid events to support and interact with our crypto community.", "f6_no_assessments": 4, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 3939, "q0": "I praise the proposal's goal of bringing knowledge to the community and strengthening the bonds between members. These events and seminars hosted by Cardano members are critical in improving guests' understanding of Cardano in particular and blockchain in general. Training parts with experts and KOL talkshows will provide attendees with excellent foundational knowledge.", "q0r": 5, "q1": "Although the proposers provide a detailed information about money usage, proposers should elaborate more in detail about what activities, content each meetup will be held each month. Also, the team should provides more information about marketing strategy to attract the audience. Moreover, team should consider risks that might occur and how to face with them. For example, what if the audience decrease after 2 months and they prefer online meeting, that could lead to redundancy in renting cost. ", "q1r": 4, "q2": "The proposal provided a couple of metrics to measure the progress. There are some metrics to keep track that I think should be considered:\n - Rate of attendees through each meetups\n - Number of Brazilian sign up fo Cardano\n - Interact rate with Cardano Feed site.", "q2r": 5, "assessor": "z_assessor_1693", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "We are very happy with your comments and ratings, almost full marks in all topics. \nWe appreciate the involvement and close monitoring, we will be attentive to the continuity and engagement of the community to participate in the events. \nI would like to count on your support for the approval of the project, we are sure that we will make a great project for the Brazilian community."}, {"id": 5549, "q0": "The proposers intend to hold a series of 12 face-to-face meet-ups in São Paulo, Brazil, with guests and speakers, with the aim of bringing attention to the Cardano ecosystem and projects. The events will also be published on YouTube, for the rest of the community to watch.\nWhile the proposal has a good starting point, it does not offer any concise details about the theme of each meet-up, the speakers and the speeches that will be delivered. Without these very important details, it is impossible to determine the impact of the proposal, no matter how much the team promises “to bring a lot of knowledge to the events, always speaking in an accessible way and, whenever possible, in a non-technical way”.", "q0r": 3, "q1": "The timeline is very repetitive since it’s the exact implementation for each meet-up, but considering the proposal, I find it to be complete.\nThe budget seems well broken down, although I see there is no amount left aside for the speakers. Will they all be volunteering to talk without any kind of incentive? I do not doubt some might do, but since they have not been contacted about this project, how can we be sure that some might not. Or is it the “teacher” description that is meant to be the speaker, in which case, I’m wondering how the amount of $200 has been established as being enough for each and everyone of them.\nThe proposers have offered sufficient information about themselves and also links for verification. Not only that, but some of them are well-known Cardano community members, who have been active in the space for a long time.", "q1r": 4, "q2": "I find the development progress question to not have been fully addressed. The Cardano community needs to be able to independently verify that each meet-up has been properly prepared and is ongoing as described. As such, the number of registrants for each event is not as important, as where can the community verify that the registrations are indeed underway and how many people have registered per event.\nThe success description is partially well defined, but the addition of clear milestones would have been very important to assist the community in self-evaluating the positive outcome of the project.\nI highly suggest the resubmission of the proposal in a future fund with the added missing information and revised parts.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the comments and feedbacks, they were very well received by our team. \nWe will work to improve the project's auditability, bringing more transparency, security and information to the entire community as the project progresses. \nWe would like to count on your support for project approval, we are passionate about what we are building in the Cardano ecosystem."}, {"id": 5939, "q0": "The proposal seems to fit into this Campaign as it is related to Cardano, but F8: Scale-UP Cardano's Community Hubs Campaign looks as a better place for this project. The proposal has the potential to add some value to the Cardano ecosystem by presenting to the audience its benefits and \"the tools and technologies required to create possibility for the many, as well as the few, and bring about positive global change\". (a quote from the cardano.org website).", "q0r": 3, "q1": "From the presented references seems that the members of the team have the necessary skills and experience to make this project a viable product.\n\nThere is a timetable with deliverables but is presented in a flat way as, for each month, there are the same generic description of the activities that are to be done. It is recommended to have a list of the covered topics taking into consideration what people are willing to see and hear and also how is to be done (1 face2face and 1 online events or variations of this)\n\nThe budget is broken down into identifiable items and seems reasonable to achieve the set goals. Could be a good idea to have some promotional materials that are to be given to the attendees, maybe they will spread the word about the future events. This could add into the budget some expenses that have to be taken into consideration.", "q1r": 3, "q2": "Because same aspects of the proposal are presented in a vague manner (the timetable and work done) it makes it somehow difficult to assess the progress and the success of the proposal.\n\nSome of the KPI/metrics are also presented in a vague manner (What is the reason of grouping people and what is the meaning for the statement \"Number of shares performed\"?) and some other are missing (how about the feedback from the attendees? are they pleased with what they got?)\n\nMaking things clear for any outsider and rephrasing the proposal covering well all the required aspects will make a chance for this proposal to stand a chance for getting funded,", "q2r": 3, "assessor": "z_assessor_309", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "We appreciate your time, feedback and comments about the project, we are very excited to be carrying out an educational and community-oriented Cardano project here in Brazil. \nWith the approval of the project, we will bring more in-depth and planned events to be held, themes, speakers and topics. \nThis all demands a lot of effort and conciliation of agenda, investment and people. If possible, I would like to have your support in approving this project. \nWe want to bring even more knowledge to people about Cardano."}, {"id": 8175, "q0": "The Cardano community in Brazil is growing rapidly, so the proponent thinks they need to organize mixed events to support and interact with the crypto community. The solution is to organize 12 face2face meetings & online matches that will be held in São Paulo (BR) with the participation of speakers/guests for Cardano/Ecosystem presentations. Overall, the problem and solution make sense and match the content of the challenge.\nThe proposal also mentions that the biggest risk when implementing this project is the Covid-19 pandemic, and offers a solution for finding event participants through the Cardano Feed page.", "q0r": 4, "q1": "This proposal is driven by a very experienced team. They consist of 4 members with relevant skills and experience to implement the proposal. The track record of the individuals involved behind this proposal shows their passion and willingness to make this experiment a success. A clearly defined and concise budget, with a reasonable amount requested: $19,800\nThe big downside to this recommendation is that the plan itself gives a 12-month roadmap, and each month's plan is listed the same. I understand that there will be a monthly event but as stated, this is a bit vague, it would be more convincing to propose to provide more main content for the events such as the theme of the monthly event, number of participants and audience of each event.", "q1r": 3, "q2": "There are several goals with well-defined KPIs, such as the number of people registered to the event, the number of participants in the community, the number of users in the group, the number of shares made. Hope the group soon provides a link like Twitter or youtube any means so that the community can easily follow your upcoming events.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the comments and feedback. With the approval of the project, we will bring more in-depth and planned events to be held, themes, speakers and topics. \nThis all demands a lot of effort and conciliation of agenda, investment and people. \nWe will release access to the groups and leave the events online for future consultations and dissemination to the entire Cardano community. \nI would ask you to help us in the approval of this proposal and we can take Cardano to even more people."}], "solution": "12 face2face & online hybrid meetings will be held in São Paulo (BR) with the participation of speakers/guests to present Cardano/Ecosystem", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}