{"id": 401091, "author": "erlend", "title": "Catalyst Community Accelerator", "url": "https://cardano.ideascale.com/a/dtd/401091-48088", "category": 26441, "amount": 60000, "description": "Idea-owners and Entrepreneurs often lack the necessary venture building skills and access to the networks required to reach their goals.", "funded": 1, "upvotes": 24681011, "downvotes": 12798700, "votes_result": 11882311, "votes_cast": 75, "f6_no_assessments": 6, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 2968, "q0": "The proposal address the dire need of improving the entrepreneur culture and venture-building skills within the community. There are several examples of excellent businesses failing to make their stand due to a lack of mentorship and support from the ecosystem. This proposal addresses the fill the gap in an efficient and effective way. A proven methodology S-E-A-M along with digital sessions and certification will prove to be a boon for the Cardano community, as this could end up adding more value to the existing applications and also draw a lot of attention from other chain users and contributors. The impact this proposal could have is multi-dimensional, to name a few cross-chain migrations, Cardano as a preferred business hub, Improving Cardano auditability, and also invoking several new quality business solutions. The team \"Entreprenerdy\" have been extending the Cardano community with brilliant ideas and they seem to be capable of averting any risk that might lie in their path.", "q0r": 5, "q1": "The team's plan to establish an entrepreneur mentoring system and certifications looks promising and the funding will be the essential key to drive these in a steady and fruitful manner. The budget of 60k USD and its breakdown for each of the elements in their plan seems transparent in nature and achievable, most of it being used for the cohort purpose. The manifesto comes with crystal clear goals and a step-by-step action plan and a lot of groundwork already laid out which shows the team's sheer commitment and passion. The 4 team members introduce are all clear heavy-weights in their respective fields and come into this project with a lot of prior experience and expertise. However, the only place I feel the team should have made a dainty bit more effort in explaining how different this proposal is compared to what they have already achieved with a similar proposal in fund7 which requested almost the same amount of 60k. A little bit of evidence of their last venture would have gotten them the full marks.", "q1r": 4, "q2": "This proposition in addition to being impactful and feasible also provides the readers and evaluators with usable metrics for each of the deliverables. With a clear distinction between key metrics to monitor and key metrics to quantify, the proposer makes the auditor's job a lot easier. The proposal's key metrics make a lot of sense even though the Miscellaneous challenge does not make a clear requirement of any kind. The Accelerators and Mentors challenge last time was interesting and the team continuing their work from there adds a lot of confidence and makes it easy for the community to assume that all kinds of support would be provided by the team for monitoring their progress and outcomes eventually. The success criteria the team sets for themselves are sleek and bright and on successful implementation, I as a reader feel would do wonders to the new ventures trying to establish themselves on the chain and also to the existing ones who are looking for a helping hand in order to get to the top.", "q2r": 5, "assessor": "z_assessor_1593", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 5829, "q0": "The outlined problem statement reads: “Idea-owners and Entrepreneurs often lack the necessary venture building skills and access to the networks required to reach their goals”.\n\nThe Norwegian team’s solution to this issue is “a community-focused entrepreneurship program aimed at developing startup skills & building networks between entrepreneurs and mentors”.\n\nThese are worthy goals and the program sounds really well thought out, at a first glance. \n\nHaving failed as an over-idealistic social entrepreneur myself, I know that the most important focus for an entrepreneur should be a paying customer. Having read through the proposal twice and having watched the enclosed 25-minute video, I haven’t heard the words “customer”, “client” or “user” mentioned even once. Therefore, I’m not entirely convinced by the S-E-A-M model that the entire program is based on.\n\nStill, I think it will be beneficial for many Catalyst proposers to go through the program. It is a good way to engage in self-reflection and bounce ideas with the facilitators and other participants. And, to be fair, there is one 90-minute session for Business Idea and another one for Business Model. These should focus on the target group’s needs and pain points as well as on the money-making logic. I’m just afraid they will fail to cover all the intricacies of these complex topics, especially because only 30 minutes per session is spent on increasing the participants’ understanding of the subject matter in a facilitator-led part of the training.\n\nPotential multiplying impact of the proposal is limitless. With a $60K budget, a direct promise is to train 60 participants (proposers?) and 10 new facilitators (community advisors). It is this community advisors as facilitators element that has been crystalized more. Apart from that, this is almost identical to their previous proposal posted on November 25th, 2021.", "q0r": 3, "q1": "The Entreprenerdy team has made themselves known with the initial Catalyst Boost Camp. Looking at the team’s credentials it’s easy to like this proposal. It is quite well structured and convincing.\n\nIt is probably something that is not specific to Catalyst but has been offered to other clients as well. “The Entrepreneurship sprint, S-E-A-M and EMS are proven concepts, tested and tried over several years.” As someone who has delivered about 400 training sessions in my life, I know the importance of knowing your audience. I am slightly worried that Catalyst is “just another customer” for this group of entrepreneurs, that the proposers are not involved enough in Cardano to truly make a difference. They have taken this into account and the proposal underlines the importance of “involving community members and advisors in co-creating the program”.\n\nTheir “Program management services” will help in recruitment and selection of participants. What is not mentioned, however, is who the participants are and how they are selected. After watching the enclosed video—and knowing how Entreprenerdy boost camps were communicated in the Townhalls—I’m assuming it’s going to be an open call and the team somehow decides who gets to participate. Is it first come, first served basis? Adding this kind of detail would make the proposal even stronger.", "q1r": 4, "q2": "It is unclear whether the plan includes four or five cohorts. On one hand, the plan refers to “Five cohorts of the Catalyst Community Accelerator over four weeks” and “Five entrepreneurship Boost camps for four weeks”. Yet, in the timeline, it says “June 2022: Cohort 1 is delivered”, “July 2022: Cohort 2 is delivered”, “Aug 2022: Cohort 3 delivered”, “September 2022: Cohort 4 delivered”. “The budget breakdown consists of 12 000 USD for the certification program and 4 times 12 000 USD for the cohort deliveries”. So, if I was to guess the team has changed the plan mid-way and, instead of running five cohorts on their own, they’ve decided to cut one of the cohorts and use that time/money to train Community Advisors to do the job for them in the last cohorts. That’s smart and disseminates knowledge into the community but it’s unfortunate it has made the proposal less clear.\n\nSpeaking of money, the budget breakdown isn’t really a breakdown at all. It doesn’t say what those 12K lump sums consist of. Furthermore, spending approximately $1,000 USD of treasury money on each participant might sound a bit steep at first. However, if the program truly makes the participants better entrepreneurs and people, perhaps the investment is justified. \n\nThe attachment referred to in the proposal is actually missing, this time, but you can see it in the previous proposal: https://cardano.ideascale.com/a/idea/385150/48282/download", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3722, "q0": "There are a lot of developing nations around the world and has a tremendous numbers of startups across every country. Every startup needs proper guidance to flourish. The proposer has addressed the problem statement and the challenge effectively. The proposer has also explained his plan of action with the STEM entrepreneurs method to educate and give knowledge to the budding entrepreneurs. The proposer has articulated it adding value to the cardona system. The key metrics and the goals of the proposal which is to educate the budding entrepreneurs by providing them the required knowledge and exposure is very good. The key metrics and the goals of the proposer is very good and will align with the outlined challenge settings. The proposer also has addressed the challenges they might face during the implementation of the proposal and has solutions for the same.", "q0r": 5, "q1": "The proposer is very clear about the idea and its implementation and has also laid out the plan of action for the coming year. The proposer has also added reference links to provide evidence of skills and experience need to implement this project.\nThe budget is mentioned clearly along with the breakup cost which seems to be fair for the proposal and is sufficient for the proposal. The time plan suggested by the proposer is realistic and can be met in within the time period. The proposer clearly explains the technical aspects in detail required to understand the concept of the proposal which is very good.\nThe proposer has considered the challenges relevant to a successful implementation.", "q1r": 4, "q2": "The proposer has laid out a roadmap to implement the proposal and has requested funds for 60000 USD to implement the project which seems reliable considering the outcome of the proposal. It will be helpful for a lot of entrepreneurs to start their business with this model. The proposer has also mentioned the SDG rating that would be achieved by the proposal and is impressive. The proposer has a clear understanding of the targeted problem and the experience and expertise of the proposer and their team will lead to the success of the proposal and the provided information is sufficient to audit the progress.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5370, "q0": "The problem described in this proposal is clearly identified and it is also clear how the project intends so solve this. The project aligns by with the outlined challenge by being a project that would bring value to the community. The proposal presents sufficient goals which support their outlined challenge settings. Foreseeable risk and challenges of the project was also addressed and the proposer understands how to alleviate them. The project however didn’t mention how the project would add value to the Cardano ecosystem. This is important as the only constrain of the miscellaneous challenge was that the proposal had to be somehow related to Cardano. Although I believe that their project would bring indirect value through their community focused program, the program failed to mention any ties with Cardano.", "q0r": 2, "q1": "The proposer provides brief information of the team. The experience and skills provided appear sufficient. It would have given more reassurance on their capabilities if they presented more information on the members background or provided profile links for reference. The roadmap is clear and concise. Each phase of the roadmap also has realistic timeframes to complete the work. The challenges and risks of the project have been sufficiently addressed and the proposer understands how to mitigate them. The project presents a vague and confusing proposed budget. They don’t clearly break down their allocation of funds and it was hard to identify if the requested amount was reasonable. It is evident that the proposer understands ‘how’ to implement the project as they provide a clear and thorough conductible plan. It would have given me more confidence in the project if they explored the challenges and risks relevant to successfully implement their plans and goals.", "q1r": 3, "q2": "The proposal provided a very thorough and detailed solution to a problem that was clearly identified. The roadmap presented was clear, concise and had realistic timeframes for the team to complete the work. It was also evident that that the proposer understands how to monitor their progress as there was well chosen KPI’s and key metrics to define their success. The information provided on their team and proposed budget was difficult to audit as it wasn’t clear and insufficient information was provided.", "q2r": 3, "assessor": "z_assessor_1953", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5550, "q0": "The scope of this proposal is to train volunteering community advisors to become certified in SEAM (Systemic Entrepreneurship Activity Method) as well as provide a series of five workshop “boostcamps” that supposedly will guide entrepreneurs from the Catalyst proposers group into reaching their objectives, a sort of a \"Catalyst Community Accelerator”.\nSEAM has been developed by a University in Norway in collaboration with researchers from several European Universities. The process for the participants is very rigorous, spanding over 12 courses, each with e predefined theme, yet the course about blockchain and Cardano is only mentioned at the end, more like a side note.\nOnly a few years ago, nobody would have thought that the cheapest JPG with an illustration of an ape will be worth $300k https://opensea.io/collection/boredapeyachtclub and that a new movement of art and business will rise on top of cryptocurrencies. Yet, here we are, and the fact is that the ones leading this movement are people with an open mind, willing to experiment and to not follow the rules. The rules would have forbade them to start their company Yuga Labs with this purpose in mind.\nHaving said this, I see the future of web 3 as being led by people willing to not follow rules or who do not know the rules. It’s a new environment, still in its infancy that must not be an update of web2.0, or otherwise it has failed in its promises. This proposal is probably applicable to start-ups still working for the web2.0 environment, with sets of rules and guides that have been tried and tested for decades.", "q0r": 3, "q1": "The detailed plan and timeline are comprehensive, all workshops are presented for the period spanning until October 2022. The budget is somewhat explained, though the mention that a certification costs $12000 is not more thoroughly explained, with no links to verify the costs or to look up the verification and the program. As such, I cannot properly assess the budget due to these very important missing details.\nThe team has provided information about themselves, but unfortunately, for such a professional project, providing links to verify the claims of the team would have been extremely important, and because those have not provided, I cannot properly assess whether they are qualified to successfully implement the project.", "q1r": 2, "q2": "The KPIs provided in the progress development question would have been more suitable for the success defining question, as in this one, the important point to answer is what the important steps are in defining progress of the project and where those steps could be verified by the community.\nAs such, I will consider the question of success answered, and with enough information to properly assess the positive outcome of the project by the community, but for the development measure, I will have to remove 1 point, but that only because the rest of the section was thoroughly answered.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8176, "q0": "The idea of ​​the proposal is great, I like it. The problem is that idea owners and Entrepreneurs often lack the necessary venture-building skills and access to the networks needed to achieve their goals. Solution to the Problem is a community-focused entrepreneurship program that develops entrepreneurial skills and builds networks among entrepreneurs, mentors, and businesses. I understand your solution to the stated problem and I feel it is relevant. The pitfall here is that in my opinion, this proposal would be better suited to the challenge of \"Business Solutions (B2B & B2C)\"\nThe proposal pointed out the main challenges or risks for the successful implementation of this project and also the core solutions to those challenges. I wanted to give it a perfect score on this criterion, but unfortunately it didn't fall into the right category.", "q0r": 3, "q1": "Your plan is solid and with a few extra tweaks I feel like this could be a great initiative. I hope that the author can provide a link of Entreprenerdy so that I can better understand it. The proposal is providing a list within an expected timeframe, with checkpoints on a monthly basis this makes it easier for the community to track the progress of the project.\nThe Proposal Team consists of 4 members with the experience presented I believe they are capable of successfully implementing this proposal. However, it would be more beneficial to have some evidence to verify their experience, for example LinkedIn or a website\nThe budget required for the proposal is $60,000, which I think is a reasonable number. The budget allocation has been presented, but I think it should be analyzed more clearly so that it can be easily audited by the community.", "q1r": 4, "q2": "It's good that the team has provided pretty clear metrics so the community can track their progress. The project success criteria are also clearly described. This proposal is a continuation of fund 7's proposal https://cardano.ideascale.com/c/idea/385150 (unfunded). In this proposal, I find that the author has been more specific about project progress metrics. However, as mentioned, this proposal would be more suitable in the challenge of \"Business Solutions (B2B & B2C)\", if not funded in this fund, I hope the proponent will continue his idea. this idea. Good luck.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Community-focused entrepreneurship program aimed at developing startup skills & building networks between entrepreneurs and mentors.", "experience": "The team behind the proposal are serial entrepreneurs with experience from more than ten successful startups, holds 2 PhDs and has more than ten years of experience in building successful entrepreneurship programs for thousands of projects and startups."}