{"id": 401084, "author": "proofspace.nick", "title": "Translate no-code SSI to Spanish", "url": "https://cardano.ideascale.com/a/dtd/401084-48088", "category": 26441, "amount": 25237, "description": "Ability to grow Cardano is constrained by lack of translated documentation and products for scaling local ecosystem", "f6_no_assessments": 4, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "As there is lack of documentation related to cardano in Spanish language , people can't understand the importance of cardano's project.\nSince by providing no code SSI platform it will help local users to find the right tool for the job. And user can explore WordPressMultisite, Bubble, Adalo, Stacker, Glide, Fliplet, Dropsource, Outsystems, Appsheet and many others. where people can use the tools without requirement of any instructor which will also boost spanish people to invest in cardano related projects hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "ProofSpace is a no-code platform for building & deploying SSI, since ProofSpace Dash and ProofSpace App are ready for localisation, the team is also an multilingual  which has people of all languages.\nAs it has right partner of ProofSpace ,it just needs one Spanish expert to translate all the data in the form of documentation, later which can be implemented and tested and check the outcomes of the translation, which is not difficult task to complete. So with the less risk involved and with provided experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The information contains the lead members of ProofSpace and their experience in the presented field, the proposal even contains how it will boost cardano in the future,the proposal can create local people to involve in development of ideas without requirement of any code.\nThe proposal is very clear on timeline and budget breaking, it even contains excellent key indicators to measure the success of the model , with a long vision provided the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The proposal has a possibility of causing a huge impact because Spanish is the second more spoken language in the world. Because of that, if it's well implemented the proposal can take the Cardano ecosystem further by reaching more and more people with information and knowledges that today are delivered only in English. In conclusion, the proposal deals with a issue that needs to be solved and articulates well the resolution as well as the goals to be reached. The only thing that could be improved in this proposal is the ausence of the key metrics, what would they be? ", "q0r": 5, "q1": "The proposers explained the plan of implementation using milestones and deadlines for each one of them. The budget was broken down in deliverables with the respective costs and seems to be reasonable due to the tasks. In addition, the proposal gives information about the experiences of the team members and they are reasonable to make the project happen. They need a translator and want to find him/her inside the Cardano ecosystem and that makes real sense. Finally, the proposal explains the risks and ways to mitigate each one of them. Part of the plan to mitigate the risks counts with an additional budget. Would that budget depend on a new Fund? ", "q1r": 5, "q2": "The problem is clear as well as the proposed solution. The roadmap and the milestones also are clear and coherent with the project. The proposers could have used more metrics and KPI's to show how they will measure the project progress and success using more indicators for each goal. In conclusion, the proposal could be improved in the details above to be better and fully audit.", "q2r": 4, "assessor": "z_assessor_409", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The Translate no-code SSI to Spanish proposal sits well within the Miscellaneous challenge as there is no other challenge that will accommodate this translation feature. The translation of their product into Spanish will increase product adoption that centers around Self-Sovereign ID. This also will increase the adoption of Atala Prism and Cardano in general. It would be better to refer back to their proposal in fund 7 and provide additional background so not to confuse of why the translation is needed and understand their key metrics better.", "q0r": 4, "q1": "While the budget looks realistic and not a plug in number (not round number but go to single digit) but it doesn't go into the number of works required to complete the project (6 months how many hours of staff will be spent on translation work). There is no website link for their current project and neither is there a LinkedIn profile of team members even though they have their official website. Also they have not mentioned what they would do if extra funding is required for their translation work (catalyst or else) and how many more languages will be required for the product documentation to be translated to.", "q1r": 3, "q2": "The project progress will be communicate to catalyst community via monthly report. However, there should also be another documentation either website or social media channels that they can report to people outside the catalyst that fund this project. They should provide the benchmark figure: The number of product use case in Spanish compared to the version in English to see if the product adoption is increased as a result of translation. The proposer has legit understanding of Miscellaneous challenge but do not provide sufficient  project detailed info for this proposal to have a long lasting impact to Cardano.", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Warning to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate into Spanish the app and the documentation of an existing product funded in Fund 7 that fosters adoption of SSI by the support of ATALA Prism (https://cardano.ideascale.com/c/idea/385204).\nAs Catalyst does not have a translation dedicated challenge, this proposal does not fit in any other challenges and therefore matches the Miscellaneous challenge criteria as it is indeed related to Cardano.\nImpact of this proposal is related to the accelerated adoption by Spanish-speaking users of the no-code platform. Spanish being spoken by +500 million people; I agree that this proposal can have a positive impact on adoption of this service and ATALA Prism.\n", "q0r": 4, "q1": "Tasks for completing the proposal are well listed. The translation will be supported by a dedicated translator that remains to be recruited. The budget breakdown details how much translation work will be required, between translator recruitment, documentation translation and product translation itself. Some items could have been more explained in this breakdown, like why is there a generic “translator fees” not related to a specific part of the work?\nThe team shows evidence of having enough project management and computer science skills to complete what looks like a simpler project than what it has accomplished so far.\n", "q1r": 4, "q2": "Success is defined as the availability of the translated documentation and product, and as a real growth in the Spanish community in use of Atala Prism. \nSeveral milestones are listed to enable the community to monitor this 3 month project, including beta versions of the translated material.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Translate a no-code SSI SaaS platform (ProofSpace), including products and open documentation, from English to Spanish.", "experience": "ProofSpace is a no-code platform for building & deploying SSI. ProofSpace Dash and ProofSpace App are localisation-ready. We’re experienced, multilingual team, >80yrs full stack dev, distributed systems research & translation experience (e.g. Portuguese, German, Arabic)."}