{"id": 401765, "author": "lidonation", "title": "Real Journalism = Cardano Insights", "url": "https://cardano.ideascale.com/a/dtd/401765-48088", "category": 26441, "amount": 8000, "description": "Traditional news often misses the point; online pundits vary in quality and accessibility. Cardano deserves quality research and journalism.", "f6_no_assessments": 4, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal to build a journalistic hub for Cardano has promise, and I think it's good that these stake pool operators are looking to flesh out their project by hiring on someone with real journalistic chops to produce content. As it happens I have some expertise in this area, and though I do have some criticisms I hope they'll be taken with a positive spirit. \n\nFor what it's worth, I believe it's appropriate that this proposal is listed in the Misc. challenge, as it's unique enough that it couldn't really go anywhere else.", "q0r": 4, "q1": "I think this proposal could benefit generally if you show how this hiring fits into your greater plan to fund a journalistic operation on the whole through your stake pool. Do you have at least a loose draft budget for the next year or two for this? How does the org chart look? What are your hiring goals and what will your editorial structure be? In fact, what kind of experience does your editor (I'm guessing this is Stephanie) have? Does she have any editorial support? How do the revenue streams look? Will you host ad content? And so on and so on. If your project is successful, it should be able to fund itself, without reliance on Catalyst to plug in hires here and there, once all the fundamental pillars of your editorial machine are in place. \n\nOne question: Is $6400 really enough to compel and experienced journalist to take part? I suppose it could depend on your definition of \"experienced,\" but in journalism quality does tend to scale up with pay. A strong investigative piece can take up to a week, that's 40 hours of work, which means you'd be paying out roughly $13-14/hr. If this proposal can't get through, you also might want to focus more on daily content first. The website needs more activity.\n\nIn the long term you might want to establish a network of freelancers whom you could pay by the word or by the article. It would be good to see a comprehensive plan for that sort of thing, since so much of online journalism is basically a gig economy at this point.\n\n", "q1r": 2, "q2": "The fundamentals of this project appear auditable. Either the articles are published, and done so on time, or they are not. It would be nice, if your funded, if you at least posted an announcement in your website and other channels, potentially even building up excitement for coming in-depth stories. ", "q2r": 4, "assessor": "z_assessor_1275", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The project tries to bring an experienced Reporter to the lidonation team to write in-depth, investigative journalistic content about Cardano. The proposal also gives information on the achievement of successfully running a lidonation website and also hosting a twitter spaces. The team also provides potential risk of hiring or turnover of talent in mid-project, however, with the experience and competitive salary provided, I believe the team can execute the project successfully.", "q0r": 5, "q1": "The proposal has a detailed plan and roadmap for hiring, posting, and pacing of the writing. The team provides a detailed and reasonable breakdown of how they will use the proposed budget. The team also elaborates background and experience on each people on the team and provide a LinkedIn profile for all member. With the experience of lidonation website that is fully functional, I think this proposal will have a good chance to be successfully implemented.", "q1r": 5, "q2": "Metrics for success are concise and clearly defined by hiring, posting and cross-posting, and pacing. That is the team will hire journalist within one month of funding and release a new article every 2 months.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Clearly there is a need for an accurate reporter in the Cardano space. Cardano has dealt with lots of articles that focus on the negative or make it appear as if the blockchain doesn't work. This team has proposed an idea to hire a professional reporter to highlight true information. This will especially be important because this year could be one of the most important years in Cardano history with the recent release of smart contracts and focusing on the Basho era of scalability. I highly agree with this proposal because if the media could be accurate without trying to focus on the negatives, there could be a lot more people wanting to join the community. For all these reasons, I give this section of the proposal 5 out of 5 stars. ", "q0r": 5, "q1": "The team appears to be very involved in this proposal and have offered great ideas on how to implement this successfully. After looking into their LinkedIn profiles, I have confirmed that they are real people and have experience in this area of work. I was also able to verify their webpage at Lido Nation and see some of the things they are working on. They have a stakepool and some other information. This includes a list of their previous proposals as well. This shows me the experience that the team has and helps me to understand how likely the team will be in carrying out this proposal/plan. For this reason, I rate this section with 4 out of 5 stars. ", "q1r": 4, "q2": "The detailed roadmap has been written very well. It contains all the necessary information while remaining concise and straight to the point. This goes for the detailed budget breakdown as well. It shows all of the funds that this proposal has requested and lists off where that is going to go. Most of the funds will go to the Journalist that they hire for this work. My only question about this that could be summarized more is what will happen if the team is unable to find a journalist that meets the teams standards. Could this be a potential setback? For these reasons, I give this proposal 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Journalism quality has reduced very much in recent years, where paid journalism is seen or journalism which only focuses on Ad is seen.\nHence providing valid news related to cardano is a great essential these days.\nPeople who loves news mostly prefer twitter, so running such shows on twitter would be excellent idea for news lovers, where they can show interest towards such program therefore, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has already built a Lido.Nation library where articles related to block chain are already present, so adding newer articles wont be much difficult task, the proposer team has previously done these tasks , so they have gained lots of experience , which will biggest boost in completing this project.\nThe proposal just needs one good talent which won't be much difficult to find ,hence  with Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal contains all the previous experience of the team, and its motivation, values towards the work. It has excellent market to work with , and all the prepared tools such as library.\nThe proposal  contains detailed plan, and excellent key indicators for the development of the model, the proposal has even explained in detail how they will tackle problems for future aspects, hence The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Add an experienced journalist to the team to specialize in news about Cardano blockchain and ecosystem. Publish & distribute content.", "experience": "We publish Cardano articles weekly, built a Catalyst research tool, & host daily twitter shows. We were funded by Catalyst to found a mentoring & outreach Lab in Kenya, & to translate our Content Library into Swahili & Spanish. Blockchain developer, Tech evangelist, Web designer"}