{"id": 402050, "author": "headelf", "title": "PDF - Proud Dirt Farmers - a DAO", "url": "https://cardano.ideascale.com/a/dtd/402050-48088", "category": 26441, "amount": 52000, "description": "There are 570 million Farms globally. Many are too small to be awarded carbon credits. How can Cardano blockchain help global warming?", "f6_no_assessments": 4, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 7435, "q0": "The proposal dialogues with various technologies relevant to the Cardano ecosystem, such as DAOs, issuance of NFTs, Atala Prism DIDs and etc. However, it's still a little confusing as to how this project will actually drive greater adoption of our blockchain, but let's go in pieces. The idea is to create a community (Proud Dirt Farmers - PDF), which would be a kind of group whose main objective is to “encourage family farms to reduce carbon”. This would be done through a reward system, each farmer would have a decentralized Atala Prism identity through which their data would be associated. They would receive what was called by the proponents a “cardano credit bond”, which could be sold, as I understand it. Proponents also say they plan to go further. For example, they want to form a conscious community that thinks about “food security, the importance of farm-based carbon sequestration” and other sustainability issues. In theory, it's all very interesting; we know that several aspects of our ecosystem, as I mentioned at the beginning of the analysis, would be used. This makes us think that, then, Cardano would be boosted, fostered and benefited in many ways. However, I identify some problems here. For starters: would these DAOs be face-to-face or online? How would farmers and smallholders be invited to the project? How would it be publicized, and how would these workers be educated in a simple way about what Cardano, blockchain and etc is? In addition to the teachings on sustainability, how would the more technical parts be explained in an understandable way, accessible to all? What would these carbon bonds be? How would they help reduce the amount of CO2 emitted into the atmosphere? What would farmers have to provide for these credits to be issued? How would they receive them, and how would they handle them? Would it be through digital wallets? How would the Atala Prism DIDs be associated, could the worker receive the credits only if they have these decentralized identities? I think that several questions are said but not properly explained, that is, many questions remain open. I understood what needed to be done, but not how, it is not so clear how a project of such complexity would develop in practice. Therefore, my opinion is that the idea is undoubtedly very good, but there are many instances relevant to Cardano involved and it is not so clear how all this would develop, what the process of receiving the credits would be like, how the workers would be entitled to this. , how they would be instructed to use them and how their real impact would be measured. Therefore, I will give it a score of 3, my opinion is neutral, the core of the proposal is great but it should be better explained (in terms of practical realization). \n", "q0r": 3, "q1": "I did not find the provided script suitable. Starting with the fact that the temporal division is a little confusing, what would 1.T1 / 2.T2 / 3.Q2 be? In my view, it would be more appropriate for the proponents to have broken down the entire script into months. It is the simplest and most practical way, and with the appropriate degree of specificity, to understand the temporality of processes. Speaking now about the activities, they are only mentioned, they are not explained. We don't understand in detail what would be done, how it would be done and who would do it. For example, in “Formation of the foundation and social acquisition”, how would the foundation be formed? In this case, would the participants who would compose the DAO be called here? How would they be selected and how would the proponent present the project to them, their motivations and ultimate goals? What would social acquisition be? In “Subject to the Roadmap - Takeoff DAO”, it is not very clear what would happen, but I infer that it would be the growth and popularization of this DAO. How would this expansion be successful? Would some sort of publicity campaign be launched, how would the target audience be reached? In general, I think that the script does not have the necessary degree of specificity so that we can solidly understand what would need to be done, so I would like it to be elaborated again, clarifying the issue of temporality better and increasing the degree of description of each of the activities. Turning now to the financing analysis, approximately 50 thousand dollars are requested; it is not a small amount, in fact it corresponds to about 10% of the money destined for the challenge. I disagree that the amount has been adequately explained, it is also generally lacking in detail. In “20,000 Legal Review, Compliance, and Foundation Setup. Third-party retention and fee-based estimates”, how much would you go for each thing? What would third-party retention be, what rates was this value based on? In “2,000 Acquisition of Socials and Initial Web Design”, are proponents referring to creating artwork to be posted on social media? Which social networks would be adopted in this publicity campaign, and this value corresponds only to the initial design, how would this part of the proposal continue to be maintained? I think it would need the topics to be explained more deeply, some parts are better than others (eg the “4,000 artist fees for initial NFT design work, logo design and social graphics part. Two weeks / 80 hours at 50 hours”, it is positive as the proponents state the price of the working hour in this case). But all, in my view, deserved the same level of detail. Regarding the team, this is undoubtedly the most elaborate part of the feasibility, since we have a lot of information about each of those involved in the project and links that can prove what was said. However, none of the team members is specialized in Cardano, which worries me a little, because I think it is always necessary that at least one person is well understood about the technologies of our blockchain. So I think the feasibility is ok, not bad, but we still have a lot of points to improve. \n", "q1r": 3, "q2": "Unfortunately, the proponents seem to be uncertain as to how the auditability of the process will be done. We know that it would be started more intensively in phase 2 of the project, “when the organization is funded, it is selling NFTs, it has a Treasury, the DAO is started and we turn to the real mission – to help family farms, globally, to kidnap carbon, help Mother Earth”. However, it is clear that the bidders do not have specific KPIs and metrics, from the excerpt “How do we audit this? At this point, anything we write will just be a questionable pope. We are aware of the issue, we recognize that it will need to be resolved, but at this point we are not close enough to have a solution. As Dor said, the solution will unfold over time!” It would be necessary for proponents to devise more direct ways to monitor the process and partial results. By that, I mean both the task accomplishment part and the small goals achieved. The process should be monitored at least every month, as I suggested in the topic above, it would be more appropriate if the temporality were divided in a more traditional and simple way - monthly, at least - and at the end of each of these cycles the team would need to the Cardano community about the project as a whole. Due to the fact that it is a project with several aspects, my suggestion is that it be divided into some parts. The parts I thought of were 1) direct guidance from farmers - how we're going to educate them about everything that's going to happen next 2) the mitigation of active tokens 3) the organization of the DAO itself 4) the creation and association of the DIDs of the Atala Prism for the rest of the project 4) the carbon credits emitted 5) the environmental consequences that could be measured, quantitatively and qualitatively. I think all these aspects should be monitored frequently. As the proponents themselves claim that they will use social networks to publicize the project, it would be interesting if small illustrative posts were made available monthly, with new information each month on each of these aforementioned fronts. Regarding the final results, it is quite complex to measure the success of a project with so many aspects, but I think that in general two things should be analyzed: the environmental impacts and the improvement of Cardano. The benefit to farmers could indeed be measured through “a self-sufficient treasury with inflation provisions that is able to reward farmers around the world for sustainability and carbon reduction”. The direct consequences for Cardano can be perceived based on the NFTs market and also by the “Atala-based SSI for a) farmer integration, b) agricultural carbon credit certification, c) ecobasket/ecobond to sell on the market to finance credits of carbon for farmers”. I thought that this part of auditability is better covered than the previous one. We have material on which we can build if success has been achieved; I missed an environmental measurement, that is, knowing how CO2 emissions actually reduced from this project. That part could be added. As long as the Cardano community is fully informed of all possible achievements (this could be done through a video participation in Town Hall, for example), I think the end results are already well measured. In other words, the auditability of the process leaves a lot to be desired, but the final success is adequate. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1030, "q0": "The proposal effectively addresses the difficulty of family farms receiving carbon credits. The cardano ecosystem is used in different stages of the proposal. The cardano ethos 'of making the world work better for all' is prevalent throughout the proposal.", "q0r": 5, "q1": "Carbon credits laws are different per country and there are countries with no carbon credit laws. In the proposal I found no mentioning of if it engages with the existing carbon credit laws as well.\nCarbon credit certification all over the world needs a widespread network with people having the relevant skill set. I was unable to find in the proposal how to achieve this.\nThe proposers have a lot of experience in different fields. But the project is ambitious and complex therefore might need outside help.", "q1r": 3, "q2": "Clear targets are provided in the proposal to audit. \nThere is no timeline given for the different stages and targets to audit.", "q2r": 3, "assessor": "z_assessor_1256", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3489, "q0": "The project focusing on support for farmers who are quite out-of-date and conservative in learning new things, especially regarding to ICT matter and Crypto system. The intention of proposer was clearly mentioned when they focus on rewarding and  incentivizing farmers in carbon reduction. The idea required many stakeholders to involve in the process of forming and functioning the system, with the end goals will be benefits of local farmers. The proposer already indicated concertedly 4 main product they want to develop through this project as well as explaining about how the end user benefit from the system when it enters to market. \nCertain KPIs were clarified by the proposer already by various expected results based on activity, and most of the KPIs were prepared for the initial stage only. Therefore, to let people understand better about the relevance of this proposal, it is better to put quantitative indicators to show their expectations in each step’s achievement. In addition, the proposal aims at supporting people so, it will be clearer if the proposer can supplement indicators regarding to them.\nRisks were considered by the proposer in such a general explanation. It pointed out three main problems in case of arising, will affect badly to the project. Therefore, to avoid or shift these risks into predicted assumption, it will help the project go smoother. To do so, the proposer can add more detailed information on this part, on how to make it clear with tentative solutions. \nShortly adding information on how the project contributes to the development of Cardano system will be worth to try by the proposer as well. \n", "q0r": 3, "q1": "The strong point of this proposal is the clear imagination about personnel, who will be the key for the success of the project. The team formulation attract the attention by careful consideration of audience. Team lead and leaders of others session such as communication, or marketing is clearly identified in the proposal with detailed information in about their background so that all people can imagine easily about their future potentials for the project. It will be sufficient if a short supplement information about Sub-team components will be very nice for all stakeholders. \nThe roadmap was proposed shortly by the proposer, in which various work could be done parallelly in a certain amount of time. However, the answer of how in this timeline is more important for audiences or judge team to approve on the feasibility of the project. So, the proposer can include some more information about that. \nBudget was allocated based on different sectors that they tend to tackle. In fact, it was hard for all people to connect the budget breakdown with tentative timeline. So, suggesting the proposer to write again this part in more details as well as link to the timeline, to ensure the transparency of this proposal. \n", "q1r": 3, "q2": "The proposer thought about the project’s progress monitoring will be one of the challenges for all the stakeholders. As the project will be a series, so the first step need to complete before starting the next one, just focus on the importance stage in Phase 2. As monitor the progress is very important for any proposal, the proposer can consider more this session in such a detail way. \nThe success for this project is described by the proposer by the completion of three main things that project must complete and achieve. In case of thinking deeper to the addressed challenges and how it changed people, the proposer can provide more information for this part. \n     So far, there was no information on whether this proposal is a continuation of a previously funded project or entirely new ones. The proposer can add some information about it. \n", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10231, "q0": "The PDF proposal is impactful in the Miscellaneous challenge because: \n\n(1) it aims to set the foundation for a foundation that serves farmers globally using diverse methods and parts, which make it difficult to align solely in any other challenge, \n\n(2) it is related to Cardano in that the team is actively involved in the Atala Prism program, using its knowledge to build NFTs within this ecosystem and\n\n(3) it has the potential to onboard a broad community of farmers into the Cardano Community by establishing \"a DAO and a Governance Token on Cardano to reward & incentivize family farms for carbon reduction.\" \n\nThe proposing team members state that they took the time to receive guidance on their proposal at F8 Challenge Fest, where a review of their work reinforced the decision to participate in this Challenge category. ", "q0r": 5, "q1": "The Feasibility section outlines an understandable, chronological step-by-step plan to: establish the legal formation of the foundation, design the roadmap and white paper, found the stake pool, involve artists in creation of NFTs, collaborate with farming organizations and individuals worldwide and consider needs for a game to fuel the forward motion of the initiative. \n\nThe budget aligns with and supports these benchmarks, making it easy to envision their process. The bulk of the budget will be deployed towards legal formation and strategic design, and will come at the beginning in order to create a solid foundation for the remainder of the build. \n\nThe distribution of the budget seems realistic when considering the cost of starting an entity and the question marks laid out in their challenge section. \n\nThe team members have provided relevant examples of their relevant background: entrepreneurship, experience as farmers, degrees in environmental science and biology, Bitcoin investing and Blockchain technology certifications, sales and marketing, negotiation and budgeting, and a raw desire to go good on behalf of the Earth. The team's skillset covers the initial expectations of this project.  ", "q1r": 5, "q2": "The team recognizes that there may be legal, global and industry challenges formidable enough to discourage the project's continuation and acknowledges that these diverse potentialities make audibility complex. \n\nAs the proposal intends to deliver the formation of the entity, address legal concerns, accomplish the roadmap/whitepaper and begin to organize the relationships, it makes sense that the audit-related outcomes would be yes/no results rather than quantifiable objectives. If the project fails to proceed, the team should be able to offer clear reasoning as to why. \n\nThe success metrics outlined would be as a result of the initial components of this project being delivered, and it would certainly be feasible to hold the group accountable for establishing a self-sustaining treasury, the production of NFTs and Atala SSI for farmer onboarding and carbon credits. A realistic and transparent expectation.  ", "q2r": 5, "assessor": "z_assessor_856", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "PDF will create Proud Dirt Farmer NFTs, a DAO and a Governance Token on Cardano to reward & incentivize family farms for carbon reduction.", "experience": "We are a team with over 100 years joint experience as Entrepreneurs, Farmers, Environmental Science, Graphic/NFT Art and Coding experience. We also know how to build a collaborative team. We seek to build a nice community to help family farmers globally in reducing carbon output."}