{"id": 402044, "author": "thhddnordr", "title": "CNFT Taco Tuesday Food Truck", "url": "https://cardano.ideascale.com/a/dtd/402044-48088", "category": 26441, "amount": 50000, "description": "The current problem is there are not enough in-person cross chain collaboration and on-boarding for Cardano.", "f6_no_assessments": 2, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1087, "q0": "This is a cute, gimmicky proposal that couldn't possibly fit anywhere other than the Miscellaneous category. If nothing else, this proposal might provide entertainment to the community if funded.", "q0r": 3, "q1": "The team seems to have the experience necessary to do what they offer to do here. But whether it's a good investment to put $50,000 into a taco truck that will ultimately onboard just 100 people at a bitcoin conference is an important question when considering the success of this proposal. \n\nI would like to encourage these proposers to think bigger. Why is there mention to using this taco truck at the bitcoin conference, but no thoughts on establishing a permanent, profitable business selling Cardano Tacos in cities across the nation and onboarding them with free wallets with each taco? This truck could tour New York, Boston, L.A., Houston, Cleveland, Omaha, and warm sunny Colorado. And you'd be stretching more out of the money granted out of the treasury that way. Food for thought, hmm?\n\nIf doing this sort of thing is something the proposers have in mind, they should detail their long-term dreams some, where they'd like to go with this and the benefits long-term taco trucking could offer the community. ", "q1r": 3, "q2": "The video tour is a nice idea. I think the info for auditing here, much like the rest of the proposal, could be expanded in scope. What can the proposers show the Catalyst community (and of course the greater public) with this clever idea that will impress us with your originality? Perhaps they could even let the Catalyst community audit the contents of their menu. ", "q2r": 3, "assessor": "z_assessor_1275", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5559, "q0": "The proposers want to use the funds from this proposal to buy a food truck, renovate it, go on a tour (across the United States of America, I suppose, as it is not clearly mentioned), serve Tacos, gift ADA and NFTs to random people who would be willing to create an ADA wallet.\nWhile the idea might be fun for a Youtube show and gather some laughs and views, as a way to attract people in the Cardano ecosystem, the only peer reviewed blockchain, that aims to bank the unbanked and many other clear goals, that are not aimed at bringing hype and short-term gains, I find it is not suitable and would not lead to a positive impact overall.", "q0r": 1, "q1": "The timeline and plan are succinct, but offer somewhat sufficient information. \nThe budget, however, is not detailed enough, the amounts requested for the purchase of the truck and renovation are not justified at all. After doing a quick search, I have found several food trucks for sale, for a much lower amount than what is being requested. Since they have not offered any kind of specifications, I can not find the budget to be reasonable and justified.\nThe proposers have provided descriptions about themselves, though some social profile links would have added to the confidence in the team’s ability to deliver the project.", "q1r": 3, "q2": "While the team has offered some important steps in the development of the project, they haven’t provided any details on how the community would be able to verify if those steps have been implemented.\nThe success of the project is described as having a ” Food Truck at the Miami Bitcoin Conference by serving 100 tacos and onboarding 100 people to Crypto and Cardano”, but it’s not clear why this metric is so important or what it would bring to the Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Our solution to the problem is to give people a Taco and an NFT and help them create a wallet.", "experience": "25 Years Restaurant & Food Management/ Certified in the Food Safety Industry\n\nJCrypto YouTube/7.67K subscribers\n\n#MetaverseMonday 1.5K Weekly Plays\n\n#CNFTacoTuesday 343 Weekly Plays\n\n11 years Project Management and Events Coordination for the U.S. Department of Defense"}