{"id": 403596, "author": "sebstaub", "title": "Web3Domains.Auction", "url": "https://cardano.ideascale.com/a/dtd/403596-48088", "category": 26441, "amount": 500000, "description": "The Digital Revolution is here, \"Web3 Blockchain Apps\" it is up to us to make it a reality for mass adoption.", "f6_no_assessments": 7, "f6_rating": 1.238095238095238, "videos": [], "media": [], "f6_assessments": [{"id": 7450, "q0": "This proposal is very confusing, it does not outline a project in itself, but rather promises a variety of ambitious actions, without secure planning and measurable objectives. The proponent claims that web3 is the future and that it will launch a series of projects, brands, businesses and etc that will make a lot of money. He also claims that he will clarify for the masses what blockchain, web3 and etc is, so that people understand and adopt the technologies of our ecosystem. I think this proposal has many serious flaws. Starting with the fact that we do not have an objective that can be reached based on a series of activities, which would linearly constitute the development of the project. Many different things are promised, like making the digital revolution “Web3 Blockchain Apps” a reality; “we will provide the latest Blockchain media/travel/publishing/encryption/music stores without censorship and we will build the best UBER/BOOKING/AIRBNB” and etc. Which stores would be provided? How would it be provided? The proponent wants to make various economic branches relevant to Cardano's technologies, as he says at the end of the impact ”We decentralized Travel/Media/Music from the global entities and offer a new reward for the use of our platforms blockchain.” But at no time is it clarified how. There are many different things, I think it is better to outline an initial project, well planned, containing steps to be followed; challenges to be mitigated (the proponent defines as a challenge that he is not of the field of technology, which is very worrying, because how does he intend to carry out a technological revolution without being in the area?); this project should also contain an objective s more specific. Instead of wanting to transform the general scenario, the proponent could focus, for example, on one of the areas mentioned, such as transport (he mentions uber). It would be interesting for him to suggest a Dapp that works in the area of ​​locomotion, through payments in Ada, using smart contracts, making people create digital wallets, in short, in general, that they know and adopt the technologies relevant to our ecosystem. Rather than saying that it will introduce the cryptographic world of web3 to the masses, the proponent could have provided some palpable plan on first raising awareness of a target audience, so that the concepts would then be more widespread. He would need to explain what would happen, how, who would do it, when and by what specific objectives the project was being guided. Unfortunately, the proposal as a whole does not present an action plan, it does not align with the challenge because it is not clear what would be done to improve Cardano; therefore, I will unfortunately give the lowest score for the impact. \n", "q0r": 1, "q1": "No script is presented, as I already mentioned in impact, it is not clear what would be done as a whole; consequently, we do not know what steps would be necessary for the complete development of the project. What would need to be done here would be 1) define a plan, an objective, something bigger to be achieved 2) divide the total process into phases 3) explain what would happen in each month of these phases 4) detail very well the activities of each month , preferably how long each one would take to be done, who would be responsible for it and how it would be done. Regarding the budget, the proponent states that ideally 5 million dollars would be needed to achieve its objectives (but it is not explained why). He asks for 500 thousand dollars, which represents all the money that is destined for this challenge. In my view, just because of that, the proposal is economically unfeasible, I don't think it's a good idea to spend the entire treasure on just 1 proposal, especially not being a very well structured project that results in very clear and positive impacts for Cardano. Regarding the requested money, it is not explained in which parts it would be divided, we also do not have details about the parts (they are not made explicit). It would be necessary for the proponent to make it clear which professionals would be involved in the project and how much they would receive in salary, and how much the different aspects of the project would cost, such as marketing, design, programming, etc. Ideally, the salaries of professionals should be specified to the point where we know the value of their working hours. Anyway, this part of the proposal is also confusing, the proposer talks about several things, several investments, as we can see in the excerpt “I am seeking US$ 11.1 million against 49% equity/revenue participation as a co-founder of your group”, but none of this is very clear or related to the $500,000 request. Finally, when it comes to the analysis of the team, unfortunately in the proposal only information about Sébastien Staub. We know in which professional area he works, but not if he has any kind of relationship with Cardano, if he is an active member of our community, examples of his previous work, etc. It would be important for him to have attached his linkedin profile so that we have a working knowledge of the cited information. He attaches a website where we can see his work partner called “The Nazman”. We also have some information about it, but we don't have any examples of previous work and apparently it doesn't have any direct relationship with our blockchain either. In other words, there is no confidence in the team. In my view, all parts of the feasibility are inadequate and deserve to be revised. \n", "q1r": 1, "q2": "The auditability of the progress is quite confusing, the proponent claims that Dapp downloads (which Dapps?) will be monitored. He also says that “We will do this as a community and with CA” what will they do? And why would it be like a community/CA?. “But it will be for UA and UX/UI” what does that phrase mean? Unfortunately, I couldn't understand the message he wanted to get across. For the project development process to be plausible, the first thing that should be defined is a main objective, a well-planned and structured project, as I mentioned earlier. Then, a roadmap well backed up with dates and with a lot of detail should be provided, so that we would have something to base ourselves on when we were going to monitor the phases. It would be necessary for the proponent and his working partner to keep the Cardano community always up to date on the progress made in the phases, on the small goals achieved (ie partial results), as well as on how their work routines were being carried out. This monitoring would need to be constant, in my opinion, at most monthly updates should be kept. The information can be passed through written reports, or short videos, a brief slideshow, in short, the format and platform on which it would be made available is at the discretion of the proponent, it could be a website, the community's discord channels or any other online platform easily accessible to all members of our ecosystem. Speaking now about the success scenario, the proponent claims it would be when “the Cardano blockchain powers the top 10 DApps and the 5 billion users use our Web3 solutions and domains.” What 10 Dapps are these? 5 billion users is a very ambitious number, in my opinion, I would like the proponent to have outlined more tangible ways to see if the expected final results were obtained. I disagree that it is clear how all this will reflect for Cardano, it would be necessary to measure measurable metrics, both qualitative and quantitative, that could demonstrate in a proven way what were the benefits of this proposal for Cardano, if it managed to meet the specific goals of the challenge, if new people have joined the community as active members who buy Ada, CNFTs, delegate in pools, use Dapps, participate in Catalyst... Anyway. I think that, like the other topics, auditability is not well defined, and I cannot understand how this proposal could be monitored and how its fruits could be measured. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 174, "q0": "The proposal fits into the Miscellaneous category as the size of the requested budget 500k and the business proposition of building a 8.5 Trillion USD business does not fit anyweher else, and even then I have reservations if it belongs in Cardano at all. It is so grand that no other category could accommodate it. The proposal is to build several brands on top of the \"Top 10 Web3 Domains, DApps and Web3 Blockchain Business Solutions\". The argument is that .com . net and .org domains will soon become obsolete and the top 10 domains that are in the proposers ownership is the good starting point for the revolution and is willing to put up to start the proposal. However given the obscure nature of what is being proposed I will not be able to give full marks", "q0r": 2, "q1": "The proposed budget is 500k, but early on in the proposal is states that 5 million will really be required to get all the trading, platforms and talent working together. The whole proposal centers around monetizing the domain collection of the proposer that end in .magazine, .valley, .brokers .hire and alike. There is no project plan and no tangible deliverable. The proposal is one speculation the future value of these domain names. The proposal has a number of statements that can not be verified, for example \"Actually looks like we will own monopolies and be the next Bill Gates Warren Buffet and Ruppert Murdock of the best decade they will be long gone and forgotten and our grand grand children's the leaders of the 22nd century.\". Elsewhere in the proposal it is mentioned that the proposed is looking for 11.1 million for 49% equity.The proposer \"Sebastien Staub\" has a webpage but lacks any detail who the person is and the linkedin profile points to a company in Mauritius. I conclude the proposal is undeliverable and at 500k budget would consume the budget for the whole challenge", "q1r": 1, "q2": "The information in this section contradicts the rest of the proposal which mentions the number of downloads from the google app store, but if that is not around anymore then from their own web3 app store. This proposal is unauditable and no other KPI or detail on the schedule of the deliverable has been provided", "q2r": 1, "assessor": "z_assessor_1076", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 849, "q0": "This is a very aggressive and ambitious project, from a proposal author who he himself claims \"I am not a tech guy.\"  The proposal also requests $500k USD, the entirety of the Miscellaneous challenge fund for F8.  Also his statements about his team such as \"My incentive to push them to work learn harder to become multi millionaires in 5 years\" is not so attractive as it aims to pursue a project purely based on reward, and with less vision on the actual deliverables and quality of the work and impact in the greater ecosystem.", "q0r": 2, "q1": "The idea is very scattered and I believe motivated by the wrong reasons, and by a team which has not the right talent or passion to deliver this important solution to the Web3 community.  Not to mention, the author makes several mentions of blockchain in his Web3 comments but never once mentions cardano or a plan to use cardano as the basis for this project, so how do we know!?", "q1r": 1, "q2": "The author repetitively makes comments about being open to ideas and that \"We will do this as a community,\" however the purpose for this catalyst proposal is that the proposer will do the project after Catalyst funds it.  I'm not compelled based on the auditability section of this proposal that a meaningful project would be delivered, or that the author has the right stills and motivations to deliver a project that could be meaningfully tracked and measured by any progress metrics.", "q2r": 1, "assessor": "z_assessor_1224", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 965, "q0": "The proposal does not seem to highlight the solution to a problem, it appears to provide a detailed breakdown of how it wishes to monetize domains and capitulate on revenue. The proposal also references so many domains of application, as an adviser I have no idea what it is the proposer is actually wanting to achieve. The one proposal contains references to trading, decentralized dns, domains, ride sharing, travel, publishing, software development, branding and marketing.\n\nThere is no way to measure impact. The statistics provided by the proposer also appear to be fanciful at best.", "q0r": 1, "q1": "I would definitely not advise the proposer to request the allocation of an ENTIRE FUND to their proposal. This is a community platform, not an investment allocation platform. \n\nAlso, the proposal is requesting funding on the grounds that it will result in the creation of a number of companies that are cumulatively worth more than the entire blockchain ecosystem currently. As a tech founder, a proposal this big would at the very least need feasibility assessments, a business plan, financial breakdown of targets etc.\n\nIn the later stages the proposer also hints that it is wanting to part with 49% equity in exchange for the funding. This places the post-money valuation of this proposal at roughly 1 mil dollars. Given the earlier target of a $8.5T, this means that this proposer needs to take the initial company value and multiply it 8.5 million times in order to reach the target.", "q1r": 1, "q2": "Zero auditing information is given. The auditability section seems to suggest that it will be producing an app as well?", "q2r": 1, "assessor": "z_assessor_1248", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 1704, "q0": "CA assessment based on 30 years working across system development lifecycle. Business owner (with marketing experience) and not for profit activist. \nThere's a bit of a serious problem with this proposal - in that there isn't a proposal. I have read through it 3 times to see if there's actually an offer or partnership stated which the Cardano community can make use of. \nThe real point of this request appears to be a spam proposal to highlight the fact that domains are available to people working in web3.0.\n\nWhilst it could be debated the domain names mentioned may be of value to someone, it doesn't seem like something that Catalyst was designed for. It should be up to individual projects to source the domain names for what they need. Maybe I'm wrong, and the catalyst community will see something in the idea of holding top level domains as an income for Cardano, but... the problem is the proposal doesn't make any attempt to address how that would happen? Do we get all the domains for $500,000 that's been requested or just one of them at the listed price? To be frank the authors tone make it seem like they are obsessed with get rich schemes and not offering actual value. That might sting but phrases like \"My incentive to push them to work learn harder to become multi millionaires in 5 years.\". Given there's no actual proposal just a idea to make money by requesting the whole challenge fund budget this is being given a 1 star rating. ", "q0r": 1, "q1": "The proposers obviously have good knowledge in marketing and domaining. However this proposal falls short on setting realistic goals on creating a platform based on Cardano to market the domains. A figure of $5M is mentioned which is well in excess of anything that project teams have been building on Cardano. Most proposals for dApps are in the sub $100,000 range. With one or two exceeding that for functionally rich dApps. Given there's no breakdown this idea needs much more work to define what is actually proposed, and to have a realistic budget, by pairing with a development partner who could advise realistic costs and timescales. Given that tokenisation has been mentioned a whitepaper would also be a suitable method to advise voters what they are funding. Given that there are no timescales or budget or any development work proposed, it would have been preferable to have seen this proposal withdrawn before assessment started given there's no means to achieve any of the ideas. For this reason a 1 star rating is given. ", "q1r": 1, "q2": "There are no object metrics defined that are relevant to what has been previously mentioned in the proposal. Whilst number of downloads in Appstore is mentioned, it has already been established there's no actual proposal for an app or dApp. Just the sale of some domain names. The rest of the statements are none specific or forward looking statements that can not be verified as part of project delivery. For this reason 1 star has been awarded. ", "q2r": 1, "assessor": "z_assessor_1406", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5235, "q0": "Not a chance. This proposal is requesting 100% of the fund. The proposal is also very poor in a lot of areas. I think the proposal does a great job of presenting relevant market research about the potential of this industry, the outlook of where it's headed, and the difference between this project and the competition. I find this to be missing from an unfortunate majority of proposals that get submitted. So, there are positives. However, if I understand the proposal correctly, this proposal doesn't actually do anything substantial for the Cardano ecosystem. This is not a Dapp on the blockchain, this is a business that intends to take payments in ADA (which does not cost $500k). There could be an argument made that offering ADA as a payment option could drive people to purchase ADA to get access to this service but that argument is effectively squashed by accepting payments via PayPal and other fiat systems. There is a misunderstanding of the word \"tokenize\" in this proposal, which is supposed to involve interaction with the blockchain directly. It is not capitalizing on the already existing assets of ADA. While it is impressive that the owner has obtained a variety of potentially high-value domain names, I think there is an overestimation of what they would be worth. I'd also like to point out that this proposal produces no innovation, which is the core tenet of Catalyst funding. The proposal needs to be clearer on the impact on Cardano and innovation. ", "q0r": 1, "q1": "For a long feasibility section, there's not actually any relevant information here. There's no step-by-step roadmap of what will be done and in what timeline. So, I don't know what the requested funds are supposed to be for. I have no way of evaluating if the money is being spent efficiently or effectively. There's also an odd conflict of why the proposer needs $500k worth of funding if he has $22.2 million in domain assets. As far as the proposer's capability to carry out what is being suggested, there's no LinkedIn profile provided to verify the resume that they've laid out. This is an absolute necessity for any proposal requesting over $30k. My suggestion for this section would be to delete all of it and start from scratch. Roadmap, budget, and Resume are what we need to be seeing with as much detail as possible. ", "q1r": 1, "q2": "This section is also lacking any relevant information. There's no definition/standard of success provided. No metrics for quantifiable KPIs are provided either. There's also no commitment to give updates in a public fashion to keep the project accountable. I'm actually still not entirely sure what this project is intending to do exactly. Are these domain names meant to be sold? Or is the proposer looking to start 21 different businesses in different industries? Give us a standard to evaluate from.", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5949, "q0": "The proposer has identified a problem and a solution to the problem but is hard to associate the proposal with the Cardano ecosystem. It looks that is addressing a narrow niche of potential customers and not a community. The only question to ask is: is this proposal valuable to the community? It looks like is not.", "q0r": 2, "q1": "The requested budget is $500k which is the entire Challenge fund, thus making it highly unlikely to receive that amount. Also the budget is not broken down into identifiable items so it is unclear what is to be spent and what is the outcome of these expenditures.\n\nFrom the presented references seems that the team has more experience in the marketing & advertising field and less on BC technology or any other related field.\nThere is no sensible and conductible plan for implementation that shows what is being done and how, and the proposer is not aware of all necessary resources to successfully implement the project.\n\nThe proposer has not considered challenges and risks relevant to a successful implementation. (any legal constrains for implementing this concept - implementing cryptocurrencies (tokens) payments?)\n", "q1r": 2, "q2": "There are no KPI/metrics defined to measure the success of the implementation. Based on the info provided it is difficult to objectively assess this proposal as it is very unclear for the outsiders on what is to be done and what resources are needed.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We will provide the latest Blockchain uncensored Media/ Travel/ Publishing/ Crypto/ Music stores and build the best UBER / BOOKING / AIRBNB", "experience": "Entrepreneurial and managerial Business Minded Person with a strong business acumen in Branding, Marketing, Domaining, Lead Generating, SEO/SMO, Digital Services, FinTech, Real Estate & Hospitality sector. 14 years in the Sales and Management, specialised in Web3 Domains."}