{"id": 403681, "author": "callyfromauron", "title": "Catalyst Facilitators’ Collective", "url": "https://cardano.ideascale.com/a/dtd/403681-48088", "category": 26441, "amount": 29540, "description": "There is no training program, and no community of practice, to support ongoing development of good meeting facilitation skills in Catalyst.", "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 274, "q0": "From my experience in the Cardano Community some people are fantastic at facilitating meetings and others are not great at it. Having better facilitated collaboration will benefit the Cardano community as a whole. \nI for one suck at it and if there was somewhere I could go to get some skills. Even if I can start off by watching a discussion with proper guidelines that would be very helpful to me. Then if there was a place to practice that would be magic.\nThis proposal aligns with the challenge because it does not fit in anywhere else but is a benefit to Cardano and the community.\nThe pan is designed in a way that there is lots of room to scale out and help more and more people.", "q0r": 5, "q1": "If voted for and funded this proposal has a very high degree of implementation. Look even if we school like crazy, everybody will still not be great at it but there will be a greater awareness.\nThe proposers have all the skills needed to implement the proposal and this is clear by how the proposal was set out and the vast amounts of knowledge it contains.\nThe timeline is well defined and structured and there is a plan to continue into the future with an ongoing community of facilitators. \nThe budget is reasonable and is needed to facilitate involvement from all the parties involved in the training and setup. \nThe four risks that were identified were well thought through and mitigated in the proposal.", "q1r": 5, "q2": "The auditability will be clear and transparent to all of us involved in the community. The whole 12 month strategy is well laid out and structured. Course materials will be made available to the community. Then space will be provided on for example discord where the community can engage to learn more.\nThe problem statement and the solution is clear and easy to understand.", "q2r": 5, "assessor": "z_assessor_1130", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 10754, "q0": "There is a growing need for facilitators in the space and training, skills, and compensation is a way for developing future opportunities to grow and develop them.  This proposal will look to do that through the Catalyst School", "q0r": 5, "q1": "The Catalyst School is a strong team filled with various folks who have helped to steer, train, and build people in the whole catalyst ecosystem.  This proposal is well within their wheel house to deliver a training and area that facilitators in the community can grow.", "q1r": 5, "q2": "There are great roadmap details, breakdown of funding spend, and a general list of KPIs that the progress of this proposal can be measured against.  This should give great auditability against this project to be able to deliver and measure their progress.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10812, "q0": "As a long-term facilitator and trainer myself, I see the value in the proposal. However, I would critcize the way how the problem statement and solution summary are presented: “There is no ABC in Catalyst. We will provide ABC.” The gist of the issue comes only later and can be literally read between the lines: “as a community, we are missing out on the potential for new approaches and fresh ways to address complex questions”. That is what the team is about to solve. The solution is to recruit additional facilitators/trainers, device a foundation level course for new facilitators, run the program twice and get 20 people trained to become facilitators, support and mentor them to try their skills in practice, provide a channel for peer support, and document everything, including a “Good Spaces Charter” that crystalizes the tenets of good facilitation. It will also be translated to two additional languages (although it’s not mentioned which ones). This is all geared to increase the quality of Catalyst events and make participation a more engaging and fruitful experience.", "q0r": 4, "q1": "Vanessa and Gustavo are both active community members. They form a great foundation for the five-person team. It’s interesting how they’ve left the three spots open. Proposers state: “rather than starting this proposal with an already-fixed team of 5 trainers, we preferred to give an opportunity to engage some new people as well”. Makes you wonder if it was due to time running out or an actual strategic choice. Either way, it’s a nice approach. When calculating the ROI (no, not “intention” but “investment”) it could be argued that 1,500 per person (30K divided by 20 people) is a bit on the high side. However, if you consider this as an investment to the future of Catalyst, you see how it can have a multiplying positive impact and therefore the cost becomes justified. Possible risks have been considered and mitigation strategies are discussed.", "q1r": 4, "q2": "The way the information is laid out is just brilliant. Vanessa’s pedantic and detail-oriented style shines through. Everything from KPIs to timeline to budget has been very well thought out. The step by step approach will lbe easy for the community to follow and everything (except personal conversations) is publicized. Definitely an auditable and clear proposal, exemplary even.", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10849, "q0": "Moderators are important figures and basically always present at Cardano meetings. Their functions are described in the proposal so that those who do not know what they do will understand well in which branch this proposal would act. The Catalyst School is already a well-established group at Cardano, which teaches several things, from how to be a CA, how to submit a proposal, etc., but this moderator role was never really the focus of the workshops. And because it is something fundamental for the smooth running of meetings, I think that investing in how to be a good moderator can significantly increase the quality of meetings, and this would certainly benefit the entire Cardano ecosystem, since practically every meeting in the our ecosystem are online. In other words, the proposal is of very high value for the Cardano community. In fact, it doesn't fit into any other challenge either, so it makes sense that it was posted here. I found it interesting, specifically, when proponents say that Cardano meetings all basically follow the same format, and that this limits how we approach certain subjects - certainly the training of facilitators would make a difference here too. A great idea.", "q0r": 5, "q1": "Although time is not broken down into months but rather into longer intervals, a lot of detail is given about what would happen in each of these time periods. We know what would happen and how, the activities are explained fully and in a very accessible way, we understand when such a thing would happen and what is the need for it. So the script part is great! If the division were monthly, it would be easier to audit the proposal, but this did not interfere with the understanding of the process as a whole. Talking now about the budget, approximately 30 thousand dollars are requested, and this amount is divided into very detailed parts, we know the hourly value of the professionals involved, which part of the expenses would go to accounts and licenses, we understand very precisely the because the requested value is this. I was just confused because some expenses are measured in dollars and others in euros. Other than that, this part of the proposal is also excellent. Finally, speaking of the team, it is a little confusing if Vanessa and Gustavo are members of the School or if it would be them + the members of the School (in which case, which ones?). However, in relation to this pair of professionals, a lot of confidence is passed because we know in great detail what their resumes are and how they relate to Cardano. Therefore, the proposal is extremely viable, requiring only minor improvements.\n", "q1r": 5, "q2": "The proposal is fully auditable, the topic being almost perfect. Proponents give many metrics for measuring both progress and end results. As for progress, they are given a lot of quantitative data (such as the number of trainers involved and the variety of where they come from in the ecosystem and number of training sessions planned and delivered), but they also say that they will do a qualitative analysis. The only thing that could have been clearer would be how all this would come to the attention of the Cardano community. And on the subject of success, they also outline numerous verifiable ways in which it could be measured, and again it is not so explicit how ecosystem members would know whether these things have been achieved or not. My suggestion is that proponents make regular meetings or reports to inform the partial results to the community (or if they are going to meet with the coordinators at IOG, that they disseminate what was discussed). And it would be interesting for a more detailed final report to be presented, raising all the points mentioned in the success section (whether they were achieved or not, and how).", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10858, "q0": "This is a proposal that definitely fits or aligns with the objectives of this campaign category. It aims to promote the training and the culture of quality meeting facilitation skills within the community. It aims to create a standard that will ensure that various meetings, meet ups etc are comply with an up to date and quality guides and conduct. This proposal will assist and add value to the various collaborations within the community with the objective of bringing the best of the human collaborations. ", "q0r": 4, "q1": "The proposal has well articulated plan what they need to do and how they intend to achieve their goals with a combined experience of more than 30 years in the field, there is very likely chance that they know what they know how to get this job done. In addition, the proposer's profile shows that that they have skill and competence and  being active members of the community, and conversant with the catalyst process, they can effectively implement this proposal. The Milestones provided are detailed and well articulated and looks reasonably achievable within stipulated timeframe. The budget breakdown and cost analysis are reasonable and well explained within the context of the Milestones. Risk factors were identified and possible solutions proffered accordingly.", "q1r": 4, "q2": "The proposal provided an array of success metrics that is more than enough to effectively monitor and assess the progress and development of the project. As per the information provided, am convinced that the project will be conveniently monitor by the community if eventually funded.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11006, "q0": "Entrance into a new area can be quite exhaustive and confusion if there are no people to walk by your side, and I am of the view that if there are well trained facilitators this will actually help the objectives of the Cardano mission. Proposal as explained in the write do fit into the challenge team.", "q0r": 5, "q1": "The Catalyst School though provide training, these are mostly based on defined process of the ongoing programs, and this proposal seeks to trained people to support the school initiatives and build a community that is there to help people coming into the ecosystem get along. ", "q1r": 5, "q2": "With the support of the Catalyst School and the experience of the crop of people behind the proposal is a viable project. Also considering the matrix of the project and its detailed breakdown budget it will be easy to track the progress of the project.", "q2r": 5, "assessor": "z_assessor_270", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11016, "q0": "In my years of professional experience in different industries I can recognize that a good facilitator makes the difference to achieve the objective of a meeting, I have seen successes where from a meeting we have been able to reach consensus and even the definition of actions that have allowed the company to reduce hundreds of thousands of dollars and I have also been in countless meetings where not only the objective is not achieved but you leave feeling that you wasted your time. And for me, the key factor is good moderator skills. So from that point of view I totally agree with your proposal. We are looking to train a total of 20 people, who could become part of the Catalyst School facilitator collective. The metrics are aligned with the problem and the challenge. So in general I agree from an Impact point of view. \n", "q0r": 5, "q1": "I found the description of the budget to be impeccable, making the necessary clarifications to allow the CAs and the community in general to understand the team's logic behind the amount requested. Likewise with respect to the implementation plan, from my point of view the nature of the proposal is not complex to implement, however, they took care to present all the necessary details to know what will happen at what time. I must congratulate the team for the great approach they gave to the risk section, because basically they did what is expected in this section. Identify a risk, estimate the criticality of the risk in terms of probability and severity and present a countermeasure to mitigate the risk. Regarding the skills and experiences two people are presented as part of the core team, both presented a sufficient description with the necessary links to check them, additionally it counts as Catalyst School as part of the team which adds another layer of confidence. ", "q1r": 5, "q2": "Finally in the Auditability section I must say that the team makes an excellent description of the success criteria and presents a set of metrics that will allow the team and the community to know what is the status of implementation. After analyzing them all I find them simple, easy to measure and in line with all the activities that will be carried out. It is clear to me that there is a clear understanding of the problem and its ramifications, all the necessary considerations were taken to present to the community a proposal with all the necessary considerations to be selected by the voters. 5 out of 5. Congratulations! ", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Deliver facilitation skills training via Catalyst School; build an ongoing facilitators’ community to champion good facilitation skills.", "experience": "Proposers have total 30 years' experience in facilitation, training others to facilitate, and devising learning programs; good understanding of the Catalyst ecosystem and its needs.\nCatalyst School is a focus for learning and skills-development in the Catalyst ecosystem."}