{"id": 403795, "author": "davidbayon", "title": "CardanoFeel (Cardano -> Real World)", "url": "https://cardano.ideascale.com/a/dtd/403795-48088", "category": 26441, "amount": 10000, "description": "Cardano is virtual, there are no other ways to “physically feel” key metrics (day of epoch, price …) apart from using a phone or computer.", "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=7678"], "media": [], "f6_assessments": [{"id": 1093, "q0": "This would definitely not fit in any other challenge. It is creativity-focused, and the product is artistic Cardano-themed furniture pieces. It is definitely an out-of-the-box proposal.", "q0r": 5, "q1": "Much of the preliminary work is already done and if you go to Mr. Bayon's web site you can see exactly the household lighting he's hoping distribute. Whether the lighting accurately reflects Cardano epoch timing and up-to-date price information triggered by updates from a Twitter bot is another story, but it's possible. \n\nA real question that is harder to pin down is whether this creative endeavor will be popular. I couldn't say. If there is a demand for these sorts of items, it will emerge, and part of what he's requesting is an opportunity to find that demand. About a third of his requested budget is dedicated to developing his website and videos--effectively the ground floor for eventual marketing. And the amount he's requesting is $10,000, which isn't enormous. And I'd recommend voters keep both these things in mind as they decide whether to support his project. ", "q1r": 4, "q2": "His goals are to produce what he's laid out, which is perfectly auditable. The only area where there is some ambiguity is \"Lots of people use CardanoFeel.\" \"Lots\" can mean many things. But overall, yes, this proposal is auditable.", "q2r": 4, "assessor": "z_assessor_1275", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 1887, "q0": "This is an out of the box proposal for the creation of an IoT device that can translate the Cardano rhythm to the real physical world. By such a device a lot of different endpoints could be controlled and therefore different human senses could be triggered trough light, sound, heat etc. The goal is to express Cardano native metrics like epochs, transactions, congestion etc. into the physical world in order for the people to be able to sense the blockchain. This could be used in different ways, just as a fun thing to have, but also it could be used by traders to improve their trading performance.\nI strongly agree that this proposal effectively addresses the challenge and there is no better challenge in this fund that could host this proposal.\n", "q0r": 5, "q1": "The proposer has a proof of concept already build with 3 prototype lamps.\nThe proposal has defined a plan for action with time allocated for each task. The time line is not clearly defined, so the voter could not know which task will be finished first, however the whole project is ment to take less than two months, so there is not much difference which task will be completed first.\nThe proposal has a budget breakdown outlining the funds needed for different sections of the project, however there is not much detail in the breakdown. The good thing is that there is an ongoing development section, which means the development and support will continue for a year.\nThis is a single person proposal there is a link to the proposer linkedin account that is explanatory. It looks like the proposer has experience in building similar projects.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The auditability section of the project proposes several milestones for evaluating the progress of the project development. It is based on the finished work in the timeline outlined by the feasibility section of the proposal. Likewise the success metrics are clear and measurable.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_1417", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3727, "q0": "The idea of the proposer seems to be really good by getting the updates of cardona and the price of ADA without even using any phyical devices just like IOT. If implemented properly it will be a huge success and most of the people will prefer to use this. The proposer has uniquely identified a need for IOT based cardona and has also worked towards the implementation which is impressive and it will attract a lot of people to get involved in this and hence increase the popularity and face value of the cardano ecosystem. The proposer has already pointed there will be very minimum challenges as the prototype is already being tested and has effectively addressed the challenge", "q0r": 5, "q1": "The proposer has a very innovative idea of introducing real world cardano and has also provided referral links to provide evidence of relevant skills and experience needed to implement the proposal and proposer seems to be very well versed in many of the topics required to implement the proposal. The budget is outlined clearly and is broken down into identifiable items which seems to be fair and is reasonable. The proposal also offers a realistic time to complete the project in time and the proposer has also mentioned the resources required which gives us a clear idea on how the project is going to work. By the given experience and the plan for the proposal is more likely to be implemented successfully.", "q1r": 4, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 10000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more users which is impressive. Proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4594, "q0": "The proposer has mentioned unique way to keep the people about price of cardano updated , where it can be installed in some place, user can just understand the cardano rates just by looking at it, the proposed idea will attract all the people where it also produces tune which is also interesting aspect of the model hence This proposal effectively addresses the challenge in a unique way possible.", "q0r": 5, "q1": "The proposer has already completed prototypes of the project ,and has also mentioned how he is going connect the lamp by IFFFT for personal account and how he'll be using twitter bots, even setting up such a lamp is not a very difficult task as there is very much advancement IoT projects already, even the proposal has great experience as developer with given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has clearly introduced himself with his profession, but proposal doesn't contain data on marketing strategy of the project.\nThe proposal has presented many goals such as creating stickers, lamps, videos and other aspects  , this shows the proposer wants to continuously build one or another model for cardano without stopping himself , the proposal contains clear budget breaking and timeline ,hence the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5371, "q0": "This proposal clearly identifies a common problem within the challenge which needs to be solved. Their solution adds value to the Cardano ecosystem in their own unique way. Although this is the case, this project presents ambiguous goals and no key metrics to support its challenge settings. For example, it would be more impactful if the project addressed the type of customers they are targeting to serve and have statistics to back up their case (ie. 60% of U.S. college students consider themselves to have a cell phone addiction. 71% of people sleep with or next to their cell phones. 35% of people think of their cell phones when they wake up while only 10% of people think of their significant others). In is concerning that the project presents no future challenges. I would have been more confident in project if there was initiative for them to foresee potential risks and how they can be prevented of minimized.", "q0r": 2, "q1": "The proposer has shown their relevant skills and experience with the links provided and seems competent in undertaking this project. Since the proposer stated that he will be running the project himself it would be advantageous to have information on his suppliers and whether individual contractors will be used to help in the success of the project. The roadmap presented is unclear, it would have been better to see more specifics of each phase – especially in the development phase of the product. It was vague in the sense that there were such short timelines in the creation of bot pulling data and the creation of IFTTT integration. Did the proposer account for time in back testing or fixing potential problems? Even though the budget outlined appears reasonable, it is important to have a supportable plan on the allocation of funds made to ‘ongoing developments’ – especially with it being a much more significant amount compared to other items. The proposer doesn’t show how their plan is being done. It is unclear on the resources needed to implement the proposal and no technical aspects were shown (i.e how will the cloud bot work?) The proposer also presents no foreseen challenges on the project which gives me the impression that no risk contingencies were explored.", "q1r": 3, "q2": "The roadmap and milestones of the proposal were portrayed to be unrealistic. This was mainly because insufficient information was provided and the short timeframes allocated to each phase of the roadmap. The budget of the proposal was vague and didn’t have a verifiable plan to support the ongoing development funding. It would be beneficial for the proposer explore the idea of using measurable metrics to assess the success of the project (i.e 10 tutorial youtube videos to be completed in 1 week or 5 lamp designs to be completed in 2 weeks). Although the proposal identified the target problem and their solution, with the information provided it was not sufficient to fully audit the progress and the success of the project.", "q2r": 2, "assessor": "z_assessor_1953", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9622, "q0": "This proposal sets out a very clear problem and which fits well into this challenge, because unless I am mistaken, the other challenges would not have been appropriate for the originality of this initiative, as well as its solution which provides for the manufacture of objects to express the fluctuations of Cardano. Its positive impact is well explained and its value for the ecosystem as well. One can imagine that the success of this proposal could lead to other proposals of this kind and therefore address future challenges. ", "q0r": 5, "q1": "The description of the proposer is supported by links, the way he writes this proposal is in his favor, because it gives us a little glimpse of his character from his previous passions and experiences. The website is very complete, it provides additional information and allows you to get a good idea of ​​the result. The fact that the proposer has already started this project before this proposal shows its ability to carry out this project, having already set up a prototype. The budget is well detailed, and seems coherent. The same goes for the plan which seems realistic. The technical aspects are approached in a rather simple way. Only the risks could have been a little more thought out…aren't there always some risks? Like the fact for example that these lamps do not attract consumers, or that some people do not understand the importance of feeling things. Could this have been mitigated with an inventive but also re-educational solution, as a kind of promotion to learn to feel again? (just an example). ", "q1r": 5, "q2": "The roadmap is clear with milestones and time horizon of achievement. The KPIs make sense and allow us to base ourselves on precise indices to attest to the success of this project. It is really appreciable that the proposer, despite a project that is out of the usual projects, has nevertheless paid particular attention to its auditability. In particular with a didactic approach through its Youtube tutorial videos. Twitter, youtube and the website will also allow us to follow the project. Moreover, this proposal have a different dimension of auditability, this is her physical and sensitive experience, which we can imagine ( for the moment) when we go on the website. \n", "q2r": 5, "assessor": "z_assessor_739", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Leveraging IoT to have physical objects (ie. lights) express key metrics (day of epoch, price…) without the need for a phone or computer.", "experience": "13 years in innovation as developer and manager in largest Australian company where I developed and managed over 20 web applications\n\nEngineer, Full stack developer, tech lover\n\nAn artist at heart"}