{"id": 404131, "author": "carpoolcrypto", "title": "CarPool Education/Onboarding System", "url": "https://cardano.ideascale.com/a/dtd/404131-48088", "category": 26441, "amount": 75000, "description": "Global markets continue to weaken resulting in millions of people desperately seeking education on how to safely enter the crypto market.", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3492, "q0": "The proposer has written their idea on equipping more knowledge and information to a huge number of people to be confident in entering the crypto market. Proposer explained thoroughly about how what kinds of information and knowledge they want to deliver to beneficiaries to join in the crypto market. The sufficient information about the results delivering to local people and its contribution to people and ecosystem was mentioned by proposer. It will be nicer if the proposer can include some successful case-studies to make the proposal be more reliable. \nThe proposer put lots of effort in explaining on detailed about how the proposed solutions will address the challenging. The proposal aim to not only support for new people who want to join in the ecosystem but also activate both the Cardano community and outside of that. It also target to involve youth, the active and dynamic people to make the ecosystem be stronger and reputable. \nKPIs and Metrics were mentioned clearly with both qualitative and quantitative indicators that all stakeholders have to consider when applying it. In addition, the proposer don’t forget on guiding how to realize these indicators in reality. It is a great effort from the team. \nRisks were identified by the proposer, togethers with how they want to figure out the tentative risks and turn it to be opportunities. And in all explanation, the proposer always paid attention on how these actions will influence to the Cardano ecosystem. ", "q0r": 5, "q1": "The team member’s biography were mentioned by the proposer clearly so that all audience will know how these people’s background will be fitted with the project, and if having the team allocation, it will help all stakeholder understood about the reasons of appointment. However, there were no information about how the proposer want to form a team with specific roles and tasks. It is better to add more information about this. \nFor both road map and breakdown budget, the proposer attached the Pdf files with the proposal. So, it was not able to see how was that and how it is mentioned. The proposer can consider again how to write in the most convenient way for all the audience and the judgement if they want to read them in the most comfortable way. \n", "q1r": 3, "q2": "To measure the progress and development of the project, the proposer already a careful KPIs and metrics for all stakeholders to consider about how it can be achieved. However, there are lack of the roadmap in the proposal so, how to consider it alignment with the project will be hard to confirm a bit. The proposer can consider how to add information regarding to the roadmap to see easily. \nThe success of the project focus on the long term results. However, it will not fixed for long term, that might changes due to various circumstances. Therefore, the proposer decide to consider again on a regular basic bases on assessment results. So, it could be understood that, the project success will base on the assessment of indicators achievement and have possibility to change flexibly based on result assessment. \nWithin the project’s proposal, there is no information about whether this project is new or continuous ones of a previous funded project. The proposer can add more information about that. \n", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "This assessor seemed to have a problem opening the attached PDF files containing a roadmap with milestones and detailed budget. We will upload some additional photos of the documents and perhaps type out an outline of each so that voters can see. We thought PDFs would be the most universally viewable. "}, {"id": 3729, "q0": "A cryptocurrency is an encrypted data string that denotes a unit of currency. It is monitored and organized by a peer-to-peer network called a blockchain, which also serves as a secure ledger of transactions.NFTs are unique digital items store stored on a blockchain, the same network that runs cryptocurrencies. NFTs act as tradeable certificates of authenticity for digital art, memorabilia or fan merchandise. Most of the people around the world have only heard about these terms but have no idea how the block chain works and the benefits of it. Carpool education/ On boarding system has taken a very good initiative of providing knowledge and education to the people about such futuristic topics. Providing education on such topics is on of the major challenges in todays world and the proposer has identified the problem and is working towards a solution for it which should be appreciated and by doing so it clearly educates more people on blockchain and cardano which will add more value to cardano platform. The proposer has also mentioned the key metrics required for the success of the proposal and has a clear idea on how to make it successful. The proposal has already addressed the present challenges and is also scalable for future challenges.", "q0r": 5, "q1": "The proposer has a very well experienced team to achieve this goal of educating the peers. The proposer has also provided links to provide evidence of relevant skills and experience needed to implement the proposal. The budget is outlined clearly and broken down into individual items which seems to be fair and reasonable to achieve the goal. The plan to implement the proposal seems to be sensible and conductible plan as they have also mentioned on how to implement the plan and also the metrics to attract more students. The proposer is well aware the present challenges they will be facing during implementation along with the future scalable challenges.", "q1r": 5, "q2": "The proposer has a very well planned roadmap to achieve the proposal. The proposer has request funds of 75000 USD and also given the breakup cost of all the identifiable items which seems fair and is reasonable to achieve the goal. The proposer has also mentioned the key metrics on how to implement the plan and also how to attract more students which is impressive. The major problem right now is that most of the people around the world have no idea about blockchain and cryptocurrencies and the proposer has identified a real world problem, understood it and is working towards a solution to solve the problem and the provided information is sufficient to audit the progress. The expertise and the knowledge from the proposer and his team and the implementation of the plan is more likely to succeed.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5373, "q0": "The problem described in this proposal is clearly identified and it is clear how the project intends so solve this. The project is also aligned with the challenge as it intends is to add value to the Cardano ecosystem through education and awareness. The proposer also provides information on why their proposal fit the miscellaneous challenge. The proposal presents sufficient key metrics of monitoring growth which support their outlined challenge settings. Success is also measured through KPIs conducted in various areas of the project (sales, marketing, operations & instructors). This gives reassurance that they will be accountable for all facets of their project. It gives me great confidence that the proposal has addressed the foreseeable risk and challenges of the project and have devised a thorough plan on alleviating these situations.", "q0r": 5, "q1": "The proposer provides very a descriptive background of the team. It is evident that each member of the team is competent in implementing the project. Their individual skills and experience are adequate and the variety of specializations give clarity on their ability to accomplish the tasks outlined. The roadmap is clear, concise and each phase have realistic timeframes to complete the work. The challenges and risks of the project have been sufficiently been addressed and adequate solutions have been devised to help alleviate them. The budget presented was vague and raises some concern. The amount requested was 75,000USD and the amount on their budget breakdown was 26,579. Are the remaining funds going to be compensated to the owner? I was given this impression as the budget provided shows that the owner had already invested 50,000 USD into the project. It is important for the proposer to clarify if the owner was going to be compensated for their investment and also to give information on the break down on what the invested capital was put towards. ", "q1r": 4, "q2": "The proposal was very descriptive of the identified problem. It was also evident that that the proposer is really knowledgeable on how their solution addressed the problem. The use of KPI’s and key metrics that was used to define the success of the proposal was well thought out and measures were used to cover various areas of the organization. The roadmap had realistic timeframes and attainable milestones. There was clarity in nearly all aspects of the proposal, it provided sufficient information and was easy to audit.", "q2r": 4, "assessor": "z_assessor_1953", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5597, "q0": "This proposal correctly addresses the challenge given it s a proposal for general education on Cardano, Crypto and blockchain that is available for everyone to gain knowledge on how to safely enter the crypto markets and avoid doing it blindly, which is something that right now the ecosystem is lacking even though there is a lot of information out there in youtube channels ets, there isn't a one-stop place where education is provided on a basic level. The miscelaneous challenge seems to be appropiate for this education proposal given it is not mainly trying to expand the cardano community per se directly but just provide information to people who are interested in blockchain and crypto. This will inevitably bring some more people towards cardano once they learn some of the intricacies of the ecosystem but it would be more on an indirect basis. ", "q0r": 5, "q1": "The plan presented by the proposers is very extensive and detailed in nature. few things highlighted below that indicate this is a feasible and achievable project and gives the proposal credibility:\n1. Extensive experience of the project team, they have taken teh time to explain the background of each of their team members which is valuable, would have appreciated some links to their social media like linkedin or twitter to be able to grasp how involved they are in the space but it is not a big deal at all given they have extended in their bios further. \n2. Descritpion on how they plan to make their solution a reality is very detailed and clearly explained;\n3. Metrics and KPIs are very clear and specific which is absolutely necessary ion this type of project \n4. Very clear roadmap attached to the proposal which makes it tangible and believable \n5. Budget breakdown which allows the public and catalyst to understand where the ask comes from and what the money will be used for which is crucial for Catalyst. ", "q1r": 5, "q2": "This proposal is very complete and it has a lot of details on KPIS, metrics which like I said before  is key in these type of educational projects. This together with a detailed timeline and the budgets provided make this proposal fully auditable by Catalyst over time to see if they are fulfilling their milestones and spending the money right. Overall very well written proposal, its good to see educational projects that seem to be serious about developing people in a professional way given knowledge and education is the most powerful tool humans have. ", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Design, develop, market, & deliver an interactive crypto-literacy & education program incentivized w/ ADA & CNFT’s for attendance & learning", "experience": "A combined total of 50 yrs of professional experience in marketing/biz dev, cryptocurrency/stock market investing/trading, charting, educational course dev & deployment, adult learning theory, simulation learning, & facilitating psychologically safe learning environments."}