{"id": 404499, "author": "skyros", "title": "Prevent Attacks on Cardano", "url": "https://cardano.ideascale.com/a/dtd/404499-48088", "category": 26441, "amount": 33000, "description": "Malicious actors can launch distributed attacks and spread disinformation to undermine trust in the Cardano ecosystem.", "f6_no_assessments": 8, "f6_rating": 3.2916666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 5564, "q0": "The proposer is asking for money to hire his own company, that presumably specialises in threat detection, by scanning “the dark and deep web to uncover malicious chatter directed against specific targets”.\nHowever, first, I don’t consider the really threatening hackers as being so negligent as to talk in open forums, that could be monitored by others and declare they would want to hack the Cardano blockchain or some specific parts of it.\nSecondly, we have no information on how such an attack might happen, how feasible it is to actually happen or what the consequences might be.\nThird, we have no information on the achievements of this company, how do we know they have been doing sufficient successful hack preventions in the past, as to explain the $33000 that Catalyst would provide them for it.\nFourth, the company is not focused on blockchain technology, the proposer claims that the network will be “retrained to monitor the Cardano ecosystem” in 3 months after funding is received, but there is no further explanation beyond that.\nAs such, I find there are too many missing details that would prove the proposal to be having a real impact on the Cardano ecosystem.", "q0r": 2, "q1": "The plan and timeline are loosely described, the steps to be implemented are not sufficient to analyse the development of the project. \nThe budget is offering some details on how it will be spent, yet I find it unclear if some of those described points are as necessary as they claim to be, especially since the proposer and his team don’t seem to have sufficient knowledge on the Cardano blockchain. There is no description regarding the team, as they claim “Our team members and network of hackers prefer to remain anonymous due to the secure nature of our work”. But since I cannot find any kind of information about their previous skills and successes - even a an anonymous group - I cannot fully assess their capabilities in implementing this project.", "q1r": 2, "q2": "The solution offered for the progress development is sufficient, considering the proposal’s plan. For the success description, however, it would have been important to have some specific milestones attached to the statements provided, in order to provide the community with a clear way of assessing the success of the project.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "This assessment needs to be filtered out because the review makes an inaccurate statement. He writes, \"I don’t consider the really threatening hackers as being so negligent as to talk in open forums\". However, hackers are known for doing this all the time as they organize for future attacks and to celebrate completed hacks. This is often how they are caught by authorities. This assessment should be removed due to this inaccurate statement."}, {"id": 10753, "q0": "Generating surveillance through the use of a white hat hacker group can help to uncover potential vulnerabilities that could cost the community a lot of money and reputation.", "q0r": 4, "q1": "It's unclear how they will do what they do.  The breakdown of how costs are allocated make sense, but there is little mentioned in the proposal about how they will look and search for vulnerabilities and which segments of the ecosystem they will be targeting and looking at.", "q1r": 3, "q2": "The auditability of the project is limited given the nature of the proposal, but they have some lagging indicators including providing training at fixed intervals to keep the team abreast with potential threats and to raise awareness.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10767, "q0": "As this is a proposal inside the Miscellaneous Challenge figuratively speaking almost anything related to Cardano goes, unless there is a challenge where this proposal is better suited. I would agree that the proposers have correctly placed their proposal in this challenge. The proposal does articulate how it intends to add value to the Cardano ecosystem and I would say that the team's problem statement (\"Malicious actors can launch distributed attacks and spread disinformation to undermine trust in the Cardano ecosystem\") is very pertinent for any burgeoning technological and social system. The proposed solution sounds potentially interesting as the proposers claim to have two important and seemingly powerful tools at their disposal that they can apply to resolve the problem: (1) Skyros's global network of hackers and (2) a threat detection software to discover attacks before they are launched. The team states that its proposed solution addresses the challenge by \"proposing a great idea that offers a valuable service to the community\". The two tools and the valuable service seem to promise a great impact. The team identifies a \"major challenge\" in the form of successfully alerting the broader Cardano community when an attack has been discovered. The solution is a website and social media channels. The proposed impact score has been lowered due to the inability of the team to provide verifiable experience with this type of projects, that would certainly increase the expected added value to the Cardano ecosystem", "q0r": 4, "q1": "The feasibility of this proposal seems to be it's Achilles heel. The team behind the proposal does not provide any evidence its claims of relevant skills and experience needed to implement the proposal. The company's website states that the company Skyros Intelligence was started by security experts. No references, no names. The two core elements of the solution are presented as concepts with no verifiable information (1) Skyros's global network of hackers and (2) a threat detection software to discover attacks before they are launched. These are key components of the proposal - but remain completely out of the picture. Yes, of course, the proposer may claim that Skyros Intelligence is unable to reveal the innermost details of its two critical pieces of operations. Fine. Even so, if these two solutions are so efficient, we could have been presented with a list of verifiable previous successes/results and Skyros Intelligence's previous clients and recommendations. Maybe even this is not in the public domain? There is nothing in the minimum verifiable about previous experience on the Skyros Intelligence website. The proposer has not shown the type (specific hacker expertise - which operating systems, programming languages, network expertise - maybe also Haskell, Plutus?) and number of team members required to implement the proposal. The plan does not contain any verifiable information that there is a Threat Scanner that is operational AND performant. It is left to the voter to believe that this is a fact. Skyros could prove its efficiency indirectly through accounts from its clients or through press releases or other forms of proof that is certainly has at its disposal as a - a security firm with expertise in ethical hacking and the dark/deep web. The very existence of the Hacking Network is based on voter trust, as it has also been backed with as much proof as the claims about Skyros's expertise in ethical hacking and the dark/deep web. If this proposal is not voted in. I would recommend that Skyros provides verifiable proof of its expertise, the merits of its technical solutions (Threat Scanner) and what do the updates to Threat Scanner consist of? What are the Cardano Threat Scanner updates all about? Will they monitor distributed attacks on Cardano AND how will this be done as Cardano is a decentralized system itself. The philosophy - if not the technical details - behind these solutions would be of interest. What is also the nature of the relationship between Skyros and its  hacking network - exactly? A monthly stipend of $500 to monitor for attacks has not be backed up with a breakdown - how much time, how much monitoring, what kinds of reports are provided by these hackers? Skyros offers performance bonuses of up to $1,000 for hackers who uncover potential attacks and alert, meaning that without any discoveries the monthly stipend is paid out regardless of success. I would recommend that Skyros details more information about the ways it can prove the value of its service to Cardano - in a verifiable way, if this proposal is not accepted in this fund. The \"team members and network of hackers prefer to remain anonymous\" - however, that has a negative impact on the Feasibility of this proposal, taking into account that the company itself seems poorly transparent based on its skeleton website. \n", "q1r": 1, "q2": "The team specifies that Quantitative metrics will be difficult to use to measure the success of this project (claim: \"because it is hard to anticipate the volume or nature of the threats that our system will uncover\"). Still, not being able to anticipate the general nature of threats may seem a bit strange for a company that has plans to retrain its hacking network to monitor the Cardano ecosystem and to deploy an updated version of Threat Scanner in the first 3 months. What does this training consist of and what is the nature of these updates, would be interesting to explain? \n\nHere are some possible metrics:\n(1) Number of prevented attacks. \n(2) Number of reports provided to the Cardano community\n(3) Number of hours spent by the hacking network (that is paid a monthly stipend of $500 to monitor for attacks) per week and per month and which technical tools are used for monitoring (is it the Treat Scanner alone?) \n(4) Number and technical qualifications of members of the Hacking Network and their geographical distribution \n(5) Number of false positives\n(6) Nature of attacks and classification by groups of attacks and regions where they originate from\n\netc...  It took me 30 seconds to come up with these ad hoc metrics. They might not be good, but then Skyros can surely provide us with better ones if these are not good. \nA company such as Skyros Intelligence that is self-defined as a security firm with expertise in ethical hacking and the dark/deep web, should be able to provide metrics based on its experience with previous work for its clients, fighting against distributed attacks and spreading disinformation. The timeline is present but not detailed and seems difficult to audit from the outside as it is very generic in its formulations.  \nUnfortunately, the solution that Skyros provides is essentially unauditable at its very core - as it is based on complete and full trust in the claims of Skyros Intelligence. Yet the company  has provided no proof of its competencies, of its previous successes, of the capabilities of its Hacker Network, of the ability of the solution to address the problem of its team. The proposed solution resembles a piece of fiction - if there are no facts to back it up and it is not auditable - because the auditing will seemingly be dependent on full and utter trust in feedback from the anonymous team, anonymous hacking network, unproven Threat Scanner. This could be remedied (in Fund 9 if this proposal is not voted for) by including sample reports authored by Skyros Intelligence from other projects that can demonstrate the wide breadth of experience and capabilities that Skyros, its team, its Global Network and the Threat Scanner have. Essentially, the question here is how can claims of prevented attacks be audited? Show us. Launching a new website to list threats that have been detected is seemingly not enough as the presented information again requires a component of full trust in components and participants that remain invisible and anonymous - apart from the Skyros webpage. Catalyst is financing and Catalyst needs more than verbal assurances. It needs proof that the Wizard of Oz really exists behind the curtain. ", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10826, "q0": "The proposal is a great idea which aims at contracting a network of hackers to monitor and prevent potential coordinated attacks towards Cardano Network. Ideally, the proposal satisfies the objectives of this campaign category as it claims that it has an effective monitoring software that will custom made for our Network to track and expose these attacks before it causes harm to the network. This proposal will bring an added value to the security and safety of the network and should be supported.", "q0r": 4, "q1": "The proposer claims that the ability to contract a group of hackers to expose hacking threats to the network. The efficacy of it's tracking software was unequivocally touted in this proposal however. The anonymity of the staff were expected considering the nature of the Job. The Milestones stated is a key point to monitor the project and it was detailed within the specified timeframe. However the main risk is how do we monitor the effectiveness of the implementation of this project and future collaboration. The  provision of a website to broadcast this information to the community and through various media channels suffice to give the network and community, a heads up. ", "q1r": 4, "q2": "The proposal had specifically stated that it will be provided a quantifiable basis to assess the performance. However, the fact that there will be channel to broadcast their findings to the community suffices and the community will attest to the success or otherwise of the project if eventually funded.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10840, "q0": "I found the idea quite relevant, I was just confused about what ethical hacking would be, which is mentioned in the proposal. The idea is to partner with a company that specializes in this and monitor possible attacks on the Cardano network before they happen, this would be done through specialized software that would constantly monitor the deep/dark weeb, identifying possible malicious actions aimed at a specific audience. I think the explanation of what would be done is very accessible, but it could be more detailed. How would that work? Does some kind of software like this already exist, and are the results consistent with what is expected? I would like the proposal to be more detailed, although the idea is good, I would still like to understand it more deeply. It would also be interesting to explain more about this company they want to partner with, what exactly it does, examples of previous work and what ethical hacking would mean (to me this seems contradictory). Maybe people in this field understand everything that is being said, but I as someone who is not in the tech area missed these explanations. However, the idea is good and doesn't fit into any other challenge (maybe Dapps), so it fits this one.", "q0r": 4, "q1": "The roadmap exists but it is shallow, we only have a basic understanding of what would happen during the development of the project; it would be more interesting for proponents to break the timeline into smaller scales (such as monthly) and to provide more detail for each of the activities. Talking about the budget, an amount of 33 thousand dollars is requested, which was duly explained (we know it would be divided into some parts, such as payment to hackers, system maintenance, server costs, etc.). It is explained why each of the parties would cost what is asked, mainly in the payment of the hackers. We know very well how this would work, so this part of the proposal is quite adequate. The team says they prefer to remain anonymous, this to me is a bad thing, even though the nature of the work requires privacy, we need to know who we are dealing with in order to have confidence that they are capable of executing the project. In this case, it would be essential to know the names and CVs of those involved, and how they relate to Cardano. That is, unfortunately, this lack of information causes a profound decline in the quality of the topic. Only the budget division seems good to me.", "q1r": 2, "q2": "Proponents claim they will produce reports, but what exactly is being said in them? How often would they be published? From what I understand, they would be published on the website created for this project, but how would the Cardano community be informed when they were released? I agree that it's a complicated proposition to measure quantitatively because of the unpredictable nature of attacks; but I would like to know which qualitative characteristics would be analyzed. Regarding the final results, unfortunately in this part the proponents do not say anything new, nothing that has not been said in the impact itself. It would be interesting for them to think of ways to measure how Cardano and its community would benefit from this project; it is certainly useful, but how can we prove the improvements? So, I think there is a lot to improve here as well, only a principle of auditability is given, but not everything that would be necessary for us to monitor the proposal well.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10973, "q0": "They look like a solid company, and of course cyber threat prevention is at the top of the agenda.  Extra hands in this task never hurt.  However, I believe that IOG, the Cardano Foundation and EMURGO, among other related organizations, have done an excellent job coordinating and executing defense and prevention actions from the basis of Cardano's own technology.  Our record in security and protection measures is outstanding: we are out of the headlines of news related to computer crimes or hacks of information or assets.  Even in the Hard Forks our performance has been satisfactory.  The point is: threat prevention is so important to the sustainability of our ecosystem that it is beyond the reach of the Catalyst community. Catalyst is the beating heart of the Cardano ecosystem's creativity and innovation, yet the line of defense is taken on directly by entities like IOG and the Cardano Foundation, and as I said, they have done an impeccable job.  The proposers describe in their proposal the provision of a service (of course, a specialized service that only a few can offer) but not the request for a budget to develop from scratch a product or service that fits the specific requirements of one of the non-generic challenges of the fund.  \n\nIt makes sense that the proposal was submitted to the Miscellaneous Challenge, because ultimately threat prevention issues are not dealt with directly by Catalyst, they are dealt with directly by IOG and its partners.\n\n\nIn my opinion, at this stage of the ecosystem, this type of proposal does not allow an adequate decision to be made without prior technical consultation with the organizations whose role is precisely to provide protection to the ecosystem.   As the decentralization process advances, there will come a point when a clear way of channeling this type of proposal directly to the ecosystem will be established.    ", "q0r": 3, "q1": "The description of the Roadmap activities and budget items is quite general, but I can give the benefit of the doubt to the tightness of the information due to the very nature of the proposers business, where there is not much to comment, except for specific features of the activities to be developed.  The description of the work team offers even less detailed information on the team members, although the information provided justifying that situation could make sense, however, someone visible in the team is what is usually required in the presentation of proposals applying for funds.  \n\nCoincidentally, proposers seem to take a discrete approach when it comes to submitting proposals for Catalyst funds.  Their proposal of the same name submitted to the F7: Disarm cyber disinformation attacks Challenge bears similarities in the scope of the information provided.\n\nIn short, this may not be the most appropriate event for proposers to offer their service. It is possible that a direct contact with IOG would be more productive for them, given that the specific data on the security conditions of the ecosystem is in the hands of IOG.  That could allow them to design, hand in hand with IOG, a product specific to the needs and current state of Cardano.   ", "q1r": 3, "q2": "There is a total absence of KPIs that would allow adequate measurement of the proposal's performance.  However, given the justification provided, this position is completely understandable.  Which may be indicative of the possibility that perhaps this event is not the vehicle through which proposers should demonstrate their potential, which I have no doubt may be considerable.  ", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10989, "q0": "This idea proposed to solve problem statement (risk of malicious attack on cardano) in two ways: create a custom version of software for threats detection and utilize its own hacker network to monitor dark/deep web. These solutions are together can potentially solve the problem more easily. Moreover, I agree that it makes sense for this proposal to be in miscellaneous challenge since it doesnt seem to fit other ones.\n\nHowever, details on the project could be provided. For instance, they could mention skyros successful businesses cases  or how its software have worked so far to identify these threats. I understand that some information might be confitential but its imporant to understand if proposed solution is going to be effective. It could also mention other attacks that either cardano or other blockchain have been victim of in the past to validate better its value proposition.", "q0r": 4, "q1": "The timeline is is fair and divided into 3 main deliverables. It could contain, however, more information on the necessary tasks/acitivites to deliver these deliverables, including the software development/customization. it would help to understand how complex it is to put the solution in practise.\n\nThere's a sensible budget breakdown, with costs for the hacker network, software and servers, which matches plan the solution presented.\n\nThe team is anonymized, due to security reasons. I understand these reasons for this type of project but it makes it really hard to assess company or team capabilities. The website of skyrosprovided also doesnt have much information on what is the historical of the company, with whom they already have partnered up or what are its success cases.\nTaking all this into account, I'll score it as 3, which I do not agree nor disagree with feasibility of this project.", "q1r": 3, "q2": "I understand it's hard to set targets for this project but some kpis could be provided in the sense of measuring how many threats or types of threats were measured and what was the response time to warn community. Going even further, if warn is successful, they can measure how much these monitoring and warnings have saved to Cardano.\nThey will, however, provide reports which might help to track progress. it could be mentioned, though, what the frequency of this reports is and what type of content is expected to be in it. ", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11012, "q0": "This proposal seeks to create a threat detection software to discover organized attacks against Cardano before they occur. The software will have a proprietary method to scan the dark and deep web to uncover malicious chatter directed against specific targets. This proposal fits this challenge setting because there is no other more preferred setting for this proposal.", "q0r": 5, "q1": "The proposer gives a clear break down of the timeline for the execution of the proposal as well as a good budget breakdown towards the delivery. The proposer also gives a reasonable reason as to why the team which is involved in carrying out the proposal cannot be disclosed. With the time frame stated and the funds the requested, the proposal has a high chance of being implemented successfully.", "q1r": 5, "q2": "The proposal gives great metrics and KPIs that will be used to measure the success of the project. These metrics have been well defined and is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_292", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Partner with Skyros's global network of hackers and employ our threat detection software to discover attacks before they are launched.", "experience": "Skyros Intelligence is a security firm with expertise in ethical hacking and the dark/deep web."}