{"id": 404995, "author": "victorcorcino", "title": "Adatar.me - Growth Acceleration", "url": "https://cardano.ideascale.com/a/dtd/404995-48088", "category": 26441, "amount": 25000, "description": "The Adatar.me team is currently not equipped to grow Adatar adoption, and organic grow is slow.", "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is a continuation of an already funded proposal where the proposers seeks to further expand and improve their Adatar platform. The team have delivered on their previous promises and it should be in the community's interest to keep funding great and successful projects. The first stage of developing the fundamentals of the platform are closing and the proposers seeks to investigate the next stage, adapting a broader crowd to Adatar. This is a great indicator for the projects ambitions and future scope. \nFurthermore, there is no other perfect fit that this proposal should have been submitted in and it aligns well with the Misc. challenge setting. \nIt is difficult to not consider this proposal impactful, the resulting score will be 5 stars.", "q0r": 5, "q1": "As mentioned in the impact section, the team have delivered the fundamentals of their platform from previous funding from Project Catalyst. The Loxe Inc. team is a group of experienced people with a toolbox suited for the proposal, their claims of experience can be further verified through their website and LinkedIn. The budget seems reasonable given the scope. The score in feasibility will be 5-stars, with the main argument being that they have already delivered on their project in previous funds. Nothing indicates that this wouldn't be the case this time around. ", "q1r": 5, "q2": "Thew proposers have provided a plan for how they will measure progress internally and externally to the community. Although there seems like the roadmap will be concretized by the onboarded growth specialist in the future. The details around the auditing process is clear and given the circumstances it is reasonable to provide further details to the milestones when the growth specialist is hired. \nThe KPI's are relevant but it might be hard to distinguish the impact that the growth specialist will provide to the platform vs. the other adoption solutions proposed by the team this round. It might be a point that could be reflected upon, but overall the auditability of the proposal is good and will receive 5 stars. ", "q2r": 5, "assessor": "z_assessor_139", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This is a proposal for the expansion of the adatar.me project. The project needs an experienced growth specialist to work on this project for a limited time and create a plan for the project’s growth.\nThe project itself has the goal to facilitate transfer of assets in the cardano blockchain space by creating a short profile/business card of the user. This virtual business card is like a profile that has a picture and a text for easy recognition. The wallet address is connected to the profile/card and receives all payments.\nThe project is already running but does not have a lot of adoption, hence this proposal exists for attracting capital with which to hire a growth specialist in order to drive adoption. \nI strongly agree that in fund 8 there is no better challenge to host this proposal than the miscellaneous challenge.\n", "q0r": 5, "q1": "The proposal has a plan to higher the specialist for the time between September 2022 and February 2023, so for six months. The action plan is from two points 1. August - Select the specialist. 2. Let the specialist work 6 months. That is a good plan.\nThe budget break down is kind of vague due to the uncertainty of the decisions of the hired specialist,  that I understand. What I don’t understand is why is there a “Project management” expense for $1000 per month for 7 months. This is half of the remuneration of the hired specialist($2K/month for 6months). Of course the voter should decide if this is a reasonable demand. \n", "q1r": 5, "q2": "The proposers suggests external auditing to be done trough the road map (1. Hire spec. 2. Let him work.) A progress report will be presented to monthly meetings with the challenge team and coordinator meeting with IOG team.\nSuccess for this proposal is well defined in numbers. In the end of the project proposers expect 5000 or more Adatars. Which brings us to the $5 per created Adatar? I wonder what will happen if the adatar team just says, $5 giveaway by created Adatar…\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_1417", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal being about a dapp should be under DApps and Integrations rather than Miscellaneous Challenge. The Miscellaneous Challenge being a bit of a catch all Challenge with no clear objectives to be addressed, I have therefore rated 3 for neither agree or disagree.", "q0r": 3, "q1": "The budget requested is sensible although I will point out that the ratio between overheads (spending 1K per month in management, plus 2k per month in salary) for only a $500 marketing budget spent a month is somehow unbalanced unless the plan is to go 100% the social/viral/community path rather than advertising, referrals or partnerships. I will also point out the risk that the plan and roadmap are to be defined by the (future) onboarded specialist and therefore can't be assessed. Finally, the original proposal included a marketing budget and a target of 10K onboarded by a year's time - it would have been good to debrief and explain how the funds were spent and what worked or didn't work. Nonetheless, adatar.me does require more marketing to become successful and this proposal would help achieve the goal of onboarding new users. This is why I rated 3 out of 5.", "q1r": 3, "q2": "The KPIs are the correct ones to track and evaluate success, as the chosen outputs would indicate the number of users and addresses to be expected and within what timeframes. I will however point out that a closely related cardano project has managed to create 65K+ addresses within days of its launch, therefore I will question if 10K can be deemed a success at the end of a year. Should the project not aim at a significantly higher number to be considered successful? I have therefore rated 3 out of 5 as the targets seems on the low side of what should be achievable.", "q2r": 3, "assessor": "z_assessor_314", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "When you check the Adatar.me website, you will soon realize the adoption situation is rather dire there. In the previous Fund 6 proposal, Loxe Inc. stated 10k adatars need to be made around mid 2022 in order for us to call adatar implementation a success. Upon this assessment was being written, total adatars created was sitting on a modest 75 adatars. Certainly not an ideal situation, if you ask me. Fortunately, folks in Loxe Inc. managed to identify the cause of this issue. Swinging by their website, we will find all the operatives are basically engineers. They have no soul to take care the growth/marketing aspect of the product. Since the idea behind Adatar is to eliminate a certain barrier using ADA as payment thus onboarding casual/general audience to Cardano, I think it is only fair to support this proposal further so Adatar can start to hit the numbers and enjoy greater & wider success. We can also think of the hired growth/marketing specialist (already doubling as community manager) then tripling as Cardano evangelist on our greater community payroll. God help us the chosen one will do one hell of a job.", "q0r": 4, "q1": "Kudos to them to manage identify the risk that there is a chance we cannot find a good person fitting the role. Still, I have conviction that someone decent and talented enough in our community will gladly stand up and tackle this challenge. Enlighten me with a better job than actually getting paid and talk good about a Cardano project and all its goodness? Moving onto usual stuffs in this aspect: 1) experience plus expertise of the team, 2) the budget breakdown, and 3) periodical roadmap with the deliverables and concrete action plans. All check. They are written and explained just as good as the rest of the Loxe Inc. proposals.", "q1r": 5, "q2": "Nothing worrying to see in this aspect as well, just good, old Agile methodology to internally manage and monitor the progress of this proposal which is totally fine and acceptable practice in the industry. Our good, old friends in Loxe Inc. will also dutifully report their progression to the Catalyst member in charge like they have been doing remarkably well so far. They are a transparent member of the community with verifiable track of accomplishments and tons of love and dedication for Cardano . One last thing, if somehow we didn’t make the metrics/KPIs assigned in the proposal, which is mostly related to adoption, by expecting how many adatars are created (by unique user/person), maybe it is time for us to start to look at a different side of success. Perhaps measuring utilization rate such as how many payment orders or transactions are executed using or through adatar/adatar.me can give a fresh insight. Or even further, we should start to measure these kind of utilization metrics as well, since imagine if we do hit 10k adatars but not a single soul is actually using it regularly (or even once), oh boy, I guess we are having a completely different problem and a big one on top of that. Just saying.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Onboard a growth specialist to work on this topic for a limited time and create a blueprint for the project’s growth.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans."}