{"id": 405088, "author": "bridgebuilders", "title": "Leadership Academy Operations", "url": "https://cardano.ideascale.com/a/dtd/405088-48088", "category": 26441, "amount": 23900, "description": "Catalyst requires world-class leadership skills to level up our impact, and growing these leaders from inside the community is critical.", "f6_no_assessments": 7, "f6_rating": 3.6190476190476195, "videos": [], "media": [], "f6_assessments": [{"q0": "Leadership is a big and important challenge in building a decentralized system. Every participant should have the opportunity to be a significant part of the community, but this requires certain skills. Nobody is born with these skills, we all learn them, but we do not all have the same opportunities. \n\nThe project picks up at an important point. If we can ensure that everyone can present their projects and ideas well, this will ensure that we have more good ideas from the community.\n\nA better educated community makes for better projects and therefore more value for everyone.\n", "q0r": 5, "q1": "The team has already dealt with various risks that the project entails and always seems to have found solutions so far. The schedule is ambitious, but still realistic. Since the success of the project depends heavily on the community, it can be assumed that the project will progress well, since Cardano has an extremely strong community!\n\nThe salaries seem attractive enough to provide enough motivation to spend time on the project.\n", "q1r": 5, "q2": "Since this is a tool that is developed for the community and we are the customers, it is very easy to monitor the progress. If the team makes progress, we get to see it. \n\nThe KPI and goals are clearly defined and allow a meaningful evaluation of the project. The roadmap helps to put everything in a clear schedule.  \n", "q2r": 5, "assessor": "z_assessor_1147", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal effectively addresses the challenge and brings with it the potential of creating leaders in the community.\nThere are programs to onboard new members but as far as I know there are very few leadership building programs in the catalyst ecosystem.\nThe idea of co-creating content with the voluntary leaders seems like a valuable idea because pain points can be addressed in a timely manner and immediate action can be taken by the community.\nThis also leads to the possibility of various collaborations in project catalyst and outside of it.\nSince the course repository will be maintained on an ongoing basis, in time it will build up to be an extremely valuable resource for proposers and collaborators alike. \n\n", "q0r": 4, "q1": "The Bridge Builders and The Leadership Academy are well known organizations in the catalyst community.\nThis along with the road map, makes me believe the proposal is highly feasible.\nAfter going through The Leadership Academy's website, I believe content created will be maintained well and will be easily accessible.\n", "q1r": 5, "q2": "The proposal is thoroughly auditable.\nThe KPIs mentioned in the audit ability section gives a clear picture of number of users, number of content creation volunteers, the different subjects covered and their relevance.\nI know I keep banding on about this but a feedback process is something I always look for in the auditability section. This usually helps better the quality of the content in future cycles.\n", "q2r": 5, "assessor": "z_assessor_1330", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is a fantastic idea for a proposal. Cardano has already proven itself with it's amazing leadership and community. This proposal makes me think about the future of Cardano and how passed down education will help the protocol to stay alive. They address the challenge that there can always be more leadership in the community. By proposing various trainings and videos that will help productive innovation to take place. Good leadership will help build a strong community just as they talked about how social economics is a strong part of the ecosystem.", "q0r": 4, "q1": "I agree with this form of a team. I like that they are focused on using members of the Cardano community to take part in the leadership academy. This will help with the idea of decentralization and offer lots of different thoughts and opinions to help the community stretch and expand with idea and innovation. I find this proposal to be very productive and will distribute experience in the ecosystem to those that are willing to take part in such a great opportunity.", "q1r": 4, "q2": "I like that this proposal is starting off from the beginning. They give a monthly timeframe which includes the process of identifying the instructors and then shifting the focus to the material that they are going to cover. I think that it would be a good idea to make sure that the zoom meetings will be uploaded to Youtube for those that want to learn more about leadership in the Cardano Community. There is a precise explanation on where the funds provided will go and how that will achieve them to carry out this proposal. Essentially the fund will go to the instructors that will help build the leadership in Cardano so that there will be an even stronger future and more people that are educated in blockchain and leadership activity.", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The issue reported here is \"Catalyst requires world-class leadership skills to level up our impact, and growing these leaders from inside the community is critical\". The solution here has not been clearly described. However, the proposal indicates that the project will be effective to solve the problem. The target audience here are leaders, teachers, visionaries, and facilitators. And what benefits these people will have when The Leadership Academy is put into practice is also provided . Additionally, two main risks of the project are also mentioned. At the same time, the author also gave resolutions for each risk. ", "q0r": 4, "q1": "The issue reported here is \"Catalyst requires world-class leadership skills to level up our impact, and growing these leaders from inside the community is critical\". The solution here has not been clearly described. However, the proposal indicates that the project will be effective to solve the problem. The target audience here are leaders, teachers, visionaries, and facilitators. And what benefits these people will have when The Leadership Academy is put into practice is also provided . Additionally, two main risks of the project are also mentioned. At the same time, the author also gave resolutions for each risk. ", "q1r": 2, "q2": "The issue reported here is \"Catalyst requires world-class leadership skills to level up our impact, and growing these leaders from inside the community is critical\". The solution here has not been clearly described. However, the proposal indicates that the project will be effective to solve the problem. The target audience here are leaders, teachers, visionaries, and facilitators. And what benefits these people will have when The Leadership Academy is put into practice is also provided . Additionally, two main risks of the project are also mentioned. At the same time, the author also gave resolutions for each risk. ", "q2r": 2, "assessor": "z_assessor_1717", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "Addresses the challenge of providing leadership guidance to the community which includes planning, business model generation and business contracts. The present need for this may be low as the catalyst community has innovators who have some access to this information or have previous experience. However as the community grows a reliable opensource database needs to be developed. Also the project plans to offers tailor made content as per the requirement of the community members, which may be very helpful while dealing with region/domain specific problems. The present risk of community not needing the content for immediate use has been pointed out correctly", "q0r": 4, "q1": "No details of the bridge builders assembly who will be acting coordinators for the project. In fund7 proposal 'Catalyst School' was mentioned as the collaborator or parent group of \"Leadership academy\" which hasn't been named in the current proposal. 24(2hr each) courses+live instructions/documentation+(8hr prep) in 3months via zoom meetings asking for a budget of 14400 is a little too high, especially when you are not sure if the community needs the content, same view in case of management fund requirement of 7500 for 3 months.", "q1r": 3, "q2": "No number specified to audit the course, one can infer 24 courses in 90 days but no specific timeline as to how many courses will be delivered every week or month. No mention of how much each specific session will cost, to monitor the spending. All the other parameters do not have a specific number, however the parameters considered are appropriate. ", "q2r": 3, "assessor": "z_assessor_1748", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The Leadership Academy Operations fits well for the Miscellaneous challenge although its aim for teaching leadership skill is questionable provided that blockchain ecosystem focus on decentralization. By making catalyst leadership academy, it might alienate community members as they will be inclined to identify who is the leader and who is not. It might be a hindrance rather than catapult cardano towards wide adoption. The proposal identifies the possible risk and way for mitigation look plausible. ", "q0r": 3, "q1": "The time period the team prepared for the leadership curriculum is 3 month. They haven't defined what is their definition of \"offerings\" ie. course examples? Which kind of subjects will be taught in their leadership academy.  The proposal will improve significantly if they are clearer in saying what the offererings are. Also the team behind \"Bridge Builders\" and \"Leadership Academy\" are not shown nor is the link provided which make this proposal a mystery project.", "q1r": 3, "q2": "The project offers the KPIs but no milestones in figures. The proposal has not identified the core component of academy which is the \"content\". To audit the proposal, there should be a benchmark figure to say that this project is a success. The Leadership Academy Operations seems to be in a brainstorm phase with no clear possible curriculum and concrete path to follow. To establish leadership academy, they will need to define what the leadership means to the community. There is no clear guidance on how this project can be scaled to achieve the desired impacts to its community.", "q2r": 2, "assessor": "z_assessor_653", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The problem described here is clear and it’s fits into the challenge since there are no specific challenge setting. The idea of catalyst leadership academy from the proposer’s approach, is to have community members teach and learn skills, but to me the skills to be taught and learnt here appear to be vague. I find it difficult to best understand where the proposal is headed to, hence I am not fully certain of the proposal’s impact.", "q0r": 4, "q1": "There are no clear team members here, the proposer has indicated they are called the leadership academy team that will align with bridge builders, however there is no link reference or any other preference provided to ascertain the existence of the team members of the academy and what sought of collaboration they have with bridge builders assembly. The amount for tool and technology look so vague, there could be some kind of enlightenment on that in future proposals. However, the plan and timeline stated are detailed. Risks and their mitigation measures have been indicated. ", "q1r": 2, "q2": "The roadmap, milestones and time horizon are detailed.\nThe metrics/KPIs provided here are good indicators for success evaluation as they measure the number of courses offered, number of students taking courses amongst others. However I advise that in future proposals, that specific metrics be stated as in number so that there can be an easier auditability of the proposal. The targeted problem is clear and the solution as well however, I am not certain about the approach", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The Catalyst Leadership Academy is where community members can teach and learn leadership skills. Offer high-quality and relevant courses.", "experience": "We are experts in Business, Project, Community Management. We are veteran full-time community members, serially funded proposers, Community Advisors, Catalyst Circle, and Admin Team members. We have deep knowledge and experience with Project Catalyst and are passionate mentors."}