{"id": 405064, "author": "victorcorcino", "title": "Loxe Inc. Web Dev Internship", "url": "https://cardano.ideascale.com/a/dtd/405064-48088", "category": 26441, "amount": 9000, "description": "There are almost no internship programs for university students to get involved with Cardano while working with Web Development.", "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 853, "q0": "I agree with the proposer that a paid internship program is a low risk / high reward opportunity that builds value in the cardano ecosystem, and fills the void in a space that is currently limited in meaningful experiences for young, energetic tech/crypto enthusiasts.  If this project is successful, I would even hope to see follow-on proposals to later funds aimed at expanding this.", "q0r": 5, "q1": "The team, timeline and budget presented for this project represent a reasonably simple and qualified approach to implementing this project.  And since the proposal complexity is very low, I have very few doubts that a funded project would lead to a successful implementation in full.", "q1r": 5, "q2": "While I believe that the auditability of this project is high, the deliverables for success (overall impact, not just student numbers) are very subjective.  And since I would hope this project has a potential to expand on its successes, I also hope that considerable effort will be placed on the quality of these internships, which might produce testimonials for use in expanding this initiative in the case there are any follow-on rounds.", "q2r": 4, "assessor": "z_assessor_1224", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1535, "q0": "The proposal addresses an interesting topic about onboarding future developers early in their career. Students are the next generation of builders, it is a brilliant idea to introduce them to the Cardano ecosystem as early as possible. The proposal is doing this in the form of paid internships which is a good idea since it will incentivize the students to take on this challenge without feeling used. Some companies have brough negative associations to internships where they have used students as free labor for short term gains. \nIt is indicated in the proposal that the internship is remote and candidates all over the world will be considered which is a plus since it is more inclusive by definition. It is hard to find an argument against the impact of this proposal, therefore it is given a rating of 5-stars in this section.\n", "q0r": 5, "q1": "I have a few questions that might be interesting to reflect around.\nHow and where will you market the idea to reach out to as many suitable candidates as possible and make it more inclusive? If you would fail to find great candidates, will you extend your search or will you take the most suited students that are available?\nAll in all, the team behind the proposal is well known within the community and they are credible. I have no doubt at all that they have the expertise and knowledge succeed with their internships if the proposal were to be funded. \nScore given: 5-stars.\n", "q1r": 5, "q2": "The team have a plan for external auditing and provides relevant and easy to measure KPI's. An suggestion could be to aim for at least 10-20% (the more the better) of all candidates being female. This might complicate the simplicity of the proposal but reaching out to the female audience is always something we should strive for within the community and it’s a great starting point.\nScore given: 5-stars.\n", "q2r": 5, "assessor": "z_assessor_139", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5008, "q0": "This proposal successfully covers a challenge that is not addressed in any other category. The idea of the proposal to offer internships in blockchain to capture the young, up-and-coming generation is brilliant. I would be interested to see if the college would be interested in offering a degree in blockchain technology. ", "q0r": 5, "q1": "The team is very experienced in the areas of engineering and cardano. The variable here would be the success of the interns, which is very hard to control. It would be interesting to hear how the vetting process would take place for the interns. ", "q1r": 4, "q2": "The proposal states that monthly meetings will be held in which milestones will be discussed. This appears to be the best way to track success for this proposal. I might also suggest having the interns take a short quiz before they begin working with you and after to compare the knowledge they gained.", "q2r": 5, "assessor": "z_assessor_1819", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 10558, "q0": "The other challenge this proposal could be considered for is \"Developer Ecosystem\", as one of the guiding questions there is \"How to attract developers from outside the community\". However, I understand proposals for that challenge should be directed towards improving the developer ecosystem (so maybe they are attracted), not just hiring developers. Therefore, I agree alignment is good for the miscellaneous challenge.", "q0r": 5, "q1": "I agree with the proposers that the biggest risk is that the internship is cut short by the intern resigning, which is quite common in tech jobs (as candidates often find better opportunities as soon as they are in contact with the job market). The team expertise, however, must make this internship quite attractive for aspiring interns. ", "q1r": 5, "q2": "The auditability section for the proposal describes how the teams plans to offer information on projects developed by the interns, not on the internships. I'd say the goal in this case should not be so much project deliverables, but interns perceptions and engagement with the Cardano ecosystem. I'd suggest the team considers an exit survey, or even report on the interns next proffessional moves a few months after the internship ends. ", "q2r": 3, "assessor": "z_assessor_941", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Give new web developers real world development experience and mentorship while introducing them to Cardano.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus developers, participants of Gimbalabs PPBL, and experienced web developers"}