{"id": 405139, "author": "victorcorcino", "title": "Insight Sharing Workshops - TCS", "url": "https://cardano.ideascale.com/a/dtd/405139-48088", "category": 26441, "amount": 4050, "description": "The Catalyst members struggle to take full advantage of the Insight Sharing stage to improve their awareness about challenges.", "f6_no_assessments": 7, "f6_rating": 4.523809523809524, "videos": [], "media": [], "f6_assessments": [{"id": 187, "q0": "The challenge brief of the \"Miscellaneous challenge\" is fairly vague to begin with and for a reason - \"... the proposal needs to be somehow related to Cardano\". Therefore in principle any proposal could be in this challenge that is does not fit into other challenges. This Catalyst School proposal is aimed to improve the clarity in the Catalyst process for Proposers, Community Advisors and Voters and therefore does not align precisely with the other best matches (does not fit in \"New Members Onboarding\" as this covers existing members as well, does not fit in \"Community Advisor Improvements\" as also addresses Proposers and does not fit in \"Scale-UP Community HUBs\" as is not targeted to end user of Cardano in general, but rather those who build and work to expand the capabilities of Cardano in particular). The proposer discloses this in their proposal as well", "q0r": 5, "q1": "The presented team of 10 people is composed of capable Community Advisors who have ran similar workshops in the past which gives credibility that they can continue doing what they have been doing. This proposal is a continuation of a similar proposal from Fund7 which has funded these workshops to date. I have some reservations on the number of people (10) put forwards when there is total of 6 workshops to be given, seems a little too many people for the job. I would expect that at full capacity the workshop can be delivered by 2 people, 1 leading and the other taking minutes and other secretariat support. Also the budgeted time for each of the workshops is a little excessive at 13.5 hours man hours spent for a 1.5 hours workshop particularly. This, however, doesn't take away from the ability to deliver on the proposal to host 6 workshops although the long roaster of people and the lack of definition of who will do what suggests a little over reliance of being able to find hosts along the way - as the propose states in the risk \"...The main challenge of this proposal is finding hosts in time\". For this reason I give 4 in this assessment\n\nThe stated target audience size is 20 per workshop and 100 youtube views. Looking through the last 3 videos on youtube from Catalyst School, they attracted 141, 174 and 342 views and were recorded this 15th and 11th Mar and last 6th Dec, so the youtube view target is reasonable. The same videos had 6,7 and 4 participants so a little shorter than the 20 expected. This is obviously based on a small sample size", "q1r": 4, "q2": "There is a promise to deliver 1) 6 workshops with; 2) 1.5h in length each and ;3) Slides and; 4) youtube recordings. The target participants is 20 per workshop and 100 youtube video views. This is an objective deliverable that is straight forward to verify and see where there were deviations", "q2r": 5, "assessor": "z_assessor_1076", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 2064, "q0": "I find this proposal to really help the Cardano community. This is because there are currently so many members of the community that have never heard about the opportunities that they have to become a potential Proposer or CA. I think that this proposal gives a good outlook on where the problem lies, and gives a specific detailed explanation on how these requested funds in this proposal will help them to educate the community more. I would love to learn more about different skills we can learn as proposers and CA's to be more effective and efficient. ", "q0r": 4, "q1": "I enjoyed reading through the different people that will be participating in the education system with this proposal. I know that these workshops would help me to gain a greater understanding on the different roles in the funding process, and how we can make sure these valuable funds will be distributed to the best proposals. The skills of the team seem to be sufficient for going through the different workshops and teaching the community.", "q1r": 4, "q2": "There was a lot of good information within the proposal. I think that releasing the videos of these workshops on Youtube will be very valuable because they will always be there for other people interested in the programs to see. I know that when becoming a CA, I wanted to see more videos on how to be an effective CA. This would also be great for proposers that aren't as familiar with the funding mechanics. I like seeing more proposals encouraging greater activity in the funding process. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3048, "q0": "The challenge described is not aligned to the other challenges (Community Events not on Fund 8) so it is a fit for the F8: Miscellaneous Challenge.  The problem is clearly defined and the solution of challenge-specific workshops to address the problem is proposed.\nThe challenge-specific workshops will assist three groups. The proposers, CAs and vCAs, and the voters. The proposer clearly outlines how these groups will benefit from this initiative. \nIf proposers better understand the challenge score and key elements better, then the CAs will get better quality proposals in future rounds. If the CAs can learn from those with domain-specific knowledge then they can provide assessments of a higher quality. This will result in less assessments being filtered out. When voters learn from domain experts then they are in a better position to make in informed vote. \nThe above points show that the overall community will benefit from the launch of this proposal.", "q0r": 5, "q1": "The budget and the timeline is straightforward and clear. The requested amount is very modest and is sufficient to carry out the proposal. \nThere are a lot of team members with some that are very experienced. Although no links were provided for the team members, you can find more than half of them on YouTube or a simple internet search. The Catalyst School has produced 26 videos for far covering topics such as \n“How to be a Community Advisor”( https://www.youtube.com/watch?v=29tQTPlDFVQ), \n“Proposing in Catalyst”( https://www.youtube.com/watch?v=46yfQEIsEJA), \n“[Fund 8] - Accelerate Decentralized Identity”(https://www.youtube.com/watch?v=f7L0tLJYEvo) \nand more.\nGiven the sensible plan and budget for the proposal described and the team members with a good track record, I believe that this proposal will be successfully implemented. ", "q1r": 5, "q2": "The proposer highlighted that since the Fund 9 Challenges will only be known after the Fund 8 results have been tallied, this will pose a risk of finding hosts in time. They aim to plan in advance to counter this risk. \nThe definition of success for this proposal is clear and measurable. The progress of this proposal can be easily tracked by checking the uploaded videos and slides on Youtube and Google Docs as just like they have done for their other videos. ", "q2r": 5, "assessor": "z_assessor_1602", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3495, "q0": "The proposal aims to increase the chances for Catalyst members to take advantage of the Insight Sharing stage. Insight Sharing stage is one of the workshops in the series off workshop to provide more knowledge for Catalyst members in both general and specific topics. The proposer mentioned in detailed what will be the expected information from the workshop and who will be benefit from that. Just one additional point is whether one or several successful case-studies will let all audiences be more convinced with the projects. \nThe proposed solutions was come up with clear expectation on the good results which including number of participants off-site and views on YouTube. With the hope of successful for this project, the next fund could be utilized next with initiatives of the proposer to come up with new proposal. \nRisk was considered by the proposer shortly. To make it be convinced, it is better to add more information about how to deal with it if happens. \nThe project is proposed under series of project, where people can see the overall goal will be strengthen the Catalyst and make Cardano ecosystem stronger. It was somehow mentioned by the proposer by their attachment of related project already. \n", "q0r": 4, "q1": "To conduct this workshop, the proposer has shown their careful preparation by putting such a detail information about the personnel. These trainers have both facilitation skills, teaching skills and practical experiences. With the topics needed to be done, these personnel are capable to conduct it smoothly, as well as their profile and experiences will attract more audiences in watching them on Youtube.\nAs the project is not so big, the proposer was able to prepare the budget breakdown in such a detailed plan. And mostly the expense will be paid for the human resource fee. Comparing with workshop style, the payment is appropriate and align with the schedule. \nRoadmap was described by the proposer about the whole timing for the series of workshop. Tentative timing could be added more so audiences can understand about proposer’s intention. \n", "q1r": 4, "q2": "To conduct this workshop, the proposer has shown their careful preparation by putting such a detail information about the personnel. These trainers have both facilitation skills, teaching skills and practical experiences. With the topics needed to be done, these personnel are capable to conduct it smoothly, as well as their profile and experiences will attract more audiences in watching them on Youtube.\nAs the project is not so big, the proposer was able to prepare the budget breakdown in such a detailed plan. And mostly the expense will be paid for the human resource fee. Comparing with workshop style, the payment is appropriate and align with the schedule. \nRoadmap was described by the proposer about the whole timing for the series of workshop. Tentative timing could be added more so audiences can understand about proposer’s intention. \n", "q2r": 4, "assessor": "z_assessor_1655", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3734, "q0": "Seminars and workshops provide a chance to interact with experts from the specific field. Discussing about the relevant topics of the particular subject, students tend to learn about the latest information and new skills related to the concerned subject and the workshop's purpose is to provide training to participants by presenting presenters who are experts in their fields.\nThe proposer has proposed a very good idea of conducting such workshops for development of domain-specific skills related to the challenges. This will help a lot of CA's and VCA's proposers and voters by listening to the more experienced people talking in the workshop and will also give an exposure to the field. The proposer has identified a problem which needs to be solved or rather implemented for the betterment of the platform and by doing so it will give a clear and better idea challenge specific workshops to all the participants CA's and VCA's in cardano system. The goals of the proposal is aligned with the problem statement.", "q0r": 4, "q1": "The proposer has already participated in fund raiser 6 and 7. They are participating in fund raiser 8 to  expand their work including a new type of workshop for the \"Insight Sharing\" stage. The proposer has a clear idea on implementation of the proposal and also has provided relevant links of skills and experience needed to implement the proposal. The proposer has a team of experienced members to conduct the workshop and the budget is outlined clearly and broken down into specific items. They also have a clear idea on how to implement this proposal which will be successful since they are already prepared. The proposal also describes the necessary resources needed for the proposal and they have considered the challenges and are also prepared with alternative solutions which clearly shows that the experience and the presented plan is highly likely to implement the proposal successfully.", "q1r": 5, "q2": "The proposer has laid out a roadmap and is already in the midway of achieving the proposal as they are in this from fund raiser 6. The proposer has requested funds of 4050  USD required to complete the proposal which seems fair as they have also provided the break up cost. The proposer is doing a very good job of educating and providing knowledge to others through workshops and the given information is sufficient to audit the progress and by the experience and the expertise of the proposer and their team and how they have laid out the plan the proposal is most likely to succeed and conducting such workshops will be an advantage for Cardano and its participants to gain more knowledge from the experienced and knowledgeable people. The proposer has clear understanding of the targeted problem and also have provided a clear solution to the problem and this proposal is most likely to succeed.", "q2r": 5, "assessor": "z_assessor_1668", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4610, "q0": "Since there are many internships provided in cardano's project  , no team wants to concentrate on challenging scenarios, so this proposal has been creating internship since Fund 4 and wants to main continuity with connected audience, where there continuity in internship shouldn't be stopped.\nThe proposal has great idea of getting connected with audience in both medium of online and offline  , where people from different places can get connected via YouTube, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer's team has been conducting workshops successfully since Fund 4 where they even have plan to conduct internship for Fund 9 projects , hence with such experienced team and minimal of risk the proposal has very high chances of getting successful.\nThe workshops also helps in teaching students how to tackle during difficult times , which helps in gaining interest towards workshop, hence with given experience and plan presented it is highly likely this proposal will be implemented.", "q1r": 5, "q2": "The proposal contains all the team members working on this project , by which there will be no loss of time recruiting members for the project , the proposal also has mentioned how the hours of workshops will be divided, to make the model more effective manner.\nThe proposal even contains all the team's experience in providing workshop where they are conducting successful internships since fund 4 and maintaining the continuity to keep their audience connected, hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8715, "q0": "The proposer intends to host challenge-specific workshops with domain experts and in collaboration with challenge team during the insight sharing stage. \nThe proposer has stated that this proposal does not fit any of the specific challenges, hence they have placed it to fit this miscellaneous challenge which I agree. \nThe proposed workshops will be challenge-specific and they will include the participation (presenters) of domain experts and challenge team members. The main goal, according to the proposer, is to encourage the development of domain-specific skills related to the challenges for all the various roles in catalyst. Proposers could better understand the challenge scope and the key elements required to successfully propose; CAs and vCAs can learn how to apply the assessments criteria to the specific challenges and share their own domain-specific knowledge to others; voters and new community members can improve and share their domain-specific knowledge. \nThis idea and project is very laudable because some of the challenges are very difficult to understand, let alone assess. So this is a project that will have positive impact on proposers and community advisors to do proper and excellent assessments. Kudos to the proposers. \nThe main challenge/risk is finding hosts in time, but the stated solution is that they will plan more in advance for Fund 9. \nThis proposal has addressed the challenge effectively. \n ", "q0r": 5, "q1": "The plan is well outlined showing scheduled activities in weeks and hours. \nWeek 1 is for Fund8 insight sharing phase , where 1.5 hours will be devoted to each challenge and the challenges will be selected when the available list for Fund 9 comes out.\nThe budget breakdown is comprehensive showing hourly rate, total per workshop amount, and total budget of USD4050 is very reasonable.\nThe team is made up of 10 people of different skills such as industrial software engineers, Plutus Pioneers, vCA, CA, Educators and Mentors, Digital education researcher, etc. \nIn my opinion, the information provided will make implementation of this proposal successful. My rating is 4.", "q1r": 4, "q2": "The recordings of all workshops will be  available on YouTube channel. \nThe success of this project will be when capable hosts are found and large audience at each workshop. \nThe project aims at 20 participants in each workshop; at least 100 views per workshop on YouTube channel. \nThis is a new proposal. SDG rating is given.\nThe information provided is sufficient for successful auditing. \n", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Host challenge-specific workshops with domain experts and in collaboration with Challenge Team during the Insight Sharing stage.", "experience": "Veteran advisors and proposal mentors, education professionals, very active Catalyst community members since early Funds, already Catalyst School funded team, Catalyst Circle ex-members and more."}