{"id": 405297, "author": "harry.hellyer", "title": "Hub Support Services for Proposers", "url": "https://cardano.ideascale.com/a/dtd/405297-48088", "category": 26441, "amount": 19400, "description": "There is limited business demand to support the growth of successful support services enterprises in developing nations", "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 4612, "q0": "The proposer's  main goal is to improve the life style of local people by making them self reliable , the proposal mainly concentrates on providing minor jobs of support services , which can help the organization to gain the revenue, By such proposal people can also become self sufficient where many people lost their job due to global pandemic, where they can provide professional service products both to local national and international markets in the future hence This proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposal doesn't contain much of a risk as setting up support services is not a difficult task , the proposal even wants to educate by connecting Cardano and Catalysts to their local stakeholders and By initially working within the professional services sector, this will help to boost the interest towards cardano.\nsince this is continuation of funded MVP for the F7 Accelerators and Mentors challenge, in Impact Innovation Accelerator project. the team has good continuity towards the project hence with Given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposal has clearly explained the importance in bringing community together and making them as working class people , it not only raises the standards of the community but also improves the economical growth of country.\nThe proposer even wants community hub to gain experience so that they can work at global market, service provider jobs can also help in women empowerment , where women can easily work in these sector, the proposer even wants to introduce cardano catalyst hub so that this will boost the hub in investing towards cardano's future projects. With information provided is sufficient to audit the progress and the success of the proposal.\nThe proposer has displayed their previous work and has introduced there team ,where this is the continuation of their fund 7 project , with neat budget breaking and timeline phases provided", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6970, "q0": "The extent and detailed planning of this proposal is really impressive. It delivers a very good solution to problems of proposers to deliver a high ROI, thus making it of great potential value to the Cardano Ecosystem and towards the scalability of Project catalyst. I am really curious to see how this develops.", "q0r": 5, "q1": "A detailed, implementable roadmap is supplemented by a credible, fine-grained budget that is backed by a obviously competent team. Every aspect, including risks and solutions to them are discussed in detail. From my perspective as a project engineer In can right away see that this is a well-planned proposal and I am not doubting it will be a success.", "q1r": 5, "q2": "The problem and solution description are sufficiently clear and there already is a decent roadmaps. However the proposal is a bit short on additional milestones and KPIs. Yet, an overall good auditability can be seen.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 9035, "q0": "The problem statement is clear.What I was missing at first was how a hub will be able to support proposers, but it’s interesting to note that the proposer intends to turn the hubs into Social impact organization delivering channeled, local resources targeted to support catalyst in running and proposing challenge proposals, this is a project I believe if funded has the potential of bring so much innovation to the catalyst process.", "q0r": 4, "q1": "I am very sure that the team is the right team for executing this project taking into consideration their relevant experience and qualifications. The budget is very well described and broken down and considering the nature of the project I believe the $ 19,400 is reasonable to achieve the desired outcome. The plan provided is very comprehensive with a detailed, clear and definite timetable for execution.\nChallenges or risks have been factored in with their mitigation measures and that for me is a good effort. I believe this project is feasible.", "q1r": 5, "q2": "The roadmap, milestones and time horizon are very detailed making auditability easy.\nPublication of the white paper and blue print is what success looks for this project, the metric/KPIs stated are well chosen as they are good indicators of achieving the success.\nThere is no vagueness in the targeted problem and the solution proposed, so therefore I am optimistic that the solution can effectively address the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9827, "q0": "The projects would have a great added value to the Cardano ecosystem and aligns with the Cardano vision to make technology available for all regardless of their background. Furthermore, such program can indeed bring many new Devs and SPOs to the ecosystem. Such program has the potential to scale into multiple communities especially where internet connection is available.", "q0r": 5, "q1": "The project is a continuation of an already funded project and the team is very active and adds lots of value to the ecosystem. Furthermore, a details timeframe and a very clear budget is provided. ", "q1r": 5, "q2": "The projects presents many milestones that can be monitored by the community and a clear roadmap including all aspirations and specific needs and wants from this program. The delivery date is stated clearly. I wish them good luck!", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Leverage the untapped contributor potential in developing nations via Comm Hubs to match and meet the needs of Catalyst proposers and beyond", "experience": "As Impact focused experts we run high growth coaching & mentoring programmes from tech startups, thru to Global businesses & Universities. \n \nThis is a continuation of our funded MVP for the F7 Accelerators and Mentors challenge, in our Impact Innovation Accelerator project. "}