{"id": 405410, "author": "tanakafj", "title": "Cardano PR Initiative Japan", "url": "https://cardano.ideascale.com/a/dtd/405410-48088", "category": 26441, "amount": 36000, "description": "Participants in Japan will benefit from a program to communicate the current situation and engage with opinion leaders in media & industry. ", "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Japan is a pool of opportunities for blockchains and all its features. With an estimated 10.9 networked devices per capita, according to a study by Cisco, and being the highest spending in mobile apps per capita country in the world, according to Sensor Tower, Japan is home to a tech/innovation hungry society.\nAlthough the problem statement doesn't clearly introduces the real problem, it is explained at the end of the Impact section. Waiting for people to get to know Cardano and the progresses it has been making is not a very efficient strategy on growing the chain. Also, it opens doors to other chains like Ethereum to attract business and users that could instead be joining Cardano ecosystem.\nJapan being so tech centered, is a key territory to focus on expansion efforts. It has the potential to develop solutions that will become wolrdwide, and that should be done inside Cardano. For so, actively publicizing about Cardano there could make a huge impact.", "q0r": 5, "q1": "The team seems to have a great experience with press and media in general, with several contacts in the industry. On the other hand, the only member with blockchain experience is Andrew Tamura and not too much is said about it. It would be good to have more explanation on his work and to have some reference or link about all four members.\nThe 36k budget would make more sense if you included some reach expectation so we could better measure potential impact. Judging by the team's reported experience, this initiative could reach thousands of people, but how any thousand?\nThe plan is well divided into tasks and the timetable seems feasible. A little more detail on each task would also help analyse this initiative proportion, such as which documents will be reviewed, and which media interviews are going to take place.", "q1r": 4, "q2": "The tasks are well divided so the community may be able to keep track of them. However, there will be lots of things happening between April and June, are all tasks going to be executed throughout this entire period? Even if so, you could try to set smaller milestones, each with shorter goals for a better auditability.\n'Media Outreach' and 'Media Meetings and Interviews' are good KPIs to measure the success of this proposal. As mentioned before, you could add a KPI regarding the reach of those publications, for it is the key point of all this.", "q2r": 4, "assessor": "z_assessor_951", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "I believe at this particular time, it is just as important as ever to communicate good/correct information relating to Cardano's core features, roadmap, and overall potential in an increasingly busy blockchain environment.  Japan is a progressive environment for cryptocurrency regulation, but mass market consumers also require localized content.  Leveraging a team who is experienced with production and distribution of Japanese content could be a good way to build a more engaged community within Japan.  Based on my knowledge of PR, the proposed solution to the challenges described in this proposal are logical and experienced.  The structure of the proposal is well organized, and the proposer also presents thoughtful case studies to compliment it.   I do agree with the basis for this proposal, but did not strongly agree because in theory I'm slightly hesitant to acknowledge that an initiative like this should be needed.  But in practice, I can appreciate it's merits.", "q0r": 4, "q1": "Based on the teams experience, case studies presented, timeline, and budget prepared for this project, I think it is highly likely that the team understands and aligns on the scope of what is needed to deliver a successful project.  The team has the right experience in communications, PR, influencer engagement, and more.  The case studies presented also indicate that the subject matter has been well researched and provides a foundation to build on in the delivery of this project.   I agreed, but did not strongly agree, since PR and media tend to be a bit \"hit or miss.\"  Success in this field depends partly on knowledge and experience, and partly on luck and timing - meaning I believe the while the intentions are good, the results have a limitation on their guarantee to provide highly measurable results.", "q1r": 4, "q2": "Subjectivity aside, I think the team has done a decent job of defining the relevant KPIs for this project, defining the terms for project governance, and describing both the tangible and intangible visions for success.  Project reports and activity look-aheads for this kind of activity can offer a good pulse of how the project is developing, and the case studies presented indicate that the team understand the communication of reach and engagement from their initiatives.", "q2r": 4, "assessor": "z_assessor_1224", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposer's impact statement presents a thorough and well-considered approach to the challenge of counteracting FUD and inaccurate perceptions within a particular market. Cardano had initially taken off quite well in Japan, which makes some of the problems identified by the proposers concerning. In particular, the creation of success story profiles strikes me as a strategy that can help bolster Cardano's image at this phase of the project. The team appears to the international bonafides, background in PR, and necessary command of both Japanese and English. \n\nWhile I believe this project has a lot of potential, I unfortunately cannot say that it meets the parameters of the Miscellaneous Challenge category. Fund 8 has a \"Grow East Asia, Grow Cardano\" challenge, which would be more or less a perfect fit for this kind of PR campaign.  ", "q0r": 2, "q1": "The proposal's team has an impressive amount of aggregate experience in public relations and corporate communications, with past employers including Japanese companies like Nissan, ANA, and Kodansha. The five roles selected for the project appear to be well-considered, which individuals taking ownership of account coordination, media outreach,  and social media strategy. It's important, I believe, for PR-based projects to make a good impression with their proposals, as this involves the same skills that will be employed in the campaign itself. The timetable for delivery looks reasonable given that the project involves the auditing of existing materials", "q1r": 5, "q2": "As a public relations campaign, the end results of successful implementation should be fairly easy to gauge. The team plans to provide monthly progress reports culminating in a report on the project's overall results after three months. The proposal cites the sensitivity of the Japanese market; I think the proposal could benefit from a quick dive into what navigating these sensitivities might look like to someone auditing the project who may not be as familiar with the Japanese market. I'd also like to see clarification as to whether the monthly updates will include new press kits. ", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The project's proposal was prepared very well in terms of sufficient explanation about the issues that the project is going to tackle. The proposer select one of challenging issue to change the minds of opinion leaders in the media and industry about the advancement and prominence of Cardano ecosystem.  The intentions of solving problem is described clearly by the proposer not only by the actions within the project, but also checking how it contributes to ADA holders and expansion of Cardano’s market position. The main activities. The project is just a start point of a long procedure to change awareness of people, by the way, for the initial stage, it is clear and sufficient information. It will be very clear if the proposer can add several successful case-stories to convince people easily. \nIn the proposal, there were two kinds of KPIs and key metrics mentioned by the proposer. Expectations were clarified and itemized in detailed regarding to different stakeholders, which is not only the leaders but also people. Although the itemized indicators will help all readers understand easier, it will be clear and measurable if quantitative indicators are added. \nRisk was considered by the proposer with brief explanation about how to solve it. With these prediction and some ideas of solution, the proposer can make the promise to readers to implement the project in such a smooth and comfortable manner for all stakeholders. \nThe good points of this proposal is the overall picture about how the project can contribute to the Cardano Ecosystem was thought, planned and considered on how to achieve it even in the short period of project. \n\n", "q0r": 4, "q1": "Staffing of this project consist of members from various sectors, which showed the strong experiences and knowledgeable to help the project achieve easily. Profiles of each person was mentioned clearly, and their task allocations are appropriate with the targets of the project. It will be confident to say that, the team components will decide more than 70% of project’s success.\nAs the timeline of this proposal focuses mostly in the first 3 months, then the team will decide the next step. The good point of this roadmap is the key activities of each timing were clarified already. In the other ways, it is suggested to add more information on how the proposer visualize this timeline in practice. It will make all readers feel easy to understand and evaluate its practical level. In addition, several tentative timing in midterm and long-term can be considered to add more, to be aligned with the proposed solutions. \nBudget breakdown in the proposal only focus on the payment regarding to human resource utilization. However, it will not be sufficient to understand how the project is going on with just human resource as indirect payment. The proposer can add more intentions of budget using besides it. \n", "q1r": 3, "q2": "The KPIs and key metrics were mentioned only in qualitative explanation. Compared with the roadmap, the indicators might be solved by them. However, without the clear target in number, it might be the hindering factors for achievements. The proposer can add more expected data on it. \nThe end pictures of this project is clear and detailed. Each member involved in the project can think about them and check whether their end-picture can be reach by their efforts. It will be the start point for long-term series of actions, to change sensitive Japan and make it become opened to ecosystem. \nThere was no information on whether this proposal is a continuation of a previously funded project or entirely new ones. The proposer can add some information about it.  \n", "q2r": 3, "assessor": "z_assessor_1655", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposers wish to initiate a program designed to provide editors and producers at top-tier tech and business publications in Japan with updated progress and successful stories about the Cardano blockchain.\nHowever, the claim that those editors and producers are not up-to-date with all the progress done and that “Cardano is stuck where it left off in 2019” is not backed-up by any kind of links or proofs. IOG, the Cardano Foundation, Charles Hoskinson, the entire Cardano community is always posting updates, both in video format, as in written format.\nAs such, I cannot evaluate the need for this project and consequently, the impact it might have on the Cardano ecosystem.", "q0r": 3, "q1": "The plan and timeline described are detailed, offering information on a monthly basis about each step that needs to be implemented to finalise the project.\nThe budget is only shortly described, for all the timeline reported, the only mention is that: “Blended team hourly rate of USD 180.00 X 200 hours”. From the description of the team, we can count 5 members (or 4 + 1 advisor, as the last team member doesn’t have a detailed description) and that would mean an average of 40-50 hours of work in total per team member, or between 5-7 days, if counted with a 7 hour workday, or between 13 - 16 days, if counted with a 3 hour workday.\nFor such a complex endeavour, I would have imagined that it would take more time to complete it and simultaneously, the hourly rate would be lower or at least described why this amount is needed.\nThe team has offered ample details about almost each member, but has unfortunately not provided any kind of links to verify their claims and evaluate their capabilities in implementing the project.", "q1r": 3, "q2": "The progress development is very detailed, providing a lot of insight into the advancement of the project. It would have also been important to provide details on where these steps could be independently evaluated by the community, but after assessing all the details provided, I envision the possibility of having all the reports published in a public place for the entire Cardano community to see, even if there is no such mention about that at the moment.\nThe success description offers a more idealistic view of the positive outcome, but no clear milestones that would enable the community to assess these triumphs independently. For example: “Meetings with core tech and business media will result opportunities for positive coverage” could be rewritten with the addition of a number of those representatives, a number that would represent the minimum amount to be considered a success.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Reality check to opinion leaders in media & industry about advancements and prominence of ecosystem. Set the stage for wave of progress.", "experience": "PR and marketing services for cryptocurrency companies, fintech, marketing software, cyber-security software, major Chinese electronics, fast-food restaurant, automobile industry, and more!"}