{"id": 405459, "author": "npaquoc87", "title": "Cardano Atlas Project", "url": "https://cardano.ideascale.com/a/dtd/405459-48088", "category": 26441, "amount": 51645, "description": "Users and projects don't have the one-stop platform to update the project info & news in real time or align with the Cardano Epoch calendar.", "f6_no_assessments": 7, "f6_rating": 4.380952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "The Idea is great and would make huge impact on the Ecosystem if its implemented in a good way as mentioned  and even it was  done before on another website \nhttps://cardanofeed.com\nwhich was for news mainly but needed well marketing which i see u have planning for on your Idea cause u offer a complete solution for Cardano news and details on all projects starting or running on Cardano .\n\nill add another name for  this idea \" cardano directory \" , or \" ADA247\"\n", "q0r": 5, "q1": "the team and budget looks ok , but there is a big point missing her as such a project will need ongoing maintenance after its finished spending the required funds and will need to collect data on new starting project every day ,,,  so i don't see a future vision for the sustainability  after being fully running ??    \nCardano projects starts every day so who will follow up and collect there data making sure it appears on Cardano Atlas for the community?   \nthis is my main concern here .  \n\nmay be the project have stake pool and will continue fund from stake pool revenue or displaying Ads on the site  , but its not mentioned .\nanother thing which is major is that there is no mention for the cost of being multilingual unless the team will use auto plugins to auto translate txt which won't work correctly for technical data and might confuse readers .", "q1r": 3, "q2": "the provided info is sufficient to audit the mentioned plan , but the plan it self miss some point mentioned in feasibility comment  about supporting multi languages support and running costs for the project on the long run ", "q2r": 4, "assessor": "z_assessor_1054", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is a very helpfull implementation that help Cardano users to identify Cardano projects and at the same time I think this implementation will be important for the Cardano community developers and managers to grow their visibility and audience.\nThe proposal clearly articulates the contest, the problem (actual difficulty in view Cardano project ecosystem) and how it will add value to the Cardano ecosystem and for all of the stakeholders.\nI think there are competition in the market for this kind of implementation, so I suggest to the proposers to identify some distinctive proposition and to dedicate important time to marketing activities and social network actions (eg. on Discord).", "q0r": 5, "q1": "This proposal is well written and clearly demonstrate the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community: they work in telegram communities and developed some bot and automation on Telegram channel.\nThe proposer team  is well skilled about the whole context of the proposal  (Manager, full stack developer, front-end, etc..)\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it’s convincing. There is a simple and complete cost worksheet with infrastructure and developer fees.\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon.", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, but no simple KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) Also the proposer has not mentioned possible difficulties, but no informations about market competitors.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal has a solution that combines manual posting, self-updating project owners, and automatic retrieval of project information by API. Thereby all new information of the project will be updated soon, helping users quickly grasp the information. In addition, the proposal also integrates a tracking tool using Telegram BOT and Discord BOT to automatically update new information; this is a feature that helps information actively interact with users. Currently, there are many general pages about projects developed on the Cardano ecosystem, but when the project has new updates, the information will not be updated in time, not seamlessly. To track information of a specific project, users often have to actively follow Twitter, Discord, Medium ... , a normal user will not have many social network accounts to follow. I think that when this proposal is finalized, it will be an information platform about the Cardano ecosystem with seamless information, making it easy for users to access new information of potential projects.", "q0r": 5, "q1": "I have consulted some Telegram BOTs currently provided by the proponent such as @biendongtaikhoan_bot, @empowa_vn_bot running in the channel https://t.me/empowa_io_vietnamese_official, @GeniusYieldVietnam_Bot running in the channel https://t.me/GeniusYieldVietnam. The proponent has provided its user community with simple features such as BOT updating new information about the project, BOT reporting the saturation of ISPO pools, so it is completely possible for them to provide BOT many more features for this Cardano Atlas project. I think this proposal can give a target of the number of projects that will integrate BOT will be supported by more people. The team members each have expertise in fintech, programming, design... they are also ambassadors and community managers of a number of prominent projects on the Cardano ecosystem such as Genius Yield, Empowa, from the information they provide and I have also checked the fact that this is a group that specializes in researching projects on the Cardano ecosystem so this proposal they will complete excellently.", "q1r": 5, "q2": "The proponent has a clear product development roadmap, from week 8 to week 12, users can access the website as well as use Telegram BOT, Discord BOT. After 25 weeks of the proposal being finalized, any user can then access and evaluate the progress and success of the proposal. The budget proposal table also has a clear division for each specific job. However, in my personal opinion, this is a proposal to build an informational website about the Cardano ecosystem, website building often uses core technologies and is easy to implement, but the amount of money proposed The export requirement is quite large up to 51645 USD, it accounts for more than 1/10 of “F8: Miscellaneous Challenge”, because of the large budget requirement I consider this as a minus.", "q2r": 4, "assessor": "z_assessor_1151", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "I almost wasn't sure if I thought this idea was worth $50k+. At least not in the form of Catalyst funding because this kind of idea could easily be something that the free market of Cardano decides to fund. I changed my mind. As a MELD Brand Ambassador (I've been with the team since the beginning of the program), I can confirm that this feature has a lot of use as a tool that aligns the world with \"Cardano time.\" Especially in the early stages of MELD, there were lots of questions about timeframe/epoch translations about the ISPO. This tool would have made it SO much easier to answer those questions, and it might have even eliminated the need for many of them to be asked. Plus, (after taking some time to think about it) I think that this type of feature does something for ease of adoption. In a world where there is an openly accessible tool that allows people to find epoch-based calenders, people will not have to spend any time trying to do time conversions because they will align with \"Cardano time\" with relative ease. Ultimately, this tool saves time, which I think is humanity's most precious resource. ", "q0r": 5, "q1": "My first thought was that the requested amount was overpriced, but it seems to check out with a reasonable breakdown (aside from IMO some negligible categories like \"Working with 10 projects...\"). I'm actually rather impressed with the timeline. I have precisely 0 experience with software development but I didn't expect we'd have it fully completed in 6 months. I'm also encouraged by the experience on the team AND connections to other projects that can help with the adoption of this product. I feel like they provide everything I need to see and I have no concerns. ", "q1r": 5, "q2": "These are phenomenal KPIs because they don't list \"completion of the product\" as a factor of success (which has become a Catalyst pet peeve of mine). They measure success by the use of the product, which is what actually makes the impact. They have specific metrics established for the level of usage they are aiming for and they include the development of different languages supported to ensure accessibility. This was also a very concise and clear-cut section that just got straight to the point. This one should be used as a model for what a good auditability section looks like. ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The problem and solution description in this proposal are clear and comprehensible. A community funded and contributed informational resource seems like a good idea that matches this challenge well. It will, if implemented and maintained well, surely have a positive impact on the coherence and tangibility of the Cardano community and thus be beneficial to the Cardano ecosystem. In a way, this is also a scalability tool, as it will help to centralize information.", "q0r": 5, "q1": "The team is experienced and provides verifiable information that indicates they will be up to the challenge. Plan is very detailed and sensible, with a very detailed, reasonable budget and teactable, step-by-step milestones. A good contingency plan is presented and shows feasible approaches to possible occuring problems. As someone who is working in project work themselves, I can assess this is a good, feasible project plan.", "q1r": 5, "q2": "The problem description and the solution statement are both very clear. The detailed roadmap allows very good auditability along the way, just as the success criteria and KPIs enable good auditability of the project outcome.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "I belive this proposal suits this challenge. The team would like to build a central place where Cardano porject information can be hosted and updated. It will serve as a source of information much like cardanocube, but hopefully with more detail.", "q0r": 5, "q1": "The Team have a decent sheet for experience between three of the main members, I dont think the project is over complicated in their approach and if kept on track it would serve as a solid base for Cardano project information and a good community tool. I would like to see what their plan is regarding marketing the product however and how they plan to attract users to the site over a large range of social media platforms. They will need to make a decent effort to approach projects as projects will not be aware of them/the site in the beginning.", "q1r": 4, "q2": "Slightly more detail here would have been nice. I do however think based on their experience with web dev, looking holistically, the plan seems straight forward. Again i would probably like to see a bit more information on promotion and how that is going to measure if the platform/site will have enough content to make it usable once live", "q2r": 3, "assessor": "z_assessor_750", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I consider this proposal as a nice-to-have and am still contemplating if this proposal is what the community urgently needs currently. I agree that it will be beneficial to all the community to have a sort of CoinMarketCap/CoinGecko or CoinMarketCal exclusive to Cardano ecosystem, but to what extent is still a blur to me. Sure this will help us to keep track and update ourselves about the latest trends and happenings, which we all can agree is not an easy task in itself. However, I believe that it is not only me but also a good portion of us have found ourselves inside enough Cardano-related information channels, be it in Discord, Telegram, Reddit, YouTube, Twitter, or even Instagram. It’s difficult for me to imagine an extra channel will make this process easier. Above being said aside, I must say the on-chain information that will be provided such as on-chain ISPO saturation is an example of interesting feature. Support to preliminary check and curate legit projects in Cardano while filtering out potential scams or frauds can also be an example of highly desirable and contributing benefit for community.   For now, I can only rate this proposal so much in terms of impact and observe how other advisors and ultimately the voters regarding their opinion on how necessary for community to have something like Cardano Atlas described in the proposal. I wish the proposer best of luck and hope the implementation later can clear my doubt.", "q0r": 3, "q1": "Going through the planned timeline, I didn’t find any major issue. It is adequately realistic and seemed well planned, albeit a bit too slow in my opinion. However, I doubt I can say the same for the budget. The breakdown is well-detailed but somehow I feel the cost is on higher spectrum given the deliverables, especially in the manhour rate. Therefore if somehow this proposal cannot make it in Fund 8, it might help to divide this proposal into two funds and prioritize the on-chain features. Above being mentioned, I have no concern about the expertise and technical capabilities of team members introduced in the proposal. I trust they are kind and capable members in local Vietnam Cardano Hub. Work distribution is great and I trust they are all tried and tested professionally to handle the jobs.", "q1r": 4, "q2": "The methods and metrics described are alright in my perspective. The numbers are likely to be achieved should this proposal be implemented. Concern I have left is due to my doubt about the extent of the impact this proposal will bring. We need to be sure if the success of the website itself is aligning with the success of the challenge and community. If they have done some kind of market survey priorly to support this proposal, I think I can rate this proposal higher and more accurately in general.", "q2r": 3, "assessor": "z_assessor_943", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "IT seems that CA don't read the proposal carefully and check all the information provided on the proposal which is the responsibility of a CA to help voter for their decision. This is one-stop-solution (you dont need to go to various platform: facebook, twiter, discord, telegram for each proejct to collect information, we will help all) that's the work we are currently do for a small community. Since in on pro-bono basis then we are unable to do more, that why we need the fund."}], "solution": "Cardano Atlas Project - All-in-one platform for searching and updating Cardano’s Project information and news.", "experience": "We are start-up founders, full stack developer, cardano pool operator, community adviser, cardano project ambassadors."}