{"id": 366717, "author": "", "title": "IDEA FEST for Fund 6 + 7", "url": "https://cardano.ideascale.com/a/dtd/366717-48088", "category": 26113, "amount": 35000, "description": "Project Catalystでは、提案者と投票者の間に相互作用がない。", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great proposal by the catalyst swarm team who have already proven the concept by conducting this in the past. Given proposers a platform to pitch their ides is a great way for entrepreneurs to get feedback on their ideas, collaborate with others who can help and get great proposals funded.", "q0r": 5, "q1": "The team is highly committed and experienced and have already conducted these in the past. They have a detailed plan and I have no doubt they can deliver.", "q1r": 5, "q2": "Delivery is simple to audit, and the team have set themselves a number of success goals to keep growing into the future.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 21, "ne": 2, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "As proposers (i.e. entrepreneurs) often lack structure to communicate ideas effectively, IDEA Fest provides a framework to communicate those ideas and ultimately have a higher chance of funding compared to non-participating proposals. With the link of IDEA Fest participation to higher quality proposals in tact, this proposal effectively addresses the challenge. It can be further stated that this has a positive impact on the Cardano ecosystem.", "q0r": 5, "q1": "The team has the experience and track record of executing this idea for previous funds.", "q1r": 5, "q2": "As IDEA Fest is an open and recorded event, the metrics / KPIs and the process of the proposal itself can be audited easily.", "q2r": 5, "assessor": "z_assessor_22", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The Swarm Session proposal is in line with the challenge, they already have a great traction generating networking between members of the ecosystem and providing intra-community connections.", "q0r": 5, "q1": "Swarm Session has a great traction and they have a great proposal plan to generate more impact in their plans.", "q1r": 5, "q2": "The proposal, the KPIs and the vision of success are perfectly defined.", "q2r": 5, "assessor": "z_assessor_274", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement is clear and this is a method used by VCs and Accelerators to demo the startups they are working with. Having a demo day would add depth to a proposal and even sharpen the idea. Some of the proposals would benefit from being read aloud!", "q0r": 5, "q1": "There is a detailed plan, team and timeline in place. The budget Is clear and reasonable. ", "q1r": 5, "q2": "There are clear KPIs that the community can measure. The proposal is clear and easy to read and understand. The objectives are clear. This adds confidence that the idea would be successful. ", "q2r": 5, "assessor": "z_assessor_466", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Ive seen this team in action and their level of brain power interaction is refreshing. The idea of hosting this type of event to expose proposers with voters is a great tool where governance is achieved through dialogue from the \"mouth of the horse\". This can give great confidence to proposals that show both transparency, exposure and confidence in that proposer delivery.", "q0r": 5, "q1": "The experience is witnessed in many numerous times. This type of work definitely requires funding to keep the great work flourishing the projects future. Is the essence  of governance, different people reaching consensus through rational/logical discourse.", "q1r": 5, "q2": "I think it has all the information presented and evidence to show that its working and funding would incentivize the key members to take it to another level.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Fund 7 Idea Festは、すべての提案者にアイデアを発表する場を提供し、有権者やコミュニティが彼らと交流し、議論する場を提供します。", "experience": "私たちはすでに、ファンド5の提案を対象とした「アイデア・フェスト」の第1回目を開催しました。"}