{"id": 366866, "author": "", "title": "Copy writing for DLT Entrepreneurs", "url": "https://cardano.ideascale.com/a/dtd/366866-48088", "category": 26113, "amount": 10000, "description": "アイデアを伝え、読者に行動を起こさせることができるのは、ビジネスにおいて最も価値のあるスキルの一つです。", "f6_no_assessments": 6, "f6_rating": 1.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great idea, however there are no details in the plan.", "q0r": 3, "q1": "More detail is required on what the copywriting course would be, how it would be targeted to catalyst, when it would be produced by, how it would be delivered and what the budget would be spent on.", "q1r": 2, "q2": "No real deliverables other than a free open source copywriting course and forum have been provided. There is no timeline for delivery, thus progress cannot be audited. No KPI's or goals for success have been presented. ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 14, "ne": 3, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "You say: \"Being able to communicate an idea and guide a reader to take the action you want them to is one of the most valuable skills in business.\", but you are not able to communicate your own idea. So you ask 10K and don't even have time to produce some content for your proposal? So how we will be sure you will produce content if your proposal is supported? Maybe you just forgot to put the plan - then please come next Fund. \r\n", "q0r": 1, "q1": "The proposer states that he has experience, but there no single link to the content he produced and there is no detailed plan. \r\n", "q1r": 1, "q2": "It won't be possible to audit this proposal. ", "q2r": 1, "assessor": "z_assessor_328", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "This proposal creates a free open source copywriting coure and opens a forum for critiquing/feedback of writing. Technically this might address challenge however there are no details about what form the course would take. Is it a video? Text? \r\nThe proposal is lacking in details over all. \r\nBased upon my experience, I neither agree nor disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 3, "q1": "The proposer has not provided any evidence of having the relevant skills in the form of links or references. The lack of detail in the proposal is concerning. There is no timetable as to when the course would be available .\r\nBased upon my experience, I disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal does not provide a roadmap, auditable milestones, a defined timeline or any metrics. Recommend proposer review successful proposal details to understand the details required in a proposal and take advantage of any proposal tools made available from this fund.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The problem and the solution are related to the challenge, but the proposal is just a draft and there is not enough information to assess the impact. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "There is no plan. The proposal is just a draft and there is not enough information to assess feasibility. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "There is no plan. The proposal is just a draft and there is not enough information to assess auditability. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The proposal accurately identifies an issue that entrepreneurs face; but there is a lot of information it could add in order to address that issue more effectively, such as detail about course content, and/or how the learning will be accredited. As someone with considerable experience of developing successful training,  I know there are issues that an impactful training plan needs to address, which this proposal is missing (for instance, awareness of the barriers that learners might face; managing inclusiveness to different learning styles, literacy levels, and first languages; etc) Cultural norms of how to write and persuade vary from one culture to another; but as the proposal does not address this at all, it's in danger of not being very adaptable to the different cultures within Catalyst, and of not having a positive impact on the challenge's aim around supporting increased diversity. And the idea of a forum could work, but only if the participants know how to critique each other effectively and are confident to do so  – as the proposal doesn't plan to support them in developing those skills, the forum could actually have more of a negative impact than a positive one. In short, there's too much missing, and too little understanding shown of training, for me to feel the proposal can have a good impact on the challenge.", "q0r": 1, "q1": "The proposer doesn't mention having any skills or experience in education or facilitation of adult learning,  or in designing training programmes, and they don't mention engaging anyone else who does have relevant skills. The proposal is missing most of the key elements that would indicate good planning skills and an organised approach, such as  a budget, a timeplan or milestones, and assessment of and mitigation of risk. Without evidence that the proposer knows what will be needed to deliver the project, or has the skills to do so, I can't agree that the project is feasible. ", "q1r": 1, "q2": "There are no milestones, KPIs , targets, or detailed aims given, and there is very little information about what the project will actually entail; so auditing would be difficult. We could audit whether the course happened, and how many people were enrolled in it – but this would not tell us anything about whether people found it useful or successful. It would really help if the proposer thought about what success would look like, and gave some specific goals we can measure – such as how many people they hope will enrol, how many will complete the course, and how many will rate it positively.", "q2r": 2, "assessor": "z_assessor_540", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposed challenge doesn't define clearly the problem or the solution presented. Unclear as to the benefits without more information defined by the proposer.", "q0r": 2, "q1": "There seams to be a substantial  amount of experience in the subject, more clarity as to how the funds will be used and perhaps some KPIs to measure the solutions implemented.", "q1r": 3, "q2": "There is not much data to access the auditability or the progress once funds are distributed. what 1, 3 or 6 months looks like and how are the funds used in the solution. ", "q2r": 1, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Catalystの参加者のために、無料でオープンソースのコピーライティングコースを作成し、コピーを投稿して批評やフィードバックを受けるためのフォーラムを開設する。", "experience": "企業でのエグゼクティブレベルでのコミュニケーションを8年、ソロプレナーとして公の場での構築を3ヶ月経験"}