{"id": 368678, "author": "", "title": "Open Source Training", "url": "https://cardano.ideascale.com/a/dtd/368678-48088", "category": 26113, "amount": 8720, "description": "Entrepreneurship-Toolboxには、オープンソースのトレーニング教材はありません。\n\n初期段階の起業家のためのオープンソースのインフラへのアクセスがありません。", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Great well documented plan to leverage catalyst school to teach entrepreneurs on how to use open source tools to deliver their projects. Aligning training to a common set of open source tools will also help in auditing delivery of projects by making data about them in ingestible in common formats.", "q0r": 5, "q1": "There is a well documented plan and the proposers have the experience to deliver the content. By lining up with Catalyst school the have access to the target audience to bring people into the program. ", "q1r": 5, "q2": "Well documented plan with easy to audit deliverables. A number of KPI's have been outlined to measure success, though it would be great to see some goals set against these metrics to see how delivery compares to the expectations prior to launch and for voters to have an idea of expected impact.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Tools such as Github are often not fully understood by entrepreneurs when starting out. This puts them at a disadvantage as they are not able to reap the benefits using Github. This proposal suggests a three pronged approach to helping people understand Github and allow them to use it to the fullest. The recording of workshops, published to be viewed in perpetuity is especially important as it allows the knowledge shared in the workshops to be accessed not just by those who are available at the time and also allows people to go back later and rewatch if they require a refresher. This strongly relies on marketing properly and getting the word out; although mentioned there is no indication on how this will be marketed to the community.", "q0r": 4, "q1": "It is shown that the experience as an educator is vast, this assures that the teaching component of this proposal will be executed properly. Also, previous resources created provide evidence that new resources will be of good quality. However, the skill of creating effective video resources is not expressly stated in this proposal, so it is hard to say whether these resources will be visually effective.", "q1r": 4, "q2": "Provided is a clear criteria to measure the success of this proposal. However in my opinion these criteria assess the ability for people to access these resources and not the effectiveness of the resources produced. The way shown to assess the effectiveness of the workshops is very difficult to quantify so alternate ways should be found, such as trying the workshop on people above the skill level of the target audience and asking for feedback or surveying participants. ", "q2r": 2, "assessor": "z_assessor_525", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Github provides many tools that can be used by entrepreneurs to create better projects, share ideas, and generate collaboration. The idea in this proposal to create screencast and live workshops to teach those tools to new entrepreneurs really fit in the spirit of this challenge ", "q0r": 5, "q1": "The team has vast experience in academic organization and is already collaboration with Catalyst School. The plan is well defined, with clear deliverables, due dates and how the budget was calculated. Base on that there is no doubt of the feasibility of the project.", "q1r": 5, "q2": "The proposal defines when training material and workshops will be delivered. Each one was quantified in hours production that is tied with a per hour budget. That way makes simple and transparent the auditability of the project.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The training courses listed here so far are a great way to address this challenge - especially if we are to propagate Cardano to non-technical users and communities.  The impact should be global although I am unsure if the proposer has a plan for scaling this. The recordings will undoubtedly be an important part in scalability however, language might be a challenge. It would be good to see this has been considered in the long term plan.  Otherwise this is a well-written proposal that any voter should be able to understand, even with a simple skim read. ", "q0r": 5, "q1": "It appears as though the proposer has the background necessary to organise this training however, he has not detailed whether he has the (presenting) skills to deliver online training. As someone who has had 10+ years developing and delivering online training in a corporate setting, Delivering quality online training that will be used in a vacuum, while appealing to and connecting with a passive audience - will require particular presenting ability. It would be good to know if the project proposer also has these skills or if he will be outsourcing this part of the project. \r\nSecondly, it would be good to understand the value split of the workshops vs the on-demand videos. The workshops seem like a great idea with good value-add. Will the scalability of this project be diminished if the workshops are a big part of the value proposition? \r\nFinally, it's great that there is a plan for where these resources will be stored and that there is a budget for marketing efforts, but it would be good to see some detail around outreach methods and means. So, will your primary focus be social media or will it be crypto events, town-halls or entrepreneur events etc? ", "q1r": 4, "q2": "The key metrics are a good starting point and will go some way to measuring both the subjective and objective elements to training, however, it would be good to see hard numbers of goals. So, how many users are you hoping to have accessed the training/attended a workshop? What survey result/what differential are you hoping to see between those that have consumed the training vs not? Also, seeing as there is a budget outlined for marketing, it would be good to see some metrics around measuring the effectiveness of the marketing outreach. ", "q2r": 4, "assessor": "z_assessor_620", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "To my eyes the DLT Entrepreneurship Toolbox challenge is about helping proposers effectively communicate their project during the proposal stage, rather than helping them  with the execution of their proposal. However I give 4 stars because the wording of the campaign is open to interpretation. Open source software is certainly a form of communication and allows for meaningful collaboration, but this proposal may better belong in the developer ecosystem challenge. ", "q0r": 4, "q1": "the products are well defined and the proposer appears to have the experience, initiative, and partnerships to produce meaningful workshops related to open source tooling. I hope sufficient attention is given to marketing so that the resources are utilized as intended. ", "q1r": 4, "q2": "8 workshops are proposed along with community documentation. Execution of these projects will be easy to observe.  Attendance and surveys will be used to judge the impact, which seems reasonable. ", "q2r": 4, "assessor": "z_assessor_67", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Entrepreneurship-Toolboxのためのオープンソースのトレーニング教材\n\nアーリーステージの起業家にオープンソースのインフラを説明するワークショップ。", "experience": "スティーブンは、学術的、コミュニティ的、ビジネス的なプロジェクトの組織化に30年の経験を持っています（詳細計画参照）。"}