{"id": 369781, "author": "", "title": "Cardano roadmap to adoption", "url": "https://cardano.ideascale.com/a/dtd/369781-48088", "category": 26113, "amount": 15000, "description": "スタートアップチームは、ブロックチェーン技術を理解していない人にプロジェクトやアイデアを適切にアピールすることができません。", "f6_no_assessments": 5, "f6_rating": 1.4666666666666668, "videos": [], "media": [], "f6_assessments": [{"q0": "How will a case study to explain why Cardano is the future of blockchain help entrepreneurs? This may be a good idea to market Cardano, but how does it meet this challenge.", "q0r": 1, "q1": "There is no clear plan on what would be delivered and when, merely that a case study would be produced. The proposal should have a clear timeline for production and outline some more details on what will be produced.", "q1r": 2, "q2": "As there are no timelines or clear information around what will be delivered it is not possible to audit delivery of this project. More importantly there is no information around how delivery of this project will contribute to the challenge. How will this help entrepreneurs? How will you measure it?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is to create a lessons learned document from a cases study in which the proposers pitch Cardano as the future of blockchain to a non-technical audience. Pitching the value of Cardano to the Catalyst community is not going to be required in any proposal since the community is comprised of people who already value Cardano. \r\nThe proposal is very sparse. I recommend reviewing successful proposals to understand the details required in a proposal. Recommend proposer take advantage of any proposal tools made available from this fund.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The quality of the proposal and website does not provide evidence that the proposer has the relevant skills to deliver a lessons learned document that would be of benefit to the community and worth $15K.\r\nBased upon my experience, I disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal does not provide a roadmap, auditable milestones, a defined timeline or any metrics. Recommend proposer review successful proposal details to understand the details required in a proposal and take advantage of any proposal tools made available from this fund.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The problem and solution are reasonable and related to the challenge, but the proposal is still very abstract, just a draft. There is no structured plan and goals/indicators that indicate a relevant impact on the challenge.\r\n\r\nI would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "As there is no plan, it is not possible to assess the team's qualification for the proposal. There are not enough elements to assess the feasibility of this proposal. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "There are no elements to assess the auditability of this proposal. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Learn how to explain ideas to non-tech/non-blockchain individuals is a vital skill for entrepreneurs, and clearly aligned to the goal of this proposal. However, the plan described is related to use MyVoice platform to show nonprofit organizations the benefits of Cardano, and then document and share that process. For that reason, the proposal does not fully match the goal of this Challenge. I recommend adapting the plan with the unexperienced entrepreneur as the main beneficial.", "q0r": 4, "q1": "The proposal does not elaborate the idea in detail with a plan that can help the community understand if it is feasible or not. There's a link to myvoice project that is related to closing the gap between citizens and legislators. Base on the lack of that fundamental information it is not possible to assume that the project is feasible or has a possibility of success. I recommend developing the idea with a detail plan.", "q1r": 2, "q2": "The proposal lacks information regarding the team. Only refers to myvoice webpage that neither shows reference to team member. It does not provide deliverables, timelines, or metrics that can be audited by the community. Note that it is important for Project Catalyst to be able to track progress of project where funds are allocated. The proposal states an overall budget but do not specify for what activities is needed. For those reasons I do not consider that there's enough information to audit the progress.", "q2r": 1, "assessor": "z_assessor_554", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The concept presented in this proposal seems to have more to do with bringing non-profit organizations into Cardano and less about preparing existing projects of any profit type to present their ideas to an audience.\r\n\r\nFrom a project management standpoint, this lacks clarity, which neuters impact. Additionally, it seems to diverge from the purpose of the challenge.\r\n\r\nIt's unclear how MyVoice fits with the vision of this proposal, and even less with how it will help solve the challenge. \r\n\r\nFor these reasons I am giving this proposal one star. ", "q0r": 1, "q1": "In its current form this proposal is not feasible as a solution to the challenge of creating a DLT Entrepreneurship Toolbox. \r\n\r\nFrom the standpoint of an investor I have no idea what the budget will be used for or what steps are needed to solve the problem statement. \r\n\r\nThere seems to be a disconnect between the problem statement of how startup teams struggle to showcase their projects, and the proposed solution, which sounds more like a development project for the MyVoice platform.\r\n\r\nI would encourage the proposer to think about the tool of MyVoice as a platform on which any entrepreneur could present their vision to users or investors. If that was the intent of this proposal, it didn't come through at all. \r\n\r\nFor that reason I must give one star. ", "q1r": 1, "q2": "Unfortunately, it appears that the proposer did not take the time to  break down the budget allocation or even indicate any KPIs. As an entrepreneur, this is a non-starter both in terms of execution, but certainly in audibility. \r\n\r\nPlease break down the goals into specific parameters, which will allow you to assign budgets based on the estimation of work needed for completion. \r\n\r\nFor the reasons mentioned, I must give this proposal one star. ", "q2r": 1, "assessor": "z_assessor_613", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}], "solution": "ケーススタディMyVoiceチームは、Gimbalabsの技術を使って、テクノロジーやブロックチェーンに詳しくない人に「なぜカルダノなのか」を説明しました。", "experience": "私たちは昨年、エンゲージメントを発展させ、市民が公共の利益のために行動することを促すためのシビックテクノロジーを研究・構築してきました。"}