{"id": 369940, "author": "", "title": "TrillionCoin Global Charity Token", "url": "https://cardano.ideascale.com/a/dtd/369940-48088", "category": 26113, "amount": 1111, "description": "コビットのパンデミックにより、人を助けることが非常に求められています。壮大なスケールで人々を助けるために、どうすればそのニーズを満たすことができるのか。", "f6_no_assessments": 7, "f6_rating": 1.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal has no plan and has nothing to do with helping entrprenuers.", "q0r": 1, "q1": "Even if creating the coin were a good idea, there is no detail on how it would be marketed, minted or delivered. Would the funds requested even cover transaction fees on delivery?", "q1r": 1, "q2": "No detail on how the plan would be delivered and thus it cannot be audited, There are no metrics on how this would contribute to the challenge goal of providing tools for entrepreneurs or what success means.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Per challenge description: \"This challenge seeks to help inexperienced entrepreneurs to learn and apply vital entrepreneurship skills so they can collaborate with teams and stakeholders on meaningful Catalyst projects.\"\r\n\r\nThis proposal does not address the problem within the challenge. It fails to even have people imagine how this could have an positive impact on the Cardano ecosystem.", "q0r": 1, "q1": "No info on the \"Cofounder NW Inventors Network\" or how it relates to the implementation of the proposal.", "q1r": 1, "q2": "As there is no breakdown of the budget, KPIs or auditability, the score can only be 1 out of 5.", "q2r": 1, "assessor": "z_assessor_22", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Proposal has no relation to entrepreneurship and won't help early stage entrepreneurs develop their skills to execute & communicate great ideas. It also lacks more details, if the proposer want to make a successful proposal - please come with more details in the future.", "q0r": 1, "q1": "There is no detailed plan, no info about the proposer. The technical details on the token are absent too.\r\n", "q1r": 1, "q2": "There is no detailed plan, no info about the proposer. Even though the budget is relatively low, there is no sufficient information to audit the progress and the success of the proposal.\r\n", "q2r": 1, "assessor": "z_assessor_328", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal highlighted a problem in the form of a question and failed to provide a solution to address the highlighted problem.\r\n\r\nI Strongly disagree.", "q0r": 1, "q1": "No information was provided.\r\n\r\nI strongly disagree.", "q1r": 1, "q2": "No information was provided.\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is a token advertisement and does not provide any skill training to entrepreneurs. Proposer should review challenge category information and review successful proposal details to understand the details required in a proposal. Recommend proposer take advantage of any proposal tools made available from this fund.\r\nBased upon my experience, I strongly disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 1, "q1": "This proposal has none of the necessary information to assess. Recommend proposer review successful proposal details to understand the details required in a proposal and take advantage of any proposal tools made available from this fund.\r\nBased upon my experience, I strongly disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "The proposal does not provide a roadmap, auditable milestones, a defined timeline or any metrics. Recommend proposer review successful proposal details to understand the details required in a proposal and take advantage of any proposal tools made available from this fund.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The problem description and solution are not within the scope of the challenge. The proposal is just a draft and there is not enough information to assess impact. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "The proposal is just a draft and there is not enough information to assess feasibility. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "The proposal is just a draft and there is not enough information to assess auditability. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The proposal refers to a charity token with no further explanation. However, this Challenge aim to help new entrepreneurs develop skills to cope with new projects. It is recommended to define the scope of the project to fit with the goal of this Challenge or look for other Challenges that are suits better.", "q0r": 1, "q1": "The proposal does not elaborate the idea and does not provide an actionable plan or guide. Base on the lack of that fundamental information it is not possible to assume that the project is feasible or has a possibility of success. I recommend developing the idea with a detail plan.", "q1r": 1, "q2": "The proposal does not provide deliverables, timelines, or metrics that can be audited by the community. Note that it is important for Project Catalyst to be able to track progress of project where funds are allocated. The proposal states an overall budget but do not specify for what activities is needed. For those reasons I do not consider that there's enough information to audit the progress.", "q2r": 1, "assessor": "z_assessor_554", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "TrillionCoin: チャリティトークンを3つの部分に分割 1/3は購入により保持、1/3は価値のある資産を取得、1/3はチャリティ活動に寄付", "experience": "NW Inventors Network共同設立者"}