{"id": 369908, "author": "", "title": "Mini Proposals as a Service", "url": "https://cardano.ideascale.com/a/dtd/369908-48088", "category": 26113, "amount": 1404, "description": "提案者は、自分の提案を有権者に理解してもらう方法を知らない", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a low cost proposal to help proposers in how to write proposal effectively. It would be good to have some information on how many participants would be trained. ", "q0r": 5, "q1": "The proposer has experience in naviagting the funding process in multiple catalyst rounds and thus is likely to be able to delver upon the relatively simple proposal to provide some workshops on proposal writing.", "q1r": 5, "q2": "The proposer has a simple plan that should be easy to audit delivery. It is important to also specify how many students they expect to attend their sessions.  They have set a clear success metric with a goal of their students proposal receiving a 3.8 CA score. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "There is a real need for a service that helps entrepreneurs to write down a plan and effectively communicate with voters. The proposer is known in the Cardano community, previous Catalyst winner and Veteran Community Advisor so there is big chance he will make this proposal successful and it will help entrepreneurs. ", "q0r": 4, "q1": "Tevo is already successful with the proposals in previous Funds, so it's highly likely this proposal will be implemented successfully. The budget is reasonable. The only thing I would recommend is maybe to add more details on the plan. \r\n", "q1r": 4, "q2": "I would suggest is maybe adding more details on the plan so it will be easier to track progress and success of the proposal. ", "q2r": 4, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Being able to do something is very different than being able to talk about it and present it to an audience for approval. The catalyst process can be daunting for new comers. This proposal aims to make this process much more accessible in a elegant way providing an easy template to follow and collective mentorship to guide people into creating compelling proposals addressing real issues. This is done using modern thinking tools such as Miro which help one design and create actionable plans.\r\nThis proposal will improve the overall quality of the future proposal that will follow the Catalyst process. It's important to note that the community is already providing such service without compensation which is not sustainable in the long run. Funding this (low budget) proposal will help fix that and set standards.", "q0r": 5, "q1": "Tevo (the proposer) is in the Catalyst project since at least fund 2 (it's when I joined as a CA and then vCA myself so he might be there since even earlier but I cannot tell). He has a proven track record of delivering and helped shape the community through his presence and actions.\r\nTevo and the 'Swarm community' are already providing this service for free and it is more than normal for him to be compensated. So there is no doubt that his proposal will be delivered. Moreover the budget ($1404) is very low. For me there is no hesitation concerning the viability of this proposal.", "q1r": 5, "q2": "The proposer has a proven track record, the objectives are detailed and within reach, there is no technical difficulties and the proposer is already committed (as can be seen in the provided video and Miro board)…\r\nThe auditability and success will be easy to assess during the very next fund, it would be nice that these futur proposals feature their participation to this process to further track their success and create a positive feedback loop.", "q2r": 5, "assessor": "z_assessor_40", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nI like the idea of the proposal. I think the problem statement is pretty easy to understand, even for beginners. As a recommendation however, I think that the message would be more impactful if a consequence of the stated observation were also mentioned. For example, \"Proposers don't know how to make their proposals understandable to voters and this can result in valuable ideas not getting funded.\" This adds a bit more urgency to the statement.\r\nThe solution to the problem is adequately stated, I believe and it's aligned with the challenge itself. \r\nWhat is lacking here, in my opinion, is the clear formulation on how this would bring value to the ecosystem. As a voter, I like to see this clearly stated in the proposal, instead of it being left up to me to figure it out by myself. People unfamiliar with Cardano, who maybe just started voting this round, can get overwhelmed by the amount of content they need to decide whether to fund or not, so the proposals need to be as clear as possible, if they hope to gain their votes.\r\nAn example of the goal could be as follows: \"At the moment, many proposals on Cardano, while good ideas in themselves, are too complicated, too poorly structured and poorly communicated to convince people to vote for them. Moreover, even if they are voted, they sometimes don't get completed successfully due to the above mentioned reasons. The service we provide here aims to change proposals to be smaller in size and scope, but better defined and planned, so as to not only attract more votes, but then also to be more likely to be implemented successfully.\r\nI think the KPI's for the proposal are defined ok for the most part, though I have the following observations:\r\n-  I don't exactly understand the first measurement. It's stated that the goal is to increase higher score proposals by 10% (3.8 being the threshold for a proposal to be high score). Should not the goal be to track what score proposals which use the service get, compared to the score regular ones get? (Difference in score of applicants using the toolbox and those not using the tools.)\r\nFor example, let's say that in Fund 7, there are 110 proposals in total. 10 of these used the service mentioned here (so 100 did not). Then, we look at how many normal proposals got more than 3.8 score (let's say 40 out of the 100 – that's 40% of them). Lastly, we look at how many proposals which did use the service got over 3.8 score. Let's say 6 out of 10, meaning 60% of them. 60% of proposals which used this service got over 3.8 rating, vs 40% of proposals, which did not use the service. That's a flat 50% increase in the number of proposals which got over 3.8 score.  \r\n-\tThe goal to get one person to publicly create a proposal using the Miro board, which already has an example, sounds feasible in my opinion.\r\n-\tThe average people per workshop session and number of views per video per week sound feasible as well.\r\n-\tI don't understand perfectly what team the last metric is referring to. How many people from any team willing to try out this service will participate in the workshop? Or is it something else? Is this intended to track the number of people using the service overall?\r\n-\tA metric for measuring what specific problems which entrepreneurs face right now will be fixed by this service is missing. Perhaps it would be useful to establish a few clear concrete objectives in the workshops and then analyze proposals which use the service after they are finalized, to see that the objectives are fulfilled. For example, perhaps proposers don't state their budget needs clearly and the service can take it upon itself to make sure that proposals it coaches don't have this problem anymore. This can be easily tracked after proposals are finalized.", "q0r": 4, "q1": "The plan on how the proposal is going to be implemented sounds pretty straightforward and I feel confident the proposer will deliver, but I think a few things are missing for this section. I'll start with the good points and then move on to the feedback:\r\n- The proposer has been a member of Project Catalyst since August 2020 and has contributed to dozens of proposals over time. This makes me more inclined to believe that he will deliver. Moreover, he has already facilitated workshops, which is a big plus and the Mini-proposals idea looks fleshed out to me.\r\n- The proposer has a Miro board with examples of what this service would produce, the specific approach on how it will do that and also with details about the Mini-proposals idea and how to scale it.\r\n- The proposer has provided a detailed breakdown of the time costs of each separate part of the proposal and the $18 average hourly rate is by no means exaggerated for the task, in my opinion. The 20% extra also seems fine to me and I believe this is contingency for unexpected problems down the road.\r\nNow the less good:\r\n- The proposer has not mentioned who the people fulfilling each role will be, nor how they will be identified (assuming that has not been done already). This is the biggest uncertainty regarding the proposal, in my opinion and should be rectified if possible (or at least not repeated in the future).\r\n- It is not clear to me what the difference in responsibilities between the Solution Architect and the Facilitator are.  Could role responsibilities be stated more specifically please (at least in the future)?\r\n- The proposer could have added his LinkedIn page here as well (as done in the Video content about Mini-Proposals related proposal), to add more details about himself.\r\n- While a buffer has been mentioned for unforeseen problems, I think it would also help make the proposal more solid if a few risks were mentioned in it. My first concern is that it's not clear whether the team which is supposed to handle the workshops is assembled yet or not. If it is, are there contingency plans in case they cannot attend some workshops? If it is not and people need to be recruited, what happens if not enough people can be found in time?\r\n- While the Miro board contains a lot of useful information about the Mini-Proposals idea (kudos!), it would have been very helpful for both voters and CA's to place a big pointer to the specific Mini Proposals as a Service example we should look at. There is really a lot of information there to go through.", "q1r": 4, "q2": "I have one big outstanding question regarding the auditing of the progress:  where will we be able to see the results of this proposal? How can the community track the use of the service? Will the results be published somewhere?\r\nBarring the concerns I outlined above and in the previous sections regarding the missing / inadequately explained KPI's and the missing information about the other members working on the proposal, the feedback I have here is positive.\r\nOverall, the background of the proposer and the content here make me feel confident that the progress and success of the initiative will be auditable to a satisfactory degree.\r\nIt is clearly stated that 5 workshops will be held and that they will start 2 weeks before Fund 7. I'm eager to find out how many proposals will be created through these workshops.\r\nI think this is a good idea which will keep getting better as it's implemented. Hopefully my suggestions regarding the KPI's can help the proposer improve them (if I am correct in my assumptions there). Good luck!", "q2r": 4, "assessor": "z_assessor_546", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "起業家がプランを書き出し、有権者と効果的にコミュニケーションをとるためのサービス", "experience": "ファンド4、5の提案者。  \nベテランコミュニティアドバイザー。  \n数ヶ月前からライブワークショップのファシリテーターを務めている。"}