{"id": 383953, "author": "pierre", "title": "MetaCenter: Cardano + Metaverse", "url": "https://cardano.ideascale.com/a/dtd/383953-48088", "category": 26234, "amount": 60000, "description": "カルダノのコミュニティミーティングでは、コミュニケーションやネットワーキングに没頭できるインタラクティブな体験ができるスペースがありません。", "funded": 0, "upvotes": 19339305, "downvotes": 21972601, "votes_result": 2633296, "votes_cast": 254, "f6_no_assessments": 8, "f6_rating": 3.125, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer identified the problem of lack of space for an interactive communication and networking experience for Cardano meetings. As a solution, we proposed the creation of MetaCenter, a space for superior and innovative experience for Cardano meetings. This proposal presents a great idea to increase participation in the Cardano community, in line with the community events challenge.", "q0r": 5, "q1": "The proposer presents evidence of the experience of the architecture studio that will participate in the project but does not provide evidence of the experience of the team members, which would be important to validate their capabilities for implementing the project. The budget has been detailed and seems adequate for the proposed work. A realistic deadline for completion of the work was also established. The proposal did not consider relevant risks for the successful implementation of the project.", "q1r": 3, "q2": "The proposal clearly explained the target problem and its solution. A roadmap with milestones was presented but KPIs that are important for monitoring the success of the proposal were not provided.", "q2r": 3, "assessor": "z_assessor_429", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "\r\nThe problem needing to be solved has been identified and articulated namely here is no space that would provide an immersive and interactive experience of communication and networking for Cardano community meetings.\r\n.\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\nIt is not clear that this proposal falls within the scope of the challenge brief by he MetaCenter which would be a virtual space\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nThis proposal does not show  how it adds value to the Cardano system by building the MetaCenter  \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\n  Key metrics  have not  been stated. Some might include Number of attendees, No of users, no of rooms, no of offices in the Metacenter\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\n\r\nThe key metrics and goals   dont fall within the scope of the challenge\r\n  \r\nCan the proposal scale to address future challenges?\r\nProposal can possibly scale up by bringing in new organizations into the Metacentre\r\n\r\nThis project will have not have a positive impact on Cardano system at this point of time as the Metaverse is still at infancy stage. \r\n\r\nI can say that this proposal  doesnt adequately addresses the challenge   hence i have given it a 2 star rating.\r\n \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n", "q0r": 2, "q1": "\r\nThe proposers  has  provided some evidence  of themselves with their skills and experience in  conference management. His name is  given and  profile links on Linkedin are given.    \r\n The links are sufficient. \r\n \r\nI have visited the links.\r\n   \r\n The proposers may be experienced and competent to do the Metacentre. But the budget is very high. When spending such a large sum of money on a project, this may not be the best way to spend at this point of time when Metaverse has not still become popular. \r\nRather than establishing in a little known proprietary metaverse its better to work with Google or Facebook in their  Metaverse properties which will be far more popular.\r\n \r\n The type and number of team members required to implement the proposal is not fully known\r\n \r\n \r\nThe team structure is listed along with various partners.\r\n \r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\n The budget has  been given in detail. It is very high in my professional opinion as a CEO of a web development company for over 10 years and organizer of various events. Also considering the return on investment it is not worth it at this point. Maybe in three to five years when Metaverse is widespread it may have use.\r\n \r\nIs budget reasonable to achieve the set goals?\r\nThe budget is not reasonable to achieve the set goals. Most of it involves buying a block of land in the Somniumspace.  \r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\nThe proposal doesnt give a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are  described.   \r\n  \r\nThe proposal has technical aspects which have not been addressed \r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is not highly likely this proposal will be implemented successfully\r\n\r\n\r\n This proposal is broadly expressed but budget is much higher than it could be and also at a root level it doesnt add value to the Challenge goals, hence I have given it a 1 star rating.   \r\n\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n", "q1r": 1, "q2": " \r\n \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  no Metrics listed.\r\n  \r\n \r\nThe problem has been  understood and solution has been given in  detail but the solution is not a cost effective one based on projections and cost centres.\r\n   \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n \r\nAre there contingency plans in place for various outcomes?\r\n\r\nThere are no contingency plans in place for various outcomes.\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is  not sufficient to audit the progress and the success of the proposal but the budget is very high hence I have given it a  1 star rating.\r\n ", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 18, "ne": 3, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "As grand and novel as the idea is, it does not currently align with the Challenge setting nor the current development phase of Cardano itself. Throughout the Cardano ecosystem, there is heavy emphasis on educating and mass adoption of Cardano, both sometimes mesh into one objective, which is mass adoption through education. Key pointers that perhaps the proposer should note are that in this Challenge, there is a conscious effort to create meaningful participation in Project Catalyst, increase voter-proposer interaction, onboard and integrate new members into Project Catalyst etc. We have not also taken account the current focus of Cardano which is activation in the African continent. Migrating some aspects of Cardano's core interaction on a metaverse would alienate many, both from the point of view of the technical aspects such as computing power, hi-speed internet connection etc. to the social aspects such as the need to learn another layer of interaction, which is the UI of Somnium space. Things are already hard to interact with and communicate as it is. One last point the proposer should take note, shortly put, the main client here is Project Catalyst. So perhaps in future iteration, this proposal should be about how to help Project Catalyst achieve their goals in this Challenge setting. Of all the metrics in the IMPACT section, unfortunately this proposal has missed them. For future reference, reckon ideas could be bounced of within the After Town Hall to perhaps find a niche where this Metaverse idea can exist. Perhaps partnering with NFT-maker.io?", "q0r": 1, "q1": "Given the team assembled, key collaborators onboarded and the work they have done in their past, which can be viewed through their website, the proposer will most likely achieve their goal. Budget wise, it needs to be fleshed out more. Even though the chunk of the budget goes to purchasing a lot in Somnium Space, designing an architecture building, whether virtual or physical takes time and process. That process is not reflected in their budget or detailed in the timeline. There is also actually a disconnect between the budget and timeline provided. In the timeline, there is a mention of creating MetaCenter program and it's social media communication channels but is not allocated budget for. Will these work be unpaid for? These disconnects can be hashed out by reaching out to Catalyst School for further reference on how to formulate a concise and impactful proposal.", "q1r": 3, "q2": "There is a general roadmap of the development process with milestones, but being general there are sections that can not be audited responsibly, such as the design aspect of this MetaCenter. Because of this, questions such as, 'Is this MetaCenter design new?', 'Where is the design and brainstorming process of it?', 'What is the concept behind the appearance of MetaCenter?' and etc. might arise. These design process if existing can be translated into measurable KPI's, which unfortunately this proposal does not provide.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 19, "ne": 5, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is about organizing Cardano community meetings in the Metaverse in The MetaCenter (a virtual space). The problem statement is explained convincingly in detail.\r\nHowever, the solution is described as that it aims at creating a virtual space, not an event. As a result, my question is: this proposal was placed in the wrong challenge.\r\nTherefore, based on the given information, I disagree that this proposal effectively addresses the challenge, I can rate it with a score of 2", "q0r": 2, "q1": "Team profile is provided and described enough for understanding, with suitable skill, experiences are suitable for implementation with external links for verifying. The budget is provided limitedly (only the total budget with the structure of 2 items). The roadmap is not clearly described and explained. Similarly, the risk is not provided.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "Team profile is provided and described enough for understanding with one external link for verifying, however, it is hard to verify feasibility through that link (https://ma-studio.cz/) because it is not written in English, and not any English button). The proposer should consider providing external links for each member and some similar works of creating virtual space for better understanding. The proposer should consider providing external links for each member and some similar works of creating virtual space for better understanding. The budget (>25% of the total challenge fund) is provided limitedly, only the total budget with the structure of 2 items, without further explanation (Somnium Space - XL parcel - $55,000, Architecture studio Space Verse - $5,000), my advice is adding an explanation for each item (calculation base,...). There is no risk is not provided. Some technical terms were not clarified (ex: \"buying XL parcel\",...).\r\nTherefore, based on the given information, I  disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "\r\nThis is a brilliant idea. The goals of the proposal are also in congruence with the challenge settings. Cardano community would be of benefit because it would increase participation amongst Cardano members.", "q0r": 4, "q1": "Per the qualifications of the team members, I believe they have the skills and experience needed to implement the proposal. The budget is well presented.\r\nHowever, the proposer or team should have outlined the possible risks/challenges involved in the implementation of the proposal.", "q1r": 4, "q2": "The proposer has outlined the roadmap and time horizon for the achievement of the proposal however the roadmap is not detailed enough. I can't see key metrics/KPIs that define the success of the proposal. Also milestones are not visible to identify. However, the proposer is able to clearly describe the targeted problem and its solution.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "Creating a Metaverse space for the Catalyst community will increase active participation in community events. Therefore I believe this project will have an impact. The proposed Metacenter would indeed provide an immersive and interactive experience of communication and networking for the Cardano community. ", "q0r": 4, "q1": "The proposer give an outline of the team and their experience, but no links to LinkedIn or any where else where their work and experience can be viewed or confirmed. This would add to the feasibility of the proposal. The implementation plan is a basic outline and needs a bit more detail. The budget is also set-out very brief. In order to convince voters and the community that this proposal will be feasible more details are needed around the budget, experience needed, and timeline as well as Key performance indicators.", "q1r": 3, "q2": "In order for the proposal to be Auditable, the proposer needs to indicate how the community will be able to track the progress of the project. Provide a better layout of KPI's. The timeline and roadmap is very basic.", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is not just a one-time community event. Instead, it is a metaverse which can be the center of many community events. This proposal absolutely addresses the Community Event challenge, and has the potentially to long-term support that. ", "q0r": 5, "q1": "The proposing team's experience is directly related to the goal of this proposal to have a Cardano Metaverse. While the plan is a simple high-level overview, one can go directly to their website to see what has been done at Somnium Space. There is also the team's project website linked. The team already hosts interactive services and demos on their site listed in the proposal.\r\nFor such a project, a better breakdown of a thoughtful budget would be beneficial.", "q1r": 4, "q2": "I was not able to find the proposer's listed set of metrics and KPIs for users to follow. However, to extrapolate for voters, i see these as the helpful indicators of success:\r\n1) Demo completion of MetaVerse on the Somnium site\r\n2) Launch of finalized MetaVerse\r\n3) Count of users and adoption and usage statistics.", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This proposal offers an interesting and thought-through project which aims to better connect the Cardano community. While giving details and seeming at an overall advanced stage, there are some elements which are not fully clear to an outsider: Will the center be in person (i.e., offline) or will it be a digital (i.e., online) space? If digital, how exactly will it be similar to an in-person meeting space? Does it in any way relate to the company metaverse (Facebook)? Why is a VIP lounge needed? How does having social media benefit the project?\r\nClarifying these questions for an outsider-audience which may not be familiar with these virtual places would benefit the otherwise very strong proposal.", "q0r": 3, "q1": "The proposal is backed by a team that brings experience and proficiency in complementing areas, and the project seems to be in an advanced stage already, thereby making successful implementation likely. ", "q1r": 5, "q2": "The progress is clearly explained through the timeline provided. Success KPIs could, however, be added, such as doing an evaluation with community members.", "q2r": 4, "assessor": "z_assessor_942", "no_vca": 20, "ne": 2, "ng": 15, "nfo": 3, "vca_o": 1}], "solution": "メタセンターは、メタバースにおけるカルダノコミュニティミーティングのための、優れた革新的な体験を提供するのに適したスペースです。", "experience": "-アーキテクチャー・スタジオ\n-3Dデザイナー\n-コミュニティ・メンバー\n-貯水池運営者\n-アドバイザー"}