{"id": 384813, "author": "busyguy1", "title": "The Cardano Classroom", "url": "https://cardano.ideascale.com/a/dtd/384813-48088", "category": 26234, "amount": 50000, "description": "早期教育では、経済的自立についてのカリキュラムが不足しており、ブロックチェーンについてはさらに不足しており、貧富の差が拡大しています。", "funded": 1, "upvotes": 32994165, "downvotes": 21933819, "votes_result": 11060346, "votes_cast": 291, "f6_no_assessments": 15, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "私の理解では、この提案は、ブロックチェーン技術とカルダノに関する知識を広めることを目的としていますが、教育プラットフォームを作成することで、若い年齢層に焦点を当てています。現在、若い世代の意識や知識を高めることに焦点を当てたプロジェクトはあまりありません。この提案は、非常にユニークな視点と目的を持っており、課題の概要を確実に捉えています。成長するコミュニティを教育することは常に優先事項であり、その問題を「種レベル」で解決し、そこからサブコミュニティを作る目的を持つことは、教師として、またコミュニティの参加者としての私の経験からも非常に価値があります。若い人たちをカルダノに取り込むだけでなく、その親や友人、知り合いにも情報や知識を広めることができるかもしれません。たとえ彼らがブロックチェーンの経験を持っているかどうかに関わらず。提案の詳細は、問題提起との強い関連性を持って明確に提示されています。これは、このプロジェクトがスローバーニングなものであり、長期的な投資であることを示しています（私もそう思います）。全体として、この提案が課題に効果的に対処していることに強く同意します。", "q0r": 5, "q1": "提案書には、一定の期間内に何を実現するのか、そのために何が必要なのかが明確に書かれています。重要なのは、提案者がFUND7で資金を得られても得られなくても、このプロジェクトを継続して発展させることを目指していることであり、長期的な決意とコミットメントを物語っている。ウェブサイトは公開されています（ただし、アクティブなプラットフォームはまだありませんが、ロードマップにはその時期が記載されています）。非常に短い期間で多くのことを行うことを意味しているため、予算配分がかなり大きく（チャレンジ予算全体の1/4）、最初の資金調達ラウンドとしては大きすぎるかもしれません。このプロジェクトでは、プラットフォームの中核となる部分（教育、カリキュラム、ビデオなど）に注力し、「没入型技術」などは後の資金調達にまわしたほうがいいのではないでしょうか？最初から完全に実現されたプロジェクトを立ち上げることの価値は理解していますが、教師としての私の経験からすると、資金獲得の可能性を高めるためには、最初の段階で中核となる教育コンテンツとそれに取り組む教師に焦点を当てた方が有益だったかもしれません。\r\n欲を言えば、このプロジェクトの制作者について、検証可能な情報や背景をもっと見たかった。中心となる制作者の教育学的な専門知識をさらに強化するために、LinkedInのプロフィールがあるといいかもしれない。リンクされているポッドキャストのインタビューでは、提案者の背景や知識についての情報があります。また、個人のLinkedInについても言及されていますが、それも含まれていません。\r\nチームには多くの技術的な専門知識が欠けているようですが、これは予算配分で考慮されています。このことは、詳細な計画に技術的または具体的な側面が含まれていない理由を説明しているのかもしれませんが、それは提案に含めることが有益だったはずです。\r\n この提案が成功する可能性が高いことに同意します。", "q1r": 4, "q2": "提案書には明確なロードマップがあり、時間枠も含まれています。最初は6ヶ月間という野心的な内容ですが、提案者はそれに続く時間の中でより多くのマイルストーンや目標があることを明確にしています。KPIや成功指標をもっと盛り込んだ方が、提案書としては有益だと思います。現在、提供されている情報は、オンボードのコミュニティや教育的なインタラクションに依存していますが、プロジェクトの成功と発展を測るための数字はありません。30～60人のベータテスト参加学生を目標とするという記述がありますが、これは成功の指標となります。\r\n予算の内訳は非常に明確に提示されていますが、推定労働時間に関しては、さらに詳細な情報が含まれていると良いと思います。例えば、厳選された教育者に8000ドルが割り当てられていますが、推定労働時間や教育者の数などが含まれていれば、さらに提案を強化することができます。提案者は、このプロジェクトの開発に伴うリスクと課題をきちんと理解しているようです。主に、コアチーム以外の教育者や技術開発者を雇う必要があることや、そのために教材の一貫性が失われる危険性について理解しています。また、先に述べたタイムフレームも課題の可能性として挙げられています。\r\n全体としては、この提案は、掲げられた目標の達成状況を評価するのに十分な情報を提供していると私は考えています。\r\n", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 19, "ne": 14, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The proposal addresses the goal of this challenge category to increase participation in Cardano Ecosystem. And it's quite interesting that this proposal specifically support early education for children. Really appreciate the thoughts to increase awareness about Cardano to the young teenager.", "q0r": 5, "q1": "Budget is clearly break down and the value requested is reasonable to make the project run. It would be great if the proposer could add LinkedIn account and give more track record that could convinced the community. Adding experienced team members will be required to make this project run properly. ", "q1r": 4, "q2": "Proposer included website link so the community could track the progress. Roadmap and milestones are also described in the proposal. It would be awesome if the proposer could include also key metrics so the community could measure the project output accordingly. ", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree to this proposal because ;\r\n1.The problem needed to be solve has been identified in the solution and has falling in scope with the challenge by creating Cardano Classrooms which is an interactive way for individuals to earn a career in decentralized finance with a jobs program.\r\n2. The proposal also shows clearly on how to add value to the cardano ecosystem by changing the way people do business, increase trust in societies, stimulate how people learn, and enable all with the tools to build a financially fruitful future.\r\n3. The key metrics of the proposal is been stated clealy and falling within the scope of the challenge and adress to solve future challenge because there would be continues training and  vedios to impact more knowledge into people..\r\n", "q0r": 5, "q1": "I strongly agree to the above proposal due to;\r\n1. the proposaer has provide accurate evidence, reference, link etc of relevant skills and experience needed to implement the proposal. And the links are sufficient.\r\n2. their level of competence is also good and how the team members are going to operate in manner as it's required to implement the proposal, proposer has locally laid out his team  structure that's his preteen daughters who are active in the space. And some gurus to come out with much experience.\r\n3. The IS budget is very reasonable to achieve the set goals.\r\n4. proposer has an additional plan if should incase addition funding will be needed for the implementation of the project as well. And also provides realistic timetable to complete the work.\r\n5. The proposer has provide a sensible and conductible plan for implimentation that shows not only what is going to be done but also how. proposer also ment mentioned of how to help most language accept English to learn or have some edeas to if project is been funded.\r\n", "q1r": 5, "q2": "I strongly agree becasue the properser has laid out road maps on how  every single step of the project can be audit. \r\n \r\nThere are accurate defined metrice/ KPI's that defines the success of this proposal and clearly given understanderble describtion of the targeted problem and clear understanderble solutions to address it.\r\n the proposaer has also plan to deal with the difficulty because looking at how to educate people on cryto and blockchain will help most people know more about it and plans are put in place for various outcomes to.\r\n", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 22, "ne": 7, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely Early education sorely lacks curriculum on financial independence, even less so on blockchain\r\n.\r\n \r\nIt is clear that this proposal does not fall within the scope of the challenge brief by the Cardano Classroom which  is an online interactive classroom \r\n\r\n \r\nThis proposal shows how it may add value to the Cardano system by creating and running an online interactive classroom \r\n \r\n  Key metrics have not been presented at all. \r\nIf i were to suggest metrics,  would be  number of participants,  number of episodes, number of views , number of graduates.\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\n\r\nThe key metrics and goals have not been given\r\n   \r\nProposal can be scaled up to address future challenges by adding more participants and episodes.\r\n\r\nThis project may have a positive impact on Cardano system by increasing the awareness of the community members.\r\n\r\nI cannot say that this proposal adequately addresses the challenge needs, as its more on education rather than Community building  hence i have given it a 2 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country. Also I am an educator , teaching English both online and in real life and am an ICF Coach in training.\r\n ", "q0r": 2, "q1": "\r\n \r\nThe proposers  have  not provided evidence  of themselves with their skills and experience in  building this classroom. In fact much of the expense is for external costs such as external gurus,platform creation and maintenance, hardware, video production equipment, Hiring educationists to build curriculum, hiring cardano developers to record videos, buying of VR software and hardware, Occulus quest devices, etc. Over 10% is going for branded merchandise and a further amount for social swag. They have also included a stakepool which is definitely not in the scope of this challenge. \r\n  \r\n The links are not sufficient. The main website cardanoclassroom.com is just an image on the domain home page. No links or anything has been given.  \r\n \r\nI have visited these links\r\n   \r\nThe proposers cannot be said to be experienced and competent to do the project since most of the work is done by external resources and the cost is exorbitantly high \r\n The type and number of team members required to implement the proposal is not stated.\r\n\r\nThe team structure isnt  listed and experienced.\r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\n The budget has been given in detail. It appears quite high and as stated above most of the costs are for external resources. \r\n\r\nI would suggest to scale down the project and build a few classes with lesser resources in a manner which you are able to do without so much dependence on large hardware and software purchases.\r\n\r\nThe budget is not reasonable to achieve the set goals. \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres no realistic timetable  to complete the work. There is a time table but i dont believe its realistic to complete all the stated work in 6 months.  \r\n \r\nThe proposal doesnt give  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly unlikely this proposal will be implemented successfully\r\n This proposal is detailed and budget is not reasonable hence I have given it a 1 star rating.   ", "q1r": 1, "q2": "\r\n \r\nThere is a roadmap with milestones  \r\n \r\n\r\n There are  no Metrics given by propose \r\n   \r\nThe problem has been understood and solution has been given broadly. My professional opinion is that it does not fit into the challenge goals.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties. \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the auditability of the budget remains in question, hence I have given it a  2 star rating.\r\n ", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 19, "ne": 4, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Although this is a beautiful idea, it is in the wrong Challenge for it seeks to create a platform that provides video education for the youth rather than initiating an event. This proposal in its current state does not fit in any particular Challenge. Though 'DApps and Integration' or 'Scale-UP Cardano's Community Hub' does a bit fit, especially if the proposer were to also create an accompanying DApps. The proposer can also attempt to issue their own Challenge for Fund 9 with the topic; Providing Educational Tools that are constructed based on proficiency levels. If it were to be forced assessed based on the Challenge settings, this proposal would just barely solve the problem of onboarding and integrating new people. Since it involves education, it is highly recommended the proposer to reach out to the Catalyst School and explore avenues of collaboration.", "q0r": 2, "q1": "There is no detailed experience provided. Of that is provided the experience is too vague and cannot be accounted for. No links are available also. This trend continues on to the team members. There is a notion that a certain individual with a particular skillset is needed, but who that individual is, is not stated. The budget asked does to an extent indicates the proposer has not been properly involved in the Project Catalyst process. Simply put, the proposer asks funding to create a platform from roughly zero. The funds will be used to create the platform; digitally and legally, to create the syllabus, to purchase hardware to create the syllabus, to purchase a lot in the VR space, to purchase the VR tool to access the VR space etc. This thought process is incorrect, for the Project Catalyst is not a fund to all-out purchase physical items for the proposers benefit. It is an empowerment tool, Project Catalyst to an extent is like a VC. And like a VC, when one does ask for funding they do not all-out ask to purchase various items without some form of validation for these purchases. Reckon this is purely due to having being still inexperienced in the Project Catalyst community. Again, highly reckon to reach out to Catalyst School and also to join the Project Catalyst Discord channel if they have not yet.", "q1r": 1, "q2": "Roadmap provided has an adjoining action plan but no specific milestones. There are also no measurable KPI's provided therefore auditing this proposal will be challenging, most specifically in term of deliverables effectiveness. Problem statement and solution is quite solid. If deliverables were to mention dApps and this proposal were to be in the 'DApps and Integration' Challenge, reckon the ratings would be more preferable. Please do submit again a proposal for Fund 8. Prior to that, please kindly go through the materials of Catalyst School, or even better participate in their workshops.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": " The idea is certainly interesting, I wonder what age the proposal is intended for. Is it intended for high school students in specific education, so that there is already a basic interest or is it intended for students in general, also non-economic fields? The danger is that students drop out if the content does not interest them or seems too difficult. I also wonder if the information is one-sided, just from Cardano's point of view. This cannot be the intention to include unilateral information in the curriculum of the students.", "q0r": 3, "q1": "I think the curriculum chapters are a strong point, they have been worked out and prove that there will be diverse information. Still, it does look like a commercial, I think it's better to see this separately from their education.\r\nI also doubt whether this can make the Cardano community bigger as the young people are still minors and unable to participate in the community.", "q1r": 3, "q2": "There is a roadmap, if you want to prepare a solid course you may spend more than 3-4 months on making it. Too little description of what success looks like, how many students do you want to reach, which milestones ensure this success and how are we going to check these to the goals?", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "An excellent and creative proposal to read, with the fact to help others in topics that are undervalued especially for the youth! Watched the video attached and a line resonated with me where he said \"If you didn't get into college, you'll never succeed in life\". I was a college dropout, and I have taught myself to improve things that I find curious the hard way. This proposal does not just address the key metrics for the challenge but empathize the human need of knowledge to find value in themselves. I believe this will bring such diverse community together and gaining alternative knowledge(which exists) that some are in need especially in times of struggle. Thus, I am giving this a 5. ", "q0r": 5, "q1": "The fact that the proposer even tackle the point of using Virtual Reality for students that have learning disabilities is a plus! I am somehow curious of how these videos will be. But as stated, the proposer have clearly given detailed goals, employees that will be hired, and challenges they will be facing, in addition of including multiple languages in the future! The timeline seems reasonable to me, and I'd love to see this one succeed.", "q1r": 5, "q2": "Roadmap is clearly underlined of what is to come, the budget allocation and breakdown are very detailed with the addition of the proposer's expansion of the project (using stake pool for funding & include Multilanguage content). A suggestion would be hiring a creative director that could advise on trending visuals on how to deliver the educational content! With that being said, the sample curriculum chapters are a cherry on top. Cheers!", "q2r": 5, "assessor": "z_assessor_669", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal involves opening an online platform about Cardano. The problem is very suitable for Challenge and quite interesting. The solution is clearly defined; building such an online class has an expected impact both in the short and long term to the Cardano Blockchain. My advice is: you should define the target group (ex: age,..) of this course.\r\nTherefore, I can agree with this proposal's impact and give 4 points.", "q0r": 4, "q1": "This proposal is about the education platform. This team's (consist of proposer and his daughter) profile is described briefly enough for understanding with skill, experiences are suitable for implementation but it is hard to verify this through the link provided (http://cardanoclassroom.com/). Youtube links show that the proposer has done some similar activities with acceptable quality (my subjective evaluation).  The requested budget (>20% of the challenge)  is provided with structures, however, for a better view and understanding, the proposer should consider grouping cost items and providing explanations of the calculation base for each item. The defined challenge (balancing the organization of content with multiple creators while keeping the consistency of variety in course preparation to accommodate the needs of different student needs) is logical but without mitigation/risk management; my advice is a well-designed template and framework could be a solution to this kind of risk, the proposer should consider this.\r\n\r\nTherefore, based on the given information, I agree with this proposal's feasibility and I would give a score of 4", "q1r": 4, "q2": "The team's profile is described with limited information and it is hard to clarify through the link provided (http://cardanoclassroom.com/).  Information related to Roadmap, Timeline is presented enough to understand, however, the requested budget (which is >20% of the challenge's fund) contains many unclear points, making it difficult for the community to monitor. (ex: What is the basis for calculating cost items?). My advice is: for better auditability, as mentioned, the proposer should consider grouping cost items and providing explanations of the calculation base for each item. Besides, KPIs should be provided.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability and give this proposal with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 16, "ne": 6, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The proposal definitely fit into the challenge because educating the youth to raise Cardano blockchain knowledge would help to widen Catalyst community and may remain sustainable. Besides, that educating also helps to increase human resource potential for Cardano ecosystem in future, it means the proposal will add value to the Cardano system. Moreover, the proposal could be scaled to the future challenge by increasing the translation of platform and videos into multiple languages. That will be helpful for the next generation around the world to get knowledge about Cardano. Therefore, I strongly agree the proposal is impactful.", "q0r": 5, "q1": "In my opinion, the proposal is likely to be successfully implemented. \r\nAs my reading, the proposal has 2 main parts: the educational platform and the educational materials. The platform should not be a big deal, and the teaching materials are not only about Cardano contents, but also integrate games or really interesting videos in the virtual classroom to keep learners engaged because the learners are pre-teenagers (I assume by the age of author's daughter he mentioned in the proposal). The authors make the plan very detailed and sensible. Both of the platform and educational contents are described understandable clearly what is being done as well as how to do (platform: in the description and in the budget broken down; the teaching contents: in the description and in sample curriculum which is suituable for pre-teen learners). Budget is broken down into items and timetable are ver tighly with a lot of work for the team, I assume. So that $50K is suituable and reasonable to achieve the set goals. I believe the team is going to make it successfully with their enthusiasm and the good plan. The challenge relevant to the successful implementation has been considered.\r\nI would recommend the author should add more information about the AGE of targeted audience.", "q1r": 5, "q2": "The progress of the proposal's implementation can be tracked in the website as the author mentions. I agree it is auditable. However, I recommend the milestone should be added in the roadmap to be audited much easier.", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 14, "ne": 2, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "As the aim of the proposal is to create Cardano classroom, this proposal fits into the challenge settings. The proposer has given an understanding as to how Cardano would benefit from the proposal. The distinction between the challenge and problem is clear.", "q0r": 4, "q1": "From information provided in the relevant experience section, I believe that the proposer has skills in implementing the proposal. The budget is well presented. The proposal has a conductible and reasonable plan for implementation.\r\nThe has done extra well for including possible challenges involved in the implementation of the proposal.", "q1r": 4, "q2": "The proposal has a clear and comprehensible roadmap and timeline for implementation. What is lacking are some key milestones and metrics/KPIs.\r\nThe targeted problem is clearly identified and described.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Teaching tomorrow's lead with the right content about Cardano and blockchain at a very early stage. The sample curriculum is great and covers a lot of essential topics. This is going to be an interesting proposal and good time teaching children. ", "q0r": 5, "q1": "The is practically from that team, this is not a new expedition but something that is ongoing starting with his children. The proposal has a detailed plan of activities and seeks to collaborate with other gurus in the catalyst community. I have no doubt this would be a success. There should be some award or badge to earn at various levels to incentivize active participation in lessons. ", "q1r": 4, "q2": "The proposal has onboard documentation of its activities. The website is open and transparent for easy auditing. The budget is well detailed to know activity-specific that would be carried out at each stage.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "Creating an educational portal around Cardano and Blockchain technologies will definitely bring more people into the Cardano community. The Proposal states that content will be fun and interesting and that professionals will be used in providing the content which is good. The Campain brief is all about growing the Catalyst community, but proposal does not elaborate on this part. I do believe it will have a positive impact on the Cardano/Catalyst ecosystem, but would have liked to see more detail on this, and key metrics around this.", "q0r": 4, "q1": "In order to increase feasibility of this proposal, more information are needed on the experience of the educators and gurus. If these persons are not identified yet, it would be good to note what kind of experts and gurus you are looking for and how many. What should their field of expertise be, and what they would teach. To be sure if the budget is in line, there need to be some information on what the average rates are (per hour for example) for these people so you can demonstrate that the budget is reasonable. ", "q1r": 3, "q2": "The proposal states that the website and all social media will keep them publicly accountable through the projects life cycles. It does not say how often these will be updated though, and specifically to the Catalyst Community. In you next proposal have more detail on how the Catalyst community will be able to track this project. The proposal needs more detailed Key performance indicators in order to be auditable.", "q2r": 3, "assessor": "z_assessor_795", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is great idea of basically onboarding new members from all works of life in easy, fun and educational platform. The proposal has a huge potential to bring new people into the cardona ecosystem and also project catalyst.", "q0r": 5, "q1": "The information provided as regards experience and qualifications to do this task seems vague but am consoled by the fact that there are plans to engage and collaborate educational experts within and outside project catalyst. This is a well coordinated plan and strategy from roadmaps to the budget implementation and the mention of the need to ask more funds in future funding cycle. However, I confess that this is a proposal that can not be completed within a single funding cycle and the budget estimate may be too high to funded at 25% of the campaign. I think the proposal should be structured at least with two funding cycle or more for better chance of being successfully funded at each stage of implementation.", "q1r": 3, "q2": "The proposal did not provide enough metrics to assess except that all activities including website benefits can be easily accessible and monitored.", "q2r": 3, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "Educational material, particularly for youth, is currently lacking in the global community. It is critically needed to foster world wide adoption of cryptocurrency and Cardano in particular. This project, if successful, could be a real asset to Cardano, as it reaches a community that is rarely focused on, but important. Also it has the potential to educate parents and children at the same time.", "q0r": 5, "q1": "The proposal is thoughtful and well developed. The outline is clear and has deliverables included. Most importantly, a feedback mechanism has been integrated into the program so that improvements can be made prior to release.", "q1r": 5, "q2": "Success will be determined by the release of a finished instructional series.", "q2r": 5, "assessor": "z_assessor_932", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The proposal has a great detail of related human, technical and finance resources to support the solution of the problem identified. ", "q0r": 4, "q1": "There is a good plan laid out to utilise the resources in working towards the goal. However I am not sure (or not clear) about how the classes be operated and maintained, resources wise,  after implementation.  I therefore settled for a neither agree not disagree.", "q1r": 3, "q2": "Given the amount of work involved, there should be a progress check and provision of measures of success of each milestone.  For example, number of responses to the ad. Unfortunately this seems to be lacking.", "q2r": 2, "assessor": "z_assessor_968", "no_vca": 25, "ne": 2, "ng": 14, "nfo": 9, "vca_o": 1}], "solution": "カルダノ教室は、教室や個人が、ジョブプログラムで分散型金融のキャリアを獲得するための、楽しくインタラクティブな方法です。", "experience": "私は自分の子どもたちにカルダノを教え続けていますし、この取り組みを支持するブロックチェーンや教育の専門家たちに囲まれています。"}