{"id": 382564, "author": "kareemb", "title": "SPO as anti-Climate Change vehicle", "url": "https://cardano.ideascale.com/a/dtd/382564-48088", "category": 26245, "amount": 20000, "description": "Le climat se réchauffe, les gouvernements et l'industrie n'agissent pas assez vite. Nous pouvons utiliser la structure SPO pour financer les crédits de séquestration du carbone.", "funded": 0, "upvotes": 16531562, "downvotes": 22782748, "votes_result": 6251186, "votes_cast": 121, "f6_no_assessments": 3, "f6_rating": 2.2222222222222223, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is innovative and Nobel. There are few existing stake pools with similar climate action objectives. My humble opinion is rather than starting a new pool the existing pools with such an aim can be grouped to create a unified fund to promote the concept would be better.", "q0r": 2, "q1": "The proposer claims to be a stake pool operator therefore he must be capable of carrying out this task. If he already has a stake pool then I see no reason for him to start a new pool to carry out the proposed activity. ", "q1r": 3, "q2": "The proposal is for running a stake pool that will \"purchase a share of high-quality Carbon Sequestering Credits, putting carbon back in the ground, and communicating the same to the community.\" There are significant gaps like where it will be put to the ground. Moreover, the issue of attracting delegators within 30 days with out Stake from the SPO is a major issue. There is also no clarity on how much the proposer is planning to stake in the pool and how much percentage will be contributing for Carbon credit. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 15, "ne": 0, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "Although the formation of a single SPO that is a \"Green\" consumer is good for the community, this proposal does not address the SPO community at large nor does it address bringing in more SPOs into the community.  A recommendation would be incorporate onboarding of other \"Green\" SPOs or creating an alliance with awareness of upcoming \"Green\" SPOs.  This will spur growth and awareness of the \"Green\" nature of the Cardano ecosystem in general.", "q0r": 3, "q1": "Although this proposal briefly mentions needed skills and roles needed for this SPO, it does not provide any evidence nor references that it has the needed team.  A recommendation would be to list specifically the qualifications of the team or a plan on how to fill those roles.\r\nThe budget is laid out in two line items and more detail would show understanding of what \"stakepool setup\" entails for $15k.  (e.g. How much is going into the initial stake, how much in equipment, labor, admin, etc.)", "q1r": 2, "q2": "This proposal has a 30 day milestone set, but no KPIs mentioned to measure efficiency nor effectiveness.  Consider adding targets for carbon credits, onboarded delegators, or partnerships with other SPOs in their \"Green\" journey.\r\nAnother recommendation is to layout a longer roadmap beyond the first 30 days.  (90 days to 6 months with targets)", "q2r": 3, "assessor": "z_assessor_674", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This project is about funding a SPO that will be powered by green purchased electricity, and that will buy carbon credits to contribute to the fight against climate change. \r\nThough Climate Change is indeed the fight of the century, the proposal does not define what will be the business model of this SPO, and what the success would look like. For example, I would recommend for a further application to add illustrations of the contribution to climate fight, depending on different hypothesis of amount of ADA delegated to the pool.\r\nI neither agree nor disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 3, "q1": "The proposer is not identified and show no evidence of experience as a stake pool operator or in Cardano's environment.\r\nUse of the funding is weakly described. The proposer suggests that part of the funding will be used for initial stake, which wouldn't even be a relevant/significant pledge if all the funding was used for this purpose.\r\nAs the proposer also does not give many details about risks and challenges to be taken, we cannot be confident that he will be able to effectively start this SPO business (which is not easy at all!).\r\n", "q1r": 1, "q2": "The proposer lists no Kpi and objectives for the \"climate fight\" part of the SPO business, and there is no clear definition of the success in creating this new SPO business opportunity. For this reason, the community will most likely not be able to assess the progress of the project, if funded.\r\nI recommend to the proposer to further detail how pool rewards will be allocated in the whole SPO business, and in particular what portion of it will be used for Carbon Credits buy and how.\r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 16, "ne": 3, "ng": 13, "nfo": 0, "vca_o": 1}], "solution": "1. Établir le pool de joueurs comme un consommateur d'électricité \"verte\" uniquement.\n2. % des récompenses à l'achat de crédits de séquestration du carbone de haute qualité.", "experience": "Entrepreneur, leader d'équipes. Développeur de projets de crédits carbone, opérateur de pools d'enjeux."}