{"id": 384926, "author": "cardanopoolpeek1", "title": "Fair Stake Pool Selection", "url": "https://cardano.ideascale.com/a/dtd/384926-48088", "category": 26245, "amount": 29500, "description": "De nombreux sites privilégient le classement par rapport à d'autres paramètres pour la sélection des piscines. Nous offrons à la communauté la possibilité d'une sélection plus équitable.", "funded": 1, "upvotes": 34871593, "downvotes": 27540606, "votes_result": 7330987, "votes_cast": 172, "f6_no_assessments": 5, "f6_rating": 3.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "In my opinion this proposal touch important problem about blockchain adoption and SPO's fundamental mission,  but It isn't clearly articulates how it will add value to the Cardano ecosystem and for the stakeholders (in deep detail for users, dlegatos and so on.. ). However the objective of the proposal is very interesting but not well descripted in the solution.", "q0r": 3, "q1": "Seems that the proposal team is skilled and have a technical knowledge and expertise on the Cardano blockchain and SPO's activities and managing. In relation to the possible success of the initiative, there are poor indications related to deliverables, milestone, planning, neither about the developers adoption. Further I think it's important to improve details about the deliverables and the benefits for the community, so there isn't information to assess correctly and voting the proposal.", "q1r": 3, "q2": "The proposer doesn't provides a step-by-step plan for the research development with clear milestones and a defined time horizon, so what is the plan forward and roadmap? In my opinion it's not clear and well detailed what exactly is the problem statement and value of the solution to scale-up developers learning. The proposal doesn't offers a realistic timetable to complete the work. The proposer has not considered challenges and risks relevant to a successful adoption.", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 27, "ne": 3, "ng": 12, "nfo": 12, "vca_o": 1, "reply": "Alignment – Extract of points\n•    How will this provide value to users/stakeholders? *Response - We provide value to SPO’s that are struggling to gain delegation by providing users an alternative to metrics that continue to benefit the early adopter and large bag holders. Alternative sites using these metrics that continue to push large & multi-pools higher and higher whilst the little pools suffer. We provide a user the opportunity to use a community tool that randomly displays pools in our pool search as often many new users have often picked pools on the main page due to the metric previously described and again benefit those that already ahead. \n\n•    No description of how we achieve fair selection process.? *Response – When a user uses our pool search tool on site all current pools are randomly displayed instead of metric based that only helps the large/multi-pools already minting. We need to push delegation to the edges. We also provide a pool selection wizard on website & mobile site to allow users to select pools by search criteria of their choice.\n\nFeasibility – Extract of points\n•    Lack of deliverables, milestones need improved. *Response – Our proposal provides a roadmap with dates and key deliverables, whilst not weighing down the proposal with technical facts & possible novel features.\n\nAuditability – Extract of points\n•    No step-by-step plan of research & development. *Response – We will liaise with user base and provide new tools and features to help provide a better experience. Our community research and then development based on their ideas and suggestions.\n•    No realistic timetable. *Response – Disagree as we have a fully operation website & mobile site for over a year. We completed this well within the first 6months time frame and feel the 12 months we have stated is sufficient.\n•    What are the challenges, risks that may be relevant? *Response – Challenges will be to continue to improve and keep users coming to site, but with the funds we have requested to go towards marketing solutions this will work co-operatively with the features being developed."}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities are for democratic and economic empowerment, which also applies to decentralized and partially mission-driven stakepools, especially regarding the economic part. This knowledge and my knowledge about mission driven stakepools enables me to provide valuable insights for this challenge. The proposal identifies a serious problem within the challenge which needs to be solved; the propblem that big stakepools have it much easier to obtain a lot of staking users while small pools are often abandoned due to their low saturation - a fact ultimately leading to the opposite of the decentralisation aspect vital to Cardanos mission. This makes it also very clear that this proposal will add value to the Cardano ecosystem and Cardanos mission.\r\nHence, the goals of the proposal align very well with the outlined challenge settings.\r\nThe proposal is able to scale to address future challenges and further foster the decentralisation aspect of the Cardano ecosystem.", "q0r": 5, "q1": "The proposers are well-known in the Catalyst community and are competent and up to the task. They have already successfully delivered to other proposals and have shown that they are trustworthy and their proposals are deliverable. The proposer knows and is transparent the type and number of team members that will be used to implement the proposal.\r\nThe budget is outlined clearly and broken down into identifiable items that are reasonable to achieve the set goals. The timetable of the proposal seems reasonable and conductible. The resources required are defined and the proposal seems conductible. Technical details however are not gone into any deeper other than the infrastructure requirements.\r\nNo plan regarding the requirement for additional funding or analysis of potential risks and hurdles are done. Feedback: Overall the concrete implementation plan is a bit short and could be more detailed. I am only still giving you such a good rating in this category because you have already successfully delivered things in the past. I'd suggest you furmulate something a bit more detailed in future proposals however.", "q1r": 4, "q2": "A roadmap with milestones and a time horizon for achievement is delivered. The Metrics/KPIs that define the success of the proposal could however be more explicit, concrete and detailed.\r\nA Clear understandable description of the targeted problem.\r\nA comprehensive solution is provided.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 17, "ne": 4, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "This proposal indeed presents new opportunities for stake pool operators, especially smaller ones who don't have a social presence or a large pledge to their pool already, and effectively addresses the challenge of this category.\r\n\r\nI'm not exactly sure why this proposal requires bare metal server, if it is for decentralisation then I may stand corrected.\r\n\r\nI would like the team to clarify how they are going to convince people to use this tool, and spread the word about it!", "q0r": 3, "q1": "It isn't entirely clear to me how users will find out about this tool and why they would use it over listening to their favorite youtube/twitter influencer. Social media influencers have tons of power and people who aren't intimately involved in the community and don't understand WHY single stake pool operators are crucial to our decentralised ecosystem.\r\n\r\nThat being said, I have no doubt the product itself will be successful as the team has already got a working website that allows users to explore stakepools, but the above is a concern to me, not that I don't appreciate what the team is proposing and appreciate the effort.", "q1r": 4, "q2": "The proposal as written I believe has enough information to be successfully audited and determine if it was successful or not. However the roadmap is a little vague and I would like more information than \"update exciting capabilities\" among other points that are lacking of specifics.\r\n\r\nI would like to see more information about exactly what is happening at each milestone with more specific KPIs at 3 and 6 month milestones and I could rate it more highly!", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 15, "ne": 0, "ng": 14, "nfo": 1, "vca_o": 1, "reply": "Alignment – Extract of points\n•    Why bare metal server, Is it for decentralization? *Response – Yes decentralization is key whilst providing a cloud backup as resilience. Therefore, we have specified these as key cost points with approx.25% of our budget. \n\n•    How can we convince people to use this tool? *Response – We were the first to bring community tools like the metric review of the Sundae Swap ISO stake pools which has provided us with a steady increase of user base. Through new tools and metrics, we can continue to add and expand whilst keeping the site relevant and up to date. \nFeasibility – Extract of points\n•    How & why users will find this tool and user over favorite youtube/influencers? *Response – We have set a budget for the marketing/user’s solution to help market the pool on their favorite youtuber/influencers. As SPO’s we are constantly with our fingers on the pulse of what is happening on Cardano and with a team of 3 we can cover more ground. We are always reaching out to users for their thoughts and opinions on our social media channels to best meet their needs. \n\nAuditability – Extract of points\n•    Roadmap is a little vague, more info required. *Response – We have provided a vague outline as we like to have the ability to explore all avenues and not restrict the growth to pre-determined tools that maybe irrelevant in a few weeks’ time. As Cardano continues to grow rapidly and new products launching, we need to be able to be flexible and able to adapt to keep up. Our roadmap will continue to evolve through the weeks and months flowing with Cardano’s movements."}, {"q0": "Although the problem this proposal trying to solve is impactful for todays Stake Pool distribution system, it fails to further explain and clearly articulates on how it will ad more value to the Cardano ecosystem. I suggest to at least provide an example: a hardworking pool that provides value and mission, but struggled to get delegations stake fund because of this said unfair system in delegation pool.", "q0r": 2, "q1": "This proposal provide the working website, and the team that will be working on this. However, there are still a lot of missing details. Such as: the team experience profile, the budgeting details, the roadmap is still vague and still broad, and there's no sufficient explanation on technical details on how-to. Overall, this is not a well written proposal because of missing details.", "q1r": 1, "q2": "Only words on what they will do and trying to achieve given a specified month time, without providing any link or resource / media that we could track their progress other than their website. Lack of metrics and KPIs detail, as well as a well and clear understandable description regarding the problem they are trying to solve.", "q2r": 1, "assessor": "z_assessor_640", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1, "reply": "Alignment – Extract of points\n•    Further explain & clearly articulate how it will add value. *Response – We provide value to SPO’s that are struggling to gain delegation by providing users an alternative to metrics that continue to benefit the early adopter and large bag holders. Alternative sites using these metrics that continue to push large & multi-pools higher and higher whilst the little pools suffer. We provide a user the opportunity to use a community tool that randomly displays pools in our pool search as often many new users have often picked pools on the main page due to the metric previously described and again benefit those that already ahead.\n\nFeasibility – Extract of points\n•    Team experience, profile. *Response – We have provided information regarding the team. We are all SPO’s running separate stake pools for the network. Our main software engineer/architectural specialist Paddy from Shamrock pool will champion the proposal and control all funds. Our team details are: - \n@PoolShamrock, https://shamrock-pool.com/\n@BraveHeart, https://www.braveheartstakepool.com/\n@M1Crypto1, https://m1crypto.co/home\n•    Budgeting & roadmap. *Response – We feel we have provided a basic breakdown of costs and distribution of funds between each item. As Cardano continues to grow rapidly and new products launching, we need to be able to be flexible and able to adapt to keep up. Our roadmap will continue to evolve through the weeks and months flowing with Cardano’s movements.\n\n•    Technical details of how-to? *Response – We have a full public Poolpeek.com github account that is easy to find and we want everyone to know you are more than welcome to view. GitHub - ShamrockPool/PoolPeek.github.io\n\nAuditability – Extract of points\n•    Trackable methods of progress? *Response – All additions to website will be viewable and trackable along with update on public Github page. \n\n•    Lack of metrics & KPI details. *Response – We have provided a vague outline as we want to have the ability to explore all avenues and not restrict the growth to pre-determined tools that maybe irrelevant in a few weeks’ time. For example we were the first to provide a metrics tool to view the SundaeSwap ISO stake pools and their delegation, but these sort of tools can be short lived only lasting 1-2months and if we are preoccupied with something then we miss out on giving the community what they need at that period. "}, {"q0": "- Cardano SPOs are the backbone of what Cardano runs on.  Decentralization is what separate us as blockchain from others. So this is very important.\r\n- Most small pools cannot produce blocks, so delegators wouldn't select them.  The current stake pool setup is favorable to operators who has massive financial resources to start with. Small pool operators are discouraged from participating in securing the network. This results in an increasingly centralized blockchain.\r\n- This proposal suggests \"random sort order pools as a default for our lists\".\r\n- Would love to know where delegator starts to interact with poolpeek. Would it be from existing wallet such as yoroi upon clicking \"Delegation\"? Is so, how would you plan about lobbying emurgo to change from adapools to poolpeek? Or would you plan to be the partner for the up coming light wallet from IOG?\r\n- Please explain the criterias which small stake pool will be listed before/above the bigger stake pools.", "q0r": 5, "q1": "- Already has a working prototype, it is a matter of procuring new equipments as requested in the proposal. And also the criteria which leads delegators to prefer maller pools to big pools.\r\n- The criteria which the stake pool would displayed/selected to the delegator is absent. Most delegators who understand staking would naturally look for the most ROA.  How do you plan about a criteria which \"provide the community the option of fairer selection\"?\r\n- Or if you have other plans where delegators would come in contact with your site differently than through a wallet? Please detail them. Would love to know more.", "q1r": 4, "q2": "- The roadmap and metrics are measurable and sensible.\r\n- I would also add, after 6 months of implementation, the number of delegations in comparison of smaller pools to higher pools based through the link direction of your site. This can actually audit how much your site has helped decentralization.\r\n- For example. The total number of new ada delegations for epoch 350 is 10,000,000 Ada. Of which 50% (5,000,000 Ada) of them are delegated to saturated or near saturated pools. 50% (5,000,000 Ada) are delegated to pools with less than 12m ada.\r\nThat would be a massive sucess and actually encourage decentralization instead of the current big pools accumulating all the Ada.", "q2r": 4, "assessor": "z_assessor_985", "no_vca": 28, "ne": 14, "ng": 14, "nfo": 0, "vca_o": 1, "reply": "First thank you for your comments as you are the first real review that has seen the needs for such tools and the hard work the team have put into providing the community with a free to use tool.\nAlignment – Extract of points\n•    To know where delegators start to interact with PoolPeek. *Response – We are on different social media platforms and try to catch the attention of new delegators before they choose their first pool. We also find that a lot of users are those that have been in the space for a few months having gained enough knowledge to start to understand the need to support small pools and decentralization. These are normally through word of mouth or direct contact through social media platforms. Some of the funding will be used to expand and reach users through youtube/influencers and creating our own youtube channel. \n\n•    Partnership plans. *Response – We have now integrated the Nami wallet feature and users can stake directly from the PoolPeek website. We are in discussions with other new community wallets and keeping our eyes peeled for other possible partnerships with up-and-coming projects.\n\nFeasibility – Extract of points\n•    How the option of fairer selection can be achieved? *Response – When a user uses our pool search tool on site all current pools are randomly displayed instead of metric based that only helps the large/multi-pools already minting. We also provide a pool selection wizard on website & mobile site to allow users to select pools by search criteria of their choice rather than table of pools minting the most blocks, we provide a map search feature where users can select pools by their location, thus helping push delegation to the edges and decentralizing the network. \n\n•    Plans where delegators come in Contact with site other than wallets. *Response – We have completed a selection tool that lists all pools participating in SundaeSwap ISO. This allows users to find the associated pools search and quickly find what ones are single or multi-pools or saturated with other metrics. We have also just completed something similar with the project HoskyToken. These projects bring a lot of user base to the site to follow their projects. We already have a few more ready to launch once the projects near their launches. We have many other ideas that we are quietly working on in the background. \n\nAuditability – Extract of points\n\n•    Implementation of user delegation for comparison. *Response – We are working on providing a user login to monitor pool selection and metrics to determine the impact or benefits to pools as mentioned. We are also exploring other ways to review our impact to better help spread delegation amongst more pools."}], "solution": "Chez PoolPeek.com, nous pensons que toutes les piscines devraient avoir une chance de se battre. C'est pourquoi nous trions les piscines par ordre aléatoire par défaut dans nos listes.", "experience": "Shamrock Pool - Ingénieur/architecte logiciel, 12 ans\nM1Eagle - Développeur mobile, 10 ans et plus\nBraveHeart - Ingénieur en conception électrique, 10 ans"}