{"id": 380930, "author": "torben", "title": "Trustful Global Projects", "url": "https://cardano.ideascale.com/a/dtd/380930-48088", "category": 26240, "amount": 80100, "description": "开发商和客户希望成功合作，但在国际上达成协议或付款是复杂的。", "funded": 1, "upvotes": 26222273, "downvotes": 19472003, "votes_result": 6750270, "votes_cast": 157, "f6_no_assessments": 7, "f6_rating": 3.6666666666666674, "videos": [], "media": [], "f6_assessments": [{"q0": "我想祝贺作者的这份提案，除了非常符合挑战赛的目标外，它写得非常好，信息是以它应该有的方式提供的：直接、简洁和清晰。该提案非常适合挑战赛，因为它试图创建一个平台，在Cardano区块链中登记关于项目执行的一系列信息，正如作者所引述的：\"软件规范、项目范围、项目时间表 \"等。这非常符合我们在挑战中所寻求的，对于那些无法聘请外部中介机构为其项目工作的人来说，这肯定会增加交易的可靠性，作者非常好地论证了创建这样一个产品的重要性。通常情况下，那些想要运行项目的人由于对所提出的内容缺乏信心而不去做，而开发者也会对所承诺的付款感到不安全。这些和其他许多细节确实阻碍了一些项目的成功，所以填补这些空白不仅会增加我们区块链的价值，而且会增加涉及Cardano宇宙各种实例的项目数量。作者通过话题非常清楚地说明了他对这个平台发展的目标，以综合和加强整个提案第一部分所解释的内容，并与挑战中所要求的内容完全一致。除此以外，在这些过程结束时，仍然会产生NFT，为提案增加更多价值。", "q0r": 5, "q1": "当然，这个项目是在良好的手中，尤其是因为它在这里得到了完美的呈现和描述。我们知道主要作者的专业领域，也知道组成团队的其他组成部分，然而，如果能更详细地介绍他们每一个人，那将是有益的，因为我们所拥有的只是和他们的名字和职能。知道他们以前的经验是什么，他们已经做过的项目的例子，他们在这个领域的时间有多长，等等，这可以通过每个团队成员的短文来告诉大家，甚至可以附上他们的Linkedin简介。关于将做什么，做多久，按什么顺序做，我们得到的是分成几个月，以及在这些时间段内将执行的主要任务，但由于这是一个非常广泛和复杂的项目，这些步骤还必须更加详细。例如，我想到了这个项目的营销方式，它是一个非常好的产品，充满了潜力，但是它如何进入到开发者的知识中？又将如何介绍其使用的优势？这里没有解释披露的部分，我错过了，除了详细说明提到的任务外。同样，如果能更详细地说明融资资金如何使用，那也是积极的，我们确实有用于某些目的的资金明细，但作者可以更清楚地说明每一项会如何发生。我再举出营销部分，这4300美元将如何应用？拟与之合作的人的工资，加上在任何渠道的付费广告，如果是这样，是哪一个？", "q1r": 3, "q2": "对我来说，这是提案中最值得期待的部分。这个项目非常庞大和复杂，因此需要持续和密切的监测。有很多活动在进行，而且时间很长，我们已经大致知道，每个月过去后，每件事情会发生什么意图。因此，例如，可以决定与一些在技术上有能力监测项目进展的社区成员举行定期会议，以核实一切都在按照承诺和预定期限内完成。而如果没有，则检测出缺陷，并集体设计出解决方法。此外，对团队来说，循序渐进地展示结果是有益的，也就是说，如果在几个月内显示数据，并解释项目的确切现状。值得肯定的是，作者确定了他的用户意向，从9到12个月有200个固定的开发人员使用该工具，当项目已经顺利进行时，有1000个，这是一个衡量成功的方法。我认为另一种方法是实现有多少与ID Atala Prism的联系会因为这个项目而产生，这样就可以从另一个角度监测这个工具被采纳的成功程度。", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Excellent proposal regarding a much-needed application.  Blockchain technology holds much promise but proper interfacing with existing legal and contractual frameworks is an important infrastructural need.  The proposes describe a system that would allow developers and entrepreneurs to find matches and complete contracts in a seamless manner.  Successful execution would strengthen the Cardano ecosystem development environment.", "q0r": 5, "q1": "This is a challenging proposal with many difficult components.  The proposers have clearly described how they will approach the development of the project but even if well executed there may be challenges which are difficult to overcome in the first year.  Nevertheless, this is a worthwhile endeavor to support.", "q1r": 4, "q2": "The team has articulated specific goals for 6, 9, 12 months and beyond.  The team and budget are well described so there is a clear expectation of who will be working on the project and what their responsibilities are for succcess.", "q2r": 5, "assessor": "z_assessor_145", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": " The idea is not specific for Cardano and can be generalized for any decentralized activity. the software proposed to be built will enable developers and proposers to work in a trust-less environment. The dispute resolution mechanism needs more clarity. If there is a dispute regarding the completion of work. How will the system handles the issue will determine the success of the system. However, the proposal is addressing an important challenge in this ecosystem. ", "q0r": 4, "q1": "The team claims more than ten years of software and blockchain development experience. The idea has been clearly articulated and feasible. There will be a  requirement for a set of smart contracts for performing the role of intermediaries. The requirement of oracles authenticating status update and compliance to specification to work do need clarification. However, the team seems to have enough capability in overcoming the problem. References to past work would have added immense help for evaluating the proposal. decentralized environment. ", "q1r": 5, "q2": "The proposal includes detailed timelines and budget breakup. The work to be done is clear and can be measured in a quantitative manner. The end state is also clear. The project can be audited and successes can be easily measured.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "This is one of the necessary ideas to help develop the Cardano ecosystem. It will protect the benefit of both developers and product owners to the successful product that both want to get. This idea will not just be for Cardano ecosystem only but also worldwide because of its crises that happens every day on traditional platforms. Hence, this idea will drive a lot of user to join and bring a big effect on Cardano ecosystem. Their goals also can promise about that impact. ", "q0r": 5, "q1": "The team has a very detailed roadmap that divides into 2 phases of implementing their plan, and all the detailed broken-down budget is reasonable for that plan. We can visualize their roadmap through \"Goals\" session in the proposal, and all are clear with the activities and numbers. \r\nHence, the budget they require is fitted with that timeline and be detailed in the field of activities. \r\nThe only thing I advise them is that they should give more info about the team members and some risks that they are aware to control. It will help Catalyst make a high assessment of their plan. ", "q1r": 4, "q2": "The team has enough roadmap detail and key metrics that help to audit this project easily. \r\nThey also have a well aware about the problem context and make a better solution by time to help improve Catalyst development. And that is very easy to understand what they gonna do. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal to help create an environment that connects dapp developers with their customers is an encouraging idea. This helps to accelerate the application of dapps by customers, reduce the cost of advertising projects to customers, and this communication skill is not good for every project or has a professional team. .", "q0r": 4, "q1": "A good idea needs a detailed plan and strategy to make it work, which is what complements your proposal. Having a more detailed plan, a strategy to attract the free community as well as organizations in need should be done properly from the beginning. In addition, you need to have clearer KPIs for each stage that show the feasibility and persuasiveness of the project.", "q1r": 3, "q2": "I see a good profile of the team member, however it is recommended to add the member's public information through the profile: Github, Linkedin or related certificates. In addition, you should officially announce the youtube channel or website so that the community can comment, as well as check the project progress.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This is a good idea that could add value and positive impact to the Cardano ecosystem if it comes to life. It's good to have a platform that will connect customers and developers. The plan is described in detail and could have a global impact because that was the idea from the beginning, connecting clients and developers around the world. Again it can operate at the local level ass well, there is no concept.", "q0r": 3, "q1": "The plan is well made, described, but it is not clear when the whole idea will start with realization and when it will be finished in terms of Q1 2022 or Q2 2022 and so on. The plan is divided by months but in my opinion does not give 100% certainty that it will be executed. Although it was suggested in the comments to provide information about the team for some reason that did not happen which further raises my suspicions. It is not clear that the team really exists because they didn't provide any links of LinkedIn or Github page.", "q1r": 1, "q2": "Due to the poorly set roadmap with dates, my opinion it is very difficult to follow the progress of this idea. The amount of money required given that we have no real insight into the team behind this idea i think is exaggerated. If we consider that the budget for this Catayst F7 is $250,000. The suggestion in the comments was that the funds should be brake up and that funds should be reqested in the upcoming Catalysts, but for some reason the suggestion was not taken in consediration. KPIs are missing in this proposal!", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal has great idea about connecting the customers and developers. It helps developers having job and customer find what they need and save time. I would like to see more attractive ideas to attract more users in the first stage of the project. ", "q0r": 3, "q1": "In my opinion, the proposal mentions about ways to increase users, but not give a detailed marketing plan to attract freelance developers in the first stage. Therefore, some clear system or procedures should be considered to make this proposal effective and raise prestige. ", "q1r": 3, "q2": "The proposal gives a clear roadmap and goals. However, it should list out the number of developers and customers participating in the platform which makes it easier for auditing. Also, the proposal should give a more detailed background of the core team by putting Linkedin, Github or any related sources for gaining trust. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "为自动、防篡改和验证的合同执行提供一个平台（支付、里程碑、法律）。在各方之间建立信任", "experience": "10年以上软件开发，5年以上企业家，Plutus和Atala先锋，区块链开发者"}