{"id": 381267, "author": "joxnow", "title": "PRToken", "url": "https://cardano.ideascale.com/a/dtd/381267-48088", "category": 26240, "amount": 28000, "description": "作为一个开发者，我们花了很多时间为开源项目做贡献，同时我们希望以任何形式的代币得到激励。", "funded": 0, "upvotes": 14833809, "downvotes": 16244022, "votes_result": 1410213, "votes_cast": 134, "f6_no_assessments": 6, "f6_rating": 2.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal has immense potential to support freelance open source developers who have a passion for coding. This is a core problem for open source. Even though open-source contributors are not looking for money, an incentive for their work will enable them to concentrate more on their core competence which will benefit society. This proposal, if delivered in total, has the potential for a large adaptation. ", "q0r": 5, "q1": "The proposer has already developed MVP which demonstrates the concept. There is a clear aim in this proposal to improve up the status and integration with the successful Nami wallet. This is likely to be an important feature. With these credentials, it is very likely that the project will be successful. Given the experience and plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "The proposal has requested 3000USD per month for the development of the project which is a very reasonable amount. However, the 5000 USD for stickers and 5000 USD for marketing are not very clear. The proposal also needs clarity on the need for six months to develop two features. More information on code visibility can also help a lot. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "I think this proposal can't solve the problem you gave above. The proposal really can't explain clearly and exactly how you will do it. The team can't solve it either. future problems with the proposed proposal. I'm sorry I can't agree with you on how this will work. I hope you'll look into it in more detail next time.", "q0r": 1, "q1": "The proposed group did not specify what your experience is and also forgot to disclose who the members of the proposal writing team include. What will you do to implement the above proposal? I wonder about this. Ask the writing team to propose a reconsideration and I hope you will present a more complete proposal next quarter.", "q1r": 1, "q2": "I am quite sorry that you have not provided enough information about the project. such as implementation roadmap, indicators indicate the full success of this project. this seems to be a big minus point. for you guys.hope the next time the group will propose more complete information.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "It's fair to developers to be incentivized for their work of contributing to open source projects and I think this idea is reasonable to be developed. It's related to their previous proposal in the fund5, but I think they should provide more info, even the same as the previous because it can make misunderstanding about what they want to do in the scope of this proposal. And of course, they have to clear the specific part for this project instead of just telling the general info. \r\nParticularly, in this proposal, I don't see any info that show this proposal will impact the Cardano ecosystem or not, so confused when based on the old proposal in fund 5", "q0r": 1, "q1": "Even this is a part of the past proposal, The team should provide more detail about the implementation plan for this scope than just a few words about features and outline what needs to do.  For getting a high assessment on feasibility the team must show how good their ability on implementing the project is. \r\nGood thing is that the team provided their MVP form fund 5. But for, they lack a detailed roadmap that help CA/ vCA assess whether the required budget is reasonable or not, I rate for 1.  \r\n", "q1r": 1, "q2": "We can't audit this proposal because there is nothing for it. As a team that funded in the past fund, they must know that the team has to report regularly to Catalyst their progress, hence, the team must provide a roadmap and key metrics for CA/ vCA assesses that are available to audit this project. And the key metrics must be aligned with the challenge given as first, they don't have it, too. \r\n\r\nOne more thing is the team must describe how they are aware of the problem context by detailed explaining it, then detailing the solution that must address those problems. If not, it will be hard for everyone to understand what the team wants to do and is it helpful or not. This means the proposal can get a low scoring in all three-part: impact, feasibility, auditability.", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Based on the info of the related proposal to this proposal, they're both in the same project and I think this project will inspire to develop the Cardano ecosystem a lot.\r\nUnfortunately, the proposer doesn't have any info in this proposal to show that it will bring some value to the Cardano ecosystem. Moreover, the proposer also doesn't provide any key metrics for this project. \r\n", "q0r": 3, "q1": "he proposer did not show enough things in this proposal for assessing its feasibility. He has a detailed explanation about what needs to do but lacks a roadmap. \r\nEven this proposal relates to the last one but I think the proposer should provide enough info to clarify which part belongs to this proposal and help everything make sense to fund. \r\n", "q1r": 2, "q2": "The proposer does not provide enough info that's sufficient to audit the progress and the success of this project. He has no roadmap and key metrics, that's the basic things for auditing the project. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This proposal focuses on a SAAS platform that allows any Github repository owners to incentivize their contributors for approved Pull Request(PR). The problem statement is quite convincing, but not explained in detail. However, the solution was described enough for understanding [with 2 main features and budget breakdown], showing potential impact in some certain aspects on the Cardano Blockchain as a whole, and open-source projects' developer in particular. Based on the given information, I agree with this proposal's impact, and would give it a score of 4", "q0r": 4, "q1": "This idea for open-source projects' developers is convincing but the plan not, since the plan is not detailed [without proposer/team's profile, no goal, no roadmap, no KPI/metric,...] as a result, proof of feasibility can not be found through this plan. Therefore, based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "Because this proposal lacks important components of information [no team/proposer's profile, no goal, no roadmap, no KPI/metric, no budget explanation for each item,... auditability can not be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "Tokenising open source contributions is a real need in the developer community. It would also be a very good way to introduce developers who are not necessarily directly interested in blockchain or Cardano to its features and capabilities.\r\nThis is where I see the main impact of this proposal coming from, and it could be an important one for the future of the ecosystem.", "q0r": 4, "q1": "Given that the team has already successfully completed the first part of the project and the results look very promising on the surface I don't foresee any substantial risk to the expansion of the project.\r\nI would have liked to see a more detailed description of the team behind the project, but since we are dealing with previously funded proposers who are already in the Catalyst auditing process the risk is minimal.\r\nThe budget seems a bit low, but might be just right, depending on the location of the team.\r\nI appreciate the fact that the team is thinking of marketing and has allocated a part of the budget to that - there isn't much point in building great dapps on Cardano if no one uses them because no one hears about them.", "q1r": 5, "q2": "I would suggest the inclusion of a clear roadmap, KPIs, and expected completion/launch date and detailed definitions of success in future proposals by the team. The objectives of the proposal are pretty clear and the budget is largely broken down, but the proposal is missing quite a few details that would enable a smoother, less subjective, auditing process.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 13, "ne": 3, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "一个SAAS平台，允许任何Github仓库的所有者激励他们的贡献者批准Pull Request（PR）。", "experience": "开发商"}