{"id": 384895, "author": "dokurizi.sam", "title": "Dokurizi - decentralised journalism", "url": "https://cardano.ideascale.com/a/dtd/384895-48088", "category": 26240, "amount": 120000, "description": "良好的新闻报道已经被社交媒体上的 \"快速内容\"、严格的审查制度和不断下降的订阅数量所扰乱和打击。", "funded": 0, "upvotes": 17440890, "downvotes": 16855474, "votes_result": 585416, "votes_cast": 165, "f6_no_assessments": 3, "f6_rating": 2.5555555555555554, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=20785"], "media": [], "f6_assessments": [{"q0": "Little details on how this project will do this. Although I myself am a former journalist and see great value in this project if it were further along on providing more details.", "q0r": 2, "q1": "The YouTube link provided does provide more information about the project, but there was noise in the audio recording and a lack of production value in the video.", "q1r": 3, "q2": "This project is asking for a lot of money, but provides little details on how it would be spent and how success is qualified. I do see great value in a project like this for journalism needs to be decentralized, especially in countries where the freedoms of press is not prominent.", "q2r": 3, "assessor": "z_assessor_363", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The proposal states a problem wich is real since the media tends to concentrate and does not reward the autors. Through the idea to publish the articles as NFTs it offers a clear solution. Anyhow it could me a litte more detailed about the metrics on which succes is measured", "q0r": 4, "q1": "The proposer states that he is a former journalist who built two successful media start-ups(exited 2019). More details about former work experience would help to asses the proposal even better. He provided a roadmap which could be more detailed as well for example the several steps could be broken down in different parts. Also it could be explained how the funds are exactly used e.g. through providing a clear budget.", "q1r": 3, "q2": " It is hard to asses since possible challenges aren't considered and in overall the availiability of informations is kept quite short.", "q2r": 2, "assessor": "z_assessor_41", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "I think this is an interesting and impactful idea. Imagine that you can buy journalism works that are meaningful to you as NFTs to support journalists. If honest and high-quality journalism can become a market in itself, selling and re-selling, and breaking the loop of attention-seeking commercial media. This might be game-changing, helping our society and media to become more humane. ", "q0r": 4, "q1": "It's a strong plus to know that the proposer has a background in journalism, media startup, and teaching journalism. However, it would build much more trust if the proposer can link us to references and evidence of his works, maybe via LinkedIn profiles or reference links.\r\n\r\nFurthermore, it's unclear how the project would become a reality without a roadmap and its accompanying milestones and KPIs. Would he work alone or with a team? Would he already have technical capacity or would he need to recruit? What are the risks and challenges for his projects? What would be the budget breakdown? In short, what are the evidence and rationales that help the community to trust him with a substantial request of USD 120,000 in funding. \r\n\r\nLastly, the proposer should have interacted more with the commenters on his proposal to co-create and demonstrate his seriousness and commitment to this proposal. \r\n", "q1r": 1, "q2": "At the time of assessment, the information given in the proposal, including its videos, is not sufficient to audit the progress and success of the proposal either in timeline, in resources or in tasks done.", "q2r": 1, "assessor": "z_assessor_953", "no_vca": 20, "ne": 1, "ng": 14, "nfo": 5, "vca_o": 1}], "solution": "DOKURIZI是一个记者的自我出版平台，他们的作品可以被铸成NFTs。使他们能够与社区联系。", "experience": "我曾经是一名记者，现在在新加坡南洋理工大学教授新闻学。我建立了两个成功的媒体创业公司（已于2019年退出）。"}