{"id": 384927, "author": "blade", "title": "ADA Handle Wallet Authentication", "url": "https://cardano.ideascale.com/a/dtd/384927-48088", "category": 26240, "amount": 45000, "description": "NFT销售被机器人所淹没，极大地造成了链上的拥堵。由于我们的系统是永久开采的，我们需要一个解决方案。", "funded": 2, "upvotes": 120169819, "downvotes": 17083688, "votes_result": 103086131, "votes_cast": 759, "f6_no_assessments": 6, "f6_rating": 4.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "I strongly agree that this proposal effectively addresses the challenge.  NFT eco system across blockchain domain is booming and it is bringing up its own challenges along with it.\r\n\r\none of such challenges lately being faced is of bots choking the blockchain when an NFT sale is going live. This proposal is trying to find a solution to this problem and has given their take and solution to such an existing problem. In order for Cardano blockchain to be not choked and always at best performance it is important to deal with such use cases. \r\n\r\nThe team provides a great solution on how it can be achieved, and plans to keep this an open source solution to help future dapps leverage their solution.\r\n\r\nTherefore in my opinion this proposal perfectly fits into the category of Dapps and integrations. Full points from my side", "q0r": 5, "q1": "The experience of the team is great, with links to their github and linked in profiles. The transparency is great and gives good confidence to the community. The expertise of the team members is well known and they already have lot of contributions in cardano community, as is visible by github repositories.\r\n\r\nAdditionally, the plan presented here along with the budget is well split and explained in details. The estimated date of first version for wallet authentication launch is somewhere in first quarter of 2022, so we are not looking for a long waiting period for the implementation of this proposal. This in my opinion, is quite a positive thing, and overall i am quite confident that his proposal will be implemented successfully.", "q1r": 5, "q2": "The KPI and project tracking link is publicly available on github. There the community can easily track which feature sets are in the pipeline and how it all fits in together to the first release of this project in Q1 2022. \r\n\r\nAdditionally,  the proposal has given the details of how they are planning to measure the blockchain congestion, as this is important in order to verify the success of the proposed solution.\r\n\r\nSince, the team is quite experienced and active in the cardano community, i am confident that community will have a good feedback loop with the team for this proposal, allowing community to keep good track of this proposal progress.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposers want to create a dapp ready wallet for their minting portal. The proposal fits the challenge settings, since it's going to create a dapp. There's implicit value for the cardano ecosystem and for the project in specific. There are valid key metrics that seem well thought out and closely intertwined with the projects success. As a developer I see no issues to scale this progress along with uprising challenges. I see nothing missing, except the technical architecture of the solution, but that's not a big deal for 99% of people. This project will bring know-how to the ecosystem, because the authors are going to try and solve a very specific issue and open source their solution so other dapps can build on top of this solution or reuse their logic, which is invaluable. I don't have any concerns about this proposal since I looked through the team working on this. Overall this proposal will have a great impact over the developer ecosystem as well as the cardano community, because of the possible solution to the bot trading NFTs problem.", "q0r": 5, "q1": "The proposer provided concrete linkedin links and stand by their project with their names, which is how all project should be done IMHO. This action brings credibility to the whole project and organization in the eyes of voters and future investors. The team members have been gathered to have a collective knowledge of all necessary problem fields. The budget is clear and It makes sense. It is simple enough and has a good breakdown of costs, which is lacking in many other proposals. I think the timetable might be a bit pushing it, but for a team of such experienced developers this might be just the right estimation.  As a developer who doesn't have as much experience as either one of the team members, I can't speak to their given estimation. There's a sensible plan for implementation that shows in detail how are things going to be created in a transparent fashion.  The project explains even some of the technical aspects and technologies that are crucial for implementation, but is mostly focused on explaining the need of the solution which is more important. The authors of the proposal have thought about challenges and the whole project is in fact a solution to a challenge they have already faced when developing a real world application, which shows they have the right mindset to solve any kind of challenges or problems.  I wish the proposers all the best and encourage them to keep going forward and keep building in the cardano ecosystem. ", "q1r": 5, "q2": "The proposer provided concrete linkedin links and stand by their project with their names, which is how all project should be done IMHO. This action brings credibility to the whole project and organization in the eyes of voters and future investors. The team members have been gathered to have a collective knowledge of all necessary problem fields. The budget is clear and It makes sense. It is simple enough and has a good breakdown of costs, which is lacking in many other proposals. I think the timetable might be a bit pushing it, but for a team of such experienced developers this might be just the right estimation.  As a developer who doesn't have as much experience as either one of the team members, I can't speak to their given estimation. There's a sensible plan for implementation that shows in detail how are things going to be created in a transparent fashion.  The project explains even some of the technical aspects and technologies that are crucial for implementation, but is mostly focused on explaining the need of the solution which is more important. The authors of the proposal have thought about challenges and the whole project is in fact a solution to a challenge they have already faced when developing a real world application, which shows they have the right mindset to solve any kind of challenges or problems.  I wish the proposers all the best and encourage them to keep going forward and keep building in the cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 17, "ne": 6, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Great idea. Fighting the bots needs to be implemented on a wide scale. \r\n\r\nThe challenge goal is to increase the quality dapps and therefore increase the adaptability of Cardano.\r\n\r\nIt would be nice to see a report of your systems to confirm your claims about running perpetually. \r\n\r\nNevertheless, considering it as a fact, I find this proposal highly in accordance with the challenge. \r\n\r\nIf it would be implemented, it could potentially even increase demand for your services, therefore increasing the Cardano adaptability.\r\n\r\nYet we are talking about one are of blockchain, rating given 4.\r\n", "q0r": 4, "q1": "Given the website running, experience stated and linked in profiles, I find them highly creditable for successful implementation. \r\n\r\nRating given 5.", "q1r": 5, "q2": "The provided key metrics are found to be sufficient to provide progress and the outcome status for the audit. \r\n\r\nAgain a metrics about their usage and possibly increase/decrease number after the implementation would be nice to see, as well as some sort of a \"bot war result\". \r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "NFT drops vs bot issue is a real problem that need to be solve by the community. The proposer address this challenge perfectly and the solution given were on point in alternative to ATALA PRISM solution", "q0r": 5, "q1": "The team seems to have a complete experience both from UX/UI and from the back-end side. As a personal experience on their Beta sales, they have shown a very simple yet effective way to make the drops as a fair playing field for the community to fight the bots. The proposer also mention the code is open so it will benefit the Cardano Ecosystem as a whole.", "q1r": 5, "q2": "Again using the GitHub project to track the KPI is a simple yet effective to track the progress. As CA,  i hope they add an impact KPI as a result of this project ; ex. how many other projects they aim to implement this solution , or target of reduced congestion by \"x\" % to measure it success.", "q2r": 5, "assessor": "z_assessor_646", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Network congestion during major CNFT drops has been a problem that has persisted, during the last months of 2021, starting with late August. Part of that problem has been the use of bots during launches, either to hurt projects or for profit, to quickly \"flip\" CNFTs on the secondary market. Repeated tests have shown that the congestion problem doesn't only affect CNFT drops but the blockchain as a whole. Addressing the problem of congestion soon, before the next major influx of users to Cardano is crucial, particularly before L2 solutions are deployed. That is why I believe this proposal could have a very significant impact on the Cardano network if it is deployed. It will however be an unseen impact if it works properly, allowing the network to work \"as it should\".", "q0r": 5, "q1": "The highly skilled team behind this proposal, and the level of work that they've already done in the Cardano ecosystem, make the likelihood that the project will be successfully implemented if funded very high.\r\nThe team is already working on the Ada Handle project in the Cardano ecosystem and community, and have proven their competence through the way they handled that project, thus there is minimal risk that this open-source extension of their project will not be deployed if funded.", "q1r": 5, "q2": "The budget of the proposal is broken down thus allowing for clear monitoring of the funds.\r\nI would have like to see the KPIs, roadmap and definitions of success more clearly explained and the inclusion of an estimated launch date.\r\nBut, as mentioned in the proposal the project's GitHub can be monitored for progress and the evolution of it can be monitored and audited.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The overall idea is great, but it is not really in line with the mission of the project: attracting users. Helping the system fight bots may protect the blockchain and projects' websites, but it does not create a big impact on increasing the number of users for the project (it might increase because of the reliability of the system, but it will be a long-term process, which it's not what we want right now). Despite that, the idea will result in new, viable applications built on top of Cardano. Because of this, the score I give for the impact is 3.", "q0r": 3, "q1": "The proposal clearly states the experience of the software developers and the structure of the team, which, in my opinion, is very reasonable: 3 senior-level engineers and 1 senior-level IT specialist. There are also links to the Linkedin profiles of the four members of the team. The budget is also pointed out and is dissected into different portions: Development, UI/UX, Code verification, and the amount is modest as well. The technology is also written, and there are also sentences explaining it. There is also a Github link directing to the code of the project. The mechanism that helps protect bots is clearly mentioned in the overview by pointing out what are the 2 safeguards of the protection system. For this reason, I will give the feasibility a score of 5.", "q1r": 5, "q2": "The solution is clear. There is also a to-do list that states what to do in the future, even though there is no specific date. A great plus to this proposal is a Medium blog to commit bi-weekly technical updates. One problem I see is that there is no quantifiable figure or number to show what success looks like. Because of this, I give the suitability/clarity a score of 4.", "q2r": 4, "assessor": "z_assessor_987", "no_vca": 27, "ne": 6, "ng": 18, "nfo": 3, "vca_o": 1}], "solution": "集成dApp-ready钱包到我们的造币门户。这将使我们能够验证那些被钉在池子里的用户，同时也可以删除电子邮件。", "experience": "我们的团队拥有近40年的综合软件经验，从小型副业项目到财富500强公司，包括Facebook。"}