{"id": 384922, "author": "rajatauton", "title": "Liquidity Aggregator for Cardano", "url": "https://cardano.ideascale.com/a/dtd/384922-48088", "category": 26240, "amount": 50000, "description": "目前在Cardano或基于订单簿的DEX上没有流动性聚合器，这使交易者处于严重的竞争劣势。", "funded": 2, "upvotes": 145223690, "downvotes": 10823828, "votes_result": 134399862, "votes_cast": 699, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "我同意这个提案有效地解决了这个挑战。该提案的目标是在Cardano上建立一个流动性聚合器，类似于Orion协议正在做的事情。这个想法在这个领域并不新鲜，然而，在Cardano上这可能是第一个。  详细的计划还解释了这一解决方案将如何帮助Cardano生态系统在DeFi领域的发展。\r\n\r\n\r\n该解决方案的声明是清晰易懂的。此外，详细计划还进一步阐述了为什么团队认为他们的解决方案是必要的。例如，SmartDex 2.0上的Smartpools似乎是一个非常有趣的想法，它将给散户交易者/投资者提供平等的机会，使他们的投资有更好的回报。", "q0r": 5, "q1": "提案说明中提供的网站链接对该提案背后的团队有详细的描述。\r\n\r\n该团队有很好的开发人员和顾问名单，其中也提到了Ben Goertzel。从经验上看，我对这个团队充满信心。\r\n\r\n从计划的角度来看，资金的分配得到了明确的解释，虽然没有以小时为单位，但给出了每月的费率，这是合理的。每个季度的里程碑都有很好的阐述，详细说明了团队计划在每个季度要实现的目标。\r\n\r\n总体而言，提案写得很好，因此，我强烈认为成功实施的可能性很大。", "q1r": 5, "q2": "该计划向社会详细解释了存在哪些问题，以及该提案想要实现的目标。这进一步被很好地分解成路线图，每季度一次。\r\n\r\n3个月、6个月、9个月后的成功定义是以点带面的，因此很容易理解和遵循。社区也有Testnet测试版和Mainnet测试版的暂定日期。\r\n\r\n由于团队简介是公开的，在我看来，所有审计该提案的进展所需的前提条件都已满足，因此我非常确信所提供的信息足以审计该提案的进展和成功。", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2, "reply": "Thank you for the assessment. We look forward to being an asset to the Cardano blockchain and helping to onboard users to the space."}, {"q0": "Interesting idea. If we can have such a \"hybrid\" dex, it can definitely attract more users to the Cardano blockchain and increase its adaptability.\r\n\r\n\r\nQuestion is - why there is not such a product already? (by someone else) where is the catch? \r\n\r\nI find this proposal highly in accordance with the challenge impact. Rating is given 5.", "q0r": 5, "q1": "Their product is working, yet I could not find any information about the proposers, no links nor relevant experience stated.\r\n\r\nIt would definitely increase the credibility of proposers if such information would be included. \r\n\r\nRelevant experience stated.\r\n\r\nGiven the working website- \r\n\r\nRating given 4.", "q1r": 4, "q2": "A detailed roadmap is provided, in reasonable detail.\r\n\r\nAlso, the definition of success if stated, which is increasing the audit. \r\n\r\nBased on the information given, I find it sufficient for audit. \r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "Cross-chain liquidity aggregation will be a massive catalyst for onboarding billions of dollars in liquidity from other blockchains, right as Cardano defi comes online. This is a crucial time for Cardano and implementing corss-chain liquidity and swapping functionality will exponentially grow our ecosystem faster than just about any other single factor. I believe this proposal succeeding will go a long way to making Cardano the blockchain of choice for defi in the web3 world!", "q0r": 5, "q1": "The team has experience with building on other blockchains that they will bridge Cardano to. They have a live product already deployed on ethereum and binance smart chain and polygon  where they have already built a DEX and a cross chain liquduity aggregator for cross chain swaps.\r\n\r\nI think this proposal as written has a very high probability of success and will benefit the entire cardano ecosystem greatly once implemented.", "q1r": 5, "q2": "The roadmap for this proposal is very impressive, detailed with reasonable milestones and contains specific KPIs for each  milestone on the roadmap. \r\n\r\nI think project catalyst has plenty of information to successfully audit this proposal and determine whether it was successful or not.\r\n", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "I'd like to thank you for the great words of encouragement in our project. Autonio plans on being a boon to Cardano and a crucial project for helping onboard users to the Cardano ecosystem with our Smartdex."}, {"q0": "Extremely accurate challenge fit. Provides a good summation of the problem and a well delivered presentation. ", "q0r": 5, "q1": "The proposal provides a clear use prior Dex knowledge and presents a clear and defined roadmap. The proposal also take not from leading players and makes efforts/plan to include them in the future. What will make this project stand out from other DEXs being launched on Cardano? ", "q1r": 4, "q2": "Yes. The proposal contains detailed points of reference and provides a clear outline of how the requested funds will be spent. My only concern is the shear number of items on the roadmap. I'm concerned voters may not be able to process such an aggressive action plan and believe it is not possible to complete in the proposed time. Maybe provide a cleaner timeline that is easier to audit. ", "q2r": 4, "assessor": "z_assessor_970", "no_vca": 23, "ne": 3, "ng": 13, "nfo": 7, "vca_o": 1, "reply": "Smartdex will be set apart from other DEXs by our ease of use, cross chain bridging and liquidity aggregation and other features. It is already aggregating liquidity on ETH, Polygon, and BSC and we are working to incorporate Cardano currently as well as others. Users will be able to trade, bridge, swap, cross chain bridge, cross chain swap, invest in smartpools and liquidity pools, earn through our earn section, and more planned for the future. We have updated our timeline as well as our project experience."}], "solution": "Smartdex聚合了整个DEX的流动性，为用户提供高效的交易以及链外交易的链上结算解决方案。", "experience": "在ETH上的DEX，Polygon，BSC与书和交换，在2020年升级到0x v2.1，2.0的发布与流动性的聚集和跨链交换。"}