{"id": 383859, "author": "profd2004", "title": "Opensource PHP SDK for COTI ADA Pay", "url": "https://cardano.ideascale.com/a/dtd/383859-48088", "category": 26256, "amount": 32800, "description": "PHP используется более чем в 75% всех веб-сайтов, но нет высококачественного SDK для поддержки ADA Payment.", "funded": 1, "upvotes": 59957940, "downvotes": 12515381, "votes_result": 47442559, "votes_cast": 562, "f6_no_assessments": 12, "f6_rating": 3.1111111111111107, "videos": [], "media": [], "f6_assessments": [{"q0": "Предложение полностью соответствует поставленной задаче, и я считаю подход, заключающийся в создании сначала PHP SDK для интеграции COTI AdaPay, а затем плагинов для Woocommerce и Laravel действительно разумным и хорошим способом оптимизации разработки с использованием модульного подхода.\r\nВыбор использования PHP, учитывая его широкое распространение для разработки веб-сайтов в мире, является идеальным и может дать огромный толчок для принятия COTI AdaPay и, следовательно, для принятия и распространения Cardano.\r\nОтсутствие звезды связано с отсутствием подробностей о пользовательском опыте для платежей (есть упоминание о пользовательском интерфейсе только с точки зрения продавца), но в задаче четко указано, каким будет пользовательский опыт для клиентов.", "q0r": 4, "q1": "Авторы предложения с инициативой \"Lidonation\" - известные члены сообщества, они уже получили финансирование на несколько предложений, и, судя по их профилю на linkedin, у них могут быть навыки, необходимые для разработки представленного проекта.\r\nВ то же время на github нет ссылки на предыдущие разработанные проекты. Единственным указанием на предыдущие проекты, разработанные с использованием навыков, необходимых для данного предложения, являются:\r\n- сайт lidonation, который, судя по всему, разработан на Laravel, как указано в предложении\r\n- сайт https://electricbikereview.com/, который разработан на Wordpress.\r\nБыло бы неплохо объяснить, какие пользовательские плагины были разработаны для упомянутого сайта и, если возможно, поделиться репозиторием кода, чтобы иметь лучшее представление о навыках предлагающего. На данный момент, имея только предоставленную информацию, невозможно составить полное представление об этом.\r\nС технической точки зрения, было бы неплохо предоставить больше информации о некоторых технических аспектах: для какой версии PHP будет разработан SDK? Какие уже разработанные пакеты будут использованы? Будет ли он опубликован на packagist и доступен через composer?\r\nЕсть упоминание о поддержке продавцов по электронной почте и телефону, но не указано, в течение какого времени будет поддерживаться SDK и плагины, было бы неплохо добавить такие подробности.\r\nРаспределение бюджета состоит только из 2 частей: Разработка и поддержка.\r\nБыло бы здорово иметь более подробную разбивку и увидеть, насколько различные части разработки влияют на общую стоимость (например, примерное количество часов для разработки SDK, документации, тестирования, разработки плагина Wordpress, разработки пакета Laravel). Указанная стоимость в $65/ч довольно высока (даже если я знаю, что она может сильно отличаться в разных странах), и было бы неплохо предоставить более подробное обоснование этого.\r\nБыло бы неплохо указать график или этапы выполнения различных частей проекта, на данный момент можно только оценить, что разработка займет 320 часов.", "q1r": 3, "q2": "Как было сказано в технико-экономическом обосновании, в предложении отсутствует дорожная карта и график реализации различных частей проекта, а этот тип информации может быть критически важен для того, чтобы помочь сообществу следить за ходом реализации предложения.\r\nKPI не указаны, для данного проекта было бы полезно следить за ними:\r\n- Коммиты / проблемы / вехи Github для разработки каждой части (SDK, плагин Laravel, плагин Wordpress).\r\n- Количество веб-сайтов, использующих / скачивающих SDK / плагин Wordpress / пакет Laravel\r\n- Количество транзакций, совершенных с помощью SDK (и укажите способ их отслеживания, например, подпись в коммуникации с COTI AdaPay API)\r\n- Количество электронных писем / телефонных звонков в службу поддержки", "q2r": 1, "assessor": "z_assessor_147", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This proposal meets the challenge set in the fund and looks to help develop an SDK that can be used to integrate a plug-in to PHP-based items.  This scalable to people building websites using PHP as the base server-side language, which is a popular one, with WordPress as an example.", "q0r": 5, "q1": "There is relevant experience in the team to deliver such a project with vast experience developing front- and back-end solutions.   There are little details on how the execution would go, but details on what the solution would include are available.", "q1r": 3, "q2": "There is a description of what the solution is, but there is little details on how the solution will be built and the resources necessary for the project will be.  The additional funds allocated towards \"technical support\" are extensive and not really apart of the product development.  ", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "They identify the problem of integrating ADA pay into existing payment systems. They are already actively adding value to Cardano system themselves on other platforms and their PHP SDK will surely do the same if implemented successfully. They have a website ready for integration testing and that in itself is a KPI that aligns with the Challenge.  Adding more ecommerce related KPIs would have revealed the degree of alignment with the challenge.", "q0r": 4, "q1": "They provide evidence of relevant skills with an already built website that is going to be the test playground for their first integration when their plugin is ready. Budget is broken down into identifiable items and seems reasonable for the tasks they plan to complete. They didn't provide any timetable to show when work gets completed. People need to know you have some goal of completing this project. Setting a time, also shows that you are committed. They explain in detail what is needed and how they will build this. They also consider the risk of not finding a suitable opensource framework and aim to work with Plutus developers from the community to build their own alternative solution.", "q1r": 4, "q2": "They don't have a roadmap with milestones or KPIs in place. The one Milestone/KPI could be the website they have ready for testing their plugin. It would've been great to have more metrics to measure the performance of this project.  There is also no completion date. The problem and solution is clearly defined by creating an open source PHP SDK for ADA Pay. PHP already being used by many ecommerce websites.", "q2r": 3, "assessor": "z_assessor_140", "no_vca": 21, "ne": 6, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has some good points in it and at the same time it is aligned with the main ideas of the challenge. The core idea of developing a plug-in that could be used in any Laravel or WordPress site has a good range of impact. The team seems to undoubtedly identify the problem within the challenge and if successful the proposal will certainly overcome this problem. Unfortunately, not many metrics were given which makes it difficult to assess if the team clearly knows how to determine if they are on the right track. Also, no concern with the scalability problem was shown which is worrying since it is a crucial point.", "q0r": 3, "q1": "This proposal shows some strong points to support the thesis that is a feasible proposal, but at the same time a lot of other points are missing. There is enough evidence that the team has relevant skills and experience that are needed. The budget proposed is within acceptable limits, but it is not broken down enough to determine if it has a fair value. Also, no timeline was proposed which is serious. Some more information such as a strategy in case additional funding is necessary or in case the team finds out they will not be able to meet the deadlines would be welcoming. Unexpected challenges regarding scalability and integrations could have been discussed as well.", "q1r": 3, "q2": "There is very little evidence to show enough information was provided to audit the progress and success of the proposal. No relevant KPIs were discussed. The roadmap and milestones are not clear, and the timeline was not even discussed. Even if the problem was well described, the way the solution addresses the problem is not scrutinized. In turn, it makes it hard for anyone to gauge if progress is as expected at each stage.", "q2r": 2, "assessor": "z_assessor_341", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "I am not sure behind the intent of this proposal. I will elaborate on my reasoning.\r\n\r\nAs a senior developer myself, i can surely say that the AdaPay integration via plugin should be the target of this challenge settings. However, this proposal takes this challenge a step further and talks about providing an SDK which will also be used for some already in progress project by the proposer. \r\n\r\nTherefore, to me it seems this is an additional point just for the sake of supporting this SDK development. In my opinion, to have adapay integration via plugin does not require or in any sense help further with meeting the goals of this challenge. Why would we need an SDK when a simple plugin integration with ecommerce sites is the  success criterion for this challenge settings. \r\n\r\nTherefore, i am more on the direction of disagreeing with this proposal in this challenge settings. My suggestion would have been to put this in open source challenge for cardano. But since, the proposal is well written and touch bases the plugin development for AdaPay, i will stay neutral and neither agree or disagree with it", "q0r": 3, "q1": "From the perspective of the experience, the relevant experience is given but details of the team is missing.\r\n\r\nThe main proposer is clearly quite active in Cardano eco system and perhaps has good experience with development. However, from the budget point of view it seems that there is only one developer (the proposer) who will be working on this project (atleast this is so becasue no other details of team is presented in this proposal).\r\n\r\nThere is also written that they might have to collaborate with plutus devs  to generate smart contract generator, but it is not really mentioned in proposal, how is smart contract generator fits into AdaPay solution integration with ecommerce. It would help  a lot to a simple voter (who is not coming from tech background) if the proposal is written in a manner that is visually clear, outlining the thoughts of proposer in text clearly. \r\n\r\nThe budget outlined (in comparison to total allocation which is around 30% of total challenge budget) is on high side, when it does not even match up the success criterion of this challenge settings. e.g. \" innovative plug-in that will be integrated with our current ADA Pay system on the one hand and support all the different e-commerce software mentioned above (both shopify and woocommerce)\".  IMO there is no need of an SDK and removing that part will significantly bring down the costs to implement this proposal. There are other proposals in this challenge which fulfil exact success criterion of challenge in less budget.\r\n\r\nAdditionally, technical details such as QA (load testing, UAT), scalability metrics etc are missing. All in all , i feel there is a lot of improvement needed and also this might not be the good fit for this challenge. ", "q1r": 3, "q2": "The information provided here imo is not sufficient to audit the progress and success of this proposal. \r\n\r\nAn overall budget is mentioned, but plan has not been broken down into milestones, feature sets etc. This proposal, therefore, imo has much room for improvement. \r\n\r\nFor the community/voter it will give much more confidence when the proposer additionally gives a good break down of challenges/risks associated with the proposal. One risk, imo is that the if the main developer for some reason is unable to contribute then who others can basically pick up the responsibility to carry on the implementation of this project ? \r\n\r\nThe positive is that proposer is open to collaborate with similar ideas, but nevertheless i feel that auditing the progress and success of this proposal requires more detailed information in terms of 3, 6, 12 months or weeks of deliverables. How the success will look like ? ON successful implementation, will there be OR how many businesses using the plugin/SDK ? ", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 14, "ne": 7, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely no high quality Cardano native SDK for supporting ADA Payment\r\n\r\n\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief Create a PHP SDK (batteries included), wrapped with a Laravel & Woocommerce plugin for adding ADA Pay to any Laravel or Wordpress site.\r\n\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a solution\r\n \r\n  Key metrics  would be  number of users, no of wallets, no of fiat transactions, no of ADA transactions.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more businesses who use the same solution\r\n\r\nThis project will have a positive impact on Cardano system by enabling small businesses to get on board.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country including payment gateway containing sites. \r\n \r\n", "q0r": 5, "q1": "\r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  required skills. \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links  \r\n  \r\n \r\nThe proposers are well experienced and competent to do the project\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\n \r\nTheres a realistic timetable  to complete the work\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\n\r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a roadmap with milestones  \r\n\r\n \r\n There are  Metrics such of number of users, no of wallets, no of transactions, time taken, amount of fees saved, amount of time saved on each transaction.\r\n   \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties. \r\n \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 21, "ne": 6, "ng": 5, "nfo": 10, "vca_o": 1}, {"q0": " Great thinking outside the box. Most proposers plan on using API but by opting for an SDK you not only give the consumer the tools to implement ADA pay but you also give them your whole workspace so they are not bound by the boundaries of an API. Focusing on PHP is a solid decision since most e-comm and CMS platforms work on PHP.", "q0r": 5, "q1": "Regarding feasibility, we are missing some important details. The proposers are saying that they have over fourteen years of experience in software, cloud engineering,... The issue here is that they don't provide actual evidence to support this. They provide a link to their website but this provides only information about Cardano and not themselves. The roadmap is also missing which leaves us in the blue about what the proposers are really planning on doing. The budget breakdown is present but only rudimental. we need a deeper understanding as to why 12000 is needed for email/phone support.\r\n", "q1r": 2, "q2": "As mentioned in the above rationale no roadmap is provided what makes it hard to assess auditability as well. We do have some guidelines represented but this does not give the proper details about what still needs to happen and how much time it would take. Also think about metrics, How much adaption are you thinking about when making the oho SDK.", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The proposal seeks to address COTI challenge by creating a PHP SDK (batteries included), wrapped with a Laravel & Woocommerce plugin. The goals clearly align with the challenge setting.", "q0r": 5, "q1": "The proposers possess the skill that complement one another to steer this implementation to the success. However, the proposal is ranked 3 due to the budget for the phone and email support seem a bit high. Hopefully they would revise the budget for email and phone support  to be more reasonable.", "q1r": 3, "q2": "Since they are open for collaboration, it would be fair to revise the budget down and also detail the arrangement like how they can work with partners to achieve project goals successfully.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "I wholeheartedly believe that the solutions given will solve the problem perfectly.\r\nInteresting idea with huge potential. Looking at this proposal, I can only say that it is a perfect fit for the challenge. This is a great idea. It is proposed to be able to extend the ADA Pay application by creating a PHP SDK.", "q0r": 4, "q1": "The proposal does not provide a realistic timeline for completing the work. The proposal did not consider the challenges and risks associated with successful adoption. Looks like the proponent needs more colleagues if you want this proposal to be successful.\r\nThe experience here is very important. The proposal consists of 2 members Stephanie and Darlington with a basic description, the feasibility of the proposal can be easily measured if there is specific documentation of their success, or at least provide LinkedIn, Twitter page, Facebook for the community to understand more about them", "q1r": 2, "q2": "There is no detailed implementation plan. We'd love to see your blueprints for the future.\r\nProposing a step-by-step plan isn't good for developing clear and time-bound milestones. The budget given is very general and therefore I cannot say whether it is suitable or not\r\nThis proposal is difficult to test because there is no yardstick to measure success and there is no specific roadmap in this proposal.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The team states the problem in the proposal and offers a very good solution. This idea definitely has a positive impact on the Cardano ecosystem if it is to be realized. The team clearly explains how this project can add value to the Cardano ecosystem. Unfortunately, KPIs are not elaborated or listed so it's hard to compare KPIs with challenge setting and the proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "The team in the proposal provides links from which the work so far is visible and we are clearly presented that the team of two people has the necessary skills, knowledge and experience. The proposal presents a budget that gives us a clear insight into how the funds will be allocated. Maybe the team is asking for a little too much funding to run this project but that's just my opinion. It would be good for the team to develop a detailed implementable plan and details of actionable tasks and an order of execution with time frames within which the work will be done. It would also be great to list the necessary resources and technical aspects if they are of great importance for implementation. When carrying out any project, certain risks can always arise, so it would be good to have an idea of the possible risks.", "q1r": 2, "q2": "Unfortunately, the team for some reason omits the roadmap with milestones and the horizon for achievement probably due to lack of knowledge of how to prepare a proposal. KPIs have not been mentioned or presented so unfortunately the community can't track the success of this project.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The goal of the proposal does meet the goals of the challenge. technical details specific to the ADApay integration are lacking. The proposal includes a 12000 budget for 1 year of phone and email support which seems premature considering the development that needs to happen. ", "q0r": 3, "q1": "The team are motivated members of the Cardano ecosystem and speak intelligently about the project at hand. I wish they would focus more on the technical details related to ADApay integration. The fact that they are budgeting in 1 year of phone/email support makes me think that they are thinking too big and a more modest proposal would seem more feasible.", "q1r": 3, "q2": "The detailed plan does include clear goals and steps, but the path to acieve them is not clearly defined.  No timeline is given. ", "q2r": 2, "assessor": "z_assessor_67", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal has some interesting idea to further expand adoption of Ada Plugin integrations to WordPress websites. \r\nThe problem statement is definitely inline with the challenge set goals and objectives and the solution is more than promising positive impact on the challenge.", "q0r": 4, "q1": "There is no detailed information about the competence of the team. \r\nHowever, the notion to collaborate with other developers and  Cori Experts is encouraging. \r\nIn addition, the budget breakdown still needs to be well defined in clear terms plus the fact there is no well detailed step-by-step roadmap to implementing the proposal.", "q1r": 3, "q2": "The proposal has not provided any form of metrics or KPIs to assess the project's performance if funded.\r\n\r\nIt may helpful to provide key metrics such as the number of website that will integrate this plugin, the no. of uers' adoption on this e-commerce sites, number of customers complaints and enquires upon processing payments transactions.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}], "solution": "Создайте PHP SDK (батареи включены), обернутый плагином Laravel & Woocommerce для добавления ADA Pay на любой сайт Laravel или Wordpress.", "experience": "14+ лет Инжиниринг программного обеспечения и облачных технологий, разработка блокчейна, бизнес-консалтинг, языки мира, техническое письмо, преподавание."}