{"id": 385102, "author": "abehazbunjr", "title": "Tokenized Products for Shopify", "url": "https://cardano.ideascale.com/a/dtd/385102-48088", "category": 26256, "amount": 14000, "description": "Shopify и Woocommerce - основные платформы электронной коммерции, не имеющие возможности использовать нативные токены в качестве полезных элементов, элементов входа или продажи.", "funded": 1, "upvotes": 37140809, "downvotes": 24875597, "votes_result": 12265212, "votes_cast": 462, "f6_no_assessments": 16, "f6_rating": 1.6041666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal addresses the fund challenge and what it is trying to accomplish.  There is little data on the scalability or overall impact of this solution on the fund.", "q0r": 4, "q1": "Detail plan for the workscope of this proposal was never uploaded and there is very little information on how and what work is to be done on this project.", "q1r": 1, "q2": "Due to the lack of information this project cannot be adequately be audited.", "q2r": 1, "assessor": "z_assessor_13", "no_vca": 28, "ne": 1, "ng": 20, "nfo": 7, "vca_o": 1}, {"q0": "Idea may have been interesting but the proposer didn't finish it on time.", "q0r": 1, "q1": "I would suggest getting in a cooperation with a developer early so that a professional can assess the difficulty of ideas implementation. ", "q1r": 1, "q2": "No data given, the proposal is unfinished. Good luck in next Catalyst Funds", "q2r": 1, "assessor": "z_assessor_324", "no_vca": 26, "ne": 0, "ng": 22, "nfo": 4, "vca_o": 1}, {"q0": "Apparently, the detailed plan was not submitted to the site, so this proposal basically lacks all the necessary topics and information needed to be a complete one. It does not state what are the objectives nor does it describe any characteristics of the plug-in that is intended to be developed. It does not articulate how this solution adds value to the Cardano ecosystem and there is no discussion whatsoever about scalability. No key metrics are included in the proposal, so it is not even possible to state if they are aligned with the goals.", "q0r": 1, "q1": "This proposal is very unlikely to succeed. The author claims to have experience with Cardano and web analytics but shows no evidence of that. It does not describe his past experiences and what are the projects he has engaged with. The budget is nothing but a number. There is no rationale behind it explaining how he estimated the amount required. No timetable or roadmap is discussed. And finally, there are no milestones to assess if the plan is sensible and what is being done nor how.", "q1r": 1, "q2": "The auditability of this proposal is nonexistent. No information is given on how it will be possible to track progress. No time horizon or milestones are discussed and no KPIs were defined. There is no clear description on how this solution will actually add value to the Cardano ecosystem or solve the main problem of the challenge.  KPIs regarding the scalability of the solution would be interesting to be discussed. Also, it would be nice to define KPIs like ratio of successful transactions over total transactions to assess if the solution is delivering what was promised.", "q2r": 1, "assessor": "z_assessor_341", "no_vca": 24, "ne": 6, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "Proposer intends to build a plugin for wordpress and shopify that allows payment and minting of tokens. Seems like a reasonable product to build. ", "q0r": 4, "q1": "Proposer states that he has 14 years of web analytics experience and is a Plutus student.  I believe this to be true, however it is difficult to verify the proposers experience without a reputation system, LinkedIn profile, or references to previous accomplishments.  There is no detailed plan, and the github link provided shows only 23 contributions in the last year.  ", "q1r": 2, "q2": "There is no detailed plan, and no reference to key metrics, success criteria, etc. ", "q2r": 1, "assessor": "z_assessor_391", "no_vca": 22, "ne": 0, "ng": 15, "nfo": 7, "vca_o": 1}, {"q0": "Draft proposal of only 65 words requesting $14k.\r\nThe proposer posted many proposals of which 5 are in the same state of unwithdrawn draft.\r\nSo my assessment of these proposals will be very similar. The proposer should have withdrawn these proposal to save time to the voters and to the community advisors.", "q0r": 1, "q1": "Draft proposal. A link to a GitHub account is given but almost nothing else. We also know that the proposer is a Plutus pioneer.\r\nLike in his 5 other draft proposals, the proposer completed the questionnaire telling the required information was provided while it is not the case.\r\n", "q1r": 1, "q2": "65 words cannot provide enough information for any Catalyst proposal.\r\nIt is written in the proposal that a plan was to be provided by the end of the week on 2021-11-28 but ultimately was not.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 22, "ne": 1, "ng": 16, "nfo": 5, "vca_o": 1}, {"q0": "The proplem is summarized short but clear explained and on point. There is no need for a longer description of it. Anyways for a voter it would be nice to have a little bit more information about how exactly this challenge would be tackled. Also a short technical summary could go a long way.", "q0r": 3, "q1": "Since the proposer is working full time on plutus there is a high possibility the proposal will be implemented successfully. The link to the github profile of the proposer helps to verify this. On the other hand the proposal mentions that a Detailed plan is to be submitted by the end of this week, 11/28/21. During the assessment not there is no plan availiable directly on the proposal. It would help to assess the proposal if there would be a detailed roadmap, budget and risk-assessment direktly on the proposal.", "q1r": 2, "q2": "It is really hard to assess this proposal. It would help to not only provide the github page but provide roadmap with milestones and a time horizon directly on the proposal. Also the proposal in total is kept quite short.", "q2r": 2, "assessor": "z_assessor_41", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This is an interesting solution to a problem that as far as I know no one has yet addressed in cryptosphere...the utilisation of NFTs in e-commerce platforms, that is besides the art, gaming, music & other media that's currently being minted. That said, the proposer falls short in further expanding the idea to provide the reader with a clearer picture of what these minted tokens will represent, how they will be used in the e-commerce platforms and why would users want them. It would greatly benefit this proposal if these are more clearly explained and as it is, seems to be just a thought bubble with no further exploration of the potential, much less the development of a solution. I encourage the proposer to return in a future round when all the barnstorming has been done. Good luck.", "q0r": 3, "q1": "Unfortunately, I do not need to draw upon my previous assessing experience to disagree that this proposal can be implemented successfully. If a clear explanation of the problem/solution has not been expanded to a convincing level, then I am not surprised that the  basic requirements to give confidence this could be built successfully, are totally missing. Besides a GitHub, the name of the proposer & the background, there aren't many details provided which could be validated. As mentioned previously, I highly suggest the proposer to go back to the drawing board and re-present this proposal in a future round if there truly is a utility for NFTs in the e-commerce space which would justify this functionality, then we need to know it and build it. ", "q1r": 1, "q2": "This proposal either missed the deadline or was not retracted in time as the necessary details are totally lacking. I recommend it be revisited and presented again in a future round with all the necessary information which will allow proper assessment.", "q2r": 1, "assessor": "z_assessor_42", "no_vca": 21, "ne": 3, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "This proposal didn't effectively address the challenge. The goal of this challenge to provide an ada payment system that will easily be integrated with platforms such as shopify and woocommerce. I suggest to the proposer to read and understand the challenge and add as much information possible in order to increase its chances of being funded.", "q0r": 1, "q1": "This proposal doesn't include enough information to be implemented successfully. I suggest to the proposer to add more information such as a linkedin profile, a budget breakdown and a timetable, to increase its chances of being funded in future funds.", "q1r": 1, "q2": "This proposal doesn't contain enough information to be audited. The proposer should add a roadmap and milestones, metrics and kpis that define success and all the information that can help track the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 21, "ne": 3, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "This proposal gives a good problem statement and its solution to that, however, a detailed outline on how the solution will be implemented is missing.  This proposal explains the need of plugins to allow Shopify and WooCommerce to mint tokens asssociated with various metadata with respect to their businesses, however, does not provides a detailed description on how the success will look like ? This point alone is as per challenge settings important one in order to decide if the proposer has considered most if not all aspects of the challenge requirements. Hence 2 stars from my side.", "q0r": 2, "q1": "The proposer has provided his Github profile link, but the GitHub activity is quite low and fails to give a good idea on skill set of the proposer. Nevertheless, being a developer myself, i know that the plugin for adaPay might not be that challenging task. \r\n\r\nThe plan, however, is lacking. For instance, how much effort it is and in what time duration this will be delivered? What would be the roadmap to get quick customer feedback once implementation is done? How UI is going to be like ? \r\n\r\nThe proposal therefore has plenty of room left for improvement. Hence, I disagree that this proposal will be implemented successfully.", "q1r": 2, "q2": "The information on this proposal is not elaborated well. The challenge settings clearly mentions that Guiding questions are  to check are How do we measure the quality of the plugin ?  Is the plugin able to handle high traffic/load ? What mechanisms proposer wants to put in place to have productive feedback loop ? None of these points are addressed in the proposal writeup. It would be great if next time proposer has an indepth look on challenge settings.\r\n\r\nAdditionally, it may be argued that the developer here will be available to answer those questions to the community from time to time, however, the proposal write up does not show great discipline in addressing these questions upfront in voting rounds. Therefore, i disagree that we will have enough information to audit the progress of the proposal.", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This is just an idea not a proposal The idea itself meets the challenge goals  \r\nThere is no basis on which to assess this proposal as there is detailed information on how this proposal provides a solution\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n", "q0r": 1, "q1": "\r\n\r\nNo profiles or experience of team members are given, no budget is given except a single figure of 14000, there is no breakdown of costs or anything at all\r\n\r\n\r\nI cannot give this anything other than a 1 rating", "q1r": 1, "q2": "\r\nThere is no timeline of activities, measurable metrics or KPIs or anyway to audit anything. There are no contingency plans, no auditable reporting or anything that can be tracked or assessed. I can only give this a 1 rating\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 21, "ne": 1, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "Interesting idea about minting tokens. But I must admit that I fail to see the link with ADA Pay on this idea. The idea itself is great and would add great value to Shopify and the Cardano ecosystem.", "q0r": 3, "q1": "I suppose the proposer forgot the submit his detailed plan because we are not getting anything on how he plans on implementing this. Seeing the experience the proposer has and the scale this proposal has I can suggest thinking about adding more members to the team. This way the success rate of this idea goes up. I would love to see this return in the next fund.", "q1r": 1, "q2": "As mentioned above we don't get any details on this proposal, so I must admit for auditability I don't have confidence this proposal gives sufficient information to assess the progress.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nAs an average ADA holder without any experience with NFT's and minting tokens, it's difficult for me to understand the problem statement. Is the problem really that these companies cannot get involved with blockchain technology, or that they don't want to, yet? I tend to incline towards the latter, so then I think it would be useful if you explained why they would want to use tokens to do what they already do with normal loyalty points systems.\r\nThe problem statement is relatively clear, but it would have to be expanded on later so that we can learn the details of how this would work, but unfortunately, the information is not present in the proposal.\r\nEven though the scope of this idea is compatible with the challenge, due to the problems outlined above and the lack of any type of KPI or concrete goal, I have to strongly disagree that this proposal can address it effectively.", "q0r": 1, "q1": "The proposer claims to be a Plutus student and the notes on the provided github do reflect this, but there does not seem to be much other activity there, especially in the fast few months. Aside from this, two years of Cardano experience are mentioned - this is too vague in my opinion. Try to detail what exactly you have done in the ecosystem in the future. Lastly, 14 years of experience of web analytics and managing large technical projects are mentioned, but no references are provided to verify this. It's a good idea to try to add at least a Linkedin page to back you up. \r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. As the proposer himself mentioned, the full plan was due at the end of November, but it does not seem to have made it unfortunately.\r\n", "q1r": 1, "q2": "There are no KPI's or a roadmap, due to the proposal being unfinished, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 21, "ne": 6, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Shopify and Woocommerce are major e-commerce platforms that do not have the ability to use native tokens as widgets, logins, or sales. The solution given is A plugin for Shopify and WooCommerce. There is clarity in the problem, solution, and alignment with the challenge.\r\nHowever, with this proposal, as mentioned in the text, it seems that the proponents did not have enough time to update it before the deadline. So it's basically an idea but not really a plan, in a way that although the idea is good and can be successfully implemented, we don't know how it will be implemented.", "q0r": 2, "q1": "Potential ideas, a problem, and a solution to the problem were identified, but the proposal did not appear to present the work plan in a clear and understandable manner. The problem of the proposal is only briefly explained, no further information is needed. The proponent did not indicate the experience and skills required to implement the proposal, nor did he mention how he or she would implement the proposal, either with a team or working alone. Because of the lack of information, it is impossible to know whether the project is feasible or not.", "q1r": 1, "q2": "As pointed out, the probability of evaluating the proposal is low, as it does not show the roadmap with development plan, detailed explanation of each step, milestones and the partial delivery, progress and some way for the community to gauge the success of a proposal. such as metrics and KPIs. Since there is no blueprint, but the proposal asks for 14,000 USD, it is unlikely that the proposal has been successfully implemented.", "q2r": 1, "assessor": "z_assessor_654", "no_vca": 16, "ne": 4, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal focuses on building a plugin for Shopify and WooCommerce providing the ability to mint tokens associated with Product, Customer, or Discount data for re-use on site. Because this proposal is not completed [since there is no roadmap, KPIs/metrics, and budget breakdown,...], the solution is still very abstract, not a clear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer's profile is briefly described as a full-time Plutus student with two years of Cardano experience and 14 years of web analytics and managing large technical projects, followed by an external link [https://github.com/seamossonline] for verification. However, a detailed plan is not provided, therefore, there is no proof of feasibility. Based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "As there is no roadmap, KPIs/metrics, and budget breakdown,...] where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "Thank you for recommending this project. In fact Shopify includes hosting and security, plus you don't need to use any code to build a brilliant online store, WooCommerce as an open-source platform, you can use code to customize your store to your heart's content. Shopify implements a separate payment system, so it is completely possible to use tokens to develop as well as create attractive rewards for users. But maybe for WooCommerce it will be more difficult because of its system. With different marketing and systems may lead to different security and payment", "q0r": 3, "q1": "In terms of possible, I hope you can elaborate more on your personal profile as well as your team such as whether there is someone responsible for the financial aspect. Also I hope you can show us the short and long term project roadmap. And the criteria you need to achieve in the future, I think it is necessary for your project", "q1r": 1, "q2": "In the roadmap I hope you can describe what value you want here,\r\nfor the country, the financial market or the people. Because you require an investment of up to 14000$ which is quite a large amount.\r\nYou should explain how you will use this money? For how long and how can people see you using it? You have to prove to us your vision and actions", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The project is actually spot on by addressing an impactful problem within the challenge objectives. Providing ADA payment plugin to some of the big e-commerce platforms could have a great positive effect to achieving  some of the set objectives of the campaign.", "q0r": 5, "q1": "There seem to be insufficient information and exquisite experience to confidently exert that the project could deliver on this project. However in such cases, there will be need for potential collaboration with much needed technical expertise and experience.", "q1r": 3, "q2": "There is literally no sufficient information to assess this project's performance if eventually. Success Metrics, Roadmaps, Milestones etc are obviously missing in the project. This information is much needed.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 20, "ne": 1, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "Плагин для Shopify и WooCommerce, предоставляющий возможность майнить токены, связанные с данными о продукте, клиенте или скидке, для повторного использования на сайте.", "experience": "Я студент дневного отделения Plutus с двухлетним опытом работы с Cardano и 14-летним опытом веб-аналитики и управления крупными техническими проектами."}