{"id": 381692, "author": "john.jackson", "title": "Formulating a Community Defense", "url": "https://cardano.ideascale.com/a/dtd/381692-48088", "category": 26248, "amount": 26500, "description": "El sector necesita capacidad para prevenir y mitigar el robo y el fraude. Pero carece de una estrategia coordinada. El fraude amenaza la adopción.", "funded": 0, "upvotes": 15357377, "downvotes": 22349324, "votes_result": 6991947, "votes_cast": 85, "f6_no_assessments": 4, "f6_rating": 3.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "With this proposal, the team asks for funding to brainstorm a workshop and resulting from that a coordinated strategy against theft and fraud in the crypto space.", "q0r": 4, "q1": "The team has no relevant prior publication about anti-fraud strategies in the crypto space on their website and the team is set up of police/ex-police as well as scholars in the area of crime. However, without the team of respective experts of the crypto space itself, feasability to come up with a \"coordinated strategy\" that fits all of crypto is unlikely. The proposal does mention, that it might include insiders, but they do not elaborate further on it. I would find it more feasable, if the team gave one specific area of crypto-scam/crime/attacks whatsoever, that they would like to contribute insights to with their knowledge and why they would be the best to be paid to do so. Basically, the proposers would like to receive funding to come together and go through possible strategies, that would be interesting for a crypto community to try out, adapt or align to their protocols to enhance security, which is great. But in general, this proposal does not provide examples, proof of prior work or any technical issue that they identified as a start of their efforts. As is, I find it interesting, but too broad and without the relevant skillset. I think, tho, it would be great if the team came up with a proposal where they offer mentoring to crypto protocols about their expertise in crime and fraud. This way the crypto experts would be able to make use of the crime experts and they could ask specific questions and this would enhance the discussion between crime and crypto experts and would be relevant.", "q1r": 3, "q2": "Auditability is given through a preliminary report, that the community will receive after the team has completed the workshop. The proposers added the word \"electronic\" to explain how they plan on publishing their report, which I find a little strange, since this should be the norm, but I still count it as auditable.", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 22, "ne": 8, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "Fighting fraud is a very important and noble goal. From the problem statement and solution, it is unclear to me how the proposal is directly involved with the Cardano ecosystem. ", "q0r": 1, "q1": "The proposal presented the team with bios, I would like to see links to LinkedIn or similar to verify. Given that the proposal is a workshop meetup, I feel the plan will be implemented sucessfully. I would like the team to expand on post writing of the documents, what is the strategy to spread the knowledge learned (beyond just posting it online), how will the team get the information into the right hands post project.", "q1r": 3, "q2": "The proposal provided a high level roadmap and lined item budget based. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs (write 3 papers by week 5) and a well broken down budget, in this way the team can track performance vs. expenditure over time. As the proposal stands at the moment it might be challenging to audit.", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is for organizing a  workshop to educate the community to develop a strategy and prepare a report.  The workshop and the report will add value however there are vast amounts of resources in this line in the open domain. Crypto/Cardano-specific information might be lacking but I see very little impact due to a single workshop considering the global spread of Cardano. ", "q0r": 2, "q1": "Given the credentials of the proposers, it can be seen that they have the necessary experience in organizing and conducting the workshop with the aim provided in the proposal. ", "q1r": 5, "q2": "The expenditure of 26000USD for one workshop and a report looks high in the face of it. The output of the workshop is subjective and can be argued both ways. I feel it isn't easy to measure the success of the proposal. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "I can see the main point is on assembling experts from within the industry, criminology, and policing to detail fraud, evaluate potential solutions, and develop a strategy. This is an interesting idea. The problem and solution are clear, suitable to the given challenge, show a clear impact on the ecosystem in the long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Futures Working Group Biographies is clearly described, show suitable skills, experiences but without reference/proof (documents/links,...) for verifying; the provided link [https://futuresworkinggroup.com/partners] did not provide any more detail for each team member. The budget structure is clear, however, lack of explanation of the calculation base for each item [ex: why \"Administration and Coordination: $2500\" ?]. Besides, the risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided, however, for better auditability, some information should be added: (1) Profile's link of each team member for verification; (2) Budget explanation of the calculation base for each item [ex: why \"Administration and Coordination: $2500\" ?]; (3) KPIs/ Metrics. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}], "solution": "Reunir a expertos de la industria, la criminología y la policía para detallar el fraude, evaluar las posibles soluciones y desarrollar una estrategia.", "experience": "Mis colegas del Grupo de Trabajo sobre el Futuro son una mezcla de ejecutivos policiales y académicos con experiencia en la aplicación de estrategias de prevención de la delincuencia."}