{"id": 384405, "author": "adilabd", "title": "Incrypture- Structured-FI Education", "url": "https://cardano.ideascale.com/a/dtd/384405-48088", "category": 26248, "amount": 15000, "description": "El protocolo Incryptures Smart Structure no será viable si no se crea una comunidad de usuarios.", "funded": 0, "upvotes": 17023224, "downvotes": 21024161, "votes_result": 4000937, "votes_cast": 86, "f6_no_assessments": 4, "f6_rating": 2.916666666666667, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=3826"], "media": [], "f6_assessments": [{"q0": "(This proposal cannot be considered in isolation but the assessor should be aware of the team's other three proposals as well. Two of them are linked in this proposal.)\r\n\r\nThis feels like an add-on to the main proposals. It wouldn't really bring much value if implemented in isolation.", "q0r": 2, "q1": "Loving the sausage analogy regarding securitization: \"Just take a whole bunch of pigs, cut them up in little pieces, re-package them and sell them off to people who would have never bought the whole pig to begin with.\"\r\n\r\nWhereas this team is great in simplifying complex-sounding financial lingo, they might need another team member or two to help with graphics and video.\r\n\r\nThere's not much of a plan here. More details are needed.", "q1r": 2, "q2": "There is nothing in the proposal that would help track the progress. Auditability is poor.", "q2r": 2, "assessor": "z_assessor_289", "no_vca": 22, "ne": 0, "ng": 15, "nfo": 7, "vca_o": 1}, {"q0": "This project is part of greater Incrypture project in Fund 7. The team propose this project in order to support the implementation of Incryptures Smart Structure protocol by creating Video tutorials and social media outreach to educate the community on structured finance and the economic benefits of using this technology. The bigger project, Incrypture, could drive massive adoption by corporation and has huge potential to be a game changer that solve incompatibilities problem in Blockchain ecosystem. ", "q0r": 4, "q1": "Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides simple but relevant roadmap and requested a reasonable budget. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable but lacks the time target. The other downsides of this proposal are the absence of budget breakdown, project deliverable, and milestone. My suggestion for the team is to update the proposal with more detailed information. ", "q1r": 3, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. The team does not provide deliverables, detailed timeline, or milestone. Team does not mention where they will publish the progress of project execution making it difficult to monitor or audit the project. My suggestion for the team is to update the proposal with more information and details including deliverables, budget breakdown, and milestone. Even with all of the flaws in the proposal, this is sure to be a very potential project that need to be voted.", "q2r": 3, "assessor": "z_assessor_643", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The need for products that simplify complex financial terms are needed. However, this proposal lacks in a few areas that might not effectively address the problem. One of the issues is the lack of experience in education. Teaching is not an easy task as it requires a lot of patience. Putting out videos is great but the need for a professional educator is key to simplifying the complexities of finance. ", "q0r": 3, "q1": "On the professional side, the credentials seem to hold. However, an educator would be an ideal match for this project. Someone who can break down complex concepts and teach it easily. ", "q1r": 3, "q2": "It's difficult to measure success if what we are measuring this with is a running portal and the  production of video tutorials. Some numbers would be great. I'm not confident in this project being auditable. ", "q2r": 3, "assessor": "z_assessor_700", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "I think this proposal fits where it is. You could make a case, and I'd like the proposers to consider this, that the core proposal in the DeFi challenge should be approved before this sort of outreach and education initiative should be approved. Otherwise you could wind up with a cart-before-the-horse scenario where you have an outreach budget but no core development budget. As such I wouldn't blame anyone for thinking twice about supporting this side-proposal in isolation. That being said, this is the miscellaneous category after all, so it's not exactly out of place.", "q0r": 4, "q1": "I won't pretend to have deep knowledge of the financial conundrum this project is attempting to address. But I can definitely speak on the communications aspects that are the focus of this specific proposal, however. I think it is pretty reasonable and all of this could be conducted successfully with the budget and success measures listed. It's very good that the proposers provided a presentation video that a more professionalized advertorial would be derived from, as well. It shows they're thinking ahead. It also sounds like the founder has a decent grasp on how to explain the concept to a non-technical audience, though the team should welcome the help that professional marketing professionals would provide should this proposal be approved. This is just to say: The starting point presented here shows some forethought.", "q1r": 4, "q2": "That being said, a much more detailed roadmap would have benefited this proposal. A timeline, as well as an open plan for allocation of resources with a brief explanation for each should definitely be considered next time. Also, setting up a professional website can be quite an endeavor. Are there any professional web developers that are lined up for the website? These are some of the questions that come to mind that feel fairly fundamental to me that lead to a 2 star rating here. But still, this is a project with some promise and the team shouldn't feel discouraged, I think, should their proposal not make it through.", "q2r": 2, "assessor": "z_assessor_853", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Tutoriales en vídeo y difusión en las redes sociales para educar a la comunidad sobre la financiación estructurada y los beneficios económicos del uso de esta tecnología", "experience": "Incrypture tiene una amplia experiencia en tecnología de titulización. Para llevar esto a Cardano necesitamos marketing, educación y concienciación."}