{"id": 384832, "author": "andreas.kirchner", "title": "Staking for Children", "url": "https://cardano.ideascale.com/a/dtd/384832-48088", "category": 26248, "amount": 200000, "description": "Queremos que las familias se jueguen su dinero.\nLas familias pierden una media de 1.000 euros al año con las cuentas bancarias de bajo interés.\n¿Cómo podemos apoyarlas?", "funded": 0, "upvotes": 19102750, "downvotes": 30037257, "votes_result": 10934507, "votes_cast": 113, "f6_no_assessments": 3, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Sería estupendo disponer de un juguete de confianza para los niños que les enseñara a gestionar una cuenta bancaria y a ganar dinero con las tareas domésticas. Esta propuesta presenta un juguete para niños y familias que puede conectarse a una cuenta bancaria y promueve la educación financiera. Sin embargo, dado que el equipo proponente planea utilizar stablecoins para sus apuestas, el equipo debería incluir cómo planea introducir Cardano a los niños y las familias en su programa educativo para hacerlo más relevante para la comunidad y los votantes.", "q0r": 4, "q1": "El equipo tiene un sitio web en funcionamiento que da prueba de un trabajo previo y haría que la viabilidad de esta propuesta fuera muy alta. Sin embargo, hay algunas partes de la propuesta que no están del todo claras. La propuesta pide todo el fondo de este reto, lo que significaría que ninguna otra propuesta de este reto recibiría financiación. El equipo afirma que han creado un monopolio para \"aprender a ganar\", lo cual es en realidad un tema bastante común en las comunidades de criptomonedas que me gustaría que un equipo proponente conociera. El equipo en sí tiene sólo un miembro con experiencia en cripto y mencionan socios pedagógicos, así como empresas de juguetes - pero no dan ninguna referencia para que podamos buscar esto. Así que si esta propuesta trata básicamente de cripto y educación, la experiencia relevante del equipo no se ajusta a un proyecto tan grande en este momento. El sitio web en sí muestra un producto muy bonito e interesante, que conecta la información de la cuenta bancaria de la moneda fiduciaria en una herramienta digital, lo que suena muy bien. El equipo proponente debería dejar claro, cómo pretende proporcionar opciones de pago y conectar las apuestas y la banca con criptomonedas a través de cuentas bancarias europeas, ya que esto no es todavía común. Lo más importante que echo en falta en esta propuesta son los \"riesgos\". La educación financiera es importante y si el equipo se dirige a las familias y a los niños, la herramienta más importante sería hacernos saber, como comunidad, que van a incluir los riesgos de pagar con cripto, así como de invertir con cripto y los criptoimpuestos. En realidad, creo que este proyecto sería realmente grande si se utiliza una herramienta en la que los niños al comercio de papel o cualquier otra forma no real de aprender a manejar una cuenta con criptomonedas y DeFi. Por el momento, el sitio web parece centrarse en enseñar a los niños a gestionar el dinero fiduciario y supongo que el equipo querrá incluir información sobre las criptomonedas y las monedas digitales. Lo cual está muy bien, pero la propuesta carece de cierta claridad y echa en falta riesgos relevantes que deberían tenerse en cuenta. La hoja de ruta proporcionada es muy confusa e incluye rondas de financiación adicionales así como crowdfunding.", "q1r": 3, "q2": "La auditabilidad no es fácil, ya que se trata de un gran proyecto con muchos pasos y la hoja de ruta y el desglose del presupuesto son confusos e incluyen una financiación adicional que aún no está asegurada. El equipo no ha detallado los riesgos de este proyecto si no se consigue la financiación suficiente para construir el producto previsto. El equipo no incluyó una evaluación de los riesgos que implican para las familias y, obviamente, para los niños, el pago y la inversión en criptomonedas. Es difícil precisar los pasos de la propuesta, ya que se trata de la educación, la creación de un grupo de interés, la incorporación de nuevas familias a esta marca, el desarrollo y la producción de un wearable para que los niños gasten dinero, etc. También es en este momento un proyecto en desarrollo que se centra en el dinero fiduciario - el equipo debería proporcionar mucha más información sobre cómo planea incluir y diferenciar entre el dinero fiduciario y las criptomonedas....", "q2r": 3, "assessor": "z_assessor_19", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "\"The idea of teaching kids to save money with cryptocurrency and using staking to get interest for the financial future of children in the family is a great one.\r\n\r\nBut when I read this proposal I see that the proposer who is looking for a 200,000ADA fund has exceeded the budget of this challenge. With the impact that the proposal brings is not too much, but it does not seem reasonable to need such a large amount of money\"", "q0r": 2, "q1": "\"I found the proposal to show the relevant experience of team members in a very general way and not specifically how many people the team has, what is the specific experience of each person.\r\n\r\nBesides, the proposer has not shown us a specific plan for what they will use the funds for, how many families and children they aim to help and how much money the children will save. How much is through the application of the proposal.\r\n\r\nPlus, their app is currently connecting with traditional banks. Proposal also hasn't laid out how to integrate Cardano's wallet into the app and how to encourage people to use crypto instead of fiat.\"", "q1r": 1, "q2": "\"Proposal does not have a specific plan for all that the proposer writes in the proposal. We have absolutely no idea what they used that money for and how to use it to achieve what results. Therefore, it is almost impossible to audit\r\n\r\nSo, i think proposer should have a specific plan with a specific target like: amount of money children will save in this platform.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Definitely a unique proposal for the Cardano blockchain. Teaching kids and giving them early adoption of financial education is a privilege as previous generations lack of incentives like this during their childhood. Moreover, the proposal fits into dApps & intergration, I think. The solution given is a good way to also teach children about the innovative prospect of the digital age towards finance and its values.", "q0r": 5, "q1": "I do believe the future of cryptocurrency will be the young pioneers of tech and given opportunities to the youths. The roadmap of the proposal is well delivered, and the website have already given confidence for voters for this proposal to move forward. Though, risks to be addressed, and management are not prepared, but the proposer have presented its detailed business model and sales strategy for this project.", "q1r": 4, "q2": "The proposal is complete and solid enough to understand what the vision is, along with the overview of how the finny app works from the video attached. Budget allocation is well planned and key metrics and milestones for the proposal are clear. Therefore, I think it does add value to the current diverse community of Cardano.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Cardano es PoS. Con stablecoins y recompensas de estacas, ofrezcamos un incentivo para ahorrar dinero. Dejemos que las familias con hijos den los primeros pasos en DeFi.", "experience": "Somos una startup de educación financiera con 3.000 usuarios\nTenemos socios pedagógicos para desarrollar una solución\n1 cofundador tiene conocimientos de criptografía"}