{"id": 385048, "author": "amolagg", "title": "AI in geological analysis", "url": "https://cardano.ideascale.com/a/dtd/385048-48088", "category": 26248, "amount": 8000, "description": "Las técnicas actuales de análisis geológico son de naturaleza invasiva y muy expansiva.", "funded": 0, "upvotes": 16938466, "downvotes": 22524386, "votes_result": 5585920, "votes_cast": 95, "f6_no_assessments": 5, "f6_rating": 1.2, "videos": [], "media": [], "f6_assessments": [{"q0": "Este problema es realmente difícil de encuadrar en otro reto que no sea el de la miscelánea, debido a su naturaleza específica (juego de palabras). La idea principal es utilizar algoritmos de aprendizaje profundo para ampliar las formas de realizar análisis geográficos no invasivos. Sería muy beneficioso para la propuesta incluir alguna información sobre cómo esto sería relevante para el Ecosistema Cardano directamente, y cómo la propuesta pretende integrarse en/usar Cardano. La propuesta está explicada muy brevemente y necesitaría más información sobre el producto y el proceso reales para ser entendida y evaluada. Estos dos puntos clave mencionados aumentarían la comprensibilidad del proyecto y reforzarían el planteamiento del problema. En mi experiencia como Community Advisor de varios fondos, tener una clara conexión con Cardano junto con un claro planteamiento del problema seguido de una solución comprensible y detallada es clave a la hora de redactar las propuestas. En este momento, debido a la falta de información, es difícil comprender el alcance del proyecto (plazos, hitos, costes, etc.), pero llegaremos a eso más adelante. Sobre la base de estos aspectos mencionados anteriormente, estoy totalmente en desacuerdo con que esta propuesta aborde efectivamente el reto.", "q0r": 1, "q1": "A la propuesta le vendría bien mucha más información del proceso de desarrollo, junto con una descripción de cómo se desarrollarán y utilizarán las técnicas de análisis geológico, y cuál es su impacto en contraste con las utilizadas actualmente. No soy en absoluto un geólogo, pero tengo bastante experiencia trabajando como investigador, y sugeriría añadir más detalles en la propuesta para hacerla más comprensible y tangible. Tanto para las personas con experiencia en geología como para las que no la tienen. También sería beneficioso con una presentación del equipo central/proponentes que trabajarán en el proyecto. ¿Cuántos años de experiencia en geología tiene el equipo, está formado por varios miembros, se utiliza actualmente el prototipo de análisis geológico (mencionado en el apartado \"experiencia relevante\")? ¿Dónde podemos obtener más información al respecto? ¿El producto está destinado a ser utilizado por el mundo académico? Y lo que es más importante, después de responder a todas estas preguntas, sugeriría que se proporcionara una fuente verificable que pueda reforzar la competencia y la experiencia de los miembros del equipo. Quizás a través de perfiles de LinkedIn, universidades asociadas, etc. Por último, me habría gustado que se incluyera un plan presupuestario más detallado. Cuánto dinero se utilizará para el desarrollo, los materiales, etc. ¿Y cuántas horas de trabajo se estiman de principio a fin (quizás por semana)? En definitiva, debido a la falta de información necesaria, estoy en total desacuerdo con que sea probable que esta propuesta se lleve a cabo con éxito.", "q1r": 1, "q2": "Como ya se ha mencionado, esta propuesta se beneficiaría mucho si se incluyera una hoja de ruta con hitos en un plazo estimado. De este modo, se podría auditar de forma transparente y la comunidad podría seguir el progreso durante el desarrollo (preferiblemente a través de los canales de comunicación o la página web del proyecto). Algunas sugerencias de preguntas clave a las que responder ¿Cuántos meses/años se tardará en desarrollar el prototipo inicial? ¿Cómo se probará y quién lo hará? ¿Cuánto durará la fase de pruebas y cómo se medirá el éxito (KPI)? Además, ¿qué ocurre si algo inesperado sale mal durante el desarrollo? ¿Cómo pretende el equipo combatir los posibles problemas durante el proceso? Si se incluye en la propuesta un breve texto sobre las reflexiones del equipo sobre estas cuestiones, se reforzará la credibilidad y la perspectiva del equipo, y si esas reflexiones se comparten con la comunidad, se reforzará la confianza y la transparencia generales de todo el proyecto. Por las razones que acabo de describir, estoy totalmente en desacuerdo con que esta propuesta me proporcione suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 1, "assessor": "z_assessor_349", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "The proposal is to sponsor research for a noninvasive Geological survey using AI. The proposal will contribute to Geology however its benefit for Cardano looks remote and may not address the challenge except to create goodwill in the Scientist community. ", "q0r": 2, "q1": "The proposer has one year of experience as a Deep Learning Engineer and had been an Interned at Google. This may not be sufficient for the proposed Research. High-end reserch will require academic guidance from a Univercity. ", "q1r": 1, "q2": "The proposal is to fund Research project for an AI-based Geological survey. There is no major plan presented and who will validate the research. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 21, "ne": 0, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been voting since Fund 4 and have experience analyzing business requirements from 7 years of delivering software as a QA engineer.\r\nThough the problem statement is clear, it does not seem to me like it pertains to Cardano. The solution, while it does address the problem statement, is too vague in my opinion and again it is unclear what the role of Cardano, or blockchain for that matter, would play here. A good proposal should always outline this, in order for non-technical voters to understand why it would be valuable to fund it. Due to this and the lack of any type of KPI or concrete goal, I have to strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposer claims to have 1 year of experience as a Deep Learning Enginner and to have interned at Google, but no references are provided to prove this. Please keep in mind that it is pretty much expected of all proposals now to provide at least a Linkedin profile, or something similar, where the community can see your relevant experience and background.\r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. Please keep in mind that these are all vital parts of a proposal.", "q1r": 1, "q2": "Unfortunately, no roadmap is provided, there are no KPI's and it is basically unclear what this proposal aims to do to better the Cardano ecosystem, so I strongly disagree that this proposal is auditable.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 22, "ne": 4, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about building a Non-Invasive Geological analysis system, highly efficient and accurate through Deep Learning Algorithms. It seems that this proposal is incomplete. The problem statement [current Geological Analysis techniques are invasive in nature and very expansion] is clear but not explained in detail. Conceptually, I think the proposed solution has a certain fit for the challenge. The solution is oriented towards building such a platform having satisfactory and has potential impact if completed. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "It's not easy to evaluate a proposal that is incomplete [limited information of experience, doesn't have any roadmap or KPIs, and of course the risk is not defined]. Therefore, definitely, there are no grounds to agree on the feasibility of this proposal, however, if I had to give one piece of advice, I think: in case it is necessary to complete this proposal in the next Catalysts in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals & target; (2) road map/timeline (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I strongly disagree with this proposal's feasible, and would give it a score of 1.", "q1r": 1, "q2": "For an incomplete proposal like this one, transparency can't be guaranteed. Therefore, I don't have much advice. Based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Thank you for your interest in natural matters. besides i would like to know the real problem you bring up is that we are going to have explicit concrete method in Geology. Do you want a method to protect nature or a clear method to exploit more effectively? When the problem is clear I think we can understand the effective method that AI will bring", "q0r": 2, "q1": "In terms of feasibility, I hope you can elaborate more on your personal profile as well as your team such as whether there is someone responsible for the financial or blockchain aspect. Also I hope you can show us the short and long term project roadmap. And the criteria you need to achieve in the future, I think it is necessary for your project. The nature of this project requires state permission as well as a high level of expertise in geology. Currently, many countries can already use AI for jobs ranging from geological measurement and analysis to real estate. This project will be more feasible if you have specific plans and clear roadmap. From there we can build from high community demand.", "q1r": 2, "q2": "In the roadmap I hope you can describe what value you want here, \r\nvì số tiền bạn chi cho AI là rất tốn kém. you require an investment of up to 8000$ which is quite a large amount.You should explain how you will use this money? For how long and how can people see you using it?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "A través de Algoritmos de Aprendizaje Profundo podemos construir un sistema de análisis geológico no invasivo, altamente eficiente y preciso.", "experience": "Consiguió financiación para desarrollar el prototipo de un Sistema Geológico.\nIngeniero de aprendizaje profundo - 1 año\nHice una pasantía en Google."}