{"id": 381401, "author": "dwayne", "title": "DAO-NET: Sybil Defense DAO", "url": "https://cardano.ideascale.com/a/dtd/381401-48088", "category": 26237, "amount": 94400, "description": "La autenticación anónima resistente a los sibilinos es un reto común para las DAOs, sin embargo, no hay soluciones o servicios de código abierto en Cardano.", "funded": 1, "upvotes": 79341571, "downvotes": 12296463, "votes_result": 67045108, "votes_cast": 394, "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "La insistencia de Cardano en la importancia de la identidad es una de las principales características distintivas y ventajas comparativas. La infraestructura general de la DAO-NET es una ambiciosa plataforma de despliegue que no sólo tiene en cuenta el marco legal, sino también la necesidad más amplia de financiación de las DAO, así como diversos aspectos que permitirán a las DAO integrarse en el mundo real con todos sus requisitos de cumplimiento legal. Este requisito específico de los mecanismos de prueba de identidad es particularmente importante y es algo que definitivamente llevará a las DAOs a optar por usar Cardano sobre otras blockchains.\r\n\r\nComentario: quizás incluir una descripción de lo que es el ataque Sybil. Otra cosa que podría elevar la propuesta es un mayor énfasis en por qué exactamente es importante poder ser robusto contra los ataques Sybil.", "q0r": 5, "q1": "Los proponentes incluyen enlaces a sus perfiles de LinkedIn y enumeran una experiencia relevante que suma 29 años de consultoría informática/desarrollo de software. Por supuesto, carecen de miembros del equipo con la experiencia necesaria, pero identifican claramente qué funciones buscan cubrir y cuáles son exactamente las habilidades que buscan en esos miembros del equipo. Esto indica que han hecho una investigación adecuada de los antecedentes y una clara conciencia de las limitaciones de sus conocimientos, pero lo que es más importante, y la capacidad de identificar lo que se necesita para resolver esto. El calendario es transparente y se desglosa en objetivos mensuales. Es difícil evaluar hasta qué punto es realista (auditoría de terceros en mayo de 2022 y testnet en junio de 2022), pero con un equipo muy sólido es posible. Siempre hay retrasos en los procesos complejos, así que se dan cinco estrellas porque el plan y los numerosos detalles transmiten que se toman en serio el desarrollo de esta solución, y estoy convencido de que efectivamente lo harán, aunque junio de 2022 sea un objetivo ambicioso. También contiene un análisis de mitigación de riesgos.\r\n\r\nComentario: teniendo en cuenta las numerosas propuestas que forman parte de DAO-NET, y que cada una de ellas está presupuestada para poder ser ejecutada de forma independiente, sugeriría que incluyeran también una breve descripción o algún tipo de plan de contingencia que explique cómo podrán descargar parte del trabajo asociado a la coordinación de todos estos proyectos (suponiendo que puedan contratar a desarrolladores capaces que hagan el trabajo pesado real).", "q1r": 5, "q2": "Esta propuesta no sólo contiene métricas claras mes a mes para el éxito, sino que también incluye 3, 6 y 12 meses y fechas claras de lanzamiento para cada etapa (testnet, lanzamiento público). Además, también contiene un enlace a un repositorio de GitHub para que sea posible seguir continuamente el progreso del proyecto. Por último, las medidas de los KPI se enumeran en términos de métricas cuantificables, por ejemplo que 6 DAO lo utilicen en el sexto mes y que haya al menos 1000 miembros de DAO que lo utilicen.", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Create a DAO to develop secure, open source anti-Sybil anonymous authentication solutions for the DAO Net. Creating a DAO will maintain and improve the solution in the future and provide the solution as a service to other DAOs. I totally agree with this idea, it is deployable on many other DAO projects and fits the criteria of the challenge", "q0r": 5, "q1": "\"Using open source Proof of Humanity for Ethereum will be migrated to Cardano. This idea's solution was also used by the team for the \"\"DAO-NET: DAO Deployment Platform\"\" idea that the team submitted in this challenge. The team identity is public and experienced in the development of Plutus, key partners are public. The proposed amount should state how much to use for which item, for example the number of members involved in smart contract development\"", "q1r": 4, "q2": "\"This idea is a functional part of the \"\"DAO-NET: DAO Deployment Platform\"\" idea that the team also proposed in this challenge. The team needs to add indicators to measure the success of each content to be implemented. Challenges and risks are also mentioned, it would be great to have solutions to these risks.\"", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This is an open sourced proof of humanity solution that will be sybil-resistant and other daos will be able to take advantage of it. I really like the idea of this project being open source, because the ecosystem really needs this right now. Your proposal is in line with the challenge settings considering it's tooling for daos. The authors managed to convinse me in the value they will be bringing to the cardano ecosystem. I know Dwayne Collard is an active member of the community and is a voice of reason in the telegram channels.  The key metrics are really well thought through and are pointing in the right direction to measure adoption. Currently I don't see anythig missing in this proposal.   As a developer I was a bit concerned about finding the right people, but then I saw they started looking for people at the end of november and will have separate teams for their different proposals and each proposal is a standalone project. So no worries there.", "q0r": 5, "q1": "There are plenty of links left to verify the team members credability and I really like the structured way of this proposal, saying what the needed skillset of the future team members and showing what they already have as well as what they're looking for. I can appreciate the transparency that brings. IMHO this brings credability to the peorject in the eyes of the voters (me included).  The budget is outlined clearly and is broken down well enough to be understandable by everyone reading the proposal. The execution plan seems very reasonable, although it depends on whether or not they will be able to find those mentioned team members. As a developer I believe the timetable is realistic to do the mentioned work. The fact that it's open source adds to the credability of the project and helps it to scale if necessary. I also love how there's a plan for self funding down the line. Not many proposal think in that direction and this is what separates the long lasting project apart from the short term ones in my oppinion. The plan describes the resources necessary to implement the proposal along with a very detailed list of possible future challenges along with an even longer list of mitigations for those challenges.  There are resources linked in the proposal for anyone that wishes to read on about the more technical part of the project.  Overall I have no doubt that the project is not only feasible but it will last. I will vot for you!", "q1r": 5, "q2": "There's no shortage of information for the community to follow along with the projects development. There's a linked github repo where all development will happen, so that's more than enough for anyone looking at the proposal to follow along with the growth of the project. The metrics and KPIs are on point, and there's a succinct definition of succes. Roadmap - check, milestones - check and a time horizon to bring all the parts together. The problem and solutions statements make sure to explain in an understandable manner what the proposal is all about.   Overall a great idea, a great proposal that will be auditable by the community. ", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 20, "ne": 7, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The team proposes an open source solution for anonymous identity management for DOA. If successful the proposal will create a better solution (Proof of Humanity) to manage a DAO on the Cardano blockchain, this directly addresses the challenge brief and thus in my opinion the proposal is aligned with the challenge brief. ", "q0r": 4, "q1": "The proposal addresses risk and mitigation very well, various risk were identified and mitigations proposed. The team have a plan for future funding and laid out the goals and road to market. The team provided links to LinkedIn for the team leaders and also provided a link to a github. The team leaders appear experienced to successfully execute the project, however, the team is not complete, it appears that the team still has to find three developers (cryptography, Plutus, Frontend Dev). The time required to find and hire the correct team members (contractors) might affect the team’s ability to execute successfully and on time.", "q1r": 3, "q2": "The proposal provided a detailed roadmap and budget. KPIs were identified and tied to measurables. It would be great if the team could connect the roadmap and budget to the deliverables, at the moment the budget is mainly allocated to pay for labour (Developer @ $4k for 6months) , if the budget (labor) is connected to the roadmap and deliverables the team can track spending over time versus performance. My one concern is the size of the ask, $94,400 – I would advise the team to break down the budget to run from catalyst fund to catalyst fund (roughly 3month period), the catalyst community in past have supported projects over multiple funds (example MinSwap)", "q2r": 3, "assessor": "z_assessor_358", "no_vca": 23, "ne": 3, "ng": 18, "nfo": 2, "vca_o": 1}], "solution": "Crear una DAO para desarrollar soluciones de autenticación anónima seguras y de código abierto resistentes a Sybil para DAO Net y otras DAOs.", "experience": "Un equipo experimentado de desarrolladores de Blockchain, pioneros de Plutus, operadores de SPO, asesores de la comunidad y analistas de soluciones."}