{"id": 384636, "author": "quasar", "title": "DisWOCO", "url": "https://cardano.ideascale.com/a/dtd/384636-48088", "category": 26237, "amount": 7000, "description": "Catalyst y Cardano necesitan una Cooperativa de Trabajo Distribuido", "funded": 0, "upvotes": 17756881, "downvotes": 21195685, "votes_result": 3438804, "votes_cast": 210, "f6_no_assessments": 5, "f6_rating": 1.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I have reviewed a number of proposals from QUASAR in this fund, I did so for all in fund6 and they were all of a similarly vague format. Please provide a concrete proposal with clear deliverables and time frames", "q0r": 1, "q1": "There is no clear plan presented. I remember reviewing all the ideas by QUASAR in fund 6, and reading all the other reviewers comments on their proposals in the voting stage. The proposals were all relatively vague, with difference expertise stated for each one with no evidence to back them up. They were rated poorly by all reviewers. I have little confidence this proposer will successfully deliver on this proposal given this history and the limited details provided in this proposal.", "q1r": 1, "q2": "There are no clear deliverables or associate timeframes. No metrics for success have been presented. Please provide a clear timeline of what you will deliver by when so delivery can be audited. Please also provide some clear metrics with attached goals so that success can be measured.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 32, "ne": 3, "ng": 22, "nfo": 7, "vca_o": 1}, {"q0": "This is a draft proposal. Relevant information about the impact of this proposal is missing. This proposal is not executable nor does it provide information on how this idea will create value to the Cardano Ecosystem .", "q0r": 1, "q1": "The proposer doesn't provide any information. The idea is not clear described. A plan is missing. \r\nAlso we don't find any information about the proposer.  \r\n", "q1r": 1, "q2": "No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project. ", "q2r": 1, "assessor": "z_assessor_484", "no_vca": 23, "ne": 0, "ng": 14, "nfo": 9, "vca_o": 1}, {"q0": "This proposal is aimed at providing services that are not related to DAO's and the purpose they serve. Payroll and insurance are two things that hare hard to see creating value and ease of use that will attract future DAOs to the Cardano ecosystem.", "q0r": 1, "q1": "They do not provide specific information on their experience nor who the team is comprised of. There is no plan presented to achieve their goal and no explanation of the budget and its expected use.", "q1r": 1, "q2": "There is no information provided that wouid allow us to measure the success and progress of this proposal. An audit would need a detailed roadmap, and a plan for the budget which is not provided in this proposal.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 22, "ne": 1, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "This proposal raises some issues that do need to be solved, however it does not show how it would provide these solutions.", "q0r": 1, "q1": "\"Please present an actual plan to deliver a solution with timelines and proof you have the experience to do so.\r\n\"", "q1r": 1, "q2": "As there are not deliverables mentioned, the is no way to audit progress or success of this proposal.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 22, "ne": 0, "ng": 13, "nfo": 9, "vca_o": 1}, {"q0": "This proposal focuses on creating an employment cooperative that provides payroll, insurance, and other benefits for future DAOs and DisCOs. The problem statement is not explained [why Catalyst and Cardano need a Distributed Worker Cooperative ?]. Because this proposal is not completed, the solution is still very abstract, however, in my opinion, the idea of such an employment cooperative is very worth trying for completing in the future. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "Proposer's profile is briefly described but remains very abstract, without any proof/link for verification. Besides, plan detail is also not provided. Therefore, there is no proof of feasibility. My advice would be: in case it is necessary to complete this proposal in the future, the proposer should pay attention to ensure that the following components are fully met: (i) Goals and target; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "It is quite hard to assess a proposal that is incomplete like this where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Crear una cooperativa de empleo que proporcione nóminas, seguros y otras prestaciones a los futuros DAO y DisCO.", "experience": "Llevan proporcionando seguros, prestaciones y nóminas desde 2004. Veterano de Catalyst."}