{"id": 383191, "author": "nvhieu", "title": "Simplify SPO operations in Vietnam", "url": "https://cardano.ideascale.com/a/dtd/383191-48088", "category": 26246, "amount": 19670, "description": "La mayoría de los grupos de interés se ejecutan en proveedores de alojamiento comunes (AWS, GCP, Azure). necesitamos una red autosuficiente en lugar de lo que es ahora.", "funded": 1, "upvotes": 42251770, "downvotes": 13787296, "votes_result": 28464474, "votes_cast": 150, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta hace un muy buen trabajo para abordar el desafío, que es ayudar a la descentralización del grupo de operadores de Cardano. Inicialmente, en mi primera lectura de la propuesta, pensé que la decisión del proponente de optar por una solución doble (a. simplificar la configuración y proporcionar guías para el pool de estacas y b. proporcionar un kit de producto de pool de estacas de energía solar preconfigurado para el mercado) podría ser exagerada. Sin embargo, pensándolo bien, hay mucho valor en un enfoque combinado y también abre la puerta a sinergias que son naturales. También diría que la propuesta está bien desarrollada en cuanto a un plan de aplicación, con mi impresión general de que ofrecerá una buena relación calidad-precio si se aplica bien. He participado en el Proyecto Catalyst desde el principio y he sido un CA y un vCA. Además, he montado una Raspberry Pi y la he utilizado (como no técnico), además de haber trabajado para montar un stakepool durante los días de la ITN en una máquina Ubuntu (que no es una Raspberry Pi) en casa (no la finalicé, por desgracia). Probablemente yo sería un ejemplo de persona que podría beneficiarse (si fuera vietnamita) de una propuesta de este tipo. Así, lo que podría ver como un ligero problema es que el planteamiento del problema en esta propuesta identifica correctamente que \"la ejecución de grupos de interés en las principales plataformas de la nube ofrece comodidad ... por lo que la mayoría de los grupos de interés se ejecutan en 3 grandes proveedores de la nube (GCP, AWS, Azure)\". Sin embargo, parte de la solución ofrecida es desplegar un sistema de pool en la nube como ejemplo, y luego grabar los pasos como videos. Parecería más lógico desplegar el sistema de pool en Raspberry Pi como ejemplo (que ya forma parte de la propuesta) o al menos en un servidor físico Linux - para abordar mejor los problemas reales a los que se enfrentaría una persona no tecnológica. La propia propuesta afirma que pretende simplificar la configuración para las personas no tecnológicas, así que - mi sugerencia sería centrarse en el despliegue sin nube como ejemplo, y grabar vídeos de este proceso que un no tecnólogo con una Raspberry Pi o un ordenador doméstico sea capaz de aprender más. En efecto, podría ser una buena idea para cambiar el orden, por lo que en lugar de iniciar la aplicación con \"crear instrucciones sencillas, videos, y la configuración, las secuencias de comandos de funcionamiento en vietnamita\", que podría seguir después de que el kit de la piscina de la energía solar Bare-metal es creado y operativo. Sólo ENTONCES hacer un conjunto completo de instrucciones, vídeo que también abordaría las cuestiones específicas para ese kit de SPO solar y otros similares, así como abordar las cuestiones generales de configuración de stakepool. Esto generaría un mayor impacto, ya que el kit y las instrucciones estarían perfectamente alineados y serían compatibles.", "q0r": 4, "q1": "El proponente ha hecho un buen trabajo al desglosar el presupuesto en componentes más pequeños y para una propuesta con un horizonte muy bien visible, ayuda a visualizar el proyecto también. Cuando sumé los componentes del presupuesto, los costes totales no coincidían con la suma del proponente [(1)+(2)+(3)+(4)+(5)+(6)=750+650+600+350+15820+1500=19.670$]. Mi cálculo dio un total diferente, basado en el desglose del presupuesto que el proponente proporcionó. Sin embargo, la suma a la que llegué fue de 19.570 dólares, lo cual es un error inmaterial de tipo tipográfico por parte del proponente. Puede que no haya necesidad de una doble configuración de un stakepool (en Cloud y en bare metal) si la idea es promover configuraciones de SPO no en Cloud - sin embargo el proponente puede tener una razón válida y no estoy restando puntos por ello. Me interesaría saber si una batería de 150 dólares y un estabilizador de 100 dólares serían suficientes como respaldo para una piscina de estacas alimentada por energía solar (¿o quizás sólo para el productor de bloques, no para los relés también?). Si es así, sería una solución increíble. Por lo tanto, elogio al proponente por incluir como parte del proyecto un componente diseñado para calcular el consumo de energía para la Raspberry Pi que ejecuta un stakepool de Cardano. El equipo proponente ha proporcionado una gran transparencia en cuanto a sus competencias básicas y ha participado en la fundación de stakepools vietnamitas. Uno de ellos es -según su perfil de Linkedin- experto en el diseño y la fabricación de equipos (Python, C#, codevisión, luces LED solares, luces de pesca LED) y desde 2018 estaba involucrado en la investigación sobre blockchain y Haskell, con un máster en electrónica e ingeniería eléctrica. La viabilidad parece ser una obviedad. Lo que sí recomendaría es que el equipo intentara ponerse en la posición de una persona no tecnológica, ya que están haciendo toda esta propuesta para dichos \"consumidores\". De hecho, sería muy bueno -si esta propuesta no pasa este fondo- volver a presentarla con una incorporación al equipo. ¿Quién? Una persona no tecnológica con poca familiaridad con Cardanoi. Esta persona no técnica sería una parte integral del equipo, señalando lo que no es comprensible y lo que necesita ser explicado mejor. El presupuesto podría aumentarse en consecuencia, para cubrir la contratación de la persona no técnica (esperemos que entusiasta) (pero con una tarifa horaria más baja) - como un \"conejillo de indias\" que ayude a garantizar que las guías entregadas son realmente comprensibles para una persona no técnica. El equipo ha identificado algunos riesgos, como las dificultades para desplegar un pool de estacas bare-metal en la Raspberry PI - creo que las posibles soluciones deberían haber sido analizadas con mucho más detalle en la propuesta (y concretadas en algo más que unas pocas palabras) - ya que esto es crucial para el éxito de un pilar clave de esta propuesta.\n", "q1r": 4, "q2": "El equipo ha dado una hoja de ruta general muy buena para sus actividades planificadas. Las métricas/KPIs parecen estar un poco inacabadas. Habría sido bueno medir el tiempo que una persona no tecnológica requiere para configurar el grupo de apuestas final con 2 relés y 1 BP en Raspberry PI con energía solar - SIN ninguna ayuda del proponente. Esto también ayudaría a identificar los puntos débiles antes de la propuesta de seguimiento prevista para el próximo fondo - que llevaría a la identificación de al menos 5 SPO vietnamitas para participar en el despliegue. Algunos pasos parecen un poco difíciles de auditar, ya que no tenemos un formato de entrega propuesto. Por ejemplo, el \"Embalaje físico del kit del fondo común\" es una definición de éxito después de 6 meses. Sin embargo, no tenemos información sobre lo que sería un \"embalaje físico exitoso\" y lo que es un \"embalaje físico no exitoso\". O \"redimensionar la configuración del hardware. Proporcionar una construcción optimizada de materiales y especificaciones\" - parece un objetivo, pero ¿cómo se proporcionará esto? ¿Un folleto/manual en el \"embalaje físico\"? ¿O algo más? ¿Cómo se auditarán estos pasos? Otro ejemplo de definición de éxito después de 4 meses es: \"Hacer funcionar una piscina de estacas con 2 relés y 1 BP en Raspberry PI usando energía solar\". Mi pregunta es: ¿significa esto encenderlo y hacerlo funcionar durante 5 épocas o significará hacer funcionar el stakepool con 2 relés y 1 BP con energía solar durante 6 meses (ya que la propuesta pide 3 IPs*6mes ~ 250 USD)? Sería bueno dar un plazo preciso, para que el éxito pueda ser claramente auditado. ¿Qué probabilidad hay de que se cumpla otro objetivo de éxito (\"El primer bloque se acuña en el kit de estacas de energía solar\") después de cuatro meses? ¿Si sabemos que la acuñación de bloques depende mucho de la delegación de participaciones y la Fundación Cardano podría decidir no delegar parte de su participación en el nuevo pool? Utilizar un incentivo de 1500 dólares para atraer a los delegados podría parecer un uso ineficiente de los recursos - y no estoy seguro de que realmente funcione para sustituir una participación de la Fundación Cardano (así que tal vez podría proporcionar un desglose de cómo se utilizarían los 1500 dólares específicamente). Otros productos de la propuesta \"Cálculo del retorno de la inversión\" (16 horas de trabajo) - parecen poco claros en términos de entrega. ¿A quién se entregará, cómo se presentará, en qué formato debemos esperar verlo? También \"Compartir cómo crear una piscina de estacas con energía solar\" - esto parece un poco vago... de nuevo ayudaría a la auditabilidad y claridad de la propuesta especificar qué tipo de material se compartirá, dónde, cuándo y si este componente será una guía de vídeo, un documento electrónico, un breve folleto de diez pasos. Si la propuesta no es aprobada por este fondo, sería bueno ser muy específico al volver a presentarla, para ofrecer pasos más claros y auditables. Tengo la sensación de que toda esta información ya está disponible en la mente del equipo proponente, así que lo mejor es poner todo el plan que implica los resultados en papel. El hecho de que el equipo reconozca que puede haber dificultades para el despliegue de un pool de estacas bare-metal en la Raspberry PI - probablemente significaría que el presupuesto debería reflejar los posibles costes implicados en la búsqueda de alternativas (hay una reserva para riesgos en el despliegue, pero ¿cómo se obtuvo esa suma de 1.500 dólares?) - o explicar cómo afecta esto a la solución propuesta.\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "Great Idea and necessary for Vietnam.", "q0r": 5, "q1": "This proposal is so clear and detailed. Member in this team also have experience. I believe that this idea can successful. In other side, I wonder that are you sure that need so more money like above? $1 USD = 23,010 VND, $19670 is so much for one project in Vietnam. Moreover, $70/ hour is too much and did not appropriate.", "q1r": 4, "q2": "The information provided clear and detailed. Have left a lot of personal information to prove the authenticity of the project. The people who carry out the project are experienced, well qualified. I am also a student of Vietnam National University, Ho Chi Minh, although not in the same city, but in the same training place. I know better than anyone to be a lecturer in this environment is very difficult, must be really nice. ", "q2r": 4, "assessor": "z_assessor_756", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "I strongly agree this challenge is critical to achieve Cardano's decentralize mission. \r\n\r\nThe proposal addressed the key concern of of Vietnamese communitive. The more stake pool operates, the more decentralize the network will be. Bringing the renewable energy sources to operate the stake pool also great idea for sustainable development.\r\n\r\nIt would be great if proposer provide more information about how many percent of stake pool in Vietnam as compared with cardano's total stake pool then voters can image how can this proposal can impact to Vietnamese community.", "q0r": 5, "q1": "This proposal is very likely to be successful based on the definition of success set out in the plan. The proposers are currently Stake Pool Operator then they have all the experience in running it. \r\n\r\nThe budget is clear and reasonable for each items. The milestones are realistic and feasible. \r\n\r\nThe only point I would add is a deeper analysis about the solar solutions: ie: the average of energy consumption for each stake pool per month. If it is a big amount then the solar energy can help, bare in mind that the solar panel and battery are also not environment friendly.", "q1r": 5, "q2": "\"The proposal includes a roadmap with targets and a plan extending to June 2022 and the mass adoption will be consider in next fund which show a carefull approach of proposers. \r\n\r\nThe proposal shows detailed steps, milestone and deliverables that will be simple to check if the project is running on schedule. \r\n\r\nOn the material to run SPO in Vietnamese (including the documents as well as the video), i would suggest proposer provide KPIs for the audience reach (ie: subscriber on youtube channel, website visitor increase...)\"", "q2r": 5, "assessor": "z_assessor_819", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "In my opinion this proposal could improve the stakeholder participations in the Cardano community Stake Pool Operators and the developer work on cardano blockchain.\nThe proposal have the correct mix from building and deploying a new kind of stake pool (bare metal vs cloud), ecological solar power, passion for creating educational contents…\nHowever the objective of the proposal is interesting and it’s good for growth the Vietnamese community, but I think it's important to enrich the proposal with other kind of support for SPOs, because only building a new stake pool doesn’t enough to improve economics for Vietnamese communities.", "q0r": 4, "q1": "The proposer team has very good experience, because they are very well experienced Stake pool operators member. \nThe metrics for the assessment are given, so it’s possible to assess what the proposer wants to do and the success of his actions. Roadmap and milestones are described (date, actions, kpi).", "q1r": 4, "q2": "Roadmap and milestones are basically described. The budget’s information provided is described. There aren’t a lot of KPI to identify the proposal goal, but only deliverables. There are some details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution. Futhermore there are basic information to asses.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Simplificar la configuración y el funcionamiento de las guías de las piscinas de estacas para que las personas no tecnológicas puedan hacerlo. Ofrecer al mercado aparatos de piscinas de estacas de energía solar preconfigurados.", "experience": "Somos SPOs, moderadores de Townhalls orientales, expertos en tecnología blockchain, electrónica y automatización."}