{"id": 385130, "author": "janet", "title": "End world Hunger in a Day", "url": "https://cardano.ideascale.com/a/dtd/385130-48088", "category": 26247, "amount": 50000, "description": "世界食糧計画によると、1日に24,000人が飢えで亡くなっています。世界はUNSDG2の2030年までの飢餓ゼロ達成に向けて順調ではない", "funded": 0, "upvotes": 17835341, "downvotes": 16390416, "votes_result": 1444925, "votes_cast": 129, "f6_no_assessments": 10, "f6_rating": 1.7333333333333332, "videos": [], "media": [], "f6_assessments": [{"q0": "This has nothing to do with the challenge apart from the proposer claiming to be COO of singularity net. \r\nEven if we think this might be a good idea, there are no details on how the money would actually be spent to end world hunger. ", "q0r": 1, "q1": "No details on marketing plan to convince people to donate the money. More importantly no mention of how the money would be used to end world hunger. Are you buying $300Bn of food? How would you deliver it. How would you continue to deliver it for eternity? If I eat today I am still hungry tomorrow.\r\nAre you helping all people own arable land and providing them with seed? ", "q1r": 1, "q2": "There is not plan to actually end world hunger and no delivery dates. Even if food could be delivered, how are you measuring if world hunger has been eradicated?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 33, "ne": 3, "ng": 26, "nfo": 4, "vca_o": 1}, {"q0": "This proposal proposes a single day viral social media marketing campaign targetting the world's wealthiest individuals to donate a minimum of 1K USD in order to end world hunger. Kind of like LiveAid, but online and without the music. Participants are rewarded with a symbolic NFT as a token of participation. \r\nI understand that the idea stems from an altruistic thought of improving the world, especially for those of us who suffer the most today, but the notion of deploying AI-spiders to hunt wealthy people online is frightening. A person's financial status is private data that no other should have business with. ", "q0r": 2, "q1": "The proposer is SingularityNet's COO, who undoubtedly has relevant competencies. Yet I wouldn't go as far as revolutionary power as the decision to partake is still up to the individual. The proposal sheds no light on how the campaign would get organised. Is this a one-(wo)man-operation or does it require a team? If so, what steps are being taken to assemble such a team? I'd suggest making use of the seek-tags to find people to fill in desired roles. ", "q1r": 3, "q2": "There isn't much information to go by. What I'm missing the most is a target date to work towards, along with some more operational details in the plan; How exactly would the AI perform the given task? \r\nThere are no KPIs set. How many donations are envisioned? After the fund has been raised, how would the money be spent? The past has proven that just donating money only provides a temporary solution and can actually damage future development. So there needs to be a plan to build infrastructure and such to make a difference in the long term. \r\nThe proposal's auditability would improve greatly with these details added. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 27, "ne": 6, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "Ending world hunger with money in a single day by doing a viral social media campaign to convince the top 1% to spare some money. That's what this short proposal of 264 words is aiming to do for $50k.\r\nBesides the belief that any sufficient amount of money can solve anything and create resources and solutions out of thin air there is no real plan in this proposal.\r\nLet's imagine the money is successfully harvested, how will it be used? For how long will the world hunger be ended? Will this money be used to buy people some food for a few days or to teach them how to be resourceful and take care of themselves and create their own wealth and value?\r\nThose claims that world hunger could be ended if an enough large amount of money were given is not sustainable and does not has substance, it's just pretty talk to manipulate the opinion into thinking that money is the simple answer to any complex problem.\r\nUnity of the human race will end world hunger not money. Blockchain could help bring this Unity but this is a long term goal.", "q0r": 1, "q1": "The proposer is the COO of SingularityNet, this is impressive but it doesn't help this proposal which is lacking a real plan with actual steps in the real world to accomplish something tangible.\r\nThe proposal contains an attached document entitled \"The state of food security and nutrition in the world\" (2020), this is an interesting report on the state of food inequalities in the world but this doesn't constitute a plan for this proposal.\r\nEnding world hunger would require a tremendous amount of experience in, amoung countless other things, logistic, supply chain, climate, geopolitics, etc... It's abvious this proposal is, for now, just a dream.\r\n", "q1r": 1, "q2": "The plan given is very short and does not go beyond giving a very brief outline on how the viral campaign would allow harvesting money from 300 million people to do something somehow.\r\nThis review could have been different if there had been a real plan but harvesting money and escrowing it is not enough to achieve anything.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 26, "ne": 7, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "The proposal fits within the challenge setting although I find it hard to believe you could target the wealthiest 300 million people in the world and on top of that convince them to donate $1000 each.", "q0r": 3, "q1": "For feasibility, we are missing some crucial information. There is no roadmap provided. When will all of this happen, how is the proposer planning on doing this? The proposer states that he is the Chief operating officer of SN but does not provide the actual evidence to support this? If he is the COO I have no doubt the proposer has the necessary experience and connections to do this. But isn't it a scary world if one individual is able of doing this?", "q1r": 2, "q2": "Regarding auditability, we are also missing information. As stated in the above rationale no roadmap is provided. We do not know when the proposer is planning on End world hunger day. We don't see any KPIs. Where would the money go to? will it just be handed to UNICEF or is there a structural plan on giving the money or maybe the proposer plans on giving food packages?", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 23, "ne": 0, "ng": 19, "nfo": 4, "vca_o": 1}, {"q0": "It is nice to contemplate solving world hunger in this way, but spending $300 billion to do so (or even 1% of that amount) would require a plan. This proposal has no plan how the money would be spent. Accordingly, I disagree that it effectively addresses the challenge.", "q0r": 2, "q1": "There is no plan provided how this money would be spent to solve world hunger. Therefore, I strongly disagree that the plan presented indicates that it is likely that this proposal will be implemented successfully.", "q1r": 1, "q2": "No KPIs are offered. On fundraising, I suppose that there is an implicit KPI of amount of funding raised. On spending of the money, there is neither plan nor KPIs.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "Thank you for bringing up this thorny problem in the world. Not everyone comes up with such charitable ideas. We all know that every day in the world there are hundreds of thousands of unlucky people, especially in the poor middle eastern countries. However your solution given here I have not found to be effective. Looking at the reality, there are many potential problems we don't see. For example, due to a lack of supply and demand, due to a lack of leadership. There is no shortage of organizations and developed countries to support business promotion, production and development in poor countries. ", "q0r": 3, "q1": "For specific feasibility I would like to know more about your profile. And what made you want to build this idea. Currently, the Catalyst community is a large community, but to raise $ 1000 from 300 million people around the world is not easy. There are many people who can redeem themselves. Not only that, if you do not have financial knowledge, it can cause an economic crisis. Besides, the government is also a huge issue that ensures everyone's rights.", "q1r": 2, "q2": "If I only spend $ 50K to study the algorithm for forecasting, I think it is not optimal. You can use it to build community, create events calling for companionship with underdeveloped countries at the present time. Give them specific solutions such as production, tourism, ... And I hope you also have specific roadmaps and KPIs for the upcoming long-term and short-term. People can see and understand how you operate this project. thank you", "q2r": 3, "assessor": "z_assessor_710", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Even though the proposal is surely an attention grabber, there is not enough material evidence to conclude its justice to the challenge it is submitted under. The main objective of the campaign is to showcase the speed and flexibility of SingularityNet and Cardano working in harmony and in turn boost the collaborations on the ecosystem, this proposal makes no mention of how it would achieve that. To add on the proposer makes no notable mention of how exactly the AI would be leveraged in the solution proposed. However, the humanitarian efforts should be commended, no doubt. But a little more detail would have added the proposal more weightage.", "q0r": 3, "q1": "The proposer keeps the proposal very compact. Thus, making it a little tough for the readers and the community to understand how the team proposes to tackle the problem. The missing action plan and milestones make it no better. The requested fund despite being only about 10% of the total amount, still feels to be an overestimate. A budget breakdown might have had done some justice. Apart from Janet whom the majority of us know already, there is no other information about the flavor of the team designated to work on this idea. Also the risks and challenges, the proposer might already be aware of are not provided for the community to go through them or their mitigation measures. The success of such a revolutionary idea will surely bring joy to the community as a whole but with the presented facts it is hard to make conclusive decisions about the success of this proposal.", "q1r": 2, "q2": "With a lot of missing details, it's hard for anyone to track the direction this project is moving in. Lack of information regarding the prior research or groundwork is again not doing this proposal any help. In addition to that, the success definition and KPIs that the auditors could use are missing, hence making the monitoring process a tedious one. The solution here appears to be a standalone project whose objective is to collect over $300Bn USD to fight world hunger, but how would this contribution trigger further collaborations across the ecosystem still seems to be in the dark. Hence, I feel an elucidated plan of the same probably in the future fundings would be more meaningful and just.", "q2r": 1, "assessor": "z_assessor_751", "no_vca": 20, "ne": 8, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "While battling world hunger is important, I don't think this proposal offers a feasible solution or come across as a genuine attempt (at least in its current form). Besides thinking about organizing a viral marketing campaign, there is no specifics about how to achieve it, neither does the proposal mention anything about how to the charity fund to solve the world hunger issue. The intended use of pledged amount is also vague. Therefore, I strongly disagree the proposal effectively addresses the challenge.  ", "q0r": 1, "q1": "A one day marketing event that aims to reach 1% richest population in the world (which is 79 million) will not convince 300 million people to donate $1000 each. There is no specifics about the marketing campaign plan to incentivize people to donate. I highly doubt this will be implemented successfully. ", "q1r": 1, "q2": "There is no timeline or milestones to track the progress of the proposal. Buzzwords are used for how the pledged amount will be used instead of concrete plans. Hence I strongly disagree there is enough information provided for the community to audit the progress. ", "q2r": 1, "assessor": "z_assessor_960", "no_vca": 29, "ne": 2, "ng": 25, "nfo": 2, "vca_o": 1}, {"q0": "As per data of world Food Programme 24,000 people die per day from hunger, The present world measures taken is not on track achieve UNSDG2 Zero Hunger by 2030, The proposal is effectively addressed.", "q0r": 5, "q1": "Transferring $300Bn per day from rich people is practically not possible,\r\nand there is no proper data that shows how transferring it will be done, The presented plan is cannot be implemeted.", "q1r": 1, "q2": "The information doesn't have data who will provide 1000$ and how it will be collected,\r\nand data does not also have how they eradicated hunger ,\r\nThe information provided is not sufficient to audit process and it wont be successful.", "q2r": 1, "assessor": "z_assessor_992", "no_vca": 36, "ne": 2, "ng": 18, "nfo": 16, "vca_o": 1}, {"q0": "World hunger is a very complex issue indeed, and kudos for this idea. However, resolving it is more difficult than only collecting money.\r\nThe 1 star is given because the description does not address the how will the collected money be distributed. What area or country, how many recipients, what will be the process. \r\nHunger can be also resolved via education for example.", "q0r": 1, "q1": "The lack of clarity and transparency of the destination of funds leaves an open room for later obscure decisions in the implementation", "q1r": 1, "q2": "No information of timeline of execution is given", "q2r": 2, "assessor": "z_assessor_995", "no_vca": 37, "ne": 1, "ng": 23, "nfo": 13, "vca_o": 1}], "solution": "地球上で最も裕福な人々から最も困っている人々へ、1日で3,000億ドルもの富を移転するという、最大の効果をもたらす。", "experience": "シンギュラリティ・ネットのCOOとして、革命的な変化の実行を組織する能力を持っています。"}