{"id": 380968, "author": "felixweber", "title": "Ryuki Funding", "url": "https://cardano.ideascale.com/a/dtd/380968-48088", "category": 26236, "amount": 35000, "description": "カタリスト・コミュニティは、提案書を提出するだけでなく、活動やアクティビティに報奨金や資金を提供するための、迅速かつコミュニティ主導のメカニズムを必要としています。", "funded": 1, "upvotes": 78744398, "downvotes": 10561493, "votes_result": 68182905, "votes_cast": 347, "f6_no_assessments": 11, "f6_rating": 4.2727272727272725, "videos": [], "media": [], "f6_assessments": [{"q0": "積極的な活動を行っているコミュニティが協力して、資金の一部を直接流すことができるという提案は素晴らしいアイデアです。何らかの理由でカタリスト・プロセスで資金を得られなかった提案でも、コミュニティに大きな価値をもたらし、この提案でサポートすることができます。\r\nこの提案は、そのような価値の高い提案に迅速な資金調達の仕組みを提供する方法を示しています。  \r\n この提案の主要な評価基準と目標は、概説された課題設定と一致しており、コミュニティに貢献する継続的なソリューションに発展する可能性があります。\r\n\r\n根拠のない付加価値のある提案を支援するために、アクティブなコミュニティが使用できる専用の予算が必要であることは、コミュニティのアクティブなメンバーの一人として評価できます。\r\n", "q0r": 5, "q1": "この提案は、地域の主要なアクターと協力して行われています。よくぞまとめてくれました。メンバーはコミュニティに大きな影響を与えており、素晴らしい実績を持っています。チームメンバーは、各メンバーグループの代表者1名となります。会計士についての情報をもう少し提供し、3000ドルがどの期間に役立つのかを説明してくれると良いと思います。  全体的に予算は3ヶ月間のみのようですが、プログラムを継続し、資金提供されたプロジェクトの進捗状況を追跡するために、3ヶ月後にはどのような見込みがあるのでしょうか。メンバーズサークルの中ではまだ学習過程であり、多くの決定をしなければならないにもかかわらず、6ヶ月後、12ヶ月後の見積もりとロードマップについて言及していただけると助かります。  \r\n予算については、なぜ現段階でマーケティング・キャンペーンが必要なのかが記載されておらず、プロセスを管理するための予算が33％となっています（プロジェクトのための資金を除く）。この提案は、要求された資金の大半がプロジェクトのために使われるようにうまく設計されています。\r\nより長期的な計画を考えると、進行中のプロセスの最初の評価と資金源の配分・見積もりを行うのが良いと思います。\r\nこの提案は、作業を完了するための現実的なスケジュールと、メンバー間のコラボレーションのための最初のフレームワークを提供しています。\r\nまた、どのようなコミュニティグループがこのコラボレーションに参加できるのか、そのビジョンやガイドラインがあれば、それも加えるとよいでしょう。", "q1r": 4, "q2": "KPIは明確であり、メサラウベールである。KPIごとの具体的な目標値や、6ヶ月、12ヶ月の見積もりを追加すると良かったと思います。\r\nこの提案は、共同創造の初期段階に焦点を当てているので、毎週のミーティングでメンバーが多くの詳細を決定する必要があり、それが継続的なプロセスになることは明らかです。試行錯誤しながら学ぶのは素晴らしいことですが、重要な基盤を構築するこの第一段階では、予算を下げてもらうことも検討できたはずです。\r\n\r\n第一段階を達成するためのマイルストーンと時間軸が明確なロードマップは、次の段階を提示するのに役立ちます。\r\n対象となる問題と、その問題を解決するためのソリューションについて、明確でわかりやすい説明がなされています。\r\n全体的には、複数のコミュニティによる取り組みであり、月次レポートが提供され、Githubのチャンネルも活発であることから、コミュニティや触媒による提案の監査可能性が高い。  ", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "This is an interesting proposal to set up a treasury funded by by a portion of SPO rewards. Catalyst is being asked to provide $25,000 towards thus, and another $10,000 to cover some operating expenses. The groups involved are highly engaged in Catalyst and will bring a lot to the table. The proposal however lacks details on how much funding will be provided by SPO's (what is the percentage of each 3rd epoch that will go to the treasury?). There is also no detail on the transparency and accountability to the wider community, only that each SPO has one board member. As in the campaign brief, what are the reporting requirements on funded proposals and how are funds dispersed?", "q0r": 3, "q1": "The proposers are highly experienced and involved in Cardano and Catalyst, however the  proposal itself lacks a clear plan for how projects will chosen, how they will be funded, what funding will come from the SPO's and how this will be managed and reported back to the wider community. The roadmap in February is to decide how funds will be disbursed. This is a core part of the value of the project and feels like something that should be decided before Catalyst provides funding. ", "q1r": 3, "q2": "As currently designed there are no clear deliverables for this project. Key parts of the roadmap appear to be to develop a business plan for how to operate the fund. As such it is not possible to audit success as the deliverables have not been set. It would be much better to see a clear design of how project would be chosen, funded and how their impact on the Cardano ecosystem would be measured. It would then be good to also have measurable goals for this funding proposal to meet through its funded proposals clearing showing how it will achieve over and above Project Catalyst  Funds.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 30, "ne": 7, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "This project is a good model for a rapid funding mechanism. This project should assist with helping all the groups mentioned, \"AIM, Gimalabs, etc.\" and those groups are important to the community at large. So, any project that assists that network assists the ADA/Cardano community.", "q0r": 5, "q1": "Felix knows the community well. If he wants to build it: then I am sure people will flock to it. Felix is well known to the community, and is a good guide for it.", "q1r": 5, "q2": "KPIs are rather simplistic and should be easy to track. More delegators to Ryuki = success. The two items of \"Setting up & Maintaining Community - Communication Hub\", \"Accountant.\" These two funded items should help provide and maintain the KPIs.", "q2r": 5, "assessor": "z_assessor_363", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": " Relation to personal qualifications: In my year long work in political organisations I have been both a treasurer of a political organisation and a financial auditor (someone that checks the books of an organisation to verify that all the funds proceedings are in order). Hence, I am confident I will be able to competently evaluate proposals in this category on their auditability and accountability and can clearly define the necessities to ensure safeguarding and auditing of funds. Thisproposal provides a very interesting approach to disbursing funding in a new way. It links together many components of Cardano and actors of Catalyst and provides a solution that will be of great benefit to the Cardano ecosystem. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "Basically all of the proposers are goups of really active and established part of the Catalyst community. Without a doubt this cooperation will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 24, "ne": 7, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is addressing the challenge as it's providing an additional fund to accelerate those  proposals that are considered valuable but not funded in a round in Catalyst.", "q0r": 5, "q1": "The set up of a series of dedicated staking pool is not requiring any new skill or complex development. \r\nAlso the rest of the proposal is achievable by an average skilled project manager, possibly with some SCRUM /  6 sigma knowledge", "q1r": 5, "q2": "It would have been valuable to have a sneak peak of the criteria for deciding which project is going to be funded, but it's part of the road map.\r\nThe budget required is not excessive, though it is still not clear on how the funding distribution (25k USD) will help the engagement and how it will happen.\r\nHow many people are going to be rewarded ?\r\nWhat's the minimum threshold to define true engagement ?", "q2r": 3, "assessor": "z_assessor_530", "no_vca": 20, "ne": 3, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about creating a community treasury, promoting and controlling it in a transparent manner in order to be distributed to initiatives and collaborations that currently fail to receive funding. This funding mechanism is intended to be fast and transparent, which are the primary goals of that Challenge. The proposal is well structured, defining all aspects of the project, giving a short and a long description of the solution, providing details on the team (an alliance of well established projects), the governance framework, and how it will scale and be sustainable in the future. They also stated that this is an experiment that will explore different ways of decision making.", "q0r": 5, "q1": "The authors of this proposal are an alliance of projects and project members that are highly involved in the Catalyst community. Each of those project/member by itself is a renowned contributor to the community with more than a track history of delivering great results to Cardano and Catalyst. All of them combined are an insuperable work force and commitment that deserves the highest rank in this assessment. Regardless of that track record, the proposal provides meaningful details on timelines, deliverables and budget breakdown. They also provide details on how they plan to manage the treasury and decision making. KPI and metrics were also provided and since there's no technological challenges, all the work should be backed by the human effort that they have demonstrated accountability.", "q1r": 5, "q2": "In order to provide auditability, the proposal states that all activities will be publicly available, recorded and documented and that will be reported on at Town Hall. Additionally, the proposal includes metrics, expected deliverables in a timeline, and budgeted milestones that can be used to track progress and deliver partial funds. The members are already providing this type of auditability methods in their own projects, showing transparency to the community.", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 20, "ne": 8, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposer is  creating a socio-financial community treasury which has a united network of coordinated project based Stake Pools and treasuries to reward and fund engagements and activities besides submitting proposals. The proposal explained that the treasury is distributed to those initiatives and engagements which currently fail to receive funding. They aim to distribute funds on a fast and transparent way; thus addressing the challenge effectively.", "q0r": 4, "q1": "The team is made up an Assembly of well established Catalyst Community Projects, SPOs, Catalyst Circle members, Funded proposers, Community Advisors and Mentors who are capable of implementing the proposal successfully. ", "q1r": 4, "q2": "The proposal mentioned that all their operations and activities will be documented, recorded and publicly accessible on github. Monthly reports via the Catalyst Town Halls can be easily audited.  The road map shows January 2022 to March 2022 clearly stated. The budget is well broken down for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is aiming to achieve the opposite of the challenge's call for transparent, accountable and safe rapid funding. Instead of improving the infrastructure for assessment and validation, it replaces algorithmic rigor with the concept of \"Ryuuki\". By this, the proposers mean \"fund us because you know us\" - adding to their already disproportionate share of the funding pool. Supporting \"well-established\" people and their networks and personal brands is exactly what most people who sign up for the blockchain revolution do not want.", "q0r": 1, "q1": "The proposers have impressive traction and exposure in the Catalyst ecosystem. However, this fact alone should not be mistaken for competence to get the job done, as commitment from previous proposals and ongoing community activities will leave them with little time for additional work. The plan itself lacks important detail with regard to the interaction between the different community functions and funding pools and instead centers on vague slogans like Holacracy, Ryuuki and Proof-of-Soul.", "q1r": 2, "q2": "The proposals KPI (number of delegators, amount of funds and number of projects) is purely quantitative and the audit through Townhall presentation will likely be biased as the moderators of Townhall are the same people who propose Ryuuki. \"Proof of Soul\" reintroduces nepotism and trust-based interaction that we came here to abolish in the first place.", "q2r": 2, "assessor": "z_assessor_692", "no_vca": 15, "ne": 4, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is positioned to make a revolutionary step into self governance and Treasury control experience which is absolutely necessary for the future of the Cardano community.", "q0r": 5, "q1": "The proposal is driven by experienced and dedicated community stewards who are willing to nurture the Cardano community towards capability to self-govern by discovering new ways of social interactions. This is a highly experimental project which also has the advantage that it will support the sparking of valuable projects who otherwise could be in jeopardy due to inadequate criteria that (they do not \"fit the mold\" of the current set-up of the Catalyst review process.)", "q1r": 5, "q2": "With one caveat, which can be easily \"fixed\", but may have been already implied: namely that not only quantitative metrics be considered as KPIs but also qualitative metrics to be added, such as e.g. the degree of success of the projects receiving funds, once the criteria for funding will be determined in the first stages of the project.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Ryuki Funding is a well developed proposal to rapidly distribute funds through a federated network of community groups operating stake pools to generate treasury funds which would likely allow for faster development of projects on Cardano.  ", "q0r": 5, "q1": "The Ryuki Funding team seems to be composed of reputable and reliable groups and community members with a genuine desire to experiment with and implement effective rapid funding mechanisms for the benefit of the Cardano community.  I'm not sure about the scaleability of this model in the long run, but given the somewhat modest budget I think it's a worthy proposal that should generate some interesting results which the community can learn from and benefit.", "q1r": 4, "q2": "The team documents, records, and publishes all of their operations on a publicly accessible Github, which allows for great transparency and auditability.  They pledge to distribute funds in a fast and transparent manner and seem to have the best interest of the broader community in mind.  They have provided a clear roadmap and a sensible budget and also will be providing monthly reports to the community via Catalyst Town Halls so everyone can follow along with their progress and learn from the results. ", "q2r": 5, "assessor": "z_assessor_723", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The Ryuuki team is a conglomeration of Catalyst backed teams and Cardano community members, SPOs coming together around a shared mission to create an alternative rapid funding mechanism. The team has a plan to utilize the SPOs to create treasury pools of capital for allocation, this is effectively addressing the challenge.", "q0r": 5, "q1": "Ryuuki team as they describe in the proposal are Catalyst native teams which have joined forces to accelerate the development of unique subsystems for funding projects outside of Catalyst proper. The plan included is tightly developed and covers all aspects of their solution.", "q1r": 5, "q2": "The team provides details to cover each aspect of their team's experience, development plan and anticipated impact this solution could have for future Catalyst projects. The info provided in KPI, impact section and roadmap are sufficient to audit the progress. ", "q2r": 5, "assessor": "z_assessor_724", "no_vca": 16, "ne": 1, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "社会金融共同体財務は、プロジェクトベースのステークプールと財務の調整されたホロクラティックで統一されたネットワークとして定義されます。", "experience": "確立されたカタリスト・コミュニティ・プロジェクト、SPO、カタリスト・サークル・メンバー、資金提供を受けた提案者、コミュニティ・アドバイザー、メンターの集まりです。"}