{"id": 381764, "author": "vilela", "title": "AdaQuad - Crowdfunding Platform", "url": "https://cardano.ideascale.com/a/dtd/381764-48088", "category": 26236, "amount": 24900, "description": "ウォレットの大きさがかなり異なる場合でも、議決権のバランスがとれるような、迅速な集団意思決定のための資金調達方法を開発するにはどうしたらよいでしょうか。", "funded": 1, "upvotes": 36391780, "downvotes": 10119559, "votes_result": 26272221, "votes_cast": 228, "f6_no_assessments": 4, "f6_rating": 3.416666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=4277"], "media": [], "f6_assessments": [{"q0": "この提案は、二次投票理論に基づいた新しい投票・資金調達方法を作ることを目的としています。提案チームは、迅速な資金調達の仕組みを作ることが重要であると述べていますが、具体的にどのように実現するかについては詳しく説明していません。この提案で提示されているアイデアは、以前に資金提供を受けた提案の結果であり、Catalystに参加している「クジラ」の数と、彼らの投票が全体でどれくらいの割合を占めているかを示しています。つまり、この提案は、彼らの影響力を減らし、ADAの少ないホルダーの影響力を高めるための提案なのです。このコンセプトと提案は重要だと思いますが、このチャレンジの目標は提案で提示されたものとは異なるため、この迅速な資金調達メカニズムでの提出は適切ではないと考えます。また、このプロジェクトのインパクトをどのように評価するかについても、あまり詳しく書かれていません。資金提供を受けずに再提出した場合、提案者は、例えば、現在のフォーマットを使用した投票プロセスと、この提案で提案されたフォーマットを使用した投票プロセスの結果を比較し、決定プロセスがどれだけ分散されているかを比較することができます。", "q0r": 2, "q1": "このプロジェクトを担当しているチームは、以前、少数の「クジラ」に投票権が集中しているという分析を担当しており、その時の提案で予定されていたレポートをすでに提出しています。そのため、今回の提案の研究面でも、名前や経歴は伏せられていますが、十分に対応できると思います。しかし、提案書には、Plutus、AtalaPRISM、Web開発者の名前も記載されていますが、彼らが誰なのか、すでに雇われているのか、何らかの形で連絡を取っているのかについては言及されていません。この情報は、提案の実現性を高めるために、他のすべてのチームメンバーの情報と一緒にここに記載されるべきです。予算はよく説明されています。提案されている内容や期間に比べてかなり不足しているように思えますが、チームの経験に基づいているので十分だと思います。ロードマップはよく説明されており、提案されている内容に対して適切であると思われますが、実行計画を理解するためには、より詳細な情報が必要です。", "q1r": 4, "q2": "提案書では、2ヶ月ごとのマイルストーンで明確なロードマップが示されています。提案者は毎月進捗状況を報告する必要があるため、監査の観点からは理想的ではありません。そのため、資金調達を行う場合には、より小さなステップに分割する必要があるかもしれません。また、提案書には、現在の開発の進捗状況を把握するためのKPIを記載することもできます。したがって、将来のラウンドでは、より詳細なロードマップとKPIを盛り込むことで、この提案の監査可能性を高める必要があるでしょう。", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "They address the problem of lacking a quick collective decision-making funding mechanism. They will ad value to the Cardano ecosystem by quickly getting projects funded that will build on  Cardano. The don't really have key metrics to measure against the challenge except for the shorter periods of time the fund will take. The project will be able to scale as they are using a voting system that is fairer than most systems out there.", "q0r": 4, "q1": "The relevant experience and team has been provided in the budget, but no proof of their existence is provided. It will boost voter confidence if you ad links to prove your team's existence. The budget seems reasonable and is broken down into the specific roles responsible for building the project and computing  supplies. The project will be a 6 month experiment to prototype the crowdfunding capability. Which seems doable, taking into account that each fund will happen every 2 months. They have gone into great detail explaining how the voting will work, but not so much on the platform they are building. No technical information as to what languages they use to build the different parts of the platform. Will there even be a platform, how can voting happen without a platform? Providing more info on how and what you are building will eliminate questions like these and boost voter confidence. No risks and challenges have been considered. You need to show the reader that you are aware and prepared for future risks. Doing so will boost trust in your project.", "q1r": 2, "q2": "They provided a roadmap with milestones, but no KPIs. Providing KPIs enables the community to track the performance and progress of your project. Without KPIs voters will be hesitant in your projects abilities to succeed. They address the problem of lacking a fair quick funding mechanism to fund projects. They solve this by a researched voting method that is fair and able to scale successfully. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 6, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about  to study and design a funding platform based on a quadratic voting mechanism. This team has already provided a fantastic analysis and study on voting diversity and influence on past Funds with interesting conclusions regarding the benefit of quadratic voting. In this proposal they are moving one step forward with a platform that can take advantage of those discoveries. Even though they claim that the platform will be designed for a rapid funding, it is not clear nor explained in detail what are the capabilities of the platform that would make the funding faster than Catalyst. I see this proposal more related to the quadratic voting method, something that I'd love to see implemented, and it might fit better in a different Challenge.", "q0r": 3, "q1": "The team is composed by members of the community that have arealde delivered projects with outstanding results. This reason per se gives us great confidence in them. Additionally, they provided a detailed plan divided in 3 phases, two-month each, with an explanation on activities and expected results. The budget is based on the staff needed and was provided with a breakdown by human resource with an overall cost (not hourly rates provided). They provide many references to square-root and quadratic voting, and governance theory, but they did not provide a risk assessment for the implementation.", "q1r": 4, "q2": "The team provided a timeline of activities and expected results, however  they did not include KPIs and metrics to track the project and alignment with the Challenge. In overall, the proposal misses in more detail on how to measure success that would have been also useful to better understand the matching with the Challenge goal. ", "q2r": 3, "assessor": "z_assessor_554", "no_vca": 20, "ne": 6, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "While intellectually impressive, this proposal does not meet the detail or intent of the Brief;\"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"\r\nThis proposal inverts the direction of development, asking people to pay to devote time and vote to the funding system.", "q0r": 2, "q1": "While intellectually formidable, the team appears to have the background necessary for successful implementation. The plan is sound and achievable.", "q1r": 5, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time\r\n fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}], "solution": "Cardano CatalystおよびCardanoエコシステムにおける他のDOAのための投票および資金調達方法を設計する。", "experience": "フォトレックは「Diversity Voting Influence」プロジェクトを成功させました。チーム：経済物理学者、システムエンジニア、Plutus/Atala Prism開発者"}