{"id": 381822, "author": "nielskijf", "title": "Fund Builder for DAO's (Adagov/SDA)", "url": "https://cardano.ideascale.com/a/dtd/381822-48088", "category": 26236, "amount": 37000, "description": "Project Catalystは静的で直線的なため、スケーリングや遅延の問題があり、有望なプロジェクトを持つチームがCardanoを選択するのを妨げています。", "funded": 1, "upvotes": 61756009, "downvotes": 6700004, "votes_result": 55056005, "votes_cast": 231, "f6_no_assessments": 3, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案の最初の良い点は、TL;DR、すなわち提案の要約を提供することです。これは投票者にとっても、CA/vCAにとっても非常に有益です。また、提案自体も非常によく書かれており、説明されていますが、少々長いのが難点です。しかし、この提案書には、Social Design AcademyやVoltaire Assistantといった大規模なプロジェクトに関連したサイドプロジェクトについての情報が多く含まれており、それが良い背景となっていますが、この提案書の範囲からは少し外れており、提案書に含まれる内容を正確に理解することは困難です。しかし、注意深く読めば、理解することは可能です。この提案は、Catalystの経験豊富なメンバーとの複数のワークショップによって洗練され、可能な限り最高のデザインとUI/UXを構築することを目的とした、Circular Data Modelに基づいたCatalystの新しい資金調達モデルのための概念実証の研究と構築を目的としています。このメカニズムは、提案書で述べられているように、迅速な資金調達にも使用することができますが、これは研究に基づいているため、どのように見えるのか、また、どのように意思決定が行われるのか、つまり、コミュニティがどのプロジェクトに資金を提供するかをどのように選択するのか、正確に知ることはできません。予算の3分の2は前述の研究に充てられ、6分の1はドキュメント作成、6分の1はPoCの構築に充てられていますが、PoCは後から追加されたもので、最終的な提案の予算には含まれていないようです。この提案は、チャレンジに非常に沿ったものであり、また、研究は、改良もせずにただ始めるのではなく、非常に良い方法で物事を作ることが重要であり、これがうまく実施されれば、CatalystとCardanoのコミュニティにとって大きな利益となるでしょう。", "q0r": 4, "q1": "このプロジェクトの背後にあるチームは、コミュニティで非常によく知られており、彼らはすべての2021年を通して多くのセッションやワークショップを担当しています。彼らはエコシステムの改善に積極的に貢献しています。デザインレビューチームも、Catalystに精通しており、経験豊富です。この提案の研究部分は、成功する可能性が非常に高いと思います。進捗状況を把握するためのリストがありますが、「Deliverables」セクションで説明されているdeliberablesのリストと完全には一致していないため、各成果物が実際にいつ納品されるのか、納品される順番があるのかないのかを理解するのが少しだけ難しくなっています。予算は一括で提示されており、例えばリサーチになぜ$30kが必要なのかが詳細に説明されていないので、予算が適切かどうかの評価が難しいです。また、総予算には概念実証のための予算が含まれていませんが、これは人為的なミスだと思われ、これによって提案のすべての目標を達成することが難しくなるかもしれません。しかし、提案全体としては、前述したテーマのいくつかが欠けていたとしても、チームの他の提案やコミュニティでの活動を見ると、この提案は成功する可能性が高いと考えています。", "q1r": 4, "q2": "この提案書では、全体的に何を開発するのかという情報がよく提示されています。一方で、そこに提示されているさまざまな情報の間には少しつながりが欠けており、この提案の成果物が具体的にいつ納品されるのかという情報を見つけるのが難しくなっています。例えば、「Deliverables」のリストは「Track Progress」のリストとうまくつながっていません。また、SDAロードマップがあり、関連する情報が追加されていますが、この提案の監査性を高めるものではありません。成功の定義が曖昧で、期間も3ヶ月と広いため、監査が難しくなっており、本提案の成功を測るためのKPIが含まれていたかもしれません。これは研究提案であるため、これらの指標を考えることは非常に難しいのですが、コミュニティが何が行われているかの進捗状況を把握できるように、監査可能にする必要があります。", "q2r": 3, "assessor": "z_assessor_31", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This project seems to be a vision to rebuild the way project catalyst is run through new governance software for both the current catalyst funding rounds and also a rapid funding mechanism. However the TL;DR really is that clear on what will be delivered, and the long version is more of a mission statement than a clear project plan with deliverables. I feel the proposers have good intentions and want to research some interesting things, however its not clear what they will deliver and how this meets the challenge goal of increasing the speed of funding. It seems to be more of a project to research how to change governance within Catalyst.", "q0r": 3, "q1": "The team has appears to have good experience and is clearly very motivated in the space. The main aim of the project is to research how to produce the outcome they want. However the project description lacks a succinct plan and description of what will be delivered. It is thus hard to give high ranking to whether this will be successfully delivered. ", "q1r": 3, "q2": "The deliverables and budget section is a very small part of the proposal, with the majority covered in 1 sentence. It would be nice to see this broken down with timelines so progress can be audited. It is also important to produce a number of measurable metrics with goals attached so success can be measured.", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 24, "ne": 1, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "An intellectually impressive proposal as well, hover, it does not effectively address the Brief by failing to lay out exactly how much more rapid it would enable funding. It claims improved speed amongst a portfolio of benefits but does not go far enough effectively.  The core goal per the brief: \"Increasing the speed of funding is critically important to allow important projects to move rapidly from volunteers to paid professionals. While volunteerism is strong in our community (and a strength), the ability to pay people for their time will accelerate and dramatically improve the time and energy people will be able to devote to Catalyst.\"", "q0r": 5, "q1": "There is no doubt a DAO will be implemented as the team is competent and accomplished. there is also no doubt a design community will be organized as well, but will the entire thing successfully implement? to this assessor, it is unclear, as the proposal is so massive and so varied, its unclear that all of it will come to fruition thereby entirely delivering fully on the promised value.", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, publically auditable, and time\r\n fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 20, "ne": 3, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "ソーシャルアプリストアを備えたファンドビルダーは、サイドトレジャーを展開し、高速で直線的かつ非同期の資金調達トラックを通じて新しいチームを迎え入れます。", "experience": "10年以上のシニアUX/UIデザイナー/MLシステムエンジニア。Social Design Academyの創設者。Adagovのメンバー。Catalystに13ヶ月以上在籍。F6で資金調達。"}