{"id": 383495, "author": "tevosaks", "title": "Proposal Workshop", "url": "https://cardano.ideascale.com/a/dtd/383495-48088", "category": 26236, "amount": 21915, "description": "参加者は、現在のProject Catalystの資金モデルを使って継続的な改善に取り組むことを望まない", "funded": 1, "upvotes": 71129260, "downvotes": 8616554, "votes_result": 62512706, "votes_cast": 401, "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "They address the problem of new proposals not being ready for assessment phase on time.  They ad value to the ecosystem by getting more proposals ready and funded to start building on Cardano.  The metrics align with the challenge in successful funded projects. Project can scale by running multiple instances.", "q0r": 5, "q1": "The team is active Catalyst veterans with the relevant skills to build this project. The budget is broken down in hours per item. A spreadsheet has been provided to show all the different items and hours. The time to prepare proposers for a fund seems reasonable. The have provided a Miro board that has a nice layout of the whole process from start to finish. They explain in detail every step of the process and how they will go about executing it. The only risk I can see that they have considered is the scaling one. Being transparent about the whole process and listening to the community will make them resilient to any future risks and challenges. ", "q1r": 5, "q2": "They provided a roadmap with milestones in the Miro board. They have measurable KPIs under the auditability section. Making it easy to track the performance and progress of this project. They address the problem of new unprepared proposers by creating a workshop to educate and help them prepare their proposals in time for assessment phase. ", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 24, "ne": 2, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "Proposal Factory is suggesting that they will add value to the Cardano Ecosystem by improving access to Catalyst in the form of intentional workshops in the lead up to Catalyst Funding rounds and provide faster feedback and support to new proposers. \r\n\r\nThe proposal is not specifically addressing funding mechanisms outside of Catalyst, rather how to demystify Catalyst for new proposers. For this reason it might not be in the right category.; \r\n\r\nThe impact is global in the sense that it is delivered online, however it is not directly addressing global in terms of cultural diversity and need requirements in terms of language and addressing barriers such as that in the onboarding process. ", "q0r": 4, "q1": "The proposal team is experienced and engaged in the Cardano community, some are behind Catalyst Swarm and School and others are bringing different skills to the project such as auditability. \r\n\r\nThey have included a budget and timeframe with specificity alongside key milestones and content of training. This is where the real \"meat\" is in this application and provides a great overview of exactly what it is they envision doing as part of this onboarding for new proposers.", "q1r": 5, "q2": "The team are going to use Github to store project elements, there is a clear timeline and as most of these events are open to the community there is a high level of transparency in terms of the community being able to audit progress on it. \r\n\r\n\r\nThey have set some ambitious KPI's that are tied to the success of those they assist and teach, it's very in line with the philosophy of Cardano here. The delivery dates are very much defined and sit alongside funding timeframes. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 21, "ne": 8, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The Proposal aims to onboard new proposers and give faster feedback, and have workshops to assist proposers on creating better proposals. This falls within the Campaign brief of rapid Catalyst funding mechanisms. The idea is open source and is scalable. \r\nThe key metrics of the Challenge are met and relevant. The proposer's goal is to create an ecosystem where Proposal creation could be fun, and highly effective.", "q0r": 4, "q1": "The Proposer has created a mirro board setting out the complete idea in detail. There is also an Excel sheet setting out the budget in detail. The team members are listed and their experience provided, only a link for the main member is provided. I feel confident that they can with time and funding make the idea come to life. A lot of detail and effort has gone into this proposal which shows commitment to the challenge.", "q1r": 4, "q2": "Everything will be documented in the public GitHub repository, all paid event-related and task-related documents will be shared in Github. This will make it easy for community members to track the success of the project. The project does have a road map with milestones and the whole of the proposal falls within the KPI's of the challenge. They will be tracking how much of the Treasury is being paid out, milestone progress, unique users, and how many of them contributed, number of proposers etc. This makes the proposal very Auditable.\r\n", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1, "reply": "In Impact, Feasibility and Auditability assesor brings out only positivity but gives less than a perfect score."}], "solution": "新しい提案者を迎え入れ、より迅速なフィードバックを行うために、Catalystコミュニティの活動を調整しました。", "experience": "私たちは、他の人たちが自分の提案書を書けるように刺激し、力を与え、手助けします。\n私たちは、イベントを企画、調整、進行する経験を持っています。"}