{"id": 382865, "author": "adagov.org", "title": "₳GOV: Timelines and Treasury Data", "url": "https://cardano.ideascale.com/a/dtd/382865-48088", "category": 26239, "amount": 25000, "description": "Os dados sobre a tesouraria e fundos da Cardano são distribuídos entre múltiplas fontes em múltiplos formatos.", "funded": 1, "upvotes": 65863177, "downvotes": 9485376, "votes_result": 56377801, "votes_cast": 345, "f6_no_assessments": 7, "f6_rating": 3.7619047619047623, "videos": [], "media": [], "f6_assessments": [{"q0": "Este é um bom ângulo para enfrentar o desafio em questão. A equipe proponente sugere aumentar a transparência dos dados de tesouraria usando sua plataforma AGOV para servir mais dados do Projeto Catalyst. Especificamente, a equipe se propõe a integrar informações sobre pagamentos, fundos, estatísticas de votação para que as transações da tesouraria possam ser facilmente identificadas. A equipe já criou apresentações de linhas do tempo e listas de campanhas que acompanham de perto os eventos do Catalyst - crucialmente, eles já estão trabalhando em uma linha do tempo para as estatísticas do Tesouro. Isto é fiel ao espírito e ao cerne do desafio: fornecer verdade sobre Cardano - especialmente aos usuários não-potenciais que desejam consultar e pesquisar com alguns cliques. Este site gerenciado pela comunidade será uma boa ferramenta e serviço para iniciantes que desejam acessar informações financeiras do Tesouro Cardano. Gosto especialmente do fato de que todos os dados serão de código aberto e recuperáveis em formatos de arquivo plano. Legal. Há possibilidades de estatísticas em tempo real durante a votação? A IOG pode fornecer estatísticas em tempo real sobre a votação - semelhantes a outras correntes de bloqueio que têm esse recurso? Onde mais você poderia levar isso? Quais pagamentos serão cobertos? Pagamentos aos proponentes, às CAs, às Equipes de Desafio, às vCAs? Outros tipos de pagamentos? Influxos para o Tesouro também?", "q0r": 5, "q1": "Parece que a proposta pode ser implementada com sucesso. Adagov já forneceu provas que está criando com sucesso um repositório de informações sobre cronogramas, propostas, campanhas e fundos do Projeto Catalyst. Com informações on-line sobre linhas do tempo e campanhas e fundos já criados. Os dados serão ampliados com informações muito necessárias sobre fundos de tesouraria, número de carteiras e votação. A equipe especificou que pretende extrair mais informações \"de documentos oficiais e da multiplicidade de fontes\". Esta última parte parece ser muito vaga para um plano específico e pode ser um pouco fraca em uma proposta de outra forma muito boa. Eu gostaria de ter visto quais informações específicas e quais são essas fontes em consideração. Quais são os problemas que poderiam ocorrer, se os dados estarão disponíveis, quem será abordado e quando? Por outro lado, a equipe declarou que já iniciou este trabalho (sem financiamento) - e forneceu um link [Estatísticas do Tesouro: https://airtable.com/shrFUpPLYSthyUnWD] como prova. Ótimo! Entretanto, estou surpreso que a equipe não tenha incluído outras informações de identificação sobre os proponentes, além do nome e do site do Adagov (₳GOV). Passei 20 minutos procurando por informações on-line (não encontrei muitas), enquanto isso poderia ter sido fornecido dentro da proposta. Se a proposta não for aceita, eu sugeriria aumentar o segmento de perfil da equipe na proposta para tornar sua viabilidade mais clara. A equipe incluiu perfis gerais e o fato de que eles foram financiados anteriormente em F4, F5, F6. OK, tudo bem - não podemos manter todas as informações em nossas cabeças. Como estão indo esses projetos. Uma breve recapitulação seria bom, especialmente informações sobre como eles encantam esta proposta. Já vi propostas menores fornecerem mais informações sobre a equipe. O orçamento está dividido - mas em três montantes fixos. Deve haver alguma razão adicional para a divisão em $5.000 para extração e limpeza de dados, $10.000 para desenvolvimento de oleodutos (codificação, serviços automatizados) e $10.000 de suporte à integração em outros sistemas (API, taxas de serviço, etc.). As somas parecem ser \"muito redondas\" para serem precisas. A precisão inspira confiança.\r\n", "q1r": 4, "q2": "A linha do tempo e os marcos poderiam ter sido mais detalhados. Escrever a linha do tempo parece ter sido feito com pressa. OK, \"extrair e limpar dados existentes\" soa bem - mas o que são \"dados existentes\" exatamente e de quais fontes - para que possam ser auditados? Um auditor do projeto precisa saber. Todos os dados estão disponíveis ou você precisa ter acesso autorizado a alguns dos dados de votação na cadeia lateral onde ocorre a votação Catalyst? O que é totalmente acessível e o que exatamente será apresentado? Que tipo de oleoduto poderá ser criado em 3 meses? Mais alguns detalhes seriam bem-vindos. A equipe menciona que a extração poderia ocorrer semi-automaticamente ou automaticamente. Qual destas duas opções é o Plano A? Quais são as limitações e custos envolvidos com o semi-automático ... as mesmas perguntas para o automático? Quais são os desafios e riscos? A segunda parte da meta de 6 meses não é muito clara ou precisa para mim: \"Mais de 15 colaboradores para os dados, backups e controle de versão e uma série de integrações\". A equipe diz que trabalha sob um processo contínuo de integração e desenvolvimento, o que é bom. Entretanto, os resultados poderiam ter sido melhor definidos. O problema é que a imprecisão gera confusão e dúvida e deixa muito espaço para interpretações diferentes. Também gostaria de ter visto mais sobre a qualidade da navegação e as características de facilidade de uso que estão planejadas. Será apenas um repositório pesado de dados ... e se não for, por que será fácil para os usuários sem poder usar? Qual é a visão para torná-lo fácil de usar? Em última análise, se o usuário final pode facilmente usar e navegar - isso é sucesso.\r\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "A proposta identifica um problema dentro do desafio que precisa ser resolvido que existem múltiplas fontes de dados e múltiplos formatos. Teria sido bom fornecer mais informações sobre ele e mais exemplos para tornar o problema mais específico. A solução é bem explicada com alguns links úteis para o trabalho realizado, o que é ótimo. Mas será útil explicar qual é a vantagem na forma como você reúne as informações. Apenas para dar um exemplo do link de tempo que você compartilhou, você poderia explicar que você tem a linha do tempo de todos os fundos catalisadores em um só lugar e que não há outra fonte que os forneça. https://airtable.com/shrpnN4ma5uDR82X8/tblhFoC2AJk5vRlEN?backgroundColor=yellow&viewControls=on você.\r\n\r\nA proposta articula claramente como irá agregar valor ao ecossistema Cardano a quem e por que é importante.\r\nAs principais métricas da proposta estão alinhadas com os cenários de desafio delineados.\r\n\r\nComo membro ativo da comunidade, passo muito tempo procurando informações e ter um local centralizado será muito útil. ou seja, estava procurando uma tabela simples de quantas propostas foram apresentadas e financiadas em cada Fundo de 1 a 6, tive que pedir a várias pessoas e, finalmente, fazer isso eu mesmo.", "q0r": 5, "q1": "O proponente fornece provas de seu trabalho com links úteis e já começou a trabalhar na proposta sem nenhum financiamento. Este é um sinal muito positivo e parece que a equipe tem as habilidades e experiência relevantes necessárias para implementar a proposta.\r\nEmbora o proponente mencione na área \"experiência relevante\" o tipo e o número de membros da equipe necessários para implementar a proposta, teria sido útil ter mais informações sobre a equipe e sua experiência. A proposta menciona que ele foi financiado F4, F5, F6 e teria sido útil ter os links para a proposta financiada para ter mais informações sobre seu trabalho e alguma avaliação para o sucesso dessas propostas. Teria dado mais confiança sobre a viabilidade, especialmente com a experiência que você tem no Catalyst. Seu site https://www.adagov.org/ também fornece apenas informações gerais sobre a rede de fabricantes de câmbio envolvidos no Catalyst. Mas quem será o líder e os líderes dedicados da equipe para esta proposta?\r\n \r\nProcurei em algumas outras propostas de fundos anteriores onde você fornece muito mais informações e poderia ter sido útil tê-las aqui também. Um exemplo: https://cardano.ideascale.com/a/dtd/In-Wallet-Onboarding-for-ADAholders/367120-48088\r\n \r\nO orçamento é delineado e dividido em itens identificáveis. Entretanto, não está claro se o orçamento está relacionado a que prazo - é para os seis meses completos? ou como o orçamento foi calculado - por exemplo, x desenvolvedor para x meses para x taxa. Isto será especialmente útil, como você declarou na proposta \"Operamos sob o processo contínuo de integração e desenvolvimento\". \"O que será o orçamento para o futuro não está claro.\r\n\r\nVocê mencionou que haverá atualizações contínuas no banco de dados. Uma data de lançamento para os suplementos sugeridos (\"Propomos estender estes dados para incluir fundos de tesouraria, número de carteiras de votação e informações extraídas de documentos oficiais e da multiplicidade de fontes\") poderia ter sido mais específica. Caso contrário, você poderia ter apresentado a proposta como uma atualização contínua e apresentar o orçamento de acordo com o apoio contínuo/orçamento mensal/trimestral.\r\n\r\nTrabalhando com múltiplas startups e projetos de desenvolvimento ao longo dos anos, eu recomendaria que você incluísse informações mais detalhadas para esta proposta, como parece que a equipe fez no passado. A preocupação não é sobre as capacidades da equipe, mas sobre o foco dedicado a esta proposta específica.  ", "q1r": 3, "q2": "Você define claramente as Métricas que estão relacionadas com o desafio. Poderia ter sido bom acrescentar alguns KPIs específicos para ver o impacto real da proposta, ou seja, como as pessoas buscam hoje em dia, como por exemplo, quanto tempo gasto para a informação e o novo banco de dados será mais eficiente. Outro KPI poderia ser uma estimativa de quantos membros da comunidade irão usar a solução.\r\n\r\nTodos os dados estarão disponíveis em código aberto e recuperáveis em formatos de arquivo plano e a proposta fornece links relevantes para websites, de modo que será possível acompanhar o progresso. O problema é bem compreendido, assim como a solução, mas como mencionado anteriormente, uma data de lançamento mais clara e KPIs mais específicos tornarão mais fácil a auditoria.  De modo geral, com base no acima exposto e na experiência da equipe com a comunidade, acredito que a equipe fornecerá a clareza necessária para avaliar o progresso da proposta.  ", "q2r": 4, "assessor": "z_assessor_636", "no_vca": 20, "ne": 12, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses the challenge very well in that it would allow for extended transparency regarding the Catalyst treasury. This proposal also addresses the current gap and measure of success for this challenge that all transactions from the Catalyst treasury should be easy to identify. It would very much aid the objectives of this challenge and enhance transparency and trust by providing easy access to data.", "q0r": 5, "q1": "The proposing team is very active in the Catalyst community and has done prior funded as well as unfunded work in this area. This proposal provides proof of their prior work on this project, so it is very likely that with funding, the team will be able to finish this extension of providing additional data to promote transperency and trust among all members of the Cardano community. Roadmap is feasable, team is competent in the area, proof of actionable steps and skillset of team members is provided.", "q1r": 5, "q2": "Auditability is high, since this is all accessible in a repository for everybody and the goal for this proposal is to make it easier, to identify transactions of the Catalyst treasury and progress of work is visible and auditable for everybody on their website. Roadmap and budget breakdown is realistic.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 23, "ne": 4, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "The main idea of this proposal is to extend Project Catalyst data to include payouts, funds and voting statistics. The allegation is that by bringing this information to the public and by making it easily accessible to all truth about Cardano will be easier to see. However, I believe this only partially addresses the problems of the challenge. The ideal goal is to develop a way to protect the environment against disinformation attacks that could in turn pose a threat to the trust and value of the Cardano ecosystem. Having said that I do not believe the proposal solves the problem or the metrics are strongly aligned with the outlined challenge settings. It is true that it would be beneficial to have an easy way to retrieve those kinds of information but its contribution of value to the Cardano environment is somewhat limited.", "q0r": 3, "q1": "Very little evidence of relevant skills and experience needed to implement the proposal is given. It is not debated the type and number of team members that will be required. Additionally, the budget is overpriced and the rationale behind the estimates of each item in the budget is not explained. Also, there is no contingency plan in case additional funding is needed and the timetable provided is reckless and not very realistic. Finally, there is no discussion about the challenges and risks relevant to a successful implementation.", "q1r": 2, "q2": "The roadmap traced is lazy and does not provide sufficient information on how each task will be done. Moreover, the time horizon could have been more accurate. The proposal does not specify if the pipeline creation will take 3 months, if will be done 3 months after the project has begun or when are the expected dates of beginning and ending of each phase. The key metrics proposed are not very objective and do not help much in assessing the progress of the project. Finally, it is not clear that this solution will address the problem of cyber disinformation attacks eroding the trust and information being hard to classify into truth or fabrication.", "q2r": 2, "assessor": "z_assessor_341", "no_vca": 23, "ne": 6, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "\r\nCapturing the Voting statistic and treasury fund transaction into a single data source that can be easily accessed by anyone is a commendable idea and fits into this challenge. The work had begun before funding shows commitment on the team part to implement this project. The Impact of this project will help community members to access past Voting Statistics to make informed decisions. \r\n", "q0r": 5, "q1": "The experience of the Team at adagov.org seem great but there is no way to identify the individual information , I have accessed the website but no team members information is display. Given that the team is currently working on going project , and the timeline provided is good but no evidence of Team behind it is provided. I am neutral", "q1r": 3, "q2": "How much of the funding is allocated to each of the timeline is provided, I would expect the team to consider potential risks of this project.\r\nThe Definition of success after 3, 6 and 12 months is not provided to enhance auditability , The project is already launched which is good and the fund will extend the functionality . The processed  data  will be open source which increases the audit ability of the Job done.  \r\n", "q2r": 4, "assessor": "z_assessor_430", "no_vca": 19, "ne": 0, "ng": 16, "nfo": 3, "vca_o": 1, "reply": "2 Full time members x $5.000 x 3 months + $30.000"}, {"q0": "Great idea to expand the already existing data from Project Catalyst. By providing the extra information you create a place where everything is visible for the community.", "q0r": 4, "q1": "Regarding the information provided for feasibility, we get all the key features needed. Everything is explained but rather short. It would've been better if the proposer provided a bit more detail concerning the budget breakdown. We get categories and the funding required for them but not why, explain why you need 10.000 for pipeline development. How many developers do you need for this, how many hours of coding are we looking at. Providing more details into this we get a better picture of why the amount is needed. What we are missing is details about the team proposing this. Who is on the team proposing this and what relevant skills does the team have? Without knowing this we don't know they need to hire extra team members or not.", "q1r": 2, "q2": "The roadmap is provided which gives insight into what the proposers have planned after funding is secured. The key metrics are also in-line with what the proposers wish to accomplish. Looking at the ease of access is an important aspect of this challenge.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 0, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about extending Project Catalyst data to include payouts, funds, voting statistics so that transactions from the treasury can be easily identified. This idea is great. The problem statement is clear but it is not explained in detail. For better understanding, the problem statement should be explained in detail in order that the existing background is clarified. The proposed solution is clearly defined, addresses the challenge, may contribute to increasing the usage performance of Cardano treasury and funds; as a result, clear impact on the whole ecosystem in long term.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "The team profile is not described clearly, however, through the provided link [https://www.adagov.org/], I can see this team's works and achievements. However, for better understanding, the team profile, as well as the member's profile, should be explained more in detail with reference/proof (documents/links,...) for verifying. The team got a funded proposal in the prior fund. The budget is not provided much information [onlytotal budget and items structure but without explanations of calculation base]. The roadmap is provided and described enough for understanding, the metrics are provided, some of that is measurable, but not defined specifically in numbers.\r\nBesides, KPIs and risks are not provided.\r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information. However, there is a lack of: (1)Team profile with reference/proof (documents/links,...) for verifying. This team's ability, skills are very suitable to implement this proposal with some completed great works; so it would be more auditable if team profile, as well as accomplishments, are provided more in detail; (2) Budget explanations of calculation base for each item; (3) Specific KPIs/ metrics, some of this proposal's metrics is hard to define/not likely metrics [ex: \"Ease of access to information about ....\", Historical transactions ...can be easily identified\", \"New sources and repositories of information are developed containing timelines for Cardano projects\"]; (4) Risk analysis.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 15, "ne": 5, "ng": 5, "nfo": 5, "vca_o": 1}], "solution": "Ampliar os dados do Projeto Catalyst para incluir pagamentos, fundos, estatísticas de votação para que as transações da tesouraria possam ser facilmente identificadas.", "experience": "1 x Engenharia de Sistemas, 1 x Designer Social, 1 x Gerente de Projeto e Cooperativa de Desenvolvimento de Software. Financiado F4, F5, F6."}