{"id": 384952, "author": "gargiulo.gianni", "title": "Defending Cardano Staking Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/384952-48088", "category": 26239, "amount": 39500, "description": "Os stakepools fraudulentos e maliciosos representam uma ameaça urgente e crescente ao ecossistema de staking Cardano e à segurança da rede.", "funded": 2, "upvotes": 251099486, "downvotes": 2208982, "votes_result": 248890504, "votes_cast": 1640, "f6_no_assessments": 8, "f6_rating": 4.833333333333333, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=25270"], "media": [], "f6_assessments": [{"q0": "Ok, deixe-me admitir. Adoro dar uma primeira olhada (leitura rápida) sobre uma proposta - antes de lê-la de forma abrangente. Eu dei uma olhada ... e uau. As primeiras impressões podem ser enganosas (eu sei), mas minhas primeiras impressões foram que a equipe aceitou o desafio e depois correu com ele para lugares inesperados. A declaração do problema é afiada e incisiva - não a chapa da caldeira. Ela reflete a percepção. Gosto que sua solução tenha como objetivo desarmar os Operadores de Stakepool (SPOs) maliciosos. Esta questão (SPOs maliciosos) é claramente um ponto-problema emergente de discussão na comunidade Cardano. Claro que, como na maioria dos debates, há nuances - com alguma diferença no que é visto como uma SPO maliciosa e o que é uma SPO que está meramente utilizando as oportunidades oferecidas pelos parâmetros do sistema. Gosto que os proponentes tenham se atirado à questão da confiança, que é essencial para \"defender o ecossistema Cardano\". A confiança se corrói rapidamente. A proposta tem uma visão de como ela pode imbuir um novo valor no ecossistema Cardano - fortalecendo um pilar chave que é baseado na confiança - a estaca. Sinto que os proponentes alinharam sua proposta com os cenários de desafio delineados - adotando uma abordagem muito focada para enfrentar um tipo crítico de ataques distribuídos de negação de verdade (DDoT) que poderiam perturbar as operações normais da comunidade ou rede.  ", "q0r": 5, "q1": "A equipe se saiu bem na apresentação de suas competências (o conceito do Stakeboard também está bem apresentado - no Ideascale e no site). É uma grande idéia combinar a ferramenta Stakeboard (que simplifica a busca de stakepool) com o plano de apoiar a descentralização da cadeia de bloqueio Cardano, promovendo esta descentralização através da validação da honestidade do SPO. Chegamos aqui à proposta que visa apoiar ainda mais a descentralização, iluminando os operadores maliciosos. A equipe forneceu perfis Linkedin e consiste em 2 líderes técnicos: CTOs, que fundaram múltiplas start-ups; SPOs; pioneiros de Plutus e com experiência da academia Emurgo. A equipe também inclui um designer sênior (site bonito https://stakeboard.net/ ali) e um líder em desenvolvimento de negócios. Parece ótimo para o trabalho. O orçamento parece estar à altura da tarefa (embora eu não seja um especialista para as taxas de pagamento dos desenvolvedores - portanto, vou me abster de comentar sobre esse segmento). A parte dedicada ao financiamento da hospedagem em nuvem perde o elemento do tempo (de quando para quando?). A proposta tem um plano sensato de implementação - e o melhor é que o site já está em funcionamento e claramente muito esforço (não apenas planejamento) foi investido. Uma grande parte do roteiro já foi entregue ou está em implementação - com a integração no Twitter do centro de notificação - Alice (concluído). Os KPIs parecem estar no alvo", "q1r": 5, "q2": "Os proponentes tornaram a auditoria de sua proposta relativamente fácil graças à inclusão tanto de uma visão clara quanto de um plano de implementação com carimbo de tempo. Muitos componentes já estão em desenvolvimento ou estão concluídos. A partir do final de novembro, a equipe tornou possível que as SPOs verificassem a propriedade de seus pools e criassem perfis de Stakeboard. Tudo isso é fundamental para a implementação do projeto \"Defendendo o Ecossistema de Estacas Cardano\" - por isso já estamos falando de produtos a serem entregues - mesmo antes do projeto ser votado. Muitos componentes-chave já foram entregues e marcos já foram cumpridos - como é evidente na proposta. Além disso, a equipe parece ter um foco muito nítido no problema visado e posso ver que esta clareza de visão é outro fator que pode ajudar a garantir que o projeto entregue uma solução feita sob medida para a estaca Cardano. Minha própria experiência com o ecossistema data de 2017, quando comecei a acompanhar e aprender sobre Cardano regularmente. Estou em Ideascale desde o primeiro dia e contribuí como CA, proponente e vCA em todos os fundos.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 19, "ne": 13, "ng": 6, "nfo": 0, "vca_o": 2, "reply": "A commendable assessment. We thank you so much for your time and thoughtful consideration of our proposal. And it's very encouraging that your thorough research into our project left you with confidence in its worthiness."}, {"q0": "A proposta identifica um problema-chave relacionado ao desafio e o problema é muito bem articulado e explicado e por quê e como poderia ser uma ameaça para Cardano. As atividades dos aderentes já têm um impacto no desafio, já que a equipe está trabalhando no projeto desde agosto e já conseguiu alertar os agentes do ecossistema sobre ameaças potenciais. A proposta está lidando com um elemento chave do ecossistema Cardano, esquemas de SPO e descentralização das SPO, e um bom sistema de prevenção é altamente importante para a comunidade.\r\n\r\nSendo um CA do fundo 6 e mentor até o startups (onde vejo muitos lançamentos), esta é provavelmente uma das principais propostas que analisei, fornecendo todas as informações necessárias. Muito bem feito.\r\n\r\nA única preocupação que tenho é que o orçamento solicitado é de 40% do orçamento total do desafio, o que poderia limitar a quantidade de propostas vencedoras. Teria sido bom considerá-lo e talvez fazer uma proposta para o Fundo 7 e outra para o Fundo 8. Entretanto, como você já está trabalhando nisso sem financiamento desde agosto, é compreensível solicitar o montante necessário para que os marcos sejam apresentados.   ", "q0r": 5, "q1": "O proponente forneceu muitas informações necessárias para validar as habilidades, incluindo detalhes de experiência e referências para o trabalho. O proponente já está trabalhando no projeto e validou as capacidades e necessidades. O proponente definiu bem a equipe necessária para implementar o projeto. O orçamento é delineado claramente e dividido em itens identificáveis e é razoável alcançar as metas estabelecidas. A proposta oferece um cronograma realista para completar o trabalho.\r\nA proposta explica claramente os aspectos técnicos relativos às ameaças de SPO e fraudes usando também alguns exemplos práticos.\r\nO proponente poderia ter tido alguns desafios e riscos relevantes para uma implementação bem sucedida, por enquanto, o principal risco descrito é que eles precisam do financiamento para operar, o que é compreensível. Será interessante saber o que é um plano de horizonte temporal mais longo para manter e melhorar tal plataforma. Talvez haja algumas oportunidades de receita para que você possa se tornar um auto-sustentável / lucrativo.\r\n", "q1r": 5, "q2": "O roteiro e os marcos estão bem definidos. Os KPIs são bem definidos e mensuráveis. Eu recomendaria incluir, além de % de reduções, também o número total inicial para que seja mais fácil avaliar o impacto e compreender o nível de risco. Por exemplo, \"Reduzir em 50% o número de Piscinas de Estaca criadas por imitadores\" é de 4 para 2 ou 100 para 50? Uma vez concluído, será possível rastrear o impacto através do centro de notificação e usar as ferramentas disponíveis para deletadores para tomar decisões. Será bom compartilhar um relatório mensal com a comunidade a respeito da situação das ameaças e das prevenções.  \r\n", "q2r": 5, "assessor": "z_assessor_636", "no_vca": 20, "ne": 12, "ng": 7, "nfo": 1, "vca_o": 2, "reply": "The CA's thoughtful assessment is commendable, and greatly appreciated. And their recommendations are insightful and entirely valid, and we'll take them into account in our development efforts, as well as in any future proposal."}, {"q0": "The proposal approaches an important subject of the ecosystem that is closely linked to the main topic of the campaign, which is trust among the stake pools. In a scenario where a lot of stake pools are malicious the whole Cardano ecosystem is at stake. That being said, building a way to enhance resilience of the ecosystem and making it harder for trust among the stake pools to be eroded is definitely a compelling idea. In other words, the proposers have identified a problem within the challenge which needs to be solved and have clearly articulated through examples and statistical data about the stake pool that this proposal will add value to the Cardano ecosystem. Also, the KPIs defined within the proposal are aligned with the outlined goals and can be objectively measured. The only point I missed a more thorough discussion about was scalability. No matter how good the solution is in unmasking malicious stake pools, if it is not scalable its impact will be limited.", "q0r": 4, "q1": "The proposers have identified the type and number of team members required to implement the proposal within the cost breakdown section. Also, sufficient evidence was provided regarding the relevant skills and experience that will be needed. Additionally, the budget was broken down into identifiable items and the estimation costs were pretty reasonable. Moreover, the timetable provided not only is realistic but is also very informative. Nonetheless, not much information was given regarding the challenges and relevant risks they might face when implementing the proposal or regarding the alternatives the team has in case additional funding is needed (they have already mentioned that they are running out of resources to self-fund).", "q1r": 4, "q2": "The roadmap described is very informative, it has sufficient milestones, and the time horizon is clear and realistic. The KPIs defined in the proposal are strongly aligned with the objectives of the challenge and are reasonably easy to measure. If they are achieved, they will convey a strong idea of success of the proposal. Through the explanation given, it can be seen that there is a clear understanding of the targeted problem. Also, the solution provided is quite understandable and if accomplished will address the problem.", "q2r": 5, "assessor": "z_assessor_341", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1, "reply": "This assessment is thorough and thoughtful. And while I believe our Impact/Alignment with the challenge was excellent overall, the point about our not detailing risks and how to mitigate them is well taken. These are things we've considered, but we should have included our considerations in the proposal."}, {"q0": "This proposal fits very well within the challenge settings. By providing a place where members can search all the active staking pools and know that the malicious SPO are filtered out we will provide a better and secure place. Today there are a lot of SPO's that pose a grave threat to the community, unwillingly people place their trust in SPO's.", "q0r": 5, "q1": "Regarding feasibility, we get a massive amount of information about what the team behind this proposal has already done and what their vision is for Cardano and SPO's. Seeing the work the team has already done I have no concern that this proposal will not come to a success. The roadmap provided already starts in August and you can see the road they already paved and what has yet to come. One concern I have is the budget they are asking for, I have no doubt they can use the full amount they are asking but since this is asking for forty percent of the pool in this challenge, it might've been better to split this proposal up in two or three parts to have a better chance at securing funds.", "q1r": 5, "q2": "What we need for auditability is abundantly available in the proposal. They provide a clear roadmap that gives insight on what has yet to come and the KPI's are although the Twitter impressions might be a challenge. They might need to bump up their social activity for this.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 21, "ne": 6, "ng": 13, "nfo": 2, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "Stakeboard is developing into a social platform for stakepool information as well as a rethinking of the ISO mechanism, but the proposal relates to the challenge at hand which is disarming disinformation attacks, specifically in the staking ecosystem. The Alice bot has already detected several fraudulent pools. Fraudulent pools are a problem that will continue to grow. By integrating protective mechanism like Alice into a staking platform that build trust, like stakeboard, this proposal fits squarely within the challenge. ", "q0r": 5, "q1": "The team have already made significant progress on stakeboard, stakepad, and Alice without any outside funding. The budget should be sufficient for the development in question and the roadmap is clearly broken down and realistic. ", "q1r": 5, "q2": "The budget and roadmap are clearly broken down.  The KPIs provided are mainly derived from stakeboard/twitter statistics and on-chain data.  These should be relatively easy to monitor making the auditing of the project straightforward. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 23, "ne": 3, "ng": 12, "nfo": 8, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "Disarming malicious Stake Pool Operators has been clearly spelt out in the challenge and outlines a laudable process to address the challenge. A stakeboard which they have already started since August 2021 seeks to promote transparency, trust and decentralization in staking.\r\nThe team has built and seeks funding to continue building tools and protocols to disarm the threats as they emerge. Example is a bot called 'Alice' spotted suspicious Stake Pool Operators when they emerged.\r\nThe impact is that individuals will be able to verify those who own the stake pools, among others.", "q0r": 5, "q1": "The plan shows when they started on their own in August 2021 till now on their own. They spelt out that they need funding in Fund7 to continue the project from January 2022 through to the end of year. It is a feasible and laudable project. ", "q1r": 5, "q2": "The time span can easily be assessed, the team has the requisite qualifications, skills and experience to carry out especially when they have already started and came out with the staking detective called 'Alice' which is currently functioning well. \r\nThe budget is broken down well for auditability.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}, {"q0": "By essentially vetting SPOs and preventing impersonation, Alice can contribute to disarming cyber attacks on Cardano. Currently staked crypto in other protocols is likely to flow to ADA if concerns about fraudulent SPO can be better addressed.   Among all proposals in this category, this is the most unique and best incremental benefit. The portfolio of Catalyst funded proposals can benefit from the addition of Alice. Because of this, I am giving them 5 stars.", "q0r": 5, "q1": "The proposal has already created a Proof of Concept since August. The proposal presents six LinkedIN profiles, Twitter, Discord, Medium and Github of the team and a credible road map and passionate appeal. This gives me the confidence that the proposal can be implemented successfully.", "q1r": 5, "q2": "The KPI and timeline for this project are ambitious but stand out for clarity and granularity. Some of the cost budgeting should have been broken down into more detail. It is not 100% clear to me where the funded project begins and the existing activity / Proof-of-concept ends.", "q2r": 4, "assessor": "z_assessor_692", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated. And the points about improving the auditability of the project are well taken."}, {"q0": "This proposal is effectively addressing the disarm cyber and misinformation attack by creating a SPO tracking solution to update users on changes to the SPO as well as the growing issue of fake/spoof SPOs of which there have been several instances in recent Cardano ISO's. ", "q0r": 5, "q1": "The stakeboard team has developed their solution in the public for some time and are led by a high capable team of software engineers. ", "q1r": 5, "q2": "This proposal includes the info CA and the community require to audit the project's progress", "q2r": 5, "assessor": "z_assessor_989", "no_vca": 31, "ne": 2, "ng": 14, "nfo": 15, "vca_o": 1, "reply": "Succinct but helpful and (I believe) assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}], "solution": "O Stakeboard promoverá a confiança no stakeboard, desarmando os operadores maliciosos do Stakepool (SPO) e as fraudes que se fazem passar por SPO e projetos Cardano.", "experience": "2 Lideranças técnicas: CTOs, fundou múltiplas start-ups; SPOs; Plutus Pioneers, Academia Emurgo\nDesigner Sênior\nLíder em Desenvolvimento de Negócios"}