{"id": 382730, "author": "felixweber", "title": "Japanese Ambassadors & Catalyst", "url": "https://cardano.ideascale.com/a/dtd/382730-48088", "category": 26238, "amount": 6500, "description": "日本のコミュニティには、日本のコミュニティのプロジェクトをCatalystに乗せるためのカルダノエキスパートグループが必要です。", "funded": 2, "upvotes": 158232692, "downvotes": 5521783, "votes_result": 152710909, "votes_cast": 382, "f6_no_assessments": 4, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal would be a big step to provide the connection between the Cardano and Japanese communities. Be providing a group of experts in the Catalyst community that provide a link to Japan is the best way to include the Japanese community to the highest level. This proposal will provide the groundwork for opening up to Japan. The proposers are well known within the Cardano community and in Catalyst Community.\r\n", "q0r": 4, "q1": "Because the proposal lacks any form of a plan assessing this on feasibility is not an easy task. I am fully behind this proposal which is why I would support the proposers to include this proposal in the next fund if this Challenge would still exist.\r\n", "q1r": 1, "q2": "As in the previous comment, there is limited to no detail regarding auditability. We know the proposers plan on building a group of experienced Catalyst Community Members to give guidance to the Japanese community. But we would need to know how this will come to life, How will they provide guidance to the Japanese community. It's also essential to confirm a roadmap, so we can follow to the proposal.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 22, "ne": 0, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is in alignment with the challenge. It helps connecting the Japan community onto the Cardano community (current people who are already involved &/or interested), and the goal being to reach out to more so they could join.", "q0r": 5, "q1": "Since it's a new group of Ambassadors Guild, I would like to see you list and organize some concrete activities funded through this proposal. This will contribute to reach out to more people out there who may not know the existence of the Cardano ecosystem.\r\nIt may be easy for the Proposers to form the Guild as most of them are already involved in the Cardano at various capacities. which is a asset to reach the success.", "q1r": 5, "q2": "Increase the funding or scale up the proposal on two fund cycle ( 7 & 8). The first phase being the establishment of the Guild, and the second, outreach to new members to join the group.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 19, "ne": 1, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "I love the approach of this proposal. Total collaboration. We preach we are not siloed, but there is that distant hint between the 3 (three) official prongs of Cardano, they are not coordinating well. If we want to dominate through the goodness that Cardano can offer, the spirit and the method implored by this proposal should also be copied and implemented by EMURGO. When we stand united, no egos, no self agenda, Cardano will go places - at WARP SPEED. In short this proposal seeks to be the trusted body that have both feet and ears in Cardano Foundation and Project Catalyst. This trusted body consist of a variety of community members that are Cardano hardcore supporters such as; CA's, vCA's, Cardano Ambassadors, Eastern Town Hall etc.. This trusted body will act for the benefit of Cardano Foundation and Project Catalyst through a collaborative front of actions. Most importantly for this Challenge setting, this trusted body will have Japanese community members in it. Total immersive engagement is on the horizon which addresses effectively this Challenge setting.", "q0r": 5, "q1": "As supremely needed this proposal is, the particular individuals involved in this proposal are not clearly detailed. Though there is a mention of the parent proposal in the link above, where it clearly states numerous high value community members who have created a litany of impactful community placeholders, are the team behind the parent proposal. The Japanese team who will execute the Japanese initiative of the parent proposal is not mentioned clearly, only mentioned as 'Eastern Town Hall'. This has also taken account the link to the Japanese documents. Having a Japanese community member here is crucial for this proposal to be successful. Budget face value seems low for the services provided, but this has not taken account the duration of this proposal which is non-existent. The budget though is clearly defined with adjoining action plans. Unfortunately though, when this implementation plan will be executed, including risk and challenge assessment has not been clearly stated.", "q1r": 3, "q2": "There are roadmaps and deep action plans, just no clear milestones. KPI's are also provided but unfortunately it will challenging to assess, though this will possibly be countered with reports in the form of a playbook that they mention in the proposal. Which is a similar system that other related community entities created by the proposers are using. As much as I have 100% no doubt this proposal will deliver, adhering to the assessment guidelines must always be done. Problem statement and solution are solid and interconnected.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 22, "ne": 11, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "As mentioned, the description of the solution was well explained. Build a team of experienced Catalyst Community members & Cardano Ambassadors providing guidance and mentoring to the Japanese Community\r\nThe Japanese community needs a team of Cardano experts to help bring Japanese community projects to Catalyst. I completely agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "This is a great proposal and I hope that the detailed plan will be announced soon. The proposal requires more audit information and clarity about the problem it is intended to solve, as well as about the solution provided.\r\nThe proponent mentions relevant skills and experience but does not provide references or links to check that information. A fairly complete and detailed description of the team's experience and capabilities. As far as the suggested authors are concerned, we know what they are capable of, but I regret the details involved. feel that this part is not enough\r\nThere are no obvious risks identified in the documents provided.", "q1r": 3, "q2": "I disagree that the information herein is sufficient to gauge the progress and success of this proposal. It will be difficult to track the progress and success of the project, even though the plan is detailed, there is no launch date or roadmap, no milestones to audit.\r\nWith no KPIs or data to be measured, there is no way to gauge the progress and success of the proposal.\r\nThe budget given is reasonable and clear", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 18, "ne": 3, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "経験豊富なCatalystコミュニティメンバーとカルダノアンバサダーのグループを構築し、日本のコミュニティにガイダンスとメンターシップを提供する。", "experience": "Catalystコミュニティメンバー、コミュニティアドバイザー、ベテランコミュニティアドバイザー、資金提供を受けた提案者、カルダノアンバサダー、東部タウンホールチーム"}