{"id": 381856, "author": "yogo", "title": "Easy Engagement - New Members - AIM", "url": "https://cardano.ideascale.com/a/dtd/381856-48088", "category": 26255, "amount": 34250, "description": "New members/mentors wish to support catalysts but it is time-consuming and complex to learn how to best engage.", "funded": 2, "upvotes": 126584368, "downvotes": 1520140, "votes_result": 125064228, "votes_cast": 460, "f6_no_assessments": 8, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is great and aligned with challenge. The problem well stated does seem to exist as the amount of new information is increasing expotentially. Having a platform to connect experiences/knowledges/expertises with existing demands would benefits who are joining the community and the project teams.\r\nMy main point of attention here would be the also  increasing number of different platforms, for different (but sometimes similar) objectives, within Cardano communty. For instance, last fund, it was possible to see several proposal to create a platform to bring together mentors and proposers. It would be nice to see these different intiatives somehow integrated, so I would recomend to go through funded proposals from F6 (or even F5) and see which ones intend to create a new platform to check synergies and possibly merge. \r\nThe ideal would be to have one or two robust platforms that connect all these kinds of needs in the community. It would avoid even more information spreaded and help newcomers to navigate through (sometimes they still dont even know what they are looking for).  However, its nice to read the engagement with these other platforms will exist!\r\n\r\nFurthermore, I'd suggest also to inlude in the platformf: web and cellphone app versions, standarize tasks and expertises (with standards fields, for example) and a way to verify expertise (done by the platform)\r\nBut these are just minor details (more operational) and makes sense not to be in the proposal\r\n\r\nMoreover, it would be nice to have here how the platform intends to become self funded in the future. if members would have to pay a membership, if it would include adds and so on. Of couse this is probably an output from a market study during project phase but it would be good to see what proposers are thinking since now to give some insight on the current thought business model.\r\n\r\nLast, a communication plan from this platform within cardano community would be much appreciated. How does the platform plans to connect, engage and retain newcomers and funded proposers? Which channels will it use? \r\n\r\nAll in all, very valid and well written proposal", "q0r": 5, "q1": "Team is already committed and experienced in multiple knowledge areas, which is necessary and will help the project to advance. There links to verify the information (Likedin links, for example).\r\n\r\ntheres a solid time-framed plan, which is very good. A special highliht that although the project intends to develop a platform from scratch, it wont take long for the PoC to be done, so value to the community will be taken quickly (if no delays happen).\r\n\r\nTheres a sensible budget breakdown but it could be more detailed. For instance, what is included in \"Infrastructure and other platforms costs\"? why \"community & New Members/accelerators\" would have a separate budget line, would they get any of this fund? Its not clear what is meant here.\r\nHowever, I wouldnt penalize much for this and, for the feasilibty as a whole, I guess it still deserved a 5 star score.\r\n\r\n\r\n\r\n", "q1r": 5, "q2": "There are excellent time-framed KPIs with target, in the kpis sections and good milestones in the \"How does success being measured\" section. The kpis are more related to the opreation itself and the milestones to the development/implementation, which makes sense for a project like this, and makes sure all the stages are covered and auditable.\r\n\r\nThere is also a good risk analysis in the challenges secction. They involve basically quality, communication and operation. I'd add here challenges on following the schedule/plan.\r\nAs suggestion, I'd inlude also in the same secction the risk mitigation strategy for each one of these challenges. They are somehow distribuited in the proposal but having them clearly stated here also (even if with a bit of repetition)  would be good.\r\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 23, "ne": 14, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "This seems like a great proposal to set up a platform to match mentors with funded proposals. The funding request is relatively small and the proposers have great experience. This would be a valuable addition to Catalyst.", "q0r": 5, "q1": "This is a detailed proposal from a group with significant experience in the area. It seems highly likely they would be able to deliver on this proposal. It is great to see they have noted and are reaching out to related proposals.", "q1r": 5, "q2": "They have a clear set of deliverables and timelines allowing auditing of progress. The proposal has outlined a clear set of KPI's and importantly have set goals against which success can be measured. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 33, "ne": 2, "ng": 22, "nfo": 9, "vca_o": 1}, {"q0": "The plan is good, there are a ton of details here to dive into. Being able to bring in all sorts of people of the community and have them join up in groups is what is needed in this space to accelerate the building process! As a software developer myself, I am interested in this very much. ", "q0r": 5, "q1": "I appreciate all the information in regards to the team, their qualifications and other related information. Its all good to see and I wish other proposals provided this sort of detail as well!", "q1r": 5, "q2": "The roadmap and milestones part is excellent. It does not leave me asking any questions which is a good thing. I can see the success with this one. The funding, the team, the process to get there, its all making sense.", "q2r": 5, "assessor": "z_assessor_119", "no_vca": 28, "ne": 2, "ng": 20, "nfo": 6, "vca_o": 1}, {"q0": "The success criteria are related to the challenge question. It will be very difficult and time consuming for new members/advisors to get support from the catalyst. This proposal aims to better connect new members and new networks (Business incubators/accelerators) to participate and take action in promoting sponsored proposals.\r\nCreate the right foundation between funding needs and member expertise. This proposal focuses on meeting the needs of funded projects with new members of the community", "q0r": 4, "q1": "I fully believe that with the solution and options presented here, there is a high probability that this proposal will be successfully implemented. This proponent's previous experience indicates a high probability that this project is live.\r\nThe proponent seems to have enough knowledge and experience to create content as good as he is suggesting. Offers provide complete information about the team, from the experiences the team has worked with to the members' profiles on LinkedIn. This shows the seriousness and openness of the author. Therefore, I believe that the team will have sufficient capacity to successfully implement this proposal.\r\nThe proponent reflects the potential challenges in many details and establishes a number of measures to avoid them.", "q1r": 5, "q2": "The proponent lays out a step-by-step plan for implementation with clear milestones, coherent KPI metrics, and defined timelines. Proposals know what they need to do, have a clear timeline with specific goals. The information provided is sufficient to fully assess the progress and success of the first three-month phase of the proposal. It's great that this proposal provides enough KPI data for us to test easily. Define clear measurable products that give us enough information to make progress\r\nThe stated budget is reasonable enough and it makes me completely agree that the team has enough capacity to tackle the challenge.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 23, "ne": 5, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "In this proposal the team presents a clear and concise description of the problem and offers an excellent solution. This proposal has a positive impact on the Cardano ecosystem and clearly articulates how it will add value to the Cardano ecosystem. KPIs match the ones indicated in the challenge and proposal is able to scale and address future challenges. Definitely a great idea!", "q0r": 5, "q1": "The team is completely transparent! All the necessary experience and skills to deliver on the proposal are listed and the team provides evidence via links of relevant skills and experience, knowledge that is needed to realize this project. The team of three professionals is part of the Assembly Inspiring Masses, which gives even greater confidence in how the project will be realized. The budget is outlined clearly, understandable and it's broken down into identifiable items and it's reasonable to achieve the set goals. It might be good to present how many hours it takes to make each of the components of this project. The team does not require additional funds and a detailed implementing plan is professionally developed and presented. The team also presents well-developed details of actionable tasks and order of execution. The proposal has realistic time frames in which the work will be realized. The plan clearly shows the details of the actionable tasks and the order of execution, which is excellent, and the technical aspects such as architecture, language and technologies needed for the realization of this project are clearly explained. The  team does not cite the word risk but uses the term challenge. The team worked out very well the possible challenges that could happen.\r\n\r\n", "q1r": 4, "q2": "The team is providing a roadmap with milestones and a time horizon and they are well presented and make sense as are the KPIs that define the success of the proposal. The KPIs provided can be used to quantify the success of the project and the community can track the progress of the project without any problems. Excellently prepared proposal!", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 17, "ne": 7, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is about building a platform that matches between funded proposals needs and member expertise. This is a meaningful idea. The problem is clearly described, explained in detail, and fits this challenge. This solution is clearly defined showing the clear impact on the Cardano ecosystem in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "This team consists of active members of the Catalyst, got a proposal funded in the prior fund [F4, F6], and their profile shows suitable skill and experiences for implementing this work. So I can see proof of feasibility from the team profile. The roadmap is clear with measurable KPIs. The budget is clear and logical. The risk is defined. Therefore, based on the given information, I strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of information, with external links for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "* The proposal aims to solve a problem which is the base for success: Get the right people into the projects. Therefore it aligns very well with the challenge setting. All Catalyst (to be) funded teams are able to benefit from it, now and in the future. Having the right people in the team is the foundation to scale and become successful. I am dealing with this for +15 years on a daily base.", "q0r": 5, "q1": "The team shows successful track record via linkedin profiles, short CVs, several previously funded projects and in-depth knowledge about Catalyst issues. The roadmap is comprehensive, broken down in weeks and looks realistic. The KPIs are elaborated in a very detailed way in a 3, 6, 12 month horizon. The plan describes the resources necessary to implement the proposal. The funding is broken down into understandable packages per role, but could also be a bit more detailed where they come from to justify the fee. The proposer even included potential challenges for a positive delivery.", "q1r": 5, "q2": "The proposal includes a roadmap with milestones and a reasonable time horizon for achievement. The success for this proposal (and the community) is measured in understandable and easy to measure KPIs. The proposers present a understandable solution that addresses a core problem of this challenge. ", "q2r": 4, "assessor": "z_assessor_737", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "The proposal addresses the key metrics of the challenge, and it has partnered with other proposers to tackle the problem it has identified from different angles.", "q0r": 5, "q1": "the team is well versed in the catalyst process and has presented a clear implementation plan, however,  the team has not addressed how they will tackle the risks/challenges they expect to face in the project", "q1r": 4, "q2": "The proposal includes a clear implementation plan, timeline and KPIs to allow tracking and auditing.", "q2r": 5, "assessor": "z_assessor_812", "no_vca": 22, "ne": 2, "ng": 10, "nfo": 10, "vca_o": 1}], "solution": "A platform that matches between funded proposals needs and member expertise.", "experience": "Entrepreneurs, connectors, mentors, developers, active community members, AIM team, CAs"}