{"id": 384635, "author": "chrisr", "title": "Distributed Digital ID SharkTank", "url": "https://cardano.ideascale.com/a/dtd/384635-48088", "category": 26255, "amount": 26800, "description": "Decentralized digital ID tech, governance & implementations require support! Cardano needs a filter/accelerator to promote projects!!", "funded": 1, "upvotes": 28698861, "downvotes": 11465470, "votes_result": 17233391, "votes_cast": 109, "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, the proposal effectively addresses the challenge. The proposers do a good job at highlighting the problem they are trying to solve and providing a solution for how to tackle it. Depending on who the \"sharks\" are, there could be a large impact, however, this is not clear in the proposal as no names have been identified, leaving voters to guess on the potential level and substantiveness of the impact. It is also unclear why this approach is being chosen vis-à-vis more targeted, hands on approach. While I am not opposed to the shark-tank style being proposed it seems odd that the selection/identification of the sharks does not make up a key component of the proposal. It is also not obvious to me why the 60 minute coaching session would be on a requested basis. Is the whole point not to help mentor and accelerate the project by engaging directly with these experts? Other than helping hone the ideas presented, how will the sharks support the advancement and implementation of the projects they critique? What can presenters expect other than a \"thrashing\", particularly for those who aren't in the top of each week? In order for full marks I would encourage the team to consider addressing these points. ", "q0r": 4, "q1": "Unfortunately, based on the plan and experience presented I neither agree nor disagree that this proposal could be implemented successfully. While I appreciate the credentials provided by the proposers, which does help give some confidence on their capacity to deliver, the fact that the \"sharks\" have not been named, let alone committed, makes it impossible to know whether the project can live up to what it says it will do. The timeline is acceptable and the deliverables/milestones after 3 and 12 months are clear, however the after 6 months deliverable/milestone is too abstract and provides no indication of how this would be achieved. What does being \"Global recognition for Thought Leadership in decentralized digital identity project/business launch\" actually mean, and who gives this type of \"recognition\"? The budget also leaves a lot to be desired for voters, particularly, as the majority of the budget $20k is just to \"engage the sharks\" but then no details are provided on what is actually meant by this. How will the money be separated: 4k each? Will you keep contingency for a back up in case a shark is unable to attend? Will you have alternate sharks? As I'm left with so many questions that are not addressed or included within the proposal, I am unable to give a higher score. ", "q1r": 3, "q2": "Unfortunately, the information provided does not provide enough evidence to prove that the community can sufficiently audit the progress and success of the proposal. The proposers do provide at least two measurable metrics which voters could use to audit the process (Six sessions completed with three qualified projects/teams; and Three Distributed Digital Identity Shark Tank winners to be producing tangible results) however these are too broad and do not provide indication whether the \"shark tank\" approach actually delivered the results it claimed to. As the majority of the budget is for the \"sharks\" and not the proposers it is unclear how the community could measure and gage the success of the money. How would the community determine which shark(s) added value compared to others which maybe didn't? The reason why I am giving this proposal a 3/5 and not a 2 is because they mention that they will be working in collaboration with IOG leadership to select the candidates. While I would have liked more details (as mentioned above) on what this process will look like and the criteria used so interested community members could know how and why you choose who you do, the inclusion of IOG in the decision making process can give voters a bit more confidence that they will be able to audit the proposal. ", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is to run a SharkTank session every 2 weeks for 5 months from Feb22  focused on Digital ID products.\r\nGiven there is a specific challenge to \"Accelerate Digital Identity\", it feels this proposal would better sit there. Saying that, it is a relatively low cost proposal thus as part of a suite of accepted proposals under this challenge could be seen to meet the brief. ", "q0r": 4, "q1": "The key to this proposal is recruitment of 5 Sharks. Presumably these Sharks will buy equity in projects they like as in the TV version of the SharkTank. These Sharks have not yet been committed, so the whole project relies on that. The proposer has experience in this domain, though the company he is CEO of is has only 3 employees and 7 followers on LinkedIn.\r\nWithout the Sharks, its hard to say if this will be success. There are no details on how this marketed, just a $6k budget line. Zoom is mentioned in the budget, so presumably that's where the sessions will be conducted, but the key strength in the SharkTank concept is viewership. ", "q1r": 3, "q2": "The project has a clear deliverable of SharkTank sessions every two week from Feb 2022. However there is not much detail on what these actually entail or even how long they go for. How to we then audit delivery? As the sharks themselves are clearly integral, a Time line for them committing should be a deliverable, but also probably some sort of metric on their quality.\r\nIts not clear why the KPI for success after 3 months is 6 delivered sessions If they are to be every two weeks, should this not be 12-13?\r\nWhilst the goal for 6 months is laudable, how to you measure \"Global recognition for Thought Leadership in decentralized digital identity project/business launch\"?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 25, "ne": 5, "ng": 19, "nfo": 1, "vca_o": 1}, {"q0": "It's a really nice idea, although the expected outcomes and impact are a bit vague: \"Top teams from each session will be rewarded with coaching and network connections\". Also, unless you have a commitment from the funders you shouldn't make guesses like \"additional funding provided by IOG\" (what exactly is your connection with them and what has Tony Rose committed to?). Finally, if you call it the Shark Tank you set the expectation that it's a TV Show. This, however, is nothing but six sessions in Zoom, right? Even that might be hugely beneficial for the participants but no need to sugar-coat what it is.", "q0r": 3, "q1": "Team seems solid and especially their subject matter expertise with SSI / DDID is noteworthy. The plan, however, is a bit generic/ambiguous and it is not fully explained what \"engaging the sharks\" entails. What are we paying 20K for? Involvement from Tony Rose (IOG Head of Product, Identity) could be elaborated a bit more.", "q1r": 4, "q2": "Although not necessarily under those headings, there is a certain roadmap with milestones and a time horizon for achieving the goals. It's a simple proposal that doesn't necessarily need any more KPIs than what has been stated here (six 60-minute coaching sessions with 5 sharks).  The problem statement could have been crystalized better though. Now it unfortunately sounds a bit like solution is looking for a problem, not the other way around.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "* The proposal aligns well with the challenge setting. Our funded projects need a certain audience in order to grow, become investable and attract more developers, mentors, investors, customers. The solution is adressed, but could be a bit more clearly defined. It has the potential to boost many funded projects top the next stage. Therefore the proposal provides scalability for future challenges. What remains unclear is the targeted demographic group. I would love to get more information about it.", "q0r": 3, "q1": "    - [ ] The proposal presents a team incl. linkedin and shows experience in the field of action. The proposal assumes the reader knows who Tony Rose is and what SSI stands for. I don't know either. If Tony Rose has a huge and the right audience which helps our funded projects, please include it into the proposal. The timeline is reasonable and clear. The budget break down could be more specified. Especially the 'engage the sharks' position is responsible for 3/4 of the requested budget and we do not get enough information how to approach and win them. The KPIs are included in the roadmap and indicate that after six sessions we get 3 teams (18 on total) promoted. What remains open if this stops after 3 months or if we can multiply it by 4 in order to have 18x4 = 72 teams promoted with this proposal after 12 months. If yes then the budget/team ratio is pretty reasonable for the case that we reach a certain audience which is not further specified. Adding more details could improve the level of quality of this proposal.", "q1r": 3, "q2": "The problem statement is understandable. There are clear metrics in order to measure the success of this proposal. The timeline is also clear. Unclear is where the money goes to, in detail. A break down which is more easy to follow would help a lot. Unclear is also how to attract the requested qualified, recognized, and respected leaders beyond the project team. It would be great to get an updated version with a bit clearer explanation.\t", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal suggests that the Digital Identity Shark Tank team will be the advisory and accelerator team to deliver results and guide and coach Cardano project teams. This could be a good thing to accelerate proposals with potential and provide them with the necessary mentorship. In the end this will have a positive impact on the Cardano eco system.", "q0r": 4, "q1": "The Proposer has made available links to two team members who will be the project leads. Then makes mention of Qualified, recognized, and respected leaders in SSI from India, Europe, Africa, Central/South America, Asia, and North America. It would have been beneficial to the proposal if these Qualified professionals were identified already with links to their experience and skills. This would make the project more feasible. Breaking down the budget a little more could also help community members and voters see that proper research has been done around the possible cost aspects. The timeline seems realistic. Resources and risks are not mentioned. This would add to the likeliness of the proposal being voted for.", "q1r": 3, "q2": "The auditability of the proposal will be measured by the results which is stated in the definition of success, with a 3, 6 and 12 months timeline and what they expect to achieve. This will also give an idea of the success of the project. A space should be provided where the community can keep track and follow the results of the project. This could really be a good project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "An expert panel of 5 Digital ID experts hosted by Tony Rose will review projects. 60 minutes coaching sessions available upon request.", "experience": "Combined experience of 80+ years of tech entrepreneurial, investing and exec. experience, including globally recognized leaders in SSI."}