{"id": 384643, "author": "mayraceja", "title": "6-Wk Crypto Bootcamp + VC Demo Day", "url": "https://cardano.ideascale.com/a/dtd/384643-48088", "category": 26255, "amount": 120000, "description": "Crypto startups need access to crypto-focused education, top crypto investors, and mentors. Most accelerators are too generic.", "funded": 1, "upvotes": 38857025, "downvotes": 15226705, "votes_result": 23630320, "votes_cast": 162, "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, this proposal effectively addresses the challenge and would likely provide a significant impact to the Cardano ecosystem. By focusing on crypto-only projects for the accelerator that not only provides the education, bootcamp, and coaching, but also an opportunity to pitch within the accelerator, this proposal sets itself from others within this category. This increases the impact of the proposal as devs and other crypto-businesses will equipped with the skills to launch their projects to the next phase while having a direct line of contact with key players already in the Cardano ecosystem.  I would have liked to see how the team plans on engaging the Cardano community in the development of the programme and how the final product will be shared with them. It is unclear how interested community members would be selected for participation or whether this would be an open-source programme or whether it would be commercialized for profit. While I do believe that the project sounds like it could give impact to the community, this point needs to be further explained. To receive full marks, voters should not be left with questions on the what/how/why components. ", "q0r": 4, "q1": "Yes, given the plan presented and experience of the proposers, it is highly likely that this proposal would be implemented successfully. The proposers do an excellent job of providing their credentials for community members to validate prior to voting. It is clear that they have the experience to deliver and are veterans of the blockchain/crypto space. I am giving 4/5 on this section for the following reasons: 1) there is no timeline and the roadmap only offers an overview of the programme but not how they plan to develop/achieve it; 2) the budget is nowhere near detailed enough for the amount being asked. Saying $100k for staff does not give voters any indication of how you got to this amount and whether it is reasonable - how many staff? at what rate? for how long?; 3) while the credentials of the proposers are helpful, there is no indication of the willingness of the \"guests\" to participate and whether steps have been taken to engage them already. Their absence does not infer that these issues are unavailable or not thought of, but it is up to the proposers to be explicit and to not leave voters making assumptions to reach the conclusion. Incorporating these points going forward would likely give voters extra confidence that what is presented is feasible. ", "q1r": 4, "q2": "Unfortunately, the information provided is neither sufficient or insufficient to audit the progress and success of the proposal. While I am grateful for the \"results and KPI\" section included within, it is too sparse and does not really measure whether the proposal could be audited. For example, the proposers list: 15-30 Startups graduate through the first cohort; At least 1+ live mentor sessions per team; Successful demo day; and Post-cohort survey. However as presented these appear more as a checklist than something that can be audited. Let me explain further, if you have 15-30 graduates from the program, how will you determine if their time spent was a success? Does this include drop outs or attrition? What are the selection criteria for these 15-30 individuals? Next, having 1+ live mentor session per team is an interesting indicator but that is also part of the course that they will go through with the guests - so it is unclear how this will help audit the proposal since it's already a criteria for their completion. The final two points also feel too underdeveloped for voters to have confidence regarding the auditability. How would you define a successful demo day? Number of projects funded? Number of VCs interested? Number of attendees? And, what is it about the post-cohort survey that will be helpful? - what will you measure? - how will the results be provided to the community? \r\nAs it seems these components are missing yet are vital for voters, I neither agree nor disagree with this component. In future rounds would strongly encourage more elaboration for voters. ", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is to set up an accelerator for 15-30 start-ups by two proposers who have experience across the VC and start up space, though not in actually running their own accelerator.  This meets what the challenge is trying to do, though maybe not quite as well as proposals from already up and running accelerators such as SeedStars. ", "q0r": 4, "q1": "There is a reasonable outline of how the accelerator would run. No detailed plan has been provided on how to get to this stage and make it all happen. Whilst the proposer have been involved in this area, its not clear from their LinkedIn profiles how much they were involved in actually getting it all up and running. They probably have the networks to bring in the mentors given their experience. It would be nice to see a better budget breakdown than just staff 100k, Marketing/ Website/Docs/Admin 20k. \r\nA more detailed plan on how to manage the behind the scenes and costs would give more confidence of a successful delivery.", "q1r": 4, "q2": "The program ahs been set out and delivery it thus auditable. They have set out some KPI's which can be measured. One of the KPI's is \"Successful Demo Day\". What is success in this context. Is it the amoutn of funding raised, the number of people attending/viewing, the amount of media exposure? It would be good to have some goals around this against which success can be measured. ", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 25, "ne": 6, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "With aligned key metircs and goals, this proposal answers exactly what is being asked in the challenge. The problem is well identified and solution simply explained. The suggested bootcamp and investor connections sound like a scalable solution that could be a great follow-up for Catalyst funding.", "q0r": 5, "q1": "Both Mayra and Audrey are well-known figures in the industry and it's an honor to read a proposal written by them. The plan is very good and the enclosed 7-page pitch deck relays the same information more visually. A bit of nitpicking though: on one slide the white font on light background is almost invisible.", "q1r": 5, "q2": "The deliverables and KPIs are simple and understandable. Only thing that could have been opened up more is the budget. How is the $100,000 for staff distributed? Which roles, how many hours, at what rates etc.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 20, "ne": 1, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "Definite 6 week crypto boot camp to provide mentorship. Clearly addresses the challenge.", "q0r": 4, "q1": "The team of experts have the experience to implement the proposal. The team are Mayra Ceja and Audrey Chaing, who are blockchain specialists with over 10 years experience. Links to their profiles are attached to the proposal. The team can implement the proposal successfully. The detailed plan outlines pre-wor, education and worksheet, 6 week live sessions, virtual bootcamp, recorded video, among others, which all point to a successful implementation of the proposal.", "q1r": 4, "q2": "The road map is clearly showing in the proposal as week 1 to 5 with clear guidelines. The budget however is quite high and a little more details could have been provided to allow effective auditing. Hence my 3 star rating. ", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal demonstrates acceleration and mentorship benefits for selected companies. It is unclear what the rough selection criteria would be, so therefore, its unclear if this proposal benefits the community as a whole or if it is substantially additive to the existing ecosystem. ", "q0r": 4, "q1": "The Team is competent and accomplished. The concept is not unduly difficult.", "q1r": 4, "q2": "The proposal lays out no milestones in program development. Therefore, it's not possible for the community to audit the progress of this accelerator. Success milestones are present and seem publically auditable, ie did this happen? yes/no.", "q2r": 4, "assessor": "z_assessor_701", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The proposal is the very definition, in a traditional and useful sense, of accelerating and mentoring individuals for beginning ventures.\r\nThis is a 6 week bootcamp course, with a structure layout and mentors already lined up.", "q0r": 5, "q1": "The experience of the team of proposers, as well as the mentor examples provided, appear to be of very high quality.\r\nThe plan, as mentioned, is a well-structured 6-week bootcamp course ranging from initial fundraising concepts, to mentor reviews and pitches.\r\nOne concern is a bootcamp course is a lot of information in a very short period of time. I was not able to determine if there will be any prior requirements. This is not a determining factor, however a consideration.\r\nThe budget is broken down as 100k or staff and 20k for everything else. I am not sure I am understanding the thought behind this number breakdown. I would suggest a slightly more involved explanation of individual costs, could help viewers.", "q1r": 3, "q2": "The graduates and as well as the survey (providing the results are anonymously public) are decent KPIs for this proposal.\r\nI am not sure it is clear to viewers what determined a \"successful demo day\".", "q2r": 4, "assessor": "z_assessor_816", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "Cryptcellerator (6-week crypto Bootcamp) by seasoned blockchain experts and VCs. Includes live sessions, mentors, and Crypto VC demo day.", "experience": "10 +Years VC, Startups/Accelerator, Blockchain, educated over 1000 startups, mentor network of top Crypto VCs/startups"}