{"id": 382330, "author": "swhitenstall", "title": "Catalyst Swarm 2022 GitBook", "url": "https://cardano.ideascale.com/a/dtd/382330-48088", "category": 26234, "amount": 4350, "description": "A documentação do projeto Catalyst requer apoio para ser sustentável.", "funded": 2, "upvotes": 124217289, "downvotes": 2056258, "votes_result": 122161031, "votes_cast": 592, "f6_no_assessments": 7, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "Como membro ativo da comunidade Catalyst, com participação regular em eventos e também como organizador de eventos e construtor de comunidades, acho que esta proposta aborda efetivamente o objetivo do Desafio, especialmente ajudando a aumentar a participação e a adesão de novos membros, promovendo o propósito e documentando os eventos e reuniões que a comunidade Catalyst Swarm está tendo. Também comunicações claras e bem documentadas ajudam as pessoas a entender o que está acontecendo e a definir como e onde querem participar.\r\nUma área de melhoria, no entanto, poderia ser a criação de um gitbook da comunidade ENTRY Catalyst, que possa fazer referência às diferentes comunidades e grupos, permitindo que novos grupos apresentem sua vontade de serem adicionados, co-criando uma espécie de índice de Comunidades e seus eventos e notícias (mas que poderia ser uma proposta separada como um guarda-chuva para este e outros que requerem o mesmo).", "q0r": 5, "q1": "Eu vi o trabalho anterior que a QA-DAO está fazendo e posso certificar que Stephen é um membro bem conhecido e ativo da comunidade Catalyst envolvida com muitos projetos, Vanessa parece também muito ativa com a criação de vários projetos semelhantes, como a supervisão do Círculo Catalyst. Portanto, acho que eles são bastante capazes de conduzir este projeto e cumprir suas promessas.\r\nO cronograma do projeto é apropriado e acho que ele cobre a capacidade necessária para os objetivos declarados, eles também identificaram metas para metas de curto, médio e longo prazo.\r\nA equipe e o esforço estão bem identificados e estão alinhados com o orçamento solicitado. Também os riscos são identificados e suas atenuações também.\r\nPelo valor que este projeto vai gerar, acho que o montante de financiamento solicitado está alinhado para que a comunidade o apoie.", "q1r": 5, "q2": "A linha do tempo fornecida é bem detalhada e tem resultados gerais especificados para cada marco, os KPIs fornecidos estão alinhados com os dos Objetivos do Desafio. Mas para que os resultados e KPIs possam ser bem auditados, algumas metas de medidas específicas quantificadas deveriam ter sido fornecidas (por exemplo, 6 sessões de enxame documentadas no gitbook - 2 por mês). Como as atividades do enxame são muito divulgadas publicamente e atendidas por muitas pessoas da comunidade, acho que o projeto pode ser acompanhado e rastreado para que se entenda que ele oferece o valor comprometido, mas teria sido melhor ter esses números (essa é a razão dos 4)\r\n", "q2r": 4, "assessor": "z_assessor_288", "no_vca": 21, "ne": 14, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "O conhecimento estatal sobre o Projeto Catalisador, (ou seja, o que aconteceu, quando aconteceu, o que está acontecendo agora e onde), pode ser um dos assuntos mais frustrantes que um recém-chegado (e até mesmo um veterano estabelecido!) tem ao mergulhar neste ecossistema.  Registros como QA-DAOs Catalyst Circle e Genesis gitbook representam um nível básico de conhecimento do estado que é fácil de ser referenciado e distribuído, e apoiar estes tipos de empreendimentos garante que eles estarão disponíveis à medida que a comunidade sofrer um crescimento exponencial, e a confusão que pode vir com ele.  O financiamento comunitário do enxame QA-DAO 2022 é um passo fundamental para a sustentabilidade desta base de conhecimento e pode ser um excelente exemplo de alavancagem do financiamento Catalyst, caso ele adquira o status de autofinanciado, num futuro próximo.", "q0r": 5, "q1": "Esta equipe já foi financiada no Fundo5 e no Fundo6, inclusive para propostas similares, e o Gitbook por trás da proposta atual (Swarm) já tem um modelo precursor a ser ampliado.  O orçamento delineia tanto a alocação razoável de recursos como cargas de trabalho e prazos razoáveis para a manutenção do núcleo de informação.  O maior fator com projetos desta natureza é se o desenvolvimento de tal recurso comunitário já atingiu realmente seu público-alvo.  Esta equipe elaborou um roteiro com KPI relevantes que lhes dá uma boa chance de disseminar com sucesso este produto para a comunidade.  A exposição interna da Comunidade Catalisadora (discórdia, telegrama, prefeituras, etc.) é pensada, visando a adoção em nível médio, tais como os hospedeiros de salas de descanso, e a exposição mais ampla no twitter, vermelhidão, etc., embora certamente possa falar com a Comunidade Catalisadora, provavelmente servirá a um propósito duplo de intimidar o alto nível de auditabilidade e responsabilidade da Governança do Projeto Catalisador para os usuários ou potenciais adotadores de Cardano.  Se houver algum problema aqui, pode ser que haja tanta demanda por essas informações, e tanta coisa acontecendo que precisa ser registrada, que essa pequena proposta possa ficar sobrecarregada e ter que reduzir sua área alvo.", "q1r": 5, "q2": "Projetos anteriores desta equipe mantiveram altos padrões de responsabilidade para com a comunidade e, de fato, representaram os próprios altos padrões.  Este é o pensamento da meta auditoria, onde eles estão fornecendo as ferramentas para auditar com sucesso a comunidade em geral.  Para isso, os Gitbooks são públicos, e eles declararam claramente suas intenções em relação ao que eles estarão procurando rastrear.  Deve ser fácil para os usuários interessados acompanharem e até mesmo sugerir mudanças in situ.  O KPI listado oferece verificação natural em pontos (adicionar limiares, limiares de visualização de página) e medidas incrementais que devem manter o projeto no caminho certo.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely Documentation of Project Catalyst requires support to be sustainable as otherwise documentation wont get done.\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by providing resources to do the documentation & tracking of Project Catalyst and thereafter ommunicate the content of the Catalyst 2022 GitBook to the community.\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a document. \r\n  Key metrics  would be  number of downloads,  number of page views, number of users of the book   \r\nThe key metrics and goals of the proposal fall within the scope of the challenge \r\nProposal can be scaled up to address future challenges by adding more content to the document. Maybe variations for different use cases and regions. Maybe localizing into local languages\r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members to build this book, and localize it into different languages.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n I am also a writer and publisher of English and Local language books\r\n", "q0r": 5, "q1": " \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events as well as managing the documentation process for these events.\r\n\r\n The links are sufficient. \r\n \r\nI have visited these links and contacted the relevant people\r\n  \r\n \r\nThe proposers are well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated. \r\nThe team structure is listed and experienced.\r\n The budget has   been given in detail. \r\nThe budget is  reasonable to achieve the set goals.\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n \r\nThe proposal has technical aspects which have been addressed \r\n\r\nThe proposer has  identified risks in this namely that he would not be able to continue in this capacity , the solution is its migrating to QA DAO.\r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   ", "q1r": 5, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms. \r\n   \r\nThe problem has been clearly understood and solution has been given in much detail. \r\n    The proposer has not identified possible hurdles, challenges and difficulties other than what would happen if he werent able to do this in future. He has a solution for that which is creditable \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 17, "ne": 5, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "I agree that it is important to keep track and archive information flow, yet it is not in a perfect accordance with the challenge goal - to increase community participation, rather than keep the community alive :)\r\n\r\nOverall a good proposal, rating given 4.", "q0r": 4, "q1": "The relevant experience is stated, with a detailed roadmap and team members are a well-known community members.\r\n\r\nI am very convinced that they can implement the proposal to the successful end. \r\n\r\nRating given 5.", "q1r": 5, "q2": "A detailed KPIs are provided which I find to be sufficient to audit the progress and the final product. \r\n\r\nI also like a risk mitigation approach, which increases the overall feeling of the proposal.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal to the untrained eye might seem out of place in regards to this Challenge which is called Community Events. Please take note though, the core development of any business, any organization and event organization is data. When you do not have a database, you can not leverage that database for support in terms of finance, in terms of onboarding quality collaborators, in terms of sending signals of the events credibility to the larger community etc.. Simple example; if an event that has been ongoing for 3 months can not provide data of their participants growth, the chance of that event's capability to find further funding would be very challenging. This documentation system that is currently being developed will help community event organizers throughout the Cardano community to have  a universal database input system that can be easily tracked and is 100% transparent. The output of this proposal is what addresses this Challenge effectively. How things are made clearly structured can be viewed through the various links provided by the proposer, shows factually how beneficial this database system is. It is easily scalable and can be applied to any form of meetings, Zoom meetings, discussions etc.", "q0r": 5, "q1": "Through the experience stated and various links provided, it is clear the proposers are high performing individuals. Most specifically one of these proposers are also stellar examples of an individual who contributed their skill continuously for the development of both, the Project Catalyst ecosystem and Project Catalyst itself by supporting the meticulous documentation of Catalyst Circle. Budget wise, it is clearly stated with an adjoining action plan, though  the numbers requested are very low. In comparison to the services provided the amount is unreasonable. A continuing trend in Project Catalyst that is borderline unhealthy. Timetable correlates well with the type and amount of work. Above all, this proposal has taken account the risk and challenge they might face and have even formulate mitigation steps. Kudos to the proposer for a great job in writing up this proposal!", "q1r": 5, "q2": "Roadmaps are clear, with a detailed adjoining action plan and milestones with clear dates. Although there are also numerous KPI's, unfortunately they will be challenging to audit for there are no numerical targets. Problem statement and solution have been well thought of and are interconnected with one another. A byproduct of this interconnection is this amazing proposal. Again, great job!", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "As the aim of this challenge is to fund maintenance of the Catalyst-Swarm-2022 GitBook, this proposal fits into the challenge settings and undoubtedly Cardano will benefit.", "q0r": 4, "q1": "I believe the team possess the skills and experience to achieve the proposal. I can see links provided and that for me is good.\r\nTo add, the is well presented and reasonable for the achievement of the proposal.\r\nThe proposer has provided a detailed and comprehensive plan for execution and that for me is very key for the successful implementation of any proposal. It's good that the proposer has outlined the possible risks involved in the implementation of the proposal.\r\nThe proposer has also given clear understanding to some technical terms used in the proposal like sustainability, maintenance etc", "q1r": 4, "q2": "The proposer has provided a roadmap and detailed time horizon for the achievement of the proposal. The metrics/KPIs that define the success of the proposal are captured. The targeted problem and it' is clear and well understood.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Documentation, tracking and publicizing of Catalyst activities and events are vital and value adding initiatives that needs to be supported. This will provide new proposers access to existing proposal and events that will beneficial to them.", "q0r": 5, "q1": "The team behind this project are individuals with long standing experience in the cardano community, undertaking this project on a smaller scale prior to asking for funding shows their readiness to execute this project. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely not only serve as a source of history for cardano activities, but it will also serve as a source of knowledge base on how to organize events and how to develop proposals. Additional, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, based on the proper budgetary allocation provided, it will be very easy implementing the project successfully when funds are provided.\r\n", "q1r": 5, "q2": "To project provides a metric to monitor and track the progress and success of the project; for instance, the project has a system for knowing page views (measured by Google Analytics); growth of page views during project, accessing comments, views and interactions on social media and a system to let new catalyst members become aware of the Gitbook (measured e.g. by occasional Zoom polls at Swarm breakout rooms to ask if new attendees are aware of it)\r\n\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "Recorra à documentação e acompanhamento do projeto Catalyst.  Comunicar o conteúdo do GitBook do Catalyst 2022 à comunidade.", "experience": "QA-DAO tem uma experiência combinada de 50 anos em apoio, documentação, auditoria e envolvimento de comunidades independentes, como Catalyst."}