{"id": 382615, "author": "tienna", "title": "Catalyst Events 4 Vietnam Students", "url": "https://cardano.ideascale.com/a/dtd/382615-48088", "category": 26234, "amount": 18000, "description": "Muitos estudantes do Vietnam Uni não estão cientes das campanhas de financiamento do Projeto Catalyst e das oportunidades existentes.", "funded": 2, "upvotes": 72206787, "downvotes": 6909856, "votes_result": 65296931, "votes_cast": 460, "f6_no_assessments": 12, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A idéia é muito boa e dialoga diretamente com os objetivos do desafio, pois procura criar eventos sobre a cadeia de bloqueios e Cardano no Vietnã. Os autores justificam que é um lugar estratégico para se investir, já que tem um alto número de estudantes de tecnologia se formando anualmente, é também um dos países que mais aceitam e utilizam moedas criptográficas, sei disso porque foi um fato que se mostrou em outra proposta que eu avaliei. Achei interessante como os autores pensaram sobre este projeto de forma circular, ou seja, eles não pretendem apenas introduzir e desenvolver o conteúdo com estes estudantes, mas acompanhá-los e orientá-los durante o processo de criação e apresentação de propostas. Desta forma, haveria um acompanhamento mais completo com os jovens, pois não só lhes seria ensinado o que é Cardano, mas como lançar e executar projetos na cadeia de bloqueio, através do financiamento do Catalyst. Esse foi meu entendimento geral da proposta, e acho que vai além de várias outras propostas para este mesmo desafio, não se limitando à exposição de informações. O que poderia ser melhorado, em minha opinião, seria a compreensão das próprias reuniões. Gostaria de ver um planejamento mais detalhado, ou seja, quais seriam os assuntos abordados em cada reunião, quantos seriam, quantos estudantes seriam planejados para cada reunião, a partir de quantas reuniões entrariam em prática (lançamento de propostas), quem apresentaria cada reunião... Detalhes. Mas em geral, o impacto da proposta é alto e se encaixa muito bem com o que é pedido aqui.", "q0r": 4, "q1": "Os autores fazem uma apresentação muito diferente sobre si mesmos: não apenas definem quem são, o que fazem individualmente, quais são suas áreas de treinamento, mas também incluem vários links de suas redes sociais, como o linkedin, onde podemos conhecê-los mais intimamente, e vários canais de comunicação direta, onde o contato individual pode ser estabelecido com cada um deles. Sobre essa parte, é excelente. É transmitida muita confiança na capacidade dos autores de executar o projeto com sucesso, principalmente porque todos eles são da área de tecnologia. Gostaria apenas de sugerir que você contrate alguém da área de marketing e design para promover o alcance adequado e projetar materiais gráficos para as reuniões, estas peças também são muito importantes. Há aqui um roteiro muito detalhado, no qual sabemos o que aconteceria em fases, divididas em meses. O que sugiro é a criação de um cronograma, para que as informações sejam organizadas de forma mais sintetizada e visualmente simples, em relação às reuniões propriamente ditas. A parte da orientação para a apresentação de propostas é um processo mais qualitativo e individual, que não cabe tanto em uma mesa, na minha opinião. Mas sim, o nível de detalhamento é bastante satisfatório. Quanto à divisão financeira, acho que esta proposta explica idealmente como o dinheiro seria utilizado, pois eles não apenas dividem o valor total, mas especificam mais detalhes sobre cada parte. Desta forma, temos uma compreensão precisa de como este dinheiro seria utilizado. O que eu sugiro aqui então é apenas uma organização mais direta sobre o roteiro em relação às reuniões em si, caso contrário, tudo bem.", "q1r": 4, "q2": "Temos muitas informações sobre a auditabilidade para que possa ser feita de forma segura e precisa. Os autores explicam os resultados esperados para cada fase individual, fornecendo detalhes que tornam possível monitorar de perto as partes. Se formássemos uma equipe para acompanhar o progresso do projeto, eles saberiam exatamente o que avaliar para determinar se o projeto está sendo feito como prometido ou não, e poderiam trazer esse feedback para o resto da comunidade. Os autores também nos fornecem KPIs, através dos quais temos mais informações quantitativas, dados que apontam diretamente se o sucesso foi alcançado ou não. Como uma parte mais objetiva, acredito que tais informações poderiam ser incluídas em relatórios e expostas diretamente à comunidade, através de apresentações na prefeitura, por exemplo. Finalmente, o que eu sugiro para dar ainda mais força a esta auditabilidade seria um monitoramento individual dos estudantes envolvidos com relação aos resultados. A equipe se propõe a orientá-los na apresentação de projetos, mas também gostaria que eles nos dissessem se têm ou não financiamento, qual o impacto que Cardano teve em suas vidas, se pretendem manter contato com a comunidade e trabalhar com ela a longo prazo. e etc. Mas isso seria um bônus, pois a equipe já nos forneceu informações suficientes para fazermos uma grande auditabilidade.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 14, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "Os proponentes têm pensado muito nesta proposta. Sua experiência no Projeto Catalyst mostra claramente e pode ser vista em como eles identificam uma questão local e a correlacionam dentro do cenário do Desafio. Eles se articulam claramente sobre como abordar as universidades é o caminho a ser seguido para embarcar no Catalyst e Cardano. Embora não se especifique qual universidade será alvo e como, e que garantia essa universidade escolhida estará 100% receptiva a este evento. Corrigir o público aqui significa os passos mínimos necessários para que um indivíduo entenda e implemente Cardano, sendo este um objetivo de curto prazo. Eles também abordaram a meta de longo prazo, afirmando que esta proposta é um processo contínuo que se estende por 2 anos, o que também aborda a continuidade, pois ter eventos de uma só vez não equivale a um interesse sustentado em Cardano. Uma grande parte do cenário do Desafio é coberto por esta proposta e, se documentado corretamente, este evento pode ser escalonado e duplicado em todo o Vietnã. Esta é de fato uma proposta altamente eficaz.", "q0r": 4, "q1": "Não há dúvida na experiência dos proponentes, todos são indivíduos realizados que podemos rastrear através de seus links LinkedIn. É claro que este grupo de indivíduos fizeram um brainstorming desta proposta juntos para quase todos os proponentes e co-proponentes que têm um histórico de ensino. Apesar de, ao mesmo tempo, levantar uma questão por ser tão bem educado, não há um programa claro sobre o material que eles utilizarão para educar os estudantes universitários no Projeto Catalyst. O foco inicial é a realização do evento em si. De todos os proponentes e co-proponentes, o único indivíduo que tem formação em Catalisador e pode ser capaz de educar sobre Catalisador é o único indivíduo sem formação em Catalisador neste grupo. Seria de se esperar, preparar o material primeiro em vietnamita seria o primeiro passo. No entanto, isto provavelmente poderia ser mitigado através da colaboração com a Escola de Catalisadores. Esta proposta é bastante detalhada em termos de orçamento, embora os números mencionados sejam bastante altos para esta região. Uma taxa horária de 60 dólares em toda a região; desde a orientação de um proponente até a realização de pesquisas, poderia ser melhor alocada para o desenvolvimento de materiais didáticos locais. Embora haja uma menção de risco, na verdade é mais uma oportunidade.", "q1r": 3, "q2": "Não há dúvidas sobre a preparação do evento. Há um roteiro claro do mesmo, chegando até o quinto mês com um KPI realizável. Com todos os dados acima, a auditabilidade pode ser feita de forma responsável. Embora mais uma vez, deve haver um foco nos materiais educacionais do Projeto Catalyst em vietnamita antes do lançamento de uma série de eventos. Mais uma vez, isto pode ser tratado colaborando com a Escola Catalisadora e, se feito, esta proposta será um sucesso, pois há uma forte correlação entre a declaração do problema e a solução.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": " \r\n\r\nThe problem needing to be solved has been identified and articulated namely many Vietnam Uni students are unaware of Project Catalyst's funding campaigns and the opportunities\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by Organizing virtual or onsite sharing events about Catalyst for students\r\n \r\nThis proposal shows how it adds value to the Cardano system by organizing virtual or onsite sharing events about Catalyst for students\r\n  \r\n  Key metrics  would be  number of events, number of participants, number of new proposers  , number of lecturers, no of students. \r\n \r\nThe key metrics and goals of the proposal fall within the scope of the challenge \r\nProposal can be scaled up to address future challenges by adding more content to the courses and bringing more schools and universities and IT institutes. \r\n\r\n \r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members schools, and universities.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.", "q0r": 5, "q1": "The proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Eastern Town Hall  events as well as managing the documentation process for these events.\r\n \r\n \r\n The links are sufficient. \r\nI have visited these links and contacted the relevant people\r\n\r\nThe proposers are well experienced and competent to do the event.\r\n\r\n The type and number of team members required to implement the proposal is stated.\r\nThe team structure is listed and experienced. \r\n The budget has   been given in detail.  \r\nThe budget is  reasonable to achieve the set goals. \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n\r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.    \r\nThe proposal has technical aspects which have been addressed \r\n\r\n \r\nThe proposer has  identified risks in this  proposal\r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms, number of courses, no of schools, no of universities, no of graduates, no of proposals. \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties  \r\nAre there contingency plans in place for various outcomes?\r\n \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 17, "ne": 5, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "The idea in its scope is good and well presented. The proposal wants to create a knowledge-sharing event about Catalyst for university students in Vietnam. The problem is identified and the solution is clearly stated, meeting the objective of the challenge", "q0r": 4, "q1": "The proponent has the necessary knowledge and commitment to carry out the project. The proposed group of 5 members is described in detail and in detail. Each member's information can be easily checked against the individual links they provide.\r\nThe proposal was carefully thought through, given concrete options, and gradually was implemented with great certainty. The proposed team was funded by Fund 6 to build a website about Cardano (Cardano2.vn), which is also a stepping stone for the team to successfully implement this proposal.\r\nIt's great because some of the potential challenges and risks have been presented by the proponent and the proponent has solutions for all of them.\r\nWith the above reasons, I fully believe in the feasibility of the proposal", "q1r": 5, "q2": "A clear roadmap has been given in the proposal and it is conceivable that the solution in this proposal solves the problem at hand.\r\nThe stated budget is reasonable, the budget statement is transparent. KPIs make it easy to measure and track your proposal's progress", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "I strongly agree the proposal is within the challenge completely because the proposal addresses most of the challenge's Guiding Questions:\r\n            -  The proposal increase meaningful participation in Project Catalyst among all stakeholders\r\n            - The proposal onboard and integrate new people into Project Catalyst\r\n            - The proposal use events to build new teams\r\n            - Active participation in events be increased\r\n            - The number of participants in events be increased\r\n            - The proposal helps keeping the community together", "q0r": 5, "q1": "I strongly agree that the proposal is likely to be successfully implemented because of following points:\r\n- The proposal provide a website with title 'Bring Cardano to Vietnam' (the winning project in Fund6). That is not only the foundation for the first step of this proposal but also the statement of the team's experience and relevant skills fulfilling for the successful implementation. Type and number of team members and roles are also provided in details in the proposal. \r\n- The budget is clear and broken down into identifiable items and reasonable to achieve the set goals.\r\n- The plan of the proposal (Phase 1) is clear understandable, sensible and conductible. (clear articulating what is being done in phase 1 of roadmap and clear solution how to make it done in Phase 1- deliverables)\r\n- The proposers have considered risks in the project. I would like to know about the solution of the team in that case.", "q1r": 5, "q2": "The proposal has roadmap and clear understandable description of the targeted problem as well as the solution that addresses the problem. Metrics are also clear and easy to audit. Additionally, the proposers commit to transparency process with the community by tracking of all project activities and expensing in the githup. Therefore I rate auditability with a score of 5.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is a brilliant idea. The goal of this proposal/challenge fits into the challenge settings. The statement of what problem is to be solved is stated clearly. I like the fact that there is a further explanation of the problem statement and solution to the problem.", "q0r": 5, "q1": "The proposal has got an identifiable team and that for me is good. The team per their qualifications possess skills and experience needed to implement the proposal. They have also attached relevant links as evidence to their claim. The proposal has got a budget which has been further broken down into identifiable items. The proposal has also provided a time frame and plan for implementation.", "q1r": 5, "q2": "Roadmap and time horizon for the achievement of the proposal are clearly outlined. It's good that the proposal has included the KPIs/metrics that define the success of the proposal.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Excellent proposal with an awesome idea. The proposal really tackles the problem and has got educators involved for easy adoption and participation. The targetted group are students and this would help the position of Catalyst in the future.", "q0r": 5, "q1": "Great to see the dean of Information Technology onboard. Overall, the team is great. Collaboration with other universities is best achieved if colleagues lecturers are spearheading it. This would help adoption and increase participation from the students populace easily and I am enthusiastic about the fact the \r\nnumbers of student participants may increase so the team should be prepared to manage the excess numbers during events.\r\n\r\nPhase one of the proposal is achievable and has a specific metric that would be easy to define success. I would be to the progress of the project as a whole and integrating blockchain in university academic curriculum is very welcoming. ", "q1r": 5, "q2": "The team is transparent and the proposal has outlined how it can be audited by the community. Great breakdown of activities and documentation involved to help tracking and openness. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The idea of providing education on project catalyst to the community in Vietnam is an excellent idea. This will be helpful in creating awareness and also increase the cardano community in Vietnam. Therefore, as far as this proposal seeks to expand the cardano user base, I agree that the project will address the challenge. \r\n\r\n", "q0r": 5, "q1": "The team behind this project are individuals with experience in previous fund. More importantly, the proposal has a well captured target audience and there is a well-developed timeline for the proposal. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely increase the cardano presence in Vietnam. Additionally, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully\r\n\r\n", "q1r": 5, "q2": "\r\nThe project provides a metric to monitor and track the progress and success of the project. For instance, the project has an outlined number of people it expects to participate in community organized events and a targeted number of events it seeks to undertake. However, the metric could be improved by developing a database to capture active participants.\r\n", "q2r": 4, "assessor": "z_assessor_732", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "By organizing events, giving presentations at several universities will help students know and understand Catalyst. However, which 2 universities will you conduct the project? There are many different types of universities in Vietnam and not all students will be interested in such projects. The above project did not specify selection criteria or a specific school. Moreover, there are also many projects that will also be more competitive, like \"Incubators\" for example, they have a good reputation in the past", "q0r": 4, "q1": "The plan is clear, detailed, with a full list of costs. However, there are many unnecessary expenses and many unreasonable points. For example, item (1) usually events at university will not need to rent a room, projector, equipment is enough; (2) why is it calculated by the hour and not by the number of people?; (3) should be charged per project rather than hourly, about $60 x12= $720; (4) I think it's not needed or about $20-$30 only. The project has to adjust the cost. ", "q1r": 2, "q2": "There are a lot of personal information to prove the authenticity of the project. The people who carry out the project are experienced, well qualified. I am also a student of Vietnam National University, Ho Chi Minh, although not in the same city, but in the same training place. I know better than anyone else to be a lecturer in this environment is very difficult, must be really good. So I have faith, this project is not to cheat investment money. However, to be honest, this project is risky, highly competitive, there are many projects similar to the \"Vuon Uom\",...", "q2r": 3, "assessor": "z_assessor_756", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal successfully addresses several of the objectives of the challenge  eg. integrating new people to the Project Catalyst and increasing active participation in the events.  The proposers plan is to educate IT students in Vietnam on opportunities on becoming a proposer, referrer, or voter.  The proposal is well written and easy to understand.  The funding request of $18K is justified, as the proposer is building on their past successful proposal where the team were funded to build a website for students. (the website is up and running)   ", "q0r": 5, "q1": "The team is highly skilled and experienced and most likely to succeed in implementing this proposal.  Not only have they shown the capability to deliver from fund 6, they have the right mix of skills as evidenced from their LinkedIn profiles.  The timeline and deliverables are simple to understand and look achievable.  As mentioned above it is good value for money because it is spread over multiple events as oppose to other proposals in this challenge where the funds requested is for a single event. ", "q1r": 5, "q2": "The metrics are clear and measurable, they also look achievable and as the activities are spread over 12 events and multiple months the team will have opportunity to learn and iterate.  The team have created a simple tool to track all project activity and costs therefore providing full transparency. ", "q2r": 5, "assessor": "z_assessor_774", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is totally matches the challenge requirements, and it looks like this project could be huge win for the students who can gain more knowledge and earn income by working in blockchain space. It also increase the huge number of proposals for Catalyst. ", "q0r": 5, "q1": "This proposal is very likely to be successful based on the definition of success set out in the plan. \r\n\r\nThe team is experienced in running Townhall to support Catalyst as well as the experience of a CA as well as have the funded proposals on fund 6. Team also include two lectures from university who will help a lot on the communication with University's management as well as the students.\r\n\r\nThe budget not only is broken down into very clear items but also has a reasonable estimation for each one of them. \r\n\r\nThe milestones are very realistic and feasible. \r\n\r\nThe only point I would add is that the proposers may consider to divide their target into two phases: 1) have pioneer students to become community advisors (which can be within 2 to 3 months) then (2) have pioneer students to do the catalyst proposal itself (5 months milestone). From my experiences, most of CA will become Catalyst proposer later on and the success rate of their proposal to be funded will be higher because the student already have the view of a CA when evaluate a proposal.", "q1r": 5, "q2": "The team has presented a detailed roadmap with a clear time line. KPIs were present clearly, quantifiable and easy to tracking and reporting. \r\n\r\nTo better define the success of this proposal the team consider to add KPI about the successful rate of proposal (ie: among 12 proposals summited, how many proposals are funded by Catalyst).", "q2r": 5, "assessor": "z_assessor_819", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The proposal aims to engage and onboard university students through  events to engage, educate and collaborate with students and the participating universities to create awareness about opportunities apparent in project catalyst and also to provide support. The benefits of this proposal is immense and definitely helps to engage active participation and interest in project catalyst.", "q0r": 5, "q1": "The proposal has a team with requisite knowledge and experience to delivered this proposal successfully. In addition, The proposal has also provided a detailed roadmaps to be achieved and the budget breakdown is very clear to justify the funds requested.", "q1r": 5, "q2": "The Success metric as provided, is more than enough to assess the proposal's progress and developments.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 19, "ne": 2, "ng": 8, "nfo": 9, "vca_o": 1}], "solution": "Organizar eventos virtuais ou de compartilhamento no local sobre o Catalyst para estudantes. Conectar, motivar e apoiar os estudantes a participar do Catalyst.", "experience": "Somos SPOs, técnicos de economia de cadeia de bloqueio, moderadores/co-hospedeiros da cidade de Eastern Townhall e proprietários de projetos financiados"}