{"id": 384635, "author": "chrisr", "title": "Distributed Digital ID SharkTank", "url": "https://cardano.ideascale.com/a/dtd/384635-48088", "category": 26255, "amount": 26800, "description": "Tecnologia de identificação digital descentralizada, governança e implementações requerem suporte! A Cardano precisa de um filtro/acelerador para promover projetos!!", "funded": 1, "upvotes": 28698861, "downvotes": 11465470, "votes_result": 17233391, "votes_cast": 109, "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Sim, a proposta efetivamente enfrenta o desafio. Os proponentes fazem um bom trabalho ao destacar o problema que estão tentando resolver e fornecer uma solução para como enfrentá-lo. Dependendo de quem são os \"tubarões\", pode haver um grande impacto, no entanto, isto não está claro na proposta, já que não foram identificados nomes, deixando os eleitores a adivinhar o nível potencial e a substantividade do impacto. Também não está claro por que esta abordagem está sendo escolhida em relação a uma abordagem mais direcionada, mãos na massa. Embora eu não me oponha a que o estilo de tanque de tubarões seja proposto, parece estranho que a seleção/identificação dos tubarões não constitua um componente chave da proposta. Também não é óbvio para mim por que a sessão de 60 minutos de treinamento seria solicitada. O objetivo não é ajudar a orientar e acelerar o projeto, engajando-se diretamente com esses especialistas? Além de ajudar a aprimorar as idéias apresentadas, como os tubarões apoiarão o avanço e a implementação dos projetos que eles criticam? O que os apresentadores podem esperar além de uma \"surra\", particularmente para aqueles que não estão no topo de cada semana? A fim de obter notas completas, eu encorajaria a equipe a considerar a possibilidade de abordar estes pontos.", "q0r": 4, "q1": "Infelizmente, com base no plano e na experiência apresentados, não concordo nem discordo que esta proposta possa ser implementada com sucesso. Embora eu aprecie as credenciais fornecidas pelos proponentes, o que ajuda a dar alguma confiança em sua capacidade de entrega, o fato de os \"tubarões\" não terem sido nomeados, muito menos comprometidos, torna impossível saber se o projeto pode estar à altura do que diz que vai fazer. A linha do tempo é aceitável e os resultados após 3 e 12 meses são claros, porém os resultados após 6 meses são muito abstratos e não fornecem nenhuma indicação de como isto seria alcançado. O que significa realmente \"reconhecimento global da Thought Leadership em projetos de identidade digital descentralizada/lançamento de negócios\", e quem dá este tipo de \"reconhecimento\"? O orçamento também deixa muito a desejar para os eleitores, particularmente, já que a maioria do orçamento $20k é apenas para \"engajar os tubarões\", mas depois não são fornecidos detalhes sobre o que realmente se entende por isso. Como o dinheiro será separado: 4k cada um? Você manterá a contingência para um back up caso um tubarão não possa comparecer? Você vai ter tubarões alternativos? Como me restam tantas perguntas que não são abordadas ou incluídas na proposta, não posso dar uma pontuação mais alta.", "q1r": 3, "q2": "Infelizmente, as informações fornecidas não fornecem provas suficientes para provar que a comunidade pode auditar suficientemente o progresso e o sucesso da proposta. Os proponentes fornecem pelo menos duas métricas mensuráveis que os eleitores poderiam usar para auditar o processo (seis sessões completadas com três projetos/equipas qualificados; e três vencedores do \"Distributed Digital Identity Shark Tank\" para produzir resultados tangíveis), porém estas são muito amplas e não fornecem indicação se a abordagem \"tanque de tubarão\" realmente produziu os resultados que alegou. Como a maior parte do orçamento é para os \"tubarões\" e não para os proponentes, não está claro como a comunidade poderia medir e avaliar o sucesso do dinheiro. Como a comunidade determinaria qual tubarão(s) agregaria valor em comparação com outros que talvez não o tenham feito? A razão pela qual estou dando a esta proposta um 3/5 e não um 2 é porque eles mencionam que estarão trabalhando em colaboração com a liderança do IOG para selecionar os candidatos. Embora eu tivesse desejado mais detalhes (como mencionado acima) sobre como será este processo e os critérios utilizados para que os membros da comunidade interessados pudessem saber como e por que escolher quem você faz, a inclusão da IOG no processo de tomada de decisão pode dar aos eleitores um pouco mais de confiança de que eles serão capazes de auditar a proposta.", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is to run a SharkTank session every 2 weeks for 5 months from Feb22  focused on Digital ID products.\r\nGiven there is a specific challenge to \"Accelerate Digital Identity\", it feels this proposal would better sit there. Saying that, it is a relatively low cost proposal thus as part of a suite of accepted proposals under this challenge could be seen to meet the brief. ", "q0r": 4, "q1": "The key to this proposal is recruitment of 5 Sharks. Presumably these Sharks will buy equity in projects they like as in the TV version of the SharkTank. These Sharks have not yet been committed, so the whole project relies on that. The proposer has experience in this domain, though the company he is CEO of is has only 3 employees and 7 followers on LinkedIn.\r\nWithout the Sharks, its hard to say if this will be success. There are no details on how this marketed, just a $6k budget line. Zoom is mentioned in the budget, so presumably that's where the sessions will be conducted, but the key strength in the SharkTank concept is viewership. ", "q1r": 3, "q2": "The project has a clear deliverable of SharkTank sessions every two week from Feb 2022. However there is not much detail on what these actually entail or even how long they go for. How to we then audit delivery? As the sharks themselves are clearly integral, a Time line for them committing should be a deliverable, but also probably some sort of metric on their quality.\r\nIts not clear why the KPI for success after 3 months is 6 delivered sessions If they are to be every two weeks, should this not be 12-13?\r\nWhilst the goal for 6 months is laudable, how to you measure \"Global recognition for Thought Leadership in decentralized digital identity project/business launch\"?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 25, "ne": 5, "ng": 19, "nfo": 1, "vca_o": 1}, {"q0": "It's a really nice idea, although the expected outcomes and impact are a bit vague: \"Top teams from each session will be rewarded with coaching and network connections\". Also, unless you have a commitment from the funders you shouldn't make guesses like \"additional funding provided by IOG\" (what exactly is your connection with them and what has Tony Rose committed to?). Finally, if you call it the Shark Tank you set the expectation that it's a TV Show. This, however, is nothing but six sessions in Zoom, right? Even that might be hugely beneficial for the participants but no need to sugar-coat what it is.", "q0r": 3, "q1": "Team seems solid and especially their subject matter expertise with SSI / DDID is noteworthy. The plan, however, is a bit generic/ambiguous and it is not fully explained what \"engaging the sharks\" entails. What are we paying 20K for? Involvement from Tony Rose (IOG Head of Product, Identity) could be elaborated a bit more.", "q1r": 4, "q2": "Although not necessarily under those headings, there is a certain roadmap with milestones and a time horizon for achieving the goals. It's a simple proposal that doesn't necessarily need any more KPIs than what has been stated here (six 60-minute coaching sessions with 5 sharks).  The problem statement could have been crystalized better though. Now it unfortunately sounds a bit like solution is looking for a problem, not the other way around.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "* The proposal aligns well with the challenge setting. Our funded projects need a certain audience in order to grow, become investable and attract more developers, mentors, investors, customers. The solution is adressed, but could be a bit more clearly defined. It has the potential to boost many funded projects top the next stage. Therefore the proposal provides scalability for future challenges. What remains unclear is the targeted demographic group. I would love to get more information about it.", "q0r": 3, "q1": "    - [ ] The proposal presents a team incl. linkedin and shows experience in the field of action. The proposal assumes the reader knows who Tony Rose is and what SSI stands for. I don't know either. If Tony Rose has a huge and the right audience which helps our funded projects, please include it into the proposal. The timeline is reasonable and clear. The budget break down could be more specified. Especially the 'engage the sharks' position is responsible for 3/4 of the requested budget and we do not get enough information how to approach and win them. The KPIs are included in the roadmap and indicate that after six sessions we get 3 teams (18 on total) promoted. What remains open if this stops after 3 months or if we can multiply it by 4 in order to have 18x4 = 72 teams promoted with this proposal after 12 months. If yes then the budget/team ratio is pretty reasonable for the case that we reach a certain audience which is not further specified. Adding more details could improve the level of quality of this proposal.", "q1r": 3, "q2": "The problem statement is understandable. There are clear metrics in order to measure the success of this proposal. The timeline is also clear. Unclear is where the money goes to, in detail. A break down which is more easy to follow would help a lot. Unclear is also how to attract the requested qualified, recognized, and respected leaders beyond the project team. It would be great to get an updated version with a bit clearer explanation.\t", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal suggests that the Digital Identity Shark Tank team will be the advisory and accelerator team to deliver results and guide and coach Cardano project teams. This could be a good thing to accelerate proposals with potential and provide them with the necessary mentorship. In the end this will have a positive impact on the Cardano eco system.", "q0r": 4, "q1": "The Proposer has made available links to two team members who will be the project leads. Then makes mention of Qualified, recognized, and respected leaders in SSI from India, Europe, Africa, Central/South America, Asia, and North America. It would have been beneficial to the proposal if these Qualified professionals were identified already with links to their experience and skills. This would make the project more feasible. Breaking down the budget a little more could also help community members and voters see that proper research has been done around the possible cost aspects. The timeline seems realistic. Resources and risks are not mentioned. This would add to the likeliness of the proposal being voted for.", "q1r": 3, "q2": "The auditability of the proposal will be measured by the results which is stated in the definition of success, with a 3, 6 and 12 months timeline and what they expect to achieve. This will also give an idea of the success of the project. A space should be provided where the community can keep track and follow the results of the project. This could really be a good project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Um painel de 5 especialistas em ID digital hospedados por Tony Rose analisará os projetos. Sessões de treinamento de 60 minutos disponíveis mediante solicitação.", "experience": "Experiência combinada de mais de 80 anos de empreendedorismo tecnológico, investimento e experiência executiva, incluindo líderes mundialmente reconhecidos na SSI."}