{"id": 368720, "author": "", "title": "Library of Proposer Case Studies", "url": "https://cardano.ideascale.com/a/dtd/368720-48088", "category": 26113, "amount": 37500, "description": "Communicating ideas to a crowd is intimidating if you have not seen others do it well & know how it worked out for them.", "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": ["https://youtu.be/ggzLk0VtO0I"], "media": [], "f6_assessments": [{"q0": "This is a great idea that could really help people gain the confidence to become entrepreneurs. The key point missing from the proposal is some metrics on how much they expect to produce. $37,500 is not a small amount of funds. How many case studies in terms of blog posts, pdfs, infographics and videos will we get for that?", "q0r": 5, "q1": "The team has great experience and a well set out plan of what they are going to deliver. I have no doubt they can produce some great material here. But how much material will the produce? Output quantity is missing form the plan.", "q1r": 5, "q2": "Whilst there is a relatively detailed pan, it is not possible to audit delivery of this plan without a clear set of deliverables with timelines. The have set some metrics of success, the most import being the number of users of the tools and the difference score of users vs non-users. What is this difference score? Percentage of successful funding applications? How would you account for selection bias in terms of general submission community vs possibly more dedicated/motivated entrepreneurs who reach out for a resource that is available? It would be nice to see some goals around any metrics proposed. How many people do you expect to use the resource?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal fits in the DLT Entrepreneurship Toolbox challenge like a hand in a glove. It is by no means the first proposal that aims to highlight success stories but it is one of the better ones. This is exactly what is needed to inspire new entrepreneurs to submit winning proposals.\r\n\r\nThe reasoning of the proposal is beautifully laid out: it is easy to read and flows nicely to a logical conclusion: This is an approach that deserves to be implemented.\r\n\r\nI encourage you to look for collaboration opportunities with this team: https://cardano.ideascale.com/a/dtd/Interactive-Cardano-Ecosystem-Map/368322-48088\r\n\r\nYour ready-made case studies could be easily added to https://builtoncardano.com/", "q0r": 5, "q1": "I have worked in multiple capacity building roles and I can confidently say that the proposers are obviously highly skilled professionals who know what they are talking about. My only doubt is the participation of The Catalyst School and The Swarm? They are not mentioned as proposers so it's unclear if they are backing this proposal or if it's only a wish that they will participate.", "q1r": 4, "q2": "It is not mentioned anywhere how many funded entrepreneurs will be showcased, therefore the scope of the project remains unclear.\r\n\r\nThe timeline feels a bit over-extended. You should be able to deliver results faster.\r\n\r\n$70,00 an hour is a bit on the high side but probably justified based on the required talent. It is not entirely clear, however, if all these skills are found in the team or if some of them need to be outsourced, namely Videography, Graphic design, and Animation.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to create case studies that will teach us a lot about Cardano projects. Patterns that emerge around delivering valuable products and services to customers on Cardano can become part of the tools and frameworks created for local community hubs. To learn things about Cardano products that may never have known before by getting a good idea about how our successful proposers are doing what they doing and how their customers are reacting. The proposal is too generalized to be able to determine effectivity in addressing the issue at hand.", "q0r": 3, "q1": "The proposer has co-founded nationwide place-based network of local hubs supporting emerging entrepreneurs; Blockchain, Finance, Design, Startups, Education. Plan presented is descent and may be implemented successfully.", "q1r": 3, "q2": "The key performance indicators (KPIs) is mentioned, and the timeline is reasonable. The ability to audit this proposal  by Number of users, using the tools and difference in score of applicants using the toolbox and those not using the tools.", "q2r": 3, "assessor": "z_assessor_340", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"q0": "The development and showcase of real case-studies of successful Catalyst projects can definitively help new proposers understanding the whole process from idea creation to delivery and learn how other have tackle problems. As this challenge is seeks to help inexperienced entrepreneurs to learn and apply vital entrepreneurship skills, there is now doubt that this proposal met this goal.", "q0r": 5, "q1": "The team shows great background in developing entrepreneurial educational programmes. The plan is well defined, with clear deliverables, due dates and how the budget was calculated. Base on that there is no doubt of the feasibility of the project.", "q1r": 5, "q2": "The proposal defines the deliverables in detail with its timeline and key metrics for success, A reasonable budget was calculates based in hour of work making a transparent way of auditability. ", "q2r": 5, "assessor": "z_assessor_554", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposers make a good point regarding the challenge that this proposal is tagged to and are right in saying that it will have impact across several challenges, but equally, it does make sense here under the DLT Entrepreneurship Toolbox. \r\n\r\nThe proposal for a repository of case studies with both example content as well as curated content to assist potential proposers is (in my opinion) a great idea and one that is sorely needed to allow more people from more walks of life to contribute to the community. This should be fairly clear to a voter. The way the proposal is written really grabs you and tells the story of \"why\" this is needed too, which should appeal to a wide group of people. \r\n\r\nThe impact will be global, not accounting for language barriers; and as it's pulling from successful stories (although it might be worth showing unsuccessful case studies too in future as a point of comparison) should be easy to scale. ", "q0r": 5, "q1": "The proposers do appear to have the experience and skills necessary to execute this sort of project and I think it will be well received by the community - especially as we progress through the funding rounds and the projects get bigger. What's missing however is a nod to their proposed front-end and how they're going to make it easy to navigate. To the proposer: a rough outline of your output medium would be good to see. So, where are you going to house the PDFs? How are people going to be able to search through it all to find relevant examples? How are you also going to drive traffic to your resources? I have 10+ years in curating, promoting and delivering training content in a corporate setting and this front-end problem is worth considering carefully as it can make or break your uptake numbers and overall success. \r\n \r\nThe budget appears to make sense although it would be good to see a further breakdown of the resources you're going to call upon to execute the deliverables. You've introduced us to the leads here but do you already have a network of people you can tap into in order to create the content efficiently and also to standard?  ", "q1r": 5, "q2": "The success of the proposal will be measured primarily by the quality of the output but this is highly subjective. So it might be good to see hard numbers - how many videos/case studies are you hoping to create and by when? Also, how much uptake would it take for you to deem this project a success? There is little mention of how the proposer intends on promoting this new content and resource, which should be a major consideration. If it is as simple as \"it will be provided as a link on the proposal builder page\", that's fine- but it would be good to be explicit about this so we can measure the impact of this. \r\nSecondly, the number of hours are listed as being 21 hours per week - who will be doing these 21 hours? Will this be in addition to people's day jobs or will you be outsourcing? If outsourcing, how are you going to measure the ROI here? As the impact of this project might be quite subjective, do you intend of surveying users? It would be good to see this part fleshed out a little so that the community can quickly measure the impact of their investment in the project. ", "q2r": 4, "assessor": "z_assessor_620", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "Language evolves, ideas blend, skills get honed, in entrepreneurship & tech we stand on others shoulders by understanding what's gone before", "experience": "Co-founded nationwide place-based network of local hubs supporting emerging entrepreneurs; Blockchain, Finance, Design, Startups, Education"}