{"id": 369300, "author": "", "title": "Proposal Framework Tool - AIM", "url": "https://cardano.ideascale.com/a/dtd/369300-48088", "category": 26113, "amount": 14000, "description": "Creating robust Catalyst proposals should be easier. +75% proposals don't win Catalyst funds costing assessors + proposers time + resources.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Addresses the challenge extremely well and will do its own research to track key metrics also mentioned by the challenge. Giving entrepreneurs the tools to create higher quality proposals will make assessments easier and more efficient. Proposals using these tools that gets funded will convince more people to use these tools which will cause this project to have a positive impact on Catalyst.", "q0r": 5, "q1": "This proposal has a stellar team onboard. They are extremely active Catalyst community members with the necessary experience and skills to make a project like this succeed. The budget is more than reasonable and broken down into identifiable items. They go into great detail explaining how this project will be build and what frameworks will be used.   ", "q1r": 5, "q2": "This team has assessed their own project and made sure to include all the necessary info.  They have included tools to measure their own success, like forms to capture the user's journey. They will do their own research to capture key metrics to measure success. There is also more than one outcome/external funding options for the user which makes this tool quite resilient to failure. 5 stars all round", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal meets the brief of the DLT Entrepreneurship Toolbox challenge as it aims to both develop skills in entrepreneurs and increase the quality of proposals. At best this will develop into proof-of-quality and will give an edge to proposers who use the CARE methodology. Yet, I would like to see more detail on how this tool helps develop proposal teams, and not just focus on an individual.", "q0r": 4, "q1": "Previous tools developed by the same team are proof that they can deliver quality results within the scope, budget and timeline. It is good that the affiliated proposal is mentioned here (this proposal wasn't mentioned in that other proposal). Also the positiveblockchain.io connection sounds promising.\r\n\r\n(Minor feedback: it's not \"indexes\" but \"indices\")", "q1r": 4, "q2": "The plan and budget are detailed enough at this point. The total budget is very reasonable concerning the amount of work involved. Linking to SDGs is a good idea. It should be noted, however, that this approach cannot be used with all projects and proposals because measuring direct/indirect impact to SDGs can be tricky.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal provides a tool that walks proposers through the proposal writing process with the end result being higher quality proposals. The proposal is well written, addresses the challenge and scales to a large portion of the community although only english speakers.\r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposers provide ample evidence of relevant skills. Budget and plan are all good. The development timeline is in level of effort and not timeline which causes some concern. Given that Fund 7 will likely begin shortly after this challenge fund is awarded and the level of development effort in the proposal, it seems likely that this tool will not be available for the early part of Fund 7 when it would be most useful. This could also impact the proposed research article that is supposed to start collecting data in November which seems to be prior to the tool being developed. A timeline would have helped to address this timing issue.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap but no defined timeline and no auditable milestones other than completion although the development period is very short. The metrics are well defined.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Provide a tool that guides proposers through the process with access to numerous frameworks that assist with structure.", "experience": "AIM members are the team behind the voter-tool, CA-tool, vCA-Tool. Educators, developers, designers and data experts."}