{"id": 399141, "author": "john.afrane", "title": "A LIBRARY FACILITY AT MEDIE", "url": "https://cardano.ideascale.com/a/dtd/399141-48088", "category": 26439, "amount": 19000, "description": "The Medie Community don’t have a convenient place to study after school hours.\nThe people also have no idea about cardano blockchain .", "funded": 0, "upvotes": 22542495, "downvotes": 13227648, "votes_result": 9314847, "votes_cast": 79, "f6_no_assessments": 5, "f6_rating": 3.066666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7359, "q0": "This proposal is rather superficial as a whole. We do not know, exactly, which activities will be developed within this library. On the feasibility part, the proponent explains that personalities (from the cryptographic world, I believe, because it doesn't make much sense for them to be well-known people who are not from the blockchain field) will be hired to lecture on “matters of national interest”. What subjects would those be? How would the Cardano ecosystem benefit from these lectures and the other library activities? My understanding of this proposal is that the objective is to generate a more suitable place for school-aged students to concentrate and learn, but it is very inexact how this would all have to do with the cryptographic world, let alone Cardano. This challenge aims to fund projects that help expand our blockchain to more specific communities, unlike the challenge of new members on board. In this case, little is explained about the community that would be the target audience of this project. I researched a little about the Medie community, but I couldn't identify what country they are from, what language they speak, what their cultural characteristics would be. Another clue we have about where the people on this project would come from is through the professionals involved: it is revealed to us that Mr. John Kwame Afrane is an agent of fan milk Ghana ltd. With this, we concluded that the library would be built in that country, however, it was necessary for this information to be more accurate. Therefore, I consider that the impact of this proposal is, unfortunately, quite low, and could be improved with the following corrections. 1) The proponent should explain more about the activities carried out in that place, we know what their opening hours and target audience would be (although we know very superficially, as it is not given an exact age group that they would have or how many they would be). However, it is not clear how this would be a space for popularizing the Cardano ecosystem. 2) The proponent also needs to explain more about the local community so that we can understand how the proposal aligns with the specific challenge objectives. \n", "q0r": 1, "q1": "The feasibility of the proposal is quite average, as all the information we need to know is passed on in a superficial way. Starting with the roadmap, we know which activities would be necessary for the development of the project, but these activities are not explained in detail. Let's cite as an example the first thing that would need to be done: “raising awareness of the existence of libraries in the community”. How would this awareness be promoted? We are told that schools would be visited in person, but once the team was there, how would they explain to students, parents and teachers what space is and what are its objectives? Let's cite another example. “Registration of people to use the library” - how would this registration be done? Could it be that decentralized identities from the Atala Prism project would be used? Or would it be a manual registration, which would be registered in some team file? Would only students be registered, or would teachers and parents also be registered? All activities, in my view, should have been better explained. I also notice that the proponent does not associate the activities with any notion of time, that is, we do not know how long each of them would last, in which months of the year 2022 such things are expected to be completed, etc. As a result, I cannot clearly visualize the process. Now talking about the budget, I believe that this part is better than the script, because it is explained in which small parts the total asking amount would be used. Some of them would require more detail as well, such as the “professional fees for inviting personalities to a one-week program for each quarter within a 12-month period”. It is not said how many personalities would be hired, so we were not able to clearly visualize the individual hiring value to determine whether the value is fair or not. Finally, speaking of the team, unfortunately this part is quite incomplete. They are actually a duo, but little is known about them. We only know their names and what their professional functions are, but it would be necessary for us to know a series of details such as: resumes that exemplify some of their previous work, in order to understand in what exact fields they have experience; their linkedin profiles or even other platforms that could prove the information that was said; it would also be necessary for them to explain how they are involved with our ecosystem. How did you meet Cardano? Do you have any experience with our blockchain, and if so, what? For these reasons, I believe the feasibility isn't all bad, but it has a lot to improve. \n", "q1r": 3, "q2": "The indicators cited by the proponent are good ways to understand if the progress of the proposal is in fact satisfactory: monthly reports that explain how the activities and movement of the library are going, direct feedback from users through suggestion boxes and the maintenance of the daily attendance records of users. I agree that through these factors we can understand the partial success of the project, but it is not clear how all this information will reach the members of the Cardano community. Ideally, all this would be forwarded in a summarized and very practical way to us, and there are several ways to submit such indications, such as: online files through google docs, for example; tools like Miro and Notion; or through the telegram and discord channels of the community. I would also like to see a follow-up of the work routine of the professionals involved, but for that it would be necessary for them to specify precisely what the role of each of the pair would be. Now, talking about the final scenario, the auditability of this part is worse, as the expected results are very abstract: it is about students visiting the library frequently and also improving their school performance. But what about the Cardano ecosystem? How could we measure the ultimate impact of this project on our blockchain? After all, if the project is to be financed, it must bring some kind of advantage to Cardano. Therefore, it is essential that the proponent clarify how this relationship can be measured, perceived and informed. It should set goals related to this, such as how the library's activities specifically benefited our blockchain; for that, it would be necessary for us to know which themes were addressed in the speeches of the personalities. Also if the students who attend the library learned the basics about the cryptographic world, if this information was passed on to their families and if with that there was the popularization of Cardano. This popularization could be measured according to the increase in investment in Ada, creation of digital wallets, purchase of CNFT and much more. Once the proponent gathers these indicatives, they must be taken to the community through one of the platforms I mentioned earlier, in the partial results part. Finally, my opinion is that he was doing well with the auditing part of the process, but the level dropped a lot with the final results as nothing is mentioned regarding our blockchain, so the auditability needs to be reviewed. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2621, "q0": "I checked the geolocation of Medie, Ghana. This is an undeveloped, moderately densely populated place, I'm not sure if everyone here has a phone, however, it's very difficult to go door-to-door and announce that there is a library. You can do it with school. At the same time, I have a suggestion, set up a loudspeaker to broadcast the news, broadcast news according to a specific time frame, both creating curiosity for people and updating people's news every day, which can attract attention. everyone. Contrary to your concern in the challenge section, I am afraid it will not attract users to the library, because they are inherently not in that good habit. We will solve this together in the “capacity” section of the project", "q0r": 3, "q1": "As mentioned above, I would like to suggest some practical solutions to attract and create new habits for users. Since our target audience is school-age students and adults who love to read, we offer small gifts when you come to read and exchange what you've read with the librarian. At the end of the week, it is possible to organize collective activities, exercise health, build solidarity, and make a good impression on students' parents. Regarding the cost of renting space, you can ask the local government to support a room in the community education center, which will spend that part of the money to give gifts, develop books ...", "q1r": 3, "q2": "The options you mentioned are quite reasonable, I would like to contribute two more ways, you should update new titles, keep clips and images of readers' activities, this is very intuitive and helps the community to easily identify quantity. Let's create a communication channel to connect with users, with parents and students, this is really helpful", "q2r": 4, "assessor": "z_assessor_1544", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8979, "q0": "This proposal is very interesting and perfectly dialogues with the main objective of the challenge. The authors intend to build a library facility to educate people on the Cardano blockchain. This will help create awareness of the Cardano ecosystem to the new members that will be onboarded.", "q0r": 5, "q1": "The proposal outlines a detailed budget with realistic and identifiable items that will help the proposal achieve its aim. The team has proof of experience and skills needed to implement this project. There is also a very detailed plan where we know t4he t4imeline of t4he proect4. The author of the project has a budget broken down and is detailed to execute the proposal. In all, the idea is great and given the details provided by the team, the proposal can be implemented successfully when funded.", "q1r": 5, "q2": "The team outlines a roadmap with clear achievable goals in each phase. In each phase, the team has provided the community with a detailed explanation of action plans to be executed and this will make auditing the proposal easier. The KPIs and milestones are also clear and measurable.", "q2r": 5, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9066, "q0": "The proposal has identified the problem but failed to link how the cardano ecosystem will benefit from solutions provided. \n\nThe solution is not explaining how the library could be a learning hub to grow the catalyst community. ", "q0r": 3, "q1": "The information on the team are not detailed enough and shows the team may not have the capacity delivery on task of the proposal. \nThe budget is also not well detailed and structured to justify cost to each component. \nA sustainability plan is missing. for example, after renting the space for the library in 12 months, what happens after the rent expires? Activities to arrived at KPIs are scanty to ensure success of the project ", "q1r": 2, "q2": "There are KPIs to measure activities of the library but no metric indicators to help audit the success of the project. The number of reach and projection of those to be onboard to add value to the cardano ecosystem has not been provided.\n\nThe proposal also need to consider a progress report quarterly to help auditing \n", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10095, "q0": "The Proposer wants to provide a space (Library) where students and community members can come and sit and study in general and also learn more about the Cardano Blockchain. He does not mention the total reach, but mentions a purchase of 20 sets of tables and chairs. A laptop and two computers will be available, which with the right guidance from the library staff can help community members get access to information around latest technologies like Cardano and the Blockchain. I believe it probably will have an impact, but would have liked to see a bit more on who the speakers would be, their experience, and the other ways the proposer plans to teach community members about Cardano.\nMaybe provide a framework like:\nStep 1. Basics of Blockchain Technology (video presentation)  \nStep 2. Basics of Crypto currencies...etc. \nPossibly get someone in the Cardano community to help set out a basic framework for learning.", "q0r": 3, "q1": "The proposer does not provide any links to profiles of the team and their experience. It is uncertain what their experience around Blockchain technologies are, but I believe they have a vision, and with the right materials could provide the community with a space to get information and learn more about Cardano. The Budget is clearly laid out and is 3.8% of the challenge's total budget, so it falls within the preferred bracket of not exceeding 5%. The budget covers basic running costs for 12 months and startup resources, like computers rent ect. This hub will be a CTH (brick and mortar hub) and the challenge requires that a CTH may only apply for 1/5th of their cost to launch. I believe this budget is requesting that the requested catalyst funding covers all of the costs to launch. This is not favorable due to the high demand pressures of acquiring catalyst funding.", "q1r": 2, "q2": "The supervisor of the library will be keeping records of operational activities of the library. No means of how this will be communicated to the Cardano community is given. Also no roadmap with a timeline and goals are set out, where by to measure success. Therefore it is unsure how we will know if this project is successful. In your next proposal, lay out a road map with what you would like to achieve and in what time line. Look at other challenges that have been funded and see how they were successful. There is a lot to learn form them and it can help as a guide line. Make contact with them and ask for help. The Cardano community is mostly very helpful.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "The  community needs a  well-resourced library .\nNeed for education on cardano blockchain.\ncardano blockchain learning materials needed.", "experience": "I'm an Internal Auditor with 10years experience and also an agent of fan milk Ghana ltd ."}