{"id": 400521, "author": "ldjatsa", "title": "French West Africa Outreach", "url": "https://cardano.ideascale.com/a/dtd/400521-48088", "category": 26439, "amount": 16000, "description": "There is no Cardano community in the French West Africa. People lack awareness of the blockchain solutions. Cardano could gain more grounds.", "f6_no_assessments": 2, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 6610, "q0": "This proposal is great and the proposers have successfully identified a problem within the challenge that needs to be solved. It’s about filling the gap of the lack of awareness of cardano  in the french speaking west african community. The proposer has made it its mission to educate this community by eliminating the language barrier as well as communicating through different channels. This will certainly add value to the cardano ecosystem by onboarding new members to the community. Furthermore, the goal of this proposal is in line with the challenge settings. In addition to that, this proposal should be able to scale in future challenges. They have also detailed all the steps necessary to successfully achieve their goal. Altogether, I believe in the successful implementation of this proposal.\n", "q0r": 5, "q1": "I have high confidence in the feasibility of this proposal. The principal reason why I think that this proposal can be successfully implemented is that the proposer has already built a youtube channel that provides great educational information on the cardano ecosystem. With a right boost, I think that they can do more, eventually with online and offline meetups. However, I suggest to proposers to make improvements on the redaction of the proposal. The first thing to do is to add linkedin profiles of the team members. Moreover, I suggest breaking down the budget a little more. Other than that, they have provided a timetable of 6 months to complete the work, which is good.", "q1r": 5, "q2": "This proposal is auditable because it includes the information necessary to track its progress. They have included a roadmap with milestones and a time horizon for achievement. They have a window of 6 month to achieve their goal. I advocate for a period of 12 month which to me is a good timeframe to measure progress. Besides that, they have provided some KPIs that, I think, can be also improved. Altogether, I think that this is a good proposal. ", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9090, "q0": "The solution of the proposal is important to the cardano particularities especially ensuring information reaches as many regions, people and places irrespective of the language barriers. This proposal is key to reaching French speaking audience of the Western part of Africa which also has about 8 Francophone countries. This will help expand the cardano ecosystem and value to growth catalyst school", "q0r": 5, "q1": "The team has experience in the WADA community and highly matured in the Cardano ecosystem to grow the the Francophone region. It also seems the team has already started hosting education events on cardano blockchain and an expansion is a great deal to expand the growth and rope in more and new members to join the ADA community.\n\nLooking at achievable detailed activities with a reasonable timeframe, the budget is equally reasonable for the proposal", "q1r": 5, "q2": "The KPIs are clear and the metric to measure success are clearly stated. The information is making good projections of onboarding new members and ensuring accuracy in projecting the reach within time. This makes the evaluation easier. \n\nShould the proposal win funding, a sustainability framework should be put in place to keep the initiative running the live of the project funding ", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Host French language events and provide educational workshops to inform the communities about the Cardano blockchain solutions.", "experience": "hosting multiple in-person and online Cardano Project Catalyst workshops with French audiences\nAssisting new members in joining the catalyst community\nTranslating documents for Catalyst School\nAssisting WADA with simultaneous interpretation during Cardano online workshops"}