{"id": 402601, "author": "callyfromauron", "title": "Liverpool Cardano Philosophy Hub", "url": "https://cardano.ideascale.com/a/dtd/402601-48088", "category": 26439, "amount": 18600, "description": "There is a lack of philosophical discussion at community level about Cardano, so an opportunity to engage people is being missed.", "funded": 2, "upvotes": 53246081, "downvotes": 6327460, "votes_result": 46918621, "votes_cast": 162, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 3530, "q0": "This idea is very original and has the potential of making a big impact in the Cardano community. I believe there is a gap when it comes to philosophical discussions in the Cardano community, so bringing people who are comfortable leading this kind of discussion could bring many insights into the future of Cardano. It would be a rich exchange between people who understand about philosophy, and people who understand about blockchain. Moreover, the proposal fits well with the campaign and it seems to have learned and evolved from a past proposal. The risks presented seem well-thought and the actions to mitigate them are very relevant", "q0r": 5, "q1": "The budget seems reasonable and is a good amount in proportion to the campaign's total. The members seem to have grasped the idea of the MVH, and this reflects in the budget: there could be some impact for both Cardano and the community in Liverpool, with the possibility of expanding with additional funding in the future. I do wonder if it is sustainable if it doesn't receive additional funding, since it mentions the need for someone to manage the Gitbook and moderate the discussions, but that doesn't seem like a bit issue. I believe if both the Catalyst and the PiP community are engaged, that is easily solved.\nThe roadmap seems realistic and the team members have very relevant experience that would help them implement this project.", "q1r": 5, "q2": "The KPIs chosen are aligned with the proposal and are easily measurable. It considerss not only the deliverables of the project itself but also the capacity of impact, by expecting continuous engagement in the community. I do believe that with the metrics chosen, it would be possible to measure the project's success.", "q2r": 5, "assessor": "z_assessor_1659", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10757, "q0": "This ingenious idea will surely have a lot of positive impact towards the cardano ecosystem and the catalyst community. Philosophy and academia have always been a driving factor of development and are indeed very important as a source of positive impact, especially regarding the further development of governance and bringing more agents of change into the Cardano ecosystem. By bringing on people with reflected, ohilosophical thinking, this challenge will be impacted very positively. Also, since the background of Cardano is very academic in nature, bringing on people from academia also has the potential to support scalability by novel solutions", "q0r": 5, "q1": "Stephen and Vanessa are two very engaged, competent members of the community that have already left their mark and will without a doubt also continue doing that by this proposal. I am convinced they are able to successfully enact this proposal, an assessment that is also supported by their very feasible plan: A detailed, discretized budget that seems very reasonable, a comprehensive, detailed implementation plan/roadmap and the credible background that shous in their sophisticated detailing of the proposal. In addition to that, they have a detailed contingency plan and in general adress every detail needed to evaluate the proposal for feasibility.", "q1r": 5, "q2": "The problem and solution statement are very clear and comprehensible. Both the solution description and the metrics are sufficiently detailed to give a good outline of the deliverables to audit them satisfactory. In addition to that, the timeed roadmap and the deliverables provide this proposal with a step by step auditability. Good job :-)", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10852, "q0": "The challenge question is “How do we encourage Local Community Hubs to drive adoption and awareness of Cardano in 2022?” While this proposal might contribute something on the awareness aspect, I can’t help but feel it’s not as much as needed as many other hub ideas posted in this challenge. We already have deep conversations on a weekly basis and we discuss philosophical questions with the Catalyst members. Those who discuss philosophy in Liverpool Pubs are more than welcome to come and join the action (and to continue their philosophical conversations with us). But I don’t understand why we should specifically fund their philosophical discussions in the Pubs of Liverpool.", "q0r": 2, "q1": "Perhaps it’s a cultural thing that I don’t understand but no matter how “working class” this is, it sounds a bit elitist to use $18,600 to onboard 15 people to have philosophical conversations when in many parts of the world there are real issues to be solved. The proposers have already been funded for one hub in Liverpool (https://cardano.ideascale.com/c/idea/367891). One Cardano hub per city should be enough.", "q1r": 3, "q2": "As always with these masters of documentation, Vanessa and Stephen have managed to create a solid plan with measures and a budget that makes sense in the scope that they have defined. I just don’t think we should be using treasury money for these kinds of initiatives.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10968, "q0": "The proposal aligns very well with the objectives of the challenge, because it seeks to bring the public together in favor of a specific subject - to discuss Cardano and Catalyst in a more philosophical bias. The duo of authors explain well how the initiative would be, which part would compose it. Philosophy classes would be given to 15 people; made PIPs engaged with Catalyst; collaborations with the community were promoted (post townhalls moments); and so on. We know how often the events would happen and also that they would be recorded in nature, all would be documented. The proponents also define very well what would be the expected results for the project. In other words, everything is perfect. We know what would happen; who is the target audience; how the meetings would be made, which would be recorded and the small fruits that are expected from them. In general, the proposal is highly specific and detailed, thus providing complete certainty about the impact and about whether the specific objectives of the challenge would be met - most likely yes, because a hub is essential a group focused on a more specific subject and in this case we have philosophy as the center of debates.", "q0r": 5, "q1": "This topic is excellent. we know in great detail all the information we would need to know to understand if the proposal is in good hands, how the development process would be done and how the requested money would be used. Speaking of the script, the activities are divided by months, and in these time intervals we have a very specific notion of what would happen and how. That is, the level of detail is fully satisfactory. The same goes for financial division. It is possible to fully understand how the requested money would be used, as the bidders divide the total amount into parts and each of these parts is individually broken down. Finally speaking of them, the proponents, we know that they are people well involved in Cardano, they already participate in groups, DAOs and have a good history of activities on our blockchain. A small curriculum vitae of each is attached and it is also explained in which professional areas they work. This conveys complete confidence in their ability to successfully execute the project. So there is nothing to be criticized here. Everything is ideal.", "q1r": 5, "q2": "Like the two previous topics, this one is very good. Proponents point to many KPIs that can serve as ways to measure progress, small advances, partial results. About success, the degree of detail is as rich as the previous part. I think everything is in order, we have enough material to audit the project; my only suggestion would be that the proponents make it clearer how all this information would come to the knowledge of the Cardano community. Perhaps the results of the meetings with the IOG coordinators will be made public? What will be the communication channel? Other than that, everything is ideal, the proposal is excellent, all the topics are very good works and in my opinion it certainly deserves funding.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Work with an established UK community philosophy network, to build a philosophy-based Hub and develop philosophy discussion within Catalyst.", "experience": "Vanessa Cardui and Stephen Whitenstall of QA-DAO are skilled community facilitators; ex-members of Liverpool PIPs; and active within Catalyst.\nLiverpool PIPs has been catalysing working-class engagement with philosophy for over 20 years."}