{"id": 403802, "author": "easterntownhall", "title": "Eastern Town Hall Team Operation", "url": "https://cardano.ideascale.com/a/dtd/403802-48088", "category": 26439, "amount": 22500, "description": "Participating in Catalyst is difficult when you live in the Eastern Hemisphere Time zones where English is not the main language.", "funded": 2, "upvotes": 124095533, "downvotes": 4462834, "votes_result": 119632699, "votes_cast": 370, "f6_no_assessments": 12, "f6_rating": 4.805555555555555, "videos": ["https://youtu.be/PR-9etwaQ0k"], "media": [], "f6_assessments": [{"id": 1773, "q0": "The proposal identified many issues in the challenge at once, and those issues had wide-ranging impacts. It clearly understands the central issues and aligns with the challenge to grow the growing Cardano community in a broad, Eastern Hemisphere. It solves many problems of the challenge at the same time. Because the problem raised is universal such as building, sharing knowledge and information about the Cardano platform; connecting and supporting to develop the Eastern Hemisphere community; breaking down cultural barriers between countries. so this proposal is very feasible to scale to the whole world. It doesn't just help grow the Cardano community and make it better. \nThe proposal correctly identified a few issues in the challenge. Present the problem clearly and convincingly. It has identified many core issues in the development of the Cardano community, which not only helps the individuals involved with the knowledge of the Cardano platform but also facilitates the operation and development of organizations. development, which contributes to the development of a rich and diverse Cardano community in the Eastern Hemisphere. With the active operation of the Eastern Hemisphere City Hall, members and organizations have the opportunity to meet, share and develop together, which is a great thing that any community wants to aim for. To do that well, you have come up with impressive and highly feasible solutions: building knowledge, sharing information, connecting people; and I'm impressed by the solution of breaking down cultural and language barriers - this is a dilemma for community development in any field. Especially when you come up with a solution, you have studied very carefully the problems related to countries in the Eastern Hemisphere such as population (1.6 billion people, accounting for 60% of the global population), energy English language force in the region. . provides a very reliable basis for the presentation. Moreover, to achieve the goal, you have had coordination and collaboration with Catalyst Swarm, The Catalyst School, Association of Ambassadors. have shown the long-term vision and strategy of the proposal. The goals and results of the solutions are very specific to the Eastern Town Hall of each country (Indonesia, Vietnam), and you also give specific evidence by the statistics of popular social networks. like: Telegram, Youtube, Twitter, Instagram, Github. \nThe proposal has identified several risks during the implementation process and proposed solutions to overcome all of those risks. The team's proposal identified two very real risks in the course of its work. The first risk you identify is that the harmony between different cultures, time zones, and languages of different countries is difficult in the cooperation and common development of the community which is completely grounded and you give workarounds using tools like GitHub, GitLocalize, Orbit, etc... is completely reasonable and workable. But it's great if you have a specific time frame to organize activities so that the community can meet, exchange, and share at the same time, it will be more attractive; there is a section introducing the cultures of countries in the region. With that, I'm sure the community will be better. The second risk you identify as the biggest obstacle is using English as Cardano's primary protocol and providing a solution for Cardano education and development through Project Catalyst and community-proposed initiatives as well. possible solutions. However, for the solution to work, I would like to see a specific educational program, I hope you consider it. I rate 4 points.\n", "q0r": 4, "q1": "The proposal has given clear, detailed, and reasonable work implementation timelines with specific goals. It has been invested by you to provide a very detailed and specific work process. It has determined each time for each clear work goal and ensures the reasonableness and feasibility in performing the work with high efficiency. specifically, the proposal has allocated the time to perform the work is three months, each month has 5 goals to complete. All the work of the group is easy to check and follow the community through popular social networking platforms such as Telegram, Youtube, Twitter, GitHub. However, to help people vote quickly Approaching this solution, I would like you to briefly cover the \"timeline actions\" section. Since the first 4 goals of all 3 months are the same (only the goal is different in point e), they should be presented together. \nThe proposal has been disbursed by the pre-fund of less than 20% and has a reasonable and clearly explained plan to allocate funds for each specific activity. Your proposal already has a budget allocation plan for each department, but to ensure clarity on the level of allocation for each task, I would like you to be more specific, for example: in task number 4 - marketing and communication: $1,725 of which 5 sub-tasks need to be budgeted for each section. In addition, you have also been interested in the contingency budget ($1,000) but have not specified what the reserve budget is for. In this section, you can propose ADA price fluctuations or pay for unplanned events. \nThe proposal has assigned specific tasks to each member; Experience relevant to assigned tasks; The identity of group members is easy to verify. I am impressed with the members of the proposed team, who come from many different countries but collaborate very successfully to have this wonderful proposal. In the Proposal, you have assigned tasks to each specific group of members (you have the main group and a consulting group), suitable and have high professional capabilities, each member will be in charge of a part. work commensurate with ability. The identity of the members in the proposal is easy to verify, there are attached documents for reference, there are links to each page such as GitHub, Telegram. Especially, it is recommended that intellectual property creates reliability. high for proposals like Contributor License, Apache License 2.0, Creative Attribution-Non-Commercial-ShareAlike License (CC BY-NC-SA) v4.0. I rate 5 points.\n", "q1r": 5, "q2": "The proposal provides KPIs, making it easy to accurately quantify the effectiveness of the proposal and easy to check. The proposal has many indicators / KPIs to measure the performance and progress of the project (Telegram, Youtube, Web, especially GitHub). I've linked to your attached link, it's super easy and details the progress and results of the tasks in your plan. The proposal has clearly defined success and has been successfully tested in practice. The export has a feature and high to public. Results of re-recommendation on social networking platforms (Telegram, Web, Twitter) in terms of the number of people interacting and registering new members. The success of the proposal has addressed many of the formula's problems in a successful test campaign in execution and is consistent with quality Cardano coin development work. The proposal has received funds in the previous rounds with the top 50% ranking of the whole fund voting results. The proposal to the East town hall is supported continuously from funds 6 and 7, the issue is raised regarding this project. This project is being used because the valid rate is in the top 50% Rating of the entire fund. I rate 5 points.", "q2r": 5, "assessor": "z_assessor_1410", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 2186, "q0": "The proposal is in line with the challenging goals of focusing on providing information to a large region - the Eastern Hemisphere, which accounts for 60% of the total global population with many countries with unique cultures and their own language. Proposing to provide a safe place for Eastern Hemisphere communities to connect and support each other; where the average person can join with their own language and their own cultural understanding to learn how to apply technology to address local needs and nurture community-based initiatives Cardano. ", "q0r": 5, "q1": "The proposal provides a three-month action plan with detailed descriptions of each milestone; information provided with specific statistics and clear citations; demonstrates that the team considered the risks/challenges and how they would solve them.\nThe members of the proposed team are already involved and experienced in the Cardano ecosystem, they are all very active in Catalyst, and their community groups, make the project highly likely to succeed.\nThe proposal also provided a detailed, clear budget sheet for each section that resulted in a total final budget of $22,500, a budget that was reasonable given their expertise and the amount of work to be done.\nGiven what they have shown in this proposal, I rate 5 for feasibility.", "q1r": 5, "q2": "As mentioned above, the proposal is described in a clear, detailed way with specific measurable metrics that make the audit easy and efficient. The proposal team is also oriented towards the management of the budget efficiency and sample DAO treasury management report, which further increases the transparency of the project.\nThe proposal clearly identifies the goal over the next 3 months to increase participation in East Town Halls by 25% and submit proposals for each Fund Chain; they also explain very clearly their solutions to achieve their goals, which can help anyone to evaluate their task accurately and easily.", "q2r": 5, "assessor": "z_assessor_1457", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2253, "q0": "eastern town hall is effectively gather community for people that didn't speak english. it really help sharing much information and growing the community. i have attend few of the eastern town hall meeting, and i can found new and very interesting informations. people from each country helping each other to build the community.", "q0r": 5, "q1": "eastern town hall is already running as a projecgt, and i see a very good feedback from them. i saw many people are actively helping their own community. they have the experience and the budget is also reasonable for the project to keep functional. the project involve a lot of people, analyst and experts to speak and help the community, sharing informations in much different languages.", "q1r": 5, "q2": "it have detailed explanation about their target and audibility. with actual numbers and target, i saw the community keep growing, and their share very much informations to as much languages they could provide.", "q2r": 4, "assessor": "z_assessor_1469", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2633, "q0": "The Asian community is very large and strongly supports the Cardano ecosystem. Eastern Town Hall Team really succeeds when it comes to connecting the community together. Regarding this project, the growth figures show that the project has made strong strides, the community is increasingly strong and equipped with a lot of knowledge. Your proposal will address a very central challenge. As for the difficulty, I have the following suggestion, the community and team of the team are highly specialized people, gathered from many countries, so there will be members who know bilingual, let them be the representative translates the videos from English into the local language. Of course, please propose the Catalyst Fund to support the worthy funding.", "q0r": 4, "q1": "Your plan and budget are perfectly matched. I am very impressed that you have started and maintained 13 events regularly, the knowledge support videos on youtube are also very helpful. Your team is diverse in the industry, each with its own strengths, I am completely convinced. Please provide more members' social channels for the community to learn and exchange", "q1r": 5, "q2": "I know that you use many methods to let the community see transparency when developing projects. However, the vast majority of people are not good at the internet, so please provide specific indicators that are easy to quantify, which will help the community enjoy and participate more. The project you proposed has a professional roadmap, developed methodically, and is funded from F6, F7, the plans are carried out regularly and timely.", "q2r": 5, "assessor": "z_assessor_1544", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2684, "q0": "The Eastern Hemisphere Cardano community is one of the most active, consistent, and productive communities I've ever seen. Data from the Indonesian and Vietnamese communities confirm it: this is an increase in the number of attendees, the number of proposals submitted.\n\nAlthough the proposal does not mention the data of other countries such as Japan and New Zealand in fund7, I fully believe that the proposal has a great impact on the development of the Cardano ecosystem. There is one point that I believe the proposal can do better to strengthen the connection between voters and proposers among countries, thereby increasing the percentage of votes for projects in funding rounds.\n\nI completely agree with the impact of this proposal", "q0r": 5, "q1": "Members of the Core Team and the Consultant Team are familiar faces to those who attend the Eastern Town Hall periodically.\nAction plans are covered in detail. I see the content of the Eastern Town Hall meetings will be influenced by the main Town Hall meetings, however, I have not seen clearly who will attend the main Town Hall and update it in the Eastern Town Hall in the action plan. I believe this will be covered in the next funding round.\n\nProposal hosts bi-weekly Town Hall Events, it has 06 in totals. If Proposers can outline the content of these 06 sessions, or announce the content of the next meeting to the community, everyone will know if the content is suitable for them and actively participate.\nThe $1,000 provision does not specify how it is calculated, based on which risk factors. I hope this will be made more clear at the next funding round.\n\nI rate 4 stars for feasibility of the proposal\n", "q1r": 4, "q2": "The proposal mentioned that they will report back financial statements on their activities and expenses, monthly spending will be reported. They will manage finances in a decentralized manner using a multi-sig wallet > this is the point that makes me excited and want to know which wallet they will use so that I can apply for similar models.\nThe proposal only says to grow participation by 25% in Eastern Town Halls and proposal submissions for each Fund Series in the next 3 months. For more clarity, I suggest adding monthly growth KPIs such as: the number of people participating in social networking channels, the number of people attending Bi-weekly sessions.\nI rate Auditability at 4 stars", "q2r": 4, "assessor": "z_assessor_1549", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2909, "q0": "This proposal aims to attract more people in the Eastern Hemisphere to join the Catalyst & Cardano ecosystem. The goals clearly align with the purpose of scaling-up the community of the Challenge. The proposal addresses the issues of language and culture barriers by building up localized communities, sharing the knowledge & experiences by utilizing the advantages of local language and culture. The way the proposal addresses the challenges is clearly presented with 5 solutions. It has some remarkable achievements through 2 of the most populous countries in South East Asia: Indonesia & Vietnam. It also shows a great support spirit from the Cardano ecosystem to smaller groups, especially those with disadvantages of geography and wealth. This idea has the potential to scale up, not only within each local community but also in the number of communities. It will be great to see other local communities in the future such as Filipino or Korean.", "q0r": 5, "q1": "With a wealth of knowledge and experiences in various roles of the Cardano ecosystem of the team, they have provided a very detailed plan in the proposal. Therefore, the project has a good chance of being implemented effectively. The action plans for each community are very specific and clear. The objectives for the 3-month plan are also presented in a reasonable and detailed manner. The expenses account for 5% of total challenge budget are described clearly and broken down in a straightforward manner, ensuring that there is no confusion or misinformation. The abilities of the persons named in the proposal are backed up by relevant references links. Their entire identities and biographies were made public, which brings credibility to this proposal. The proposer has also stated some challenges they are going to face while implementing the idea such as collaboration across cultures, time zones, and languages. But based on their experience and active preparation, they will manage these challenges well.", "q1r": 5, "q2": "The proposal has defined very clearly what are the success metrics and KPIs for tracking the progress. That information is supplied with a high degree of detail, allowing the community to comprehend the intended outcomes. I highly appreciate the way they are using prototype DAO treasury management for reporting the project's activities and expenses. It shows the great spirit of auditability, transparency, and innovation. All the interested community members could easily follow the progress of the project. As there will be periodic meetings between the teams, there will be more chance for them to adjust their actions in every community. So they could make minor adjustments to keep the progress on track.", "q2r": 5, "assessor": "z_assessor_1588", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6619, "q0": "This proposal aims to build an Eastern Town Hall similar to the western town hall where people discuss cardano subjects, collaborate etc. The ETH will target people from the eastern hemisphere who, due to the different timezone and the language barrier, may have a hard time following the western time hall content. This problem is in the scope of the challenge and needs to be solved. The proposer has provided a great solution which will add value to the cardano ecosystem by permitting local communities to be exposed to cardano contents. So I think that the goal of this proposal aligns with outlined challenge settings. The proposal should also be able to scale to address future challenges.", "q0r": 5, "q1": "The proposal includes information that gives me confidence in its successful implementation. The proposers have included a detailed roadmap and a timetable of 3 months worth of future achievements.They also have broken down the budget which I consider reasonable based on my digital marketing knowledge. However I did not see a plan in case future funds are needed. I think that the proposal can be improved here. The proposer could also improve this proposal by adding links to the linkedin profile of the team members. The good thing is that the proposal includes all the names of the team members participating in this project. Altogether, the proposal is really well written with a lot of information included. However, the proposal can be improved by adding links or resources backing the team members skills and experience. Other than that, I have a good amount of confidence in the feasibility of this project.", "q1r": 4, "q2": "This proposal can be audited based on the amount of information given by the proposers. They have provided a detailed roadmap with achievable milestones. The key metrics to measure success are also clearly defined and strong. This proposal has identified a problem that needed to be solved, and this project can be a perfect solution.\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7764, "q0": "Eastern Town Hall have onboarded a lot of new people from eastern hemisphere into the Cardano ecosystem. The goal of this proposal is aligned with the challenge settings, which is to create a community hubs and create a place for people to learn more about Cardano ecosystem, and for this Eastern Town Hall, focuses on non-english speaking country to further include variety of people. The proposal also explained that a lot of global population came from Asia, and their goal is to bring these people into Cardano ecosystem with education, guidance, and support with their languages. Because the proposal is about creating a community hubs, this proposal will able to scale to address future challenges as new people with new ideas will onboard.", "q0r": 5, "q1": "The teams are diverse and tailored to their respective country. They also have a relevant and sufficient experience. Since this Eastern Town Hall have been running before this proposal, it’s undeniably able to deliver and will continue to realize this proposal. Proven by their track record of the number of people (that have joined their Telegram group) and their number events held, they’ve also managed to laid out their future milestones and plans in detail regarding their operation, such as biweekly Town Hall events, hosting workshops and breakout room events, marketing, website, etc. The budget information is also clearly explained in details, from work hours to budget allocation for different events and resources. Overall, I will give this proposal a 5 star review because it’s comprehensive, and already a proven track record by their previous work which you can check on their Github repo.", "q1r": 5, "q2": "The proposal able to provide milestones and Metrics/KPIs, also a clear goal that is to grow participants by 25% in their Eastern Town Hall, and proposal submissions for each Fund Series in the next 3 months. Since this is a public event, with their operation documentations and log already updated through their Github, the community will have no problem checking this project progress.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8185, "q0": "The problem is that English is not the primary language of the Eastern Hemisphere regions so joining the Catalyst is a barrier for them. A proponent of the solution is East City Hall, which provides a safe place for Eastern Hemisphere communities to learn, collaborate, and build on Cardano. Since the primary goal of this challenge is to encourage local Community Hubs to drive Cardano adoption and awareness, it certainly fits the challenge. A clear and understandable solution was provided as per the proposal to clearly describe a targeted problem, so I agree it addresses the requirements of the challenge.\nThe proposed team also considers the risks and challenges involved in successful implementation and recommends a number of measures to overcome those obstacles.", "q0r": 5, "q1": "The proponent provides a very detailed plan for implementing the defined milestones and timelines. The proposal has a clear roadmap and timeline, provides transparent goals for the project to achieve, and provides a sufficient means to measure project success. References, related organizations, team members, and knowledge of Cardano all have a high probability of a successful proposal. While the proposal does not provide a link so that the community can better understand the experience and knowledge of each team member, to my knowledge these members are all members of the community. I'm a veteran in the Catalyst community so I'm very confident in the possibilities in this project. The budget was clearly and succinctly defined, with a reasonable amount required ($22,500). The budget is very detailed, it also tells how the financial amount will be used, in a very specific way.\nConsidering the foregoing, I agree that the experience and plans presented are most likely to succeed in this proposal.", "q1r": 5, "q2": "It will be easy for the community to track the progress of this proposal through the information the team has provided. An entire section with easy-to-follow KPIs along with a shortlist of plans after the initial 3-month period increases the transparency of this project and proposal. In addition, this is a follow-up activity proposed by the East City Hall, which will continue to be funded by Funds 6, 7, 8. Therefore, there is more ground for me to believe that this proposal has the potential to achieve success.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8960, "q0": "This is the recuring proposal, it is about to continue the growth of Eastern Town Hall. Through the metrics of the project which are given for ETH Indnesia’s growth, Cardano Indonesia group and ETH Vietnam’s growth, we can see this time, the ETH team focuses on increasing: number of members on-boarding, number of participants, numbers of Channel followers, numbers of proposals from Indonesia and Vietnam, number of pre-DAO programs and number of pre-DAO program participants. It is absolutely impactful because it fits very well with the challenge, to continue “encourage Local Community Hubs to drive adoption and awareness of Cardano in 2022” and will also add a lot of value to Cardano system by creating a safe place for the community, they: increasing meaningful participation in Project Catalyst among all stakeholders from Eastern Hemisphere, increasing voter-proposer interaction, onboarding and integrating new Asian people into Project Catalyst, and helping keeping the Eastern Hemisphere community together. \nMoreover, the proposal is well written, in details, clear and understandable way with information fulfilling, also challenges which are related to the proposal’s successful implementation, are considered as well as the solutions, it helps readers see better about the enthusiasm, devotion and wonderful effort of the team toward Catalyst project and Cardano ecosystem. ", "q0r": 5, "q1": "The proposal gives information in details consist of metrics, action plans roadmap, milestone, budget and team members. The metrics are listed for specific groups. The action plans and roadmap are very clear, allows readers see what will be executed in 3 months. About the team that build up the project, they are committed to Cardano system and Catalyst project with full experience and skills relevant to the successful conducting of the proposal, as they are ETH co-hosts, Cardano Ambassador Indonesia, Challenge Team Members, developer, funded proposers,  Blockchain/Crypto educator, CAs, vCAs, and more.  \nAbout the budget, I think it is fair and reasonable, broken down very clear into identifiable items, we can see clearly what needs to pay for, how much cost for that, that helps us to understand the work that the team needs to do. Moreover, budget $22500 is 4.5% of total Challenge budget, therefore it aligns the condition “does not exceed 5% of the total Challenge budget”.\nAdditionally, the proposal is in the collaboration as well as have a direct support of a committed team and partnership (Catalyst Swarm and Catalyst School). All of them make the proposal is fully feasible.", "q1r": 5, "q2": "The information which is given for auditting is more than enough, consist of action plans, roadmap and milestones, or we can monitor the steps of project based on the section “What does success for this project look like?”. Regarding to the authors’ statement about reporting finance and the work that being done by FWB and index.coop (the files included allow us to underrstand what the reports look like) and measuring the number of proposers/voters/Cas/vCAs will be reported similar to Catalyst Fund6 submission phase analysis which is provided as an example, the proposal is definitely auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8993, "q0": "This proposal addresses the issue of language barriers in the catalyst community, which is one of the main objectives of this challenge setting. The proposal intends to share news from the Cardano ecosystem to the people of the Eastern Hemisphere in their language because English is not the main language in that time zone. In my view, this is a brilliant idea because aside onboarding new members, people from the Eastern Hemisphere will be able to keep up with the major updates from the Cardano ecosystem in their own languages.", "q0r": 5, "q1": "The core team has presented in detail proof of their expertise and experience needed to implement this proposal. The team outlines a roadmap with clear achievable goals in each phase. In each phase, the team has provided the community with a detailed explanation of action plans to be executed. In view of the budget, the level of detail presented is high. With a well-calculated, broken down, and explained budget, the team has helped us to understand what each part of the proposal entails and the cost involved.", "q1r": 5, "q2": "The proposal's success and key metrics are in line with that of the challenge setting which is, increasing adoption at the ground level, onboarding new members to project catalyst, and helping people to part-take in catalyst platform in their own languages and with their own cultural understanding. The team gives us information that would help the rest of the community to monitor the progress of the project through their auditability plan.", "q2r": 5, "assessor": "z_assessor_715", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9108, "q0": "The proposal addresses the challenge and shows the proposers understand the cultural diversity of the Eastern Hemisphere zone. The proposal is also showing that language barrier is undermining efforts to reach out to many people within Eastern bloc and when that is addressed, it will accelerate the rate at which people would subscribe to the cardano ecosystem ", "q0r": 5, "q1": "Outcomes of the previous activities with number of subscription on each have been measured and very realistic. The idea of deepening the localization of the hub with a detailed plan of action depict a successful  implementation of the project. The budget is reasonable looking at the activities put in place to grow the hub. \n\nThe core team is solid with much experience and detailed showing evidences of their crafts in the cardano ecosystem", "q1r": 5, "q2": "Information provided are quite enough to audit progress. However, the sustainability plan is not clear and the likelihood of seeking for more funding in fund 9 is higher. If the proposal is funded in fund 8, a sustainable roadmap should be made available keep the Eastern Hemisphere bloc running.", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "The Eastern Town Hall offers a safe place for Eastern Hemisphere communities to learn, collaborate and build on Cardano.", "experience": "Cardano Foundation Ambassadors, Catalyst School & Eastern Town Hall Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, Cardano Stake Pool Operators (SPO), IT & Software Engineering, Blockchain devs, Plutus/Atala Prism Pioneers, Educators and Accountants"}