{"id": 405150, "author": "cardanoamigos", "title": "Bilingual Web3 Tech + Arts Space", "url": "https://cardano.ideascale.com/a/dtd/405150-48088", "category": 26439, "amount": 100000, "description": "The job market is shrinking and being automated. Hispanics will account for 20% of workforce by 2030 yet currently hold 3% of tech jobs.", "funded": 1, "upvotes": 23072267, "downvotes": 14684826, "votes_result": 8387441, "votes_cast": 90, "f6_no_assessments": 6, "f6_rating": 2.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 1968, "q0": "The proposal attempts to provide a solution to the low hispanic workforce in the tech space by setting up a bilingual Web3 Tech + Arts Space is needed to train the next developers, coders, artists on the Cardano blockchain. The idea is to offer training free of charge to students in order to increase hispanic representation and ensure that diversity and inclusivity are an integral part of the tech space and the Cardano ecosystem. The connection between the proposal and its direct impact on the Cardano ecosystem is however not very strong. Indeed the end result will be a group of trained hispanic tech experts who can potentially impact the Cardano ecosystem however a stronger direct impact on Cardano would improve the chances of funding. I was expecting to see practical ways in which the trained students will be onboarded into the ecosystem and how this idea can scale for a greater impact. The proposal does not appear to adhere to the MVH principle of the challenge and does not scale down individual capital outlay which is a key element of the challenge thus the requested funds is quite high representing 20% of the budget for this challenge.", "q0r": 3, "q1": "The proposal provides a month by month breakdown of tasks to be accomplished for a 3 month period however, the budget for rental of premises (studio) is for a 12 month period. There are further inconsistencies in the budget thus the budgeted items do not add up to the $100,000 funding requested. Proposers would do well to take another look at the budget in order to rectify the inconsistencies. Proposers may also want to cut down on the number of tasks to be undertaken in month 1 of implementation because the month appears quite loaded and there is the risk that they may not achieve all they have set out to do.\n\nAlthough it is evident that a 3 member team is being proposed for this project, the proposal does not provide the names of team members, it only gives a brief professional background of the team. Additional information on the team will be required to facilitate an assessment of the feasibility of the proposal. ", "q1r": 2, "q2": "Proposers have provided a couple of KPIs including having 15-20 students and 4 to 5 instructors by month 3. This appears to be the most measurable and verifiable. To enhance the auditability of the proposal it would be necessary to revise the current KPIS to make them achievable and measurable as well as provide the Community with a way of verifying that they have been achieved.", "q2r": 3, "assessor": "z_assessor_1437", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 2537, "q0": "This proposal does address the challenge as the team aims to improve the participation of Hispanics in technology jobs. \n\nThe budget is 20% of the challenge budget instead of the expected 5%. The model is somewhat standard and it is not clear as to whether this model addresses the root causes for lack of Hispanic participation in tech aside from indicating that training will be free and that other sources of fund raising will be implemented.\n\nThe type of content delivery is not detailed so it is not easy to assess whether the training will meet the learners needs. It is also not clear whether learners will be effective enough on tablets compared to laptops.\n\nThis looks like a big bang approach and not an MVH which could first be tested and tweaked before incurring expenses annual rentals and permanent purchase of assets", "q0r": 3, "q1": "The timelines seems quite optimistic as NGO setup and recruitment of trainers are all planned for Month 1.  It is not clear as to whether Trainers will be trained in Month 2 or whether learner will be trained in Month 2 with the launch and classes starting in Month 3.  The speed at which Month 1 setup activities can be implemented depends on the efficiency of recruitment and NGO setup processes in the given region.", "q1r": 2, "q2": "The items listed in Month 1 - 3 can be assessed for auditability. These items are not all listed in the auditability information provided. The committed metrics see to be the 100K additional funding from other sources as well as the number of students and teachers in the first three months. It is not clear how long the courses / training will last so concrete impact is not very clearly stated.", "q2r": 3, "assessor": "z_assessor_1526", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2640, "q0": "This idea will help the community where the project is deployed to get closer to blockchain, practical applications. At the same time, it helps parents and students better orient their careers, avoiding choosing careers that are not suitable for the future. I read the project very carefully, but really still don't know how web3 will be applied to deploy the project. Can you be more specific? And to be honest, to the best of my knowledge, Web3 doesn't really exist and is present at the moment. Let's talk about this. A big challenge is how the project attracts participants, I don't see this issue. Deep knowledge of blockchain is the core of development", "q0r": 3, "q1": "I appreciate the group's experience in information technology, psychology... However, please provide the members' names and social channels for the community to learn and exchange, this is really necessary. in the project. Regarding the timelines, I see fit. As for the funding, you really put a lot of emphasis on the development of the center's facilities, knowledge areas such as lessons, applications, developers... I don't see any mention, this really doesn't reasonable, because blockchain knowledge is the core issue for users to come to the center", "q1r": 3, "q2": "Please list metrics that can be quantified as the project develops, for the community to track, such as: pictures of the center, bills for equipment purchases, learning materials, technical documents, quantities community members.... I really hope my suggestions will help the project", "q2r": 3, "assessor": "z_assessor_1544", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 3537, "q0": "The proposal fits both principals in the campaign. It tackles an important issue, which is the underrepresentation of Hispanic people in technology and it focuses on a particular community. If successful, this could be scaled to other communities.\nI wonder if there is any study to understand if this community has easy access to the internet and a computer. Even if the classes are in a physical space that provides the necessary equipment, in order to be sustainable the students should have their own equipment to keep practicing and studying after the course.", "q0r": 5, "q1": "The first month seems a bit risky, as there are many activities happening at the same time. It would take a very strong team to pull this off, especially when it comes to the fundraiging campaign and social media campaign. I belive it would be more realistic if there were more time for the campaigns\nWhile the budget seems realistic, I don't think it fits the idea of MVH that the campaign requires and it would require a big part of the campaign's budget.\nMaybe if there were more time to focus on fundraising and partnership with local organizations, it could require less money from Project ]catalyst funding.\nThe teams seem capable, but I would like more details on their previous experience and some link to verify their credentials.", "q1r": 2, "q2": "The KPIs mentioned are a good measurement of the project's success, but I think it could be a bit more developed. For example, how do we know if those students are actually acquiring meaningful knowledge? I think there should be some metrics to understand the actual impact of the projects.", "q2r": 3, "assessor": "z_assessor_1659", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6628, "q0": "This proposal is about building a bilingual tech and art hub that will target the hispanic community. I think that it identifies a problem within the challenge as, according to the proposer, only 3% of the hispanic community is in the tech job market. If the proposal succeeds, more hispanics can join the cardano ecosystem and add value as developers, artists or other profiles needed in the cardano community. So I can say that the proposer has clearly articulated how the project will add value to the cardano ecosystem. Its goal is to bring more people into the cardano community. So we can say that the key metrics and goals of this proposal align with the outline challenge. However, since one of the metrics of the challenge is to favor proposals with a budget lower than 25000$, I guess we will have to take that into account. I give it a 4 rating instead of 5", "q0r": 4, "q1": "Unfortunately, this proposal doesn’t include enough information to give me high confidence in its successful implementation. The proposer has stated the skills and experience but, didn’t provide references or links to back those claims. I suggest to the proposer to add a linkedin profile. That will allow them to build trust and get more chances of being funded. On the other hand, the number of staff they need is noted and included in the project.  I also noticed that the budget is well distributed and seems quite reasonable. As a digital marketer, I can't know the exact rent price, but I think it seems reasonable based on my intuition. Moreover, the proposer has provided a detailed roadmap with a timetable to complete the work.", "q1r": 3, "q2": "The proposer has provided a roadmap for 3 months whilst I would suggest extending it to 12 months. The key metrics provided are also weak. I think that the proposer can add more KPIs that define the success of this project.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10225, "q0": "This proposal plans to build an educational hub about Cardano in Hialeah, Miami-Dade county of the US, with three target participants: developers, coders, and artists. As this round focuses more on building minimum-viable hubs (MVHs), I appreciate that the proposer analysed the Hialeah demographic carefully, and gave readers logically reasons why it is potential to create a bilingual Cardano hub here (95% local people speaking Spanish while there are just 3% of them doing jobs about tech). I have checked on the reference of this statistic and it’s alright, but I still think that more reference documents about demographic should be added beneath the proposal for voters to check it if they want to, and also for more reliability.\nAlthough the intention of this proposal is very contributive and it touches the need of this challenge, I can only rate 3 for its impact because of two reasons:\n(1) As this round, we focus more on having “minimum-viable hubs” (MVHs) with the smallest but most effective unit for a hub, the proposal’s goal “to train the next developers, coders, and artists on the Cardano blockchain” seems too vast for this round. Supposed that this plan will be run effectively, I do not think it is easy to scale up this hub.\n(2) One of the updated criteria for this round is to ensure all the target audience can participate at whatever level they are starting from. That means the proposer and team have to design clearly and thoroughly a teaching & learning curriculum so it could serve the users on the ground level and upper ones. Unfortunately, I couldn’t see that plan here. “Plutus, Python, Haskell, Blender, Illustrator” have been mentioned but what to do with them has not been discussed clearly. Cardano is the centre focus of this hub, but what to educate people about Cardano and how to do it exactly, remain vague.\n", "q0r": 3, "q1": "The proposer provides a plan for the first 3 months for establishing and starting launching this hub. It’s a good point to list down quite detailed all of the small tasks in this beginning period with a broken-down budget. I want to advise the proposer of some points for this proposal could be more feasible, as well as, the voters will find it more reliable when reading. \n(1)\tProposal requests $100k, takes one-fifth of the total challenge budget, while this round we favour MVHs with the budget does not exceed 5% of the total challenge budget ($25k). I don’t say this proposal is not worth spending $100k, I want to say this amount of budget would put this proposal in fierce competition with others, while the idea of this proposal is not very innovative compared to those in the last round. \n(2)\t3-month timetable is inadequate for a proposal. The proposal should plan for the whole process (with milestones of 3/6/12- month timetable)\n(3)\tBudget has broken down clearly in the first 3 months, but it’s Fund 8 and that’s not enough. The proposer should discuss how to attract participants and its cost. After a certain time launching this hub, how can this hub run resiliently, considering self-reliance within the community?\n(4)\tSince this is very much an education hub, recruiting educators and using technology are the spine of this project. I haven’t seen a good way to attract potential educators, or any technology applied to run this project. The proposer should not only present what to do in the plan but also how to do it. \n(5)\tSupposed that the proposer has qualified experience to run this project, however, a link to the profile (like LinkedIn, CV, etc.) should be added. So does the other teammate.\n(6)\tChallenges and risks of this proposal should be discussed as well. For example, since the hub has a special community of 95% Hispanic people, the proposer should consider some strategies to help every average participant could use their best ability within the cultural understanding.", "q1r": 2, "q2": "The proposer provides me with not very sufficient information to assess the progress. \n(1) A roadmap of an ordinary proposal should be divided into 3 major milestones of 3, 6 and 12 months. Here are just 3 months. \n(2) A clear time horizon also should be estimated.\n(3) Consequently, the key metrics to success is inadequate when it mentions 15-20 participants in the first 3 months only. I don’t see the sustainability of engagement. \nI advise the team to work more on this project as the idea is a good one and I see the team is qualified to lead this project. \n", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A bilingual Web3 Tech + Arts Space is needed to train the next developers, coders, artists on the Cardano blockchain.", "experience": "#!: 20 years of experience in IT, currently IT Director and former BFA major at FIU. \n\n#2: Co-founder holds an AS in Video Production, a BA in Psychology, with 15+ years of experience in sales, media, and writing. \n\n#3: 30+ year educator advising on curriculum and budget."}