{"id": 381405, "author": "dwayne", "title": "DAO-NET: Multilingual Translation", "url": "https://cardano.ideascale.com/a/dtd/381405-48088", "category": 26252, "amount": 19000, "description": "La traduction et la création de plateformes multilingues nécessitent un financement durable, mais le financement Catalyst est destiné à des projets spécifiques.", "funded": 2, "upvotes": 68055931, "downvotes": 3385966, "votes_result": 64669965, "votes_cast": 174, "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "La proposition répond bien aux objectifs du défi, puisqu'elle vise à créer une DAO qui fournira des fonds à différents traducteurs pour travailler sur différents projets, dans le but de traduire initialement une page de vote. L'idée ici est, si je comprends bien, de faire traduire un maximum de contenus de ce type dans le plus grand nombre de langues possible. Ce qui était un peu confus à mon avis, c'est de savoir si le projet vise à traduire uniquement ce type de contenu (le vote) ou s'il a l'intention, plus tard, de commencer à produire d'autres types de projets. Il est positif que les auteurs aient déjà défini des traducteurs et des partenaires, car ce projet ne va pas se concrétiser uniquement du point de vue technique, et avoir en tête des professionnels dans ce domaine de la traduction va déjà accélérer une partie du processus de développement. Par conséquent, je crois que ce qui manquait était la compréhension de ce qui se passerait au-delà de la traduction du contenu du vote ; à part cela, je crois que la proposition est très pertinente pour le défi, car elle aborde directement la prémisse de prendre le contenu de l'écosystème Cardano à différentes personnes qui ne sont pas anglophones.", "q0r": 4, "q1": "Les auteurs de la proposition sont très impliqués dans notre blockchain, puisqu'ils sont des pionniers de Plutus, des opérateurs de SPO, des CA et autres, selon ce qui est dit. On nous fournit une brève description du duo, dans laquelle nous pouvons identifier leurs noms, leurs domaines d'expertise et leurs profils linkedin sont également joints, où nous pouvons voir plus sur leur trajectoire et apprendre à les connaître plus en détail. Je pense qu'ils ont une grande confiance dans leur capacité à promouvoir ce projet, car ils ont une grande expérience de la blockchain et participent déjà à l'écosystème à travers leurs pools et Catalyst. Ils joignent également une feuille de route, qui décompose en mois ce qui serait fait à travers une liste de sujets. Avec cela, il est possible d'avoir une vue d'ensemble, une compréhension solide du processus, car nous savons quelles activités seront faites et dans quel ordre pour aboutir au produit final. Et enfin, ils partagent la façon dont le financement sera utilisé. À propos de cette partie, je voudrais commenter que, à mon avis, j'aurais pu avoir plus de détails sur les deux sujets qui ne sont pas Algorithmic DAO Smart Contract. Par exemple, dans la partie traduction, ils ont mis de côté 6.000 $ à partir desquels nous ne savons pas combien de personnes seront divisées, quel est le coût de l'heure de travail du traducteur, si tous les traducteurs gagneraient le même montant (ou soudainement celui qui sait traduire une langue moins courante, qui est plus difficile à trouver des traducteurs, gagnerait plus...). Par conséquent, cette partie laisse un peu à désirer en termes de détails, s'il y avait plus d'explications, nous aurions une vision plus spécifique de ce qui se passerait avec l'argent demandé.", "q1r": 4, "q2": "Les auteurs établissent une série d'indicateurs clés de performance (KPI), qui peuvent être utilisés pour comprendre objectivement les principaux résultats à atteindre avec ce projet. On note qu'ils dialoguent directement avec les objectifs du défi, renforçant ainsi la question de l'impact ; et à travers eux, il est possible de contrôler de manière simple si ce qui était proposé a été atteint. Les définitions de la réussite en fonction des mois sont également fournies, c'est-à-dire que les auteurs ont pris soin de détailler les objectifs spécifiques en fonction du passage du temps, rendant l'auditabilité du projet totalement possible. Selon moi, comme il s'agit d'une plate-forme qui guidera d'autres plates-formes, et qu'il y aura plusieurs langues utilisées, avec des personnes très différentes, il est compliqué d'élire des membres de la communauté pour travailler sur l'auditabilité de ce projet (il y a beaucoup de choses différentes à contrôler et il faudrait des personnes qui parlent les langues présentes). Je pense qu'il est préférable que l'équipe de projet elle-même, avec ses traducteurs, promeuve ce suivi et organise les données collectées dans des rapports qui seront exposés à la communauté. Cela pourrait se faire en même temps que la présentation des résultats des autres propositions financées par le défi, par exemple, lors de l'assemblée générale ou par d'autres moyens de communication avec la communauté Cardano.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Very good idea! Creating a dao for translators can basically solve this challenge fund for good! \r\n\r\nDefinetly in accordance to the challenge goal and being very effective!\r\n\r\nRating given 5.", "q0r": 5, "q1": "Based on the information in the proposal, it is highly likely that they will implement the proposal successfully.\r\n\r\nI find their experience and skill suitable for the aim, the only drawback are missing positions to be filled.\r\n\r\nBesides that, I am confident.\r\n\r\nRating given 4.", "q1r": 4, "q2": "The roadmap is provided in very detail, sufficient for audit.\r\n\r\nAlso, the relevant KPIs are stated, along with a budget description increasing the possibility to audit.\r\n\r\nAlong with addressing possible risks and their mitigation, IP being open source, the progress and the outcome will be transparent.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "Cardano is a growing ecosystem, and adoption is crucial part for its success. Multilingual resources is still limited, and needs initiative and funding (for example, through this Fund 7 challenge setting). This proposal will create a DAO, that will govern around this multilingual resource ecosystem in Cardano. Although we already have Project Catalyst to fund these project, it just wouldn't enough to kickstart and fund a lot of multilingual resource in this early stages. DAO-NET will help to address this, by creating a DAO specifically to fund translators for various documentations, software interfaces, videos, etc. However, this proposal doesn't belong in this challenge, since the product they're building are DAOs, not the multilingual resource itself. It should be placed under 'DAOs <3 Cardano' challenge category. I acknowledge that this team have another proposal on DID challenge setting, but it would be better if they could combine this to one single DAO-NET proposal under the DAO challenge category. ", "q0r": 3, "q1": "This proposal provide team's linkedin profile, and able to prove that they have the experience needed for this type of project. This proposal can identify the skill requirements for Product Manager and the Lead Developer, both explained well. This proposal laid out the plan in details, from the roadmap, action plans, goals and achievement for each months. The budgets is explained in identifiable manner, and future funding consideration also provided. The team able to identify the risk and explain the mitigation solution, such as DAOs regulations, and bad actors from the participants within the DAO ecosystem. Overall, this is a well written and comprehensive proposal and have a high chance of successfully implemented. ", "q1r": 5, "q2": "The roadmap is well explained, with achievements and goals laid out in details. Metrics and KPIs are also provided, such as number of non-English speakers joining Cardano/DAO-NET community. However, it would be better if they provide the target number for each metrics, such as 100 people minimum joining the DAO-NET community.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "It is true that AI-based automatic translation tools have many shortcomings, but I think that it should still be focused on developing them rather than investing in traditional translation. Automation is the trend of current world. We need to invest in the right places to minimize waste of resources. However, in the short term, traditional translation still proves its superiority based on accuracy and sensitiveness.", "q0r": 3, "q1": "The team has many years of experience in the related field and present it well in the proposal. The proposal also includes a specific and reasonable plan (including phases and desired output for each phase). They also analyze risks and have corresponding provisions for those risks.", "q1r": 5, "q2": "The proposal includes KPIs along with Success Definition. Moreover, the outcome of project is easy to audit (output is document).", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Créer une DAO, avec un financement durable pour les traducteurs, afin de fournir des traductions pour les interfaces de logiciels, la documentation, les réunions et les vidéos.", "experience": "Une équipe expérimentée de développeurs Blockchain, de pionniers Plutus, d'opérateurs SPO, de conseillers communautaires et d'analystes de solutions."}