{"id": 396549, "author": "migamake", "title": "StreamCardano: serverless infra", "url": "https://cardano.ideascale.com/a/dtd/396549-48088", "category": 26438, "amount": 237000, "description": "Cardano dApps are currently expensive to build, and require setting up infrastructure that is barrier for entry of new players.", "f6_no_assessments": 5, "f6_rating": 4.7333333333333325, "videos": [], "media": [], "f6_assessments": [{"q0": "Aftering reading your proposed solution, I can’t find anywhere which mentions your target audience, an indispensable content for your project. And, you say that “your main deliverables will be example apps that developers can adapt to use our serverless service”, this sentence means you did refer to your products, but with no detail of it. Therefore, I think it will be a great idea if you can give a brief introduction of these trial applications, or even name them, if possible. Another tip that I want to give you is that even though some of your key metrics align with the challenge’s, they are too short, indeed. From this section, I believe that the investors will not appreciate your team due to the lack of keenness on this challenge. This is the beginning part of your proposal, so I hope that you can supplement more information to help you make a good impression on investors and increase the chance of passing.", "q0r": 3, "q1": "It's unbelievable! This is one of the most detailed and coherent plans that I have read. Your team must have spent lots of time preparing this long timeline! All five stages of the progress are described with necessary information for people to follow. Especially, you even list every budget needed for each milestone in a transparent manner, which makes me surprised. Indeed, $217000 is certainly a high amount of money, and you are doing great when noting down both big and small expenditures. By the way, your list of team members are very proper, with impressive profiles, and their roles are all essential and appropriate for the project progress.", "q1r": 5, "q2": "Although this is an absolutely project, you manage to give me a different view when providing a well-organized list of the measurements on the progress of the project. These methodologies play a vital role in offering users and investors much important information relevant to your project, which assists you in gaining more popularity. Your serverless platform promises to offer users services with no cost and maintenance of additional servers, which exactly focuses on the main solution that you came up with earlier. Good job!", "q2r": 5, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "The target audience is clearly defined as other Cardano developers, and CA has seen it. However, he still bases 3/5 assessment on the base of _underemphasising_ of target audience. This is unfair, and suggests that CA judges English literature rather than impact and feasibility of the project."}, {"q0": "serverless software is an innovative idea. Indeed, it solves a lot of problems for users in the Cardano ecosystem. This is also one of the problems that fit the challenge. In your proposed solution, you specifically describe how it addresses the challenge. Example: After this solution evolves, how easy will it be for users to access the dApp? What does this solution bring to developers? What will the Cardano ecosystem achieve if your project is funded? Also I have seen you mention the content of risks and challenges. Your presentation is clear enough for me to understand. Very good!", "q0r": 5, "q1": "your-12 -month roadmap is extremely clear and detailed. Milestones are also mentioned very appropriately. It is very persuasive. Detailed budget is also calculated very specifically. In particular, I am very impressed with the team members in this project. They are experts in this field. There are also two experienced advisors. A strong and talented team. This is a guarantee for the success of the project. I look forward to your project as well as your team.", "q1r": 5, "q2": "the progress of the project is measured by you very specifically through many aspects and parameters. Key performance goals and indicators are outlined very clearly and completely. If possible, estimate how many users and developers will be using your serverless platform after 12 months of development. In my opinion, this is a project with potential for development. Your presentation is pretty good.", "q2r": 5, "assessor": "z_assessor_1725", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "I strongly agree that this proposal fits very nicely into this challenge category. In the centralized IT world, nowadays serverless SaaS (software as a service) is a big benefit for new developers who have built some software (may be an MVP) that can scale up or down as their user base grows or lessens. This proposal wants to target dapp developers the same way in the Cardano ecosystem. \n\nAs a Plutus pioneer myself and senior developer I know that setting up cardano development infrastructure is tedious both in time and financial terms. The goal of this challenge is how can we basically help more developers on board to build dapps and allow seamless integrations with Cardano. This proposal essentially wants to provide a serverless equivalent environment to the dapps developers, so that they can simply just focus on the business logic of their smart contracts rather than worrying about setting up Cardano Node, and then writing querying/writing boilerplate code to interact with mainnet.\n\nThe KPIs mentioned here are clearly outlined that they want to also measure energy consumptions in terms of hosted dApps vs independently hosted dApps, as I also believe they will have more room for optimizations after such data and comparison is available. Additionally, the goals of this proposal in SDG sections are well explained, covering both mid term and long term goals, where we will see more sustainable energy efficient goals coming into play. \n\nOverall, a very well written proposal and good luck to the team.\n", "q0r": 5, "q1": "The team has provided the public profile links of the main developers and technical advisors. Additionally, as a senior developer myself I can clearly see that the technical and architectural points described by the proposer in this proposal are top notch. This is a clear sign of very good expertise in the proposed topic. Additionally, the developers and team members are very experienced, and not only with the development but also in Haskell. So this is always a positive point.\n\nThe  budget outlined is a little bit on the higher side. However, when we look into the details of the milestones and where which funding amount is going to, it all makes sense. The amount asked for is very well distributed and explained. Clearly since this proposal is about providing infrastructure to the dApps the team has to incur costs of running kubernetes clusters on AWS (around $18k). I am therefore very satisfied with the amount they have asked for and hence in my opinion the budget is reasonable.\n\nThe milestones M1 to M5 are given as in when they can be expected, so the timeline is realistic. Additionally, the challenges and teams ideas behind solving/addressing those challenges are provided. I totally support the idea of dogfooding the service, as in my own work experience I have seen that this is very helpful in finding the potential issues before the product/software is launched to the outside world. Very nicely written proposal, and therefore I strongly agree that this proposal is highly feasible to be implemented successfully.\n", "q1r": 5, "q2": "I strongly agree that this proposal is highly auditable and therefore the community can easily track the progress of this proposal. What I like about these milestones is that there will always be something for all the community members, e.g. front end running and showing things such as ADA transaction volume. Things such as online documentation of REST API interface and online functionality test can be done by any community member (Also the dApp developers can see what is happening and perhaps could provide quick feedback during the implementation period as well). Additionally, the milestones and other statistics will be shared via blogs with the community. Therefore, these trackable milestones items will have something interesting for every community member, whether coming from tech or non tech background.\n\nThe KPIs/success metrics is defined as in to see how many dApps developers will eventually be able to use these services and I believe this will be the main metrics to measure against the success of this project.\n\nThe targeted problem is well defined and the solution is explained in very easily understandable terms. Oftentimes I see that technical people use a lot of tech jargon, making it difficult for non technical users to understand things. This proposal, however, is written in a way that everyone can take away the big picture of what is the main goal of this proposal. ", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "\"This is a proposal to build ready-made services related to creating dapps and smart contracts to support the community to participate in building dapps more easily and at less cost.\nThis is a necessary step for the cardano network when our foundation in many areas is not yet complete, becoming a barrier when participating in building applications on the network.\nI think it takes an enthusiastic and professional team to take on this job.\"", "q0r": 5, "q1": "\"I appreciate that you have the first work goals and implementation plan, although it is not detailed and has a limit for each task.\nIn addition to the team's personnel, I have not seen a technical team with the necessary experience to secure this job other than the floor and financial experience.\nI hope if funded, your team will add the necessary personnel, more detailed on the implementation plan.\"", "q1r": 5, "q2": "\"Through written explanations, publicizing the code, and collecting \"\"number of endpoints\"\" results we can re-examine and track the progress of this project.\nThe services created are public, all new functions are listed, the number of users, the number of applications...\nThis is one of the projects that I really need to be funded and monitored to support this necessary period. As it guarantees in the future more dapps built on cardano.\"", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "This proposal intends to build a serverless SaaS for building platform as pure frontends and smart contracts, help Developer community easy to approach and develop dApps with less cost and maintenance. By hence, it could help to attract users and adopt Cardano ecosystem. For more convinced, I suggest the proposer provide some evidences for the cost of the problem that the solution impact, such as: list expensive costs/fees of hardware or infrastructure setting up that new developer need to invest/pay for entry.\n\nBy using JavaScript/TypeScript/PureScript library on backend connecting to get live updates of Cardano blockchain, user interface and automated execute wallet on query during development, the proposal bring a unique solution for developer experience and support, make Cardano much easier platform to access, develop, justified its relevance to the challenge brief bring its competitive advantage to scale and grow. Outperform all solutions, it brings Cardano ecosystem a full serverless dApp that Devs don't need to use any central server.\n\nIt is a positive point of the proposal when mentioned some challenges and solutions such as: SQL parsing, Client generated scripts sandbox and Secure user management for the service secure, dogfooding service in UAT (User Acceptance Testing) for easily accessible to developers.  It will be more positive if the Author list some risks, for example the latency and access limitation (requests number per second) as a cost of the SaaS and how to improve its performance and the way to mitigate them.\nBut anyway, this is a very good proposal with high Impactful for the community, I hope it's funded as a developer.", "q0r": 5, "q1": "The team is publicly verifiable as a capable collection of members with direct experience regarding the technical challenges of the proposal. It is undoubt to think that this team uniquely equipped to address this problem and execute on their proposed solution.\n\nWith full skills and experiences, I think this team could deal with the tech complexities. But it would be higher feasible if the proposer aware of the shortcoming and give plan to add a secure expert because secure problem is an important part of this SaaS proposal success.\n\nThere is a some cost breakdown in the proposal and as a whole the requested amount can be considered reasonable. But it'll be more convinced if the Author give out details into time and labour needed for each items, such as: WebUI with user subscription and per-project access tokens in 2 months with 3 Devs,...\n\nThe progression of KPIs and their associated values are reasonable with the regards to the problem, the complexity of the solution, and the team's capabilities. KPIs are generally measurable.\n\nThe Author explained technical aspects relevant to the problem solving, but it's more clear if added a short video or a diagram to explain the technical process. It will help the community easily understand and more confident. Additionally, open source is the core value of Cardano blockchain and also a problem that the community concern about, it's better if the proposer consider to open source in some basic parts beside the commercial product.\n\nThe proposer aware the importance of marketing and gave out the community growth plan, but the plan would be detailed if giving out the strategy such as marketing channels.\nIn general, this proposal has feasibility enough for the community. Good luck.", "q1r": 4, "q2": "With a clear and reasonable timeline, I think it's helpful for community tracking how the proposal is progressing with specific GOALS.\nThe KPIs are outlined clearly but it'll get higher auditability for all interested parties if the proposer provides quantitative number for each item to show not only the trackability but also the effort of team in attracting the community, for example: how many registered users/projects per day/month as a target that the platform to reach be and other measures of success are adequately auditable and available after expending some effort of the community.\nThe team addresses the need for a communication strategy and sets out some methods of providing updated progress of the project by: website, blog, live test page. But it'll be closer and faster to the Dev community,  IMO the proposer consider to build one Telegram/Discord channel for easy way to interact and QA.\nThe proposal defines what success means with their definitions are derived from their KPIs.", "q2r": 4, "assessor": "z_assessor_775", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Serverless software-as-a-service for building dApps as pure frontends+smart contracts. Decreases the cost of entry and maintenance.", "experience": "Migamake is company specializing in high performance Haskell projects, including parsing, data summarization, and blockchain services.\n\nOur developers have already participated in Cardano development.\n\nSome projects are here:\nhttps://www.migamake.com/projects.html"}