{"id": 396654, "author": "henokp50", "title": "Crowd funding platform with ADA.", "url": "https://cardano.ideascale.com/a/dtd/396654-48088", "category": 26438, "amount": 55000, "description": "Lack of crowdfunding platform for startups", "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": [], "media": [], "f6_assessments": [{"id": 6205, "q0": "IMPORTANT NOTE: This review might be susbstantially similar to the reviews of two other proposals by the same team as the other two proposals differ in name, but are proposing the delivery of the same *The Ennarea Exchange*, with the same Roadmap, with the same Financial Plan and the same definition of success.\nThe proposing team wants to develo a crowdfunding platform based on ADA, according to the name of the proposal. The problem statement reveals that the focus of the proposing team is to resolve the lack of crowdfunding platforms for startups. I think that this is a great idea and could provide a welcome boost for the Cardano ecosystem. \nThe issue that emerges with this proposal is that it is not an independent proposal, it has effectively been drawn out from a three-part submission of proposals submitted in Fund 8 by the same team in three different challenges. This is not a problem per se, but the problem is that this proposal does not stand on its own two feet. \nEffectively, we see this ame proposal under different names and with different problem statements. The team opted to increase their chances to obtain partial funding, by splitting a budget request for roughly $150,000 into three proposals for a third of the sum, each. \nEssentially, all three proposals are about *The Ennarea Exchange* (which is OK), but the trio has the same Roadmap, with the same Financial Plan and the same definition of success. The impact of this proposal - on its own - is difficult to ascertain, as it's financing is co-dependent on the success of the other two proposals and does not have a discrete - standalone - budget. THe entire Ennarea Exchange project as a whole  requires $350,000 for the first year of project development and management. So, the impact of financing this component may be negligible as this proposal requires $55,000, which is roughly one-seventh of the required funds for one year of development. \n", "q0r": 3, "q1": "The proposed Ennarea exchange  production-ready cryptocurrency exchange claims it will significantly contribute to the mass adoption of the Cardano blockchain. The proposal is focused on ICOs and identifies as a risk the fact that it needs regulatory approval in \"some countries\" - however there is no in-depth analysis offered about the types of regulatory hurdles it faces in specific markets and how to mitigate them. The team specifies that the following countries are some of the destinations its exchange can start its operations without regulatory challenges. 1. Ethiopia 2. Ghanna 3. Nigeria 4. South Africa 5. Angola 6. Egypt. \nThe team mentions that the architectural and application design of Ennarea is being finalized, however I visited the ennarea.com domain and was not overly impressed. The site named Ennarea Finance seems very early in development. As regards the demo, available at https://pilot.ennarea.com , it seems like a template demo, not a work in progress (not a criticism, just an observation). This same project has been in different forms submitted for funding in the F6 and F7 funds, which means that the team is persistent. It would have been good if the team could have reported on any specific progress since then. Then we come to the budget. According to the proposers, Ennarea Finance requires $350,000 for the first year of project development and management. Apparently, no other sources of financing (outside Catalyst) have been secured - or this has not been documented in the proposal. The team is requesting roughly $150,000 (less than half of the money) in this funding round and the remaining budget will be requested in another funding challenge. The initial roughly $150,000 budget will be disbursed among 3 different proposals in Fund 8. This proposal being reviewed here - is just one of the three. However, if only one proposal is accepted in this fund 8 -what happens to the project? The team has not addressed this clearly and it seems that the risk of partial funding is a real danger. Does the team intend to return the funds if only 1 or 2 (out of 3) proposals are funded in Fund 8? This needs to be addressed, if Feasibility is to be assessed properly. If the team secured additional funding from other sources, it would be good to list them in the proposal. Tentatively, the team members do seem to have the qualifications to pursue a software project of this type from the links to their Linkedin URLs. \n", "q1r": 2, "q2": "\nUnfortunately, it will be difficult to audit this proposal as a stand alone project - especially the expenditures of funds. The specific budget for this proposal $55,000 is not broken down into components, while a breakdown is available for roughly $138,000 worth of expenses for the entire project - to be funded from three Fund 8 proposals. Will they be approved all, at the same time? We do not know and the proposers do not know. This specific proposal as it stands does not have a budget breakdown - for itself. \nThis proposal integrates in a wider budget - and we cannot see which parts will be funded directly by this proposal. \nSome deliverables still seem to be too vague. It is good that the team intends to use its social media platforms as well as webpage blog posts to announced progress. I would advise the team to commit to deeper weekly progress reports (on a regular schedule) - due to the amounts of funding involved from Catalyst. Also, I think that the expenses and engagement of personnel and payments should also be easily auditable. \nThe three month goal includes a commitment to \"enable users to buy and sell ADA in our exchange\". This is not sufficiently clear. Users from which specific jurisdictions? The goal of having 10,000 active users on the platform after three months, seems optimistic to me as an outsider. But great. How will the auditability of this project be impacted if the other two Fund 8 proposals for the Ennarea exchange are NOT funded? Will this proposal - on its own - be auditable - if the team misses out on obtaining funding from its other two proposals? We are left to ponder about this, so it would be best if the team addressed these funding issues \nIf the team is not funded this round, I would advise the team to create separate financing modules (proposals) for their project. So that each module (proposal) stands on its own merits and can be implemented alone. These independent modules might be part of a wider picture, umbrella proposal - but they need to be independently auditable. \n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2653, "q0": "This proposal actually addresses two different challenges, dapps and integration and Cardano in Africa. We need a platform that focuses specifically on the underserved population on the earth. The fact they have thought through everything up to and including a self issued debit card looks very promising.", "q0r": 5, "q1": "This project has a solid plan for how they want to implement, however, I am worried that regulations could tie them up. I did not see a solid self funding mechanism in the project, and would like to know better how they plan on coming up with funds other than catalyst.", "q1r": 4, "q2": "I would like to see more clearly defined user interaction, such as a telegram, discord channel, and other avenues of social media instead of the only couple mentioned. Other than that they seem to be willing to communicate with the public the progress they are making. Great work guys!", "q2r": 4, "assessor": "z_assessor_1548", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3776, "q0": "In truth, this project is not described with enough vital information. First, the introduction paragraph of your proposed solution is too meager, namely no key features, no detailed functions, no target users, as well as no impacts of this project on them. Most of the information you presented in the first part is about the status quo nowadays in the blockchain industry, particularly in Africa. How could the community vote for your project while you can’t give them important knowledge of your project, right? Therefore, rewriting this part is the most urgent action you should take now. Even if you mentioned some information about the way your project will address this challenge, I think it should be more detailed as a means to prove your great contribution to the mass adoption of the Cardano blockchain. More importantly, in spite of successfully foreseeing what hindrances you could come across in the working process, no solutions are come up with to minimize them. Bear in mind, unless you find practical answers to these troubles, it implies that your competence is not eligible for conducting the project well. For this reason, please attach these risks to its own workable solutions.", "q0r": 2, "q1": "It's really astonishing! I can’t believe that your roadmap could be so detailed like that! Not only giving a great deal of major activities and milestones for the project, but you also attach them to specific timelines to attain, and more excellently, give some crucial explanations for each stage. You must have spent lots of time presenting a perfect work plan like this! Verygood! Similarly, your team deserves various compliments from the community upon allocating the requested budget in great detail. For instance, the total costs for office setup and furnishing are shown clearly via every size, location, lease term and unit price, and the same goes for other portfolios. However, there is a small piece of advice from my standpoint. You had better explain which the budget of $55,000 will be spent on since the financial plan you proposed is up to over 150,000 dollars (I know this cost is asked in this funding round) in order to assure the transparency of this project. The only case that I feel quite disappointed here is the data of your team members. Rather than provide only their LinkedIn profile links, I recommend you supplement other information pertaining to their experiences as an evidence to demonstrate their talent for the project execution and advancement.", "q1r": 4, "q2": "Could you give me the names of your social media platforms? Your measurement tools are relatively helpful, to the best of my knowledge, but if you could put them in detail, like what they are, which key contents will be publicized on them, the community will find it easier to trace your project progress closely. Above all, I have to admit that the success metrics you presented in this section are sufficient, to the greatest extent, and close to your roadmap, as well.You have done great when giving specific indexes to measure the successful level of your project, like listing 25 trading pairs (ADA/USDT, ADA/ETB, ADA/GHS, etc) in 3 months, attracting 25 thousand users in 6 months and raising a $10 million startup fund using our platform in one year. Well-done!", "q2r": 4, "assessor": "z_assessor_1675", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5197, "q0": "This is a very high price tag for something that might not be needed, or likely won't see much use. First of all, this is kind of what Catalyst does, isn't it? While it might not target Africa specifically, I've seen plenty of proposals regarding business in Africa. If they end up not getting funded in Catalyst, I don't expect the free market to send money to those projects either. Second, is this type of platform actually necessary? Maybe it might have the use of being a recognizable platform that can help bring attention to a lot of these startups in Africa (if they succeed in that). However, these businesses can get involved in the Cardano community to advertise themselves with their wallet address, or ADA handle and raise funds without having to cost $55k. Lastly, there are a growing number of options for business-based fundraising on the blockchain like ISPOs, NFTs, token sales, and launchpads/partnerships. So, I think there is a MUCH bigger risk (not listed in this impact section) of not being able to draw users from both the donor's side and the user's side. Outside of these concerns, I'm still not convinced of the legitimate impact potential without research on the existing market. The statement that this project will \"significantly contribute to mass adoption\" is not a tangible/quantifiable metric that I can understand the depth of the impact attempted to be made. I wish there was more feedback I could provide, but there's not much content here in the impacts section to give feedback on. We need much more detail, research, and content describing this project. It could add some legitimacy to the project to establish reputable partnerships, develop a list of clients, and maybe grow a social media following to ensure that donors are aware. ", "q0r": 2, "q1": "There's so much information here that the important information gets pretty easily lost. The experience on the team looks relatively appropriate. The content in the roadmap looks relatively passable but I do have some issues with the level of detail and concrete layout of the roadmap. The listed events on the roadmap do not have enough detail as to what exactly will be happening and the timeframes are a bit too wide to accurately understand what is being done and when. My biggest concern is with the budget. This is not the budget of a founded company that is up and operating for any given period of time. This is the budget of an idea for a company that has no development and none of its own investment capital. This budget includes office spaces, salaries for a finance department, legal department, 5 undisclosed employees, computer equipment, and a budget for marketing and travel. From my perspective, there is a serious loss of confidence in a company that has not demonstrated any intention to pursue this mission without funding from Catalyst. Are they capable of accomplishing the goals of this mission? Maybe. Apparently, not without the full approval of this funding. ", "q1r": 2, "q2": "Normally, I judge this section most harshly out of the whole proposal. In this case, it's the best part of the proposal. They provide quantifiable metrics in a milestone-based format, which is my absolute favorite thing to see. Their measurements for success are tangible and thorough. They say that they will post regular updates to social media, which would be good if they provided links to those social media. I think their goals are a little unrealistically ambitious but that's just because I don't have any information from previous sections about the market and target audience. ", "q2r": 3, "assessor": "z_assessor_1896", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5304, "q0": "I welcome your ideas and ways to solve the problem. Your crowdfunding platform will open up a lot of opportunities for startups, especially in Africa. I also appreciate the benefits it brings to the Cardano community. I also see the risks you present in the proposal. Hopefully if this project is developed, there will be a solution to these risks. In my opinion, this is a potential project.", "q0r": 5, "q1": "Your solution is analyzed very carefully from overview to details. The problems and solutions are explained very clearly. Platforms are also introduced in this section. In particular, your roadmap is very specific with timelines and milestones. In each milestone, specific activities and metrics are also mentioned. This is a really thorough and excellent roadmap for a long term project. I appreciate the demo you guys have released in 2021 and are continuing to research on. In terms of budget, you've covered the allocation of funding in great detail. I am completely convinced by your presentation. Combined with your team, I believe in the feasibility as well as the success of the project.", "q1r": 5, "q2": "Because your roadmap is detailed and clear with specific milestones and KPIs, I think this project is fully auditable. The great thing is that you publish the progress of the project on your website. I look forward to the success of the project as you have described. It is an excellent, complete and detailed presentation. This is a great project to look forward to.", "q2r": 5, "assessor": "z_assessor_1934", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8933, "q0": "This is an interesting idea, it is about to build a crowdfunding platform, which provides a merchant service for business to accept and process crypto payments, allows users to be able to raise funds by applying the exchange customer base of the platform and to invest in new ideas in form of ICOs.\nIn order to do this plan, the author proposes it as 3 proposals in different challenges. They are:\nhttps://cardano.ideascale.com/c/idea/396652  (This is I am assessing)\nhttps://cardano.ideascale.com/c/idea/396654 \nhttps://cardano.ideascale.com/c/idea/396673\nThe proposal certainly fits very well with the objective laid out in the challenge and adds value to Cardano system. If success the dApp will help to contribute to the mass adoption of the Cardano blockchain and help startups with the solution utilising the power of smart contracts of the app, therefore it helps to increase the quality and quantity of Cardano engagement.\nIt is great when the author considers 3 challenges/risks that he/she has to face to implement the project successfully, but it would be greater if these challenges/risks could be explained more in details and the author could consider the mitigation of each of them. It’s just my suggestion for the proposal be more greater. I still strongly agree the proposal is impactful.\n", "q0r": 5, "q1": "The platform is currently under the development with link and video included for readers to have the first vision of how the product will be, and it is the strong evidence of the author and his/her team’s talent, experience and skills relevant to executing the proposal. The type and number of team members as well as their roles in the project are showed, even though there is not much about members’ information, but we can see more about them in their social links which are included. The plan is well written in a very clear, succinct and understandable way with lists of activities that the team needs to do. Because of it we can understand about Ennarea and Ennarea pro, what and how it helps users trade and invest through the platform, and so on. \nAbout the financial amount, I see the big plan need a big amount budget, it is broken down into identifiables items in reasonable and clear way, and the author did mentioned $150K is request in this Fund in three proposals (as I said above). This proposal’s budget requesting is $55K, for lists of items as the author’s explaination. I would have a small suggestion here: if the $55K budget of this proposal could be shown in seperating section, it would help readers to see easier and clearer.\nIt is interesting about the explaination of the problems and solutions of delivering the Ennarea product, it shows that the author has a deep research about them, however I think it would be more interesting if that research could be showed with links or any reference about: how low the adoption and development of blockchain technology in Africa are; the number of this statement in the proposal “Out of fifty-four countries, only five countries' fiat currencies have trading pairs on major exchanges, the remaining forty-nine are not supported and don't have trading pairs” (Where is the number from?), and so on. Besides, it would be more beneficial if we know more detailed about the security features which will be applied on the platform, to raise the trust in the platform for users.\n", "q1r": 5, "q2": "The author shows the well-done preparation for the plan of the project by including the long term vision, success metrics, KPIs and roadmap as well as the short term. The information is provided with a good level of detail, so that we can understand what results would be expected and what the specific goals are in the periods of 3 months, 6 months and 12 months. Moreover, the team commits the progress will be shown on social media platform to be easy monitered by the challenge team and the community, so I do not doubt about the proposal’s auditability.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "ADA supported Crowdfunding platform for startups", "experience": "software engineer and blockchain developer developed a production-ready cryptocurrency trading platform."}