{"id": 396676, "author": "patrik.gudev", "title": "MUSEVERSE: Music into the Metaverse", "url": "https://cardano.ideascale.com/a/dtd/396676-48088", "category": 26438, "amount": 57000, "description": "The music industry became a field of big tech companies\n\nThere is no solid system for empowering artists through blockchain in the metaverse", "funded": 1, "upvotes": 29652884, "downvotes": 10630591, "votes_result": 19022293, "votes_cast": 100, "f6_no_assessments": 8, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 339, "q0": "We have that the central idea of ​​the proposal is to carry out an integration between metaverse and blockchain to create an innovative environment, in which there will be an interaction between musicians and the general public. By using Cardano's technology with an innovative proposal and performing an integration with another widely used tool (metaverse) to reach a large potential market, we have that the proposal fits the goals of the challenge. In addition, it has the possibility to create a new concept for the artists in relation to the metaverse and also to expand the Cardano ecosystem.\n\nWith the success and implementation of this proposal, it is possible to see, in the medium and long term, the opening of new integrations between Cardano's technology and the metaverse. According to the guidelines indicated in the description of the challenge in which this proposal finds itself and given the technical capacity of the professionals involved, the budget of $57,000 seems coherent. We will now analyze the stages of development of this proposal and how this amount is distributed.", "q0r": 5, "q1": "As for the feasibility of the project, we realized that the idea is very well conceived, with several details being taken into account for the project to succeed. In other words, we sought to create an entire ecosystem favorable to both artists and the general public that use Museverse. And the tools that build this ecosystem involve concepts such as using tokens, trading NFTs and recognizing the audience of virtual shows by AI. All this, together with the fact that the proposal was almost financed in a previous fund, leads us to trust in the possibility of successful execution of the project.\n\nThe steps planned to reach the objective are described through a temporal evolution that makes a lot of sense, first the focus is on the construction of NFT instruments that will be commercialized in the future; only then are a rewards architecture and reward pools (which include all participants in the metaverse) developed. Thus, we see that very complex ideas were not given too much focus before simpler ones had been made.\n\nThe team dedicated to the construction of the project seems to have the necessary skills to carry it out, the site already built is also well structured and it is possible to find the contact of the CEO of the project. Regarding the team, we can also mention that it is not only composed of developers, there are people specialized in social media design and administration, which is fundamental in a project as visual as this.\n\nThe budget is well defined and demonstrates a concern to allocate budget to different development fronts, such as using Plutus ($18,000), Unity ($18,000) and AI ($9,000). One point that seems to have been missing here is a budget breakdown that was necessarily directed towards project marketing. In addition, it was not possible to easily find the resumes of the other people involved in the project (besides the CEO) for us to verify their experiences.", "q1r": 4, "q2": "Regarding the ways to follow the project, we have a considerable lack of information and more detailed methods that allow us to verify if the project is being well received and having a considerable return. It would be important, given the various tools that the project aims to use, that more clear metrics were used. For example, the number of new artists performing concerts on Museverse, the engagement of the project on social networks, how many instruments are being traded monthly on the platform, the average value of these negotiations, in addition to other similar ways of following the project. The idea of ​​interacting with the community through questions and answers was a good point to consider.\n\nWe noticed the description that there will be monthly updates for the community using Youtube and other social media, but what parameters and information will these monthly updates bring? The way it was written, the idea was a little vague.\n\nAnother point that could be mentioned here would also be the identification of clear metrics to observe how the project initially performed. Some goals could have been established, such as defining the number of new artists to be reached using the platform, instruments sold, partnerships made with brands in the music world, among other parameters.", "q2r": 3, "assessor": "z_assessor_1146", "no_vca": 13, "ne": 9, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 7278, "q0": "I found this proposal quite promising, because it seeks to combine artificial intelligence, metaverse and our Cardano blockchain. The authors justify that, just as NFT has boomed in recent times, the same thing will happen with the metaverse and developing a music-oriented project in this context can be a really positive thing. It would have been better if they had better explained the SingularityNET concept. It is possible to understand what this is based on the context, the proposal and the objectives, but for laymen, people who do not know the project before (I remember seeing this name at some point in previous funds, but I don't remember well ) an accessible explanation would be essential. I believe that proposals with a very technical nature should always be leveled, so that CAs, voters and all types of people who come into contact with them understand 100%. Returning to the proposal and how it relates to the objectives of the challenge: yes, I believe it is a project that dialogues and meets the specific objectives of the challenge well, because it will integrate products that already exist (our blockchain, for example) with concepts that are still getting stronger (virtual reality and metaverse), and the key to everything will be music. It is certainly a universal topic, I have already seen some proposals that address it, alleging the difficulties of artists in producing and presenting their music (the authors cite the example of the restrictions generated by the pandemic, but there are also many other bureaucracies in the middle). Creating a virtual environment that can benefit both artists and our blockchain, as it will increase the amount of transactions made on Cardano through smart contracts, NFT exchanges, create new pools and attract a new audience, for example, is something that it certainly fits with what we're looking for here. It is also positive as it already has a destination to host its application (Somnium Space). Therefore, the only thing I would like to point out would be to better explain the technical concepts so that everyone can understand the proposal equally. \n", "q0r": 4, "q1": "All the basic feasibility information is present here, but I believe there could have been more detail in some parts, in order to generate a better understanding and confidence in the process, the team and the use of the budget. Starting with the script, the authors establish what would happen over the months, I found this part the best of all auditability because it is well punctuated as the entire development process would take place. Despite this, it would be even better if there were more details about these activities, such as who would execute them, would they happen in parallel or would one start and then, when completed, the other would start? How long would each last? What would the reward system architecture look like (again, more lay people might not fully understand what the authors meant here). Although they were concerned about separating the activities by month, it would be important for them to include here a small explanation about each one of them, in this way we would have a much more solid view of the process. Regarding the project's expenses, I believe that the salaries of the professionals involved are quite fair, but it would be interesting if it was explained a little better about their work routines. How many hours would you dedicate to this project? In this way, we would be able to better understand the value of their working hours. And finally, speaking of them, the team involved introduces itself very briefly, we know their names, roles in the project and a (very) brief history of what they have done so far. My suggestions are: give more details about their careers; provide some means for us to contact them, if necessary; provide some evidence of their CVs, for example linkedin profiles if they have one. Generally, we have what we need, just without the proper level of detail throughout. \n", "q1r": 4, "q2": "This part of the proposal is very good. The team tells us what their specific goals are, they say they aim to create “a functioning ecosystem with millions of users across multiple metaverses”, detailing how this would be done through clearer topics, so that it is possible to monitor if indeed success is achieved. It was obtained. In terms of results, we can also see if this project was successful or not, based on the information provided. And about project monitoring: this part is very easy to monitor, since the team, in the previous topic, establishes which tasks would be developed each month. I suggest that some members of the Cardano community, preferably those who are interested in the topic of music and know something about the metaverse and virtual reality, establish a direct follow-up of the activities, together with the team, and bring this information to the rest of the Cardano community. The authors also cite how they would perceive success based on several small topics, that is, we have material to audit both progress and results. In general, auditability is adequate to reliably follow the project. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 3777, "q0": "Generally, this is a meticulously written section that is really interesting and informative. It is so brilliant of our project to come up with a great idea: using the hot and advanced technologies, the Metaverse, virtual reality and AI recognition system, to address the nowadays persistent problem of entertainment industry - Coronavirus outbreaks. This deadly disease has restricted artists, actors and musicians from holding outdoor activities like concerts and live tours. The MuseVerse is highly expected to meet the app’s output of the challenge, namely making popular musical instruments accessible in the metaverse and establishing an NFTs marketplace for them using smart contracts. Your proposed solutions to the foreseen risks (including the reasons why you choose Somnium space) are very clear and prospective. But on the flip side, I think you should tell more about these difficulties in detail when it comes to Metaverse, such as which phases of this technology you often get into trouble with.", "q0r": 5, "q1": "Do you have a clear work plan for 2023? Irrefutably, you presented a condensed list of future milestones in 2022, which fully covers every stage of the progress as well as in every month, and it satisfies me. But it’s quite disappointing, to be honest, when mentioning the roadmap of the year 2023, you only announce that your goal is to keep building an ecosystem for musicians, without any other extra information. That being the case, my opinion is that you should take a seat and write down the whole timeline for the next year because if doing so, this means that your team is completely willing to compete in this battle. Moreover, in terms of the budget allocation, my advice is to particularize the quantity of these listed positions, containing Plutus, AI, Unity developers. Your present team members list is acceptable but I think you could do better than that if you spent a little time introducing their notable achievements or years of experiences so that their profiles can leave a good mark on fundraisers.\n", "q1r": 4, "q2": "Seriously? You only mention two main measurements that will be applied to help users and investors keep up to date without any other associated information? I understand that Youtube and other social platforms like Spotify, Twitter are highly potential for you to update important news pertaining to your project. But to the best of my knowledge, if you just leave one sentence on this request of challenge, the investors, without doubt, will think that your team is lacking in genuine enthusiasm in this competition. Thus, if you frankly desire a $50,000 budget, don’t hesitate anymore to add more information to this section, containing the part “defining the success for your project in the future”. Put them in detail as much as possible.", "q2r": 3, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4437, "q0": "i am very surprised with your proposal. This is a great and creative idea. The music market has always been an exciting and potential market. The development of Metaverse as well as SingularityNET will be a useful solution for this market in the context of the current epidemic. Your proposed solution is extremely comprehensive, detailed and clear. Making instruments accessible in the Metaverse is a brilliant idea. You have estimated the risks encountered. I think there will be no problem because the biggest risk is finding a suitable metaverse already solved. Somnium Space is a reasonable choice. In addition, other factors are also given a very complete solution. I really appreciate your ideas and careful preparation. ", "q0r": 5, "q1": "this section is very comprehensive. The roadmap was stated in the proposal. I appreciate what you guys have done in 2020. It is a solid foundation for future project development. The roadmap is presented on a very specific month-by-month basis. However, I wonder if that is the planned roadmap for 2020 or the future. You need to reconsider this point. The budget you proposed is very detailed. With a plan that has already started in 2020 and a roadmap like you mentioned, I think the total budget you require is reasonable. Your team members are extremely impressive. These are people with deep expertise, experience and impressive works. This will be a huge support for the project.", "q1r": 5, "q2": "you should mention \"Every month, what information will the project update to the community\", \"What are the platforms used for reporting?\". All information needs to be specific and clear. If possible, give numbers to increase the persuasiveness of your proposal. I understand the long-term goals and future vision that I want to achieve. Your achievements are impressive. However, to make sure this project has the potential to be successful in the future, I encourage you to come up with metrics to measure the project's progress.", "q2r": 4, "assessor": "z_assessor_1725", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4950, "q0": "The proposal does address a few of the challenge principals (deliver high value, useful to Cardano users and a key app on other platforms) however the proposal does not adequately articulate the reason Cardano is the preferred platform.  The proposal establishes several audacious goals, building a rewards system, creating VR NFT musical instruments and facilitating an environment for concerts.  I question the ability of proposers to execute on each major initiative in the given timeframe.  Focusing on a token/regards system for musicians and artist would be beneficial and may be the area the team begins to achieve success.  I question the impact and viability of the financial model since the 1% fee seems to low to generate interest from musicians.  If the Dapp cannot attract artist with established followers than the Dapp will have very little impact.  The team would benefit from having several musician artists (could be jazz, pop, electronic, whatever) committed to participating in the MVP.", "q0r": 3, "q1": "The proposal does not provide a detailed enough plan to achieve the established roadmap.  The Roadmap appears to have a significant amount of developments in a short timeframe most of which do not appear to be building upon themselves. The proposer should scope the project on hours and not month since indicating a Plutus developer would be $18,000 for 6 months is not realistic.  The team appears to have a majority of the relevant industry and content knowledge and experience but is missing two key team members; 1) a technology member to assist with scoping and establishing real timelines and 2) a professional musician(s).  As a musician I can tell you learning an instrument is a life long occupation and translating your piano chops to a VR piano could be like learning a new instrument.  For example the Mi.Mu gloves Imogen Heep uses took her a lot of time and effort to control.  VR instruments which are difficult or unnatural to use will turn off musicians.", "q1r": 2, "q2": "The proposer provides a roadmap of milestones but not a list of KPIs to measure the progress.  In addition, the roadmap has a lot of major milestones and I still question the team’s ability to complete all the milestones.  I believe the proposer would benefit by focusing on the rewards and token system first while getting musicians to commit as early adopters of the MVP.  The strong and reliable rewards system will generate interest from musicians and their engagement will provide a great feedback loop wile developing the VR instruments.  This also allows the proposer to set KPIs such as number of musicians engaged and number of potential followers all of which could be utilized to build a financial forecast demonstrating the value to Cardano and community.", "q2r": 2, "assessor": "z_assessor_1807", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8443, "q0": "I found the MuseVerse project is a really interesting idea as it is the combination of music, blockchain and virtual reality. To solve the difficulty of covid situation and reduce the influence of middle man, this project gives an innovative solution for musicians to compose music in MetaVerse, facilliates artist collaboration and stablishing an NFTs marketplace for instruments using smart contracts. To get this done, the proposer shows their seriousness in choosing different tools and platform. System is based on Cardano and SingularityNET blockchains, Metaverse like Somnium Space. Also they have thorough research of music instruments and reward system. I think by applying technology, this will bring positive effect on artists, owners, developers, and music industry as a whole. ", "q0r": 5, "q1": "The proposer shows their seriousness in implementing their innovative idea by having a deep study, clear plan and timeline for each job. It would be better if the proposer could give their KPIs. As far as I'm concerned, the team is full of qualified people and has the experience in this field. By giving their Linkedin will earn more understanding and trust from the community. To complete this project, more developers are needed. The proposer gives quite clear budget for executing the project. I hope this project will be successful. ", "q1r": 4, "q2": "We can track the progress of this project by visiting their youtube, other social media channels and see the number of funtional users cross multiple metaverses. I really hope this project could get funded to support the team in this period. If successfully, it could develop the music industry in the new ways and increase the influence of Cardano blockchain in the music field.", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8645, "q0": "The problems and solutions proposed are reasonable. The first is the issue of music copyright. The 2nd, Current traditional music industry is very competitive and the chances for freelance artists or artists who are not famous that very low If they want to be famous or have a good income. They must have good relationship with \"middle-men\" to be able to bring their products to users. The solution to create a music creation platform integrated into the metaverse based on NFT and blockchain technologies is a great solution. It can promote the rapid development of blockchain's applications in the music industry, as well as help more artists have the opportunity to exploit their music products and users can freely access music's art according to their needs and the way they want. Metaverse and VR will bring experiences to users anywhere, anytime and without geographical restrictions. The solutions to the problem that proposed by the proposer are very detailed and easy to understand. It can be summarized as follows: The proposal will create a tool that integrates into the Metaverse platforms, these tools include virtual instruments, NFT creation functionality for recording music's product, ticketing for users to watch live, smart contract is used to pay the fees that users will pay to artists if the music product is used, integrated AI technology will be used to analyze the number of users use or participate in the Platform. However, I see few problems that the proposer probably forgot to mention. NFT is used to save musical works created by artists and save it on a centralized server. As described the platform generates soundbanks for virtual instruments, every time an artist creates music (eg: 1 music note = 1 NFT or 1 music page sheet = 1 NFT ) so here's the problem might will happen:\n1st -> cost, if 1 music product is completed and then the whole product is packed and put on the blockchain in the form of NFT, the cost will be very cheap and users will benefit from this low cost . The platform of the proposal also derives its success. But, if a music product contains many NFT that represent for each note or each part of this music product then the fee to create the whole product might be high. In my opinion, the solution to this problem that the soundbanks of the platform must be really diverse, so that musicians can create their own products while keeping the cost of the product as low as possible.\n2nd, The solution for the \"live concert\" function of this platform is also unclear about the cost issue like I raised in the first issue. In addition, it is problem about the speed of data writing and transaction processing of the blockchain. Mining many small NFTs and writing data directly to the Cardano main chain is very expensive and Cardano's transaction processing speed is not designed to handle transactions like this. What will be the user's fee when the price of the product cannot be determined before they participate in the live concert. Or if so, the proponeser can give a simple example to help the community better visualize the effect.\nOffering a solution to this problem of transaction processing cost and speed will make this proposal perfect in terms of impact. I hope to be able to see it soon from the proponent as this is a very potential project to me and the proposer is quite well prepared.", "q0r": 4, "q1": "A 5 months detailed plan is proposed by the proposer. The division of work in it is quite reasonable, the interface design of the platform can be easily done when I have a look at the project's website and see that the project team is professional in graphic design. An integrated implementation of AI technology is also acceptable when using Singularity's AI platform. However, the plan to deploy and build the platform on Cardano is not reasonable to me. There is also not a Plutus programmer on the project team, the recruitment of Plutus programmers will take place in April. The milestones related to Plutus programming will be done in May and June like implementing NFT minting, creating reward pool (smart contract programming). I don't understand what the proposer is based on to come up with a plan to complete the other work. Has he ever get consulting from a Plutus programmer? Hope he can clarify this.\nThe allocation of funds in terms of costs for Unity (3D) and AI development is reasonable because these developers are available in the core team. Budget for Plutus programmers, as I mentioned above, Has the proposer got consulting from a Plutus programmer? When there is no reference from a Plutus programmer and with a fixed cost, it will be a risk. If the Plutus programmer does not accept that cost, how will it be handled? The proposer needs more clarification on this part (EG: budget for Risk Management) as it is quite important and can affect the project plan in connecting their platform with Cardano. Finally, the cost of buying a parcel in Somnium Space: Somnium is a Metaverse platform built on Ethereum. Why would a project that willing to build on Cardano ask for funds to contribute to a project on another ecosystem. It is possible that the proposer want to intends to build on Somnium to attract users first and then switch to Cardano. In this case NFT development costs would be a risk, NFT ethereum is ERC721 and Cardano is CNFT currently there is no actual technology to do NFT asset transfer from the two aforementioned ecosystems.\nThe information to verify the project team's profile are not stated by the proposer, I also checked the website and only found information about the CEO of the project. However, through the way they build the website interface, I believe the project team is capable of handling the interface, AI, and VR. About the person who implements the Plutus programming because it is not available, so it cannot be assessed.", "q1r": 2, "q2": "If the project will funded, it will not difficult to track the project progress. The proposer suggested the method of checking project progress that monthly reports will be provided. I suggest that the proposer detail what the monthly report will look like providing detailed sources for checking items of work. Example: Programming plutus smart contract, AI and Unity -> provide github source, source code.\nTo assess the success of project at early stage, I am really uncomfortable. The project plans to deploy on the Sonium metaverse first, so to assess the success of the project, it is necessary to create an Ethereum wallet, Solana buys NFT tokens of these two blockchains to experience. In addition, To measure the success of a dapp project, numerical targets are needed. I suggest it's a goal in terms of music production, a target of Cardano users that will be using the project's platform in the early stages.", "q2r": 4, "assessor": "z_assessor_683", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10499, "q0": "The proposal, unfortunately, does not fit well with the objectives of the challenge, and although the idea itself is not flawed, the way in which its implementation is expected is at least unfeasible (this unfeasibility will be better described in the section reserved for feasibility), but apart from the fact that the idea itself is not bad, the proposal fails to meet the objectives proposed in the challenge, such as: the type of application that Museverse is, it is not among the most used applications in other ecosystems, and also because it is dealing with a good opportunity for musicians to earn an income in the metaverse, the proposal fails to meet the needs of a more general audience of the Cardano ecosystem, in addition to taking into account the complexity that playing a particular instrument can demand, and the precision that each movement must having to generate a pleasant result makes it not just a simple process of playing SingularityNet and expecting it to do all the work. In short, I do not think that the proposal would generate a considerable impact on the Cardano ecosystem, for the reasons already mentioned above, and also because it does not solve a problem suffered by the population in general, because as is evidenced by observing musical shows in the metaverse, made by two big game companies, one of them being EpicGames in its FPS game battleroyale Fortnite, which had the participation of the rapper Travis Scott in a show in the metaverse, and also Nintendo in its celebration of 25 years of the Pokemon franchise, with the participation of the singer Post Malone, it doesn't take a lot of complexity, having instruments being played live virtually, to have a successful musical performance in the metaverse.", "q0r": 2, "q1": "Starting with planning, the team starts by citing the progress made from 2020 to 2022, probably to try to convey more credibility, and to show that the proposal that was posted in fund 7, which is basically identical to the current proposal, was not simply left out. side and forgotten, although evidence for such achievements is also not exposed. Continuing, the production process is reasonably well explained, disregarding the fact that April was written twice and no one noticed until now, and the expenses are also well separated, but the real problem lies in its participants, and not only in the fact that that even in their second fund they still do not have a Plutus developer in the team, but also in the lack of transparency in the presentation of their members, I will take as an example the CEO himself, Patrik Gudev, it is said that he is the Co-founder of Revo Music, a of the most advanced artificial intelligence music generation systems on the market, but even so no proof of this fact is available, and when researching, I confess that in fact he was co-founder of an audiovisual products company layer of Revo Music, found in the czech republic, i also found that the company was created on 12/16/2019, which fits well with the time frame exposed to the beginning of the session reserved for feasibility, which goes from 2020 to 2022, but also according to the Czech personal finance portal operated by Partners media\nsro([Revo Music sro ⇒ Company ID: 08753296 - Commercial Registry | Peníze.cz (penize.cz)](https://rejstrik.penize.cz/08753296-revo-music-sro#sr)), is evidenced that the total capital registered in this company is just under 2 thousand USD, in complete disagreement with what was presented on the official page of the proposal.\n\nNow for technical difficulties, as in the fund 7 proposal, the drums are presented as the first instrument that will undergo a minting to an NFT, which makes sense because it is an instrument with wider and less delicate movements, different from the piano, which was presented in the first proposal but apparently there were no advances in its creation, which also makes sense, since a movement recognition model implemented in VR, which is so accurate as to allow the user to play an instrument such as the piano or guitar virtually, it would not be just another implementation, or an extra function in a Dapp project, it would be a system to change the entire VR market today.", "q1r": 1, "q2": "In terms of audibility, the project also leaves something to be desired, since according to the official page of the proposal, monthly updates of the Muse Verse progress will be made available on youtube and on social networks, but other than that there is no other way listed more frequently to have better contact with the public, and although I believe that after the project is complete it will be easy to monitor, the process until then remains very uncertain.", "q2r": 3, "assessor": "z_assessor_928", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1}], "solution": "System based on Cardano and SingularityNET blockchains that distribute rewards in form of tokens for artists performing in the metaverse.", "experience": "-AI smart tools developers for music composing\n\n-VR developers\n\n-Music sound producers\n\n-Entrepreneurs\n\n-Advisors"}