{"id": 396671, "author": "catsper", "title": "Decentralized Token Distribution", "url": "https://cardano.ideascale.com/a/dtd/396671-48088", "category": 26438, "amount": 83000, "description": "There is not currently a decentralized way to distribute or claim native assets on Cardano (Tokens, NFT’s, etc).", "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 4207, "q0": "The problem statement is sensible and straightforward, and it corresponds to the challenge brief. This proposal seeks to establish a decentralized alternative through which entities can distribute tokens for projects or themselves, and users can claim tokens at a low cost. I appreciate the solution's fairly straightforward and precise formulation, as well as the primary overview of how it relates to the ecosystem's development. The author also outlines potential barriers to the project's progress and a reasonable plan to overcome them, which seems reasonable and acceptable to me. I agree that this proposal addresses the challenge and if the project is being effectively implemented, it will be a very beneficial investment for the community and the ecosystem as a whole.", "q0r": 5, "q1": "Unfortunately, the idea falls short in this category. Concerning the script, the material provided was sufficient for us to have a basic understanding of what was going to happen, but it might have been done in greater detail. Each main activity could have been broken down into smaller topics in order to improve our view of the process. The roadmap is straightforward and sensible, with definite time frames, splitting the project into five phases; however, the author is more concerned with revealing the phases that comprise the entire project, rather than outlining them and explaining exactly what would happen in each. We are aware of the main author's areas of expertise, as well as the fact that he has a proposal funded in round 7. But it's always interesting to learn about his previous experiences, examples of projects he's completed, how long he's been in the region, and so on. However, a genuine link is provided, and I feel he is well-trained to contribute to the success of this project. However, because there is no mention of employing team members, I will assume that he will do this on his own. Isn't it a bit hazardous to assume that he'd be able to complete all of the work on his own? And, if he wishes to find more team members, I recommend that he include more information on how many individuals are necessary and what skills are required for each position, and so forth. And, in terms of justifying the financing amount, we have a division of values for the parts of the project, but I felt a lack of detail in each opponent, for example, in terms of Developer Expenses, there should be additional information on how many working hours are estimated from start to finish (maybe per week or month), detail cost of items should be presented so voters can check its fairness.", "q1r": 2, "q2": "The author provides explanations on how success would be,so that it is feasible to monitor if these conditions were met and, as a result, whether the proposal achieved what it promised. This proposal does give success measurements, KPIs, and results to be attained within a specific time frame. Although KPIs are offered, it would be helpful to understand what \"beta release milestone for testing\" means; it appears to be more of a success indicator than a KPI. Metrics of success are highly subjective, “adoption of the product and the services it provides” does not do justice to evaluate if the project is really successful or not, it would be nice if the author tried quantifying it, with numbers (just estimate). Also, it would be interesting for the team to draw a bridge between the community and the team by introducing some kind of platform or channel so everyone who is interested can easily keep track of the progress. All in all, I'd like the team to delve even deeper into auditability so that we can comprehend 100% of the information they already supply us.", "q2r": 3, "assessor": "z_assessor_1712", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Dear CA, \n\nThankyou for your comments. With respect to Feasibility, I do agree here that some more information could have been given in the proposal on ideascale. In my budget analysis I had planned for a development team of two (please see attached documents). Did you manage to check out the project timeline gnat chart that I attached to the proposal? if so, this gives a bit more detail on the breakdown of the tasks and a little more information of what is involved in each. As this was a proposal document i had focused on not giving too much detail in the \"whitepaper\" as not not confuse the reader. \n\nI have attached an additional document \"budget\" that explains where the amounts come from for two developers. Thankyou for your feedback, next time I will try to make it a little more obvious about the team members and the costs/budget. \n\nhttps://www.infinityfos.io/shared-files/28/?Decentralized_Token_Distribution_Budget.pdf\n\nhttps://www.infinityfos.io/shared-files/27/?Decentralized_Token_Distribustion_project_schedule.pdf\n\nhttps://www.infinityfos.io/shared-files/29/?Decentralized_Asset_Distribution.pdf\n\n\nBest Regards. :-)"}, {"id": 8442, "q0": "This project solves a pratical problem in the current ecosystem of finding a decentralized way of distributing or claiming native assets on Cardano. This proposal will bring a lot of positive benefits for users, stake pools and project itself. Also, it helps to avoid the influence of centralized third parties, reduce cost and complexity when distributing native assets. Moreover, it will create independent ecosystem as it puts control of distribution of native assets back in the hands of the community. However, to executive this project successfully, the proposer need to have a deep and clear technical understanding of Cardano, Plutus and blockchain to avoid risks of security vulnerabilities.", "q0r": 4, "q1": "After thorough reading, I think the proposer shows his deep understanding and study at the first stage of the project. Also, from his Linkedin profile shows his talent and experienced background. But I would like to see other team member profiles too. The proposer breaks down the plan into detailed stages and timeline. In addition, he is very clear of each stage's expenses for completing the project.But I'm not sure whether this requied budget including HR cost. I would like to see more detailed KPIs even though he did mention about beta release milestone for testing. In my opinion, this is a very promising and pratical project because there is a huge need of decentralized applications for users and SPOs when distributing native assets on Cardano. ", "q1r": 4, "q2": "It is quite easy for the community and Catalyst to check the progress of the project based on regular activity updates of project timeline. One of those will be the beta release milestone. I hope this project will be funded soon and be executed successfully.", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8558, "q0": "This project aims to create a decentralized version of a token dispenser dapp (picture a decentralized Drip Dropz) and make it available to anyone in the Cardano who wants to distribute tokens to the community of their own projects.\n\nThe proposal matches perfectly the challenge goals, of building dapps and integrations that drive the adoption of the Cardano network, but more than that, it aligns with the overarching vision of Project Catalyst - enabling projects that have the potential to create cascading benefits for the ecosystem.\n\nPrimarily because of this, but also because of the clear vision and obvious skills and understanding of the ecosystem demonstrated by the team behind this proposal I assess it as having a potentially great impact on the ecosystem as a whole.\n\nIn addition, the team clearly understands the challenges and risks they could face during the development of this project as they are very accurately described in the proposal.", "q0r": 5, "q1": "The presented implementation plan is sufficiently detailed and matches the volume of work that can be expected from such a project.\n\nIn addition, the proposal has attached a very helpful Gantt chart for easy visualization of the project plan.\n\nThe budget breakdown makes sense for the scope of the project and creates a detailed overview of the expected costs. What I would've liked to see more in the budget breakdown are hourly rates attached to each task, but given the thoroughness of the budget, this is a minor omission for which I will not deduct points from the final score. However, it’s a recommendation I would like to make for any future proposals the developer might submit.\n\nAntony Burrows, the developer behind this proposal describes his prior experience in detail and provides a link to his LinkedIn profile so that everything claimed is easily verifiable.", "q1r": 5, "q2": "The proposal mentions that the metrics and KPIs needed to accurately track its progress can be easily deduced from the timeline and other parts of the proposal. While this is true, I would have liked to see them more clearly described in the auditability section. As such, in case this proposal is not funded this in round and needs to be resubmitted I would advise including a clear list of easily trackable and quantifiable metrics and KPIs, in the next iteration, that will allow for easy verification and auditing of the project.\n\nThe definition of success is on point and accurately describes what the outcome may be from successfully completing this project. However what I would have liked to see more are some milestones to track the actual implementation of the proposal over given timeframes for instance 3, 6, and 12 months. (These used to be a part of the self-assessment checklist required for every proposal prior to F8.)\n \nGiven that this project builds upon an initiative already funded in F7 I would have liked to see more details of this throughout the proposal.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A decentralized alternative that entities can use to distribute tokens for projects or themselves and users can claim tokens at low cost.", "experience": "Many years experience in software and scientific research & collaboration.\n\n10+ Years Software Development.Smart Contract & Defi developer.PhD Mathematical Physics, BSc Computer Science.SPOCatalyst 7 funded project - InfinityPlutus pioneer & Atala Prism pioneer (cohort 2)"}