{"id": 396693, "author": "klarkc", "title": "Reward creators for feed activity", "url": "https://cardano.ideascale.com/a/dtd/396693-48088", "category": 26438, "amount": 18000, "description": "Social media influencers and content creators suffers from cancel culture by centralized platforms, when they remove creator revenue.", "f6_no_assessments": 3, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "I don't think your proposed solution is described in a detailed way. The reason is that you haven’t mentioned who will be your target users, as well as the key impacts your project exerts on these people. You have given a brief introduction of your project; however, I think it should be in more detail in terms of its features or how it works. Likewise, the question of this challenge is “What applications will provide the most value for end users in 2022?”. Therefore, you should focus on this question to give a detailed and clear answer to it. Even though some values or good sides for the audience are mentioned in this part, it appears not to be adequate enough to guarantee the effectiveness of your project. But beyond question, I admit that the risk you predicted for your project implementation is accurate, and on top of that, you were capable of coming up with practical solutions to the given issue, the legal aspect. In addition to that, these solutions are explained in a lot of detail, with an illustrative example. Hence, it’s very legible and promises to take effect. Bravo!", "q0r": 4, "q1": "I really don’t want to say this, but to be honest, this section almost blows away all my hopes for the development of this project. The cause is related to your work plan. This is one of the most indispensable contents in this proposal, but sadly, you fail to present the community, not a single one. You should keep in mind that whether a project is small or large-scale, the voters always pay attention to its roadmap, to the fullest extent. Nevertheless, you only announce that you “hope to finish that in less than 3 months”, which means you could not make sure when this project must be entirely completed and what milestones should be reached, as well. My second concern is your budget distribution. I suggest you add more information to the initial infrastructure costs to make it clearer. For instance, you should mention which will be included in these costs, and name them so that the transparency of your requested fund will be increased. The last one is your team members. Well, I know you are the one who will take the biggest responsibility for this project. For this reason, introducing yourself in detail is a prerequisite for the voters to assess the opportunity of the project development. It can be seen that you were not even able to provide your name here. Please supplement extra necessary information to this part, for example, your outstanding accomplishments or your LinkedIn profile link, if at all possible.", "q1r": 2, "q2": "As a whole, you were able to present a perfect picture of how your success will look in the future. The success metrics are put forward with so much information in a nice layout, which helps me easy to understand. Even, you carefully prepare for how you will reach creators and audiences, too. Nevertheless, although many project metrics that are used to measure the influence of the project on the challenge :were given with clarity, you forgot to come up with technical tools for the voters to use and follow these metrics. For instance, you had better explain which tools will be utilized for keeping track of the contracts and transactions built on the platform, or where these metrics will be published publicly on. The tracking tool is of the utmost importance for the community to monitor your project, thus, please publicize it.", "q2r": 4, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "RSS/Atom, with the purpose of assisting producers on social networks in receiving what they deserve, has demonstrated its primary role fairly convincingly. The promise that fans' money would go straight to their favorite creative is extremely novel and unique. Today, it is not feasible to identify the disadvantage of this issue, and I would want to appreciate the proposer for raising this point. Further, the use of ADA has a significant impact on the Cardano ecosystem's long-term development. In particular, if the initiative is successful, Cardano will undoubtedly become more well-known as a result of what the creators disclose on their website. However, the remedies to the risks they forecast remain hazy. I haven't yet comprehended the solution to those problems yet. Perhaps investing more time in research or developing more clear solutions can provide investors with a more realistic picture of the issues that the project will encounter in the future.", "q0r": 4, "q1": "The most important aspect of this part is most likely how the proposer spends the money on the activities. Although it is a little brief, it contains all of the important information and clearly demonstrates the purpose of each precise quantity. However, the idea mentioned by the proposer was not at all clear. The simple announcement of a three-month completion time cannot provide investors and proposers with an overview of the project's implementation process. Instead, the proposer should include precise figures such as how many creators will be participating in this project or how long it will take to complete the initial stage of the project. Furthermore, it appears that having the proposer alone plus a legal counsel would have been too much. The proposer should hire some more staff such as an expenditure manager or a marketing staff to promote the project on social networking sites to make it easier for the creators to reach.", "q1r": 3, "q2": "This is the most creative part that I've seen thus far in this proposal. First, given the project's progress, the proposer outlined the measures required to assess progress. Perhaps it would be preferable if the proposer included particular statistics that make investors more welcome. And the MVP indicated by the proposer is what makes me award this part the nearly highest score. In this situation, the proposer serves as both a creator who attracts ADA from the audience and an audience eager to provide ADA to the creator script addresses. This not only provides the proposer with an overview of what his project is capable of doing and identifies any shortcomings that must be addressed promptly in order to reduce future risks. That's a very new and distinct point of view!", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The core idea of this proposal is decoupling creator revenue from the platform that they distribute the content on. This is definitely not a bad one, however, in order to be able to properly assess the impact of the proposal a lot more details would have been needed. For instance, what platform would be possible to integrate into the RSS-enabled system. If it’s only a combination of self-hosting and IPFS then what would incentives creators to move to a decentralized platform, potentially losing a large part of their current audiences, but most importantly the possibility to gain new followers through the recommendation engines of the big platforms. \n\nDetails about the planned design and marketing of the platform are also missing. Not all creators are tech-savvy, thus a user-friendly interface and onboarding experience are clearly needed. Making an alternative platform is a great start, but the proposal is missing details about plans to attract users to the platform both on the audience and creator side. Why would Project Catalyst fund the writing of code that will just sit in a Github repo? As a voter, I would probably be asking myself that question.\n\nIf implemented in its current form I judge that the impact of this proposal would be minimal on the ecosystem and the adoption of Cardano. \n\nThe idea is promising and I would really like to see a future, more refined, and detailed version of it resubmitted in one of the next funds.", "q0r": 2, "q1": "According to his statements and the Github link provided, the proposers seems to be an experienced developer. However, writing the code is only the start of the vision presented in the project, and not enough details are given to present a clear path on how the rest of the needed elements would take place during this phase of development or the next.\n\nThe budget breakdown is sufficient, given the scope of the project, but I would have liked to see a more detailed implementation plan.\n\nAgain, the idea of the project is very promising, and this version of the proposal doesn’t quite do it justice. Bringing on an astute project manager to the team might be a worthwhile investment for the project.", "q1r": 3, "q2": "Since the proposal focuses on the first part of the project which has as its main objective the writing of code, the progress would be quite easy to follow on Github by Project Catalyst auditors. \n\nA clear list of KPIs, metrics, and concise goals for the definitions of success is provided. However, I would have liked to see a clearer explanation of the tasks that go beyond writing code. \n\nNo roadmap or expected launch date is clearly given, but perhaps the list of features and metrics present in the MVP can act as a rough roadmap.\n\nI would have liked to see the budget section explain why the legal advisory costs would be more than half of the 400 hours of development cited.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "If the audience rewards the creator using his feed activity as a reference, it supports the creator's freedom of expression.", "experience": "I am JavaScript developer for the last 8 years, working mainly with Vue and NodeJS. I started studying Haskell and PureScript last year, now I'm in Plutus Pioneer Program.\nI have made a similar project in other blockchain before: https://github.com/klarkc/ssb-bot-feed"}