{"id": 396874, "author": "drakemonroe", "title": "Layer 2 Advanced Architecture", "url": "https://cardano.ideascale.com/a/dtd/396874-48088", "category": 26438, "amount": 200000, "description": "Cardano NEEDS a cutting edge layer 2 data solution that will handle large volumes of, and high rates of, irregular and complex data.", "f6_no_assessments": 6, "f6_rating": 1.9444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 201, "q0": "Judging by the short description the project falls into dApps and Integration frames pretty well. The style in which it is written however doesn't suit me as I felt that someone is shouting at me in case I even try to think he's idea is not great. As the proposer is going to act as a project manager I would seriously consider hiring external marketing team to cover PR and comms :-)", "q0r": 4, "q1": "It's too short to be assessed and has too little data. Looking at the links provided we find more info, yet while applying for 200k the proposer should put at least some effort here - just out of sheer respect to the community.", "q1r": 3, "q2": "Just as above - the description lacks real info, looking at the links provided we find more info, yet while applying for 200k the proposer should put at least some effort here - just out of sheer respect to the community.", "q2r": 2, "assessor": "z_assessor_1086", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9847, "q0": "This proposal intends to build a System for decentralized AI running on the layer 2 to bring large volumes handling with high rates and complex data, serve the community and charity as a not-for-profit but it seems lack of evidence to show the benchmark workload that the Decentralized AI System could not be solved on the current infrastructure and require super server NVIDIA DGX A100 as a unique solution to impact the problem. I suggest the proposer provides a chart or a statistic about the cost of problem such as the computing capacity, scalability.\n\nThe proposal solves the problem stated but the solution as a whole does not stand out as unique. Its impact will be improved if the proposer justify that the server rack is the best solution to deliver the benefits for Cardano community such as: why DGX A100 is the best choice (workload), why only 7 nodes needed (decentralization),... Meanwhile Cardano encourages decentralization and scalability, this solution seems to cost much and cause centralized risks.\nData center locations is the main challenge that the proposal mentioned but has not given out solutions for them. It'd be better if the proposer give out some more risks and ways to mitigate them such as: all 7 deployed nodes still could not meet the computing workload, centralization risks encountering if depend on only 7 nodes,...\n\nIn generally, I doubt about the impact of this proposal.", "q0r": 3, "q1": "The Author plays role as a Systems Architect and Project Manager but I could not find relevant capacity information for success proposal. The proposer could improve the feasibility by providing reference link to show proof of works and experience instead of only Catalyst Veteran on Discord. \n\nThe proposer is somewhat aware of shortcomings in their composition, so asked Ben Goertzel in training the AI system and IOHK in making the software. Because this is an AI workload, not provide AI services so it's better if the Author consider to fill experience gaps in network and security experts for building and operating your hardware first.\n\nThis proposal just need budget for one NVIDIA DGX-A100 to try building a not-for-profit Decentralized AI System first so it is easily understand if missing breakdown. But I wonder why the Author just care towards it meanwhile there are many server solutions for AI Infrastructure such as: IBM, Dell,... And why we don't try to use another solutions to share workload on global cloud server to see and evaluate workloads required first, the DFINITY Foundation for example? Besides, this required budget is suitable for incorporated technology or blockchain companies and larger projects with competent teams that already have deployed MVPs.\n\nAll things that the proposer needs now is just a hardware but he didn't provide any measurable set of KPIs. I suggest to give out some KPIs such as: completed AI workload server, number of RealFi or Decentralized Social Media Platform running on,...\n\nIt is also missing the marketing strategy to attract Fintech and AI solution enterprises to know your available infrastructure and joining to try workload by what kind of media and advertising campaign.\n\nFinally, I doubt about the feasibility of this proposal and hope it'll be well improved in next funds.", "q1r": 3, "q2": "It's a pity that roadmap are not listed in this proposal for community tracking. I suggest to improve the auditability by modifying milestones and KPIs for the community can monitor how the project is progressing such as: building system completed 1 first month, trying workload for at least a deep learning model in second month,...\n\nI found a point of contact on Discord but it's positive if the proposer sets out an own and accessible channel or other methods for providing updates the proposal progress for the community regularly.\n\nThe proposal's definition of what success means is insufficient and is not derived from their KPIs. The author could improve it by redefine clearly such as: A non-profit decentralized AI system.\n\nIn common, I found it very hard for the community to audit this proposal.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10839, "q0": "The proponents said that they are trying to build a layer 2 scaling solution for cardano. Unfortunately, the proposal doesn’t include enough details on how they intend to go about it. Layer 2 solutions are usually roll ups of the main chain but this proposal doesn’t mention the technology they will use to bring their layer 2 scaling solution to life. Altogether, this proposal is confusing and I suggest to proponents to better explain what they are building. Moreover, there is a scaling challenge which should be a better fit for this proposal.\n", "q0r": 2, "q1": "The proposer is asking for hardware but we don’t know how this is related to a layer 2 scaling solution. The proponents haven’t provided any information regarding a roadmap with timeline, there is not a budget breakdown and there is also no information about the team. I recommend to the proponent to add the missing information in order to increase its chances of being funded.\n", "q1r": 1, "q2": "The proponent has not provided a roadmap with milestones. The metrics and kpis are also missing which makes the project impossible to audit. The proposal is basically empty in this department. The proponent should improve the proposal, by adding a roadmap and strong metrics.\n", "q2r": 1, "assessor": "z_assessor_439", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10915, "q0": "I will not waste the reader’s time by talking too much about this proposal, as the Feasibility and Auditability sections contain only two words: “HARDWARE” and “1 DGX-A100”.\nThe proposer is using buzzwords like “Decentralized AI System” as a solution to the problem of Cardano not having “a cutting edge layer 2 Data solution that will handle large volumes of, and high rates of, irregular and complex data”.\nI personally don’t understand what this means and the Impact section is full of random sentences that try to convince the voter the proposer is somehow in touch with IOHK and the latter is waiting for the proposer to be funded so that they can then collaborate.\nThis is not a serious proposal, as it should be apparent to anyone perusing it. I completely disagree that it effectively addresses the challenge. Score: 1", "q0r": 1, "q1": "The proposer provided no Feasibility information and is asking for 200k USD. This is not a serious proposal so I completely disagree it has a chance of being implemented successfully. Score: 1.", "q1r": 1, "q2": "The proposer provided no Auditability information. This is not a serious proposal so I completely disagree it can be audited by the community. Score: 1.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10950, "q0": "This proposal is obviously a great project that will be of immense benefits to the ecosystem in areas of scalability, increased transaction output and security of the network . The proposal seeks to build a layer 2 side chain infrastructure that takes off and handle some of  large data processing load from mainnet through the deployment of AI Algorithmic protocol. The proposal is definitely aligned with objectives of the campaign objectives as it widens scope use cases of Defi/Refi platforms and other related opportunities and thus leading to more adoption of the network by user and developers alike.", "q0r": 4, "q1": "The proposal is basically seeking fund purchase of an AI Algorithmic data processing infrastructure that is expected to perform this massive complex data processing task. The proposer's profile details were not provided except that the proposer is ardent Cardano enthusiast, active community member who has actually made some relevant consultations and potential partnerships with relevant stakeholders in the ecosystem. From the information provided, it seems likely that the project will be successfully implemented but am not convinced.", "q1r": 3, "q2": "The proposal has not provided any form of information regarding the auditability of this project. It seems that the proposal's success is basically based on the procurement of the proposed hardware infrastructure. In spite of the foregoing, it is unreasonable to present a project of this magnitude and importance without necessary due diligence, plans and roadmaps to be achieved. In conclusion, the proposal has not provided relevant information for proper monitoring and audit of the project.", "q2r": 1, "assessor": "z_assessor_9", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10995, "q0": "The proposal does not make it clear which target problem it is trying to solve, I recommend that the proposer establish an objective and clear problem statement so that it is possible to evaluate the relationship of the proposal with the challenge.\n\nThe proposed solution is an alternative to increase scalability and has nothing to do with the challenge of Dapps & Integrations. Scalability solutions are not among the potential directions set out in the challenge brief for this challenge. I recommend that the proposer submit the proposal in an appropriate challenge, such as the challenge dedicated to F8 scalability solutions:\n\nhttps://cardano.ideascale.com/c/campaigns/26437/stage/stage-assessqa18b9c9/ideas/unspecified\n\n\nThere are no metrics or KPIs that allow measuring the potential for impact.\n", "q0r": 1, "q1": "There is not enough information to assess the expertise of the proposer, there is only a vague mention: \"Systems Architect and Project Manager.\" There are no sources to check the proposer's qualifications.\n\nThere is no plan, roadmap, or milestones, no budget breakdown, so there is no way to assess the feasibility of this proposal.\n\nI recommend adding a detailed plan so that an appropriate assessment can be made.\n", "q1r": 1, "q2": "There are no metrics, no KPIs, no roadmap or any information that allows evaluating the performance of the proposal.\n\nThere is no relationship between the concept presented and this challenge.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A Decentralized AI System as a not-for-profit that will serve the community and charity.", "experience": "Catalyst Veteran. Cardano Wise'rd. I've asked Ben Goertzel to help me train the system and IOHK to make the software mods."}