{"id": 396925, "author": "dvarnas", "title": "ESTATI - real estate investments", "url": "https://cardano.ideascale.com/a/dtd/396925-48088", "category": 26438, "amount": 11000, "description": "How can real estate transactions be facilitated on the blockchain using smart contracts?", "funded": 1, "upvotes": 24483591, "downvotes": 14191632, "votes_result": 10291959, "votes_cast": 92, "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 7283, "q0": "This Dapp fully meets the objectives of the challenge because it intends to bring a very busy and important market - real estate - into the technologies of the Cardano ecosystem, since the objective here is to establish real estate negotiations through smart contracts on the Cardano blockchain. It is also positive that the author intends to carry out various actions through cryptocurrencies and blockchain, such as loans, payment of rents and leasing of real estate in cryptocurrencies. However, as it would still be a very new activity (in fact, I have never heard of any case in the real estate market that used the technologies of the cryptographic world), it is positive that the author (and his team) is aware of starting by giving the first step, which would be the direct sale of properties. In fact, I believe that if this project is financed and developed properly, it can bring many benefits to Cardano, increasing the number of transactions on the blockchain, digital wallets (I don't know if it would increase the number of Ada holders because from what I read, these transactions have been made in USDT). Another positive point here is that the author is aware that the implementation of the activity he proposes is not so simple, due to the fact that some countries still do not allow cryptographic transactions, so he proposes to start where this could be more possible. I believe that with the advancement of legislation in relation to cryptocurrencies (an issue so important that I even constituted a challenge in this fund), these activities could expand to more and more countries, even when this starts to happen in real life and investors realize the various advantages of owning cryptocurrencies and carrying out transactions on the blockchain. However, I identified an issue here that needs to be considered: I think the author of the proposal could have explained more clearly how he intends to bring this technology in a simple and accessible way to the general public, to those who are not yet part of the ecosystem or who may do not know concepts from the cryptographic world other than the famous ones, such as NFT or the existence of Bitcoin. If this issue were better clarified, I have the impression that we would have more confidence in the success of this proposal and how it would exactly achieve the objectives of the proposed challenge. \n", "q0r": 4, "q1": "Unfortunately, in my view, this part of the proposal has a lot to improve. Starting on the project roadmap. The author of the proposal claims that it is difficult to predict in detail what will happen after funding because it depends on external partners. But it gets very complicated for the community to choose to fund a project where we know next to nothing about what will happen next. As hard as this is to predict, the appropriate thing would be for the author to get in touch with his partners (it would also be necessary to present who they would be) and together come up with a roadmap on what would happen in the case of successful funding. It just informs with short sentences what would happen in the 2nd, 3rd and 4th quarter of the year. But this information is extremely superficial and not well explained. For example, in the first time block, “MVP development and testnet launch” would take place. These technical activities are not known to all CAs and Catalyst voters, it would be important for the author to explain them in simple language so that they are accessible to everyone. So, about the script, I feel that a complete reformulation would be necessary, so that we could understand exactly what would happen after the funding. Regarding the financial distribution, it is also very superficial, the author only says that 98% would be for product development and the rest for various fees. But within that 98%, how would the money be divided? The author mentions which activities would compose the development of the product in the auditability, but even so, we do not know which professionals would be involved here, which activities they would perform and so on. As it is presented to us, we cannot get a solid view of how the requested money would be spent. It is necessary for the author to break down much more, dividing the total amount into small parts and justifying the need for each of them. And finally, as far as the author's ability to successfully execute this project is concerned, I believe this is the safest part of this topic. Due to the fact that it has already been financed, it already has a series of activities developed previously, as he mentions in the “it's good to know” part, where we have knowledge of what has been done so far within this project, confidence is transmitted in your job. There is also a short description of who the author is, containing his name, professional occupation and some of his activities. It would be interesting, however, if we had more clarity regarding his connection with Cardano: how does this person relate to our blockchain? Are the technical parts about Cardano performed by someone else on the team, if so, who? Even though it has already been financed at f4, this relationship is not so clear to me. It would be nice if it were better explained. Therefore, on this topic of the proposal, I believe that the explanation of the script and the use of funding need a lot of improvement, with the author's knowledge being the part that most conveys confidence in success. \n", "q1r": 2, "q2": "Here the author mentions which activities would be necessary for the development of the product, but I think it would be important for him to situate who would carry them out and also when they would happen. Knowing what would happen is the basis for monitoring the process, but it is not the only information needed. As it is presented to us, we do not have complete control to verify that what was promised was being fulfilled by those who owe it, at the right time and in the right way. It is also not possible to audit the financial breakdown as it lacks so much detail, as I explained in the previous topic. In the same way, success is described very briefly, we basically know what each component of the project (buyer, seller and broker) would do for the project to be considered successful. It would be interesting if the author detailed the activities of each type of user in greater detail. It would also be positive if a kind of satisfaction survey were carried out, for example, to find out how the experience of each of these users was: are they satisfied with this project? Interested in learning more about the cryptographic world? Did they hear about Cardano specifically? As I understand it, the smart contracts would be on our blockchain, but the currency used would not be Ada, so I think to what extent users would have direct contact with Cardano, in order to understand its differentials and advantages. I suggest that the author promote this type of research, gathering the data and bringing it to the rest of the community. In addition to user satisfaction, monitoring could be carried out on the expansion of the project, that is: the author says he intends to start these activities in the United Arab Emirates and then expand it to other countries. Did this really happen? On what scale was the real estate market reached by this proposal, would this project be an incentive for this alternative way of negotiating real estate? Unfortunately, despite having basic information on auditability, I felt a lack of greater coverage in relation to how we can track the results, both on a micro (users) and macro scale (in which countries would the activity be happening and what impact for the sector's investors). \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 343, "q0": "We have that the idea of the proposal is to create a solution for the real estate market with the use of smart contracts, being then a project that fits the goals of the challenge in question. Furthermore, the success of the project has the ability, in the long term, to bring greater visibility to the Cardano ecosystem. We have that the proposal is a continuation of another project that was financed in a previous fund, which is a good indication for this current request.\n\nAdditionally, the amount being requested here of $11,000 is consistent with the guidelines in the challenge description and the size of the project to date.", "q0r": 5, "q1": "Despite the positive points mentioned above, we do not have a very precise breakdown of how the real estate trading platform will be built. In the section that should indicate the plan to deliver the product, we noticed an absence of information and there is only a very 'high level' explanation of what should be done. We have that the simple declaration that the product will be developed in Q2/Q3 and commercialized in Q3/Q4 did not bring us details. In fact, it would also be interesting if a strategy aimed at marketing the project existed.\n\nWe realize that a good part of the feasibility description is made up of goals that have been achieved previously, which is an important detail, but should not take up most of the description. Through the link provided to the project website, we obtained information to contact the initiative, such as the e-mail: hello@estati.ae. But it would be interesting to have the curricula of the professionals involved in the description of the proposal.", "q1r": 2, "q2": "The ways described for verifying the success of the project were not directly put here, it seems that we see more of an explanation of the main product development stages. In this section, it would be nicer to establish some objectives to be met when the previous steps were actually completed. We could have, for example, some goals to be tested after MVP validation, such as the number of real estate transactions being carried out on the platform, or the perceived engagement on social networks in relation to this new way of carrying out real estate transactions using blockchain technology. .\n\nIt is worth noting that despite the lack of information at some points in this proposal, the main objective of the idea is to be promising. In fact, a simpler solution is being offered for a very bureaucratic market, and funding for the foundations of this idea has also been successfully financed in the past.", "q2r": 2, "assessor": "z_assessor_1146", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3780, "q0": "For the most part, I can comprehend the primary functions of your dApp, Estati, but perhaps you forget to mention the important factor in your proposed solution here, the target audience. More importantly, you also don’t talk about the influences or the benefits your project will bring on the users. If you don’t let them acknowledge or make sure of the benefits that participants will receive, how can they be ready to join your platform, right? Plus, although your key metric links with one of the most vital ones in the challenge, which is the application transaction (an important output), you should mention the objective of the challenge: attracting users to the platform and result in new, viable applications built on top of Cardano. One positive thing that I want to say is that the solution to your predicted risk (legal problem) appears to be realistic and applicable.", "q0r": 4, "q1": "As you mentioned before, the requested fund in USD is $11,000; nonetheless, your answer to the request called “a detailed budget breakdown” is not detailed enough to persuade fundraisers, in my opinion. You simply wrote that 98% of the budget is for product development, and 2% for admin fees (hosting, domains, etc.). Though $11,000 is not a way too high an amount, you should allocate money into certain expenditures (with specific numbers, not via percentage). For example, ask yourself how much you will need to develop the products, to host events, or pay staff salaries, then give each portfolio a real number. What’s more, providing fundraisers carefully written profiles of your core colleagues, consisting of their outstanding accomplishments. And even better, you could attach their LinkedIn profiles in this proposal so that investors can know more about your team members.", "q1r": 4, "q2": "I would like to ask directly, “Which means will you use to measure the progress of your dApp?” From the product development content that you composed, I wonder where the measurement is, honestly. To the best of my knowledge, my suggestion here is to utilize advanced technical tools to display the traffic amount on your website or keep abreast of the latest news of your project on several social platforms like Twitter. That’s the basic tip I want to share. Concerning the definition of your success, I frankly respect your thinking of a web app with a nice layout for users to transact well because this is the first and foremost impression people will have after clicking into your website.", "q2r": 4, "assessor": "z_assessor_1675", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4440, "q0": "putting real estate transactions on the Cardano Blockchain using smart contracts is a good idea. The real estate market is extremely developing in many countries around the world. If this idea is successful, it will attract a large number of users to join the Cardano ecosystem. This is also what the ecosystem wants to achieve. Your proposal also outlines the solution and how it addresses the challenge, as well as the possible risks. Overall everything is adequate. The legal risk you mentioned in the proposal is an inevitable one. I appreciate your preparation.", "q0r": 5, "q1": "although it is not possible to give a detailed roadmap, you have mentioned a high-level roadmap. I am very impressed with what you have done at Fund4. Indeed, this will be a good foundation for the next development steps of the project. The first transactions are manually processed in USDT, contacts with brokers and Blockchain companies have been established, the initial structure of a smart contract has been determined. These are great results. Detailed budget also if clear 98% for product development and 2% for administrative fees. However, it will be clearer if you specifically specify what product development includes and how much it costs for each part. However with what you have done, I appreciate the persuasiveness of this project. You also introduced the team members of the project.", "q1r": 5, "q2": "you have  presented the products that the project developed as well as described the success of the project. However, it is not yet specific to know how and to what extent the project will progress. Finally, after the project is successful, what benefits will it bring to the Cardano ecosystem? It would be better if you mentioned these issues in detail.", "q2r": 4, "assessor": "z_assessor_1725", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8561, "q0": "Engaging with the real-estate market could be very beneficial for the Cardano ecosystem, however, in its current form, the proposal lacks details or an actual implementation plan and is more of an overview of what could be potentially achieved.\nSince the idea is promising I would like to suggest a resubmitted version of this proposal, featuring a more focused approach, and a concrete plan on how exactly would the described goals be implemented.\n\nAs an example: smart contracts are described in the proposal as a way of closing real estate deals, but there is no clear description on how these would work. Would there be an NFT assigned to each property, what would that NFT contain? And so on. The project is promising and a more detailed version could perhaps be presented in a future fund.\n\nAs a side note: I have visited the project's website and even though the project was funded in Fund 4 no mention of the possibility of transacting in ADA or of the Cardano blockchain is made. The only cryptocurrency mentioned is BTC. Since this is about developing a project on Cardano and its impact on the ecosystem as a whole I have subtracted a further point from the final “Impact” grade.", "q0r": 2, "q1": "Difficulties with legislation in various jurisdictions regarding crypto real estate transactions are mentioned as being the biggest risk, but in the current form of the proposal there is no detailed plan on how these would be addressed and tackled. The proposers do mention an intention of obtaining a crypto start-up license in one particular jurisdiction, but even in that case it’s not mentioned what the license would enable them to do and if it’s indeed related to the project.\n\nThe team seems to be experienced with crypto, but from the credentials given their experiences (at least that of the team lead) are related to PoW mining and hardware. Not enough effort is made to explain how that experience might translate into this clearly different field and not enough background, or a link, is given about the mentioned smart contract partner.", "q1r": 2, "q2": "The breakdown of the budget is extremely minimal and is not sufficient to accurately track and audit the progress of the proposal.\nThe audibility metrics and KPIs that are present in the proposal in its current form are not sufficiently clear or detailed and mostly cover a minimally detailed overview of the envisioned roadmap.\nNeither an exact timeframe for execution nor an expected launch date is mentioned in the proposal.\nAgain, I would suggest including a clearer description of these and how/what they would track and present to the community, in case further funding is sought.", "q2r": 2, "assessor": "z_assessor_681", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "All-in-one Interface to facilitate real estate transactions (buy and sell) using smart contracts on Cardano Blockchain", "experience": "Donatas Varnas - Entrepreneur, Real Estate, +6 years. Co-founder at E611 Group - we build and operate bitcoin mining data centers in the UAE and sell equipment.\nCTO - ex-2 startup CTO, +9 years. Part-time.\nClearContracts.io - Contract development partner\nFund 4 winner"}