{"id": 397053, "author": "vareca", "title": "Crowdfunding with inbuilt mediation", "url": "https://cardano.ideascale.com/a/dtd/397053-48088", "category": 26438, "amount": 10000, "description": "Crowdfunding platforms do not provide a inbuilt system assuring performance matches expectations resulting in no-delivery no-payment crime", "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is based on the idea of ​​a crowdfunding platform where people can resolve conflicts and have their reputation increasingly improved, while a mediator checks that smart contract entries are being made as promised. There is a project very similar to this one that has already been funded on Catalyst, Win Win, I will leave here the links of some proposals linked to this project: https://cardano.ideascale.com/c/idea/384436 / https:/ /cardano.ideascale.com/c/idea/381595 / https://cardano.ideascale.com/c/idea/384855 / https://cardano.ideascale.com/c/idea/384838https://cardano.ideascale .com/c/idea/368353. In this case, from what I understand, this proposal aims more at auditing smart contracts than resolving conflicts between two people, in this case, the proposals differ. From what has been following Cardano's projects, the Win Win platform has been successful in its activities and this one can be another positive example of how mediation, based on our blockchain, can bring positive results both for users and for Cardano , as it would increase the flow of smart contracts minted on the blockchain, for example. This type of proposal goes beyond technique and represents practical solutions for people's daily lives, while still using the technologies of our ecosystem, thus achieving the objectives of the challenge. I found it particularly interesting when the author explains the functionality of the project through the two sheets that will be coined GR (NOTAS) and SU (SUPPORTS) and how the mediators would act in this process. It's a very different idea, but the direct way it is explained makes it easy for outsiders to understand, that is, I believe that both CAs and voters will be able to understand well the nature and objectives of this proposal. To reinforce the understanding, he also explains how the proposal would work in each of the phases, through examples. As I said before, I think so, it is a high value proposition and one that can greatly benefit our ecosystem if financed. The author also recognizes possible challenges and difficulties to be faced during the execution of the project, which is always positive, as it is better to be safe than sorry, that is, to think about how to solve possible problems instead of just ignoring them. \n", "q0r": 5, "q1": "This part of the proposal is good, but there are things to improve. Let's start by talking about what I thought was the best here: the explanation of the script. The authors explain things through phases. Each phase is subdivided into activities, and each activity is situated in a month and year. In this way, we have a very solid view of what is to come and are able to understand the entire process very accurately. Regarding this part, I believe there is nothing to punctuate, it is perfect. However, the following two parts could be more detailed. For example, project financing. The asking amount is very reasonable (10k), for proposals of this size and complexity, it is a very fair funding, in my opinion. We know how each part of the money will be used, part that will make up the salaries of the professionals involved and other things, such as marketing for example. These other things could be better explained. What marketing campaign will the team use to publicize this project? It's a project that will sustain itself based on the users, so if people don't know and embrace it willingly, I don't think it's going to have that much chance of succeeding. In other words, marketing is always important, but in this proposal it is paramount. Therefore, I would like to understand how this part of the project would take place in more detail, how social networks would be used, etc. The authors claim that it will take 3k for maintenance and management fees, but I would like to understand what those fees are. Finally, speaking of the team, I think this part was somewhat superficial, we do know who the people are who make up the team and what each of them will do, but I would like more detail about their CVs and some way to prove the That being said, maybe your contacts on discord or profiles on linkedin. Therefore, the proposal is not bad in this part, but it needs to be better explored. \n", "q1r": 4, "q2": "This is the shortest part of the proposal, but I don't think it's bad/insufficient given the data provided throughout the proposal. Here, they talk about quantitative and qualitative data, that is, how many students expect to be enrolled on the platform over time, and also that these students get to know and enter the Cardano community as they learn and understand about us. Such data are objective ways to measure results, but we also have a way to follow the process based on the information provided in the previous topic. We know which tasks need to be performed and which time periods; with this it is possible to monitor if what was promised is being fulfilled in the right way and at the right time. In other words, yes, the proposal is auditable, the authors provide enough information for us to do this satisfactorily, what we need is to organize ourselves and establish a bridge between the community and the team. Maybe some meetings, or the publication of partial results through social networks. It is necessary for the community to act in favor of constant and continuous monitoring. In this way, I will give the maximum score, because although they do not focus so much on auditability, the level of detail of the proposal as a whole allows this to be done in a safe way. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal in question is to create an optimized crowdfunding system. This way of raising funds has become quite popular in recent years, having been responsible for the launch of several successful projects, such as the game Hollow Knight, which became a massive success. But it is also a fact that clearer and more trackable ways can be established to observe the progress of projects on these platforms. And so we see here that the project is very insightful, in proposing the use of Cardano technologies, such as smart contracts, to promote a fairer way of carrying out the distribution of funds.\n\nMany project concepts converge with ideals propagated by the Cardano ecosystem, to make existing processes fairer and more transparent. With this, we see that the success of the project will bring more visibility to good ideas that need crowdfunding, as well as more visibility to Cardano. The amount being requested is consistent with the current state of the project and the steps that are planned to be carried out.", "q0r": 5, "q1": "The organization of the project's feasibility stages is very well done, and we noticed that the indication of several implementations consistent with the innovation that the project aims to provide. For example, using an algorithm to check the bidder's reputation is a great idea, and certainly one of the concepts that increase the project's viability. Another very positive point is the gradual release of funds, through a mediator, who will also be rewarded in the future. This already mitigates the problem existing in other current platforms, which are often able to raise the necessary funds, but without a guarantee of continuity. We see that the proposal was able to make good use of the blockchain advantages to create a fairer process, through decentralization.\n\nIn addition to all this, one of the biggest differentials would be the total harmony between the budget being requested ($10,000) and what is desired to be done at that moment, in addition to having clearly defined the actions that will be taken at different times this and next year. We see that this amount is being well distributed for the implementation of the project in schools, in a pilot phase. And in the budget breakdown, we can see that a considerable amount of capital ($4,000) is going to disclosure, which makes a lot of sense at an early stage of implementation and validation. With this strategy, we realized that before the platform is effectively launched in a broader scope, several risks will have been mitigated and adjustments will have been made. Regarding the project team, we noticed that the professionals involved have experience in development (a fundamental attribute for this project) but also in the area of ​​marketing and project management. We also noticed that Gabriele's github address was made available.", "q1r": 5, "q2": "Regarding the established ways to audit the project's progress, one of the positive points was the division of tasks into stages 1 and 2. This facilitates the understanding of the achievements of each stage. We even see that numerical parameters have been established that help in this monitoring, in this case, the number of students registered in stages 1 and 2. In addition, one of the ways to understand the success of the project is to seek feedback on the usability of the platform, and In this context, we observe that videos are being produced to teach how to use the platform. It would also be interesting to periodically publish results on how intuitive the platform seems to the students.\n\nIn general, we can also say that the team understands very well what the final objective of this platform should be, based on the ideas that were exposed about the perception of success of the platform. We see that this is a very realistic proposal and that it appears to have a good chance of success, in part also due to its organization.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal tries to create a crowdfunding platform with an in-built KPI (Key Performance Index) through mediation/conflict resolution and participants credibility assessment algorithm to enhance all participants' reliability. I found the ideas very interesting and can add value to the Cardano ecosystem. The proposal also has a solid plan of how they will implement those ambitions through clear milestones and a roadmap. The team also provides potential risks from marketing to the legal aspects, however, with the thorough plan the team have I’m sure they can sort out those challenges.", "q0r": 5, "q1": "The proposal has a roadmap and clear milestones that consisted of stage one, stage two, and stage three. The team provides budget information and a reasonable breakdown of how they will use the proposed budget. However, I found the budget is very small, especially on the development that only cost 1K/year each for the backend and frontend, are those money enough for remuneration? is there any server cost? I have a concern there will be an unexpected cost besides the written one in the proposal. The team gives concise information on the background of each team member. However, it would be better if they also provide a LinkedIn profile or personal GitHub account so the community can easily verify the abilities that the team member has.", "q1r": 5, "q2": "Metrics/KPIs to measure success are concise and clearly defined as the number of students registered on stage 1 and stage 2. However, some items can be elaborate further, for example, how much learning material in video format gonna be produced? or is there any measurable way to determine participants' knowledge after using the platform? How many project discussion on social to be considered successful (and what constitute discussion)? etc.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This section  is extremely detailed, to be honest! The most interesting content to me is your project and dApp’s features. You have written this part in so much detail and it helps me to comprehend your proposed solution very much. Other than that, you also give me a deeper view into your platform when taking realistic examples of how your dApp will operate, which are corresponding to each phase of the development. Your target users are also mentioned clearly and they appear to be diverse, which will be likely to increase the chance of attracting Cardano adopters. By the way, your key metrics seem to match with the requirements of the challenge, but I think you could put more words into this content to persuade how successfully your project could handle the challenge. However, I don’t think the paragraph starting with “When signing into the platform members receive a reliability score of 60” and ending with “Additionally the proposer’s set collateral amount indicates his/her commitment” locates correctly in the second request of this Impact section as this paragraph appears to describe the way your dApp operates. If I’m right, please fix this. Finally, my biggest concern here is your predicted hurdles. After reading over and over again, I’m still confused whether some contents you presented are the foreseen risks or the solutions. They are pretty unclear, therefore, I find it hard to assess this part, actually. Hope you can make them clearer so that I can give you some advice if something goes wrong.", "q0r": 4, "q1": "First and  foremost, the work plan you provided in this proposal is very explicit. Three stages of your project progress are presented clearly with adequate time frames to reach the key given milestones, in particular, you attach every goal to a certain month, which is the period of time that it will be achieved. Secondly, your budget breakdown is kinda transparent and sticks to the plan for the first and second stage. However, there’s one point in this list I can’t figure out, the marketing fee. The cost allocation list includes two marketing fees, which are expressed in the third and last sentence. I wonder how it could be two fees for the same strategy? PLease explain more about this content so that every voter could understand how your requested fund will be consumed transparently. The final concern of mine in this section is the details of your team members. According to the written introduction of your working team, I am not sure it’s detailed enough to convince the community that your team is qualified for the project’s development. When some of your staff has working experience in primary occupation in a few years (namely 2+ and 3+), it would be better if you can describe more about their highlighted qualifications, relevant backgrounds and remarkable achievements with an aim of proving they’re eligible for helping this project grow more. The same goes for other members. Especially, it will be the best bet if you can show the community their LinkedIn profiles to demonstrate everything you have presented in this part.", "q1r": 4, "q2": "According to this auditability section, you put forward many methods your team will apply in order to let the community follow the development of your project. I really love the specific numbers that you presented in this part which are relied on as a success criteria. Sadly, on the subject of technique, your team hasn’t determined which measurement tools you will use to publish your videos/training material or register statistics on for each phase of the project. Besides, irrefutably, you manage to come up with some success metrics that are close to your project’s initial objectives. But I think it could be more detailed, such as, instead of mentioning that “increasing involvement in projects discussion on socials”, you had better replace the word “increasing” by a specific number so that it’ll be easier to realize how many people entering the projects discussion on socials will be considered a success factor for your team.", "q2r": 4, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A crowdfunding platform with in-built KPI to enable mediation functionality - reliability attribute is set dynamically for each participant.", "experience": "Mechatronics engineer, 10+ y entrepreneur experience, Plutus PP graduate, green-fields start-ups in China and Japan in plastics processing and manufacturing sectors. https://github.com/GabriIT?tab=repositories"}