{"id": 397245, "author": "josec", "title": "AI Career Mentor DApp", "url": "https://cardano.ideascale.com/a/dtd/397245-48088", "category": 26438, "amount": 25000, "description": "Students who had a mentor are more likely to have aspired to go to college and to be in college now. 76% vs Students who had no mentor 56%", "f6_no_assessments": 6, "f6_rating": 3.2777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "The project tries to provide AI mentoring as an on-demand service, and deliver a real-life pathway for the students to choose the right career path. The project starts with 9-graders until graduate with their diploma and a full set of skills and assets recorded in their DID. The proposal has meaningful ideas but lacks details on the plan of how they will achieve the goals and made me doubt they can execute seamlessly. The proposal only stated they rely on foundation to make sure the product is free and does not give meaningful potential risks that they may face. They can add potential risks such as the AI doesn’t give useful feedback to the students, or the foundation may run out of funds.", "q0r": 3, "q1": "The proposal gives some milestones and a rough timeline but is not sufficiently details. For example, the stated deliverable is not given a specific timeframe. It can be better if they provide something like deliverable 1 in the first two months, deliverable 2 on the following month, and deliverable 3 on the following month, etc. The proposal gives budget information but some items are not broken down enough. For example, how much of the budget on Deliverable #1 goes to the developer remuneration? Since AI training can take a long time are they gonna used a cloud service (AWS, GCP, Azure, etc)? Or are the infrastructure cost gonna be borne on the developer? The proposal provides each team member with their respective position on the socialab foundation and also a LinkedIn profile. However, it would be better if they also give concise information of their background and experience in the proposal so the community has a big picture of who is the proposer.", "q1r": 3, "q2": "Metrics for success are defined but not details enough. For example, the proposal stated they have a target of 50 students interacting with the AI after three months, what compromise of interacting? is it user signup or daily active user? What percentage of the churn rate (people leaving the product)? How long does the user spend on the apps? The proposer also can add a survey to the user to know how much users like the product.", "q2r": 3, "assessor": "z_assessor_1342", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I like very much the problem statement, mentoring for sure is a key component to success of a young growing mind. If done well an app certainly could help fill some of the gaps of mentorship, developing an app certainly goes hand in hand with the problem statement.\nIt was not clear if the DID functionality being developed would be part of the free part of the app or worked separately as an add on service, would be nice to clarify that as part of the proposal.\nMany of the skill sets being identified are for sure needed for a successful job candidate, but it was not clear how the app AI would teach those / ensure they are taught. Possible improvement would be to list out use cases and examples giving the AI’s feedback and how that would help the achievement of the goal of the use case.\nWith the world being more connected, a possible enhancement might be to clarify for the consultancy route, maybe that was already part of the plan, but proposal seemed to suggest that the only path to success was to get a job with an employer.\nI very much like the app idea, there is always the need for good guidance in all our lives key decisions. ", "q0r": 4, "q1": "The Team members identified seem to be more from the management side, the proposal would be greatly enhanced if members developing the code and their experience in working with the Cardano ecosystem were included, without such confidence in success is low.\nThe proposal would greatly benefit from more detailing of each deliverable and how and by who it will be achieved, currently only the key milestones are listed without detail, identifying who was working at each stage with further breakdown of the key components would greatly enhance the proposal and chance of success.", "q1r": 2, "q2": "KPI is established but broad, the proposal would much improve with drill down of auditability. \nThe KPI of the project would be better audited if for example the project was to publish a weekly or a biweekly progress PowerPoint, this would greatly add to the auditability KPI listed, as you may only realize the goal was not achieved / achievable till the end.\nWith current level of input on auditability confidence in success is low.", "q2r": 2, "assessor": "z_assessor_1395", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "When it comes to the introduction of your proposed solution, I want to say that you manage to focus on students, especially seniors like 9th graders, and employers as well as mentioning exactly what they will receive from using your platform. However, perhaps you forget to give a detail of how this dApp will work and function. This is undoubtedly an indispensable content which the voters and community will need to be informed about. By the way, your project is also expected to solve the shortcomings of the traditional educational system and improve the required skill sets for students, which aligns with the application output of the challenge. Nonetheless, in terms of the foreseen challenges in the project progress, one thing that I don’t comprehend well is the “Emma”. What is it? You don’t mention anything pertaining to Emma earlier, so I can’t understand what it is. Moreover, the hurdle here is unclear because I couldn’t find out which sentence specifies the difficulty of project implementation. Thus, please explain more about things that I have suggested.", "q0r": 3, "q1": "Well, i regret to say that this proposal is missing the most important factor, a detailed roadmap. Yes, you did present a plan or the project but it’s very meager. I recommend you shouldn’t put it shortly like “success in 3 months” or “success in 12 months” because these numbers are too general and the community can’t capture the whole timeline of your project. For example, you had better show a complete list of milestones accompanied by certain activities and periods of time to achieve, such as in which month, which quarter of the year. Moreover, although I can check your team members’ profile via the LinkedIn link you provided, a better option is that you should introduce more about their working experiences and relevant credentials as a well founded evidence to prove that they are totally qualified for the advance of the project. One more point that I wonder is whether the salary for a professional developer is included in the requested fund or not. If the answer is yes, please distribute this content into a corresponding portfolio so that the proposal will be more explicit. And if not, please annotate some words for this content in order to avoid misunderstanding.", "q1r": 3, "q2": "The measurement method you suggested is relatively realistic and viable, to be honest. Making scheduled weekly calls with students to test the AI and gather feedback from them promises to be effective for upgrading your dApp. But apart from that, on the technical side, I advise you to come up with a tracking tool to let the community know that after three months, you will have 50 students interacting with the AI as proclaimed because this can help you build solid trust from them and also as an effective way to attract more students utilizing your dApp. Above all, I truthfully respect your thinking of a successful project, but with one single sentence like that, I am afraid of the trust you will gain from the voters owing to the lack of explanation about it. Apparently, a successful product is always associated with high sales or turnover. Similarly, a successful dApp is also accompanied by a large number of users. Hence, I suggest you think of a certain number of students who will access your dApp and utilize your AI for their career orientation and other purposes so that when you reach that number, for example 50,000 students, it proves that your project is finished with flying colors.", "q2r": 3, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The team suggested that the solution to reduce dropout rates across countries is to provide AI mentoring services to help students find their own strengths and shape their future careers. The challenges are aimed at charting the path and providing the necessary soft skills that students need to be able to rely on to find a good job and realize their own dreams. . But it would be greater if the author could give examples of each skill that employers often ask for as well as data on students who have succeeded or have followed their aspirations. The challenge for the project is that most students often drop out of school for financial reasons and the solution is to develop the Emma model, but a minus point is that the features and methods are not clearly stated which is how this model works.", "q0r": 3, "q1": "It is clearly stated that the members will participate in the project with references to LinkedIn profiles based on that experience and skills may be confirmed, but sadly, the roles and hours assigned for each person have not been given. . A commendable point is that the writer details the budget to be allocated to which categories. For instance, How much will employees be paid and for how many months? In addition, the timeline and the tasks that will be implemented corresponding to each timeline are clearly stated, but the team has not proposed any evidence or links to determine the feasibility and increase the reliability of the product, how do they determine that the task is certain to succeed within the allotted time?", "q1r": 3, "q2": "The author explains in detail about the progress of the project such as Scheduled weekly calls with students or pre-planned meetings with students. Besides that, the expected kpis are also given, etc. However, from my perspective, the proposal should have a more detailed description of the work as well as the activities to be done in the process of implementation. Accompanying that is a prediction of the time when the achievement will be achieved. Nevertheless, the author does not provide any path or risk based on which the community can evaluate and track the project progress.", "q2r": 3, "assessor": "z_assessor_1717", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The main purpose of the project is to provide AI consulting services as an on-demand service and deliver a real-life pathway for the students to choose the right career path. The required budget is $25K, basically, the proposed team that meets the requirements to be able to receive this level of funding are smaller teams (4-5 people) with proven competence, relevant experience, and technical skills with sketches /whitepaper detailing how they would go about to launch their proposal. However, the proposer has not provided us with how this project works, it is not clear how to integrate AI into mentoring because AI is a very broad term. The basic idea is great, reducing dropout rates across countries and providing job opportunities for future students, however, I haven't seen the similarity between the proposal and the Challenge KPIs is dApps and quality integrations to increase Cardano utility and adoption. Compared to the KPIs outlined in the proposal, it is more similar to the Challenge Nation Building Apps's KPIs. Risks and mitigations are also clearly presented.", "q0r": 3, "q1": "The proposer presented a project development roadmap full of timelines, key tasks and goals to be accomplished, and they also had a plan to implement an MVP for AI. The team members have excellent qualifications, deep experience in the fields of education and mentoring, and successful startup efforts, which can be verified by the Linkedin profiles of their organization and the main member in the project, the organization's social networking. However, at this time I have not seen any information about the member as the developer of the project, they still do not have an advanced development team on the project, which means they temporarily can't provide a plan on DID integration yet. The good news is that their project is already connected to AtalaPRISM and can rely on AtalaPRISM's advice, and they are also actively looking for the right developer for their team. As for the budget, the information is basically quite complete including the items in the project and the budget allocated for each item, but I still have not seen the budget to pay for recruiting a developer as they mentioned.", "q1r": 4, "q2": "In this section, they have done a great job in providing us with two pieces of information needed to be able to measure the progress of the project. The first is a tool/environment for those interested in the project to access information on project progress (GitHub, Facebook, Instagram). The second is the outline of success or post-project KPIs that include specific indicators, they also see user experience as a KPI to be able to assess the quality of the project, which is rare in other projects. Overall, the auditability of the project is completely easy for the community.", "q2r": 5, "assessor": "z_assessor_1724", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Mentoring is an important aspect either in career development or in education, which hasn't been addressed due to lack of resources in terms of personnel availability and relevant experience. AI can be the best way to address the issue at-least at the initial stage. The proposal is to develop a digital mentor{Emma} to guide a student from grade 9 to acquire necessary skills. This model is not self sustainable, hence requires an external funding, since a grade 9 student may not be able to afford the services. However tie-ups with school or governments may make the project sustainable in the long run. The model can also generate funding funds from the beneficiaries post employment. But this app will be most beneficial and aligned with Cardano vision if it is freely available to students.", "q0r": 5, "q1": "The experience of the 6 member team is sufficiently good. The development of a well designed AI system does take time, thus timeline projected is appropriate. However there is a lack inclusion of Human element in the process of designing the product. This is an important as the complete testing and accuracy of service and also the success of the service only be judged by accomplishments of the students using it. Till then there is a risk of an unrefined AI susceptible to misjudgement and hence misguiding the student. Also AI needs a lot of data which needs to be fed in to refine the service, there is no mention of what type of data will be utilized(human mentor's input or any past documented input) and the source of data; if it is \"refine as we progress\" model, then a human-element does need to be included until the required refinement is achieved.", "q1r": 4, "q2": "The time line and budget breakdown can be used as auditability parameters, as the measurement of success of the project can only be made in the long run. At present the success can be measured using monthly feedback from student users and their human-mentors. The number of students interacting with AI over 12 months could have been set as an additional parameter by including it in Fund8. 50student in 3months, but it is acceptable for proposed timeline.", "q2r": 3, "assessor": "z_assessor_1748", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "While we are aware that technology alone cannot solve all-purpose findings. AI can guide students at scale and prepare them for the future.", "experience": "The team holds +50 years of combined experience in startup, corporate relationships, development programs, education, mentoring, and guiding youth to a successful career."}