{"id": 397299, "author": "lifttrick", "title": "Integrate Assets & Debt into ADA", "url": "https://cardano.ideascale.com/a/dtd/397299-48088", "category": 26438, "amount": 100000, "description": "The problem I see facing crypto is that its struggling to integrate Assets & Debt into the blockchain.\nThere is an enormous market for this.", "f6_no_assessments": 4, "f6_rating": 2.3333333333333335, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=30814"], "media": [], "f6_assessments": [{"id": 2088, "q0": "The proposer correctly identifies an opportunity in the sense that there is a significant market potential for integrating real-life assets and liabilities into the blockchain. Therefore the solution proposed is to create a new token, integrate these assets and reap the benefits. \n\nThe idea is certainly tempting, however (1) the level of complexity of the real world (different legal systems and ways of enforcing them, entrenched ways of doing business, inertia of authorities and risk aversion towards solutions that shift the power balance too much, etc) and (2) the fact that the proposal itself is very vague, broad and without many details behind it makes me believe that the time is not right for it, at least not in this shape. The topic is extremely exciting but it requires a more applied, pin-pointed solution to have any chance of success. \n\nI wish the proposer good luck with future iterations of the project!", "q0r": 2, "q1": "Forgive me for being blunt, but the level of detail regarding how the project would work is simply zero, and I don’t take this lightly saying it so. In a nutshell the plan is (1) develop a token with 1 billion … tokens, (2) ICO half of them to the market, (3) integrate real assets into it, (4) success!. \n\nTo the proposer’s defense (who has experience in data management), he does mention down the line that an initial step is starting our own mortgage platform for a small town, but it is not in itself credible information that is visible throughout the proposal, merely a recognition that starting small is indeed a necessity, however not well enough put into practice. \n\nThe budget is slightly explained, but not by much. Just as an example, 60% of it would go towards eco-system development, and no further details are offered. \n\nAgain, I wish the proposer good luck with future iterations of the project!", "q1r": 1, "q2": "Again sad to see that the auditability part of the project, although completed, is completely unrelatable and cannot be used as a reference point for judging how such a project would be made transparent. Given the lack of details regarding the implementation, It is also impossible for me to offer constructive feedback regarding this point since auditability is so project-specific and you need a really good overview of the project before knowing what kind of reporting systems to put in place. \n\nAgain, I wish the proposer good luck with future iterations of the project!", "q2r": 1, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3784, "q0": "To put it in a nutshell, your proposal doesn’t meet the requirements of the challenge. Upon introducing a project which aims to integrate the Assets & Debt economy into the blockchain, the points you need to concentrate on here are its functions, and target audience associated with their benefits. Your target fields of the project are land, houses, apartments and industry buildings, so you also need to mention who will be aimed at, for example, they are housing brokers, normal residents, wealthy people, or real estate companies. Name them! Secondly, no detailed ideas of how your solution will solve the challenge are written in this part. You only say that your project will help grow Cardano more than any other sector in the ecosystem, but forget to explain how it will help develop. Due to the information deficiency of this problem, there is a great likelihood that your project will have less potential than others. Finally, I can find out the predicted risk you have presented but no particular solutions. You know, when you know which hurdles you can encounter but you couldn’t find a viable solution to them, it means that your proficiency in the project is poor. Therefore, please supplement the answer to the risk you have foreseen so as to deliver this project successfully.", "q0r": 2, "q1": "It is really disappointing! No detailed timeline and budget allocation for the project! The request here is to give a detailed plan and timeline for delivering the solution; nevertheless, your milestones have no time-framed schedule. At least, you ought to show the voters when you will create tokens and integrate house, land and buildings value into blockchain using de-fi so that they will acknowledge and supervise your project progress. Over and above, in the campaign brief of the challenge, it is stated apparently that “for people with the relevant background but without a full team or completed whitepaper detailing the solution, the project ought to be considered as a research stage project and budgets should be less than $10,000”. However, you will conduct this project by yourself, while your requested budget is up to $100000, an extremely prohibitive number. Therefore, the required budget here is unacceptable, and I hope you could think carefully one more time about your needed budget, or you can recruit or invite more members to work for this project together for funding approval.", "q1r": 2, "q2": "To put it simply, you showed an overall KPI of the project without a particular tool to measure them. It goes without saying that the community is hard to keep track of your dApp if they don’t have any tools to utilize. As an example, you had better put forward a tracking tool to prove that “De-Fi Launch Initial Coin Offering 50% of total tokens will be sold”, you are likely to build trust for the community. Additionally, “This could be in the billions if not trillions” I sincerely want to suggest you not declare general information like that. How much is “billions”? A specific number of Mortgages Debt and Assets will be crucial for the voters to review whether your project is successful or not. For instance, you can raise a certain number like 1 billions, and when you exceed this quantity, it proves obviously that your project succeeded tremendously.", "q2r": 3, "assessor": "z_assessor_1675", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4444, "q0": "based on the problem you presented, your idea is very helpful for Cardano. However, you should clearly explain your proposed solution and indicate in what areas and aspects it meets the challenge. Certainly each project will help Cardano grow, but you'd better mention specifically how development. In addition, you should consider the risks that the project may face, because any project when underway will have risks and challenges. In general, the information you mentioned is not detailed and specific. Providing more information will help investors see the reality and practicality of the project. One plus point is that you've made a \"Bank Systems Using People\" proposal before, which I think is a good foundation for your new proposal.", "q0r": 3, "q1": "regarding the plan, you should give a specific timeline for each phase (development, testing). You mentioned that development will take place for 3 months and testing for 1 month. However, it is not thorough enough. Furthermore, provide us with a detailed budget and explain what the $80000 you're requesting funding for will be used for. In addition, you should introduce the profile of your team member, then attach the link. ", "q1r": 3, "q2": "in this section, you mentioned 3 outcomes of the project. However, you need to explain how the project will be measured, on what platforms it will be tracked, etc. You should include key metrics to measure. The success of the project needs to be described in more detail and its impact on Cardano users should also be shown. I'm not sure about the auditability of the project given the little information you provided.", "q2r": 2, "assessor": "z_assessor_1725", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9691, "q0": "The idea is surely a striking one that addresses the concept of integrating physical assets and debts on the blockchain. The impact this could bring to the Cardano chain is considerably high and it could lead to a huge migration from other chains once implemented. The cumulative amount of assets this could add up to is humungous and drive Cardano to a completely new dimension which could open up a lot of opportunities and also liabilities of the chain that might need addressing which we still haven't tapped into. But the convenor fails to give more information about the approach they intend to use to tackle this issue and therefore it is quite hard to assess the impression this proposal could leave. Hence I score a 4 out of 5 for the impact.", "q0r": 4, "q1": "The plan howsoever being a great initiative, is deficient in multiple sections. The proposer fails to provide a detailed step-by-step plan they intend to take in this venture but mentions the kind of goals they want to reach towards the end. The funds, however, look justifiable but again there are no indications of how and why each breakdown sums up to such a great deal of amount. Also, the proposer introduces himself, but do not have any other team member or may fail to introduce them to the community which either way is a hard fact to bank on. With a considerable amount of development involved a few developers should have already been onboard to instill confidence in readers about the proposal.", "q1r": 3, "q2": "The methods of tracking progress and deliverables are surely missing in the manifesto. Also, I believe that there is not enough information available for the auditors to make conclusive derivations regarding the success of the proposal. Although the final outcomes like achieving deb free life faster, the total value of billions being driven along the Cardano chain are all exciting, there is no way one could justify these outcomes without a viable plan and monitoring mechanisms in place. This proposal looks like a solid one and has a lot of promising features. A Defi with such capabilities and a token to support it accordingly are all the positives to take away from this proposal, but I feel the proposer may have to come back with a more elaborate proposal the next time and make sure his ideologies are shared by the others in the community.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A new system that operates as circle instead of a pyramid. Each country has different laws we have to follow, but the core will be the same.", "experience": "I worked in a Company Oil Company in IT Data Management for 8 years. I no longer work there because I automated my job."}