{"id": 397568, "author": "tihomir.dimov", "title": "Divine Blockchain - Phase I", "url": "https://cardano.ideascale.com/a/dtd/397568-48088", "category": 26438, "amount": 35000, "description": "Bad temperature monitoring, the storage conditions through the entire supply chain are the most common cause of loss of a wine's quality.", "f6_no_assessments": 4, "f6_rating": 3.7500000000000004, "videos": [], "media": [], "f6_assessments": [{"q0": "I don't know if this proposal would be of any value to our blockchain because it's very specific. It is about creating a platform that is the bridge between wine producers and consumers, in order to register on the blockchain some characteristics that relate to the quality of wines, such as temperature, storage conditions and other variables that can contribute to the final customers/consumers have full control over everything that involves their wines. The issue I think is that, generally, the target audience of the wine market is people who are a little older, those who are able to buy expensive wine are usually part of a more economically privileged portion of the population, so we can start to draw a customer profile, which I don't think would be people who would be so interested/easily in dealing with blockchain. It is a very specific niche, I think this proposal could work if the application were launched in places where the population has more contact with the technologies relevant to the Cardano ecosystem and at the same time it is a place with a consolidated wine market. In this case, I believe it would work, and maybe this new type of business could expand to other locations and become popular among wineries and customers, but to be launched to the general public, I don't know if it would work as well, if it would have a good customer adhesion, how to reconcile these two branches (blockchain and wines) and so on. So, unfortunately, I don't think this application is a very sure bet for us in the Cardano ecosystem, if it will create a Dapp that increases the number of Ada holders, transactions on our blockchain, in short, the popularization of our technologies, being worth the effort. 35k investment that was requested. So I suggest that the proposal be launched on a smaller scale, asking for perhaps less funding and aimed at a more specific audience. For example, we could think of some European country, like Germany, where the population has a good purchasing power and the blockchain already has a good base. \n", "q0r": 2, "q1": "This part of the proposal is good, I consider that 2 questions are adequate and 1 of them could be more detailed. Starting with the script, I found it to be well divided, the tasks are listed and it is also indicated how long each one would take, so we have a very solid understanding of the process. However, it is a little worrying to know that only phase 1 is contemplated in this proposal and with this amount of money. It's four weeks that will cost 35k and I wonder how many % of the project we would be advancing with that level. Would it be appropriate for the bidder to pass on this information to us, what is the total number of phases to be done so that the final product is delivered? And in relation to this first phase, when would it start, in which month of this year would its results be delivered? These were the doubts that arose in relation to the temporality of the proposal. Regarding the team, this part of the proposal is quite adequate. We know who the individual team members are, their names, roles in the project and we can check the information provided through the linkedin profiles that were attached to the proposal. However, it could be even better if they explained, for example, the relationship of these professionals with the Cardano ecosystem. However, I think the way the team was presented is good enough for us to be confident in their ability to successfully execute the project. The part that I thought left something to be desired in the explanation of the budget. Phase 1 of the project will last 1 month, and we have very high values ​​here. And project manager would earn 10k to work 4 weeks, but how many days a week would he dedicate to the project because his salary would need to be so high? The marketing part would be 6.5k, but why? What marketing strategy would be adopted, what justifies the value? How would the professional in the field work, how would he manage to merge two such specific audiences (high-end wine connoisseurs and Dapp users)? This last part was, in my opinion, very superficial, it is not possible to clearly identify the need for this funding for this period of time. \n", "q1r": 3, "q2": "The auditability of this proposal is a little problematic because the authors deliver possible ways to measure the success of the acceptance of the application by the user, as well as the revenue, that is, the profits. This is not exactly a way to understand if this phase was done successfully, but if the project as a whole was successful, you know? I think it would be important for us to focus on the partial results before we go into the finals. This can be done through, for example, deliveries of advances according to time. Phase 1 would last a total of 4 weeks, weekly team meetings could be held with some community members in order to understand what progress was made, how each professional worked, whether they reached their specific goals involved and so on. I think it's quite possible for us to track the progress of this proposal based on the roadmap provided and the short timescale. We know what needs to happen each week, just check it out. And so we could move on to the next phase. That's why I'll give it 3 stars: I don't think the authors clearly establish ways to monitor this phase of the project, but they give us indirect means for it, with a very detailed script. If the proposal goes ahead, funded at this stage and in the next ones, it would be very interesting to see how these two niches, wine and blockchain, would be coming together, and what results this would be causing for our Cardano blockchain. Therefore, it is possible to audit the proposal, even if adequate focus has not been given to this part of the project in the detailing of the proposal. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The Divine Blockchain project aims to use technologies within the scope of Cardano to optimize the wine tracking process and guarantee its quality. Thus, we have a clear objective defined and a proposal that fits the goals of the challenge. It is also worth noting that despite the focus of this proposal being the tracking of the wine production chain, if the project is successful, it is not difficult to imagine the application of a similar process to other areas. Therefore, we see a real possibility of impact of this idea in the long term, which would increase Cardano's visibility.\n\nRegarding the budget, we see that this proposal had tried funding in F6, but was not successful, now the amount being requested is less, $35,000. This can be a positive point, which indicates a readaptation of strategies to perform the work. Let's review the steps of this strategy below.", "q0r": 5, "q1": "In the execution plan defined by the team, we were able to observe that the construction of the frontend and backend architectures will only occur after research has been done and risks have been analyzed, which demonstrates an organization of the execution plan. We also noticed that although the core of the project is the monitoring of wines that comes from blockchain technology, the team knew how to divide the use of the budget well. Certainly software development is one of the central points of the work, so one of the largest portions of the amount is earmarked for this, $7,000. But considerable portions are also earmarked for project management, sales representation and marketing, totaling $22,500. This amount is actually even higher than that allocated for software development, but this makes sense as the greatest difficulty of the Divine Blockchain may not be the actual tracking of wines, but the trust that must be built regarding veracity. of information.\n\nRegarding the professionals involved, we noticed a connection with the company Intellics Engineering, whose focus is the application of intelligence to electronic components, exactly what the project in question aims to monitor the characteristics of wines. In addition, LinkedIn profiles of two professionals involved in the project were also made available. However, one of those profiles, Stefan Vlaev's, doesn't seem very up to date.\n\nA negative point of the feasibility plan is the way to guarantee product authentication. The proposal indicates that this tool will only be available in the last phase, but this is a key point for project validation.", "q1r": 4, "q2": "Plural ways of verifying the success and adherence of the project were established. Among these, we realized that a number of users (100,000) was established to be reached in the first year of the project, in addition to an expectation of revenue for this first year.\n\nAs also mentioned in this topic of the proposal, establishing trust with the public is a key point for the success of Divine Blockchain. But in this aspect, not many parameters were pointed out for him to understand the level of people's reliability in the product. Indicative factors could be mentioned, such as, what is the average churn (customers who used the product, but did not return) or what is the level of engagement on social networks around the proposal, that is, how many people are promoting the product because they liked the service and noticed an improvement in the quality of the wine.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "i believe this is an interesting and creative idea. The problem presented is very easy to understand. I like the way you explain it and give the solution. It is very impressive and logical. This promises to be a potential project and brings many positive values to Cardano. You also anticipate a few risks and some of them have been resolved. Overall, the presentation is very good and the idea is excellent. There is no reason to refuse a 5* rating.", "q0r": 5, "q1": "in terms of plan, you provide very specific milestones and timelines. The detailed budget is also presented very clearly. Thereby, I believe this project is highly feasible. I am very impressed with your team, however, it would be better if you include their profile (experience, achivement,...) in the proposal. Thus, reviewers will easily grasp the information before clicking on the link. Apart from that problem, in my opinion, this project is very feasible and will be successful in the future. In addition, mentioning the relevant project also increases the persuasiveness of your proposal.", "q1r": 5, "q2": "you have  provided very detailed phase I project KPIs, in terms of users, revenue, risk management, trust, and long-term relationships. This will be a very good basis for measuring the progress of the project and also showing your confidence in it. However, you should not repeat this content in both sections. You can talk more about the benefits that the project brings to the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_1725", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This CA is not an alcoholic beverage consumer, however, the fact remains that, wine is still a very popular product. Even if only a fraction of the wine-consuming population is exposed to Cardano for the first time through this Dapp, it could have a considerable impact on the people coming into contact with the blockchain. This comes with the added benefit that the demographic that would come in contact are people who otherwise may not have an interest or an opportunity to expose themselves to blockchain technology. Having said that the reach of the solution and the impact it could have may depend on many factors, including the number of customers the developers are able to attract to their wine tracking dapp and the exact location(s) they are planning to deploy it to. The planned location or locations are not mentioned in the proposal, and I would suggest including this detail in a possible future iteration.", "q0r": 4, "q1": "The roadmap given seems quite feasible and is easy to follow, except for one line that I didn’t quite understand the meaning of: “Treat jump workshop”.\n\nI have checked the LinkedIn pages provided and the team does indeed seem to have experience in the field that the proposal is seeking to address. But given the roadmap it does look like some additional hires will need to be made and there is no info in the proposal on these. \n\nThe proposers didn’t quite seem to understand or choose not to answer the Risks question, instead, they provided again the problems/risk that exist within the wine industry and how they plan to fix them with their solution. The risk question is about risks that they foresee, that could arise in implementing their own project, not the risks/problems that it’s looking to solve.\n", "q1r": 3, "q2": "The KPIs given make sense and should be easy to audit by the Project Catalyst community, though I do have to note that the goal of getting 100.000 users in the first year seems to be a bit overly ambitious and doesn’t seem to quite add up with the goal of having 100.000 in revenue.\n\nThe roadmap given is also clear and monitoring its completion should not be a problem.\n\nI don’t quite understand why the proposers felt the need to paste the same text under both the progress measurement and the definitions of success questions of the Audibility section of the proposal.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Tracking of the wine's real-time quality in many supply chain checkpoints, supported with a blockchain-ownership and -monitoring solution", "experience": "For the last 3 years, Intellics Engineering was involved in blockchain products and developed a lot of systems for Industry 4.0 and IoT."}