{"id": 397685, "author": "sarhadmac", "title": "Okos: Monetizing your Intellect", "url": "https://cardano.ideascale.com/a/dtd/397685-48088", "category": 26438, "amount": 45000, "description": "People have difficulty monetizing their knowledge as they are unable to find suitable mediums to do so and get rewarded economically.", "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 360, "q0": "The project addressed by the proposal in question reaches a very interesting point, of monetizing the questions and answers in online forums. This is an idea with a real possibility of applying Cardano's technologies to carry out secure and efficient transactions. And not only that, with the growth in the amount of information on the most diverse subjects, this already existing market of questions and answers has a potential for aggrandizement. We thus have that the proposal fits the goals of the challenge in question and can help in the evolution and dissemination of Cardano's ecosystem.\n\nIt is worth noting that the proposal makes it clear which problem it aims to address, and during the explanation of the steps on how to carry out the project, simple and direct actions are proposed to build monetization. The medium and long-term impact of the business is positive for Cardano, as the successful implementation of the plug-in on a question-and-answer site can facilitate expansion to others, and consequently, the technology's visibility is increased.\n\nThe team of professionals involved seems to have relevant experiences for a successful execution of the proposal. One point, however, is that perhaps the amount requested for the financing is not so adequate. We see that from the definitions of the challenge, for this asking amount of $45,000 it is recommended that the team have proven competence and a whitepaper detailing the action plan. We will address these points further below.", "q0r": 4, "q1": "In relation to the aforementioned, we see that the CVs are not easily available to verify the experiences of the team. We also noticed that the whitepaper is due in Q2. But this is not a big problem, as we can see that in the feasibility section of the proposal, the actions that should be taken by the team are very detailed.\n\nA very positive point of these actions is the understanding that the plug-in must be coupled to existing sites. This helps the team to focus on the development of the tool itself, instead of worrying, for example, in building an entire Q&A platform on which the plug-in would be used.\n\nThe actions are also well organized and spread across different quarters, with the main needs of the platform being covered, that is, we see the development not only of the plugin, but also of the smart contracts that must be used. An interesting idea for some details to be better arranged in this feasibility plan would be the implementation of the site in a stage prior to Q4, so that it could already be used for dissemination purposes. The idea that there are two types of tokens (earned and bought) could perhaps also be simplified. It seems more interesting to focus on just one type and implement another way to map how many tokens a given user has already earned.\n\nRegarding the distribution of funding (without focusing so much on the total amount of this funding, because perhaps it is not so adequate), we noticed that the team also knew how to allocate it in different areas such as marketing and legal, without focusing only on development. Another positive feature is the strategy developed by the team on how to publicize the product, it was planned to contact different agents that can propagate the same, such as the owners of forum sites and also users who are highly participatory in them.", "q1r": 4, "q2": "Regarding the metrics to measure project success, we realized that some more specific parameters could have been traced to verify the performance of Okos. Such indicators could be, for example, an expected number of transactions carried out in the first month, a follow-up of the number of forum users (if it increased or decreased) or even if new platforms have emerged aimed at using this new reward method.\n\nThe ways of following up the result of the proposal that were exposed do not provide much detail on the evolution of the project over time. Meeting the goals that were set out in the roadmap and making frequent commits on github do not accurately measure, for example, project buy-in or audience engagement.", "q2r": 3, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3786, "q0": "Wow, this is one of the most detailed and coherent solutions that I have read. Your proposal manages to indicate the target audience as well as their own advantages from using your platform. Also,the functions of the project are presented clearly with necessary information for the voters to assess. Especially, the most satisfying point here is that your key metric completely matches with that of the challenge, namely the application token, Okos. It’s obvious that you gave me a full view of how your project will be operated, associated with details of subtypes of Okos token. Unquestionably, this impact section meets the standards of challenge because it promises to address the issue: attracting other forums to get exposure to the proposal and the plugin and individuals to use the Okos token. Next, your predicted impediments to the project delivery are presented condensely accompanied by feasible solutions, consisting of digital marketing strategy, which is known as one of the most effective methods applied to attract customers to consume products. In general, your project is highly expected to be a new, viable application built on top of Cardano.", "q0r": 5, "q1": "In spite of having delivered a general roadmap for the project in 2022 and 2023, it would be better if you provided a detailed time-framed schedule indicating when the team will obtain the suggested milestones. In Q2 2022, you listed four main goals including technical and business whitepaper, starting the discourse plugin development, Okos token smart contract development and Okos identity aggregator development, but no period of time to achieve them. My suggestion is, for example, you can predict in which month of that quarter, your team can complete the discourse plugin development and others, as well. What’s more, there’s an issue of budget breakdown here. It’s stated clearly earlier that your requested fund is $45,000, whereas the total fee you presented in the budget allocation list is up to $50,000. Why is it? This information is contradictory which will confuse the voters; hence, I hope you can review this section again to check them carefully. For the team members, although their given positions are close to the work plan, I encourage you to introduce more about the background and working experience in the relevant field, which is a basic and crucial evidence to prove that they will help the project to advance.", "q1r": 4, "q2": "Overall, this proposal is capable of giving enough information about the measurement tools for tracking the project’s growth and criterias of success. Particularly, using GitHub channel is seen to be a brilliant idea to help the community publicly supervise your project, and check the up-to-date news and completed commits. One small piece of advice I want to raise is that you had better put forward a specific tool to help the community know when and what you achieved as published on your website according to your roadmap. Besides, I love your mind of the success of this project when you can come up with two criterias, involving technical and non-technical sides. But if you want to persuade the voters without much effort, you should change the word “several” to a specific number so that they can have a detailed view of how many forum owners utilizing your plugin will be defined as success. And same goes for traction in the utility of the Okos tokens!", "q2r": 4, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5311, "q0": "Overall, your presentation is good. You mentioned very clearly the information about your solution. I appreciate this and believe in its success. Your preparation has also taken into account the risks. It's great that you have a solution. If at the beginning of the proposal, you explain more clearly about the problem, everything will be perfect. However, I am still impressed with your suggestion, that's why I rate it 5*.", "q0r": 5, "q1": "With the detailed plan you provide, the feasibility of the project is greatly increased. Your roadmap is extremely clear, the tasks for each quarter are outlined in detail. Regarding the budget, you have shown what the funding will be used for, however, I have a question, the total amount in the budget is 50,000 USD, this is different from the required funding that you mentioned at the top of the proposal (45,000 USD). Other than that, I have nothing to say about your team members. However, you should provide more information such as profiles, capabilities, and experience of the members in the proposal. This will help investors grasp information and believe in the project.", "q1r": 4, "q2": "The way you come up with two approaches to measuring the progress of your project is very clever and logical. I believe the progress of the project will be public and transparent. If possible, you can provide more specific criteria for tracking project progress. Besides, you also describe the success of the project. I am completely convinced by your presentation. It is worth looking forward to this success.", "q2r": 5, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8568, "q0": "The proposal is for creating a token, Okos, and accompanying integrations with popular chat apps to reward people for answering questions or providing help on forums.\n\nOne area of concern that I have that could greatly affect the impact of this proposal is the fact that currently a lot of knowledge shared online is done out of the goodwill and enthusiasm of experts or otherwise knowledgeable people if you turn it into a monetary transaction then it is viewed through that lens and when compared with the hourly income of such people it might not make sense anymore to answer questions for rewards. It’s a question of perception and motivation: if I’m answering a question or request as a gesture of goodwill, I’m motivated to do it to help people, but if I perceive it as a monetary transaction I won’t do it because I could be doing other, probably a lot more profitable things in that time.\n\nAlthough I assume the plan of the team is to launch their native token Okos as a Cardano native asset, in its current form Cardano is not mentioned at all in the impact section of their proposal.\n\nI don’t see the identified risk of marketing the initiative as sufficiently addressed, as it stands now it’s just a generic answer that doesn’t reveal an actual plan.", "q0r": 3, "q1": "The presented roadmap is clear, concise, and seems to cover all aspects of development.\n\nGiven that development hours are the only real cost of the project, the very minimalistic budget breakdown presented could be viewed as sufficient, however, I would have liked to see a cost breakdown per type of development. \n\nThe team members' names and titles are given, and from that, I could deduce that they are more than capable of implementing the project, however, no credentials or links to credentials are present so it’s difficult to verify the information.", "q1r": 3, "q2": "The project auditability plan makes sense since they plan to track the roadmap on their website and GitHub commits. A general overview of goals is also presented, however, these are not further described as KPIs something that would have been necessary to enable easy monitoring and measurement of the development of the project by the Catalyst auditing community. The intention is there but for the proposal to be complete clear milestones, definitions of success and KPIs would have been necessary. I would strongly suggest including these elements in a possible future iteration of the proposal for one of the next funds.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We argue that people should be financially rewarded for sharing their specific knowledge specially in forums and Q&A websites.", "experience": "Our team is multi-disciplinary and includes members from various backgrounds and skill sets including a PhD Candidate, Senior Financial Advisor, Senior Operations Lead, Senior Full Stack Developer, as well as a Senior Blockchain Consultant."}