{"id": 397681, "author": "altimario", "title": "HYDRA for mashup, co-authors and ©️", "url": "https://cardano.ideascale.com/a/dtd/397681-48088", "category": 26438, "amount": 45000, "description": "For remixes, mashups & collaborative work, COPYRIGHT ©️ is IMPOSSIBLE. Authors/publishers don't recognize co-creations and sue new artists.", "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 2089, "q0": "The first example of where this proposal shines is with an excellent problem identification. Managing copyright is a highly complex challenge today, and so far nobody has a perfect solution. The value proposal here is to introduce an identification process based on Cardano in order to manage authorship acknowledgement of materials made by multiple authors. \n\nI am highly enthusiastic of the potential impact of such a tool that might increase the efficiency of the worldwide copyright market, with the slight caveat that I feel somehow that this kind of solution can also be analyzed from a permissioned blockchain point of view (vs. permissionless as Cardano). There are many arguments to be made for this, and I bring forth the following: enforcing copyright will still be highly dependant on each country’s system of law and existing institutions and market players in copyright-intensive industries (arts, research, drug development, etc) so in most of those cases a system in which only the interested parties develop and maintain a blockchain with the source of truth can be just as effective and more efficient than a permissionless solution such as Cardano. Four stars. ", "q0r": 4, "q1": "The team has done an excellent job at presenting themselves and the use case for their proposal, and the effervescence of the comments section from the proposal is perhaps the best indicator that they are on to something excellent here, with potentially great public traction and interest from the community. \n\nTimewise they have come up with a 2-months plan of implementing the solution, while the budget is not granular enough in my opinion and there is a moderate risk that the overall costs have not been sufficiently analyzed and estimated, leading to potential cost overruns during the implementation. Four solid stars in the hope that budget matters will be offered more attention during the implementation phase, if funded. ", "q1r": 4, "q2": "The team promises to create a website containing information about the progress and the status of the development. This is an excellent indicator that they wish to tailor the information for the Cardano community. Every milestone will also be accompanied by a video. In my opinion there are no red flags here, and this project has a high potential for being transparent.  ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "This is an amazing review, this CA grasped everything, from the social relevance for artists to the importance of Cardano ecosystem.\nUnfortunately, he missed the sentence \"Estimated length of the project: 6 months\", confused with the duration per milestone (2 months each). \nWhat a shame, it could have been a 5 stars review.\nI hope the vCA can take this into account :-(\nAnyway thank you so much for such a nice review. "}, {"id": 3355, "q0": "From providing a description of the current problems in managing copyright, the proposer offers a promising solution based on the Cardano network to address these issues. Following this order, they have succeeded in showing the necessity and potential development of their project. The main features of their project (using blockchain technology and Cardano hydra) are described in the proposal, allowing the community to understand how they function and what the expected benefits are. The financial and social KPIs are also included to measure the progress and development of the project. \nThe main uncertainty in the duration of the project is related to the status of developing HYDRA as they stated. However, they have provided some demo and draft work so the community can access these files to get a view of their current work and precisely evaluate their ability. Another challenge is the staffing cost since they can’t afford that amount of money. Once they get funded, this problem can gradually be tackled.", "q0r": 5, "q1": "The specific milestones and durations are covered in their action plan. In each milestone, there are synchronized tasks that need to be done to ensure the project’s progress. These activities are in tune with their development orientation. The community can use this framework to track progress over time and define any possible delays. \nTheir budget will be spent on the salary for 3 developers. Since there are not so many types of expenses, the community can easily track the cash flow and ensure transparency in their financial allocations. \nThe team is portrayed with two current members. Their relevant working experiences, backgrounds, and Linkedin accounts are illustrated in the proposal. With their knowledge and experience in IT and AI, they will be able to run the project effectively. And as they said, the team is being expanded, which will increase the capacity and productivity of the team\n", "q1r": 5, "q2": "By creating a website to report the progress and development of the project, they have assured the community of the transparency and reliability of their project. Besides, as mentioned above, there are some financial and social KPIs that the community can use to assess their performance.\nThe specific goals for success are firmly set. These goals act as a base for the community to determine whether the team achieves the visualized success or not. Moreover, these definitions of the job “done” can benefit them in setting a clear direction and keeping focused on their path.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5310, "q0": "First of all, your idea is very appealing. I am extremely impressed with it. Your description is very detailed about both the problem and the solution. I recognize that copyright management is a big challenge to solve and PORCE will be a useful solution. You explain the problem and give the solution very carefully. Besides, giving examples and evidence also makes the proposal more convincing. In addition, risks are also mentioned, which shows that your project is very well researched. I really appreciate what you guys have done. This is an excellent opening. There is no reason not to rate 5*.", "q0r": 5, "q1": "With what you presented, I have full confidence in the success of this project. The plan is outlined in great detail with 3 milestones and each work in it is mentioned very clearly. Detailed budgets are analyzed very specifically and carefully. These completely convinced me. I think the feasibility of this project is very high. Regarding your team, there is no doubt about the proficiency and experience of AltiMario and Alfredo. They will definitely be the ones to lead the project to success. I also very much welcome new members of this project. Once again I have to confirm that this is a highly feasible and convincing project. Great!", "q1r": 5, "q2": "I quite like the idea of publishing a screencast video to mark the completion of a milestone. This is a really pleasant and creative idea. Because your plans are detailed, I think this project is measurable. I can imagine the success of the project from your description. It would be even better if you could mention the impact of this project on Cardano.", "q2r": 5, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "POCRE solves the authorship acknowledgement of materials made by multiple authors, via a novel identification process based on Cardano HYDRA", "experience": "40+ years in IT industry which includes:\nSoftware consulting for large enterprises and governments (Italy and UK)Tech-StartupAI & Machine LearningOpen-source contributionEdTechResearchScientific publicationsInternational patents\nA proposal funded on Fund 7"}