{"id": 397957, "author": "bhavishramaswamy", "title": "Basketo Finance", "url": "https://cardano.ideascale.com/a/dtd/397957-48088", "category": 26438, "amount": 45000, "description": "Investing in crypto is not an easy task for the new users and managing the crypto portfolios is such a hustle, for experienced investors.", "f6_no_assessments": 5, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I found the video attached to the proposal very simple and didactic. I confess that by reading the text I could not understand the concept of the proposal, but after watching the video it became very clear. It is a platform where people can invest in different cryptocurrencies in a unique way, through what proponents call a basket. I think it's a very good idea for those who want to invest in the cryptographic world and don't really understand how, don't know how to work with brokers, convert one currency to another, etc. But I ask myself: to what extent is this beneficial for us? I believe that the goals of the challenge are basically to create applications, whether for mobile or web use, that: increase the number of Cardano users, intensify the amount of transactions on our blockchain, attract new Ada holders, that is, expand our ecosystem. This idea seems to me to be very useful for users, as it would make the investment process much easier (from the video, we can see how ergonomic the proponents' platform is, making it easier to understand and use). It is also very interesting how users would have the option of “copying” the baskets of others, that is, researching how other investors are organizing their investments and making the same strategy. Also, it is very positive how these people who were copied would be paid. Not enough, as I understand it, some fees of considerable value would be covered by the platform itself, that is: it is a perfection for users. But unfortunately, I'm not sure if it would be that advantageous for Cardano, in particular. Would it be interesting if we could clearly visualize how Ada would overlap with other currencies? At no point in the proposal is this issue clarified. The way the idea is presented to us, we understand that it is an extremely beneficial investment platform for those who are starting to invest in cryptocurrencies, which could somehow relate to the objectives of the challenge as it would facilitate investing in Ada; but it would also facilitate investment in Ethereum, Bitcoin and etc, other currencies, and I don't think it is our role to facilitate investment in a group of currencies, but in ours. For that reason, I don't think this proposal aligns so well with what we're looking for in the challenge. \n", "q0r": 2, "q1": "This part of the proposal is rather superficial, in my opinion. We know very little about script, budget and team. In the matter of the roadmap, we are presented with what would happen each quarter (from 2022, I believe), some activities are listed. However, the period of a quarter is well fulfilled. It would be better if they divided these tasks into months, for example. What would happen in month 1, 2, 3 and so on. It would also be necessary to better explain each activity, since all we are told would be what will happen, but not how. Individual details are not provided. For example, in Q3 and Q4, the following activities would be carried out: introduce the mobile Dapp and grow the customer base. Who would they introduce Dapp to? How would you make this presentation? Would it be an event, an intense week of publicity? By which platform? Would it all be online, or would something happen in person? How do they plan to expand this customer base? The target audience would be those who are starting to invest in crypto, I believe, but how are they going to get these people's attention and attract them, especially to our Cardano ecosystem? As well as these, the other activities could have been better explained. Regarding the division of money, it is also very superficial. They work with percentages: to build the main developer support team it would take 70% of the 25k budget, which is quite a lot. Who would get how much? And what is the main developer salary? For the marketing parties, what would the dissemination strategy look like? What, exactly, is content creation (this is pretty broad)? It would be better if bidders reported the exact salary of all the participants involved and how the rest would be distributed (they could link to the tasks in the script, for example - how much each would cost). And finally, when it comes to the team, the same thing happens, lack of details. Who is a blockchain developer? I would like to know a little about your professional curriculum, previous work, if you have an academic background and more importantly, how it relates to the Cardano ecosystem. As our community discovered and if we worked with our blockchain before, in addition to a way to verify the information said, some kind of online portfolio. In the same way, these details should have been provided about the other team members, designers, who will do operations (I would like to understand which ones, lacked conceptualization) and content writer. They don't specify if there will be someone on the marketing side, a specific professional for that. In other words, there is basic information about feasibility, but for it to be better we needed more detail. \n", "q1r": 3, "q2": "The auditability of this proposal is presented in a very technical way. The authors state that they will use agile software development methods, which will be responsible for accelerating the process and managing it. They also give other details, such as that they will focus on the “scrum” and so on. Unfortunately, this information seems to be a way of organizing and monitoring the project internally, that is, between team and project. But how to make this monitoring reach the rest of the community? How will people outside the development area understand the advances of this project, how can this information be brought to the public in a way that is accessible to all? In the following excerpt: “an open Scrum board will be made public so that all community members can check and track project progress in the Atlassian JIRA Tool”. What would scrum be, what tool is Atlassian Jira? How can lay people understand this? I think that in order to perform satisfactory auditability, it would be important that the team and some members of the Cardano community, more technical, who understand the technologies to be created here, come together and bring the information of the progress in a clear way for everyone. In my opinion, this would be the best way to monitor the project, as I don't think the general public would be able to follow such specific activities. The authors provide technical data that can be audited by a specialized team. In other words, it is a part of the walking path, but as I explained, I would like this understanding to be more accessible to everyone. It is possible to follow the progress of the project through the tasks that are part of the roadmap, even if they are not situated in time. And about the success, I found that part a bit abstract. The goal is, of course, to make investing in cryptocurrencies simpler, but we need to be more exact. What number of users is expected over time? Would any research be done to understand the impact of Dapp on these people's lives? How would this all reflect specifically on the Cardano ecosystem? I'll give it 3 stars because I think auditability exists, but it could be better explained and more specific. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "We realize that the proposal promotes a way to jointly invest in cryptocurrencies, by allowing the user to invest in baskets. The main premise of the project is to demystify the fear that exists around this market for new investors. However, the idea of ​​allowing investment in several cryptocurrencies at once does not seem to help to demystify this fear. It is true that in the traditional market, when a user diversifies his investment, for example, in stocks, he is often looking to mitigate risk. But as the focus here is on new users of the crypto market, the experience of making an investment in several currencies at once can end up frightening, as the notion of risk mitigation is not so evident with the existence of several cryptocurrencies in a basket, even though there is a specific proportion for each of them.\n\nIn addition, despite the technological bias of the project, the benefits that would be brought to Cardano are not very evident, it is not realized during the proposal that a special focus will be given to ADA, for example. Furthermore, the amount being requested of $45,000 seems inconsistent, given the uncertainties described here and also considering what has already been done.", "q0r": 2, "q1": "Regarding the feasibility stages of the project, we can see that there is an organization in quarters of the actions to be carried out, which is a positive point. But we noticed that it lacks a little more clarity in some points. In this context, we see that it is a new way of investing, therefore, confidence needs to be transmitted to the target audience (and possible future users) of good reasons to make investments in this way. In Q2 we found that there will be an effort to educate about basket investment. However, no further details were given on how this education will be given, what strategies would be used and what type of material will be planned. This would be a very important stage of the project, to convey greater confidence in this investment concept. We also noticed that already in Q2, that is, still in the early stages of the project, the expansion of this trading model to other investment platforms is already planned, but it may be a little early for that, since the project will have entered the mainnet in the previous quarter.\n\nAlso regarding this point, we noticed that in Q1 the launch of the platform on the testnet was planned and even in Q1 the launch on the mainnet is already planned, it seems a little short interval for that. Regarding the details of the budget, we see that the distribution of capital seems coherent, with the largest allocation destined for the development area. As a suggestion for the project, there is the idea of ​​maybe creating some baskets with coins that belong to projects with a specific purpose, like a basket focused on environmental conservation for example, maybe this way it will be easier to convey the idea of ​​this method of investment.", "q1r": 2, "q2": "Regarding the ways to measure the success of the project, we noticed that the team knew how to show a good organization. The use of agile methodology was announced, with a special focus on SCRUM, and this is one of the most used ways today to monitor software development projects. Being able to follow the community through the public board was also a good way to track progress. As this is a fairly new idea, it would be interesting if some goals were set for the launch of the platform. Some of these could be an expected number of users after the final release or an estimated weekly average of new baskets being created.\n\nWith this, we realized that the team has a good technical knowledge on how to manage a project, so it is a suggestion to add other ideas or concepts to the product that create a greater connection with Cardano and its ecosystem.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 3, "ng": 4, "nfo": 4, "vca_o": 1, "reply": "Thank you for your feedback.we would like to clarify all your queries."}, {"q0": "[Disclaimer: This proposer has submitted this same proposal twice in the same category with only the problem statement slightly changed. These two proposals (and its assessments) should be merged into one, I have voiced this in the CA telegram channel. Until this merge is complete, I will post the same assessment in both of these two identical proposals.\nProposal 1: https://cardano.ideascale.com/c/idea/397957 \nProposal 2: https://cardano.ideascale.com/c/idea/398556 ]\n\nBasketo is trying to help investors to build and manage their crypto portfolio, they cleverly call a set of currencies for a basket. It allows people to build baskets and let other people use their baskets to earn royalties on. This is enhanced by minting each basket as NFT's and they claim that you can view your positions in 360°. This stood out as a bit unclear for me as a reader and would like to have this clarified. It seems like a fun gimmick more than an necessity, but overall, the concept is fun and engaging. However, some usual questions come up when dealing with these topics and the authors have acknowledged them to a degree. Security being the primary aspect that is unclear in the proposal. In order for the project to be impactful it has to be functional and secure, this is not addressed fully in the proposals current state. \nAll in all, the proposal is well aligned with the challenge setting and it is impactful, there are some things that have to be cleared up which leads to a resulting score of 4 stars in terms of impact.", "q0r": 4, "q1": "The detailed plan is laid out quiet sparsely given the complexity and unknown variables in the proposal. It does not mention the building of the secure wallet and no QA or security aspects are mentioned either. It is hard to assess if the team has the required knowledge to complete the development and implementation of their project. Also, there is no way to further verify their experience which makes the team less credible. To summarize, there are many unknown factors for being such a large project, it is not possible to deem the project feasible. The total score will be 2 stars (1 +1 for providing a good foundation of plan/milestones/budget).", "q1r": 2, "q2": "The project will have a public scrum board as well as published reports enabling the community to audit the progress of the project, this is great in terms of auditability. The definition of success is a bit vague but the main problem with the audit section is the lack of clear KPI's and goal setting. This should be added in order to receive the highest score in this section, for now the proposal will receive 4 stars in terms of auditability.", "q2r": 4, "assessor": "z_assessor_139", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "In general, this proposal is able to mention the main functions of Basketo and its focus on two aimed users. I want to praise you for doing very well in this part when you could give the voters a deep view of your dApp as well as advantages that users can receive from it. Additionally, you also manage to meet the application output of this challenge, and to be specific, your project can address the vital issue - high gas fees. And I make sure that with this helpful solution, your platform will be capable of attracting more users. On the other hand, I'm not glad to say that it really lets me down when reading your foreseen challenges. The risks are not the case here, but the solutions. You know what, a successful project is the one which can predict all the hurdles and come up with effective solutions to them. Yes, your proposal successfully gave a well-organized list of predicted risks but not a single solution. That’s the problem that I want you to improve since if you can't put forward an idea to address these issues, it proves that your team’s competence is not qualified for this challenge.", "q0r": 4, "q1": "In this section, I plainly would like to say that you are doing bad. The only positive point I can see in this part is many milestones with a clear bulleted list, but unfortunately without a detailed timeline. You only name which goals you will obtain in every quarter but lack a specific timeframe for them. It would be better if you can clarify that in which period of the quarter, you will introduce the mobile Dapp, the Basketo crypto baskets to the other trading platforms, proceed with marketing campaigns and other activities so that the community can keep track of the project. Plus, if the fund you requested is $45,000, you should allocate transparent expenditures into each goal instead of giving percentages of them. Please make it clear and detailed as much as possible because the investors also need to know exactly how much you will pay for each target. One tip I want to share with you is to stick to your proposed roadmap, declare every expenditure you will need to prepare for every single milestone. It’s likely to draw the voters’ and investors’ attention because of your transparency. Lastly, the information of your team members is sort of general and unclear. Only introducing certain positions is not a good idea. It’s highly recommended that you name and provide a brief introduction of your members, containing their backgrounds, experience and remarkable achievements in their careers relevant to this field.", "q1r": 3, "q2": "that your suggested measurement tools - Agile Software Development Methods - are convincing and expected to bring desired results thanks to their useful functions like making product backlog public for users to be aware of. Nevertheless, apart from these tracking tools, you had better give the community an overview of a successful project. To illustrate, you can provide a certain quantity of users entering your platform, like 10,000 or 20,000 in the first year. Don’t plainly say your project will be successful if people forget the fact that crypto investing is hard, and start to enjoy investing in baskets. Because when people enjoy this kind of investing, it doesn’t mean that all of them will use your platform to trade. Therefore, I hope that you can follow my advice to ameliorate your proposal.", "q2r": 3, "assessor": "z_assessor_1675", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "\"The author raised the problem for this proposal quite accurately. For a new user, investing in cryptocurrencies is not an easy job and similarly for experienced investors, it is quite hustle to manage crypto portfolios. So Basketo was created to help investors invest in crypto Baskets and also helps to build baskets and operate their crypto portfolios. For the Impact part of this proposal, I have some comments as follows:\n- First, the author presented the main features and activities of Basketo. They are Investing in crypto baskets and Creating (Minting) crypto baskets. Each such feature is explained in detail by listing headings. Moreover,the target audience mentioned here are investors and new users.\n- Next, from my point of view, with the features that the author offered to solve the problem is acceptable. With their solution, investors could build crypto portfolios with a user-friendly interface and low construction costs. This will attract more users to the platform if the project is communicated to users.\n- Finally, the author gave a summary of five main risks and challenges they will encounter when implementing this project. The mention of these challenges proves that the proposer has gained a deep understanding of the field as well as the project in which they wish to invest. Although in my viewpoint, if there are more plans to handle and minimize these problems in the future, the proposal will be much better and attractive.\n\"", "q0r": 4, "q1": "\"In this Feasibility assessment, this part is not well prepared and unclear at some points. I would like to give some following comments and recommendations:\n- Firstly, in terms of time, this part of the proposal described the work they are expected to implement in bullet points. Nevertheless, I suggest that this section should be a bit more detailed about their timelines and milestones. Instead of dividing tasks by quarter, you could make a smaller allocation such as specific days or what week or month to spend on which task. Proposal must show a reasonable plan not only in terms of what they will accomplish, but also how it needs to be accomplished.\n- Second, about the budget allocation, it is disappointing that the author only stated the percentage of the budget that will pay for three items. My recommendation for this section is that proposer should go into details of the budget for each work item. For instance: How much will it cost to build a core developer support team? How do the team members will be payed, by time (month / week / hour) or by the amount of work they are in charge of? How long will they hire those people? Will there be any rental costs or other payments required? These things I have not seen the author mentioned.\n- In the end, in terms of team members, it should be more transparent following these questions: How many people will be involved in the project? Currently, how many people are in the team and who does the team need more? What task will each of them be assigned? Because there are not any references or link profiles to verify their capacity or skills, it is difficult for the community and investors to trust the project.\n\n\"", "q1r": 1, "q2": "As I mentioned in the previous section, it is a good idea to have a plan with a detailed roadmap of important milestones. Because from a detailed description of the roadmap, we can understand and keep track of what will be implemented and what is being done in the project. Ways to monitor updates are also provided for the community's convenience. However, unfortunately, the proposal does not yet have the metrics of success of the project. KPIs should be added in a clear and precise way, which makes them a good fit for the problem they are trying to solve. As a result, a more detailed timetable and KPIs should be included in the future round to improve the auditability of this proposal, if it does not get funded now.", "q2r": 3, "assessor": "z_assessor_1717", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Basketo allows investors to invest in crypto Baskets and also helps to build baskets and manage their crypto portfolios.", "experience": "We are the early investors in crypto & the developers who are migrated to blockchain technology. we faced many challenges while investing in crypto. paying gas fee, platform fee for transaction is an expensive thing, one need to bear every single time for creating the portfolio."}