{"id": 397951, "author": "michiel", "title": "Anonymity/data control ZKT (part 2)", "url": "https://cardano.ideascale.com/a/dtd/397951-48088", "category": 26438, "amount": 84000, "description": "Today, companies track you, collect your data and (mis)use it commercially. You have no control/benefit from it, although you own your data.", "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "In another example of hitting the nail squarely on the head, the team at Profila is requesting funding for the creation of dapps that will enable user anonymity and profit sharing with brand advertisers wishing to conduct targeted advertising utilizing blockchain technology. The problem solving in this use case is perfectly aligned with the specified challenge and creates the opportunity for a two way exchange of information and financial gain between anonymous individuals and companies/brands. Profits generated by the sharing of consumer information will be split 50/50 between the individual and Profila. Using the ZKT (zero knowledge token) as a payment reward, individual users can monetize interactions with advertisers and still retain control over their identities and all related personal information. Profila has developed a platform where self sovereign identity (SSI) is enabled through the use of digital ID’s (DIDs) using IOHK’s Atala Prism. Another unique feature of this project is a service whereby NFT’s can be minted and sold to corporate interests. The minting of NFTs corresponds with marketable user created content that advertisers can purchase for licensed use of content created by users of Profila who wish to generate income by providing useful content for the brands advertising on the platform. Individuals who decide to share their personal information will have complete control of their information and can remain completely anonymous, sharing only the personal information they wish to share. Income can be generated by receiving advertising from the brands they choose and no unsolicited advertisement will reach the individual. In addition to monetizing user created content and the viewing of advertisements, gamification, levelling up, taking quizzes and building out a more complex user profile will also create revenue for individuals who chose to interact with business/brands on Profila. The team is requesting a total of $84,000 in funding, most of which is targeted to go to developers across the following spectrum; back end, gaming, UI/UX, web, blockchain, apps and dapps. $24,000 of the funding request will be earmarked for R&D, project management and reporting. In addition to the corporate and individual benefits of generating revenue through anonymized targeted advertising, this project will significantly increase the adoption of DIDs using Atala Prism. ", "q0r": 5, "q1": "The feasibility quotient of this project is literally of the charts! First of all, the ZKT (Zero Knowledge Token aka Zeke) has already been created and is in the seed phase of its sale. Private and Public sales are soon to follow. Furthermore, Profila is already operational and has been receiving funding from Catalyst since Fund 5. Profila actually won first place in the metadata challenge of Catalyst Fund 5, so their track record is impeccable. \nThe project has an all star team featuring MICHIEL VAN ROEY, RAJASEKARAN YOGARAJAH, SHAWN BOONE JENSEN, LUKE BRAGG, IPEK SAHINER, MICHAEL RAVA, and REMY MERCKX who collectively have over 135 years of relevant experience. Onboarding has already commenced and it is expected that 100,000 individuals will be utilizing this platform by years end. \nPartnerships with IOHK, Catalyst, MLabs, Microsoft, Revolut, University of Madrid, Luzern University and others, all but assure the success of this project. All of the key components are in place, the team is highly qualified and has already achieved success in prior funding rounds. It is already possible to sign up for whitelisting of the public sale of Zeke, and the pre-seed sale has already concluded. Thus, in addition to funds requested from Catalyst, Profila has already begun securing funding from the revenues generated from it’s ICO. Given their history of prior success, adherence to the road map and based on KPI’s, feasibility is an understatement.\n", "q1r": 5, "q2": "Every dollar that is requested by this project is accounted for in the budget. Multiple lines of organizational and community communication have been detailed within the project, thereby creating all the necessary metrics to provide fiscal accountability to the Cardano community. The methodology of measuring KPI's, adherence to the roadmap, and precision auditability of this project are well outlined in the proposal. \nThe mechanisms by which this project can be audited are as follows;\n1.\tMonthly updates to the Github repository which are publicly viewable\n2.\tThe completion of a product requirement document \n3.\tBi-weekly updated to the Catalyst team through the Catalyst Coordinator call\n4.\tBi-weekly updated via Profila’s newsletter “Cardano Projects”\n5.\tMonthly progress reports and KPI reports will be made available to project Catalyst and the general public.\n6.\tMonthly Q&A sessions commencing at the conclusion of townhalls\n7.\tAMAs by the Profila team\nGiven the past and ongoing successes of this project and it's firm commitments to team Catalyst and the Cardano community. auditing this project should be quite easy.\n", "q2r": 5, "assessor": "z_assessor_1131", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Profila is a privacy-oriented marketing platform that enables customers to engage with companies in a way that allows them to control their data. Profila is live, with an excellent use-case and very good development prospects. The team behind it has received funding from as back as Fund 6. In Fund7 the team received funding for the integration of the ZEKE token into the gamified quizzes in the app. This project is a follow-up and the team asks for the Zeke project to build additional use cases for the gamified features in the app. \n\nGamification is an excellent engagement tool and with very high potential to be scaled towards other use cases if successfully implemented. A caveat being that the proposal, albeit extensive, is missing one important aspect that is definitely relevant here: up-to-date information regarding the completion stage behind the initial funding and, even more importantly, convincing proof that the token / initial MVP is successful. Without any information in this regard it is difficult to judge the impact of an add-on project, but, given gamification’s high theoretical potential, four stars are appropriate in this context. ", "q0r": 4, "q1": "The team behind the proposal is excellent, with a very strong physical presence in Switzerland and has an amazing track record. The project would take 4 months to complete, and would culminate with the integration of a Cardano native wallets in the app. \n\nThe budget is only lightly sketched, so perhaps a better granularity in terms of hours of work necessary would have been very appreciated. The proposal would fund only partially the project, but we are not given an indication of how much exactly, whether it is 20%, 50% or 90%. Again, more details in future iterations would definitely turn this proposal into an excellent one. ", "q1r": 4, "q2": "With more than 5 projects already underway, I have checked their reporting status on all ongoing projects - and they are all in green - which is an excellent indicator that the team truly delivers and communication with the Cardano community is at the core of their activities. \n\nThe project would benefit from a public github repositories, weekly / monthly progress reports and frequent Q&A sessions with the wider audience. Success measures are clearly defined: 25k users after 6 months and 78k users after 12 months, with all earning and spending ZKT on the platform. Excellent prospects in terms of auditability. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The necessary information is presented very fully. I am very impressed with the projects and achievements you have achieved in previous Funds. That will be the basis for investors and the community to evaluate your proposal. The way you analyze the solution in small aspects is very clear and easy to understand. Illustrative examples are also given. Besides, the value that the project will bring to Cardano is also very attractive. The challenges and risks of the project are also mentioned in this section. I appreciate your preparation.", "q0r": 5, "q1": "Through your proposal, I was able to grasp the roadmap of the project. The roadmap is thoroughly analyzed for the first month (4 weeks) and the works of the next 3 months are also mentioned. Regarding the budget, you update very detailed information about what the requested fund will be used for. Your team members have been introduced to their capabilities and experience. I believe with this team, you can completely solve the challenge. I appreciate the feasibility as well as the persuasiveness of this proposal.", "q1r": 5, "q2": "With the information you provide, I believe this project will be public and transparent. Of course, I trust the auditability of this project. The specific user metrics that you provide also add to the credibility of the project's success. I am really looking forward to the success of this project.", "q2r": 5, "assessor": "z_assessor_1725", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "I strongly agree that this proposal will have a big impact on the Cardano ecosystem and hence addresses the challenge very well. This proposal identifies an existing problem in traditional brand to consumer industry (where we are no longer in control of our own data and have become the product without being rewarded and being in control of our own information) and provides an ambitious vision to solve this problem via Cardano. \n\nThe proposal team has already had several funded proposals in the past and this time they are continuing their great work by using zero knowledge token (a native asset on cardano) to measure an individual user’s progress and “experience” within the Profila. Profila is the app where this token is earned by the users if they take part in certain gamified quizzes based on their interests. It is a self sustaining independent business model, and this proposal is a continuation of what the team got funded for in fund 7.\n\nThe onboarding of 100k new users (they mention they have some multinational partnership to run beta on) will be a great step to bring a big user base to Cardano ecosystem. The business model of this proposal is very well explained and the proposed solution has a big potential to bring one of the largest impacts on the Cardano ecosystem as a whole. Overall, amazing to see such projects winning community trust and getting funded and supported by Project catalyst. \n", "q0r": 5, "q1": "Firstly, I would like to start with the details of the team. The team is well versed and has a high share of experience in different business domains. The public links of the team are available, and additionally the community can also have a detailed look into the advisor team. \n\nThe Profila team also has a big list of partners and backers, some of which includes the likes of IOG, MLabs, Microsoft. The team has been very transparent with their progress and the technical expertise of the team is very visible with the work they have already done so far (e.g. CTO of Profila has already shown quite good skills by implementing the native token and has been getting good support from IOHK service team to keep the good work going). \n\nMoreover, the budget breakup is very detailed, and the overall budget is considered for a 6 months of development project. The allocation of budget is justified. As myself a Senior developer in Europe, I can assert that the asked budget for Senior blockchain developers is expected to be at the asked rate. The proposal also mentions that they will be paying for additional development themselves via the token sale, provided if token sales provides them with enough money. So they have covered this part, which is also one of the points in this challenge setting.\n\nThe business process overall is explained in a detailed fashion, although I do not see any technical/architectural details shared, but a good understanding of what work needs to be done is provided. \n\nThe challenge/risk section is provided where as expected transaction costs and speed of Cardano blockchain could become a blockage as the transactions volume grows. However, this is something which we all are aware of and we are quite positive that we will see a lot of scalability improvements in this year itself. Therefore, I strongly agree that this proposal is highly feasible and very probable to be implemented successfully.\n", "q1r": 5, "q2": "I strongly agree that this proposal is highly auditable. The milestones and project timeline is provided both weekly for the first month and then monthly as the work goes into more development phase. The progress of the project has been already tracked well by the community in the past funds, so I see this not an issue and the community can  be confident of ease of progress tracking as this team moves deeper into the finish up phase of their implementations.\n\nThe success section already gives a glimpse on what work has been done since the ZKT token was minted on 22nd November 2021. As can be seen that team has been busy, and provides the success criterion in terms of how many users will be onboarding in 6-12 months of time frame. Additionally, the team will provide the biweekly updates via Catalyst coordinator call, newsletter and monthly updates the KPI reports being submitted to Catalyst teams and will also do periodical AMAs for the community. A very well written proposal and I wish good luck to the team for this round.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Tmr, use our consent-based data (D)app, control who can access your data & get compensated for your attention in zero knowledge token (ZKT).", "experience": "Privacy/Tech lawyer + Profila team of (20+) industry experts with marketing & privacy expertise from multinationals. AdTech partnership with Uni. of Madrid w. first publication on new DeMar model (see attachment). Product bèta-ready, pilot ongoing, 1th ZKT use case funded (fund7)"}