{"id": 397939, "author": "michiel", "title": "How often can a brand contact you?", "url": "https://cardano.ideascale.com/a/dtd/397939-48088", "category": 26438, "amount": 46667, "description": "There is no current way to tell a brand how often they can send you communications except for the options they decide to give you.", "funded": 1, "upvotes": 50425361, "downvotes": 15902802, "votes_result": 34522559, "votes_cast": 175, "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 981, "q0": "I really appreciate the detailed user experience story outlined in the Impact statement, which paints a very clear picture of what the proposer is hoping to build. Spam and other forms of unsolicited advertising are a drain on both digital resources and human attention spans. Profila won't put a stop to advertising, but it does create a model in which the customer is more than just a helpless target.\n\nThis might be a good use case for SSI, and I'd encourage the proposer to keep a close eye on projects within that category. This could reduce the amount of personal information the dApp has to handle itself. ", "q0r": 5, "q1": "The proposer's team appears to have the right composition and experience to deliver on the timeline as presented. I notice the proposal mentions the integration of native Cardano wallets as the last deliverable. I ended up having to scroll back up and search for a discussion of the tokenomics of the dApp. Since the Impact statement is so dense, it might be worth drawing more attention and providing more detail on how this aspect of the project will add value to the user's experience. \n\nI'm also curious if the proposer has been in contact with any brands they could partner up with as a test run? This could be important as it needs buy-in from both consumers and brands.\n\nFinally, there are a few issues in the budget portion. 1. The app developer cost is given in hours, when I'm fairly sure the intent days, since that's how all the other items are denominated. 2. Each item is given in USD cost, but the tally is in EUROs, which are then converted into USD. 3. Assuming the line item costs are in EUROs and not USD, the amount adds up to $43,300, unless I'm missing something. ", "q1r": 4, "q2": "Between monthly Github repository updates and frequent updates via newsletter and Catalyst coordinator call, the status of the project should be a known quantity throughout the development cycle. Would it be possible to give a rough estimate as to how often AMAs will be offered, or at least how many the proposer hopes to offer in total?", "q2r": 5, "assessor": "z_assessor_1251", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 1321, "q0": "The team creates a platform, Profila that enables an individual to interact with the various organization one by one, without supervision or surveillance. People can manage which organization can manage what is on their data, and thus can decide if they want to share or not to share. In the proposal, the team introduces ‘Metronome’ that enables individuals to have full control over the flow through the \"pipes” where each individual has an explicit preferences control. The team also create Cardano-native token called \"Zero-Knowledge Token” or ZEKE. The team has a concrete plan and proven experience to solve one of the most important challenges in the catalyst. The team also provides information on potential risks and considers them.", "q0r": 5, "q1": "The proposal has a detailed plan and roadmap for the first few weeks and the following months. The team provides a detailed and reasonable breakdown of how they will use the proposed budget. The team also elaborates background, relevant skills, and experience on each people on the team and provide a LinkedIn profile.", "q1r": 5, "q2": "The proposals elaborate clearly on how the community can track the progress by two weekly updates on the newsletter, monthly swarm sessions, KPI reports, or periodical AMAs by the founders. The team also provides a GitHub repository thus community can track development progress easily. The success indicators are also clearly defined in on 3rd, 6th, and 12th month.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3358, "q0": "The solution is proposed based on the valuable insight that the team has attained from people wanting to control their data. The main features and functions of their solution (Metronome) have been provided, enabling the community to get a broad overview. Then, they carefully explain Metronome in 3 sections with specific examples, which make it easier to understand. This project with the Cardano blockchain integration is believed to have positive impacts on the targeted groups and the Cardano network in general. The expected outcomes are also directly linked with the key metrics of the challenge. \nThe main challenges and risks that they may encounter during the operation process are well foreseen. To prove that they have good risk management, the team can offer some specific solutions to address these issues and therefore prevent any possible failure. Once the addressing plan is devised, the community can clearly see the initiatives and proactive steps that are taken, thereby better evaluating the team’s ability.", "q0r": 5, "q1": "The detailed plan and timeline for the execution process are included in the proposal. This plan has been broken down into specific periods of time and compatible deliverables depending on the scope of the project. This will empower the community with a clear view of the project’s development at all times. The team also benefits from this timeline in setting clear priorities and directions to ensure organized work. \nIn compliance with their action plan, a detailed budget breakdown has been illustrated. Their allocations mostly focus on the staffing cost and the rest for legal and operational work. By following this financial strategy, the community can easily assess the effectiveness and ensure the team can avoid massive accrued expenses. \nThe team is considered versatile with highly qualified members. Their experiences related to the blockchain industry, current positions, and LinkedIn accounts are well covered in the proposal. The community can access their LinkedIn for further consideration. The team members with their huge capacity are expected to run the project smoothly and effectively.", "q1r": 5, "q2": "The key metrics are highlighted in the proposal for the progress and development measurement. Based on these indicators, the community can easily evaluate their performance and see what they have accomplished, thus triggering any adjustments if needed. They also ensure regular updates on the project’s operation, which keeps the transparency of the project at the highest level. \nThe success of the project has been well visualized. They set clear goals for each milestone (3 months, 6 months, 12 months), allowing them completely focus their efforts and keep motivated to work towards. These goals also act as a frame for the community to track progress and assess work efficiency.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5282, "q0": "Profila creates a tool for us to take back control, provide our own private information that is being exploited and serve the brands we pay for. If successful and widely applied, Profila will have a strong impact on the way brands communicate and advertise. Brands will have to really respect their customers' privacy before they want customers to accept their advertising. I rated: 5/5", "q0r": 5, "q1": "The feasibility of this Proposal only became clearer when I reread the Proposal in Fund 6 (https://cardano.ideascale.com/c/idea/370223). The work plan at Fund 8 is not described in detail. Project risks are written too succinctly. I did not find the information to analyze the cause and impact of these risks. I rated: 4/5", "q1r": 4, "q2": "Profila's work plan this time was too brief. Budgets are sketchy and do not represent a clear summary of expenditures. This is hard to convince to explain the budget they proposed in fund 6 is not enough. I rated: 2/5", "q2r": 2, "assessor": "z_assessor_1913", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "By capturing your contact and cadence preferences (and the ability to enforce them), you can control the flow of comms from brands you like.", "experience": "Privacy/Tech lawyer + Profila team of (20+) industry experts with CX & privacy expertise from multinationals. Product bèta-ready, pilot ongoing, several projects already funded via Catalyst (one finished, see report on townhall 3 March 2022)."}