{"id": 398034, "author": "blockcarbon", "title": "Carbon Marketplace and Exchange", "url": "https://cardano.ideascale.com/a/dtd/398034-48088", "category": 26438, "amount": 64100, "description": "Carbon tokens without a dedicated, vibrant marketplace will remain niche, held back by self-serving legacy institutions and inertia.", "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 484, "q0": "The proposal seeks to position Cardano in a position of leadership with regards to the growing number of Ethereum related carbon focused dApps and marketplaces. Given the market positioning Cardano has in the past year looked to capitalize on RE: being carbon neutral and environmentally sustainable, giving attention to a project that aligns with and allows for the amplification of that market positioning and which has previously won Catalyst funding aligns very well with the challenge objectives. ", "q0r": 5, "q1": "The team has experts from the energy/carbon-market sector and a plutus pioneer graduate as part of the core team, 3 other blockchain devs already working with them, which I think gives them a great change of achieving their objectives from the technical and business-use ends. ", "q1r": 5, "q2": "While it's not clear where the estimated TVL level estimates derive from, both those metrics, registered users, pool numbers and exchange launch would be easily tracked and audited.  ", "q2r": 4, "assessor": "z_assessor_1171", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 1403, "q0": "The Carbon Marketplace and Exchange addresses DApps and Integrations challenge by building a liquid carbon market where carbon asset and carbon derivative can be traded efficiently. The carbon marketplace and exchange will allow other carbon pools to list to provide liquidity to the market. Also the design of carbon marketplace and exchange will open up opportunities for decentralized automous organization later on. The carbon mission will benefit to the whole Cardano community. As DApp challenge for this fund pays attention to the certification of DApps, it is great that they mention this in their proposal. I believe that the Carbon Marketplace and Exchange is an application that will bring the most value for users in 2022 which is the goal of the challenge DApp and integration. ", "q0r": 5, "q1": "The roadmap provided by the team allows me to visualize the project from start to finish. They also address well regarding the budget on creating the exchange that the community engagement and partners will help this project to be cost-effective. The project timespan of 1 year is very implementable despite the big project size and scope of work. They also give the budget breakdown covering the number of hours involved for each functionality of the project. The project requires expertise in commodity and financial markets to come along with the technical and industry knowledge which the team possess. The team is also passionated about climate mission making it very feasible that they will bring this project to completion.", "q1r": 5, "q2": "The team targets 2 million dollars of TVL in carbon market. They also will integrate oracle and DEXs within Cardano. The team has a very detailed plan and know what they are doing. The project aims for the financial system that is regenerative, resilient and decentralized that do not rely on drawback of legacy financial economy. I believe that the team will carry out this project successfully and the project can be audited well using the metrics like TVL, carbon price and pool indices to measure the project progress. This project enhances Cardano as environmental friendly blockchain with regenerative economy powered by DeFi. ", "q2r": 4, "assessor": "z_assessor_1358", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1932, "q0": "This is a continuation of the project \"Carbon as DeFi asset”. The proposer has identified that there is no marketplace to trade carbon tokens while suggesting that trading and staking of carbon tokens backed by a trusted custodian will allow liquidity to develop before full decentralization can be achieved.  The project has a positive impact not only on cardano but in other ecosystems too. The KPIs somehow differ than those of the challenge only on the way they are presented by the proposer, otherwise the project meets the challenge's KPIs.  ", "q0r": 5, "q1": "The team is fully qualified to perform the tasks, details and links to their profile have been provided.  I find the budget reasonable and detailed.  Someone that really knows his work can surely complete the job.  Furthermore, I see in the proposal a team that is willing to even work more hours if needed and give more in order to try a solution that will benefit the ecosystem without requesting additional funds.  The proposer has provided detail technical descriptions and in general, the proposal is written in a very honest way without trying to hide the difficulties that will be encountered.  Only for that, I would recommend this project. ", "q1r": 5, "q2": "The proposer and the team are aware of the complexity of the project as well as of the risks and challenges they will come across but they want a fair chance to try implementing the project. I will not comment on anything else as all info are in place.  I would bet on the team and the successful implementation of the project by giving a fair chance of success.", "q2r": 5, "assessor": "z_assessor_1434", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8743, "q0": "This Fund there is no category for Decentralized Finance, and last fund there were two. I find this quite strange. But when I read the Challenge statement for DApps and Integrations it seems that now DeFi has been included in this category. I may not agree with that step but I totally agree that this is a DeFi proposal and should then be proposed in this category. In terms of its impact, climate change and carbon are currently \"hot\" (as far as DeFi is concerned I mean, not \"hot\" like CNFTs but more so than, say, stablecoins!).\nSo to answer the question of the Challenge: * most profitable or * most used applications on other ecosystems * solved by new applications * deliver the highest amount of value I agree that climate / carbon tokens are a very good way to bring Cardano to the front of the blockchains for DeFi. Marc Cuban is investing in climate tokens and he is normally quite good about early crypto trends.", "q0r": 5, "q1": "It is reassuring to know that the team got funded before and have begun their work and there are team members with LinkedIn profiles and good track record in their business. Otherwise, I would say that the goal is very ambitious, and will most likely require more funding. It is possible, as previous DeFi projects have shown: collect 50k, or 70k, and then build and get funded some more by other funds and investors. But 60k for a DEX is very, very, very tight. Marketplace I am happy with. For DeFi DEX, maybe the team should have stated that this is an MVP or POC or some other wording. ", "q1r": 4, "q2": "This is a really nice way of making the project auditable: present a mix of quantitative and qualitative goals across a timeline and say what you think you can achieve and how fast the rollout will be. By doing so, blockers can be identified with the funding team and funding can be withheld if blockers cannot be overcome, or help can be sought from other people. A lot of proposals just state \"KPIs are ...(list)...\" and do not say what they want to do by when and how much. If I isolate the feasibility and the possible impact, this is exactly what I look for, so this is a very good proposal for auditing purposes in that sense.", "q2r": 5, "assessor": "z_assessor_692", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Trading and staking of carbon tokens backed by a trusted custodian allows liquidity to develop before full decentralization can be achieved.", "experience": "Team of highly experienced carbon and energy traders. Continuation of funded proposal Block Carbon “Carbon as DeFi asset” Foundation and Standard. We bring decades of experience with on- and off-exchange trading, CEX, DEX, automated trading systems and platforms."}