{"id": 398057, "author": "hexdee", "title": "Create Cardano App ", "url": "https://cardano.ideascale.com/a/dtd/398057-48088", "category": 26438, "amount": 35000, "description": "New developers are finding it hard to integrate their website with the Cardano Blockchain", "f6_no_assessments": 6, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 10635, "q0": "As a medium skilled developer, I understand the importance of good quality packages in order to increase adoption to any environment. Making it easier to integrate apps and websites to the Cardano ecosystem will surely attract more developers and consequently more users to Cardano. However, there is lack of information regarding what the final product should be like, so there is no way to tell if it will be truly impactful for the community. Maybe you could include in your proposal how a developer should expect to use your product and which features it will include. Also, in order to better align the metrics with the Challenge, you could include the number of developers using this product, the number of Apps created using this product and the number of users brought by those Apps.", "q0r": 4, "q1": "Judging by the stated relevant experience, I think it's very likely that the proposal will be successfully implemented. The proposer says that he has already developed for several other blockchains. I only missed some reference or link that could support that statement, it would be far more appealing if we could see some of your previous works.\nThere is a list of 3 members required to fill the team. I agree that 3 high skilled members in those positions could achieve said goals. Maybe you could specify which various Frontend frameworks would be needed to execute the idea.\nThe budget is basically used to pay for the team members' time. It seems very reasonable considering the objectives and potential impact.\nThe timeline is split between the desired languages for support, but I think it could be broken down into smaller tasks. We have to make sure that it will be time to developing and homologation. Considering the testing phase, this schedule could be a bit tight.\nThe proposer identifies that keeping the dependencies up to date should be a challenge, but does not provide a way he could mitigate it.", "q1r": 4, "q2": "As said in the previous criteria, the roadmap could be broken down into smaller tasks and the metrics could include the number of developers using this product, the number of Apps created using this product and the number of users brought by those Apps.\nThe definition of success is somewhat ambitious when it says that no new users will be worrying about integration because more complex projects could fall outside the scope of this product. Instead, it could be measured by the number of Apps created with it, the increase in number of Apps created on some period or the percentage of Apps created using this product.", "q2r": 3, "assessor": "z_assessor_951", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 367, "q0": "In fact, with the growth of Cardano and the popularity of its technologies, more and more people will be interested in ways to add their applications to ecosystem functionality. In this way, the creation of a package that facilitates the implementation of these functionalities is an idea that in fact fits the goals of the challenge in question. However, we see that not much information has been given that shows us that this proposal will actually have a positive impact. When answering the question about how the proposed solution will address the challenge, we only see an indication that the proposal will be included in the project gallery and that a post will be made. we realized that only these actions do not bring so much visibility to the application, so that other people also get to know it. The explanation of the risks that can be found during the project is also not very elucidative, some questions arise such as: what could cause the dependencies not to be up to date and what actions could be taken to mitigate this risk?\n\nThe amount being requested to carry out the project is not very suitable for an application of this type, taking into account the information described so far, we are in doubt whether the $35,000 will be used in the best way to bring the proposal to life.", "q0r": 2, "q1": "Regarding the feasibility plan, we also found a lack of more detailed information about the steps that must be taken to achieve the objective. For example, we noticed that the period of time destined to support each language in the project was described, but from the way this information was passed, we do not know if these periods of work will happen concurrently one after the other. Likewise, from the description of the professionals that will be needed in the project, we do not know if the frontend and backend teams (to which 85% of the budget is allocated) will be formed by only one professional each, or how many hours per week they will work , to have the information of the cost per hour. We were also unable to find the curriculum of the author of the proposal.\n\nAnother point worth mentioning is that it would be interesting to plan a prototype to be validated during development. This prototype could, for example, make the implementation of just some simpler functionalities initially, it could also be partnered with some sites to validate the product and in return offer a considerable discount for the use of the final version. In general terms, we realized that a little more specificity was needed about the feasibility plan.", "q1r": 1, "q2": "Regarding the way chosen to monitor the progress and development of the project, we noticed that it is very general, without providing clearer means for the process to be audited. In fact, the more languages and frameworks are compatible, the greater the scope of the project, but it would be interesting if there was an indication here, for example, of a project management tool to monitor development, such as Jira. It would also be nice if sprints were defined, with their duration times indicated, and the results of these were periodically shown to the public.\n\nRegarding the perception of project success, it seems interesting that some goals were numerically defined and verified, such as:\n\nAn expected number of users of the application in the first 6 months of its release\n\nThe average revenue this launch earned\n\nHow many companies got to know Cardano through this application", "q2r": 1, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2017, "q0": "I would agree that a Cardano app could be useful in the ecosystem. However, there is not much information provided that will help verify what this app is going to do and how it will help the Cardano ecosystem. There needs to be a lot more information given so that readers of this proposal can understand exactly what this proposal has to offer and what the team/individual plan to do if given requested funds. Currently, I'm not seeing any good information that addresses the challenge. Specifics needed. For this reason, I have to give this section 2 out of 5 stars.", "q0r": 2, "q1": "It is great that you have been able to work on different blockchains. This experience is great. However, there should be more examples on what you did for these blockchains and what kind of Dapps you built. Listing specific experience will be Key in helping this proposal come to fruition. There is not enough information on the team/individual that is proposing this idea. There needs to be more information in these areas before it can be determined if this proposal could be implemented successfully. For these reasons, I give this section 2 out of 5 stars. ", "q1r": 2, "q2": "There needs to be more information. Currently there is not enough information to determine success of this proposal. It is unable to be audited and more time needs to be put into this proposal. There is a little more than a day left. These would be some suggestions, but currently I have to give this section 1 out of 5 stars. ", "q2r": 1, "assessor": "z_assessor_1448", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5608, "q0": "When I first started creating apps for Ethereum, I started with a really helpful package called Create Eth App and I’m sure many devs who first learnt how to code for Ethereum started out the same way it’s almost as classic as writing your first hello world program. And why does Cardano not have this yet??!!!\n\nThis will make the learning curve less steep for those new to Cardano and help onboard more devs as they do not need to worry about all the ins and outs about integrations and just focus on building their idea.\n", "q0r": 5, "q1": "Seems doable if the proposer has the experience he claimed he has. Basically it will be a simple app that can connect to the Cardano blockchain which has been proven feasible by the existence of other Dapps. \n\nNot much is known about the team but nothing wrong with wanting anonymity. Just have to manage the risks and release the funds at appropriate milestones.\n", "q1r": 4, "q2": "Auditability is sufficient. There will be an npm package released which can people can use freely. The number of languages and frameworks supported can also be easily tracked.", "q2r": 5, "assessor": "z_assessor_2026", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9850, "q0": "The proposal intends to create a NPM (Node package manager) for developers creating DApps easily without worrying about integration, but it's missing the evidence to show the difficulties of website integration with the Cardano Blockchain. It's more convinced if the proposer list some works and preparations and obstacle of developers during entry as cost of the problem.\n\nThe proposer has barely explored and accounted for the competitive advantage, growth potential, and staying power of the solution perhaps  IMO he not keep track with the builder tools on Cardano Developer Portal that help Devs easily integrating Cardano into existing websites and services. \n\nThe proposal could solve the problem stated but does not stand out as a unique solution as a whole. But anyway, it could bring new application built on top of Cardano, enhancing the integrations with existing products.\n\nThe vision is generally understandable but may not represent a clear contrast against the status-quo.\nThe proposer mentioned the main challenge in keeping the dependencies up to dated during implementation but has not given out solutions for it. It'd increase feasibility if proposer give out some risks and ways to mitigate it, such as: throughput and productivity measurement, circle CLI,...", "q0r": 3, "q1": "The Author is a Backend and Blockchain developer but experience but on Cardano is very important for project success, quite different to others blockchains such as: Ethereum, BSC, Polygon, NEAR, etc. But unfortunately, the Author does not give any reference link. It'll bring more confidence for the community if give out Twitter or Linkedin link for for proof of works and experiences.\nThe proposer is aware of shortcomings in capacity to complete the project and has plan to hire members in: multi-framework Frontend developer, NodeJs Backend developer and technical writer.\n\nThe budget has limited details and unclear whether the requested amount is enough. It's better if the Author break down them into the number of working hour/day and labor, such as: 2 members * 100 hours *  25 USD = 5000 USD to develop Frondend support for ReactJs,...\n\nThe Author didn't describe clearly how to develop and publish an NPM Package. For clear vision for the community, the proposal need to give an outline of architecture of the solution in which descibe what IDE to use, connection method to Cardano chain,...\n\nI look forward to seeing the marketing information but it is not mentioned at how the advertising campaign would be carried out to attract the Dev community using the NPM.\nIn common, I doubt the feasibility of this proposal and hope it would be better in next Funds. ", "q1r": 2, "q2": "The proposer gave out a clear and reasonable timeline for NPM support on each framework, but I think it's helpful for community tracking how the proposal is progressing by providing an updated website or Github repository.\n\nThe proposal's KPIs and other measures of success are not auditable and available for the community. It could be improved by giving out the number of developers join and integrate the NPM package on their applications.\n\nThe team does not designate any point of contact  for providing regular updates to the community. It need a communication strategy and method for updating information via website or communication channel such as: Discord,  Telegram,…\n\nIn general, it's very hard for the community to audit and track the progress of this proposal.", "q2r": 3, "assessor": "z_assessor_775", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 9861, "q0": "This proposal identifies clearly problems that new developers could encounter during integration website with the Cardano Blockchain, solving problems by delivering a node package manager (NPM) for DApps development, wallet connecting easily. But actually, these difficulties was the past story, and perhaps the proposer couldn't regularly update Cardano many integrations on its Dev portal or he could come from another blockchain (this is a useful website for developers tools: https://developers.cardano.org/docs/integrate-cardano). But anyway, he will bring a new and viable integration, attract many developers, add value to Cardano ecosystem, that's a positive point of this proposal. \n\nSolution of the proposal is not unique because there are many forms of NPM packages on Emurgo's library, but we need to review its positive site on the diversity of framework integrations for developer community.\n\nThe proposal provided a main challenge but didn't give out any ways to solve or mitigate it. I suggest to use these open sources to get some ways to solve the NPM dependencies update problem(https://www.whitesourcesoftware.com/resources/blog/7-open-source-projects-we-love)\n\nAdditionally, I recommend the author to pay attention to some risks in security vulnerabilities of NPM dependencies we need to solve for increasing the feasibility of the proposal.\n\nFinally, I think this proposal still has an inherent impact to Cardano ecosystem.", "q0r": 4, "q1": "The proposal did not give any reference link to show the experience and works of the Author in backend and blockchain developer for the community could verify. I recommend adding some direct links to show the capacity of the proposer to improve the identifiability. In my opinion, the proposer doesn't aware of the quite difference between Cardano and any other blockchains such as Ethereum, BSC, Polygon, NEAR,...\n\nThe author acknowledges the capacity gaps to complete this project by filling some positions in Frontend developer, Backend developer, and Technical writer. But I think it's better if he builds a team with full capacity to scale up the project in the future.\n\nAbout the budget, I think it's very hard to verify if it's enough or not. To improve it, I suggest breaking them down into working hours and hourly rates for each work. For example: how many engineers for backend developing, working on how many hours per day with hourly salary.\n\nThe proposer just gave out some common information about technical aspects, not provided any scheme/sketch on how to create, publish and connect to the Cardano chain.\n\nFor these reasons above, I don't think this proposal will be implemented successfully and there are many things that need to improve more. ", "q1r": 2, "q2": "The KPIs of the proposal are so common, we could not identify what works done and how to check the progress. I suggest the proposer give out a website or Github link for the community to track, run test demo on each language that the NPM supported. And the author consider to have a communication channel with the community, for example on Telegram.\nAdditionally, this NPM is used for the developer community as the goal of this proposal and the challenge setting, so it's very positive if the author give out a metric to measure the number of developers integrated this NPM package into their projects.\n\nIn short, I found this proposal very hard to audit and track the progress for the community.", "q2r": 2, "assessor": "z_assessor_777", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Create Cardano App is a npm package that allows developers create their DApps easily with worrying about integration.", "experience": "I am a Backend developer and also a Blockchain developer, I have experience building on different Blockchains e.g: Ethereum, BSC, Polygon, NEAR etc"}