{"id": 398088, "author": "michiel", "title": "Company privacy ledger (GDPR, CCPA)", "url": "https://cardano.ideascale.com/a/dtd/398088-48088", "category": 26438, "amount": 81300, "description": "Privacy laws (e.g. GDPR) introduce data subject rights to help you control your data. Brands are (legally) required to respond + keep logs.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7321, "q0": "This proposal is very good and fully aligns with the objectives of the challenge. This is an evolution of Dapp Profila, a project that was started through funding in fund 5 (as I understand it). In summary, Profile is a Dapp that aims to provide greater control and guidance to people regarding their personal data, that is, the privacy of their information that is often used by companies to collect data about the person in order to offer products, services, or even get in touch via email sending promotions in an abusive way (beyond what the customer wanted and allowed to be done). This is a common situation nowadays, since basically all companies ask people to accept cookies when they enter their websites, or for example, when we go to make a purchase, they are almost always asked for personal data that companies use unfair way. Profile aims to help consumers understand what their rights are, laws that protect them, in short, manage this data in a more conscious and secure way. Cardano blockchain is used as a ledger where various data is minted, being free from tampering and corruption, and this is very useful for consumers. The example given is that if a person receives 15 emails a week from a marketing company, requests that these emails are no longer sent and after some time, they continue to arrive in their inbox, the customer would have a way of proving that they have forbidden these abusive attitudes were made as this would be recorded on the Cardano blockchain. And if the company continues to do so, he would have evidence if he decided to file a claim or even file a lawsuit against that company. In the case of this proposal, the proposer suggests that an improvement be implemented that would benefit the companies. It would be a response panel, which would allow companies to have an overview of requests, schedules, in short, various information that is minted in the blockchain about customer choices. This would help companies to prove, for example in the case given about the 15 emails, that they responded to the request in a timely manner. In the present proposal, Profila would improve for companies, giving them resources to defend themselves against actions, as I understand it; there must be a lot of customers, a lot of information, many ways of organizing that are difficult to manage, and from what I understand the panel would be a platform that would facilitate and organize all this data for when companies needed to consult them. This aligns very well with the objectives of the challenge, here we are looking to fund Dapps that favor the expansion and wide adoption of Cardano's technologies. Dapp already proves to be a project that is useful and attracts new members to our community, and with this improvement, maybe more companies will be interested in using it, also in understanding more about Cardano and how our technologies can benefit them. Therefore, I consider it to be a high value proposition and could generate a very positive impact for our blockchain. \n", "q0r": 5, "q1": "The proposal script starts off great, but then it gets very vague. In the first month, each week's activities are explained, so we have a pretty solid understanding of what would happen early in the development of this Dapp's evolution. However, after the first month, the 2 month explanation is much less specific, we don't know what small activities would be developed weekly, we only know that the designer will produce \"new band panel screens for the application in parallel to the development work\" . But what would this production be like, what work routine would he have for this result to be achieved? How many screens would be produced? Then, the level of specificity gets smaller and smaller, because the other months are explained together, we don't know what would happen exactly in the 3rd month, in the 4th, 5th and so on. We know that during a quarter (from month 3 to 6) the activities that would be developed are focused on “integration of the new design screen of the band panel, continuous development work”; but we don't understand how this process would happen. It would have required the bidder to have kept the time division to a minimum on a monthly scale, so that we would have the same level of detail from start to finish, knowing who would do what and when. Now, speaking of the budget, a total amount of 81,300 USD is requested, which is quite high, but it makes sense because it is a complex project that will require the work of several qualified professionals. The value is duly justified through the salaries of each, we know how many days they would work and what would be the value of their daily work. It would be positive if the proponent had confirmed to us if these daily rates would correspond to a full-time working day, of 8 hours (I believe so, because the daily rates are quite high, but it would be better if the information were better assured). I found the asking value for the gamification developer quite high, 1000 dollars a day... I don't know if this is compatible with the market, if he worked for 8 hours, the hourly rate would be 125 dollars, this is actually a higher value higher than what I usually see in other proposals. However, it is at the discretion of the other CAs, voters and readers of the proposal to decide whether they think the price is fair or abusive. Finally, analyzing the team’s presentation, in general I found this part quite adequate, as most professionals provide a good level of detail about their careers, exemplifying previous experiences and providing their linkedin profiles, on how we can get to know them in a more direct and proven way. However, not everyone does this, like “REMY MERCKX”, he provides very little information about himself, not clarifying what his relationship with Cardano would be (if he has any too) and not attaching his linkedin profile. Ideally, everyone involved would have given the same level of detail about themselves. I think the feasibility is high, but some points could improve. \n", "q1r": 4, "q2": "The auditability of progress is excellent. The proponent informs several ways in which the Profila group would keep the IOG coordinators and also the Cardano community informed about the partial results obtained during the development of the phases; I believe they also informed more specifically about their work routines, if what was planned was accomplished by the right people, at the planned time, if there were problems or obstacles during the development process and how they were overcome, etc. Indeed, this team conveys being well aware of the importance of keeping everyone up to date, through the various ways. They would be the Github repository; the “bi-weekly updates to other Cardano proponents via the Catalyst coordinator call”; also biweekly updates to the “Cardano Projects newsletter” via a website (I think it's fantastic that they create a website for this, it shows that they place a lot of importance on the auditability process; reports containing KPIs sent to Catalyst teams (other bidders?) , which they claim would also be available to all members of the Cardano community; in addition, they claim that they will participate in the monthly Swarm sessions, to keep in direct contact with the Cardano community, in case they have doubts and questions about the project. It was the best auditability that I have evaluated so far in this fund, regarding the process and the partial results. Now, speaking of the success scenario, the final results, this part is also very good, first the proponent explains in general what biggest project objective and also what is expected for the specific times of 3, 6 and 12 months in advance. We know that the project aims to improve the experience d the companies in Dapp Profila, which also seeks to attract new members to Cardano, even if indirectly, I which also seeks to promote the continuity of instruction on the use and protection of data for consumers. I think there is a lot of information to be verified, so it would be interesting if somehow all of it were studied, summarized and gathered in an overview, which could be in the form of a final report, a longer participation in the Swarm session or even in Town Hall, so that more people would be aware of what the project generated; finally, some way for the community to become aware of what was done and what results this generated for Cardano, how the direct objectives of the challenge were contemplated. I thought this part of the proposal is exemplary and certainly deserves top marks. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2656, "q0": "The idea seems like a great start to creating a decentralized privacy app for Cardano. I would like to see further research showing the ability of the blockchain to handle this kind of workload though.", "q0r": 4, "q1": "Although I love the well thought out proposal, it worries me that the research was not done prior to asking for catalyst funding. This is a lot of money to give for something that is completely experimental. I would like to see more hard evidence that the team will be able to pull this off without risking the security of the clients' data.", "q1r": 3, "q2": "The proposal is well put together, but because of the fact that research hasn't been done yet to implement the use-case successfully, I would like to see more data that catalyst funds will be put to good use. I feel that the team here have a great idea, but it is still in its complete infancy. There are many other privacy-based solution proposals that are further along with their research that shows the use case being successfully implemented. Great ideas though!!", "q2r": 3, "assessor": "z_assessor_1548", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4452, "q0": "Firstly, the related concepts are explained very thoroughly, which makes it easier for viewers to understand your project. After that, your achievements in FUND 5 were also mentioned. I am very impressed with this. You presented the orientations and intentions to develop the project in FUND 8. Furthermore, this proposal can solve the challenge. Besides, you also raised the challenges and risks of the project. I believe this is a potential proposition.", "q0r": 5, "q1": "Regarding your detailed roadmap, this is considered an excellent roadmap with very specific milestones and timelines (weeks and months). In terms of budget, you provide a decent breakdown. Besides that, I have no complaints about members and advisors of your team. They are very talented and experienced. Overall, I appreciate the feasibility of this project.", "q1r": 5, "q2": "In the proposal, many ways of publicizing the progress of the project are mentioned. The success of the project has also been described in detail. You have shown the outputs after 3 months, 6 months and 12 months. It would be better if more KPIs were provided. Thus, the auditability of the project will be increased. Even so, I still appreciate the success of this project.", "q2r": 5, "assessor": "z_assessor_1725", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5631, "q0": "Development of this privacy focused app will have a significant impact on the ability of consumers to control their data, and for brands to legally record data and respond to users requests. This type of application is valuable to the Cardano community because not only will they be advancing the technology to help enforce privacy rights, but they will also be onboarding large multinational brands and hundreds of thousands of users, and this number could obviously scale up significantly. By recording these transactions on the Cardano blockchain, they will be increasing network traffic and use and overall utility of the network. ", "q0r": 5, "q1": "This proposal is very likely to be implemented as described, because the team is highly knowledgable, has shown clear progress on past funding that was provided by catalyst, and they have been working closely with IOHK and the well respected MLabs, who specialize in Haskell, Rust, Blockchain & AI consultancy services. The proposal outlines the team required for this project, and their extensive experience and qualifications. The budget is clearly divided into measurable tasks on their timeline, and while the budget it significant, it is reasonable for the highly skilled team that will be developing this app. Additionally the project will be self funding some of the development through the issuance of their token sale. I believe this token sale will be successful, as the team has already gained significant support within the Cardano community, as can be seen through the attached links and having the popular Cardano community advisor and interviewer Bullish Dumpling as an advisor to the project. ", "q1r": 5, "q2": "The proposed plan includes a clear timeline, budget and auditable metrics for success. Their plan for auditablity is clearly defined in the proposal, including allowing anyone to view their Github repository, and providing periodic progress reports to the community and communication through townhall video updates, and Ama sessions with the community. The team is taking transparency and communication with the cardano community seriously, and it will be clear and simple to audit the progress of this proposal. The overall success will be compared to the criteria discussed in the proposal such as:\n\"Success of this improved POC would be that we can integrate it into our existing App with one of the 5 SME brands that are testing, and make sure it works with their consumers.\nSuccess after 3 months - finalizing the development work to be tested in the App\nSuccess after 6 months - running targeted trials with this second POC in the App with real customers\nSuccess after 12 months - full deployment of the metadata POC in the App; covering every interaction that includes privacy rights from every user, and responses from brands.\"", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7854, "q0": "Wow, I just found out about this great proposal. It's interconnected with the previously funded proposals with the objectives as planned by the proposer. How can I never hear about this in my local community? This proposer & his team surely know what they want to do. With Cardano integrated into their product, it would bring a great impact in real-life use cases", "q0r": 5, "q1": "Needless to say, the proposer & his team have already known exactly what needs to be mapped out in the proposal. A clear timeline, budget breakdown, and team profile lead down to the product's PoC that can be seen on the company website. The only risk is the delivery time. Cardano community can wait and should become the first-mover advantage using this app.  ", "q1r": 4, "q2": "The proposer and his team have provided every aspect of reporting channels for the community. Milestones have been mapped out clearly, and hopefully, this project could deliver as promised. ", "q2r": 5, "assessor": "z_assessor_647", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Brands invite customers to use Profila's App to learn + exercise data rights; privacy metadata ledger provides immutable legal proof 2 both", "experience": "Privacy/Tech lawyer with 10Y XP in (project relevant) legal issues - consumer privacy & data rights + Profila team of (20+) industry experts. Privacy research partnership with Uni. of Luzern, privacy project sponsored by Swiss innovation agency. Product bèta-ready, pilot ongoing."}