{"id": 398374, "author": "stevemasch", "title": "AMY Music DAO- Decentralize Economy", "url": "https://cardano.ideascale.com/a/dtd/398374-48088", "category": 26438, "amount": 250000, "description": "Becoming a musician is a journey fueled by passion and filled with frustration and too many middlemen.", "f6_no_assessments": 8, "f6_rating": 3.375, "videos": [], "media": [], "f6_assessments": [{"q0": "It is not clear how this proposal will meet what we are looking for in the present challenge. It is about creating a DAO, which will revolve around the music world, where there will be various activities such as connecting musicians and services, promoting the bridge between studios (these first two activities are already happening); to play the role of a social network focused on the music world (this could be better explained here), in short, to promote a decentralized economy where investors, musicians, recorders and consumers could interact and establish agreements, sales and various types of contracts. This is what I understood would be done in the application. Regarding how all this would relate to the Cardano ecosystem, this part is explained briefly in the following paragraph: “create use cases for DAO Governance, Payments, NTF, Smart Contracts for Gigs, DeFi, Services”. Unfortunately, the explanation, as you can see, is very short, it is not explained in detail how the technologies of the Cardano ecosystem would be used. We know that they would be, because it is mentioned that NFT would be in play, smart contracts (which would logically be done on the Cardano blockchain), but not explained, for example, NFTs of what, would it be something that musicians would make available to their fans? Like unique album covers, artwork related to your work? What would these smart contracts be made for exactly? Who would be selling what service/product? Could this DAO be a kind of cryptographic Spotify, where musicians would receive a fairer amount for playing their songs? Despite being an idea that theoretically is promising, the explanation of the impact is still a little abstract, in my perception. If the internal workings of the application were better explained and how exactly it would use Cardano's technologies, I believe it would be easier to measure the impact, if the proposal is in line with what we are looking for here. I sincerely believe it is, but as I am not entirely sure about it due to the lack of more precise explanations, I will give 4 stars for the impact of this proposal. \n", "q0r": 4, "q1": "There's a script here and it's a good level of detail, but it's organized in a somewhat confusing way, in my opinion. Starting off that I'm not sure what M1/M2 etc would be, I believe it's month 1 and 2, so I'll start from that assumption to continue my analysis. The proponent starts by explaining the main activities to be carried out from month 1 to 6, but this is done in a somewhat loose and superficial way. First it states what would be focused on the first and second month and then it focuses on the third to sixth month range. Below he writes some more activities to be developed in this period, at least that's what I understood (that these activities would be part of this block of time). But it is not possible to know exactly what would happen in month 1, 2, 3, 4 and so on. That is, I would prefer that the proponent had organized these activities in a linear and clear way, in order to resolve any doubts about at what point in the process each thing would happen. It would also be interesting to include the expected time to perform each task, this would also help to visualize more clearly what is to come. The same explanation format continues to follow, ranging for example from months 7 to 13, 14 to 20 and so on. In short, my opinion about the script is that we even get to know what is going to happen and roughly when, but not exactly when. The level of detail is quite complete in some time intervals, raising the level of this proposal. This makes understanding not the best possible. Moving on to another point of analysis, when it comes to the budget, this part is very problematic in my opinion. From what I could understand, each time interval would need a lot (a lot!) of investment, for example only in M1 and M2 it would be 131,396 USD. This is very expensive, the total project would cost more than 2 million dollars, which is close to what IOHK decided to invest in this Dapps challenge, which is an extremely high value. How would the project be financed from now on? If it was successful in the current fund, would it also be submitted in future funds? The first two months, which cost 131k, would like an explanation for the need for this money, that is, the bidder should justify it in parts (amount X would go to design, Y to programming and so on), in order to argue because it is a necessary amount. And finally, when it comes to the team, this is said in a confusing way. We have the names and linkedin profiles of some professionals, which allows us to get to know them in practice and is very positive, but we do not know who will do what in the project. Some functions are described below, it is not possible to understand if these would be the functions of the professionals mentioned above or of people they still want to hire. Therefore, I think feasibility has a lot to improve in its 3 analysis aspects. \n", "q1r": 3, "q2": "I think the auditability of this project is better in the sense of verifying whether success is being achieved than following the application development process, but in general it is possible and satisfactory. It is said that the achieved milestones can be verified in a public gitlab and also through the already active products, this would require a community effort to follow the project. I think it would be more appropriate if the team itself made reports with a summary of monthly progress, for example, and made them available to the Cardano community. In terms of success, it could be easily verified because the proponent makes clear numerous of his objectives and goals, both numerically (he wants to increase the number of current users of his application by 10x) and qualitatively through what should happen (in case of success) until the year 2030. KPIs are also traced, that is, there are several ways to exercise auditability. It is, in a way, possible to monitor the process also through the activities mentioned in the viability in the respective months, but as I said, because they are not located in time exactly, this is a little more difficult. If the schedule were revised and improved, I would give this item the highest score, but as in my opinion the analysis of the final products is 100% possible and the analysis of the processes is not, I will give it 4 stars; improving communication between the Cardano team and community and establishing probable dates for the start and end of each task, in each of the phases, would improve the monitoring of the proposal. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The difficulties encountered by new musicians at the beginning of their careers are quite notorious, especially for those who do not have many resources. The proposal in question is a platform (already functional in some aspects) that seeks to demystify this scenario, by offering features that make funding and earnings for new artists more democratic, even benefiting those who are not artists, but use the platform. These new services and features offered by AMY use blockchain-related technologies to make processes more transparent and eliminate intermediaries. In this way, the use of Cardano technologies in this process makes the proposal fit the goals of the challenge, as well as the success of the endeavor can bring positive visibility to our ecosystem, driving more exponents and possibilities for solutions using Cardano.\n\nHowever, one point that counts negatively for this proposal is the amount of funding being requested. We see that $250,000 is too high a value (even because there is a certain divergence in relation to this later on, as we will see) which undermines the proposal and its possible impact.", "q0r": 3, "q1": "The main reasons that indicate a good feasibility for the project seem to be the following topics: The organization in well defined periods of time for the actions to be carried out; The consequences of these actions on the project's own ecosystem.\n\nRegarding the first topic, we see that the steps are organized in a logical way, starting from simpler actions such as research and planning, to more robust steps such as marketing and development of what was planned. This is a positive point as it demonstrates a good understanding on the part of the team about the path to be followed in the development. And about the team, we noticed that they generally have extensive work experience, and they also made their résumés available to confirm this. We also observed the existence of a very well structured website, with the project concepts being transmitted in a simple and cohesive way.\n\nIn relation to the second topic, we noticed that with the adoption of the users, over time, of the ideas proposed by the project, the tendency is for new artists, normal users or even partnerships to be established, strengthening the project token and generating greater visibility to this way of supporting and also profiting. It is possible to see that this would happen due to the format of social connection that the project promotes. We even see that there is already a considerable base of users of the service.\n\nSo far, it seems that we have mostly positive points to believe in feasibility. But unfortunately, when we consider the detailing of the budget, we see that immense amounts are being asked to carry out the various planned steps. The sum of these amounts is even totaling over 2,100,000. And we see that this is approximately 84% of the fund, making funding this proposal quite unfeasible. We also note that this value is different from the statement in the impact section.", "q1r": 1, "q2": "We see that the team demonstrated good manners for following up on the different stages of the project. A very positive point is the existence of a roadmap on the site that indicates the main actions to be carried out, and in addition to that, the team demonstrated here that the results can be monitored in a public gitlab (which helps people in the tech area to analyze the evolution ) and also in the products already developed.\n\nIn addition, the team's perception of success is well defined, we can see this by defining the number of users of the program that you want to reach and also by the ideas that the team aims to convey to prove that the service is beneficial, such as demonstrating the savings obtained in compared to other similar services. With that, we see that this proposal seems to have good potential, so it would be interesting to try to readjust the amounts being requested to increase the chances of success of the project.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The AMY Music DAO-Decentralize economy proposal want to connect musicians, studio service providers, investor by creating decentralized experience in DeFi, NFT, payment. They have 2 apps already and the part they seek fund from Catalyst is for their DAO governance. They see DAO as a way to help their \"re-enfrancisement plan- participants are owners and reap benefit\" (shared economy). Since the challenge DApp & Integration look for DApp with the most value to end user, they are good candidates as the the proposal if implemented successfully could give a positive impact to music industry. It will improve their proposal next time to show how big is their market size compared to the overall industry. They should also consider show user review of their app and the number of downloads in the proposal. The user review and the app download number will help to show the potential impact of this proposal if introduced as DApp.", "q0r": 4, "q1": "The project covers 2 full years central around DAO design, operation and marketing. While the total cost of this project is around $2 mil, the requested budget is set at 250k without an explanation of how they come up with the proposed amount. Most other projects these 2 numbers are tallied up. The contact link for each team member is provided. The project still has an unclear budget that need to be addressed in order to get the better rank for feasibility.", "q1r": 3, "q2": "The deliverables are quite clear and has a precise target 10 times from their current standing of 120k members and 20k providers. I also found the discrepancy between these 2 numbers in the proposal compared to what they show in the website. The figure they provide in this proposal is 120k musician users not matched with what is shown in the website of 90k musician users. They also didn't provide figures in their metrics of revenue improvement and token velocity. If provided, it would be easier to audit the project properly. They also haven't mentioned how they will report their project progress back (via zoom or report) making it quite difficult to audit.", "q2r": 3, "assessor": "z_assessor_1358", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Around the world, art has been and is on the rise. In it, the music industry is still growing. And a music career is a journey driven by passion. The team proposed the idea of connecting musicians, investors... with the decentralized economy, bringing them into cryptocurrency. The group has described clearly, specific solutions impacting the challenge. However, it will be beneficial if there are positive solutions to the risks that may occur when implementing the project.", "q0r": 4, "q1": "Proposal offers a clear plan. Detailed roadmap for each job to be done in a specific time period. Team members are demonstrated with the skills and experience required to carry out the project. A big question mark for the proposal with the budget. The team proposed a budget of $250,000. But analytically, the budget is $2,134,650, more than 80% of the total challenge budget. Have confusion that needs further explanation?", "q1r": 2, "q2": "Brand new proposal. It would be beneficial to add a few specific, good-value KPIs that would provide insight and easily measure the progress and success of the proposal. Budgets are well analyzed, but imprecise with budget proposed by the team. It is difficult to audit in a transparent manner.", "q2r": 2, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "\"AMY Music DAO- Decentralize Economy This is a good topic, suitable for the challenge presented.\nThe heart of this challenge is to come up with new Applications built on the Cardano platform to attract users, and easy management.\n\nWith 2 applications AMY Music DAO and AMY Studios have now attracted 120 thousand users who are musicians and 20 thousand suppliers. The goal of this project is to bring this Community into crypto and build use cases for DAO Governance, Payments, NTF, Smart Contracts for Gigs, Defi, Services.\n\nI think this topic is worthy of community attention and support. From the challenges set out, the project has specific solutions. Aims to create quality applications that will increase utility and adoption to grow the Cardano community. The project has built useful applications aimed at Musicians, Services & Investors, Fans...\n\nThe AMY Music DAO platform has the role of connecting, promoting, and balancing in the blockchain community, in which:\nThe AMY Music app connects musicians and services around the world and in 4 languages\nAMY Studios App connects Studios\n\nIn addition, the AMY Music DAO platform also wants to franchise musicians, services, and investors through a decentralized and sharing economy. The DAO ensures participants are also owners and reap the benefits.\n\nWith the above facilities, I believe that this project will bring certain results in building and developing the Cardano community.\n\n There are many risks to the user experience, because of the increasing proliferation of cryptocurrencies. Therefore, the administration of the DAO isalways checkede, and continuously improved during the development process.\"\n\n\n\n", "q0r": 5, "q1": "\"The scheme provides a detailed plan and a specific program implementation time. The implementation time of the plans is quite long than 3 years, from M1 to M38. However, the planned roadmap is built in detail, very methodically, with a specific roadmap.\n\nI highly recommend this building plan. Especially building plans for the community to participate, there are opportunities to earn money in each stage of development. This is great for building and engaging the community effectively for the development of the project.\n\nThe budget is presented in quite specific detail. However, there is an inconsistency with the original budget of $250,000 compared with the breakdown of the budget plan of $2,134,650. It is recommended that the proponent clearly state this cost difference.\n\nThe project includes detailed information about team members, with professional experience, in charge of specific jobs. Easily identify personnel on the LinkedIn channel.\"", "q1r": 2, "q2": "\"The project states Milestones are publicly declared and available for verification on GitLab on products that are already live. However, on this presentation, I have not found \"\"Gitlab\"\" information yet\"\" Your project would be great if you could add enough of this explanation.\n\nSuccess is predefined, based on an existing community of 120K musicians and 20k vendors. The goal of the project is to attract 10 times that number to the community. Hope you guys succeed this time... This is a new topic, prepared with a detailed plan, and this project has been built on an existing community, with applications that integrate great features to attract the community. Good luck\"\n\n\n\n\n\n", "q2r": 4, "assessor": "z_assessor_1534", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is suitable for this challenge. They already have ARM Music apps with more than 120k users, now they want to shift it to blockchain platform. Music app is another important and popular app which may take blockchain comes nearer to real life. ", "q0r": 5, "q1": "The team is rich of experience and qualified.  Looking at their Github, websites and documentation, I am really impressive of what they have done so far. The team size seems huge, but I think they should estimate a rough number. The budgets are break down carefully, which more budget on W3, W4 (marketing and development), and W5 (Ownership transfer). I highly evaluated their foreseen \"Ownership\" problem and their solution, because this is important in music industry. In general, I feel optimistic about this project.", "q1r": 4, "q2": "The plan is clear and well defined. They have 5 stages, with the focus on W3, W4, W5. Since they are already developed ARM Music on another platform, so they know what to do when shifting to blockchain. What I want them to clarify is that to make clear the benefits of using blockchain (especially Cardano) for their apps. \nThe author gives some targets and KPIs but not so clear. They said \"We ar looking atat least 10x ths numbers with a minimum push\", does this mean 1200k musicians and 200k providers? How long they will achieve this? In 10 years or in the next 2 years? \n", "q2r": 4, "assessor": "z_assessor_1623", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This project is huge with reputable partners and a mass of resources that will make a big impact on the music industry. There will be no impact on Cardano. This project is not built on Cardano, it doesn't lay out any plan to associate with Cardano, and it provides no tangible impacts to the ecosystem, yet requests funds that are near the highest amounts that have ever been approved from Catalyst funding. This project just recently won the XRPL grant from Ripple (I couldn't find the amount), they have Pancakeswap and Uniswap listed on their website as associated organizations, and most of the blockchain experience is from Ethereum based projects. Not that these things are negative in themselves, it just demonstrates a lack of relevance to Cardano. I'm not convinced that the impact of this project does anything to come back around and benefit the source of where this money would be coming from (Cardano... if that wasn't clear). ", "q0r": 1, "q1": "This is an extremely long-term roadmap with so much detail that it tells me that the planning that went into the trajectory of this project is SO calculated. I think they know exactly what they want to accomplish and how they intend to do it. Based on the top-tier reputable partnerships, I can't imagine this project failing. The experience of the team demonstrates a very capable level of talent contributing to this project that makes them competitive at a fortune 500 level. The LinkedIn links were very helpful in formulating this position. The budget could use way more detail. It's a $2.1 million dollar budget, which is only partially covered by Catalyst funding. This doesn't really surprise me given the scale, detail, and timeframe of this project. But especially with such a large amount for the budget and such a large amount requested from catalyst, we have to be absolutely certain that the money is being spent reasonably and efficiently. I do not expect a project of this scale to be skimping on any category. I don't think this is a worthwhile investment from Cardano but I do have complete confidence that this team can get the job done. ", "q1r": 5, "q2": "Despite all the tremendous detail given in the rest of the proposal, they still don't have enough information for this section. I partially expect that the previous sections are prewritten reports created for general proposal submissions but this section was quickly filled in by someone who was delegated the responsibility of submitting this one. There is a hint of quantifiable KPIs in the aim for 10x their current users of 120k musicians and 20k providers. I think this is far too vague because they do not provide a concrete timeline for that goal. They also don't provide any resources for them to report back to the Cardano community about their progress, which doesn't leave me with positive perceptions that they are committed to impacting the Cardano community. Especially because of the variety of blockchains they are working with now, I think there needs to be measurable/quantifiable metrics for what impact they intend to make on the Cardano ecosystem, specifically.  Overall, I think that relevance needs to be made known. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The problem described in this proposal is closely aligned with the challenge. With experience in the music industry, I am aware of the difficulties that an artist undertakes in connecting with the right resources to be able to succeed. Musicians can sometimes be exploited by managers and agencies. Through a platform like what is proposed - there can be more transparency with contracts, payments and jobs within the music industry. The proposal appears to be a quality project that is novel and a viable application that can get built on Cardano. Although, the proposer doesn’t present how they will add value to the Cardano ecosystem – there was no mention if they would be integrating their platform on Cardano or how they would increase utility and adoption of Cardano. ", "q0r": 3, "q1": "The proposer presents relevant skills and experience of the team to implement the proposal. The links provided of each team members profile show that they are competent in delivering the tasks required. Also, and the fact that this project is already in motion suggests that they are productive. It also appears that they understand the type of team members needed to successfully implement the proposal. Information on the roadmap is suffice. Each phase is detailed and well thought about – I believe they have realistic timeframe to complete the work. Although the budget appears vague, it closely relates to their detailed roadmap as it clarifies what items the funds are allocated to. It raises concern that the requested amount is different from the overall budget. It wasn’t clear if they were funding the remaining amount themselves or it if it was already funded. The proposal articulates well on how they plan to implement their milestones, the resources needed and the technologies that are required. The challenges and risks that they foresee have been touched on. Though it would give me more reassurance of their ability to scale if they provided more information on minimizing future risks and their strategies to resolve future challenges.", "q1r": 4, "q2": "The proposal shows clarity in the roadmap – each phase was very detailed and with realistic timeframes to complete the work. The key metrics and goals presented were sufficient as they monitor the progress and define the success of the project. With the information provided it was clear to understand their targeted problem and how they plan to solve it. Auditing the project was a smooth and easy process.", "q2r": 5, "assessor": "z_assessor_1953", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Let’s fix this and connect Musician, Services & Investors/Fans like never before with a decentralized economy: DeFi, NFTs, Payments, Giver.", "experience": "decades building products used by millions of pèople or building teams to oversee products used by millions. Redbox, vodafone.it, easycoop.it"}