{"id": 398556, "author": "bhavishramaswamy", "title": "Basketo Finance", "url": "https://cardano.ideascale.com/a/dtd/398556-48088", "category": 26438, "amount": 25000, "description": "Investing in crypto is not an easy task for the new users and managing the crypto portfolios is such a hustle for experienced investors.", "f6_no_assessments": 5, "f6_rating": 2.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"id": 496, "q0": "It's not immediately clear what the central value proposition is. At first it seems to be the idea that it's \"difficult for newcomers to buy crypto\" which is a decent problem statement, but then it's not clear what the advantage would be of this solution over relatively simple apps like coinbase, etc. \n\nThe most interesting bit (I think) is rather buried in the middle of the impact section, and it is given one line: \"Every time your basket is copied, you earn royalties\" -- now that is unique and interesting! \n\nTwo elements are especially troubling for impact: \n\n1) There is no mention of Cardano or ADA in the entire proposal. The demo video fills a whole basket with Cryptos and Cardano is not one! I don't doubt that Cardano would be one of the options that an investor COULD put in their basket, but in terms of specific impact for the Cardano ecosystem, that does not appear to be in the purview of this proposal.\n\n2) In the risks section, they raise some considerable risks, but no mention is given to how confident they feel in mitigating or overcoming those risks. High marks are reserved for those who are aware of their risks AND demonstrably able to surmount them.\n\nFor a better score, I would primarily be looking for a value proposition for Cardano specifically. Additionally, dialing in the focus on what makes this application different and better than other platforms.", "q0r": 2, "q1": "Both the budget and timeline are extremely high level. There is nothing provided that could constitute a detailed plan. There is no detailed description of the team they have, or the team they need. (a list of job titles does not suffice)", "q1r": 2, "q2": "The primary mechanism for auditability is an open/public backlog and scrum board. \nFor better marks in auditability, I would like to see better-quantified milestones. A year is a long time, so we need to have some mile-markers along the way -- what can we expect to see completed in q1, q2, etc?", "q2r": 4, "assessor": "z_assessor_1180", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1327, "q0": "The proposal tries to create an app called Basketo, that allows crypto investors to invest in crypto Baskets and also helps to build baskets and manage their crypto portfolios, they also provide a video demonstrating their MVP version. The team has interesting ideas but the proposal lacks much crucial information that made me doubt the team's abilities to execute the plan successfully. Also, the proposal does not articulate clearly how the app will add value to the Cardano ecosystem, even on the demonstration they use a Near protocol. The proposal has provided several potential risks but does not give a plausible solution to overcome them.", "q0r": 2, "q1": "The proposal has milestones and a roadmap consisting of quartal, from Q1 to Q4 2022. However, many of the milestones are not clearly defined, for example, in Q2 the proposal stated ‘marketing campaigns and educate the basket investing’, how many campaigns are will they do and what are the measurable goals? How many people are they gonna target to educate? etc. The team only provides a very simple percentage of how they will use the budget without giving broken-down information on each expenditure. Too much information for the budget is not provided, for example, the proposal stated support team for the core developers cost 70% of the budget, how much of those money goes to the paid developer? Is there any server cost? Is there any hosting cost? or buying a domain name? Since many expenditures compromise engineering, it needs to be written in great detail. The same goes for the marketing, branding, and content creation that need to elaborate more. The proposal only stated the roles need for the team without giving further information on the background, relevant skills, and experience of the team member. They also don't give a LinkedIn profile/GitHub account and thus made the community hard to verify their abilities.", "q1r": 2, "q2": "The proposal stated they will use scrum methodology for the project development, also the open scrum board will be made public on the JIRA tool hence making the community easily track the project development progress. The indicators of success are ambiguous and need to elaborate further, how do you know people/users enjoy investing in a basket? is there gonna be a survey of user satisfaction of the product? Is there any target for unique active users of the app?", "q2r": 3, "assessor": "z_assessor_1342", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1508, "q0": "[Disclaimer: This proposer has submitted this same proposal twice in the same category with only the problem statement slightly changed. These two proposals (and its assessments) should be merged into one, I have voiced this in the CA telegram channel. Until this merge is complete, I will post the same assessment in both of these two identical proposals.\nProposal 1: https://cardano.ideascale.com/c/idea/397957 \nProposal 2: https://cardano.ideascale.com/c/idea/398556 ]\n\nBasketo is trying to help investors to build and manage their crypto portfolio, they cleverly call a set of currencies for a basket. It allows people to build baskets and let other people use their baskets to earn royalties on. This is enhanced by minting each basket as NFT's and they claim that you can view your positions in 360°. This stood out as a bit unclear for me as a reader and would like to have this clarified. It seems like a fun gimmick more than an necessity, but overall, the concept is fun and engaging. However, some usual questions come up when dealing with these topics and the authors have acknowledged them to a degree. Security being the primary aspect that is unclear in the proposal. In order for the project to be impactful it has to be functional and secure, this is not addressed fully in the proposals current state. \nAll in all, the proposal is well aligned with the challenge setting and it is impactful, there are some things that have to be cleared up which leads to a resulting score of 4 stars in terms of impact.", "q0r": 4, "q1": "The detailed plan is laid out quiet sparsely given the complexity and unknown variables in the proposal. It does not mention the building of the secure wallet and no QA or security aspects are mentioned either. It is hard to assess if the team has the required knowledge to complete the development and implementation of their project. Also, there is no way to further verify their experience which makes the team less credible. To summarize, there are many unknown factors for being such a large project, it is not possible to deem the project feasible. The total score will be 2 stars (1 +1 for providing a good foundation of plan/milestones/budget).", "q1r": 2, "q2": "The project will have a public scrum board as well as published reports enabling the community to audit the progress of the project, this is great in terms of auditability. The definition of success is a bit vague but the main problem with the audit section is the lack of clear KPI's and goal setting. This should be added in order to receive the highest score in this section, for now the proposal will receive 4 stars in terms of auditability.", "q2r": 4, "assessor": "z_assessor_139", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6588, "q0": "Basketo is a portfolio management system that is designed to help crypto investors. I think that this can be a useful tool in the cardano network. I definitely will solve a problem that is worthwhile solving and something that I would personally use instead of the good old spreadsheet. Nevertheless, I saw that the video demo is in the neo network, but the proposal did not mention if they will build this from scratch in the cardano network, or use a bridge to bring this product over.  I recommend to the proposer to add this information for more clarity. That said, I think that this can be a great product in terms of its impact in the cardano network.\n", "q0r": 5, "q1": "I can see this proposal getting successfully implemented based on the demo MVP. However, I have to consider that the MVP is in the neo network which I suggest the proposer to explain that. Other than that, the proposers have identified the team needed to execute the project. I think that it’s a good sign. Another big part is the budget breakdown. I recommend the proposers add more details to the budget. I think that altogether, the proposal can be implemented but the proposers have to make some improvements in order to increase their chances of being funded.", "q1r": 4, "q2": "The proposers have provided a roadmap going from Q1 to Q4. This will allow the community to track the progress of the proposal. The proposers have also included metrics/KPIs that define success. Altogether, I think that the progress of this proposal can be tracked, based on the informations included by the proposers.", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10612, "q0": "This proposal offers the opportunity to build and invest in a basket of tokens. There are a few projects doing this(Bishares & Index Coop are a few that comes to mind) so the idea is tested and there is a demand for it. Having Cardano's version of an index fund protocol would be good for the ecosystem. The idea of creating your own basket also reminds me of Balancer and BeethovenX. In short, it's a great idea and will bring a lot of versatility and strategies into Cardano's DeFi. I am curious how the royalties would work out and whether each basket would be personally owned by the user or be a pool anyone can enter in. The challenges presented in the proposal like rebalancing portfolios and buying/selling the tokens are the meat of the problem though. This proposal would benefit on including some technical details on how that would be done. ", "q0r": 4, "q1": "The roadmap does not share enough information to seem feasible. The proposer is looking to deliver a testnet version by Q1, which I assume is for 2022, and that does not seem like enough time considering most of the challenges listed by the proposal has not been answered yet. More technical details would help the proposal. Will the tokens supported by Basketo be Cardano-exclusive or across many chains? Will this allow me to create a basket of tokens that generate yield, and stake them for passive returns? There is also insufficient information on the team working on Basketo. A github is shared but activity seems sparse. Due to this, readers/voters cannot judge on whether this proposal will be implemented successfully. ", "q1r": 1, "q2": "The proposal is offering to set up a scrum board for the community to track progress. There are no quantifiable metrics for auditing success. Some KPI that could be tracked, as a suggestion: how many tokens are supported, how many users are onboarded.", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Basketo allow crypto investors to invest in crypto Baskets and also helps to build baskets and manage their crypto portfolios.", "experience": "We are the early investors in crypto & the developers who are migrated to blockchain technology. we faced many challenges while investing in crypto. paying gas fee, platform fee for transaction is an expensive thing, one need to bear every single time for creating the portfolio."}