{"id": 398559, "author": "jcaso", "title": "C64 Extension Wallet", "url": "https://cardano.ideascale.com/a/dtd/398559-48088", "category": 26438, "amount": 32940, "description": "Wallet extension that provides a sovereign, customized experience for users and devs by supporting P2P, NFT, Identity, Voting as plugins.", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "We have seen many wallets where there won't be much user facilitating UI or in some condition UI would be present, but wont work properly in the time of need like Wazirx.\nSo bringing all the required UI for the user such as P2P, NFT, Identity, Voting as plugins, definitely helps users bringing interest towards this wallet ,by consolidating other funds under same account ,This proposal effectively addresses the challenge.", "q0r": 5, "q1": "Creating trust towards this wallet is the biggest challenge for this project, and maintaining the server if more users join at same time would be challenging one.\nOther than that the proposer has well experienced team who are working on this project, it has provided excellent pop up idea which wont be much difficult to achieve ,hence with given experience and plan presented it is highly likely this proposal will be implemented successfully ", "q1r": 4, "q2": "The proposer has failed to explain the marketing strategy of the model, or any give away that would be provided for the users.\nExcluding the above points, the proposer has provided demos which are great, it has provided budget breaking and  roadmap in an excellent manner, the proposer has even mentioned the team and partners with whom he'll be working with, therefore the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is implemented in line with the guidelines for proposal submission. It lays out a clear use case that fits the challenge, and then gives the voter a clear and concise explanation of how and what it is going to take to complete the proposal. They do acknowledge and inform us that they will need more time and funding than what will be given for this funding round. They do a good job at breaking things down for future funding rounds. This will be a great DApp to have for the ecosystem and challenge this proposal is aiming for, and the team will be building out a suit of useful tools for regular users, and is also trying to appeal to the developer community with advanced plugins that will be regularly updated over time.", "q0r": 5, "q1": "The team writing the proposal do a good job at instilling confidence in the reader about the teams understanding of the area they want to work on. It dives in deep about the future roadmap of the proposal, far beyond one funding round. They are letting the community know what they expect to achieve for this funding round, and seem confident in their own ability to deliver on what they say. Based only on the information provided in the proposal, which i did not verify, the person i identify as the team lead is definitely   qualified to do the work and planning for the proposal. There is just a ton of information in this proposal. With a bunch of videos as well talking about the projects they have been involved with, and much more. If anyone is interested in the topic of DApps and integration, i highly recommend giving the proposal a full read through, and then taking a look at the other information posted. If you want to get involved, this is a very welcoming community, and i am sure you can find a way to give value to  Cardano and the crypto space as a whole.", "q1r": 5, "q2": "  The team says they will give updates bi weekly and report these directly to the Catalyst Team. These updates are very well defined in the proposal, so the community can be informed if they are meeting their goals and milestones. I like how they went into detail explaining basically the project from start to finish, and with their explanation of allocation of funding, the reader gets to know they are committed to the proposal.", "q2r": 5, "assessor": "z_assessor_1959", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement in this proposed a good fit for the challenge. I was trying to get an understanding about what the proposer means by wallet extension that provides customized experience for users however there is a clarity in the proposed solution description, and that for me is a good effort. New use cases and plugins I believe are additions that create more user experiences of every blockchain, having this in Cardano is a good mark for the ecosystem. However, proposal seeks to offer some kind of service to users which are already kind of existing in Cardano blockchain, so I hope these new use cases are to be introduced will bring on onboard unique features so that user experience can be increased.", "q0r": 4, "q1": "The team’s information and relevant experience described gives me the confidence that they are well equipped to execute the project. The number of team members appear to be  3, requesting for a budget of 32,940 $, considering the challenge specification of the budget with respect to the number of team members, I believe the budget adheres to that rule and it’s reasonable to achieve the set goals. The plan provided is comprehensive however, “tentative timeline” is somewhat confusing. Why tentative timeline? It looks like the timeline is not good enough for the execution as things can be done in a rush or in hesitancy. I will advise that the tentative timeline caption be made clear in next time proposals.\nHowever, the proposer has captured the challenges/risks that may arise during the execution of the project, that’s ok.", "q1r": 4, "q2": "The roadmap is well described together with the milestones and time horizon (definite). What success looks like for the project is making available the wallet for download in the detailed web browsers, I am certain that the KPIs stated are right indicators for achieving that desired outcome. The problem is presented clearly and the proposed solution is also clear and effective to address the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The challenge at hand being wallet extension that would give custom experience for users and developers by supporting P2P, NFT, Identity, Voting as plugins. The proposer is trying to solve this challenge by designing and implementing a progressive modular extension wallet that would allow addition of new use cases in the form of plugins therefore this proposal does address the challenge", "q0r": 5, "q1": "The proposer and their team have previously worked on a proposal funded in Fund 5. After going through their skill and LinkedIn links giving in the proposal. It can be said they have the needed experience and skill to execute this proposal. The proposal contains explanation on how this proposal will be helpful to resolve the challenge, plan and how it will be implemented with all these given info it is likely the proposal will be implemented successfully ", "q1r": 5, "q2": "The proposal do contain a clear step by step roadmap with timeline which will help to track the progress of the proposal. The proposal has given a complete list of key performance indicators will be useful for auditing and also giving definition of success. it also has clear budget breakdown. All these information provided should be enough to audit the development of the proposal and also to measure success of the proposal.", "q2r": 5, "assessor": "z_assessor_937", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Design and implement a progressive modular extension wallet that facilitates the addition of new use cases in the form of plugins.", "experience": "The team has wide professional experience as full stack developer, real-time processing, mobile applications, sys admin, devOps, and SPOs."}