{"id": 398508, "author": "gulla0", "title": "Artverse - Social Media Metaverse", "url": "https://cardano.ideascale.com/a/dtd/398508-48088", "category": 26438, "amount": 27800, "description": "Lack of user-owned, metaverse based social media with wallet to wallet social interactions on Cardano.", "f6_no_assessments": 6, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal meets the objectives of the challenge well, because here we seek to create Dapps that are impactful for Cardano in the sense of attracting new active active members to the community, increasing the volume of Ada and CNFTs in circulation, in short, promoting the popularization of our blockchain. The idea in question is about creating a platform (from what I understand, it would be a mobile application), called “Artverse”. In short, it would be like an interaction between digital wallets, that is, users could see the NFTs that others have, interacting through likes, comments and shares (that is, web features2); and in the future, when the project evolves, some web3 functions will also be available, such as the integration of a Game Fi system. I found something very interesting because it is very geared towards arts and interaction between users, like social media itself, but I have some observations to make. First, would the amount of Ada (or other cryptocurrencies) in these wallets be hidden? Because I don't think it's interesting for this information to be shared, users probably wouldn't want that either. Second question: how would people find out about this new social network? I think that for a social network to become relevant, it needs to be very popular, many users interacting with each other and generating engagement; the issue of marketing in my opinion is always essential for the success of any project, but in relation to this one, it is even more so, so I wish the proponents had focused on that since the impact. Another thing, I think it would be interesting for proposers to conceptualize what a Game Fi system is, because not all CAs/proposal readers may be familiar with this concept. I personally don't know so clearly what this is, so I'd better understand what will be implemented from the one if the proponents had attached that explanation. It would be interesting for them to exemplify this with projects that are already being promoted today. I found it very positive that they attached a small video, very playful, that talks about the project, explaining in a direct and simple way what would be done. It's also great that they detail very well how Dapp would evolve according to the phases, punctuating the changes that would be generated, this makes us understand the evolution of the platform well. In summary, I liked the project, I think it is well aligned with the challenge because if this social network bursts, it can organically bring new members to Cardano, who can become interested in the functioning of our ecosystem and get involved with other technologies pertinent to our blockchain. Therefore, I will give it 4 stars, if some doubts that I explained were resolved, the note would have been the maximum. \n", "q0r": 4, "q1": "The attached schedule is satisfactory, although it could have been more detailed. We know that phase zero would start after funding and end at the end of the second quarter of this year or the beginning of the third quarter. We also know which activities will be developed and how many weeks they would last, approximately. I found the temporal notion to be very well established, however, the detailing in relation to some activities themselves could be more in-depth. For example, in “UI/UX Design”, we know into which parts this task would be divided (“Lo-Fi Wireframes” and “Hi-Fi Wireframes”); we are also informed of the progress that has been made so far, through the link that is made available from google docs. That is, on this task, we have a very solid understanding of what has already been done and what will be done next. However, in “Technology”, this activity is only conceptualized as “Fullstack Web and mobile dapp”. Non-tech people like me don't fully understand what this means. It would be interesting for proponents to attach an accessible explanation of what Fullstack web would be and why it would take around 12 weeks to develop, along with the mobile Dapp. Now talking about the budget, we have to keep in mind that the requested money would only cover the expenses of the zero phase of the project; It would be interesting for bidders to let us know when it would need to be spent in total, with the development of the other phases, and if they will try to fund future Catalyst funds or try to raise the money in another way. The budget explanation is satisfactory, we know into which parts the total amount would be divided. As with the roadmap, some of them are better explained (eg “Fullstack Mobile Dapp Development: 360 hours @ $35/h = $12,600”. We know how much the hourly rate would cost for this task), while others are just quoted (such as “Web Dapp Development: $10,000 flat fee.” Why is this fee flat and why does it cost $10,000?). Overall, I found the budget explanations to be good, but it would be ideal if all parts were explained in the same level of detail. Finally, speaking of the team, I think this part is average. We do not have the same level of detail regarding all team members; Ideally, everyone would have presented their names, a short resume (with previous experience included) and their linkedin profiles, so that we could know their careers accurately. It also worries me that only Sam Jeffrey seems to be a member of the Cardano community, having studied Plutus, it is not clear if other people would be used to dealing with the technologies pertinent to our blockchain. So, I think the auditability is ok, it basically provides us with everything we need to know about how to carry out the project, but it could be better detailed. \n", "q1r": 4, "q2": "Proponents provide good ways for us to measure the progress of the process. According to them, weekly meetings will be held with the Cardano community through Discord (I understood that these meetings would be directly for community members, but maybe they are with some IOG coordinators, I don't know). I think they are quite right when they say that the feedbacks will be qualitative and quantitative, because in my view it is essential that we analyze the projects to be developed in these two ways. It is also important in my view that we can be aware of the work routines of those involved, so here's the suggestion: in these meetings, in addition to presenting partial results, proponents can update participants on whether there was any dissonance in their work plans , and if so, how it was overcome. They provide the link to discord and also state that the gitghub repository will be open so that we can check the more technical issues directly. In other words, in my perception the auditability of the process is perfect. Talking now about monitoring the final results, success will be considered when the platform reaches 100 thousand users and also by the indicators “bring user ownership of social media platforms and use to earn savings” and “implementing Participatory Decision Making ( PDM) in the user economy”. I think the proponents only focused on Dapp, when in fact we also need to understand how this project would have consequences for Cardano. I would like them to outline measurable ways for us to know if the specific objectives of the challenge were achieved, if Dapp contributed to the popularization of Cardano and what that process was like; if the number of Ada being bought and delegated has increased, if more people have become active members, if there has been an increase in the minting of NFTs on our blockchain and so on. It is important that all this is studied and properly reported to our community, it can be through discord itself, which is the bridge they will establish. Finally, like the other topics in the proposal, this one is good, just needing some improvements. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "The idea proposed is innovative and seems like a good implementation to the Cardano Ecosystem, I'm really excited to see its potential. A well created decentralized social media could create a HUGE wave of new users to Cardano, despites tribalism, could become  a hub for all Blockchain users, and maybe one day, all users.", "q0r": 5, "q1": "The proposal already shows some early signs of progress, giving the project more probabilities of success. The proposal shows team members with evidence to support their experience (sidenote: next time add the LinkedIn as Hypertext, makes voters jobs easier ;)) Timelines are clear and Budget seems quite right.\n One doubt I have is about promotion, how will the team handle promotion? since no budget was asked for the task, is the team handling that on its own? that´s a big part of every project and i´m not seeing it reflected on the proposal.", "q1r": 5, "q2": "Direct auditability with the community is a huge + and the project should be pretty auditable with the UX testing and Discord reports. On objectives, \" Onboarding 100,000 profiles onto the platform.\" when is that expected to, for the end of phase 0? its a long term goal?", "q2r": 5, "assessor": "z_assessor_1190", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The problem is well defined and the solution is clearly suggested. This ambitious proposal aims to create metaverse based social media with wallet to wallet social interactions. This has the potential to attract many users to the Cardano ecosystem when it is a fully fledged dapp. \nI would categorize this proposal under between the “smaller teams” and the “people with relevant background” category in terms of the challenge’s Campaign Brief. Taking the above into account, I believe that this initiative aligns with the challenge. ", "q0r": 5, "q1": "The budget was laid out item by item and the costs accurately line up to the total funds requested. \n\nThe team has a white paper and started with a Low Fidelity Wireframe. For those unfamiliar with the concept of Low Fidelity Wireframe, please check out this article: https://mockframe.com/what-are-low-fidelity-wireframes. The team has also designed web app that can connect to your NAMI wallet. I tested it out and it can show my NFTs and I could select one of my NFTs to be my profile picture.  \n\nReference links has been provided for 4 out of 5 of the team members. The team’s education and experience consist of UI/UX Product design, communications design and Plutus developing. One of the team members is also a CTO of a Cardano blockchain project and has 3 Plutus tutorials on YouTube. \n\nSeeing that the team already has a MVP and has the required education and experience for this proposal conveys conference that this proposal will be successfully implemented. ", "q1r": 4, "q2": "The milestones have clear timelines that are laid out in terms of weeks. \n\nThe proposer will measure success by number of profiles on-boarded (100,000), implementing Participatory Decision Making (https://en.wikipedia.org/wiki/Public_participation_(decision_making)) and bring user ownership and use-to-earn economy. All these can be easily measured. \n\nThe risks for this proposal are identified with possible solutions. Since this is an ambitious project which is dealing with some developments that are still in early stages, there is a possibility that the solutions suggested may not hold. On one solution a risk still needs to be explored and another solution relies on technology improving in the future. It is not to say that the technology will not improve or the solution will not be found. But this is a little concerning as now we are moving more in towards the realms of uncertainty instead of calculated risk. ", "q2r": 4, "assessor": "z_assessor_1602", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Creating a 2d version of social media where people who want to join the Idea scale platform can follow, chat, share and post their ideas not without on proposals but can use videos, demonstrations and even get to add their wallet to earn more individuals joining the platform.\nIn this aspects an individual can also promote his cardano social plat to a business one as well.", "q0r": 4, "q1": "So far so good the idea scale platform is moving at a fast rate day in day out we get new members to join, based on this platform i see it to be interesting.\nMany teenagers of our time may see this platform and join but will not take it seriously but i insist with this good proposal if the idea of making a new platform being like a social media many youth are going to love it and will take it serious but not just have interest in it but will see the main platform to be fun and the younger they are the smarter they aswell so they get to build on more great  ideas and get to earn a lot because it is profitable and not a time wasting platform due to my experience ", "q1r": 4, "q2": "The information provided is more than enough because everything was detailed perfectly and i totally agree with the proposal.\nIdea scale is a great platform but with this proposal i think is going to make this webpage go greater and bigger because is going to spread across the globe within seconds, Many social media are only for fun but with this idea is going to be a fun interest for many lives. Someone out there is looking for a platform to share his/her idea but has less financial background but with this the individual has to just register and have the courage to share the ideas and will be funded to progress with the idea brought up.", "q2r": 4, "assessor": "z_assessor_1785", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "As an Active Catalyst member building on Cardano and a Technology builder I strongly agree that this proposal effectively addresses the challenge objectives.\nThe problem is well articulated and the solution is creative and very appealing.\nIf the project is completed and launched it will drive more users and usage of the Cardano Blockchain, more transactions will be created and even tokens (as NFTs) will be minted/transacted.\nIf phase 0 is completed, then the following phases will create even more traction and usage, scaling the solution very well.", "q0r": 5, "q1": "The team is very diverse in term of roles and expertise, experienced and a good fit for this project.\nThe timeline is specific by each stage and seems appropriate for the scope of the project, with clear milestones and outcomes.\nThe budget requested I think is a little low, from what I would've asked but considering the details provided per role, hourly costs and effort it is coherent with the stated objectives.\nThe risks identified are clear and even though they are complex, as they involve attempting to connect multiple wallets to a single profile and a mobile version with a nascent SDK, the team seems well prepared and experienced to mitigate them.\nMy only concern is that in the development phase there will be two projects in parallel, the mobile dapp and the web dapp, which could impose some challenges in terms of governance and managing the two towards success with a non that big team. But it seems that the team is confident and with their experience I think they will be successful.\nAs a suggestion for the continuation proposals, I'd add more details on how you will attempt to solve the technical challenges you have stated (your experience or methods to deal with that and an explanation of what if that can't be solved), also it will be great to see an explicit business model, at least some ideas about it, on how the platform/solution will become sustainable.", "q1r": 4, "q2": "Per the details provided both in how the project will be managed, the timeline with their partial stages and deliverables and the outcomes expected for this project I firmly believe that the community will be able to effectively track the progress of the project and audit the return on intention.\nThe project is ambitious and will be a great addition to the Cardano's Family, as can be seen on their Definition of Success:\nOnboarding 100,000 profiles onto the platform.\nBring about user ownership of social network platforms and use to earn economy.\nImplementing Participatory Decision Making (PDM) in the user economy.", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Artverse is creating a social media metaverse where their authentication and initial identity starts with their wallet. Users can share their NFTs and like, follow and engage with other members on the network. In terms of how the proposal addresses the challenge the proposal team provided a list of security aspects rather than why their application could help with adoption in the Cardano ecosystem. It would be good to understand in future proposals what is novel in their proposal against other applications in the space and then on from that how they will try to drive adoption and usage to get the project started. The risks cover more technical aspects of the project which are noteworthy. The proposals do not highlight the issue around privacy and how by making these wallet addresses public they reveal people wallets that they store NFTs. Highlighting this is a risk on personal security and how this should be mitigated with information in the application and potential solutions to help people keep their privacy would have been welcomed. Another area that is not considered is the impact of the chicken egg problem on this project. Social networks are notoriously hard to start and the project in its early stages is similar to that of Instagram. With Instagram soon launching integrations for NFTs this risk has not been added and the ways that they will make novel solutions along with a way to scale the network initially.", "q0r": 3, "q1": "In terms of a roadmap the team breakdown some of the areas that will need work and the number of weeks to complete. No depth is added to the tasks. A document is provided that shows some wireframes of what some of site may look like. A demo app is provided. For budget breakdown the items have been given hourly rates and hours needed to create the total for each area and a combined total. The team have provided a list of members and also their LinkedIn profiles that helps to provide some evidence towards their backgrounds. There is moderate confidence that the team should be able to execute the proposal given the evidence of initial work made by the team and their background sources.", "q1r": 4, "q2": "The team intend to share their updates through their Discord that they are using to manage the community around this project. The team will be looking for qualitative feedback to help improve the evolution of the project on a regular basis. The team mention the Github commits will be part of auditability which helps highlight they intend for the project to be open source in the near future which is good for auditing and also education for the wider community. The team state that onboarding 100,000 profiles onto the platform would be seen as a success. This value seems very high considering it only being for phase 0 of the project. For this small budget even 1000 profiles can be seen as an impressive achievement due to the difficulty in getting people to use social networks. Another success outcome is the mention of a use to earn economy. This again is not mentioned in the phase 0 part of the evolution. The success criteria should focus on the proposal that is being implemented. How do we determine whether this first stage of development is a success and should be further funded to attempt bigger things? Currently the success outcomes seem to focus on longer term outcomes which mean that the team may not be able to effectively demonstrate what the short term successes are which at this stage are more important. ", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "User-owned, decentralized metaverse with wallets as profiles. Wallet-profiles can follow each other & interact with NFTs(like/share/comment)", "experience": "Satwik Gade: Brand Identity and design. Media communications\n\nHarsha Gullapalli: UI/UX Designer & Project Management\n\nSam Jeffrey: Full Stack Developer (Cardapper) & Plutus programmer\n\nSrinivas Vijayakumar: Web Developer, Generative Artist"}