{"id": 398691, "author": "lloydduhon", "title": "Urban Farmer dApp", "url": "https://cardano.ideascale.com/a/dtd/398691-48088", "category": 26438, "amount": 15000, "description": "Food insecurity is a global crisis. Supply chain issues are making the problem more acute. Localizing food production fights this directly.", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=26986"], "media": [], "f6_assessments": [{"id": 1392, "q0": "- Proposed Urban Farmer dApp presents an idea in a clear challenge: build a Dapp that connects small farms with advanced consumers its high performance. This proposal belongs to a large array of Blockchain applications in life, which is \"Supply chain\". It was needed to drive Cardano's adoption to life. This dApp will create a significant community of users for the Cardano ecosystem. This project responds to potential directions of challenging KPIs by integrating an existing product category (farm management tools) with the power of smart contracts (smart contracts that manage traceability standards). food origin) and is likely to expand in the future.\n- The proposal is divided into 2 phases: phase 1 - product research and development; stage 2 – actual development. It set out to build the market reach of Dapps. Primary users are small-scale farm operators who have or want to build vertical farms 10,000 square feet or less to feed their local communities within a 20-mile radius of their location. To accomplish this practical goal, they are developing a user interface/UX for the application itself, possible end-to-end products to handle the transportation and management of crop rotation, in partnership with the university's Local implementation of UX/U. They will also build the code needed to create the NFT containing all the food traceability requirements on the testnet and integrate it into the application, and will also build the DAO and move assets into it. Thus, this solution will eliminate the intermediary factor in the circulation of goods, reduce costs and time, ensure the quality of products, thereby helping small farms have a better opportunity to consume products. Consumers have the opportunity to directly approach farmers. Especially, the solution also takes advantage of the power of Blockchain technology to connect IOT, NFT, Smart contracts.\n- The proposal has measured risks in the implementation process. Firstly, full implementation of this dApp requires side-chain capabilities with Cardano; the second is the application for small farmers, need to localize their tool into many different languages ​​​​to be widely adopted, and the group's solution is to market to small farmers; The third is that regulatory changes to agriculture also present risks to continued operations. Of the three identified risks, only one solution has been proposed for the second risk. I suggest adding shipping risks and some product problems.\n\nI agree with 4 points", "q0r": 4, "q1": "- The plan presented in the proposal is reasonable for the solution at the early stage. The work done has been identified with reasonable timelines: application process design to be completed by the end of May 2022. UX design to be completed by the end of June 2022. UX design will be coded in an application by the end of July 2022. Deploying the harvest data as NFTs for traceability will be encrypted into the application by the end of July 2022 and the NFTs on the test network will be generated from the collected data directly on the farm. By the end of October 2022, there are at least 10 small farms using dApps for farm management. At the end of 2022, there is a RESI native token accepted by the dApp. By the end of 2023, we plan to turn the system's source code and management responsibilities into a DAO and allow the community to shape the future of the system through democratic action. Progress is updated on the web for easy checking and tracking of results. However, an important part I have not seen in the process of the proposal is the Smart contract programming plan (directly related to the conditions of purchase, sale, payment ...).\n- The budget of the proposal is less than 20% of the full challenge budget. Reasonable, detailed budget plan: UX Design: $4,800 2 FGCU Intern Designers @ $15 per hour for 4 weeks, Back end Coding: $5200 5 weeks for Full Stack developer, Plutus Coding: $5000 3 weeks for Plutus Developers.\n- Team members are qualified and experienced people, suitable for specific jobs and roles in implementing the proposal. There has been a reasonable assignment for each member. Team members all have information that is easy to verify via Linkedin.\nI agree with 4 points\n", "q1r": 4, "q2": "- Only commit to publicizing the product when it is time to complete the interface and back-end. Evidence and testing should be provided for all stages as outlined in the blueprint.\n- Successful projects will produce products as committed, create benefits for farms and consumers, develop Dapps on the Cardano platform. The proposal will be more convincing if it provides data criteria such as cost reduction? How many users?…\n- Proposal is available at fund 7 but not yet funded. Go to Fund 8 finalize the proposal, improve the budget and add a Full-stack developer to the core team.\nI agree with 4 points\n", "q2r": 4, "assessor": "z_assessor_1356", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 7339, "q0": "I think this proposal is great and fits very well with the objectives of the challenge. In summary, the idea here is, in the words of the proponent: “develop a dApp that helps urban micro farms operate and expand”. We know that nowadays there are already several people growing organic food in their own homes, either through traditional and vertical gardens, or also for economic or ideological reasons (eat healthier with food from their own backyard). Despite being an activity that is still very niche to me, it is something that tends to become popular over time, as people spend more time at home (we know the effects of the pandemic on most workers: many people started to operate, at least in part of their journey, from a home office), and with that they develop hobbies. The wave of healthy and organic food also tends to grow, in my point of view, as people become aware of the harm that pesticides do to our body and how the slow food movement is gaining strength. Anyway, I said all this to justify the relevance of this Dapp, which when seeing invests in something really promising. As the proponent says, this application would be endowed with various activities, such as “providing cultivation instructions for specific crops”, “providing an API to collect data from environmental systems and IOT sensors” and many others. One of the most interesting functions in my point of view is to help people find these urban farms close to where they are, this is certainly something very important, because many times these things happen without their own disclosure and the food ends up not being used. as due. I think that helping people to connect, using our blockchain technologies, with the aim of maximizing the activity of micro-sized food cultivation is something that is very much related to sustainability, which is one of the pillars of Cardano. Regarding how this can all benefit the Cardano ecosystem, the author of the proposal explains the various ways our technologies would be used in his application, such as, for example, all food-related data would be minted on the Cardano blockchain, at some point in time. project payments (sale of food and etc) could be made with Ada, also the fact that the application would be developed, as far as I could understand, by students from a Design school (the funding money would go to help them); In this way, we would indirectly be meeting the goals of the new members onboard challenge, as these students would get to know Cardano and learn about our ecosystem while building a Dapp that would work based on our technologies. So, I really loved this idea and I think it will benefit the Cardano ecosystem in many ways, creating a relevant Dapp that will help popularize it and build on some of our technologies. \n", "q0r": 5, "q1": "The viability of the project is very high, but it could still improve in some ways. The script is quite clear, but we do not have much detail about the activities that will be developed. For example, the UX design will be done by the end of June 2022, as other steps are correlated with time. Regarding temporality, it is very clear what will be done and when, but not how. As it is a very complex project, permeating several tasks performed by different professionals, I believe that the visualization of the process is good, but it could be even better if the proponent detailed this schedule in more detail. For example, we know the design will be developed until June, but each month, what progress will be made? Ideally, I think this schedule should be done like this: divided into months and those into weeks, so we could understand very clearly what would be done, how and when. In general, I think this part of the proposal is good, but it could be even better. Turning now to the budget, I think the amount of money asked is adequate for the complexity and size of the project, and we also have two positive points here: the fact that the team has already obtained funding in other ways and they have already tried Catalyst in the background. 7, did not succeed but also did not give up, which shows persistence and effort as they perfected the idea/proposal. Now talking specifically about how the 15k orders will be used, the total amount is split between the pay for the design interns and the backend and plutus developers. I found the value of these salaries quite compatible with the market. My suggestion here would be that, as was done in the case of the intern, specifying the developers' working hours as well, in order to increase understanding. And finally, in terms of the team, I think they could be more detailed in this part. We know who the 3 permanent members of the team are, their names and their linkedin profiles, where we can find out in a proven way their previous work and in which professional area they are currently working. A short summary of their CVs and what roles they would play in this project were also attached to the proposal, as well as information about how they relate to the Cardano ecosystem. However, these explanations are quite succinct, they could be more developed. It would also be important, in my opinion, that we had knowledge about the design interns, and how they would be guided. \n", "q1r": 4, "q2": "The auditability of this project is quite secure. Starting with the fact that we have an intense detail of the process, what would have to be done and approximately when. With that, we know what to expect and we can monitor whether things are going as planned. This process auditability would be further improved if a weekly schedule, with probable dates, were created. That way we would have more material to be monitored over time. However, as it is, I think we already have good material to carry out this analysis, because in terms of impact, the proponent also details a lot of what would be found in the application, so we could establish periodic meetings with the project team in order to know if these small parts are actually being created, such as the guides on how to grow each specific food. We know what is expected as partial results, I think these meetings could be done monthly, that way the community would always be on top of project updates. This could happen between some community members and the team, and the result of the meetings could be summarized in a very summarized and accessible document for everyone, which could be forwarded to the rest of the Cardano community. However, in addition to my suggestion, the team already promises to show the partial results “live and a public sandbox”. What would that be, exactly? Regarding the result, we do not lack several pieces of information to be monitored. The team informs what the final goals of the application would be, like contributing to the problem of hunger, for example, and many metrics are also established, which can be easily verified, of what would have to be ready by a certain moment. In other words, I think it's a proposal that provides several ways to audit and that's why this part of the proposal deserves top marks. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 378, "q0": "The central idea of ​​the project acts on the problem of food distribution, promoting a more dynamic and healthy way of producing food in urban environments. We know that the problem of distributing healthy food is real, as well as the need for an increasing optimization of spaces, especially in urban centers. Another current quite in vogue is the desire of consumers to have as much information about the origin of what is consumed. With this, we can see that the Dapp being built has a good potential market, and its success would bring benefits to society, as well as greater visibility to Cardano's ecosystem. In this context, we have that the proposal fits the challenge in question, having an innovative concept and also helping to fulfill several premises of the SDG. Regarding the amount of funding being requested of $15,000 and considering what you want to accomplish, the amount looks right. We will analyze the proposal in more detail below.", "q0r": 5, "q1": "We see that there is already work done around the project, and that the budget being requested here is more focused on some finalizations, aiming to complete the MVP. In fact, this is a very positive point of the feasibility plan. It is known that the capital requested here will not be enough to complete the Dapp, but the team understands this and clearly demonstrates that the momentary objective is to have a product that is functional enough so that it can be tested and validated with a small group of farmers. Conducting the project this way seems like a great strategy for validating the concept and mitigating risk. Regarding the details of the actions of the feasibility plan, we observed that a good part is the description of the functions of what the application will perform, showing that the team understands well about the scope it should have. But the description of actions is not limited to that, we also observe a very detailed roadmap, giving a good focus to the user experience, an essential aspect of the application, since many future users may not be so used to this level of technology in your business.\n\nRegarding the details of the budget, we noticed a good allocation of capital, with a balance between the parts destined to development and ux design. We noticed, however, that a more specific concern with the marketing of the project would be interesting. Another point worth mentioning is in relation to the differentials that the application aims to provide in terms of monitoring information. We know that the recording of this information on the blockchain and its future follow-up are great differentials of the project, so it seems cool that it was demonstrated a little better what this information would be. It was also not very clear what the functionality of the ML algorithm mentioned in the proposal will be.\n\nRegarding the professionals involved, we noticed that they have very relevant experiences for the project in question and that their skills include not only software development, but also retail management and agribusiness knowledge. Another positive factor is that the curricula were made available.", "q1r": 4, "q2": "Regarding the methods chosen by the team to follow the evolution of the project, the main highlight seems to go to the established metric of having 10 farms using the beta version of the application, this seems to be the best way to verify if the assumptions applied in the development were successful. . However, we realized that some indicators could be better defined for a precise understanding of the results. Some possibilities would be:\n\nConduct a satisfaction survey with beta users and look for an average score that would indicate performance\n\nAsking what was the biggest benefit of using the app and why?\n\nAsk beta users if the current model appears to be scalable\n\nA positive observation about the project's auditability is also the future transition of project management to a DAO, there being even an estimated date for this to happen, around 2023. With this action, the entire community will be able to make decisions even about the ways to audit project results.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 976, "q0": "Articulates specific problem to be solved, and will effectively utilize the Cardano ecosystem to build the dApp (using smart contracts, utilization of side chain, building a DAO, and connection of community to find prospective users).  The team reports that since not being funded in Fund 7, they continued work and now plan to have back end of the dApp built by the conclusion of Fund 8.\nCA notes that this includes Sustainable Development Goals, which paint a picture of even more long-term impact the team hopes to make through building this dApp.  This too reflects well on the Cardano ecosystem, as it is yet another impactful solution to a real problem provided through the Cardano blockchain.  Future possible obstacles are listed, and the team plans to utilize colleges and monitor new technology improvements and availability to mitigate these challenges.  Though nitpicky, CA wishes to let the team know that the proposal could have been better organized, as lots of Feasibility and Auditability information was listed in the \"Impact\" section.  However, all the information was ultimately there.  Rated 5 out of 5.", "q0r": 5, "q1": "The team's skills are listed clearly and CA is confident that they have the relevant skills to execute the project as evidenced by a clear roadmap, years of experience, LinkedIn profiles.  Their description of their project shows a simple to understand \"big picture\" view of solving the problem and indicates a working knowledge of the problem they are addressing.  The team lists relevant technical skills in their arsenal to accomplish their goal.  The budget is brief but clear and covers projected costs, but CA also notes that other funding sources are available to this project if extra is needed.   Bases covered, 5 out of 5.", "q1r": 5, "q2": "The proposal features a brief timeline and budget, but keep their KPIs measurable and output specific, including a projected launch date for the dApp, a plan to have 10 small farms established and utilizing the dApp, further goals to integrate use of the RESI token, and establish the DAO.  A live test environment will be provided by July 2022 so the community can track progress of this project.  I'm excited to objectively see this one flourish. - 5 out of 5.", "q2r": 5, "assessor": "z_assessor_1250", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1608, "q0": "The idea of ​​the proposal is to build a DApp to track food through the data collected from sensors. These sensors can be temperature sensors, counter sensors (for counting quantities of food) or pH sensors. All sensors are connected to each other via IoT and transmit data to DApp via API. The proposal to solve an essential need in today's life is to track the supply chain, which eliminates the 3rd party intermediaries to cut costs, bringing Cardano closer to life. The proposal is a perfect fit for the \"DApps and Integrations\" challenge. I quite like this idea.\n\nHowever, I have a few additional suggestions to make the proposal more impact:\n1. Provide more solutions on shipping and delivery processes. How to follow this process? (to complete the supply chain)\n2. When the product is faulty, how will it be handled, how will it be updated on the blockchain?", "q0r": 4, "q1": "I agree with the roadmap proposed here. Very suitable for implementing the proposed solution.\nBudget breakdown is reasonable, feasibility can be assessed based on this information. I have a small suggestion is to spend a part of the budget for marketing and hedge against price fluctuations of ADA.\nAll members have professional experience, with many years of working will help the project be successful.", "q1r": 4, "q2": "I would more agree with the AUDITABILITY section if it is suggested that you add numbers here to measure the success of the proposal. Such as:\n- The platform has reduced costs by $xxx compared to the traditional method (this will require a report for clarification)\n- There are 30 users (for example) who are loyal customers, continuously active on the platform.", "q2r": 3, "assessor": "z_assessor_1394", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Develop a dApp that helps micro urban farms to operate and expand, while making it easy for community members to order produce from them.", "experience": "Owner/Operators of Living Greens Urban Farm.\n\nMelannie Duhon: CEO with Entrepreneurship Degree FGCU\n\nLloyd Duhon: 25 Year IT veteran, CTO level experience. Cardano Plutus Pioneer 2nd Cohort.\n\nEric Montgomery: Developer with over 30 year portfolio creating business applications"}