{"id": 398871, "author": "ayaxlabombarda", "title": "Innovatio Web-App Investigation", "url": "https://cardano.ideascale.com/a/dtd/398871-48088", "category": 26438, "amount": 5400, "description": "There is a lack of tools to simplify crowdsourcing and encourage collaborations between members and entrepreneurs within Web3.", "f6_no_assessments": 3, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 7348, "q0": "I found the proposal interesting, but at the same time the proposer could have provided more details about the Dapp he will develop. We know that it will be a space where “the members of the Innovatio community (Entrepreneurs and early-adopters) can have greater functionality and facilities when it comes to networking and using crowdsourcing tools within the community.” However, this explanation should have been more detailed. Who are the members of the Innovatio community? What exactly do they do in this community? How could they become active members in the Cardano ecosystem? It's not so clear either how this Dapp would work; what technologies from our blockchain would be used here, what way this project would increase the number of transactions minted in Cardano, of purchased and delegated Ada, CNFTs and etc. I think the research itself is also poorly explained, in the following excerpt “Proposal resources will be used for research and a model of web design, with member profiles, community users' Twitter-like feed posts, features to encourage search for interns, redirects to platforms like Gimbalabs or Cardano AIM Mentory Platform, etc”, we were able to understand where that money would go. But this is not the same as having a solid view on what kind of data would be collected in the research, how the team of professionals would get in touch with people (who would participate in the research), anyway, in general I think it is not as clear as this work would be done in practice. So I think the idea is a good one and it aligns with the goals of the challenge, theoretically, as it certainly seems to be an application that will help popularize the Cardano ecosystem; however, in a more pragmatic view, I could not understand the activities that are developed here so well. I would like it to be better explained both about the current Innovatio community and how this research would be done in practice. \n", "q0r": 3, "q1": "The proponent informs that in the case of funding “we will determine that the research manager prepare a series of research and community outreach measures”; however, once again I reinforce: it would be important for them to detail very well how each survey would be carried out, which questions would make up the whole, and so on. Regarding the activities that would lead to the realization of the project, we have a somewhat superficial information about what would be done, we are not given a temporal notion, during the explanation of the financing we are informed that the project would last 3 months, so it would be It is important to understand how much time within this interval each of these activities would take to develop. I think it would be interesting for the proponent to better detail the temporal division into weeks. In my opinion, it would be interesting to know what would be done each week, as this would give us a more complete view of the whole. Now, speaking of the budget, the asking price is low compared to most proposals, however, an application will not be developed, but a survey, so it is quite understandable why 5400 dollars were requested. The explanation of this funding is very superficial too, it is divided into two parts (Development of Graphic Mock-Ups for better understanding of the visual experience: $3,000 + Responsible for the construction of the research structure: 800 x 3 months = $ 2,400). It would be the salaries of the professionals involved, but I would like to know how much time they would dedicate to this project. In the three months, would they work every week of every month? How many hours per week? If we had this information, we would be able to ascertain whether the amount asked was fair or not. Now, speaking of the team, they say they have a PDF in which they attached the information of each team member, but in the attachments part of the proposal I didn't find any documents. We do have a link attached, but I also didn't find information aimed at each professional. I think it would be better if the proposer had attached this information to the proposal itself, it's okay if it gets too long. I would like to know the names and resumes of each person involved, so that the whole team can be trusted. Therefore, I think the feasibility is not bad, but there is still a lot to improve, especially on the part of the team, where in the end I couldn't find the information mentioned. \n", "q1r": 3, "q2": "The proponent determines 3 KPIs to analyze for progress development (Members responding to surveys related to the survey + Members actively participating in what content the WebApp should have + Number of people involved in the survey, separated by categories). For ultimate success, he says, you would need to assess whether “the DApp we designed to encourage networking and professional collaborations yields clear results in terms of member engagement intent.” In short, this is what we have of auditability. It's not bad, but it's superficial, once again. I would like monthly reports to be prepared at the end of each cycle of the total time, so that we could evaluate how the professionals involved worked and also the partial results, based on the KPIs provided. And at the end of it all, I agree that it's important that Dapp viability is the core metric, but I'd also like to know how all of this would benefit Cardano in an exact and measurable way. It would be necessary for all this information to reach our community members, one way or another; for example, through our Telegram group, or discord, in short, some direct and simple way for us to find out this information. Therefore, I think that this part of the proposal is also just average, and deserves to be better explored. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1513, "q0": "The proposal requests funding to research the market and take their first steps in developing a sophisticated crowdsourcing tool. There have indeed been issues identified with connecting people though Project Catalyst and adding the Innovatio solution on top of this problem could help both communities become more efficient. Leading the implementation of their solution with a research phase is a great idea and proves proposes scope and ambition of the Innovatio platform. This is a research phase and the proposal is not a perfect fit in the DApps and Integrations category but there is neither any other perfect category to suggest. It could be placed in the Misc. category but the alignment of the proposal is about the same in both of these categories, in the end this will not affect their score in any way. All in all the proposal is a continuation of a project from earlier funds, the scope is realistic and the risk is low. The proposal will receive 5 stars.  ", "q0r": 5, "q1": "The proposal seems feasible given the proposers history of delivering in earlier funds. The budget is short and reasonable for the amount of work needed. The only problem with the feasibility section is the somewhat general \"detailed plan\". In order to increase the feasibility of the proposal, a real detailed plan and roadmap with refined details should be provided. But again, the scope is rather limited and only some minor changes would increase the rating from a 4 to a 5 star rating. Score given: 4 stars.", "q1r": 4, "q2": "The KPI's chosen for the auditing are relevant and measurable. This is a good example properly identified KPI's that is easy to audit and follow up for the community. The definition of success is also good given the scope of the research project. There's not much to point out in this section, the resulting score in terms of auditability will be 5 stars.", "q2r": 5, "assessor": "z_assessor_139", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6803, "q0": "Starting from the fact that it will be a decentralized web platform, this proposal already fits as DApp, so the challenge is adequate. In addition, as an integration in the cardano community, it will act as a center between entrepreneurs and people who soon adopt this technology, establish a contact network and can create things together.", "q0r": 5, "q1": "This idea is basically an investigation into a possible platform in cardano, so the risk is low and the task is not too difficult. Seeing that behind it there is a team that is developing more complex things and they are clear about how to allocate these funds to see what is expected of a platform like this, the proposal will be carried out.", "q1r": 5, "q2": "Although the information provided is simple, it is sufficient to control this proposal. 3 KPIs are provided that are more than enough in this case and the success will be a useful dapp design for a large number of people in Cardano.", "q2r": 5, "assessor": "z_assessor_470", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Develop a Web-App where the Innovatio community can develop more professional profiles and have crowdsourcing tools.", "experience": "The Innovatio brand started in Fund 3 and consolidated since Fund 6 with 3 funded proposals, we are a team with experience and background in the Catalyst community and digital spaces, solid teamwork with work done, check external links and PDF."}