{"id": 399165, "author": "otaviolima", "title": "Keyword Coin Price Widget for Sites", "url": "https://cardano.ideascale.com/a/dtd/399165-48088", "category": 26438, "amount": 47800, "description": "Know the real-time price of a coin or token in a news keyword, without having to go to external sites like Coinmarketcap or Coingecko.", "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"id": 4302, "q0": "The problem raised is \"know the real-time price of a coin or token in a news keyword, without having to go to external sites like Coinmarketcap or Coingecko\". And this proposal suggests the solution is to implement a powerful widget embedded directly in the keywords (hotwords) in the news of the cryptocurrency sites. And along with this feature, users will not need to leave the page to consult the currency price on external sites such as CoinmarketCap or Coingecko, which brings great speed and favorable the user experience within the news sites. This will likely attract more users to the platform. In addition, the proposer presented the challenge of successfully implementing the project (the integration of the widget script by the content portals that cover the crypto world) and also has a plan to solve this problem. I suggest that the proposal should say more about where the above solutions will directly affect the Cardano ecosystem and can expand in the future or not. As such, that will help increase the impact of this proposal.", "q0r": 4, "q1": "\"To evaluate the feasibility of this proposal, I would like to make a few comments as follows:\n- In terms of time, the proposal offers a 5-month plan roadmap in small lines. Each month will have its own specific work to be carried out. From my perspectives, this part is pretty good. However, it is possible to break it down by weekly milestones and even better if there is a specific date. Futhermore, a good plan shows not only how many are listed, but also how the tasks in that plan will be completed. Similarly, if any work has been done, it should be noted down so that the community can follow up promptly and make accurate assessments.\n- In terms of budget, the total required budget for the project is $47800. And it is allocated by work item (8 separate components). In my opinion, I think the proposed budget is divided quite reasonably: How much does it cost to hire staff for a month and how long does it take? Media and marketing costs are also listed.\n- Regarding personnel, I really like the author's presentation in this part. It's a little unfortunate that the author has not given the total number of team members and will need more people. Even though, the proposal also described information of the key members of the team. Besides that, references and link to their LinkedIn profile are provided, which very few other proposals cover. As such, the community can easily verify their capabilities and experiences that the proposal offered.\nWith the above comments, for the feasilibty as a whole, I guess it deserved a 5 star score.\"", "q1r": 5, "q2": "Coming to the Auditability section, the indicators given are quite clear, but the project should have good time-framed KPIs with target which helps to evaluate the progress as it evolves and have a reference whether success was achieved or not. Besides, how can the community track the progress of the project? Are they regularly updated and where? Likewise, It is also possible to extract some good milestones from the schedule or roadmap which helps to keep track of project progress.", "q2r": 4, "assessor": "z_assessor_1717", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the comments and feedbacks, very interesting and valuable! We hope to count on your support and deliver a great project. Great idea to break it down into weekly sprints, we've received some feedback and will implement a public and open board in JIRA, as well as releases with development status and also publishing progress on social media."}, {"id": 4394, "q0": "The main aim of this project is to provide a widget that is inserted directly into the keywords in the news content of cryptocurrency websites, displaying real-time price & info about coin or token. This feature helps users will not to need to leave the page to consult the currency price on external sites, bringing great speed and improving the user experience within the news sites. I think this proposal is in line with Challenge's KPIs of integrating with existing products and providing a good experience for the user. The required budget of this project is $47,800, this budget is in line with the requirements of the Challenge, the team behind this project has the relevant competencies, experience, and technical skills to the field of the project they are pursuing, it can be verified through the Linkedin profile of the personnel they provide, the proposal outline is also detailed. The feasibility and successful implementation of this project are entirely possible. The proposer has presented us with full information on how the feature works technically, risks and mitigations.", "q0r": 5, "q1": "The project development plan is clearly outlined, the project implementation time is divided into many small phases, at each phase the proposer lists the main tasks and parts of the feature to be completed, the appropriate timeline to ensure the successful completion of the stated objectives. The budget is allocated based on the main resources that build the project, to increase the quality of this project I encourage the proponent to allocate the budget at an hourly rate if possible. The core members of this project all have a deep understanding of the field of technology and cryptocurrencies, and work experiences and skills related to the project area they are pursuing. Besides the descriptions and biographies of the members, the proposer also provides us with Linkedin profiles to prove their competence. In this section, they have described the necessary information very well.", "q1r": 5, "q2": "In the Feasibility section, I saw the keyword “social media”, but in this section, I did not see the proposer providing any environment/tool ​​to communicate about the project KPIs. The people who exciting about this project do not know how to access information about project progress and ongoing activities. The KPIs proposed by the proposer lack a roadmap that includes timelines and realistic metrics to measure project success. The plus point is that I saw the keyword “validation of feedback and platform improvements” in the previous section, which means they seen user experience as a KPI to measure the quality of the project.", "q2r": 3, "assessor": "z_assessor_1724", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Excellent points and feedbacks raised, we appreciate the almost maximum grades for all topics. We will implement a JIRA public and open boards tool, bringing visibility to deliverables, sprints, as well as publishing releases with development status and publication of advances in social networks and news on specialized sites. We count on your support and seek to improve our score even more."}, {"id": 7362, "q0": "I'm not sure if this project is as impactful for Cardano and if it meets the goals of this challenge well. Here, we are looking to fund Dapps that somehow benefit the Cardano ecosystem. According to the challenge description, some specific objectives would be: increase the volume of Ada in circulation, increase the number of CNFTs traded, digital wallets based on Cardano blockchain, add new active members to our community, etc. This project aims to create “a powerful widget embedded directly into the keywords (hotwords) in the news of cryptocurrency sites, so for example, if someone is reading a news that talks about \"\"Cardano\"\", that term will be \"\"emphasis\" and hovering over it will open an overlay with real-time currency price information, volume, % up or % down, etc.” In my view, this is not so necessary, we can access this information very quickly on specialized sites for this, such as the coin market cap, for example. This information can be obtained in a fraction of a second. In addition, this information would be made available for some currencies, according to the proponent, as well as main terms that are part of the cryptographic universe. Therefore, it is clear how this project would not only benefit our blockchain, but several blockchains and currencies. For these reasons, I don't think it's that interesting for us to fund this project , it is not cheap, it would be 47,800 dollars invested for something that will facilitate access to information that would not only say about Cardano and its technologies, besides that, in my opinion, it is already quite simple to have such information, on account of of specialized and quite reliable sites about it. Therefore, my final opinion is that the impact of this proposal is relatively low for the expansion and improvement of our blockchain, compared to the other proposals present in the challenge. The proposal is not so intensely disconnected from the objectives of the challenge, but it also does not meet them with specificity. \n", "q0r": 2, "q1": "The feasibility of the project is very good. Starting with the script, we know exactly which activities would be developed each month. In this way, we have a very solid and secure understanding of the construction process of this widget. I believe that I have no criticisms to make about this part of the proposal, because the script is already exactly the way I always suggest in my evaluations: short time allocations and a chronological listing of the tasks to be developed. The only point that could be even better would be, in my opinion, that the activities could be better broken down, for example, in month 2 the “Validation of requirements and design” will take place. How would this be done? How long of the month would it take? And who would work here? However, providing more details would be an increment, as I really think that the way it is presented to us, the script is already good. Now speaking of the budget, the requested amount is divided into very clear parts, it is also very simple to understand how it would be used in practice. Again, my only suggestion is that these explanations were even more detailed, for example, we know the monthly salary of each professional involved, but we don't know how many hours they would dedicate per week to this project. If information on the value of their working hours were provided, we could understand even better how the money was being spent. Finally, analyzing the team, the way the professionals involved in the project are presented is really very good. We know exactly what we are dealing with as they provide their names, their main professional attributions and a rich detail of what they have done before. Their linkedin profiles are also provided, through which we can verify all the information said. Therefore, on this part, there is certainly a lot of confidence that the team is prepared to carry out this project successfully and safely. Therefore, I would say that the feasibility of the project is great, as we are provided with all the necessary information so that we can understand about the project development process, how the funding would be used and who are the people who would execute this proposal; certain that some increments could be made (in script and budget), but only to improve the level of something that is already satisfactory. \n", "q1r": 5, "q2": "I don't think the auditability of this proposal is very good, because the indications pointed out by the proponent for us to monitor both the process and the final results are very quantitative, not allowing a broad analysis of what is being done and obtained. For example, when it comes to widget building, progressive success could (according to the bidder) be measured by the following statistics: number of script impressions + number of coins listed + integration with content sites according to roadmap. However, following only these numerical data would not provide us with a good view of the whole, of what the daily work of professionals would be like so that the desired partial results are obtained. Fortunately, we have a good roadmap attached to the proposal, so it is quite possible to audit milestones reached each month. It is simple to solve this issue, it is enough that, somehow, the proponent and his team inform the Cardano community if the tasks planned for that month were actually accomplished and if there were any problems during the process as a whole in that period of time. This survey can be informed through a simple report, or even a brief message, which can be posted on any discord channel dedicated especially to monitoring proposals financed in the current fund. Regarding the final results, the data provided for analysis are 2 quantitative (number of triggers and overlay widget view and number of integrated content sites) and 1 qualitative (CTR: ratio between impression and widget click). However, in my view, none of these indicators can explore whether this project was indeed beneficial to Cardano and how this impact is perceived. Therefore, it is somehow essential that the proponent and his team research and study how the project specifically relates to our ecosystem, what were the gains for Cardano, if any of the specific objectives that I mentioned in the impact were achieved, etc. This information should also reach the community in a simple and direct way, through a synchronous meeting, for example, after or during Town Hall. In other words, the auditability of this proposal is not completely absent, nor is it adequate, requiring real improvements. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 7, "ne": 3, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "(Impact / Alignment Note) - We appreciate your feedback and will try to improve our delivery. We believe that we can bring much more visibility to the tokens and the Cardano ecosystem with the use of a widget on news sites, it is not easy to be reading a news and knowing the price of a Cardano token not yet listed on big sites.\n\n(Auditability Note) - With the feedback received, we will improve our auditability, with the inclusion of an open public board in JIRA, for monitoring the development and delivery of programming tasks, as well as publishing development releases and also disseminating deliverables on social networks, for better monitoring. and transparency with the community. We count on your support in the proposal and possible improvement of our grades."}, {"id": 8592, "q0": "The “Keyword Coin Price Widget for Sites” proposal is requesting funds from the Cardano Treasury to develop a plugin that will display hovering info boxes showing up-to-date prices of cryptocurrencies on websites to choose to implement the feature. \n\nThis solution may partially address the challenge setting requirements in theory, but I see multiple problems with implementing this idea in practice. These could result in severely reducing its impact and encourage the developers to consider them for the next iteration of the proposal, if it will need to be resubmitted.\n\n1. The first one is related to design, implementing hovering info boxes containing the price of cryptocurrencies over words in an article will most likely lead to a cluttered presentation (imagine if multiple cryptocurrencies are discussed in an article and each one has a hovering info box above it). Note: I have experience with app and website design so this is not an observation that lacks any kind of backup.\n2. Secondly I don't see any real plan of popularising this product and getting it to be implemented by a larger number of publications except for the proposers' very own (https://cardanofeed.com). Why should the Cardano treasury fund the writing of code that will just sit in a Github repo? That’s the question most voters will probably ask themselves. \nThis is correctly identified as a risk by the proposing team, however, there isn’t sufficient detail about how they plan to address this challenge.\n3. The idea behind the proposal is to have this plug-in work for all major cryptocurrencies, while that's not necessarily a bad idea, and I don't see any explanation or details in the proposal to indicate how this would benefit the Cardano ecosystem specifically.", "q0r": 3, "q1": "The proposal has a very clear and detailed implementation plan which proves the developers have given thought to implementing this solution.\n\nThe budget is sufficiently broken down and provides a clear picture of how the funds would be allocated.\n\nThe reason why I deducted a point from the feasibility score is because of the fact that some of the budget estimates strike me as very low. I acknowledge that personnel costs can be heavily dependent on the location of the developers, but still considering that the budget is estimated for approximately six months I foresee some concerns around the feasibility of the project arising from that.\n\nThe team is described in great detail, links to their LinkedIn profiles are included in the proposal and as such, I was able to verify the credential and experience claims made. Given the skill set of the team, they should be able to successfully implement the scope of this proposal if funded.", "q1r": 4, "q2": "The proposal contains sufficient metrics, KPIs, and clearly defined milestones to allow for a smooth auditing process in case the project is funded.\n\nThe reason why I have substracted points from the final auditability score is because:\n\n1. I would have liked to see some actual estimates for the metrics the developers will be tracking, for instance: “Number of coins listed - 50”.\n2. The definitions of success section of the proposal, is basically a list with another set of metrics to track. This is not a problem in itself, but the fact that these also don't have any values attached to them is even more problematic as it doesn't satisfy the requirements for properly answering this question.\n\nIn conclusion, I would recommend improving the definitions of success section, preferably with milestones defining success over time (3, 6, 12 months) and adding quantifiable values to the metrics.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for the feedbacks and excellent comments.\n\n(Impact / Alignment Note) - We agree with you and have defined that the widget can only appear in a maximum of two currency words (the hottest and the ones that appear the most), thus bringing a good usability and user experience. We will try to include the widget in several crypto sites, there are more than 500 specialized sites that could use the solution.\n\n(Feasibility Note) - We have full control that we will be able to deliver the solution within the presented budget, even if it is reduced compared to other projects.\n\n(Auditability Note) - Great feedbacks, we will implement these suggestions, bringing more time frames and in a more practical and objective way. Still, we will bring a public board in JIRA showing the deliverables and development, also contemplating development releases and deliverables published on our social networks.\n\nWe count on your support in this proposal and, if possible, revision of our assessment along with any comments presented. Thank you for your time and dedication!!"}], "solution": "Powerful widget inserted into keywords in news content of cryptocurrency websites, displaying real-time price & info about coin or token.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}