{"id": 399283, "author": "ditcameroon", "title": "beeDAO", "url": "https://cardano.ideascale.com/a/dtd/399283-48088", "category": 26438, "amount": 15000, "description": "--\n\nDelivery systems in Cameroon are mostly centralized and do not leverage advantages offered by the local transportation system context.", "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"id": 501, "q0": "Overall, democratized delivery system sounds like a great idea - Like \"Uber\" deliveries, created for a context (Cameroon) that does not have such an option yet. \n\nI do have some concerns regarding impact:\n1) I am not sure this project really \"needs\" the blockchain. The proposal mentions using Atala Prism for DID/reputation management, but other systems can do something fairly equivalent without blockchain. There is also a mention of tokenizing carbon offsets, but this is not explained much beyond that short phrase. I'd like to see a better explanation of the value of decentralization for this project and really, how it will work. Some acknowledgement that it will start out as centralized -  YOU are building it, and will have some notion of control in the beginning. You mention a DAO but not really anything about how that works. How does this product move from being your baby, to being a public utility? What does that timeline and process look like?\n2) Scaling for future or expanding to other markets is not really accounted for. The discussion here is that reputation scoring would be very localized, so I'm not sure how easily it could expand. I would see a higher impact score if there was some thought given to how this product may eventually be expanded to other markets.\n3) The only risk they identify is that they might not get funded, which is not a thoughtful or probably accurate answer. I'd like to see the proposers show more awareness of what challenges they may face. ", "q0r": 3, "q1": "I'm honestly not sure what the proposing team is pledging to deliver with this funding. In some places, this is presented as a research project, with the primary output being a fully researched Whitepaper and build plan. (That would seem like an appropriate deliverable for the amount of funding asked!)\nBut in other places, they mention delivering an MVP, and tracking payments on their platform and people signing up to participate in the DAO. I would like to see more clarity about what is being delivered. For the size of this budget, I would focus in on the research and whitepaper phase. Some details of what future phases that will lead to would be ok, as long as we are very clear what is being proposed for now, and what is future.\n\nI have some questions about the budget. It includes \"2 motorcycles\" in the budget, without any explanation. I'm willing to be convinced that 2 motorcycles are necessary, but no explanation is offered. Other budget items also leave out details that would help.\nNoticeably missing from the budget is anything about marketing -- if this proposal DOES claim it will lead to an MVP and the onboarding of users, as it does, then I would assume some effort to advertise, spread the word, create onboarding documentation would be needed - and this would cost something. \n\nOverall, My preference would be for this proposal to NARROW its scope to a fully-researched whitepaper, so that the next thing we vote on for the build is a well-documented and detailed solution for build and launch.", "q1r": 3, "q2": "The same confusion continues in the Auditability section, about whether this project is just to produce a whitepaper, or whether we are onboarding users, etc etc.\nMost importantly, this proposal need clarity and focus about what is being offered.\n\nFor auditing a whitepaper as a deliverable, I need to see more detail about where and how we can check on your work. Is there a website? Will research notes be shared? When and where will the final whitepaper be available to read?", "q2r": 3, "assessor": "z_assessor_1180", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Feasibility: The assesor states that we provide conflicting promises. We  clearly state in the begining: \"Our main objective is to conduct a deep research, complete our white paper and implement a MVP for a decentralized delivery system that leverage the thousands of motorcycles, tricycle taxi present in main cities in Cameroon.\" later on we refer to KPIs such as users signing up to our platform as measures of success (yes, this would of course be on a trial basis based on the fact that we are suggesting to deliver an MVP only) and we would use this measurable data to improve our platform.\nAuditability: As stated above we do have clear objectives here of doing research to create white paper and delivering a MVP DAO, the assesor seems to be thrown off by the fact that we also suggest being able to measure users onboarded. When we wrote this we were thinking about a functional MVP with minimal components to use as a proof of concept. This would justify then offering the service to users locally in order to test out and provide feedback."}, {"id": 4639, "q0": "The service cost of delivery due to this model may be significantly reduced. The scalability problem that DApps face on any bock chain may not affect this model as the number of transactions may be much lower. The platform can be best utilized by the grocery sector which is now plagued by lack of retailer's coordination and lack of reach-ability among the whole-sellers. Once this model tested and established, it can be utilized by any sector or personnel. Time and traffic may be major highlights but to achieve it, high level of optimization may be required.", "q0r": 5, "q1": "\"The main risk is that we do not get funding to pursue the work that was started a couple of years ago\" this was mentioned as a major risk, but to develop a complete project specification they require 3 months post funding; doesn't seem precise. The time for most projects needed is 8-9 months, considering the budget ask it is appropriate to develop MVP. A good team  of 4 with an average experience of 10 years in the field of project management and software development.", "q1r": 4, "q2": "The timeline in the feasibility section can be considered for audit. \"post 12 month 100users\" is a low number, could be increased to 500 given the 25 million population of Cameroon. The deliverables at the end of 3rd quarter could have been specified.", "q2r": 3, "assessor": "z_assessor_1748", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Auditablility: The assesor did not realize that this is for an MVP DAO, therefore 500 users that they suggest as a better KPI is unrealistic. We are aiming for a small but meaningful userbase to sample the project and use as a proof of concept to continue the project further."}, {"id": 8593, "q0": "The beeDAO initiative seeks to facilitate and implement a delivery network in Cameroon that relies on the already existing transportation infrastructure and all kinds of available vehicles.\n\nThe proposal clearly outlines the impact this could have on various groups, but what seems to be missing is a category dedicated to the impact the project would have on the Cardano ecosystem. This is not a great problem, at first glance as that impact can be deduced from the impact the project would have on various other players. However, the proposal doesn't clearly describe how it would integrate with the Cardano blockchain or ecosystem. Atala prism, tokenisation and CO2 tokenisation are mentioned in the proposal however I would have liked to see more details around these topics.", "q0r": 4, "q1": "The timeline given is for the first year of project implementation, it's easy to follow and makes sense however I would have liked to see some more details, especially since the same text is also copied for the definitions of success.\n\nThe budget breakdown is adequate and describes the expected project cashflow. Some of the amounts mentioned in the budget are incredibly small compare to Western standards, but given the team's location in Cameroon, I trust the team was able to estimate costs accordingly.\n\nThe team is very well described and links to public profiles are made available so that credentials and qualifications were easy to verify. Given the composition of the team, I have no doubt that the project can be successfully implemented.", "q1r": 5, "q2": "The details that the project implementers plan to track make sense in the context of their plans, but I would have liked to see more development-specific KPIs. Some of the metrics currently mentioned, such as “A fully functioning MVP”, are a bit too simplified and overly general.\n\nThe definitions of success given are a copy/paste of the timeline but they seem to make a lot more sense in this context.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "--\n\nPrototype and build a MVP decentralized delivery system that leverages moto-taxis to create a more efficient system for all players", "experience": "--\n\nWada Cameroon Hub:\n\n3 senior software architects and developers with 12+ of experienceNine interns and software developers actively learning Haskell, PlutusWada network of resources"}