{"id": 399391, "author": "booktoken", "title": "Book NFT Marketplace On Cardano", "url": "https://cardano.ideascale.com/a/dtd/399391-48088", "category": 26438, "amount": 49500, "description": "We don't own our digital books. Because of this, there is no secondary market for digital books like there is for physical books.", "funded": 1, "upvotes": 25753781, "downvotes": 18877850, "votes_result": 6875931, "votes_cast": 141, "f6_no_assessments": 4, "f6_rating": 3.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 2112, "q0": "The value proposal here is to develop a marketplace where readers can buy and sell their NFT books and creators / publishers get a percentage of the secondary sale in perpetuity. The concept sounds intriguing, and there can definitely be many arguments brought forward for why it might have a high impact: extremely powerful online retailers that squeeze publisher’s margins for example. However, there are also many weaknesses from my point of view, the first one being that the internet is already democratizing access to information and the cost for publishing a book / novel / anything written / video content is getting lower and lower, and the barriers to entry into the field are extremely low compared to 20 years ago. So I am neutral on the potential that can be brought by the blockchain technology in this space. ", "q0r": 3, "q1": "Behind the proposal stands a three person team that have done an excellent job at presenting themselves and their background: mostly in publishing industry and software development. The budget however lacks any kind of detail at all, and so do the timeline / planning parts. I think that we are having here a project that is still in its infancy (wireframing, bullet points, ideas, a vision) but not something that is quite ready to be financed and implemented.\n\nMy sincere advice for the team is to come back with an interaction of the proposal that lays out a detailed plan and a corresponding budget. At this stage I am afraid that not more than 2 stars are worth. ", "q1r": 2, "q2": "The team would allow access to their Trello boards, there would be monthly Twitter information dissemination, a Telegram channel and of course community access to public GitHub commits. The case for auditability is rather strong and worthy of all 5 stars.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5212, "q0": "This project is a brilliant idea! It's the same concept as musicians getting ripped off by middlemen. I think there could be more emphasis on this problem. I want to be seeing market research on the problem. Why are authors looking for this solution? How much are they receiving now from their work? Compare that to how much retailers and publishers are receiving. This section does an amazing job of explaining what it does in a logistics sense but I want to know what it does in a way that is quantifiable to the number of people (authors) that it can help. I also want to know a little more about this read-to-earn system. Is there actually revenue generated by people viewing the content in the CNFT or is it just royalties on sales? Will there be audiobooks available too? I LOVE this concept. It's innovative, new, and has high impact potential. I just have a few questions about these details. ", "q0r": 5, "q1": "I have full confidence in this development team if their experience is true. I can't verify it because they did not link their LinkedIn profiles. A few lost points for that. However, the experience of this team is perfect to make this kind of project work. The heavy knowledge and experience in the publishing industry will do wonders for the adoption of Cardano because of their talent and connections. (Side tangent) This is a major play for mechanisms of adoption. Authors from all over the world will come to this platform because of the experience of this team. Then, those authors will promote this platform through their fan following and convert more Cardano users. The influence of cultural leaders/thinkers is a powerful tool in moving culture and I want that power on Cardano's side. (End tangent) The roadmap looks thorough and plenty reasonable but I want to know what kind of timeframe they plan to produce these developing versions of the app. At least an estimation. The roadmap does not only have to include the development of the product. Information on marketing strategy and what kind of business/partnership tasks will be performed along the way. Also, the budget is not very detailed at all. $40k is a lot of money that is very vaguely labeled into the category of development and outsourced labor. That needs to be broken down so that I know the money is being spent efficiently. What do hourly rates look like internally and externally? Is this all labor? I also want to know how that $9k in business budgeting is being spent. I want to know where the marketing budget is. I am also very concerned about the serious miscalculation of the team in allocating only $500 for \"endless\" caffeine. This is very endfull. (Joking - not that concerned). This is just a good feasibility section. A great one would address the details. ", "q1r": 4, "q2": "They let themselves off far too easy in this section. They do get points for committing to public avenues for updates and accountability. However, they lose all the points for the lack of quantifiable KPIs in this section. There are vague references to \"millions of readers,\" but that's not concrete. I want to know how many partnerships in authors and publishers are being aimed for. I want to know how many users they want to see post-launch (granted, it may be a bit early for that). Even though a Catalyst proposal provides a bunch of money to new projects, I'd like to see fundraising goals from $BOOK token sales and private investors. There's a plethora of quantifiable metrics that could have been provided here that weren't. I love this project but I can't just let them off easy here. ", "q2r": 3, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6041, "q0": "The proposer not only identifies a problem or a lack in our ecosystem, but in the crypto ecosystem in general and the world of NFTs. There is still no platform for e-books and they propose themselves as the candidates to build one.\n \nThis type of business is high risk, because it is not known for sure how people will react to this proposal, but if it goes well, it would add a lot of value to our community.\n \nThe proposal is well framed within the requirements of this challenge, it finds a problem and they devise a highly complex solution.\n", "q0r": 5, "q1": "The proposers seem to be the ideal candidates to carry out a project of such magnitude, they seem to be well connected with the publishing world and have the necessary skills to face the business. But unfortunately they do not attach links that certify their statements about themselves and their profuse work. This is of vital importance in this field of the project.\n \nOn the other hand, their timetable is exceptional. Every detail is covered and leaves us with the impression that the proposers know exactly what steps to take from start to finish to carry out their business.\n \nThe budget is the weakest point of this proposal. It needs further breakdown so that the CAs and VCAs, and then the community, can evaluate whether what is being asked is fair. Nor is it a suitable space and time where a joke can be made, as is the case with the Red Bulls.\n \nA detailed and professional writing of the budget such as the one they carry out in the timetable and the proportion of links, would make this proposal a much more robust proposal than it already is.\n", "q1r": 3, "q2": "It's a good idea for the team to let us in to see their Trello tasks. It is an innovative idea that I see for the first time in a proposal.\n \nThe proposers offer us many channels to audit their daily work, and that is key. However, the lack of milestones and well-defined and detailed kpis (I repeat, in the same way as they exemplary did with the timetable) is a point against this proposal.\n \nThese two requirements are the only tools that the community will use in the future to audit the process of this project, so they can never be missing.\n", "q2r": 3, "assessor": "z_assessor_32", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7750, "q0": "This proposal identifies the problem which revolves around digital book industries. They’ve explained the problem of which about ownership and a secondary market for digital book (ebook) that is currently non-existent. This is because it’s hard to implement a digital ownership in a decentralized manner with an ebook, whereas we’ve been accustomed to secondary market for physical book in the real world. With this proposed idea, it is now possible to create a digital book ownership with leveraging NFT technology built on Cardano. This proposal will drive further adoption within Cardano ecosystem, by creating a dApp e-Book that can utilize NFT ownership over each book, readers can now own, instead of license, their digital books and can resell them in an open market with royalties goes directly to creators and publishers. As what Ben (the proposer) have said, unlocking the utility of Cardano for this market on an easy-to-use platform, can lead to onboarding hundreds of millions of readers and billions of dollars in digital assets.", "q0r": 5, "q1": "Although the impact is meaningful, the information regarding the team and operations is still lacking. They provide names for the team, but I can’t find their information further. It is not possible to track their record. Providing a LinkedIn profile would be useful so we could verify the team track record. The budget isn’t outlined and broken down in details, it only shows the general budget ideas. It is necessary to provide a detailed budget such as work-hour, budget allocation for resources and materials, type of people who does the work, and such, as it would give us an idea that this team knows what they are doing and have a concrete plan. The milestone also still lacking in details, it shows the general idea of what they are doing, but the solution aren’t provided in details. For example, how does the digital book assets is stored? Is it on-chain, or off-chain? If it’s on-chain, how can you fit megabytes of data into the blockchain, as the current smart-contract scripts only stores in kilobytes? If it’s off-chain, does it use IPFS (decentralized storage)? There’s still lack of technical detail that need to be addressed before deciding if the idea is feasible or not. All in all, although the project have a meaningful goal and impact, I have to give it a 2 star review because the lack of information and details with their overall project operations.", "q1r": 2, "q2": "The proposal have their milestones and roadmaps. However, the metrics/KPI needs to be detailed even more, such as KPIs for the number of books published in the first month, number of users, engagement / follower counts milestones, etc. This way, the community can audit the progress clearly and knows what to expect. Regarding the auditability, they will provide Trello boards, as well as uploading the code into Github repo, hence it will be publicly available. I give it a 3 star review, because of metrics should be provided in more details, also the overall description within the milestones that are still lacking of what is the targeted problem that are being addressed.", "q2r": 3, "assessor": "z_assessor_640", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We're creating a marketplace for NFT books. Readers can buy and sell. Creators and publishers get a % of the secondary sale in perpetuity.", "experience": "C-Level team previously built an eBook company that had 6M readers and 2M+ eBook titles. We worked with thousands of publishers and imprints including all Big 5 publishers. We delivered ebooks in bulk deals to Google, Apple, IBM, T-Mobile, Wall Street Journal, and General Mills."}