{"id": 399362, "author": "fhilip.k", "title": "Proposer-tool on chain - AIM", "url": "https://cardano.ideascale.com/a/dtd/399362-48088", "category": 26438, "amount": 34000, "description": "The proposal iteration and submission tool is centralized and beyond the ability to iterate by the community. Data is vendor locked.", "f6_no_assessments": 5, "f6_rating": 4.733333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 317, "q0": "The proposal would be within the challenge goal, this is a great idea, and I think that this proposal probably will increase utility & adoption of Cardano Project iteration and submition challenge and builted for a great community (all the community). \nAt the same time the statement of how problem is to be solved is explained with a technical elements of the offered services, with use case in details.\nThe proposer want to build a prototype proposal submission tool and draft a community effort for protocol level proposal submission, proposal iteration and submission tool.\nThe objective of the proposal is very interesting.", "q0r": 5, "q1": "The proposer team is well skilled about the whole context of the project and there are active member of the Catalyst Community that worked for years to improve the tools that anyone of us use (eg. Community Tools (Proposer/CA/vCA/Voter Tools and Community Landing page).\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…). \nThe plan for implementation is specific and offers much detail into the technical aspects like architecture, language and technologies for the implementation. The proposers have not mentioned some potential challenges and how they plan on solving them.\nThe entire budget requested is good relatet to an MVP, because it’s important to evaluate achievements and understand and evaluate feasibility. ", "q1r": 5, "q2": "The auditability here is good, because the author of the proposal outlines some KPIs that serve to monitor the direct results of the developed code: number of GitHub metrics and other statistics.\nThe success of this initiative, in my opinion, higly depends on the result of the MVO and on the community adoption.", "q2r": 5, "assessor": "z_assessor_114", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5811, "q0": "Move aside Ideascale! This creation of a community-led and community-built alternative is the moment we've been all waiting for. Essentially, it will be a better, more reliable and versatile user interface for ideation and collaborative proposal development, coupled with a backend that makes it possible to move the process on-chain. Both the fact that you have to pay a little bit to submit the proposal and that the data is \"stored immutably and forever on chain\" should take care of 99% proposal quality issues. This also means that the proposal authors are always able to show that they were the ones to publicize their innovation first if there will ever be disputes over intellectual property rights. Furthermore, it will enable easier DID integration for an upcoming reputation system that, in turn, will make sure that the assessment quality and the QA process will improve. All in all, this proposal makes it possible that we finally have a system that can be iteratively developed to serve the changing needs of the community. We will be able to experiment quicker and take advantage of new ideas and process innovations. Ultimately, if Catalyst one day becomes a legally recognizable structure (e.g. a Wyoming-based DAO), that entity could own this product and it could be sold to other parties, even in the mainstream corporate world. Huge potential impact.", "q0r": 5, "q1": "Okay, okay. Hold your horses! This proposal does not promise to build the final product but to complete the first step: user research and a minimum viable product. As anyone in the SaaS industry knows, developing quality software takes time. Only in this case, it's an open-source project that runs on blockchain. This means that, once the lads lay the foundation, anyone can offer interlinked solutions to be built on the protocol. Here's the beef: \"With a practical example it will be easier to identify possible gaps, collect feedback and engage people to start a conversation about possible updates and improvements as well to start defining collectively a mechanism to update the protocol itself. \" Needless to say, this MVP is the much needed first step. As for the proposers, Lucio, Philip and Victor (backed by the AIM development team and an external design studio) are THE most obvious choice when deciding who should be trusted with the develpoment of such foundation-level system. In time to come, they might want to add a few \"Naveeds and Nadias\" in the team but to get things going this trio is sufficient. They have experience of working together and they have shown the level of quality results they are capable of developing, both individually and together. The only caveat I see is the sentence \"in future iterations it could be temporary saved in a centralized environment to allow sharing before the final submission\". Collaborative proposal writing in the early stages is a feature that is needed from the get-go! The team is already thinking of an API-based solution but perhaps we could even initially live with an incomplete solution where the initial draft is collaboratively written in e.g. Google Docs (or in Aharon's alternative), it is viewed and improved based on feedback and only the final submission is saved on-chain before voting. This example shows that the proposal will have to deal, not only with software development, but requirements analysis as well. It's no easy task but these are the people to get it off the ground. I trust them fully. At this stage it is good to keep eyes and ears open and benchmark existing solutions outside of Catalyst/Cardano (see. e.g. what app.subsocial.network makes possible). As for the eventual roll-out (definitely out of scope for this proposal), it could be done in stages, e.g. one Challenge at a time, to make sure all gaps are filled and no \"serious money\" ends up getting lost before both the process and the UX/UI are honed to the most minute detail. Having said that, it will never be the case. This is an open-source process and product that always keeps evolving. And that's exactly why we need this protocol/platform. Maybe that first challenge could then be a Challenge that calls for wider community participation to improve the said protocol/platform and to build solutions on top of it. The sheer magnitude of possibilities is endless and, for that reason, this probably calls for a sidechain.", "q1r": 5, "q2": "The KPIs are quite self-explanatory as pretty much anything can be tracked in Github (commits, issues, pull requests, comments/feedback).\n\nI like the fact that the success factors are divided in \"bare minimum\" and \"beyond success\" to show what is realistic in the scope of this MVP proposal and what could be expected after that. There could have, however, been some clearly outlined metrics/goals. Finally, a detailed budget would be a must. Including those would have made this proposal perfect. Now it's only awesome.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5892, "q0": "idea is totally valid and proposal is well strucutured, with a clear problem statement (proposal iteration and submistion centralised not allowing much interatction with community) and solution that address that, levaraging blockchain solution possibilites. \n\nrisks identified are also well done and there's a mitigation plan for them. Other challenge I would add is regarding the transition bewteen the current process,with a 3rd party centralized tool, and the one with blockchain. I wonder the idea is to be using both for some time/funds, as people have a learning smothier curve, or if it would change completely, after validated. Each one has its positive and negative side and this change management is something to reflect about.\n\nFinally, the idea is aligned with challenge, being within guiding questions as \"What are the key applications that underpin the application ecosystem on other platforms\" and \"What needs do users of Cardano have that could be solved by new applications?\".", "q0r": 5, "q1": "Starting off with the team, AIM seem really capable of executing such project. It is formed by 4 experienced Cardano members with background in programming/development, project management and UI/UX, having developed already several other tools for Catalyst process. The only point here is that they still need to identify and hire a person for design studio. Also, linkedin links could be provided.\n\nThere's a clear and sensible time-framed plan with the main deliverables outlined. I'd also add here when they intend to hire the extra person they need.\n\nThe budget breakdown was not included in the proposal but it is in the comments section (probably proposer forgot). Its well done, broken down by role and acitivities and with the description of how the money will be spent in each budget line. It also seems to cover everything that will be done that is listed in the roadmap. Its imporant though that its listed in the proposal body because other people may not see it in the comments.\n", "q1r": 4, "q2": "There are good kpis listed, more related to the development of the tool and the interation with the community, and, because of that, it makes sense not to have targets pre-established. Also, as the scope of the project is limited to a MVP, it makes sense not to have usage kpis set, at first. Even so, it is mentionted as beyond success the full adopotion of the tool, which is nice to see it considered here.\n\nThere are also clear deliverables and milestones that can be extracted from the plan.\n\nAll in all, project is auditable.\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6211, "q0": "This proposal wants to explore the possibility of utilizing our blockchain environment to replace the current proprietary Ideascale platform that is used as a central, single vendor gate for submitting and tracking Project Catalyst proposals. Project Catalyst is the Cardano proto-governance component that currently facilitates the community-led spending of Cardano treasury funds on projects. I like that the proposing team is not overpromising a solution, as it is too early to do so. The proposed research into the feasibility of replacing Ideascale with a on-chain solution seems a good starting point with a Proof of Concept implementation The team specifies that \"The web-app will be connected to web-based Cardano wallets (like Nami, Flint, CC-Vault, GameChanger Wallet) and will allow proposers to submit their finalized project directly on-chain\". The team responded to questions in the comments with a very important clarification. The basic idea is to use the main chain, but in no way the full proposals will be published fully on chain. Great proposal as well as the plan to to use tx metadata to store hash, references and metadata of the proposal while keeping the proposal itself on an external platform. Key thing for Cardano is that it further addresses the problem of how to ensure decentralization of another part of the Catalyst process. I think this is a very valuable proposal for an integration - in this challenge. ", "q0r": 5, "q1": "The team does not overpromise. Kudos. It may seem simple, it may seem feasible to deliver the final solution, but it needs to be explored first. The team does suggest to deliver the research results and a a protocol proposal with a proposal submission tool + wallets integration Proof of Concept. If realized, the project will help the entire Project Catalyst community to make a crucial step towards \"vendor unlock\"- meaning liberating Catalyst from the Ideascale stranglehold, in yet another segment. The team has provided a reasonable half-year roadmap ending in a MVP as a PoC that can be tested. As regards the team composition, all of them are leading contributors to Catalyst and its tool/integrations scene. I have only good things to say about Lucio, Victor's and Phil's dedication, as well as other team members. This is a proposal that is fully feasible in my view. The team has provided a realistic budget breakdown (check the comments below the proposal on Ideascale!). I think that the team and budget are a good match for a feasible project. ", "q1r": 5, "q2": "The proposing team has dedicated a section to auditability with the focus on Github commits/issues/pull requests. I think that it would have been good to include a regular written update, on a regular basis (once a month?) updating the community in a summary written fashion - as not all Catalyst community members are familiar with Github - however this is a suggestion, rather than a criticism. I would feel more confident with a regular cadence of updates through weekly/bi-weekly summary progress reports that would summarize progress in digestible form for outsiders - who are looking at the project's progress from the outside. Especially as some of the components are not as tangible as code, but involve preliminary research, choices that need to be made on the solutions and technologies to be applied. The team does specify that the research and the choices made will be documented and open-source, which is excellent! I would suggest that not only the choices be made public - but especially the decision-making mechanism and how were some choices made and why were other options rejected - so that the thought-process can be followed. The team does envisage to improve through the number of feedback received and implemented, however it would be good to specify public channels (not only Github) for providing feedback when it becomes possible. The auditing will be made easier also thanks to the budget breakdown. \n", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8059, "q0": "\"As the proposer mentioned, an alternative to the current proposal submission on-chain is necessary and should be built soon for getting rid of the potential risks that the proposer described. The proposer has a good awareness of the current and future situation of the Cardano Project Catalyst and proposed a detailed direction to solve those problems by making a usable MVP with the necessary features for practically testing in the community. This will help them easier to identify possible gaps, collect feedback and engage people to help update and upgrade the solution. The proposer has a very detailed explanation about the context of the current system, so that's the reason why I can easily understand their purpose, direction, and solution made in the scope of this proposal. In addition, the technical explanation is also very easy to understand with some short explanations and example processes. As their word, I think this project will make a big impact on the Catalyst project. \nLast but not least, some risks are determined, and I believe that they're bullet challenges that they have to face in a long time for maintaining the system. And the proposer seems to have good experiences with them, so that made their way to solve very clearly and easy to understand. Moreover, they also make another proposal to directly solve one of these challenges. \"", "q0r": 5, "q1": "\"The proposer provides some more content about the direction that they will use for implementing the MVP. And a short and clean roadmap was made to nail what they will do for acquiring that product. Moreover, the proposer also listed the detailed deliverables to help the community easily identify what exactly this project will help to the Catalyst project. But the budget breakdown is lacking in the proposal, I think that the proposer wants to attach the required budget into the roadmap but somehow forgot. For that, it's hard to assess the reasonableness of the budget because we can not identify which part of the activities will consume how much money. \nAnyway, the key members that will run this project do not only have experience in development but also with the Catalyst project. So I believe that they know and bring the best solution to improve our ecosystem and particularly the Catalyst project. I will rate this for 4/5 because lacking a budget breakdown. But I think the total required budget is sufficient in the scope of this proposal. \"", "q1r": 4, "q2": "They were funded in fund 7 and that proposal is on developing. Moreover, the provided key metrics all make sense enough for the community to track the progress of the team. The proposer also provides the detailed outcome when this project is successful. I hope that this proposal will be funded to make the Catalyst project platform better in the future. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Build a prototype proposal submission tool and draft a community effort for protocol level proposal submission.", "experience": "Cardano AIM team, creators of Community tools including Voter, CA, vCA, Proposal mentor marketplace and SDG proposal tools. Developers , designers and data specialists."}