{"id": 399415, "author": "uptodatedevelopers", "title": "ADA to Mobile Money App", "url": "https://cardano.ideascale.com/a/dtd/399415-48088", "category": 26438, "amount": 44000, "description": "Many Africans refuse to receive ADA cryptocurrency because of the difficulties they face in exchanging ADA into a locally used currency.", "f6_no_assessments": 6, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 502, "q0": "This proposal correctly identifies a significant and important problem for adoption with localities around the world, which is that any difficulty with the on/off ramp from ADA  to fiat is a major hurdle for adoption. Cardano aims to make a big impact in Africa, which will only be possible when this problem is solved.\n\nThis project aims to create a simple app to trade in and out of ADA to fiat, using Mobile Money, which is very familiar to many Africans who may lack access to traditional banking services. \n\nTheir first focus in one African country & currency, but a successful product would be relatively easy to roll out for other countries & currencies in the rest of Africa, and indeed the world.\n\nThey have correctly noted that user adoption is the biggest risk for long term success of this project. To improve this proposal, I would like to see more thought and strategy around how you might market the end product and get that adoption! Perhaps join some online forums (townhall breakout rooms, twitter spaces, etc) and ask for ideas about how to market and roll out the end product!\n\nNevertheless, and this product is at the heart of a critical, widespread problem for adoption in Africa, and is a tight fit to the KPIs of this Campaign, I rate 5 stars for Impact.", "q0r": 5, "q1": "The budget seems clear and reasonable, as does the timeline.  There detailed breakdowns of each budget item, as well as many details provided about the technologies and platforms they intend to use. I am convinced that they have done an appropriate amount of research for this phase. \n\nI would be even more convinced of feasibility if there had been more progress on a proof-of-concept. If you do not get funded this time, an idea for the future might be to break this project into chunks: The first chunk might be very small budget to do what you have called \"Stage 0\": For 7K, you can create the proof of concept, and have more to show the community when you ask for the funding for stages 1 & 2, with stronger proof of feasibility.", "q1r": 4, "q2": "I would like to see more detail and more ambition in the Auditability section.  For each \"Stage\" of your plan, where will we see your results. For example, for Stage 0: where will we see the outcomes of your proof-of-concept work? With there be a demo, a website, a presentation? For each stage, I would like to know a little more about what the deliverables are, and where we can audit them.\n\nIn terms of \"What does Success look like?\" -- That is where I would like to see more ambition. It seems you are saying that if you make the app, your job is done. Instead, and as mentioned above for impact, I would like to see more thought put into how this app finds its target market. Perhaps you can find a good \"Test market\" in Congo -- perhaps students at a university, or members of a business coop -- who is the first test market for this app, and could the results of their participation be an auditable outcome?\n\nSome of my suggestion to \"Improve\" this proposal may also mean you need to increase the budget - which may also lend itself, as I said, to breaking the proposal in to phased proposals for subsequent Catalyst Funds. I would give higher marks to \"More expensive\" (and/or phased) proposals that look HIGHLY feasible and auditable, as opposed to cheap ones that still have room to improve.", "q2r": 3, "assessor": "z_assessor_1180", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1990, "q0": "The impact that the implementation of this proposal could have on the use of the ADA cryptocurrency and the DiFi applications already available on Cardano is immense because the proposed solution consists of creating a bridge between the ADA cryptocurrency which almost no one uses for daily financial operations and Mobile Money which are already widely used on the African continent because,\nmost Africans are excluded from the\nlocal banking systems and consider Mobile Money a better alternative.\n\nCreating new tools is important but using tools already known to the general public is more than important because it will not add complexity to the adoption of the Cardano (ADA) blockchain for users who will not have need to change their habits.\n\nThis proposal will bring much more traffic to the ecosystem and will finally open the doors of DiFi to disadvantaged populations excluded from the banking system in various African countries.\nThis is why I believe that this proposal fully meets the challenge.", "q0r": 5, "q1": "This proposal team seems to have the skills and experience necessary to carry out this project and this is clearly visible through the profile of their company and the individual profile of each member.\nThe team has also put together a detailed plan and budget for how they will achieve the application design challenges and the milestones are clearly defined and seem realistic. The team also took into account the possible risk it could face which is to ensure that users use this application in the DRC, which seems fair to me.\nHowever, the proposal seems to be missing a few details in one particular area such as how the app optimizes the conversion structure to keep fees as low as possible as telecom operators charge transaction fees and also the Cardano network charges fees transaction, which is a double expense for users;\nBut also how will they integrate the APIs of telecom operators who do not give access to them?\n\n The chances that the proposal will be successful are quite high given the experience available to the team and the plan presented, despite a few areas where more information would have been needed to guide the decision of the votes.", "q1r": 4, "q2": "The problem was clearly defined and the solution to be provided as well.\nThe metrics and the performance indicator described seem to be good indicators to audit the progress and at the end to check the success Thanks to the fact that the proposed solution will be open source and therefore the link to the GitHub already provided can help to check everything in particular if the roadmap presented and the milestones proposed have been respected and achieved.", "q2r": 4, "assessor": "z_assessor_1445", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7372, "q0": "I thought the idea was interesting but I didn't understand why it is difficult for Africans to exchange Ada for local currency, as this can be easily done with binance, for example. It would be important for the proponent to better contextualize the problem, for us to know why this difficulty is being faced. Now, speaking of the application itself, I think that if Dapp is built and well implemented, the gains for the Cardano ecosystem will be high. If people (in this case, we already have a specific target audience, the inhabitants of the Democratic Republic of Congo) find it simpler to make this exchange, this could generate an increase in the adoption of Ada in the country, which would directly benefit the Cardano ecosystem. The idea of ​​the challenge is precisely to increase the adoption of our blockchain on the continent, as Africans often still face difficulties, often in terms of access to technology, which must be solved through innovative proposals. This project can also be very beneficial for local Africans, if it really makes them adopt our currency more and maybe, in an organic way, this makes them better involved with the technologies of our ecosystem, that is, they would enjoy the various advantages of Cardano. Therefore, I think it is a good initiative, what was lacking, in my opinion, was a stronger argument regarding the problem to be solved. \n", "q0r": 3, "q1": "The project roadmap is not adequately detailed. It would be necessary for us to know better which activities would be developed each month, and with that, we would have a more solid view of the process. We know in a superficial way how the project would be developed, for example, “Phase 1 - Active development (up to 3 months): Creation of the ADA Exchange App wallet with the possibility of sending and receiving ADAs”. There would be three months for the development of these activities, however, it would be positive for the author to better determine what would happen in each of these three months for the final goal of creating the portfolios to be completed. In this way, the rest of the script should also be detailed in this way. Regarding the budget, I think this part is well explained, as the bidder divides the total amount into several parts and details some of them very well, such as this one: “Development by the user with 5 Senior Mobile developers (IOS platform and Android at the same time) (6 hours per day due to $8 per hour)x5: 18720 USD”. We know how much you would be charged per hour, so we have a good understanding of how the requested money would be spent. And finally, speaking of the team, I think it is presented in a satisfactory way but could be even more detailed. We know the names, roles and linkedin profiles of each of the participants. This is enough for us to have a good understanding of the team. However, it would be even more interesting if they had detailed their previous experiences in the proposal itself, in this way, we would know who was involved with Cardano, we already know that some have, but we don't know this information about everyone. So I think that overall the feasibility is good, with the script being the part that needs improvement. \n", "q1r": 4, "q2": "The auditability of the project is quite low, in my opinion. Proponents claim that updates are made on github, this would allow us to track the proposal development process. However, it is not determined how often these updates would be made, nor exactly what content would be added there. I think that the proponents should better detail how these updates would be made, if it would be possible for us to follow the development process in relation to the tasks as well, or only about the partial goals that are being achieved little by little. Regarding the success scenario, it is said that it would be measured by the launch of the first version of Dapp, however, I do not agree that this is enough to understand how the proposal impacted both Africa and the Cardano ecosystem. I would like a survey with users to be carried out, to understand if acceptance of Ada has really become a fact, if greater amounts of our currency are in circulation, if by chance these users also started to adopt different technologies (as if they started to use other Dapps, for example) from our ecosystem... Anyway, in a way they started to relate to Cardano from there. It would also be important to understand how this impacted their lives, if they felt more adept at participating in Catalyst activities, for example, as the payments are in Ada. If this is a reality, I believe that the Dapp in question would have indirectly helped in the income of those involved, since working as CA and vCA can be an income opportunity for those who cannot find employment in their areas, for example. Therefore, I think the auditability left a lot to be desired, needing to be greatly improved. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8153, "q0": "According to the author many Africans abandon the ADA cryptocurrency because of the difficulties they face in exchanging the ADA into a currency to be used locally. The solution to this problem is to design a mobile application that allows the exchange of ADA cryptocurrency to informational content via Mobile Money. I think the idea of ​​DAPP exchanging ADA to local currency is essential not only for Africa but for every location in the world. Personally, I think it will attract a lot of users to use it. Therefore, it greatly affects the Cardano and Defi ecosystem.\nBut I think this project will answer a lot of problems, not about technology but about users and surroundings, including government, environmental finance in Africa affecting it... hopefully I can see some of the risks given and how they can get away with or face up.", "q0r": 4, "q1": "The idea is great and the team also has detailed information on the implementation of their idea. A roadmap with milestones and a time horizon for achievement, and a clearly defined product, would give this proposal certain suitability. The $44,000 required budget is also broken down into phases of the plan. There is a team of 10 people behind this proposal, we easily know the main person in charge, as well as the names and roles of all the team members. Through the Linkedin link of the members, we can easily verify their experience. Once again with this team, I have full confidence in their ability to successfully execute this proposal.", "q1r": 5, "q2": "The success of this proposal is that the first tests of the application by beta testers to fix the first version of the application will be published. While the product is relevant to the challenge, the KPIs and metrics are not explicitly mentioned, so it is difficult to say that the information provided is sufficient to gauge the progress and success of the proposal. I want the team to connect KPI milestones and roadmaps with project expenditures, specific tasks, and tasks that employees must deliver and when they must deliver. This breakdown will give a clearer indication of the feasibility of deploying workloads and matching assigned jobs with labor expenditure. By connecting KPI milestones and roadmaps with budgets, the team can track performance and spending over time\nThis proposal is an improvement on the proposal from fund 7 (https://cardano.ideascale.com/c/idea/383754) that the team has not yet funded, with a detailed explanation this time I hope to have maybe enough to convince the community to vote on the proposal", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8594, "q0": "The proposal is for building a dapp to allow users in the Democratic Republic of Congo to quickly and effortlessly exchange ADA to local mobile currency.\n\nIf we are to be serious about achieving Cardano’s goals in Africa this is exactly the type of grassroots initiative we need to prioritize in Project Catalyst. The proposed dapp would not only offer convenience to its users by allowing them to effortlessly convert ADA, but also has the potential of onboarding a large number of users into the Cardano ecosystem by word of mouth alone. The plan around the project seems simple yet solid, and the investment required to get it started is relatively low.", "q0r": 5, "q1": "The roadmap presented for the project is complete and tracks with the vision of the project described in the first part of the proposal.\n\nThe budget breakdown is very well presented with thorough descriptions of each of the milestones that would be funded through this proposal.\n\n?Given their location, the developers can afford to work for a substantially lower hourly rate than would be required in the west. That's also another aspect that makes this proposal a very worthwhile investment for the Cardano community.\n\nEvery member of the team is presented with a short bio and links to relevant professional profiles, all of which check out on inspection.", "q1r": 5, "q2": "I would have liked to see a bit more focus on KPIs and metrics to enable the measurement and assessment of the progress of the project if funded. However, given that the scope of this initial phase of the project is to build a testnet version of the product, progress can be tracked on the project's GitHub.\n\nThe definition of success given coupled with the timeline presented in the feasibility section is adequate for the scope of the project.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9703, "q0": "The proposal in its entirety clearly brings a lot of value to the Cardano community and underdeveloped countries such as DRC. But the proposal misses out on a few key points. I personally feel the product to transfer ADA to local currency with ease is quite intriguing. But the proposer fails to show how the local people who are clearly not aware of Cryptocurrency and its applications are made aware of this. The lack of knowledge in such countries is to be addressed first before adding any additional value. I personally feel the impact this would have would not be great considering the challenges the team might face having taken a country such as DRC as their initial target audience. I feel this proposal would have had more weightage provided it was submitted in other challenges such as \"Grow Africa, Grow Cardano\".", "q0r": 3, "q1": "The team requests for a fund of about 10k which is clearly much less than many other proposals under this challenge. The detailed breakdown of the same adds more credibility to the plan. The team is introduced elaborately, however, the mix seems to be overruled by developers than blockchain experts and marketing people who are very much essential in proposals such as this where the product and its uses are not very easy for the target audience to understand or use. The team also provides a step-by-step action plan but the missing description makes it look a lot vague. The team equipped with the task of developing the wallet surely looks promising and having a \"Wada\" member onboard makes it more assertive. Considering the goal and the team's expertise as described by the proposer, on funding the project, the chances of it being successfully implemented is high but the success of the project's impact is surely debatable.", "q1r": 4, "q2": "I personally have to disagree with the entirety of the metrics and KPIs provided by the team to the community to use. The team makes no mention of any plausible measure to make the audit process any easier. The only mention is about reaching people with the Beta version, which alone would not be enough. The proposal being submitted in the last round, should had covered all the areas coming into this round, but I feel there are still some places that the team might have to work on in providing the community with the entire picture of their plan and what its success would look like. Metrics such as number of people onboarded, number of wallets created monthly, number of active users, number of transactions recorded, amount of ADA transferred and amount of ADA as fees, and many more such metrics are clearly missing which could have added more weightage to the proposal. In my opinion, I feel the proposer should make a few more amends to the plan and come back as this proposal clearly has all signs of being a winner but just isn't ticking off all the boxes.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Design of a mobile application allowing the exchange of ADA cryptocurrency to a local currency via Mobile Money.", "experience": "Startup working in the development of Web, Mobile, and Desktop applications; with more than 18 developers"}