{"id": 399558, "author": "piotrnap", "title": "Escrow Smart Contract for dApps 🔥", "url": "https://cardano.ideascale.com/a/dtd/399558-48088", "category": 26438, "amount": 3000, "description": "Lack of open source Escrow Plutus Contract examples ready to implement by dApps where time, value & deliverables are the main constraints.", "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7375, "q0": "This proposal, despite having been briefly explained, seems to me to be very promising, well meeting what we are looking for in this challenge. The idea is to create a smart contract, using our Plutus language, which will serve as a caution, many also have the relationship and specifics of how this contract would be used). The objective that is both parties imply in the contract on the basis of “exchange value, in a way without trust and schemes”. In other words, the proponent intends to create an alternative for people who are still not so sure about carrying out transactions on the Cardano blockchain, due to the fact that it is a totally new process for most, of which it is not fully understood how it works, unlike anything that has already been done outside the cryptographic world. In fact, each blockchain works its own, so it's fair to say that an expanding Cardano ecosystem is still so involved with a bit of prejudice and estimation of its own on the part of the parties; or even the parties may not trust each other, wanting to run a test before actually doing what they want. As I said, it's interesting how the author created a hypothetical situation (with Alice and Bob), where we can see how the technology he intends to understand would work. In the part “a predefined “funds release window”, in case one of the parties does not withdraw its funds that would incur in proposals for the commitment assumed by the other party to deliver in the agreed time and values, etc etc”, the proposer explicit the use cases that this technology can provide. Overall, this project would help people build software on Cardano more securely, which would contribute to the adoption of our blockchain. That is, the objectives of the challenge will be proposed directly contemplated, probably the number of transactions will increase as more people would trust to do this; New members to our environment, increasing the number of Ada and CNFTs in circulation, also investment in other Dapps, new active members to our community can also increase. In short, I think the idea is very pertinent and could generate great results for our ecosystem, in line with what we are looking for in the challenge. \n", "q0r": 5, "q1": "It amazes me that the project development period lasts only two months. The script is superficial, in my view, we are told what would happen in the first and second month of the process, but this information is given in a shallow way. For example, in the first month the goal is to “create a detailed plan for the structure of this project. take into account the vulnerabilities of a smart contract by looking at those already living on the mainnet.” I believe that the structure of the project should have already been thought out and thoroughly explained here in the proposal, so that we had a better understanding of how this idea would be constituted in practice. What vulnerabilities would they be? How would it be examined? Which smart contracts would serve as a basis for examples? I think the script should be better detailed, the temporal notion is adequate, but the level of detail of the activities is still little. Talking now about the budget, only 3 thousand dollars are requested (a very low amount compared to most proposals); all that money would go to the developer of the smart contract. I think it's a pretty fair amount for 2 months of work, but it would be positive if the bidder explained if the developer would work full time or just part time. It would also be interesting if your work routine were better explained. And what about marketing? Will there not be any kind of dissemination of this technology? I think it should have been spread throughout the Cardano ecosystem, so that we knew how people would use it. That is, in my opinion, it would be important for the bidder to have asked for an amount so that someone in advertising could launch a strong publicity campaign; as important as creating a good service or product is making it accessible (known) by the target audience. Finally, speaking of the team involved in the project, little information is provided about the pair of professionals. We only know their professional roles and that they are part of the Gimbalabs group, that is, they are people well connected with our community. But still, I would like more details, to know what their previous experiences were, examples of projects they have already developed and also their linkedin profiles, so that we could see more practically about their professional lives. So I think the feasibility is not bad, but it has a lot to improve, detailing all the parts better. \n", "q1r": 3, "q2": "The suggested auductability for process monitoring is quite superficial. They say that they will be guided by the activities and milestones of the roadmap and that they will run a test on the testnet network, before officially releasing the product. We don't know important things, such as, for example, whether the work routine of the developer who will work on the project will be monitored, how it will be monitored, what he has to deliver per week, how many hours he needs to work, how all this information can be measured and made known to all members of the Cardano community. In terms of partial success, how would it be measured and reported to all of us? Does the bidder intend to share the github repository or build a roadmap at the end of each project month? Talking about both tasks and goals? Unfortunately, I think it was too shallow how this part of the project would be monitored. Finally, when it comes to the end results, success is very well defined by obtaining “a well-documented example of a Smart Escrow Agreement that others can use in their own projects”. But I think that, like the auditability of the process, this part was very shallow. How can we define metrics that demonstrate the success of this project in a verifiable and reliable way? How to perceive the impacts of the idea for the Cardano ecosystem? Has this new technology actually contributed to more transactions being minted on our blockchain, more people choosing to work with Cardano over other blockchains? Has the number of active members somehow grown from this project? And has the satisfaction of the parties increased, the level of trust increased on both sides? I believe that it would be necessary for the proponent to collect this data, both quantitative and qualitative, so that we could better understand the consequences of this project for Cardano. Therefore, unfortunately, I found the proposal not very auditable based on what was stated, being this part of a good reformulation (deepening). \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1653, "q0": "They plan on creating a sophisticated escrow smart contract with documentation that could be used by other applications which aligns with the  challenge setting. It will help in building high quality dapps on Cardano therefore bringing value to the ecosystem. It's main goal is to provide this product for free to other developers and to be used by them. This goal aligns with the challenge in the sense of building more Dapps on Cardano. This product is able to scale as it  is open source and the  public can help this evolve over time.", "q0r": 5, "q1": "The team behind this project have not presented evidence of their experience, but they  mentioned that they are part of the Gimbalabs commmunity and that they have successfully launched projects. Some of them are well-known if you've been following Town halls, but it would help to ad information to point voters and assessors to proof of your experience and work. They have the required experience and team members to complete a project like this. In stead of breaking down the  budget they just mention the one amount to complete this project. It is not a very big amount and project, so it's kind of pointless trying to break it down. The amount requested is very reasonable. A time period of 2 months to complete this project is very reasonable and achievable. This project will essentially be a Plutus smart contract that can be tweaked to fit thee needs of other projects. They also explain how the contract will function. Given the scale of this project not much resources apart from their time and skills are needed. They mention the one challenge of not being able to deliver the product within the given timeframe, but don't mention how they will mitigate this. The least you could say for this risk is that you have other developers on standby, since Gimbalabs has a well established community. I'm sure there will be someone willing  to help on a small project like this, should something happen due to unforeseen circumstances.", "q1r": 5, "q2": "They provided a roadmap of 2 months, with milestones for each month. Making it easy to track the  progress of this project. The only KPIs they have is that their product can reach a real world application and that it is able to be an example for other people to learn from. No mention of measuring its usage is mentioned. Since they will use this product in Gimbalabs to teach other people it will already be used as an example and hopefully as a real product by some of the students. It would help to measure it's usage somehow and keeping track of it. That way the community can see the performance of this product. Having good quality applications on Cardano especially when it involves smart contracts is a must. They see this problem and they solve it by creating a good example of an escrow smart contract and making it open source with proper documentation.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2034, "q0": "I like that this smart contract will be built for all to use. I find it important to create a project that will attract more people to using the Cardano blockchain. I know that lots of builders would appreciate an escrow smart contract to help them build their daaps. It is also nice that the smart contract will be used for a variety of use-cases.", "q0r": 4, "q1": "Given the experience of the team, I like to think that they will be able to write the code without any major setbacks. With their 20 years of combined knowledge in this space, they will likely understand the use-case and the need of this smart contract to be built. My only question is if other people will be able to work on it as well. This is in correlation with scalability. One of the three keys to Cardano. ", "q1r": 4, "q2": "There was a good amount of information given in this proposal. I like that it was short and concise and got straight to the point. They are requesting such a small amount of funds that will likely be used to increase the amount of users/money by a lot. Especially taking note of the various use-cases of this smart contract. I think that the roadmap is written nicely. I would continue to add onto the roadmap as the time progresses or try to make it as detailed and concise as possible. If that is already done, it looks good. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6596, "q0": "This proposal is about creating an escrow smart contract for dapps that will allow a trustless peer to peer transactions. The proposers have also expressed the desire of creating documents for the project and making it open source. I think the proposers have done a great job explaining the purpose of this project and how it adds value to the cardano ecosystem. I have to recognize that the cardano network needs a set of tools that will make it easy for developers to build dapps. That leads me to think that maybe this proposal is more suitable for the open source challenge. I recommend the proposers to think about that too. Other than that , this proposal is a great initiative and I support it.", "q0r": 5, "q1": "I think that the proposal is feasible although I recommend to the proposers to improve it. I suggest to the proposers to add links to their linkedin profiles because it’s not enough to say that you are part of the gimbalabs team. I think that to protect the integrity of the catalyst, the proposers should do their best to back up their claims with proof. Besides this, the proposers have provided a timetable to complete the work. Apparently they should be able to deliver this project in 2 months, which is great. Regarding the budget, they are asking for 3000 usd whis seems reasonable for the work. I’m giving this a 4 rating because I can’t verify the proposers claims about the team.", "q1r": 4, "q2": "I think that this proposal is auditable based on the roadmap and milestones to deliver the project. They have promised a well documented escrow smart contract that other developers can use in their dapps, in two months. That is a short time and we’ll be able to track the results easily. I think that this is a great project and it should be great for the community if well executed. ", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7860, "q0": "Definitely, this proposal is needed for the other ongoing proposals submitted by the proposer. In my opinion, this is the core of the main product (scheduling dApp). Another positive thing, this is also part of Plutus community learning which will bring lots of positive impact on Cardano's development. ", "q0r": 5, "q1": "Two months for this project is in line with the main product development time. The budget itself makes sense. However, this needs extra commitment from the proposer and his team to deliver on time.  ", "q1r": 4, "q2": "As stated in the other related proposals, the proposer and his team need to add some channels for public communication besides GitHub or GitLab. By having more channels, communities are aware and can contribute some help like running the product on testnets. The development phases of this project should also be added as part of the roadmap. ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8596, "q0": "This proposal aims to create a smart contract template and the necessary documentation for it, make it freely available to the community, and use it as an example in the Plutus Project Based Learning.\n\nThe proposing team behind this project are all core members of the Gimbalabs project, an initiative with a proven track record, that's been contributing greatly to creating resources and spreading knowledge in the Cardano community for over a year now.\n\nGimbalabs will also be hosting the sessions where this smart contract template will be used as an example and teaching tool, to instruct others about Plutus and Cardano smart contracts. As such I assess this to be a very impactful proposal for the Cardano developer community in the near and medium future.\n\nConsidering all this and the very low budget requested by this proposal of $3000 it represents an incredible value proposition for the Cardano Treasury.", "q0r": 5, "q1": "Given that Gimbalabs, the team behind this proposal, has already successfully completed multiple projects on Cardano and has made them very publicly available through their Playgrounds sessions I have a very high level of confidence that they will deliver on this proposal in case it gets funded.\n\nOn top of that this proposal is very well written from a feasibility standpoint. All the required elements to reassure us of its successful completion are present: the team demonstrates a very thorough understanding of what they want to accomplish; a descriptive timeline spanning two months is presented in the proposal; a more than reasonable $3000 budget will be allocated to the developers working on the smart contract and the documentation.\n\nThe exact members of the Gimbalabs core team that will be working on this project are named and their credentials are given, however, especially for new voters that may have not heard of Gimbalabs before, I would have really like to see links to their LinkedIn profiles, or links to other previous work relevant to this project, to confirm their background and experience.", "q1r": 5, "q2": "Although KPIs and metrics can be relatively easily deduced and extrapolated from other parts of the proposal I still would've liked to see them more specifically included in the auditability section. As a result, I have subtracted one point from my score for this section of the proposal.\n\nThe definition of success is very well written and it creates a concise picture of what the community can expect on the successful completion of this project.\n\nRecommendations for a more complete auditability section and getting a maximum score:\n- accurately describe, easily verifiable and trackable, metrics and KPIs that will allow for effortless monitoring of the project’s implementation progress.\n- define milestones that describe clearly the expected progress markers.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a sophisticated Escrow Smart Contract which can be used by a variety of applications in different use-cases, with good documentation.", "experience": "Two software engineers (Piotr & Randall) with more than 20 years of combined knowledge in a relevant industry. Together with Steve & James (co-founder) we're part of the Gimbalabs core team working on blockchain based solutions. We've already launched a few successful projects."}