{"id": 399544, "author": "dandyedibles", "title": "Integrations and utilities", "url": "https://cardano.ideascale.com/a/dtd/399544-48088", "category": 26438, "amount": 80000, "description": "How to bring integration and utility to the token structure provided by the cardano ecosystem in order to improve it?", "f6_no_assessments": 5, "f6_rating": 1.7333333333333336, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal has the idea that bring liquidity to pools involved by allowing businesses to stake their assets into the pools in order to provide these rewards, but the proposal doesn’t articulate how it will add value to the Cardano ecosystem and for the stakeholders.\nAt the same time the statement of how problem is to be solved isn’t specified with implementation and not throught business case that support economic model (eg. revenues of the service, cost related to the service,…).\nHowever the proposal is difficult to assess and I suggest to improve details.", "q0r": 3, "q1": "As proposer declared the team members belong from Catalyst leaders, but there aren’t team members details and professional experience to imagine the project’s success, neither proposer experience and his experience on cardano community. \nThe given metrics measure what the proposer wants to do, but the success of his actions is not defined. As mentioned above, the description of the solution is not well explained (e.g. how the funds will be spent because there are only 2 developers and marketing effort, how the solution improve their customer experience, and so on…), so the progress of this proposal is not possible to assess.\nRoadmap and milestones (incl. time horizon) are described and the budget’s information provided is basic.", "q1r": 2, "q2": "There aren’t KPI to identify the proposal goal, but only deliverables. There aren't more details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution.\nThe metrics for the assessment isn’t given, so it’s impossible to assess what the proposer wants to do, but the success of his actions is not defined. \nThe previous project funded from the proposer is Driving Catalyst, as the proposer declared, but I don’t find the proposal on catalyst.", "q2r": 2, "assessor": "z_assessor_114", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the challenge by rewarding patrons of small businesses. This can help the community because it will provide the ecosystem with more opportunities in business for ada holders. The only question on my mind while answering this question is if this proposal will benefit the community more than another that would receive the same amount of funds.", "q0r": 4, "q1": "I don't see too much information on who will be working on this proposal. It is extremely important for CA's and future voters to know who is in charge of these projects. It is important to see the experience of the team or individual because that will help us to know if this proposal is actually going to help the community or not. If this proposal can add more information in these regards, there will be a higher chance of being funded. But for now I have to give a 2 out of 5 stars. ", "q1r": 2, "q2": "Once again, I still don't think that there is enough information to prove the success of this proposal. I like that it is concise and straight to the point, but it is still lacking necessary information. The detailed budget helps us to see exactly what the funds are going to be used for, but it's hard to know who is going to receive the funds for the different events mentioned. Give a little more detail in these categories, and it may help you in the voting process. ", "q2r": 2, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The problem and the solution described is very unclear. Vague details regarding the problem and the solution is given so one is left guessing which does not assist community advisors in making informed assessments. I would suggest that the proposer provide much more detail in order to limit ambiguity. \nThis proposal does not show that is aspires to the highest possible levels of certification and it has not produced any minimal viable product. This means that this proposal does not align with the challenge. \nOne can also not see the benefit to the Cardano community since so little details is provided.", "q0r": 1, "q1": "There is not reference links for the proposer or for the team, if there are any. The proposer only mentions things that are being done but make no reference to such works. \nThe budget is not broken down in a clear manner and the breakdown does not add up to the requested amount. The plan is short and confusing. The proposer indicates that “Everything is already happening”, but provides no proof. \nThe proposer needs to put a lot more thought and planning in this proposal. The proposer needs to provide reference links for the team, if any, and for himself so CA’s can make informed assessments. The budget should be broken down per item.  \nThe lack of detail around the information of the team; no reference for past projects and the inaccuracy in budget indicates that this project will not be successfully implemented.", "q1r": 1, "q2": "There is no roadmap or milestones. The way to measure the project is via “Twitter, Discord, GitHub” but no links were provided for them. Also no further information on how to measure the project development was provided. \n\nAccording to the proposal there are “no risks so far” which indicated that not much research has been done in this area. The risks to the project needs to be identified with a proposed solution. \t\nWith the lack of information provided, it is near impossible to sufficiently audit this proposal. ", "q2r": 1, "assessor": "z_assessor_1602", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has identified a problem and a solutions to the problem but is unclear what is the connection between them as the problem is related \"hot to improve token structure\" and the provided solution aims for creating a business model. Also is very unclear why is necessary the integration into the Cardano ecosystem.\n\nThe proposal seems that it doesn't fit into the Challenge brief as there are no relevant references about the creation of a dApp.", "q0r": 2, "q1": "There are no provided references fot the team members to emphasize their skills and experience necessary to successfully implement this project.\n\nThe requested budget is broken down into identifiable items but they are presented in a vague manner (\"Hardware and software\" - details needed - what type of hardware? - PC, tablet, printers etc. - what kind of software?  - operating system, image editing etc.). If we're making a total for all the items the $80k seems like it can't be reached as the sum of them is something else.\n\nThere is no timetable that shows what is to be done and how (what can be delivered in a predefined period of time?) and the plan doesn't describe all the resources necessary to implement the proposal. (human especially)", "q1r": 2, "q2": "Due to the lack of the relevant info it is difficult to assess the progress and the success of this proposal. The proposal is presented in an ambiguous way and is hard to understand what are its goals to achieve and most important what is the problem that needs to be solved.\n\nThe team does not establish direct KPIs that would serve to monitor project success. What we have here is, somewhere in the proposal, a somewhat confused mention about an event that is set to start in 120 days.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very unclear and ambiguous and in its current form, assessing the impact it would have is practically impossible. Currently, I was unable to deduce what the problem statement is, or what’s the proposed solution. There is mention of liquidity and staking pools but there isn’t nearly enough detail to visualize the project being proposed.\n\nNormally I wouldn’t take this approach and I would try to find specific things that can be improved or added to the proposal to make it better but in this case, I believe a complete rewrite is needed. Instead of trying to list everything that the proposal is missing,  I would suggest that before applying with a new proposal or reapplying with an improved version of this one the proposers take a look at the catalyst proposal guide.\nhttps://cardanocataly.st/en/proposers/guide.html ", "q0r": 1, "q1": "No roadmap or timeline, as such, is given for the project. Very little intelligibility in the roadmap section.\n\nThe budget is somewhat broken down, but not enough details are provided about each individual line and they are very generic. For instance, hardware and software is mentioned,  but no other further details are given. What hardware? What software? All other budget lines are equally generic. Since the goals and methods of implementation of this project are also extremely unclear no further details can be deduced.\n\nNo detail whatsoever about the people behind this proposal are given, no names, no credentials, no external links to professional profiles, or any other type of references.", "q1r": 1, "q2": "The auditability section does not contain any of the required elements, no KPIs, no metrics, no timelines, no methods of keeping track of the project, or presenting it to the community for verification. As it stands now, the auditability section is just a list of platforms that the project plan is to us.\n\nThe definitions of success are extremely vague and given that we don't even know what the goals of the project are they don't provide any additional information.", "q2r": 1, "assessor": "z_assessor_681", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Building a business infrastructure for small businesses to model in order to succeed. Giving back to patrons by providing rewards.", "experience": "Through the driving catalyst, we have been able to complete several steps towards the completion of our goals. We have been able to model a staking token system that allows small businesses the ability to reward their patrons, which brings incentive to gain more business."}