{"id": 399702, "author": "jeffghome2020", "title": "CardanoLAND", "url": "https://cardano.ideascale.com/a/dtd/399702-48088", "category": 26438, "amount": 100000, "description": "Poor people cannot afford to access credit for home/business/land ownership/physical assets/digital assets", "f6_no_assessments": 2, "f6_rating": 1.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 5180, "q0": "The applicant demonstrates his vision for solving a social problem. Overcoming the consequences of poverty and providing opportunities for the poor to raise funds for the acquisition of property - home / business / land ownership / physical assets / digital assets.\n\nAlthough I like the idea, it remains a good idea without the necessary attributes to become a feasible project.\n\nAt the next application I would recommend the applicant to gather an expert team of specialists to develop the idea and submit it in the form of a project proposal - measurable and achievable goals, activities ensuring the achievement of goals, description of necessary resources and processes, risk assessment and team expertise, measurable indicators to track progress.\n\nIt will also be useful to have described a clear, concrete benefit for the Cardano community from implementing such a proposal.\n", "q0r": 1, "q1": "Detailed description of an action plan and timeline is must, in order for project application to be verified according its feasibility. The same is with the budget it needs to be detailed, described with identifiable items and their cost calculation method.\nAsking for gross amount prevents the budget to be evaluated according to its relevancy.\n", "q1r": 1, "q2": "Project audibility defines if the progress can be tracked and the spending of granted money is reasonable and in line with the aims of the project.\nDefining KPIs and setting up a measurable numbers and time bound for each of them is necessary for every project proposal.\n", "q2r": 1, "assessor": "z_assessor_1890", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6044, "q0": "The proposer has good intentions, he finds a problem that is almost universal: poverty and the consequent inability of the poor to buy land, start a business or buy physical or digital assets. But it does not offer a clear solution to the problem that ends up being framed within the requirements of the challenge.\n \nThe proposer writes with good intentions and asks the community for help to try to outline a proposal, but in this stage, where CAs must evaluate projects, we cannot rate ideas that are not fully defined.\n \nIt is not clear if the proposer wants to fund a donation, investment, NFT or Real State dapp.\n \nWithout this clarity, we cannot say that this project fits well with the requirements of this challenge. But from my place, I motivate the proposer to continue investigating, delimiting and creating this idea.\n", "q0r": 2, "q1": "The proposer does not make a timetable that indicates what are the tasks necessary to carry out this company. And, from what is written above, I can suspect that it's because he doesn't really know what he wants to build. He has many ideas, but he is not defining  one that then orders him into the tasks that he has to fulfill to carry it out.\n \nThe proposer also does not make a serious budget for the same reason. It is impossible to define the cost of something if we do not know what it is.\n \nAnd although the proposer describes himself as a good candidate to realize this idea, he does not provide links that certify his skills and knowledge.\n", "q1r": 1, "q2": "The proposer does not write the milestones of the project or the kpis. I repeat, it is difficult to write these types of requirements on something that is not yet defined.\n \nAnd these two requirements are key for the community to be able to audit the project. Without these two requirements, the task becomes impossible.\n", "q2r": 1, "assessor": "z_assessor_32", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "I want to create a community platform where community members can directly fund purchases of various forms of property acting as investors.", "experience": "I lack the experience to fully complete this project. I need community participation to help build out the project.\nI am good developing the overall vision and goals but lack the technical expertise to build out the platform."}