{"id": 400019, "author": "salen", "title": "DirectEd - Donations dApp", "url": "https://cardano.ideascale.com/a/dtd/400019-48088", "category": 26438, "amount": 59040, "description": "Many students in Africa do not have the means to realise their full potential. Donation services lack efficiency, transparency and security.", "f6_no_assessments": 8, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"id": 3020, "q0": "The vision that the proposal intends to achieve is very vibrant. It focuses on the probelm that the student community of the African region to efficiently and timely get Scholarship/donation unlike the traditional existing Dodation services lack efficiency, transparency and security. The proposed solution tends to attend this issue by creating a Scholarship/donation platform where students can avail their scholarship and donation at low costs and condition based secure peer to peer based donations to the students in need.This solution will definitely address the problem statement efficiently as it enables the student community members in need of funding for their further education and realise their full potential both academically and otherwise easily through the platform that the proposer team teands to develop using the funds availed. This definitely will help the students coming from low-income backgruond to get funded from philanthropists who were earlier hesitant due to opaque nature of the traditional scholarship/donation setups. But by bringing the decentralized and transparent nature of cardano blockchain into play \"DirectEd\" can potentially solve the impact of scholarships reaching the actual needing hands.", "q0r": 5, "q1": "The detailing given to the action plan and the possible challenges the team might face is intriguing and is in accordance with the proposed idea. The team has also clearly mentioned the exact problem statement with proper boundary and have proposed segmented solution for each of those. The funds requested also look practical and reasonable after one goes through its breakdown. The phase-wise milestones and the time constraint by which they are planned to achieve also appear to be sensible. They have already created a PoC on cardano testnet and planning to deploy before even this funding round terminates. They have also cosidered the legal and IP into cosideration and have looked into the challenges they might face during the implementation. Them behind this proposal seems to be very efficient and have the experince and exposure in the domain and have collaborated and with key players in the domain. They have also provided details on future plans and how the tend to take \"DirectEd\" to further levels. Considering the years of experience and expertise of the team and their well defined strategy and phasewise plan it is highly likely the =at the proposal will be implemented successfully.", "q1r": 5, "q2": "The team has provided clear-cut success definition and roadmap instills trust amongst the community regarding the proposal's success. The proposer also show their intent, will, and passion in reaching the destination by providing a detail on their future vision under SDG goals. The current phase KPIs have been well mentioned in the proposal which includes github commits to track the development work and also includes details on targets regarding the non technical aspects of the solution such as donation pledges and interviews. They have also given a gist of their future KPIs and phases indicationg requirement of further funding round participation. Also given the fact that they have been funded in fund 6 for phase 1 and thies a continuation they have mentioned proper details regarding the success of th former. These key points along with well defined timeline and phases wise plan and detailed func breakdown are sufficinet to effectively track the success of the project and audit the progress continuously", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "Very well written and valuable assessment that shows full understanding of the proposal by providing detailed examples from the proposal that highlights how our previous and current work, as well as roadmap ahead addresses the main objectives for each criteria. Greatly appreciated review and assessment."}, {"id": 7389, "q0": "The proposal is perfect in terms of impact. The proponents are to be congratulated because they have created a project that can generate wonderful results for both Africa and Cardano, and I will explain why. The heart of the project can be understood in the following excerpt: “Scholarship/Grant platform based on Ethiopia’s Atala Prism, enabling safe, low-cost and conditional donations for students”. This is the idea. This will certainly benefit Africa, as it will allow financial donation in the form of scholarships to students who, as the proponents themselves say, contain potential but unfortunately do not have the means by which to exploit it. These students often do not have the basic conditions to eat properly, let alone study. Donors often fail to donate out of distrust of how these funds will be used, and hosting such information on the Cardano blockchain will make it tamper-proof, transparent and fully trusted, which can easily boost the number of donations made. And once such students receive the scholarships (if they are not fulfilling their basic obligations, the rest of the money can go back to the donor, which is very positive, as it is a way of guaranteeing to those who donate that their money will not be invested in vain), they will be able to devote themselves properly to their studies; perhaps, they will be able to enter college and have a dignified professional life, and they will always be grateful to Cardano for having been a way to make all this a reality. If the project succeeds, it will certainly popularize our blockchain across the continent, it will be seen with good eyes, and this will increase the number of investors in Ada, new people will be interested in participating in the community, people from the tech area may consider studying our programming languages ​​and work on our project, the number of transactions on Cardano's blockchain will certainly grow, in short, I only see advantages here. The team seems so aware and prepared for this project that they also establish what would be the possible risks to be faced, and some solutions that could be applied to each situation, which demonstrates a lot of maturity and reality in relation to the context and the problems that can happen. on here. Anyway, I think that this project has everything to succeed and most likely will have an extremely positive impact for Africa and Cardano, perfectly meeting the objectives of the challenge. \n", "q0r": 5, "q1": "The script is very good, we know what would happen and approximately when, in this way it is quite possible to understand the project development process. Some activities could be more detailed and the time division could be more exact, for example phase two would be from March to July. But what specifically would happen in March, in April, in May and so on? If this division were more exact, we could understand even better how this process would happen. However, his explanation is still much better than most projects, proponents are concerned with detailing various activities that would be developed in each phase. Regarding the team, I think they are extremely qualified people, based on their CVs, this can be concluded. It would be interesting for all members to have a link to their social networks, or in the case of those who are part of the universities, their profile could be attached on their websites, in short, some way of verifying the information that is said, as in the case of Johannes Haushofer, for example. It would also be better if the proponents explained who would do what in the project, this is not so clear, we don't know which people would be responsible for which activities. This is always important to know, especially in a complex project with such a large team. Regarding the budget, we have very detailed explanations on how the total amount would be divided, the parts into which it is divided are very well explained, including for example how many hours the professionals involved would work on the project. Therefore, in my view, the feasibility of the proposal is fully in line and conveys security as to what will be done, by whom and for how much investment. \n", "q1r": 5, "q2": "The auditability of the project is great, but it can improve a little in terms of the final results, I think. Regarding the partial results, that is, the project development process, the team would make updates available in Notion, so this part is fully auditable, it is enough that some members of the Cardano community are in charge of carrying out this monitoring periodically. This can be done weekly, every 15 days... Open Notion, browse through it until we find updates that can tell us where the stages of this project are. Regarding that, I think that's all right, that there's nothing to suggest. However, about the final result: from what I understand the funding requested now would be enough to cover phase 2 of the project, only. It would be necessary that, as was done by Notion on the carriage floor, let's say, the team also needed to establish a solid bridge with the community. This could suitably be done through video calls, I imagine, whereby some members of the Cardano community (preferably the same ones who audited the process through Notion) meet with project representatives to understand what the results have been so far. I think that there is no other way to measure the impact of this proposal, because, as it is said, it would not correspond to the project as a whole, so we can measure those commonly used statistics such as: number of Ada purchased, number of digital wallets created, NFTs brothers-in-law, etc. In this case, the final results of the project would be, in my opinion, to analyze whether the scholarships were actually awarded, if the students were making good use of them and what were the results of this investment in their academic lives (in the long term, it could even be analyzed whether they became members of the Cardano community). However, I think that this cannot be evaluated at the moment, being auditable content for when the last phase ends. Therefore, the only way I understand to understand if this phase was successful is to inform the team directly, and they do not suggest this, so it would be an improvement that I could suggest for the auditability of this proposal. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "This assessment goes into great detail on how the proposal addresses all main objectives for each criteria and clearly expresses why, while also giving reasonable advice for improvements. The CA shows full understanding of our proposal. Greatly appreciated review and assessment."}, {"id": 505, "q0": "This proposal is as high-impact I have seen - both in terms of impacting the exact metrics of this Campaign (New, viable applications, Attract new Users to the platform, Using Smart Contracts, potential for HIGH use) as well as potential for HIGH impact in the world, and if I may say so, in some areas that I believe the Cardano community shares an interest in: Humanitarian values, lifting up Africa, EDUCATION, purpose-driven, etc.\n\nI think this DApp has potential for HIGH interest and adoption, as users on both sides of the equation would be motivated by the value propasition: Donors get more transparency, trust, and bang for their buck! And Students would of course be motivated to participate in a program that offers them opportunities they would not otherwise have. \n\nTOP MARKS FOR IMPACT.", "q0r": 5, "q1": "This team has brought out this deeply reasoned proposal as an output of Funded work from Fund 6. They have fulfilled what they set our to do in that proposal -- and I would easily say have exceeded expectations for high quality work and an excellent plan to carry forward into phase 2 and beyond. The Roadmap and MIRO boards are things of beauty. I can't wait to see what they bring back for phase 3.", "q1r": 5, "q2": "They have provided excellent, transparent access to their work so far, and we have every reason to expect this to carry forward. Their KPIs are both reasonable and quantified, so that we can measure and audit their deliverables. They have even provided FUTURE KPIs so that we can understand where it's all heading. I will be watching this project, and appreciate that they have made it easy to do so.", "q2r": 5, "assessor": "z_assessor_1180", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Well written and valuable assessment that shows full understanding of the proposal by highlighting how the proposal addresses the main objectives for each criteria. We are happy to see our project attracting interest from the community and our team will work hard to continue deliver on our objectives."}, {"id": 2601, "q0": "By providing a donation dApp for education in Ethiopia and Kenya. It provides the following support for the ecosystem:\n•\tIn good alignment with the Atala Prism infrastructure helping with the adoption of that system adding educational donations on top of the digital identity provided for students.\n•\tAdding a philanthropic dApp improves the reputation of Cardano as well as attracting donors that may not have prior been part of the Cardano ecosystem.", "q0r": 5, "q1": "This is an experienced team that is building on their prior deliverables from Fund6. Most of their KPIs from Fund6 have been met or are in progress. (listed here: https://www.notion.so/KPIs-6b6d0451cee146db8b6ab4d83604fe38) Also they have a through roadmap listed that is clearly grown from where it was in their original Fund 6 proposal. (https://cardano.ideascale.com/c/idea/369558) \nOne concern is they have split their funding requests between two different campaigns. This focusing on the dApp and smart contract while the other on Self-Sovereign Identity., the scholarship portal.  (https://cardano.ideascale.com/c/idea/400027) Ideally for them to be successful both projects should get funded for maximum effectiveness. They plan on proposing for the next fund if they don’t get it this cycle, but this could slow the momentum of their project.\n", "q1r": 4, "q2": "This team has provided. A detailed list of for each of the deliverables for the project and a timeline. They are noting their deliverables on their notion site (https://directed.notion.site/Progress-Updates-81f92ecebefb4f289e80e1703ff73d2a)  The detail does seem a bit bare and could be improved. An example is from their deliverables from fund 6. They stated they would establish contact with NGOs as part of their partnerships. All that is listed is it is in progress. Perhaps a little more detail would be useful in which groups they have identified and more on progress of negotiations with the group, even if there have been no signed agreements. Just offer more detail on their website (https://directed.dev/)  and notion page.", "q2r": 4, "assessor": "z_assessor_1539", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4954, "q0": "The proposer has adequately address the criteria for the challenge and has developed a dedicated team with a diverse group of advisors.  The DirectEd proposes to address a daunting need by providing a decentralized platform to connect donors and recipients.  The impact section is detailed and well written and the supplemental material demonstrates the team has been focused on a solution to the problem.  The proposer demonstrates the benefit to the Cardano ecosystem and the team has adequately addressed the solutions within Cardano and blockchain environment.  I would have liked more information from the proposer on how they would solve challenges within local environments such as school systems, country educational systems (specifically Africa) and other logistical challenges which could occur in the real world (e.g internet access, distribution and management of donations, etc.).  The team highlights several risks to the project along with mitigation strategies.  I would recommend to the proposer to engage more legal expertise which would have strengthened the proposal.", "q0r": 4, "q1": "The proposer has provided a very detailed roadmap with multiple milestones.  The budget is built on an hourly scope by areas of need however I raise some concerns on the hourly rates for developers.  Based on my experience as a CEO of a tech company I find it difficult to believe engineer/developer rates of $25-$35 unless this is a discount from the team.  In addition, the legal cost seems very low.  The team is working to collaborate with multiple organizations to support the growth and execution of the project. ", "q1r": 4, "q2": "The proposer provides a communication path through their website with monthly progress updates and details on their current and project related KPIs.  This project will be easy to monitor, track and audit and the team has done a great job of addressing all the criteria in this section.", "q2r": 4, "assessor": "z_assessor_1807", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "A fair and valuable review that highlights certain areas we have room for improvement on, such as giving more details on how to solve challenges within local environments and engaging in more legal expertise. However, through our notion it is possible to access further information on these topics that didn't make it into full detail in the proposal."}, {"id": 5527, "q0": "Throughout the proposal it is being described how the team wants to implement a platform for scholarships/donations based on ATALA Prism and by using smart contracts for funding students, for the start, in Ethiopia or Kenya, to provide a more efficient and transparent way in doing so. \nIf successful in its endeavour, the proposal can have a great impact on students in those countries, who would be offered equal chances to receive scholarships and as such, receive the desired education that can offer them better chances in life. Besides that, donors would also gain more trust in the system, and the number of people and donations amounts could also stand to increase as a direct consequence.\nThis would not just be an advertisement for the Cardano ecosystem, but, more importantly, it could change the lives of students and through organic promotion it could lead to the change of many others.", "q0r": 5, "q1": "All the information presented for assessing the success of implementation is comprehensive:\nThe timeline goes up until Q2 2023 and beyond, all quarters have detailed steps described and are easy to follow.\nThe budget is very elaborate, covers both personnel and fixed expenses, detailed in cost per hour and number of hours needed. \nThe team has provided a lot of info regarding themselves, their knowledge and skills. They have attached links to external sources to provide proof. I find there is nothing missing from this section of the proposal and as such, it can be accurately assessed for a successful execution of the project.", "q1r": 5, "q2": "For the development progress, the team has provided a link to a third party service where teams can update their status for the accomplished steps of their projects (Notion). Besides that, the team plans to update their Github commits, which is a reliable source of progress measurement and has offered a plethora of other KPIs to measure the advancement of the endeavour.\nThe definition of success is clear and should not pose any problems in assessing its outcome.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5821, "q0": "The challenge is looking for novel and viable applications built on top of Cardano that can attract users and provide the most value. This team’s vision is “to build a world in which any person, regardless of their draw in the lottery of life, can realize their full potential”.\n\nThe problem that the proposers approach with their innovative solution is that of students in Africa not being able to achieve higher education. The team “combines blockchain transactions, smart contracts, decentralized identifiers and verifiable credentials to enable a transparent, secure, and low-cost method of sending conditional peer-to-peer donations to students across the globe.”\n\nTo fulfill their vision the team will use Cardano smart contracts to lock up donations to high school students in Kenya and Ethiopia. The donations will be released conditionally and in batches to the students who manage to enter university. Donors are rewarded NFTs that have utility as “entrance tickets” to a tracking platform where they can connect with the funded students. \n\nThis builds on their successful Fund6 proposal that is captured on video: https://bit.ly/36DYEqA\n\nPotential impact of the proposed peer-to-peer direct donation solution is immense. The solution helps philanthropists trust the donation platform as they can track the use and impact of their funds. Cutting out the unnecessary middlemen with the help of blockchain technology makes this a cost-effective solution. Utilization of decentralized identities guarantees that the money is used for the intended purpose. Mind you, the DID part of the solution is funded through another proposal: https://cardano.ideascale.com/c/idea/400027\n", "q0r": 5, "q1": "This is a very strong proposal because it tackles an issue that others have not touched, they’ve constructed a unique model that brings donors and the students together. Their diverse team is multi-talented, diverse and humble. They have great advisors, they have already built a Proof of Concept and they used an earlier proposal to get both the concept and the team ready. \n\nThe level of detail in the plan is amazing. This combined with their prior achievements creates a lot of trust in their ability to deliver a rather simple solution to a complex problem. The team consists of Oxford graduates, Plutus & Atala PRISM Pioneers, Community advisors, Young African Leaders and PhD candidates, incubators, as well as senior advisory board members representing academic, ICT development, entrepreneurship, and business management. They are obviously capable of implementing the plan. References, credentials and links to relevant information sources are present. \n\nThey have already gotten approvals from schools in Ethiopia and Kenya to operate and they have boots on the ground to stay aware of potential local legal issues. They will consult experts on personal data laws in each country they operate in. The team is looking for funding outside Catalyst as well. They understand that a revenue-generating business model is required to become financially sustainable.\nSplitting the proposal in two is wise. It means that if only one of them gets funded, they are able to start the work and apply for the remaining budget later.\n", "q1r": 5, "q2": "The team has provided channels to follow-up on the progress. Their solution is clearly outlined on the website (https://directed.dev/our-solution/) and it can be tracked through a public notion page (https://directed.notion.site/). They also use Twitter (https://twitter.com/DirectEd2022) and other social media to make sure that the communication regarding the project is continuous and clear.\n\nThe budget is clearly outlined and specified line item by line item. Sums are very reasonable as the hourly rates are quite low.. All in all, the plan makes a lot of sense: the why, the who, the what and the how are clearly identified. Without getting unnecessarily ahead of themselves, the team has also created a compelling vision of what possibly lies ahead. KPIs and goals extend well into 2023.\n\nKey deliverables for this proposal are also clear. They promise to deliver the second version of the Proof of Concept smart contract, UI for the donor section, market analysis. customer group interviews, customer acquisition and competitor research.\n", "q2r": 5, "assessor": "z_assessor_289", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "A very well written and valuable assessment that clearly highlights the main ways we target our objectives in all criteria and shows full understanding of the proposal. Greatly appreciated assessment."}, {"id": 8949, "q0": "I can say the proposers has been delivered a thorough and enthusiastic plan: to build a donation platform (DirectEd) which is based on Atala Prism, for offering scholarships for students in order to encourage them to learn about blockchain technology. The authors mentions that phase 1 of the plan, which was funded in Fund6, is about completion the Plutus Pioneer programme and the website, recruitment and collaboration with link included https://cardano.ideascale.com/c/idea/369558\nAs the authors explain, the plan continues in this round of Fund, is split into 2 proposals: this proposal which is called in short “DApps proposal” and another proposal “VCs smart contract integration” (which is called in short “SSI proposal” in challenge Self-Sovereign Identity) with link provided https://cardano.ideascale.com/c/idea/400027\nHowever, when I click into that  link, I saw proposal “DirectEd-Student Scholarship Portal” of the same team in the right place but wrong title. We will call them in short in order to avoid the confusion from here.\nThese two proposals are about to execute phase 2 of the plan: create an MVP which enables donations and launch a pilot project. Therefore, we need to read both of them to understand the project in a whole in order to give assessment.\nAs my reading, the plan is written in an excellent way with a deep research and clear explaination. It’s quite easy for readers to understand what content in the platforms, how it is unique, how it adds value to the ecosystem, the long vision of the the app. The authors show in excellent way about how deep they consider the project, from the creating to running and other use-cases the app could be applied. In my opinion, the proposal not only fits very well with objective laid out in the challenge but also benefits the Cardano ecosystem. The DirectEd Dapp, that will provide value for end users, is based on Cardano’s blockchain technology so that it will attract new users to Cardano; DirectEd brings solution making practical and effective use the power of smart contracts due to the second step of the proposal’s process: it specifies smart contracts for high schools in specific areas in using the Dapp, recipients need to have Cardano wallets to receive scholarships, therefore it will lead to the engagement in Cardano ecosystem.\n", "q0r": 5, "q1": "The team’s information is given and their social links are include so that we can see their photos, majors as well as their roles in the project. The phase 1 of the project was funded in Fund6 (as I said above) is evidence of skills and experience relevant to implement the proposal and the leader of the team has some proposals funded in Fund 6 and Fund7 (links provided). Advisors’ information and list of partnerships are also given. All of those are more than good enough to build trust for us that the great idea is in the good hands. \nAbout the financial amount, it seems to be fair and clearly split into specific items which are needed for the executing project in phase 2. What I missing here is: Kenya/Ethiopia visit cost in the fixed espenses is asking in this proposal, while all the activities related to university just be available in SSI proposal section, regarding to the detailed plan of phase 2 (Q3 and Q4). It is just my bonus question, I don’t see it is problem of the proposal’s feasibility.\nThe plan is explained very detailed about current work in progress (of phase 1 which is funded) and work need to do within timetable given in this project and in further project. All of them give us a vision of the plan as a whole.\nIn addition, the team also considered risks and challenge they would face in implementing the plan and the solution of mitigation of those risks.\nWith all the advantages of the proposal, I rate its feasibility with a score of 5.\n", "q1r": 5, "q2": "In my opinion, the proposal is auditable because of the following points:\n- It has roadmap in detail with milestones and time horizon for achievement ; clear understandable the description of the targeted problem as well as the solution that addresses the problem.\n- Metrics/KPIs that define the success of the proposal are set clearly, easy to see and easy to audit, especially since they updates progress, continuous KPI on their Notion page with link included. \n\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Scholarship/donation platform based on Atala PRISM enabling secure, low-cost, conditional peer-to-peer donations to students.", "experience": "Oxford graduates (maths/comp sci, economics). Plutus & Atala PRISM Pioneers. Community advisor. Addis Ababa University PhD candidate. Young African Leaders Initiative members. OX1 and IO incubators. Senior advisory board (academic, ICT dev, entrepreneurship, management, impact)."}