{"id": 400352, "author": "rajatauton", "title": "Liquidity Aggregator for Cardano", "url": "https://cardano.ideascale.com/a/dtd/400352-48088", "category": 26438, "amount": 76440, "description": "There is currently no liquidity aggregator on Cardano or order book-based DEX, which puts traders at a severe competitive disadvantage.", "funded": 2, "upvotes": 56858743, "downvotes": 10255468, "votes_result": 46603275, "votes_cast": 273, "f6_no_assessments": 2, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 6701, "q0": "The proposal builds on their solution to the problem, stating that there is currently no liquidity aggregator on Cardano or an order book based on DEX. While at present the latter might be true, but I am really hoping that we can build a suite of such Dexes/Liquidity aggregators on Cardano (e.g. Orion protocol already announced Cardano integration last year and is well known for providing liquidity across CEXes and DEXes in crypto space). Additionally, we have projects launching this year such as GeniusYield and ErogDex which will provide order book based trading. \n\nNevertheless, proposals such as these are a nice addition to all the projects that are already building on Cardano. The proposed solution smart dex 2.0 would be, in my opinion, one of the must-have dexes on Cardano, and the proposal does a good job at explaining why we need a liquidity aggregator. The 0x protocol solution the team proposes will allow an off-chain trading and on-chain settlement system, and in addition the bridge will allow the transfer of assets across multiple blockchains. This in my opinion is crucial especially when the liquidity on a certain exchange is limited. \n\nThe crypto space, especially Cardano, will benefit a lot when we can utilize the liquidity across different exchanges. The proposal also proposes to give smart pools on Smart dex 2.0, allowing intelligent investment ways via AI agents (such as higher yields on yield farmers).\n\nTherefore, I strongly agree that this proposal addresses the challenge in an effective way and will have a big impact on the Cardano ecosystem.", "q0r": 5, "q1": "The proposal has provided comprehensive details on the team involved with the implementation of this project and who is behind the proposal making team. The team has already done a good amount of work before on Dex on Ethereum and which is visible through the verifiable links provided here. The list of advisors is also given, and Dr Ben Goretzel, the founder of SingularityNet, is also in the list. \n\nIt is not clear to me, however, how many developers they have on board for this proposal but I can see they already have a Cardano bridge running on testnet. Additionally, the staking contract on testnet is also available. Links to both of them are provided in the proposal. These features are declared as part of Q1 2022, and they are already in place. In my opinion, this is a big plus as it shows the team is not starting from scratch, and have already achieved a couple of milestones before the proposal is made here.\n\nThe $76440 budget asked for is split very much in detail (most of it is understandably developer hours) and justified in my opinion. The remaining milestones give a deeper insight into what is planned in the remaining quarters of 2022. The timeline looks ambitious, especially given that the team might have to resolve a lot of pain points (especially because AMMs based dexes are highly prone to slippage and rely totally on the community for liquidity provision through a pool, leading to an inconsistency issues, hence aggregator contract will have tough job to do) problem provided in the risk/challenges section. The team has stated that they are aware of these issues and already working on addressing them.\n\nAs a Senior developer myself, I can assert that in the end all the engineering problems are solvable, some sooner or some later. Therefore, I feel that there are also significant chances that this would be tough to achieve in the provided timeline. Finally, I agree that it is likely to be implemented in the given timeline. Good luck to the team.\n", "q1r": 4, "q2": "From the auditability perspective, I find this proposal highly auditable. The 3 6 and 9 months of timeline gives a bullet points feature list. The short term (3 months) will see the NIOX token contract on Cardano Mainnet and a successful token bridge with support for Ethereum, Polygon and Cardano. \n\nIt is also worthwhile to note that the proposal is also a continuation of the previously funded proposal in Fund7. The team has provided a good success metric in terms of when the testnet and mainnet beta will be launched. \n\nThe targeted problem is clearly explained and how their solution to it (which is their upcoming product Smart DEX2.0) will solve it is well elaborated. Since the community has already shown trust in voting for their first part of this proposal in Fund 7, it is a clear sign that the problem and its solution was well understood by the Cardano community. Therefore, I strongly agree. \n\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "thank you for the feedback "}, {"id": 6607, "q0": "I think that a liquidity aggregator can be great for the cardano network. The proposers have done a good job explaining the benefits of having a liquidity aggregator and the value it brings to the cardano ecosystem. I can say that the proposal is in the scope of this challenge and it clearly articulates the value it will add to the cardano ecosystem. Furthermore, the key metrics of this proposal align with the challenge settings.\n", "q0r": 5, "q1": "I think that the proposers have included enough details to the proposal to give me confidence in the successful implementation of this project. They have provided a detailed timetable to complete the work. Furthermore, the budget has been broken down and seems reasonable. The linkedin profiles of the team members are also available. I think that, based on this information, the project can be executed.\n", "q1r": 5, "q2": "The proposers have included a roadmap with milestones up to 9 months to launch on mainet. However I think that they could do a better job by adding strong KPIs. Some KPIs that I would recommend are reports on github commits and monthly development updates. Other than that, I think that they have explained the problem and have provided a clear solution.\n", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "thank you for the feedback. "}], "solution": "Smartdex aggregates liquidity across DEXs to offer users efficient transactions along with an off-chain trading onchain settlement solution.", "experience": "DEX on ETH, Polygon, BSC with book and swap, upgraded to 0x v2.1 in 2020, the release of 2.0 with liquidity aggregation & cross-chain swaps."}