{"id": 400434, "author": "adamintross", "title": "ADAmint Fractionalized NFT Exchange", "url": "https://cardano.ideascale.com/a/dtd/400434-48088", "category": 26438, "amount": 170400, "description": "Increased NFT costs, speculative risk, and low transaction volume have made NFT marketplaces illiquid and inefficient.", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 702, "q0": "This is one of those key financial tools that markets, when left to their own devices, develop organically, as certain areas with market share become productive beyond the scope of the market to apportion liquidity to them.  In legacy markets, fractionalizing runs afoul of SEC rules and regulations, and so it runs into one of those games where you get to play, but you aren't in the club.  Crypto ushers in a different opportunity, and with the massive growth of NFT markets, \"value investors\" are left with no way to play in the sandbox.  Enter fractionalization, which in NFT terms means breaking an NFT up into a whole bunch of native tokens, allowing small purchases and expanding value markets that have become top heavy and stagnant.  The process described here is similar to the fractionalization occurring in other spaces like Ethereum and Solana, and its benefits are numerous including:  NFT market price discovery (currently the price finding mechanism is inaccurate and chunky), enhanced liquidity (instead of one big sale there are many small sales increasing  yields for token holders), democratization of investment (many NFT programs would benefit from more buyers at lower prices, as opposed to fewer at higher), curator fees (moving an existing high dollar NFT into the \"Vault\" will earn you a royalty-like fee on all the subsequent transactions), and easier monetization (collections can more quickly assign values to the holdings).  An exchange like this leads to ideas like mutual funds and ETFs, which, while overweight, overburdened victims of legacy monetary and regulations schema, brought value investing to the margins.", "q0r": 5, "q1": "The team has a extensive documentation of the idea and the research behind it, as well as multiple use cases drawn from other ecosystems.  I couldn't find the litepaper specifically, but the GitBook was clear and up to date, and made most things, including the tokenomics (3 types of platform based mints and several governance tokens) understandable from the PoV of a roadmap for the project.  There is still a lot of work to do on the smartcontract design, but the rest of the UI/UX seems to be framed and ready for development.  Once they have that, they have a solid 6-8 months of development work lined out, with lots of clear descriptions of which parts belong to which sprints, and the order that everything goes in.  the project itself isn't completely explicit on this, but I believe they are planning it as a 12 month project, which makes the budget seem like a lot better of a deal than at first glance.  The budget itself is broken down into hours/week/role and describes 5 developer roles to be filled.  The rates are reasonable, with the Plutus engineer coming in at $100/hr, which is fair.  There is an issue where they suggest they will hire moderators and community managers as needed, but no provisions are made for this in the funding, so the assumption has to be that they will bootstrap the costs themselves.  On a project this size, a community/marketing budget would have been appropriate, but on the length of the development timeline, that could be a later proposal.", "q1r": 5, "q2": "They have listed some ways to monitor the project via Discord communities, and through updates posted to their website and Medium, and they have included KPIs related to the community participation for measuring project awareness.  With the number of development sprints included here, they should have no trouble pulling milestones for the monthly reports.  Finally success of the proposal is a limited concept that need not include more than the functioning mvp of being able to vault an NFT, issue the fractionalization token, and an exchange where the tokens can be bought and sold.  Piece of cake right?  Additional measures included in the mvp should include the ability for all the fee and governance structures to function appropriately.  If all of that is in place, the adoption should take care of itself.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 8658, "q0": "I didn't really understand the proposal's solution until I read documentations posted by the proposer in the proposal's gitbook. The idea of ​​​​the proposal that using Fracada to fractionalizing NFTs into many parts besides building an NFT exchange market. As described by the proposer, a specific example of the effect of applying NFT Fractionalization is that sharing ownership among many users with 1 large value NFT. This solution will solve the following problems:\n1. Owners of large value NFTs or large collections of NFTs can sell their NFTs easier by fractionalized the NFT to multiple parts, the NFT value will be split according to the number of fractionalization that the NFTs is split by NFT owner willing.\n2. People who want to buy NFT but don't have enough money. However, they really want to own it, the NFT fractionlization will help the buyer can buy NFT in many stages or can call for many people to contribute capital to buy.\n3. This solution works in case it is considered as an investment in art NFTs with the belief that the value will increase in the future. Or by extension, it is possible to own real estate.\nIn general, the solution of the proposer is very good that can promote the development of luxury prr high value NFT and can create many good business models from here. However, this solution in my opinion only has great success in the distant future. As we all know the current NFT is just a trend since 1 year ago, a lot of art related NFTs have been released and have high value. However, most of them are inflated in value by business tricks or FOMO. The value of artworks is often difficult to determine and the NFT market is very young, so investing in it can be very risky. Moreover, the solution only really helps to solve the problem for high-value NFTs, but it is not a comprehensive solution for the entire NFT market. One more thing to note that the NFT Fractionalization solution of this proposal is dependent on Fracada (a framework for NFT Fractionalization developed with DcSpark). Currently, Fracada is only in the development stage and DcSpark also stated that they have no audit plan and do not guarantee the safety of Fracada. However, I still assess the proposed solution is very nice and have a difference with other same type projects.", "q0r": 4, "q1": "The entire implementation plan is given by the proposer that is very detailed and the implementation time is 8 months . I very much agree with this details plan, if proposer isnt an experienced and serious person, it is impossible to write such a detailed plan. Fund breakdown also goes all the way to paying developers to build the product. However, I found some unreasonable points and this is also the base for me to evaluate the feasibility of the proposal.\n1. The proposer's plan is that if the fund is granted, it will be used for hiring programmers in May. Thus, the team of the proposal does not have programmers at all. So why is it possible for the proposer to write down a detailed week-by-week plan for the proposal? If the proponent had been consulted by the programmers, they would have been listed on the project team list.\n2. According to the proposal, the core team of the proposal is 2 people who very experienced in accounting, finance, insurance and no programming related experience. In addition, the proposer did not provide relevant evidence to prove proposer experience. Although I also have some confidence in their management ability when looking at the detailed plan and the articles in the gitbook of the proposal. But a project with such a large bugdet requested (170k $), it will be difficult to assess the feasibility of the proposal.\n3. According to the criteria set by the challenge, 1 proposal can propose an amount of more than 100l$ if the proposer is big teams, companies or projects that have a proven user base. The proposer or core-team of the proposal does not meet this criterion.\nIn my suggestion to make the proposal more feasible, the proposer should seperate the proposal into 3 phases based on the required amount of funds:\n1. first stage: doing front-end development (apply for fund 8)\n2. phase 2: implement back-end development. Simultaneously develop blockchain programming (fund 9)\n3. stage 3: perfecting products and implementing business strategies (fund 10)\nHowever, the most important thing that proposer have to do first that making a plan to recruit programmers and list them on the project team.", "q1r": 2, "q2": "Proposer offer a method to measure and track project progress by creating weekly reports and publishing them on Discord. It makes perfect reasonable since every proposal's specific works have a timeline in weeks unit. However, this proposal integrates new and untested technology solutions (Fracada), so to avoid risks and transparency, the proposer should provide a github source to check the smart contract code operation. .\nThis proposal, if successful according to the proposer's plan, will be a big impact for the NFT market on Cardano. However, with the technical risks that i mentioned, the proposal is also risky and it is really impossible to accurately assess the level of success in the case Fracada is not too effective. If it is not possible to implement a solution on NFT Fractionalization, the project's platform will just be a common NFT marketplace like many other similar projects.", "q2r": 3, "assessor": "z_assessor_683", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 554, "q0": "A nice idea, which would be an interesting addition to the Cardano ecosystem, but poorly developed and with significant critical issues. Surely the fractional NFTs are an excellent way to participate in the holding of collections or single NFTs with a lower entry price, making them accessible to a greater number of investors or enthusiasts; in this way it also adds liquidity to a market that is not very liquid, facilitating a market valuation of the NFT and the use of these assets for the collateralisation of loans. It is not a completely new idea but a product already seen on other blockchains, with little success, also because the theoretical advantages of the fractionalization of NFTs are difficult to achieve in practice. By analyzing the proposal more specifically, it is clear that it is not reported how ADAmint will address the challenge, but rather the parameters to evaluate the success of the project, furthermore ADAmint will not build a solution for the fractionation of NFTs, as it is dependent upon the success of the audit of the open-source code of Fracada, but it is an ecosystem that is based on this product. ADAmint's team does not have the skills to carry out this project without hiring developers, and is also composed of only 2 members, they do not have a product to present or a site, but only a whitepaper, by the way quite superficial, it is not even reported the method of rewarding the holders of a fraction of the fractional NFT in the event that it is sold, with a sales process that involves the creation of a DAO for each fractionated NFT, or the sale of all fractionated tokens to a single owner that could redeem the NFT, this second point assumes that all the fractions are available on the open market, very unlikely, in addition to the fact that the last few fractions could be sold at crazy prices, making the redemption really difficult. The requested funds are therefore completely in disagreement with the guidelines of the “DApps and Integrations” campaign; for these reasons I think that the proposal doesn't address the challenge.", "q0r": 2, "q1": "There are not enough elements to establish whether this proposal will be implemented successfully, there are several problems to be addressed, and they depend first of all on Fracada's success, if so they should start building the whole platform from scratch, starting from hiring developers. It is an ambitious and difficult project to carry out, as the poor success of the fractionalization of NFTs has proven, it is likely that problems will arise that are not easy to deal with during the process, not only coding the smart contracts but also regulations problems and ideally, it is not easy to determine and maintain the value of the fraction of an NFT and of the NFT itself once fractionated.", "q1r": 2, "q2": "The information provided is sufficient to monitor the progress and success of the proposal, even though it is difficult to accurately calculate the time required for the implementation of the various phases even before hiring developers who should work between 20 and 40 hours per week as reported in the proposal. In any case, the listed points are clear indicators of the level of progress achieved and of the success at the user level, some more details could be added, for example the volume of tokens of fractionated NFTs exchanged compared to the total of the collection, but overall effective.", "q2r": 4, "assessor": "z_assessor_1187", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1740, "q0": "The proposal is described in an easy to understand way and the solution implementation plan is clear. The right core idea drives the challenge. From the overall plan laid out, I have confidence for the success of the proposal. If successful and properly developed, it will unleash the growth power of the NFT infrastructure and the CardanoNFT ecosystem. The solution is analyzed in detail. The proposal has also considered and actively disarmed risks when the project is implemented.", "q0r": 5, "q1": "The proposal has established a plan with a clear roadmap, detailed milestones divided by stages and a reasonable and professional allocation of work. The budget is broken down logically and detailed in every hour, each job is allocated. A coherent technical plan increases confidence in the success of the proposal. Besides, the team has a strong advantage with a team full of skills, techniques and experience to carry out the project positively and professionally.", "q1r": 5, "q2": "Clear, detailed roadmaps easily track development progress and success for what's being implemented in each phase. The proposal has a clear timetable, the budget is broken down reasonably transparent showing the success of the proposal for what is done. The proposal is brand new, but has already demonstrated its ability and believable power.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 6703, "q0": "The problem statement claims that NFT costs are increased, and low transaction volume exists because of which NFT marketplaces are illiquid and inefficient. I have noticed this issue in various blockchain forums/social media channels in the recent months, especially from the users who are neutral to blockchains and are coming from Solana based NFT exchanges. \n\nIt is high time that a big NFT platform which can stand parallely to competitors such as Solana is required, so that the projects such as fracada from dcSpark that are already funded could then be used as a backend for NFT platform such as this proposal. We have already seen that the NFT boom has done a lot of good to the Solana ecosystem, and a significant part of which is because of the ability to own/sell/share fractions of an NFT, which theoretically can be mapped to not only digital but any real world assets in future.\n\nTherefore, I strongly agree that this proposal identifies an existing problem and proposes a much needed solution for it, hence, will have a big impact on the Cardano ecosystem.\n", "q0r": 5, "q1": "The proposal has provided a current list of team members, Swilks and Ross (?). Both members of the proposal team seem to have good work experience in the tech space, and one of whom has been a crypto enthusiast since 2017. Since Ross also has a mathematics background, I see that there is a good understanding of blockchain technology and the IT/Crypto background certainly aids with leading this proposal. However, I do not see any public profile links available to this proposal, which would have been a nice addition to this proposal. \n\nMoreover, if we notice the challenge settings closely, it mentions clearly that any budget requirements that are beyond $100k are usually the projects who have MVP and/or have good user base along with competent teams (more than 5 definitely) as for team of 4-5 people typical good amount that has high probability of funding is around $40k-80k. Although, as a senior developer and IT expert myself I understand this proposal would require a lot of work and engineering hours, still I believe this proposal does not fit 100% with feasibility criterion requirements. \n\nThe team has provided information that they plan to hire new developers from the catalyst funding; this in my opinion also adds to the risk/challenge criterion. This is because plutus developers are in high demand and not necessarily available immediately (or if they have then this information is not provided either in the proposal), so even if funding exists, onboarding new developers might not be that quick which may push back the goal's timelines. The team has covered some aspects of their lack in technical expertise by providing information in the risks section and I agree that the Fracada proposal being already funded is a good thing for this proposal. Nevertheless, it would have been great if the team split this proposal in two parts, and started with an MVP product, for which I believe a 2 month funding would be good enough. Once they get a better understanding of the implementation challenges and gain community trust, they could then go for a high budget. Additionally, it is not even clear to me how they reached the hours of work needed for it (without developers consultation?). I can not therefore either agree or disagree that this proposal will be implemented successfully.\n", "q1r": 3, "q2": "The proposal provides a very detailed plan phase-wise, whereas each phase is then divided into weekly or biweekly timeframes. The proposer mentions that progress will be measured and reported on various platforms weekly. This is really good and I believe the community will be able to track the progress of this proposal quite easily. \n\nThe metrics/KPIs are also in my opinion clearly defined, and the business experience of one of the proposers in Solana NFT space is visible here, as the KPIs are well defined both in terms of Transactions/users per month and also an overall impact on the NFT Ecosystem. \n\nThe success of this project is defined pointwise, each of which can be achievable if they are able to build up the required set of developers and do a good job at marketing (in the marketing section) this project. Therefore, with respect to the auditability of this proposal I agree that this project can be tracked by the community easily.\n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Create a fractionalized NFT marketplace that allows buyers to minimize risk and hedge overall NFT exposure.", "experience": "We are a team of 2 individuals and a contract consultant. We have over 10 years of combined experience leading teams of 4-15 employees, three years of Big 4 consulting, nine years of data science, and 4+ years of operational, NFT, and blockchain consulting."}