{"id": 400460, "author": "defidiscussions", "title": "dApp Market for Tickets and Events", "url": "https://cardano.ideascale.com/a/dtd/400460-48088", "category": 26438, "amount": 150000, "description": "Legacy ticket marketplaces have high fees, scalpers, and other drawbacks and hindrances that affect user experience and accessibility.", "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7404, "q0": "I thought this idea was really good, I think it could be a very interesting way to expand Cardano's technologies to a wider audience. It is about “providing a Cardano blockchain-based ticketing marketplace for live and virtual events powered by smart contracts.” The problem situation defined by the proponent is that buying and selling tickets online is full of very expensive fees (which is true, anyone who has ever bought tickets to a party or show on websites and apps knows what he is talking about). The solution would be to host this transaction on the Cardano blockchain, so that it is completely transparent, immutable, secure and above all cheaper. As I said, I think it could be an organic way of attracting new members to our community, because people would just be looking to do things they already do (buying tickets to various events online). They wouldn't come because of Cardano, but they would know Cardano automatically. Perhaps this will attract new active members to our community once people realize the advantages of transacting on the Cardano blockchain compared to other blockchains and even traditional transfers. The proponent also argues, through research, about the magnitude of the problem he intends to solve here, as is clear from the excerpts “entertainment is one of the largest and fastest growing sectors in the world (US$ 2.6 trillion by 2025)” and “estimated $15.9 billion ticket scalper market in 2020”. It's super positive how he gives sources of his research, several sites through which we can verify the said information. Throughout the description of the proposal, the proposer goes on to argue how this application would work and why Cardano is the most suitable blockchain to develop it; it also further explains what the benefits would be for all users involved, such as artists and end consumers. Therefore, I think the proposal's impact is excellent, we know exactly: what would be done; why it should be done; features about Dapp; how beneficial this would be to Cardano; what the experience of each type of user would be; etc. This proposal certainly aligns with the objectives of the challenge, which in short are to promote the adoption of Cardano through high-value and impact Dapps for our blockchain. \n", "q0r": 5, "q1": "The proponent states what would be done in months 1, 3, 6 and 12 of the project. Long explanations are provided, so that we are able to understand very specifically what would have to be done for the project to become a reality. I think that in terms of detailing the activities, this part is excellent, my only suggestion for the script part would be that it really breaks the total time into shorter intervals, for example in months. This would further increase the level of understanding of the process. However, I emphasize that this question is presented with a lot of specificity and satisfactory level of detail. Moving on to the next analysis topic, the budget is not very well explained, unfortunately. We know that the professionals hired will be “1 full stack web developer and 2 smart contract developers, plus a project manager” and that they would work on the project for a total time of 3 to 6 months, which may vary. I think the proposer should have been more specific here. How much will each professional involved earn? How many hours per week will they dedicate to the project? If the time varies from 3 to 6 months, it means that they can earn an “x” or “2x” value, as the same amount of money can be used for twice as long, for example. This raises a little concern for me, it would be more interesting if the proponent had defined a safer time for the development of the project, and stipulated the hourly value of each professional's work. That way, we would have a much more solid notion of whether the money asked is fair or very high. So, on that, I believe the proposal could be better. Finally, speaking of the team, I think that this part is also not so adequate, little information is provided about each of the professionals involved. Although they have provided their linkedin profiles, the ideal would be for them to better detail their resumes in the proposal itself, that is, previous experiences, whether projects developed within our ecosystem or not. I would say that there is a certain trust in them, due to their professional performances and linkedin profiles, but this trust would be intensified with a more extensive curriculum here. So I conclude that the feasibility is ok, but it can still improve. \n", "q1r": 4, "q2": "I think the bidder explains well what would be considered success in the 6 month period (\"shipping an initial version of the web client, deploying multiple iterations of the smart contracts on Cardano Testnet, and starting integration with the frontend of the client\" mobile for Android and iOS”) and 1 year (“successfully deploy our verified contracts on the Cardano mainnet, acquire at least 1 partnership with a venue or event organizer, and list tickets on sale for at least 1 pilot event”). However, I believe that 6 months and 1 year is too long for the Cardano community to be out of date on progress. I think it would be more appropriate for the author of the proposal to determine smaller goals, partial goals to be achieved monthly, for example. It would also be important to have an idea of ​​how the work routine of those involved would be, if all professionals would be fulfilling the promised tasks in the right way and within the agreed deadlines. I think the proponent will update the IOG coordinators at meetings that take place on a standard basis, but I would like him to make it clearer how members of the Cardano community could be privy to such information. Regarding the final results, we have very well defined the success scenario that would be “bringing a low-cost and frictionless experience to the market for the end user, allowing more people to enrich their lives with virtual and face-to-face experiences”. The proponent claims that this can be measured through the Dapp used in mobile apps; the main objective would be to deliver a finished version of this application and the secondary objective would be to establish a partnership with a Cardano project, already stronger within our community. Again, I believe we know very well what to audit, we have a great explanation of what would need to be achieved in order for us to consider success a reality. My suggestion is to make such information accessible to members of the Cardano community, in my view the only thing missing even in the auditability of this proposal is to explain how this bridge between the project and the community would be made. Otherwise, everything is very well explained, we have a very satisfactory level of detail. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 422, "q0": "The entertainment industry has suffered from middlemen for years. The proposal describes an elegant solution on the Cardano blockchain that would eliminate them and bring further benefits. If the team succeeds in writing such an application and successfully attracts artists to it, this could be an extremely big opportunity for Cardano, as ticket sales volume is extremely high and will not decrease in the future. \n\nOnce people have found an entry point onto a platform, it is likely that they will stay on the platform. \n\nThe project is very ambitious, but judging by the proposal, the team has a sophisticated plan.", "q0r": 5, "q1": "Da team describes their project in great detail and already has experience in relevant areas, which is an advantage in complex projects like this. The steps defined in the roadmap are set at a feasible interval, but are very ambitious. If the team encounters problems, this can push the schedule back significantly. \n\nThe budget plan could be a bit more detailed, but the requested budget is within the scope for a project of the planned size. \n\nAnother important aspect is that the team has an experienced consultant, which favors the success of the project. \n\nShould the development succeed, there is little standing in the way of a successful launch, as there is no competition on the Cardano Blockchain so far. However, it is not yet entirely clear how the marketing will proceed. \n\nAll in all, the team has created good to very good conditions for a successful project.", "q1r": 4, "q2": "The team provides an accurate roadmap. In addition, important KPI are given, which are chosen sensibly. These points are very good and help in monitoring the progress. Unfortunately, I do not see how and if the community should receive regular updates. This would be desirable. ", "q2r": 4, "assessor": "z_assessor_1147", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3154, "q0": "I believe this proposal is very suitable for this challenge. Using smart contracts to directly selling ticket is very promising application. This takes advantages of Block-chain technology comes nearly to our life.", "q0r": 4, "q1": "The road map is clear and well defined. They give plan in 1, 3, 6, 12 months with specific targets for each duration.The requiring budgets are explained with care. The team is rich of experience and qualified. I have checked their Github, websites and documentation and was really impressive of their profiles. I do believe with this teams, they can succeed any project. ", "q1r": 4, "q2": "The author gives specific KPIs to audit this project in 6 and 12 months. As they said, \"Our primary KPI will be to release one well-designed, accessible, performant and user-friendly cross-platform (iOS and android) app for a partner Dapp project\". If the project is successful, I will be the first to use their application. ", "q2r": 5, "assessor": "z_assessor_1623", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5216, "q0": "This is a well-researched proposal that demonstrates a thorough understanding of the state of the market right now. This is also very well aligned with Catalyst's goals of driving forward innovation and adoption. I only have 2 concerns. First, the asking price is insanely high.  I'm not totally convinced that the price tag is appropriately proportional to the level of positive impact and innovation that it brings to the table. Second, I wish I could see reputable names for these connections to \"music industry producers\" and \"labels & performers.\" In order for this product to see any value towards adoption, there has to be interest and utilization by event ticket distributors. This is not the type of project that could be slowly grown by individuals pouring into the product. There needs to be an assurance that there will be clients. I give a positive review because I like what I see and I trust the developers to have these things in place, but I can't see proof of it. ", "q0r": 4, "q1": "The roadmap is much too detailed. I would prefer concise bullet points under month-by-month timeframes. Still, the information is all there. I can see relatively clearly the steps that will be taken to produce the product. Which, I think can pretty reliably be developed and marketed appropriately based on the extensive high-level experience on this team. The one qualm I have to raise with this budget is the lack of specificity. The proposal states that it will be going entirely to pay developers but I'd still like to see a breakdown. I want to know how much is intended for payment to these developers and over what timeframe, so that I can have a clear understanding of how efficiently the funds are being spent. Most of my issues with this proposal are relatively minor but are all still things that I definitely feel like I need to be seeing for a request of this price tag. ", "q1r": 4, "q2": "This roadmap isn't very clean. It has all of the right information, I think. I feel like I can deduce the success metrics down to 3 main categories. 1. Completion/deployment 2. Development of 1-2 strategic partnerships 3. 1 successful pilot event. I think these success metrics are minimal and do not demonstrate a truly rigorous standard for accountability and success. I would like to see more specific KPIs and quantifiable/tangible metrics that demonstrate ambitious thought into what will be aimed for every step of the way.", "q2r": 4, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6609, "q0": "The proposers want to create a decentralized ticket selling platform on the cardano network. I think that this can be a great idea as Cardano has low fees and is aiming to increase its speed. The proposers have done a great job explaining the ins and outs of the project as well as the benefits that it will bring into the cardano ecosystem.", "q0r": 5, "q1": "The proposers have explained how they will tackle the project and have also provided 2 roadmaps. They have also provided a budget breakdown as well as given information about the team. I think that the proposers have provided enough details to be consistent in the a successful implementation of the project.", "q1r": 5, "q2": "The proposers have done a good job including details that will help track the progress of the project. They have provided a roadmap with milestones up to 12 months. The proposers have also done a good job providing strong KPIs and an expected mainet launch date.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6754, "q0": "Event ticket sales in Cardano provides an actual use case for Blockchain technology. In addition, this use case is perfectly aligned with the fundamentals of the blockchain trust mechanism. The proposal addresses a significant challenge. ", "q0r": 5, "q1": "The proposal is from a very strong team. The Github repo demonstrates the capability of the team. WIth these established credentials and experience, the team will be able to implement the project in a successful manner. ", "q1r": 5, "q2": "The proposal seeks 150K USD for hiring one full stack web developer, and 2 smart contract developers, plus a project manager in a 3-6 month time period. 3-6 months is a wide period. Since the proposal is for a large amount ant the funding is for 1st phase only. There is a requirement for a more granular plan to justify the fund requirement. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Create a dapp marketplace for direct ticket sales, split payments, and automated reselling auctions enforced by smart contracts.", "experience": "Enterprise Grade App Developers with contributions to open source, connections to music industry producers, labels & performers, Plutus Pioneers, 20+ of years experience in software engineering, 15+ of years DEVOPS expertise, counseled by Business Advisors F4-F7 Project Managers"}