{"id": 400474, "author": "albert.feghaly", "title": "OpenScience Marketplace Scale-up", "url": "https://cardano.ideascale.com/a/dtd/400474-48088", "category": 26438, "amount": 80000, "description": "Scientific knowledge is often locked behind paywalls, in spite of it being mostly funded by the public. Science should be more accessible.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7405, "q0": "The idea presented here is really innovative. It is about making scientific knowledge more democratic, through the minting of NFTs that would represent research, articles, in short, the contents of this universe. In this way, the control of distribution and commercialization of the same can be better controlled by the creators/authors of the research, as we know that nowadays many of these articles are registered on sites that for you to access, you have to pay a monthly fee or some fee to access them; and often the profits are not properly allocated to those who created such content. In this sense, minting on Cardano's blockchain is a very pertinent solution, since each product would be fully traceable, the author would have much more control over who could access it and under what conditions. The proponent explains that NFTs would belong to two groups: first, those “non-monetizable: open access scientific publications, especially those linked to an academic institution, may not, in principle, be a source of revenue for authors”. In this case, no monetary value would be charged, but a kind of reputation, that is, scientists would be recognized as relevant when indexing such documents. The second group would be the “monetizables: One of the objectives of this project is to allow the scientist to monetize their work” in which authors can monitor them in various ways, according to the proponent, either graphic abstracts or articles in itself, in short, several NFTs that can be purchased, generating significant income for their creators. It is also very interesting how other parts of the project would develop, for example, articles would be constantly monitored (at least in the initial phase of the application), there would be ways to “bet” on certain articles, in short, several different ways and activities that could be done within that application. Overall, this would all constitute a DAO, and there would be various forms (structures) in which these NFTs could be minted. My opinion is that the proposal is without a doubt of high value for our Cardano ecosystem, for the following facts 1) the problem situation is real and needs to be resolved, Cardano is a blockchain with intelligent and decentralized solutions that seem, by the way they are described , be very well used to help form solutions in this use case 2) the scientific community would benefit, since many times they even need to pay to publish their research, with this platform they would get recognition and a good profitability about their works 3) all the technologies that will be used here are explained in a solid way, everything that is pertinent to Cardano, demonstrating a lot of confidence in what will be done and consequently in the impacts that will be generated. This proposal is certainly in line with the objectives of the challenge and will help to popularize CNFTs and increase the volume of Ada. \n", "q0r": 5, "q1": "The script is ok, but it could be better. We know what would happen within 1, 3 and 6 months of project development. I think that the activities that will be carried out are informed in a very logical way, but it would be better if the time divisions were monthly, not quarterly. The way you're presenting the roadmap, we don't have a specific understanding of what would happen in the first month, the second month and so on. Regarding the level of detail of the activities, almost all the activities are very technical, so even if they were better broken down, I think most CAs would not understand the specifics of these jobs (for example, I'm not from the technology area, so I cannot understand 100% all the processes that would be developed and worked on). However, some less technical parts could be better specified. For example, in the second quarter of work, “Continuous discussions with potentially interested laboratories” would be held. How would these discussions be promoted, what would be brought up for debate, how would the project be presented in an understandable way to those who are not familiar with the cryptographic universe? How could we find out if after 6 months, in fact, 50 institutions would be associated here? I think some more detail could have been provided about some activities so that we could understand the whole more solidly. Moving on to the next topic of analysis, the budget, 80 thousand dollars are requested, the proponent claims that previously the hourly rates of the professionals involved were more affordable, until they realized the real specificity and complexity of the work, so this time a higher hourly rate will be charged. It is quite simple for us to understand how the funding would be used, as it would basically go to the salary of these professionals involved. We know the value of the work hours, how many hours they would work per week and the total time in months they would dedicate to application, so it is fully understood how that money would be used. About this part, I think we have the necessary level of specificity, there is no doubt. Finishing the topic of feasibility, the professionals involved are presented very succinctly, basically we know their names and professional functions. It worries me that only Albert Feghaly is related to our blockchain technologies (he knows plutus). I also think it would be necessary for them to have more information about who they are, such as previous jobs, their linkedin profiles and so on. As much as a link has been made available, where we can get to know them better, I think these descriptions could be attached to the proposal itself. In general, we do have a good viability, with few points to be improved, but in my opinion it still deserves the maximum score. \n", "q1r": 5, "q2": "In terms of progress, I believe that the proponent provides us with very good ways of tracking the progress of activities and small advances. He says that because the team establishes external partnerships, it's not that simple to promote live work, however, he seems genuinely concerned with keeping the Cardano community up to date on his achievements. According to the proponent, there would be weekly updates on a certain website (the website they use as a bridge to the Cardano community), and these would be backed up in a “very succinct way to allow for quick progress tracking and auditability.” ”. They will also make small articles about their “successes, struggles and evolution” available on another site; on top of that, public KPIs would be delivered monthly. I just have a few observations to make, as much as I think this part looks great. First, will the successes, struggles and evolution speak only about the partial results or also about the tasks performed so that these results are guaranteed? In other words, will we also be able to verify that the work routine of the project professionals is happening correctly? Were they respecting the amount of work hours that were agreed? In terms of KPIs, what would they be? It would be very important if the proponent had already clarified by now which metrics, both quantitative and qualitative, would be used to measure the gradual progress of this application. I think that this part is really very good, despite the doubts, because even in a vague way the proponent says what would be taken and how it would be taken to the Cardano community (except in the case of KPIs, they would be published on one of these sites that he attached to the proposal?). Finally, looking at the success scenario, I would say that this can be very well summarized by the excerpt “development and scaling of our OpenScience NFT Marketplace, where content creators (scientists and academics) will be able to share and monetize their work”. The proponent wants to create a way for scientists to guarantee a stable and fair financial return, as I understand it; even because we know that, unfortunately, academic and research areas are not valued as they should be in many places. I think the proponent lacked a little more attention to the direct consequences that this project would have for the Cardano ecosystem. Of course, the number of CNFTs in circulation would increase (since each document was a CNFT); but would other Cardano technologies also be supported? Could these scholars somehow become active members of our community, and how could this all be measured? I think auditability is good, but it could still be improved, especially in terms of the final results and how they would be perceived in the Cardano ecosystem. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 10582, "q0": "I think this proposal has noble vision and grand goals. The concept is very much enticing, and the team explains it in a clear, well-detailed manner, being the academics they are. I consider this proposal as an effort to liberate knowledge and science values to who deserve and need it the most. The implementation of this proposal is truly leveraging the core spirit and various advantages of blockchain technology, with decentralization and NFT technology as the core. I am excited while imagining OpenScience NFT is the go-to platform for academics to publish their work, gradually replacing the gold standards we currently have such as Elsevier, Springer, and Ivy League universities Press. This will unlock a new and vast market for Cardano, onboarding users and promoting adoption which will be extremely impactful to not only Cardano’s bottomline but also the scientific and academic communities. The redistribution of power from scientific publishers to other stakeholders will result in the betterment and advancement of humanity in general.", "q0r": 5, "q1": "The proposal is written just as well as the previous in the Fund 7 since most of it is basically the same (with difference only in cost) but it had been addressed by the proposer. Roadmap and timeline are still clear and well-structured by describing what we can expect in each quarter. The team also stays the same, with their transparency about expertise and capabilities are much appreciated. I hope this signal everyone involved is still cohesively motivated and confident to continue the delivery and implementation of this proposal. We might be surprised with the inflated budget compared to the previous funds. However, upon conducting further investigation and comparative studies with similar proposals in the same challenges I think the rate is still reasonable and the engineering hours needed are actually more sensible with the frontend/UI/X and the backend separated. I also hope with the involvement of Thespian Agency (contracted by IOG and delivered us Daedalus frontend together) we can start seeing the MVP delivered and implemented within the first half of 2022. I think the current Fund 8 is a critical moment for the proposal to be succesfully implemented. This will further act as a testament if Catalyst as, idea-fostering innovation management and governance platform can achieve its communal objective and desired result within series of multiple timeframes. I trust we can still support this project further and ensure grand and noble idea like this one does not falter just because of lack of funding.", "q1r": 4, "q2": "The metrics and KPIs selected to measure the progress are relevant enough to track the progress of the delivery of this proposal. The team exposed it on 1-, 3-, and 6-months deliverables with explicit numbers and expected features being gradually implemented. Since they are also planning to make the code open-source, members of the community can easily go to their GitHub repositories and track the commits made there, both in quality and quantity. However, I hope the Intellart team can be more active in both GitHub and Twitter so we can know they are delivering something tangible progressively to the community. A single sentence weekly update telling about what they are currently working that particular week is okay for the general crowd but prevents the community from knowing more and further. Thankfully, they are starting to write short blogs in Medium so we can know more comprehensive stories. For now, they give off an impression of a small, capable team trying to deliver wonder to us despite dealing with various setbacks such as lack of resources. Therefore, I hope my assessment can be honest feedback to them and supporting them to achieve realizing this magnificent idea.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 487, "q0": "While perhaps not being a project that promises \"profitability\" and high user traffic, the prospects for the OpenScience Marketplace and PubWeave scaling project both align with the objectives of the dApps and Integration challenge and have the potential to bring significant amount of academic and scientific validation to the ecosystem which in turn can bring further legitimacy to cardano as a blockchain with significant real world utility and cardano NFT's specifically as innovations with increasingly demonstrable non-entertainment based real world utility. ", "q0r": 4, "q1": "The team, having already completed two Catalyst funding rounds seems to know clearly what's remaining to make this project ready for public launch. The team has a good balance of subject matter expertise, technical and development support and advisors to guide them through completion. The funding level for this round compensates for the drastically small amounts requested in the previous two rounds and appear adequate for the work remaining to do. The milestones all seem reasonable. ", "q1r": 4, "q2": "The team has put into place communication channels and a website to publish updates for the public. The github does not show currently updates, but the public will know where to access the code when the team says they've completed those steps of the milestones. ", "q2r": 4, "assessor": "z_assessor_1171", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "With osNFTs, researchers can publish, retain ownership of their work and distribute it to the general population in a marketable fashion.", "experience": "Bioinformatics, Python, JS, Big Data, ML, AI, Blockchain.\n\nTeam = 5 + 3 Advisors -> https://intellart.ca/#/team\n\nPhD-level, Post-doc-level.\n\nCombined peer-reviewed academic papers: 40.\nCombined open-source projects: 10.\nCombined experience in academia: A century."}