{"id": 400511, "author": "mkante", "title": "NFT marketplace enabling P2P DeFI", "url": "https://cardano.ideascale.com/a/dtd/400511-48088", "category": 26438, "amount": 650000, "description": "Marketplaces only serve as an exchange platform for buyers and sellers and creators. How to bring P2P DeFI with explosive use cases within.", "f6_no_assessments": 4, "f6_rating": 1.7499999999999998, "videos": [], "media": [], "f6_assessments": [{"q0": "Proposal is a good idea that touches the core and is highly impactful to the challenge. To increase the utility and adoption of Cardano. The proponent launched an interest-free lending scheme on a cryptocurrency exchange. Help owners get more revenue from their properties. Save and develop a healthy ecosystem. Create a bridge between assets and exchanges using technology on the same Blockchain. The growth in the number of application transactions will increase the cardano ecosystem. However, you should have solutions for the risks that may occur when the project is implemented.", "q0r": 4, "q1": "The proposal shows that the team members are all people with the right expertise, techniques and experience to develop the project. I don't know if the proposal can be sustainable over time? The proposal's roadmap doesn't have any dates or times associated with each step. The team suggested a budget of $650,000 as sufficient. But I noticed a contradiction in your budget. You will use your $650,000 budget for the duration of the plan, how many members will work on the project, their wages and hours, and how much money will be spent on the elements. other project work. ..Adding a detailed budget, broken down by milestones will add a sustainability element to the project.", "q1r": 2, "q2": "In my personal opinion. It would be beneficial to add a few detailed KPIs, timelines, and budgets for each milestone. This will make it easier for developers and the community to audit and measure the success of the proposal. Add transparency to the team's brand new proposal.", "q2r": 2, "assessor": "z_assessor_1409", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This is an automatic no for me, just based on the price tag. If the goal is to efficiently produce as much innovation as possible, we have to recognize the fact that 20+ other projects can be produced for $650k. Still, I don't think I would give a positive score for this project at $10k. It's true that there's no other project like this because the economic mechanics of the model are unsustainable. Lending without earning interest will attract no lenders and uncollateralized borrowing will attract malicious actors. The passive income mechanism is not made clear, either. If there's no interest for lending, I'm not understanding where the income is coming in from. I'm also unclear about how NFTs play a role in this model. What do the NFTs do and how do they interact with the product/protocol. There's not enough information about this product idea that shows me how it works and why it's innovative. ", "q0r": 1, "q1": "This isn't really a roadmap that helps me understand when things will be done and what is being done to make that happen. The items seem very ambitious and I'm not convinced that the 2 core members of the team are capable of producing it. Between the two of them, they have no blockchain experience, no marketing experience, and minimal software engineering experience. The existing core team is not capable of producing what they've laid out. Without blockchain experience, nobody on their core team is capable of accurately estimating what it will cost to create this product. So the cost can't be trusted. They also don't give a breakdown of why the budget costs this much. They give high estimates based on features and customization but these are things that are implimented with time to write the code on the back end and produce the interface on the front end. In other words, it's all labor. Therefore, what they're really saying is that they will be taking the money to pay themselves for this product. And it's vastly overpriced. They don't give a timeline but if it took 2 years, they'd be paying themselves $13,540 a month each. Not at all \"moderate.\" ", "q1r": 1, "q2": "This area may be a negative score, due to my own evaluative criteria for what I look for. I look for quantifiable KPIs regarding the actual use of the product, NOT the completion of the product. Completion is a minimum first step for success but that actual impact of the project comes from the number of people using the product. Since this section does not have any of those types of KPIs or any public links to where the developers can be kept accountable, I have nothing that I feel I can vote on for success of this project. ", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "I can neither agree or disagree that the proposal effectively addresses the challenge. The solution proposed is to provide an incentive to lend with or without bearing interests. The idea here is to bring it to life via an NFT marketplace which can enable P2P DeFi. The current marketplaces are primarily targeting NFT arts sales, but not really expanding to a lending-borrowing use case, which this proposal is intending to address.\n\nHowever, what I am missing is that any details on how an NFT marketplace will be used to enable P2P DeFi. The project white paper is not available and most likely a work in progress which will either be available sometime in future OR after this proposal is funded. Although the idea is quite novel but It is hard to fill the gap for voters on how this project proposal will eventually provide the proposed solution. \n\nThere are already projects such as Liqwid Protocol that enable this use case and if the Proposer will check their initial proposals from fund 2 or later, he can get a pretty good idea about what gaps can be filled in making such a proposal a great one. I, therefore, see a potential for improvements here.\n", "q0r": 3, "q1": "I strongly disagree that this proposal is highly likely to be implemented successfully. There is a very high and abstract level of project plan presented, which is only at the idea level. This is  usually OK if the asked funding is for an MVP, and the asked budget is to build up a proof of concept project. This is exactly what this proposal should have targeted, and once they have had more clarity with their implementation plan, they could go for higher budget requirements.\n\nThere are absolutely no timelines given and the budget is based on what a typical market place based on exchange will cost. This is not justified as more details would be required, like how much of the budget will go to engineering hours, and how much will go to things such as marketing, sales.\n\nThe risk section considers certain challenges and risks but this list would grow given the current state of this proposal. I would therefore suggest proposers to come back in the next round and first ask for a smaller budget amount with an MVP in place. The MVP does not necessarily have to be a running software but also could be a white paper and clarity on architecture, flow diagrams, high level drawings etc.  Good luck to the team.\n", "q1r": 1, "q2": "Again, the auditability section is no different than the prior two sections and even though the incremental milestone approach is mentioned, it is very hard to track when there is no detailed plan presented. Additionally the success metric is also an abstract concept based on the progress trackability metrics. The idea and vision is noble, but it is not based upon some concrete implementation plan, hence I disagree.", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "At first glance the idea of a P2P DeFi protocol seems intriguing, however, the proposal fails to provide sufficient detail as to how it would function, for instance, what would be the incentive to offer interest-free loans, or how does the proposed NFT marketplace tie in.\nBecause of this lack of clarity and detail, it’s really hard to assess the impact the project might have on the ecosystem.\nI would suggest rewriting the proposal for clarity by adding a list of specific features the proposed P2P marketplace would have and describing how exactly it would operate.", "q0r": 2, "q1": "The presented roadmap does not seem to be project-specific and looks more like the “general steps of a crypto project”. Even as such it doesn't seem to make perfect sense as the “7. Public Sale” step is followed by another “10. Community fundraising” without any further explanation as to what that would mean. No start date or launch date, or any other time frame is attached to the roadmap. If the project is resubmitted I would strongly advise presenting a detailed plan specific to the project.\nThe budget is not broken down at all and the answer to the detailed budget breakdown question is basically just a re-statement of the requested budget with an attempt to compare to the cost of development of other similar products, however, no references or links are provided for these amounts.\nThe requested budget is high at 650000, and especially at this amount, a clearly presented distribution plan would have been needed.\nNo external links or references are provided by the team in order to be able to verify the claimed experience or credentials. Links to previous work or links to professional profiles would have been needed to verify and assess the feasibility of the proposal. I would suggest including them in a future iteration.", "q1r": 1, "q2": "The auditability section talks about closely following the roadmap, however, as I mentioned in my assessment of the feasibility section the roadmap does not seem to be specific to this project and contains mostly general concepts such as “3. Crypto currency development” and “5. Whitepaper Release”. No other KPIs are presented and none can be deduced from the roadmap making it virtually impossible for the progress on the proposal as is to be verified and audited. This is especially problematic given the $650,000 budget requested. The definition of success is a general overview of what the project might look like further down the line if successful but doesn't present any development milestone successes.", "q2r": 1, "assessor": "z_assessor_681", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Incentivize lending w/out bearing interest. Allow borrowing without collaterals or paying interest and build credibility profile over time.", "experience": "Mohamed has near to 10 years of experience working in the IT industry in many leadership roles counting his last one where he is the Enterprise Lead for the Department of Homeland Security and its 11 components. 12yrs of serve in the U.S. Navy Reverse, currently a Naval Officer."}