{"id": 400643, "author": "metafrontier", "title": "Sustainable Apparel Trace demo", "url": "https://cardano.ideascale.com/a/dtd/400643-48088", "category": 26438, "amount": 100000, "description": "For sustainable enviorment (SDG), it is necesarry to full trace(from product generation to end of product) not only \"a part of product life\"", "f6_no_assessments": 5, "f6_rating": 2.4666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "Sustainability is extremely important and the verifiability of sustainable manufacturing is likely to become more relevant in the coming years! The proposal wants to provide a tool for the verification of the manufacturing chain for sustainability.\n\nHowever, the proposal is very vague, which makes it difficult to evaluate the project. This may be related to brand protection, but it is a pity.\n\nHowever, if it is possible to set up such a project, this would be very good for Cardano, as it would attract both business and private customers.", "q0r": 4, "q1": "Unfortunately, the project does not present any milestone or schedule, so it is difficult to assess whether the project can be completed in the planned timeframe. Furthermore, the budget plan is very vague and the team is not yet finalized. All this makes for a high degree of uncertainty! \n\nIt is not clear if the project will succeed or if there is a market for this project...\n", "q1r": 3, "q2": "While there are supposed to be weekly updates, there is no overall plan into which the current status can be placed. Unfortunately, the necessary context is missing. Furthermore, it is unfortunately not possible to check the progress independently. One is dependent on the updates of the team. However, since the proposal is already very short, I see this somewhat critically.\n\nUnfortunately, due to the lack of information, it is only possible to evaluate the progress of the project to a very limited extent. ", "q2r": 2, "assessor": "z_assessor_1147", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Obviously, there's a language barrier here that might mess with the organization of the proposal but I do think there are objective factors to vote on. First of all, this project doesn't really explain what the positive impact would be as a result of this project. I gather that this is a sort of supply-chain tool related to a clothing line. I can understand what it does but I can't understand why it matters. Why does this need to be built on Cardano? Why would it benefit Cardano or the lives of other people? I'm not totally sure if this is a new innovation that isn't being done anywhere else. The whole point of this section is supposed to be about what impactful difference the proposal makes and I do not feel this addresses that. Plus, the price tag is very high. There is a missed opportunity here where they can't name their partner that can bring in 100k followers. I understand that there may be some kind of legal issue but strategic partnerships provide credibility. Which is an area that this project is lacking. I would suggest being a little less descriptive here and a little more \"storytelling\" of what the world looks like after this project is implimented. ", "q0r": 1, "q1": "There might be a misunderstanding of what this question was asking because this section does not provide a roadmap. It says the product will be done in 1 year but I don't know what steps will be taken to complete the project. If there was a roadmap, I would probably be pretty ok with the development team. I think they have enough software engineering, marketing, and even legal. I am going to forego my comments on the budget because I can't really understand the structure of what's needed for this project, excpet for the fact that it needs more details on how the money is being spent exactly. Like breakdown of hourly rate and hours needed to complete the project or how much \"IC tags\" cost. More details needed on roadmap and budget. ", "q1r": 2, "q2": "There are no quantifiable KPIs provided. I like to see specific metrics that objectively measure the success and progress of a proejct. This project also only outlines the completion of the product as a measure of success, which I think is a mistake. A completed project is a necessary step for success but the true success is acheived through how the product impacts the world. How many people are impacted? How does it drive forward adoption? Is the hardware stable and sustainable? Things like this are more of what I would like to see. ", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement does not clearly align with the Challenge question, but it does describe a valid problem of traceability. The solution appears to be an app that will allow the traceability of clothing throughout its lifecycle. The concept is valid, however the proposal does not clearly explain: how the traceability solution will work, or if it is specific to the development of the app, or the clothing company. The proposal claims: \"We have a strong and influential person on our team in the apparel industry, who will not be named, and we believe we can bring in over 100,000 users.\" however, it's not clear why this person is not named, or how we can verify this statement to be true. If this were true, what is the motivation to keep this important information hidden from the voters who will be funding this proposal?\nThe website linked in the proposal appears to be a Japanese company that builds virtual spaces (metaverses) and I have been able to briefly explore one of them. While this company may have a well qualified technical team, it is not clear if they have experience with the apparel industry. Being able to trace a product does not mean that product is \"sustainable\", therefore more information about how this will insure sustainability practices are being used would benefit this proposal. No information is given on the potential suppliers, manufactures, distribution, or who the customers of this \"sustainable\" clothing will be. ", "q0r": 3, "q1": "The proposer provides some information about the team, and the bio of the which appears to be a large technology company with the goal to \"bring the digital world to life and give birth to heroes of the metaverse\" Therefore it is unclear to me from reading this proposal how this metaverse focused I.T. company is going to transition into a sustainable apparel company. They may be able to deliver on the technical side of delivering a Cardano based tracking solution, but that is only a small part of running a successful sustainable apparel company. The budget includes 5 line items for the $100,000 budget, but there is very little explanation or roadmap with specific tasks that will be completed. I would suggest the team re-apply in the next funding round with more details about the proposed solution and the team that will implement it. The concept is good, but with this proposal it is unclear how they will achieve their stated goals, or how the money will be used. The proposer has also listed another proposal for the same $100,000 budget to build an NFT marketplace (https://cardano.ideascale.com/c/idea/400642) ", "q1r": 2, "q2": "Due to the way this proposal is written, there is no clear way to audit this proposal. In the auditability section of the proposal it says: \"The criterion for success is the achievement of the KPIs mentioned above. If this is achieved, we consider it a success.\" however the only KPI's included are :\n\"Weekly, written reports will be provided on the status of the development.\nQuestions may also be submitted via the website at any time.\nIf possible, we will participate in bi-weekly Eastern Hemisphere meetups to demonstrate the status.\"\nThis does not provide a method for the community to verify and track how the $100,000 is being spent, or even a clear explanation of what will be delivered. For a budget of this size, and a company with the professional credentials indicated, I would expect a more professional proposal to be written. I would suggest to the proposing team to consult with an english speaking CA to assist with re-writing this proposal, to include more details of the proposed solution, so that it can be re-assessed by the community. ", "q2r": 2, "assessor": "z_assessor_215", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is excellent in its premise, but the proposal may not be complete enough to assess its full promised impact. \nThe devil in sustainability claims is always in the details. This proposal does offer to fully  trace (from product generation to end of product) apparel to ensure that they are sustainable. The team states that it has developed garments that \"(1) ensure that the raw materials are grown in an earth-friendly manner\" and \"(2) ensure that they are converted to soil when disposed of.\" \nToo bad that the team has not expounded on these two claims, as they are crucial in any sustainability excercise and SDGs traceability. \nNamely, is the claim that \"raw materials are grown in an earth-friendly manner\" certified independently and by whom? WHich institution will certify that the apparel that will be using the  IC tags is compliant with the SDGs? And with which SDGs? There are 17 Sustainable Development Goals (SDGs) and is the apparel compliant with  SDG 3 “Ensure healthy lives and promote well-being for all at all ages” by avoiding child slavery or is it compliant with SDG 1 \"End poverty in all its forms everywhere\" or SDG 13 \"Take urgent action to combat climate change and its impacts\" \nThis needs to be part of the proposal and documented, as everything that follows is based on this supposition. \nIf Catalyst is to finance a traceability proposal, it is key to ensure that the starting point - the apparel in this case - is adequately certfied. Is it organic recycled cotton, is it organic hemp, is it organic linen, tencel, Piñatex? I was dying to find out more.. so if this proposal is resubmitted, please include the specifics. Without the specifics, it is hard to assess the impact of traceability for generic \"Sustainable Apparel\" \n", "q0r": 3, "q1": "This proposing team seems that have the capacity, on the face of it, to implement the proposal. The team does specify to have experience with three key aspects in the proposal (i) product management for apparel companies, (ii) experience in handling IC tags and (iii) experience in blockchain development. The first part is better documented (product management for apparel companies), however the experience in handling IC tags is not as well documented and the experience in blockchain development. Here we need specific documented experience with the Cardano blockchain, Haskell, Plutus and integration with the Cardano components used for the Beefchain project. If you have the experience, flaunt it. \nThe budget breakdown is a bit bare bones for a $100000 proposal although one of the co-proposers yuta is well known in the Catalyst community. Still, the proposal's budget can either this sparse (if the team delivered previous large Cardano blockchain solutions) or needs to be more detailed, as this is a relatively ambitious project. I would recommend a better budget breakdown - linked to proposal stages - if it is resubmitted. \n", "q1r": 3, "q2": "I commend the team for their transparency. The offered methods of communication about the progress of implementation are excellent. The team suggests to provide weekly written reports as development progresses. Perfect in my view. They are oepn to answering questions via the website at any time and intend to partake in in bi-weekly Eastern Hemisphere meetups to showcase progress. The auditability of the budget seems a bit dificult as the budget remains a bit too general. For example, to me this is unclear: \"Provision of IOG traceability package $30,000\" . I would advise more budgetary disclosure, to make this less an idea, more an implementation plan - linked to development stages. WIll there be complementary funding from other sources? Not clear although the team specifies \"There are many very diverse and numerous team members. \" - but not many are presented. As it stands now, the auditability seems like it could benefit from better milestones and KPIs.\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "There is clarity in the association of problem and solution with challenge. According to the author for environmental sustainability (SDG), full traceability (from creation to end of product) is essential, it is not just \"part of the product life cycle\". The solution is to create full information about the Costume with similarity. This could be a good demonstration of the traceability of SDGs. The proponent has developed garments with 2 criteria in mind: (1) ensuring that raw materials are grown in an earth-friendly manner and (2) ensuring that they are converted to land when disposal. According to the proponent he has developed traceability tools to verify (1) & (2), it would be great if he could provide a link or some pictures of the work this tool. The proponent has outlined a number of risks and challenges that may be encountered when implementing the project, and also proposed plans to face those challenges.", "q0r": 4, "q1": "Regarding the detailed plan and time to come up with the solution: it will be difficult to track the progress of this project because the proposal only mentions some necessary work during the project implementation and he believes that The project will be completed by the end of this year. I'd love to see the team create a thorough development roadmap and add milestones to provide deeper detail, establishing technical development milestones for the product.\nBudget is also a discussion-worthy part of this proposal, which asks for $100,000 for:\n1 clothing manager $10,000\n2 development engineers $30,000\n1 project manager $10,000\nOffer $30,000 . IOG traceability package\nBuy IC card, $20,000 for testing\nTo be more convincing I think the author needs to describe these costs in more detail. For example, the cost for 2 development engineers is 30,000 USD, I need to know the specific amount for each engineer, how long will they work, monthly or hourly salary?\nIn addition, details about the team members are not provided, in this proposal, only details about President Tsuda are introduced. The other members are mentioned a lot and it is impossible to list everyone. The Proposal also provides a link (https://www.metafrontier.inc/) to learn about the members, the Proposal also provides an affiliate link (https://www.metafrontier) .inc/) to be able to find out about those members, but when accessing, other than Mr. Tsuda, I can't find any information about the remaining members. For all of the above reasons I disagree with the feasibility of the proposal.", "q1r": 2, "q2": "The information provided is not sufficient to assess the progress and success of the proposal. As stated this proposal is difficult to audit, as it does not show a roadmap with a development plan, detailed explanations of each step, timelines and several ways for the community to quantify success. of the proposal. The metrics and KPIs provided are also vague, citing:\"\"Weekly, written reports will be provided on the status of development.\nQuestions can also be submitted via the website at any time.\nIf possible, we will attend meetings in the Eastern Hemisphere every two weeks to demonstrate our position.\"\" It's not like a KPI but more of a method by which the proposal team can be tracked by the community your project implementation process.\nThis proposal is a new proposal that has not been funded before.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We will try to make full hystory of Apparel (source of Clothes) with compony. Which can be good demonstration for SDGs traceability.", "experience": "Experienced in product management for apparel companies.\nExperience in handling IC tags.\nExperience in blockchain development."}