{"id": 400668, "author": "nicoarqueros", "title": "TheGraph in Milkomeda", "url": "https://cardano.ideascale.com/a/dtd/400668-48088", "category": 26438, "amount": 20000, "description": "Indexers are a core component of DeFi and one popular indexer protocol is called TheGraph. We need a project like this in Cardano", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1519, "q0": "This proposal seeks to implement the indexer protocol TheGraph to Milkomedia.  The proposal aligns with the campaign brief well, as stated in the proposal, if TheGraph is implemented on the Milkomeda platform it will help projects to deploy on Cardano easier. This is indeed considered impactful. As a result of alignment of the challenge and with the core project idea, the proposal receives 5 stars in terms of impact.", "q0r": 5, "q1": "The budget states that a part of the fund will be used to understand the application, it is also stated that this project in rather difficult to implement. There is ambiguity in the proposal, it is unclear how much time and effort have to be dedicated in order to succeed with the implementation of TheGraph. This should be broken down and detailed further in a detailed plan. There is no detailed plan or milestones in the current proposal. This should be addressed. There are too many unknown variables in the proposal right now, which makes it hard to argument for it being feasible.\nThere is a post in the budget called \"Maintaining the service\" for 10k, how long will you be able to provide maintenance with this amount of funding?\nThe resulting score will be 2 stars, one star is added because the team is credible and have experience. It  is not possible to call this proposal feasible before the above mentioned points have been addressed.", "q1r": 2, "q2": "The auditability section is lacking in its current state. The first paragraph should answer *how* you will measure your progress and development so that the community can audit the process. Right now the proposal only states that progress will be defined later on. \nThe definition of success in the proposal states that a successful launch is dApps deployed on Cardano through Milkomeda + TheGraph usage. The problem in this paragraph is that there is no clear definiton of success, it is general and subjective. The proposers should add clear and measureable KPI's as well as attaching numbers to them. This way, the proposers and the community can assess the project in the future and evaluate if the set goals have been achieved. \nThe auditability section has to be refined in this proposal, the score will be 1 star for now.", "q2r": 1, "assessor": "z_assessor_139", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7229, "q0": "This is another proposal by the well known company dcSpark which has worked on multiple Cardano projects in the last few years. In this case they propose deploying an instance of The Graph, which is an open source indexer for the blockchain space built on Ethereum, on Milkomeda, the Cardano sidechain.\n\nThis sounds like a cool idea as it will allow lots of existing and new DApps to use this protocol to get the information they need on the blockchain, without having to code for new API’s to get it for them, saving them a lot of work. The net result will be faster DApp deployment on Cardano and more decentralized applications that are still performant.\nThe proposers outlined as a risk the fact that The Graph was not built by dcSpark and so they will have to update the Milkomeda instance they want to implement with all the updates the original one gets.\nSince this is about building an integration between an existing service and Cardano DApps, this proposal definitely addresses the challenge effectively. Score: 5.\n", "q0r": 5, "q1": "The proposers have provided a small timeline, forecasting that it will take Q2 of 2022 to plan and prepare for the deployment and it should be ready in Q3. As a person with over 7 years of experience in IT, I can see how integrating this protocol written for Ethereum might present issues when integrated with Milkomeda, so it seems reasonable to me that it might take a few months to do it. The budget is broken down into 2 parts, for a total of 20000 USD, which seems like a very low amount for the effort needed here.\nRegarding the team, as mentioned in the beginning, the people behind this proposal are a company called dcSpark which is well known in the Cardano ecosystem. As a recommendation, I think it would be useful to always share a link to your site (https://www.dcspark.io/) so that voters can easily see who you are and maybe to list a few of your achievements, just to make it more convincing. It would also be worthwhile to assign a person of contact for the Catalyst proposal, mention them in the proposal itself and share a social media account, so anyone from the community can reach out and contact them at any time.\nTo sum up, I believe this proposal is highly likely to be implemented successfully. Score: 5.", "q1r": 5, "q2": "The Auditability section unfortunately does not offer us much by way of key progress indicators. It’s mentioned only that progress can be defined as the progress towards deploying The Graph on Milkomeda, but that is not saying anything specifically. The community needs to be told how they can verify this progress. Since this will be a lot of discovery work, perhaps a good idea would be to just commit to sharing progress reports on social media for the community to see. Then, when work starts being done, it can be tracked via github commits.\nThe same goes for how success is defined: you should try to set a target here for how many DApps you expect to be deployed that use data stored in The Graph. I think you could even share data obtained from something as simple as polls for people developing on Cardano as an approximate target.\nDue to the missing targets that I mentioned, I can only give a score of 4, but I am quite certain that the community can work with dcSpark to obtain the necessary information if the proposal is funded.\nKeep up the good work!", "q2r": 4, "assessor": "z_assessor_546", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8608, "q0": "The Graph protocol has been called the Google of Blockchains. Through this submission, dcSpark is requesting funds to integrate the protocol with the Milkomeda EVM and IPFS.\n\nGiven that The Graph is already a promising protocol on the Ethereum blockchain and platforms built on top of Ethereum, integrating it with Cardano through Milkomeda can prove to be incredibly impactful for the whole ecosystem. If the dcSpark team is successful in deploying the graph on Milkomeda any dapp building on Cardano will be able to make use of the blockchain query protocol, and as such greatly improve its functionality. Given this the proposal perfectly addresses the objectives of the challenge.\n\nIn addition, the team description of risks is very much on point and ongoing funding for this project may be needed to address the continuous updates to the Graph protocol. I would like to advise the team to consider this route if their implementation is successful.", "q0r": 5, "q1": "Given the scope of the proposal, the implementation plan makes sense, even if it is on the shorter side.\n\nAs described by the team this will be a challenging engineering effort but a pretty straightforward one for capital allocation, thus a budget breakdown with only two lines make sense in this case. The anticipated cost is broken down into development costs and maintenance costs.\n\nThe team behind this proposal, the founders of dcSpark are a known and respected entity in the Cardano community and ecosystem. I am assured by this fact that if this proposal is funded through Project Catalyst they will deliver this implementation and bring The Graph to Cardano through Milkomeda.", "q1r": 5, "q2": "I would have liked to see a few more quantifiable metrics and development-related KPIs presented in the proposal.\n\nThe definitions of success are very much on point and if the team achieves its goals this could prove to be a very worthwhile allocation of funds from the Cardano Treasury.\n\nA few recommendations to turn this into a better Catalyst proposal in case it needs to be resubmitted:\n- try to describe more exactly, in a clear manner, quantifiable metrics and KPIs that ensure a much easier tracking of the progress made towards implementing this project.\n- consider giving an accurate description of milestones that would help the Project Catalyst community to verify the steps taken towards achieving the goals of this proposal.\n\nI am keenly aware of the fact that submitting Catalyst proposals is a time-consuming endeavor, as besides being a CA I am a proposer myself, however making a few extra steps will make the process better for everyone involved, but most importantly it will increase the chances of this proposal getting funded in case it won't receive funding this round and it will have to be resubmitted.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10018, "q0": "Several Dapp and utility tokens have sprouted in the ETH ecosystem. One of which is TheGraph that offers a valuable utility and has been helps Dapps in ETH efficienlty utilize secure and trusted data. \nMilkomeda is has been takling the bridging between ETH and Cardano and has a succesful testnet program. Soon will also deploy in mainnet mid APR 2022. \nThe team at Milkomeda has identified an area of improvement by bringing the Solidity based Dapp TheGraph into Cardano. \nAs we progress with various DAps in cardano and the ecosystem will require various utilitarian tokens that provide a cross meshing of data easily accessible. This allows for future Daps to be efficient and slender in size. Even facilitating the future developpers to build in the areas they are stronger in. \nSimilar to a large industrial complex that has the many components to thrive. A single manufacturing plant in the desert wont be as efficient. \nThis cross support nature is what CArdano will need to thrive in and build . Milkomeda is proposing to add a new Site within the complex DAPP forest in Cardano. ", "q0r": 5, "q1": "I am a veteran Cardano member and have indepth knowledge on the ongoing projects. I have heard of Milkomeda and their development in creating a bridge between ETH And CArdano. Also heard that it is in testnet and porting to Mainet in a few weeks. \nI would attirbute the lack of visibility of their team and experience in this porposal to the fact that they assume the rest of the comunity is as educated on their progress and cheivement as I am. \nI would consider this over confidence and would expect a thorough description of the team, roadmap and timeline. \nI am airing with confidence that the project will be a success. \nMy recommendation to the team in case the rating and votes do not give justice to this proposal is to revise a new proposal next fund with more granulatiy and details on the team / roadmap / details milestones. Also include mid point KPI's that can be easily tracked. ", "q1r": 3, "q2": "The project to deliver a working TheGraph parallel program running in Cardano is the ultimate goal \nThe team offered progress reports on their webite and github. In addition the tracking of the project can be seen over in testnet and mainet deployemnt \nTo consider this project a success one must validate that the Dapp TheGraph has been ported in Cardano and is well maintained. ", "q2r": 4, "assessor": "z_assessor_785", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10585, "q0": "Consider blockchain as a country or nation state. One way the government can grow the country is through building and maintaining as many infrastructures as possible. Countries with the most advanced and complete infrastructure usually attract more entrepreneurs and talents thus making it more prosperous and enjoy high growth for long time. In this case, we can make an analogy of blockchain as country and developers as entrepreneurs/businessmen/talents. Cardano as a blockchain needs to ensure itself providing enough infrastructures so the community can see many developers are attracted and willing to build in Cardano. This will ensure popular adoption and open endless use-cases, compounding and perpetuating Cardano’s growth. This proposal could serve as a highly profitable investment for the community which will return both tangibly and intangibly on the longer run.", "q0r": 4, "q1": "dcSpark and its team members have proven themselves as a reliable and trusted builder in Cardano ecosystem. I have truly little concern in terms of the capabilities of dcSpark to deliver this proposal. They have successfully deployed the EVM-based Milkomeda sidechain so I highly believe we can see them translating TheGraph protocol as dApp in Cardano, making the available to be used by other Cardano developers. Budget and timeline seems attainable and well within the larger agenda of our ecosystem as a whole. However, I believe not every CAs or voters are familiar to dcSpark and its members’ record of accomplishment. Further information such as links to GitHub or mentioning who is leading the execution of this proposal will help CAs and voters to be more convinced in rating this proposal higher. Also, mentioning a case study or example if the protocol such as or similar to TheGraph have been implemented in other EVM-compatible L1 or L2 blockchains such as Luna, Solana, or Avalanche would boost community confidence in the delivery of this protocol.", "q1r": 5, "q2": "I expect we can see further information and details in this aspect. I would imagine something in the form of survey or market research aimed towards Cardano developers. The survey can describe how interested and willing the developers to see protocol such as TheGraph implemented in Cardano and how it can benefit them in building more dApps thus pushing further adoption and onboarding new users to the blockchain. Alternatively, they can also target existing dApps in our ecosystem and see if they agree with this proposal and the reasoning behind it. They might be able to collaborate and expand the team in this proposal execution and delivery to secure as much utilization as possible. Since no matter how good the proposal is, it will not matter if it does not receive enough vote from the community to be implemented.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We will deploy an instance of TheGraph to Milkomeda which will act as an indexing protocol for querying networks like Milkomeda and IPFS", "experience": "dcSpark is a core contributor to Milkomeda and so we have experience with Ethereum and Solidity. We also contribute to many open-source projects so we are used to looking into external codebases to figure out how they work. TheGraph is available on Github through an MIT license"}