{"id": 400673, "author": "nicoarqueros", "title": "Milkomeda Mobile", "url": "https://cardano.ideascale.com/a/dtd/400673-48088", "category": 26438, "amount": 25000, "description": "Currently there is no way for users to run Cardano smart contracts from a mobile device", "f6_no_assessments": 4, "f6_rating": 3.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7230, "q0": "This is another proposal by the well known company dcSpark which has worked on multiple Cardano projects in the last few years. In this case they propose working on a solution to allow people to use DApps created on Milkomeda (the Cardano sidechain) on their mobile device.\n\nAs the proposers argue, the mobile market is simply huge and it would be a great boost to the Cardano ecosystem (and simply a necessary step for any technology in my opinion) to allow DApps to work on phones. It’s just not possible in my opinion to gain widespread adoption if our apps won’t work on people’s phones.\nThe proposers outlined as an important risk the fact that Google or Apple have not been favorable towards DApps historically and the proposers will have to be extra careful to try and make sure their solution will be accepted. Personally I believe that as we see more and more companies and governments adopt crypto, they will also start allowing the use of DApps in their stores.\nSince this is about expanding the reach of DApps to mobile users, this proposal definitely addresses the challenge effectively. Score: 5.\n", "q0r": 5, "q1": "The proposers have provided a small timeline, forecasting that they will have proof of concept for mobile integration with Milkomeda by the end of Q1, they will start working on the mobile DApp connector in Q2 and they expect to have it ready for release in Q3. Over half a year for this sounds reasonable in my opinion. The 25000 USD budget also seems reasonable, especially since it’s a very low sum for the DApps and Integrations challenge, but I have to ask again, as in other dcSpark proposals, what is the hourly rate of the company? How many people will be working on this proposal? How many hours do you estimate it will take? If anything, the current amount seems low to me for over half a year of work on hard blockchain issues. \nRegarding the team, as mentioned in the beginning, the people behind this proposal are a company called dcSpark which is well known in the Cardano ecosystem. As a recommendation, I think it would be useful to always share a link to your site (https://www.dcspark.io/) so that voters can easily see who you are and maybe to list a few of your achievements, just to make it more convincing. It would also be worthwhile to assign a person of contact for the Catalyst proposal, mention them in the proposal itself and share a social media account, so anyone from the community can reach out and contact them at any time.\nI believe this proposal is likely to be implemented successfully, or at the very least for the research done here to help advance the effort of having mobile Cardano DApps, but as I mentioned above, I think your proposals could be improved a bit on the side of transparency in regards to how the budget is used. Score: 4.", "q1r": 4, "q2": "For Auditability, we are provided with several milestones by which we will know the project is making progress, the first one being easy to verify (being able to access your Milkomeda wallet on a mobile device), but the other 2 are more abstract (define the standard for the solution and then implement it). I think at the very least we should know where the community can verify the last two steps. I assume dcSpark will communicate it on their social media channels? This should be stated explicitly, however.\nAs I also pointed out in other similar proposals, what success looks like is defined in a general manner that’s hard to use as a target. Try to use specific estimations in the future, instead of “many”.\nThese being said, dcSpark is a trustworthy company that knows what it’s doing and I’m sure the community can communicate with them to fill in the gaps and obtain the necessary information for Auditability. Score: 4.", "q2r": 4, "assessor": "z_assessor_546", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7414, "q0": "It is possible to clearly understand the purpose of this proposal by the passage “we intend to allow users to seamlessly use the Milkomeda dApps for Cardano from their mobile device, giving Cardano access to a new user base that will increase adoption and attract more users to the platform”. Unfortunately, the proponents still make the information about these Milkomoeda apps very abstract. What are these Dapps? Since they already adopt Ada, how? Are sales, purchases made? It's games, what exactly do people do with these Dapps? How many? I think the proponents should have provided this basic information to us, we were unable to understand what the works are currently being carried out and that they intend to evolve through this proposal. Due to this lack of explanations, we do not know if the objectives of the challenge will be achieved. We aim to finance Dapps that contribute to the popularization of our blockchain, through the creation of new digital wallets (as the proponents claim would happen), increase in the number of CNFTs minted on the Cardano blockchain, sum of new active members, etc. Anyway, it may even be that these things happen, however it is not very clear how; it would be necessary for us to understand what happens with the use of these Dapps, so that we can understand who the target audience is (the average number of users and their profile); so that we had a good understanding of how this project would benefit Cardano and meet the specific objectives of the challenge. Therefore, due to the lack of general understanding of the proposal, the impact is very low. \n", "q0r": 1, "q1": "We don't have a script here. Proponents give only a cursory idea of ​​the activities that would be done along the way ('We plan to have a mobile integration POC with Milkomeda by the end of Q1 2022 and start work on the dApp connector for mobile devices in early Q2 of 2022 with release in Q3 2022”). But this explanation is very succinct and doesn't specify well the tasks that will be done so that, for example, the integration is done, the connector is created and the public release is possible. Ideally, proposers would draw a timeline, in which they would explain a) what would be done b) when it would be done - that is, the month, or even the weeks c) who would do it d) how it would be done. If we had such information, we would be able to understand exactly how the development process of this project would take place, which does not happen. Now talking about the $25,000 funding request, once again the proponents don't say how that part would be managed. How would the total amount be divided? It is said that “it will be used in the R&D effort for developers to create how to use Milkomeda dApps from a mobile device and then program the implementation”, however, this explanation is not only too short but too technical. The proposal's readers would probably not understand well what the proposers mean by this - I include myself in this portion, I'm not from the Dapps development area, it was very inaccessible to me what would be done after all. We would need to understand where this money would go, of course I think it would be used in the salaries of the professionals involved, but we don't know, for example, how much each one would receive per month and how many hours they would dedicate to this project, so we have no way of concluding if the amount requested is fair or abusive. Finally, speaking of the team itself, once again the necessary information is unfortunately lacking. We don't know who the professionals are who would work here, nor their names, their resumes and examples of previous projects (the Milkomoeda Dapps themselves should have been explained); with this, it is not possible to understand if they have the technical preparation for this project. Therefore, I think that all the topics (script, team and budget) that are cited here are inappropriate, all deserving more explanation and detail. \n", "q1r": 1, "q2": "Proponents claim that progress can be measured from the 3-step analysis: “be able to access your Milkomeda wallet on mobile, define the standard we will use to connect to the dApps and implement the standard”. However, again the information given is very superficial, we don't understand exactly how these analyzes would be done from each part of the project as a whole; it is also unclear how this information would reach members of the Cardano community. In my view, to improve this, the roadmap should be better detailed, from which monthly reports should be generated that identify whether the activities planned for each period of time were fulfilled, if partial results were achieved, etc.; and all this should be made available in a simple and direct way to all members of the Cardano ecosystem. The explanation of the auditability of the final results is also insufficient, we only know that the ultimate goal is for many people to start adopting Cardano through Dapps on their mobile devices, but this goal is already clear from the impact. There would need to be several smaller goals, measurable data, that would allow our community members to understand if this was achieved and how. How can we tell if new members have been added to our community, if they are active, and if so, what do they do? It would be essential for proponents to carry out such a study, it could be an analysis of the number of downloads of Dapps created, a study of how users would be relating to Cardano's technologies present there, if really new wallets were created, the purchase and Ada augmented and etc. Therefore, I think that the proposal is not auditable, the proposers do not provide good information on how we could perceive success, nor do they inform by which means of communication (telegram groups, discord, Town Hall and etc) this data would be shared with all of us. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7734, "q0": "This idea is great! Creating a way for users dApps with mobile device (smartphone) will have a huge impact for Cardano's network because users don't have to bother opening their laptops just to make simple transactions. Therefore, a risks that proposer foresee is inevitable. As we still needs Google's and/or Apple's help, we can not simply create dApps then Cardano's wallet being banned for not following their guide (although in other chain like BSC, Polygon, etc can use VPN to avoiding the rules). Hope the proposer find a way to solve this risks.", "q0r": 5, "q1": "While I know Milkomeda & dcSpark are the active contributors in Cardano Ecosystem, I think proposer need to adding some links in this proposal for newbie CAs to check their credentials. Also, budgets just explained as R&D cost for developers with no more explanation about it. I suggest give some hourly rate, so community can decide if it's a reasonable budgets or not.", "q1r": 3, "q2": "The success metric for this proposal is simple: whether the team can implement their dapps through mobile device or not. If the risks proposer mentioned in Impact column (Google's & Apple's rule) hindered this project, what plan B will proposer do? Anyway, their progress can be measure with only 3 steps. But I think proposer should write some timeline to their steps. Example: Step 1: Being able to access your Milkomeda wallet on Mobile will done in Q3 2022, etc... That would make us (readers) understand will you do after get a funding.", "q2r": 3, "assessor": "z_assessor_639", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8609, "q0": "Unfortunately at the moment, the mobile market is underserved by the Cardano ecosystem. This is especially problematic since there are more and more Internet users in general, and crypto users specifically, that are mobile-only. \n\nThat's why I see this as being a potentially very impactful proposal for the Cardano ecosystem.\n\nThe potential impact of this proposal is further amplified by the fact that the team behind it has a very successful proven track record in the Cardano community and ecosystem, and has already developed a desktop wallet with a dapp connector that works great. I can attest to this as I have personally used it on several occasions.\n\nBringing the full functionality of Cardano to mobile is especially important since in a lot of the underprivileged areas of the world, areas that Cardano intends to serve, mobile-only is the default.", "q0r": 5, "q1": "The implementation plan is very straightforward and possibly a bit too sparse I would have definitely liked to see a bit more detail. The team expects to launch the initial version of the product by Q3 2022.\n\nAs per the proposal, the team intends to allocate the entire requested budget of $25,000 on R&D. My suggestion is that in the future the team includes more details on how they plan to allocate the budget and what activities specifically they plan to conduct during the R&D stage.\n\nThe founders of dcSpark have an excellent and proven history in the Cardano community and ecosystem, as such I have very little doubt that if they are funded they will deliver on the scope of this proposal and implement a mobile wallet with a dapp connector, barring unforeseen complications from the owners of the mobile platforms (which they successfully identified as risks). The company has also grown very rapidly since it was founded and now claims to have over 40 employees. Consequently, they should be able to take on multiple projects simultaneously (especially since they have Catalyst proposals for a large number of projects in multiple challenges).", "q1r": 4, "q2": "The team presents a clear set of KPIs that they plan to measure during the development of the project. This should also give a very good idea of the progress towards the deliverables of the proposal and make it easy for the Catalyst auditing team to track its progress and release subsequent funds.\n\nThe team behind this proposal are already recipients of multiple Catalyst grants in multiple funding rounds, as such, they should be already familiar with the reporting requirements of Project Catalyst.\n\nThe definition of success is very easy to track in the case of this project, that being the increase in the number of mobile users of Cardano, which will hopefully mean an increase in the number of users of the blockchain overall.", "q2r": 5, "assessor": "z_assessor_681", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "We want to allow users to use Milkomeda smart contracts from their mobile device", "experience": "dcSpark is one of the core contributors to the Milkomeda project and we also have experience writing wallets such as Flint Wallet. Additionally, we have experience writing new dApp connection standards as we are co-authors of the Cardano dApp connector specification"}