{"id": 400723, "author": "gondlr", "title": "Aeros - Airmiles Wallet integration", "url": "https://cardano.ideascale.com/a/dtd/400723-48088", "category": 26438, "amount": 70000, "description": "Airmiles is the biggest currency in the world, 10 Trillion outstanding miles. Miles depreciate over time, are difficult to track and redeem.", "f6_no_assessments": 6, "f6_rating": 4.055555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "The proponent wants to launch its Eros coin on the Cardano blockchain, as this proponent form he predicts that its adoption will be maximized. However, he himself says he doesn't understand very well how our ecosystem works, so it's not clear how this process would be done. A little more study would be needed before this proposal could be launched, in my view, as it is not clear what in practice would be developed for this reality to become. It will also be clear that the goals of the challenge will not be as clear as the goals of the challenge, how will they also become popular in relation (between Eros and Cardano) our blockchain? That current users will learn to deal with Cardano technologies, and maybe users can learn to other world technologies - NFTs, how to buy Ada in pool - NFTs, etc.? I don't think things are well explained here, so I suggest that the revised proposal, that the proposer explains better how this sum will generate positive fruits for Cardano and how the specific objectives of the challenge can be contemplated with the funding proposal. \n", "q0r": 1, "q1": "We have a very well-defined roadmap here. We know exactly what would happen according to a certain passage of time, according to the months: various activities are described, so we have a very specific view of the process. I think the roadmap is already great, but if I were to suggest any improvement, I would say that these months could be broken down into weeks, so that we know what tasks would be performed in each of them. This would give us an even deeper understanding of what's to come, but it's just a suggestion, because the way it's presented to us, the action schedule is already great. The budget is also explained in a very detailed way, although at this point I think some information was missing. For example, in marketing, you would be charged a monthly fee of 3500 dollars. We know who would work here (a graphic designer) and what he would do, but we don't know how many hours per week he would dedicate to this project. Therefore, it is not possible to have such a complete understanding of whether the requested money is fair, because it would vary greatly according to the hours of work that would be done. I would like these details to be added. Finally, speaking of the team, we know the names of everyone involved, as well as their resumes (well summarized, in my opinion this part should be more extensive), previous experiences and their linkedin profiles. In this way, we can verify the information that was said. I think the problem with the team is that we don't have any experts in Cardano, so there is no confidence in the preparation of this team to deal with our blockchain technologies. I would like to know if they will get in touch with Cardano developers, for example, in order to resolve this issue. In short, most of the feasibility is good, but we still have some things that should be improved. \n", "q1r": 4, "q2": "According to the proponent, progress could be measured on three platforms: Dashboard, Sprints Plan and Backlog. It is not so clear to me what content from the sprints would be posted and how the Cardano community would have access to it, however, we cannot say that the author does not care about drawing a solid bridge between his project and the members of the Cardano community. However, some doubts came to my mind: how often would these updates be made? I believe it is necessary for the proponent to better detail what will be done so that we can monitor the day-to-day construction of the project, which includes monitoring the work routine of all the professionals involved as well as the partial goals achieved. These updates should be at least monthly, in my view. Regarding the final results, success would come with (Aeros) “Becoming the first Airmile token in the world to be integrated with many airlines and loyalty programs”. However, it is necessary, as I mentioned in the impact, that the consequences of this for the Cardano ecosystem are better explained. After the proposer has carried out these analyses, he must provide this information in a precise and easy way to the Cardano community, which could be done by preparing a final report or even the participation of the author of the proposal in Town Hall, for example. I think that auditability is neither good nor bad, as it only superficially informs us of what should be monitored, requiring a real depth and detail, especially regarding the measurable consequences for Cardano. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal in question aims to create a token that somehow unifies the use of air miles. We know that, in fact, there are many mileage programs on the market, and that the value of these miles tends to drop over time, decreasing the purchasing power of those who have them. There are also other problems inherent in this, such as the fees for converting miles between loyalty programs or even their expiry date. With this we can see that the Eros project aims to solve a real pain and with a large potential audience (in an increasingly globalized world), using Cardano in this process. With that, the prosta is adequate in relation to the goals of the challenge, and in addition, its success promotes visibility among several customers of several airlines that often may not even know about blockchain technology. We realize that the budget being requested of $70,000 is quite considerable, but given the team involved in the project and the plan laid out, it seems reasonable. We see that this is a project with great potential, but also quite ambitious, one of the doubts that arise is in relation to the integrations that need to be made with partnership programs for it to be successful, as well as whether there will be a large adoption by the public.", "q0r": 4, "q1": "Regarding the plan outlined for the team to achieve the expected result, we noticed a good degree of detail and organization of the steps that will be carried out. As it is a project closely related to development, it is interesting to see that the team structured the actions in sprints, one of the most used methods for organizing development projects, and we also see that each of these is geared towards a particular case of use. Regarding the activities that will be carried out over the months, we see that they follow a good logical chain, starting with simpler actions such as initial planning and definitions, and these actions gradually evolve until integrations are carried out and finally the MVP test. We note that the budget breakdown is well organized, with allocations consistent with the work to be carried out, and we see that no expense seems to be too high. It is also interesting to note that in the project team there are professionals dedicated not only to development, but also to other areas important to the success of the project such as graphic design, UI/UX, marketing and communication. Additionally, we noticed that the professionals involved in the project made their CVs available so that their experiences could be verified. However, it is necessary to mention that on the LinkedIn of Gonzalo de Los Rios we were not able to find the experiences mentioned, and it would be interesting if they were confirmed, as they are related to the redemption of miles in well-known airlines, a point of great interest for the project in question. . Additively, given all the scope that the project aims to achieve, even this stage being aimed at only one MVP, it would be interesting if a direction was given on how this platform can be initially tested. In this context, partner airlines could be indicated to carry out a pilot project, a specific airport where the project could be publicized and possible stores to establish partnerships (which would accept tokens as payment for products).", "q1r": 4, "q2": "The ways indicated for the project to be monitored are quite complete and consistent with the ideas presented during the feasibility plan, it is also interesting to see that the team put together an organized plan, including categorizing the use cases. A practice that is always good in terms of auditability is to provide ways for the evolution of results to be easily traceable, we noticed that this happens here with the backlogs and also with the Dashboard that demonstrates different moments of production. Furthermore, the team's perception of success seems quite correct in relation to what is planned to be delivered at this point in the proposal, which is generally an MVP with some certain complete functions.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "To be completely clear, this one is the proposal with the most amount of impact, possibly adding LOTS of new users to Cardano. Could be game changing for Cardano and for the Blockchain space as a whole. The proposal sees a good problem and an awesome solution, cant get enough. The proposal does in fact address the challenge objectives and could cause a great impact. About the challenge, if its  information you are looking for I would recommend making partnerships in the Catalyst Townhalls, lots of talented people in there.", "q0r": 5, "q1": "Timelines are well explained and thought out, the proposer provides an efficient work method and clear timeline for it. The team seems highly qualified and will no doubt be able to manage a project like this, also provided evidence to prove it. Budget makes sense and its clearly broken down.", "q1r": 5, "q2": "Dashboard mechanic will be a great way for the community to audit the whole process. Expectations are great but in order to improve the proposal you could add some outcome KPIs, for example, number of users by month x, or Monthly transaction volume by month x. This will give more information to the voter on what they could expect from the project in the future.", "q2r": 5, "assessor": "z_assessor_1190", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is coming from Aeros, a startup currently brewing under the umbrella of a UC Berkeley program. Aeros positions itself as a currency for travel / air miles / hotel points / loyalty programs. Their value proposition is to create Aeros as a native token to run on the Cardano mainnet as a unified token for loyalty programs. \n\nI think this is an excellent value proposal with very good scalability opportunities if Aeros becomes a success. Having its token native on Cardano would be excellent for Cardano’s visibility and an inspiration for potential future uses. 5 stars for potential impact. ", "q0r": 5, "q1": "There seems to be an excellent team behind the project, and they have made a good job at bringing transparency to their almost 10 people team. The project would take 5 months to complete, and is roughly split in a few phases. In terms of budget again they have sketched it, and I can definitely sense that the team would definitely benefit in the future from increasing its capacity of coming up with more granular proposals that include more details on the actual tasks and perhaps a better approximation of costs / hours which now are very “guesstimated” but i’m not saying this in a negative way. \n\nTheir existing website unfortunately offers no information into their progress and it’s hard to gauge their track record so far in terms of bringing an actual product to the market. Given all the above I offer the proposal 4 stars in terms of feasibility. ", "q1r": 4, "q2": "The team promises to document their work in a live public document where all the number of hours spent are accounted for, but there is no other indication of how / when they intend to interact with the Cardano community in order to bring comfort into the progress of their project, if funded. I offer indulgently 4 stars hoping that if the project does indeed get funding the team behind can take inspiration from best practices around previous Catalyst projects and do an excellent job at being transparent towards the community. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal has a clear problem statement and problem solution. The solution is well aligned with the challenge (Dapps and integrations) and can address the following challenge questions:\n\"What are the key applications that underpin the application ecosystem on other platforms?\nWhat are the most profitable or most used applications on other ecosystems?\nWhat needs do users of Cardano have that could be solved by new applications?\nWhat applications deliver the highest amount of value with the least amount of technical sophistication?\"\nI believe this proposal could have a large impact on the Cardano ecosystem, although I would like more clarity on how exactly this integration will work, and if Aeros users will be able to directly exchange their air miles or Aeros tokens for Ada.  I would also suggest to the team that this proposal would have a greater impact on Cardano and likelihood of receiving funding if there was a more clear marketing strategy to insure that all users of Aeros platform are aware they are using the Cardano blockchain. The target audience is also obviously a highly sought after market segment, and spreading the word about Cardano to all of these frequent flyers would provide significant value to ada holders, however, this idea of is absent from the proposal. I believe there is potential for a high impact on Cardano with this proposal, but a detailed explanation for how this brings value to Ada holders would be a big improvement on this proposal. ", "q0r": 5, "q1": "I have rated this proposal 3 stars for feasibility, because the proposing team acknowledges \"I think technology can be challenging since we don't understand yet how the Cardano system works but looks like tokenization of Aeros will not be a big issue.\" This sentence is concerning to me, and It's not clear if the ideal scenario for Ada holders will be realized if this is funded. I think there is significant risk this could be funded, and then the team may decide not to continue with Cardano for this implementation. Additionally, the wording of the proposal leads me to believe they plan to use their existing \"technology team\" who do not appear to have any relevant experience with Cardano specifically, however; they are highly experienced professionals. I believe this team would have a higher chance of success by hiring experienced Cardano developers, as opposed to training their existing team how to develop this on Cardano. The proposal does include a clearly itemized timeline and has broken down the budget. ", "q1r": 3, "q2": "The Auditability section of this proposal includes a clear description of what the end goal is, and what success would look like. However, it is not clear how the cardano community would track ongoing development progress. There is mention of sprints and dashboards that would allow the proposing team to track progress internally, however there is no mention of reporting to the Cardano community. It appears likely that this project could run past the timeline, or overbudget, and may require additional funding from Catalyst. If this were the case it would be difficult to assess if the original $70,000 was well managed without detailed progress reports. ", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Tokenization of Airmiles certainly has the potential to expose a lot of new people to blockchain, who otherwise might not come in contact with the technology and legitimize it in their eyes. If this can be done on Cardano it could certainly have a great impact on user onboarding and adoption, resulting not only from this particular application but also from the exposure it would bring.\nThe proposal makes a very good overview presentation of what could be the use cases of such tokenised Airmiles.\n\nI have deducted one point however because I feel the risks category is insufficiently addressed. Would recommend that the proposers dedicate more time to trying to figure out how they would overcome the technological obstacle they have identified and presenting a clear path of how the would incorporate the Cardano tech stack into their workflow.\n\nI would suggest expanding and improving this section before a potential resubmission.", "q0r": 4, "q1": "The roadmap is detailed and gives a good overview of the next steps for the project. Demonstrating a clear understanding of the steps the Aeros team would need to take in order to implement the project.\n\nThe budget breakdown seems robust and described very well how the requested funds will be allocated in, it also seems reasonable given the team's location which seems to be Argentina based on the info in their LinkedIn profiles, except for one line. The budgeted amounts seem quite small for blockchain development. Actual market rates for Haskell/Plutus developers are considerably higher at the moment and no explanation is given of why this is in the proposal, ie. location, or internal retraining within the company. I have subtracted a point for this omission.\n\nThere is already a team of 8 people involved in the Aeros project. All of the credentials are very well presented in the proposal and after checking their LinkedIn profiles I can say with a pretty high degree of confidence that the team should be able to deliver on the project.", "q1r": 4, "q2": "The auditability section describes how the team will track the project internally, and they do a very good job of that. This is a great first step but what I would have liked to see more is a presentation of how those internal metrics will be subsequently relayed to the Catalyst auditing teams for easy verification. I would also recommend the inclusion of KPIs and metrics with specific values that are easy to track and report on.\n\nThe definitions of success are very well described and relate to the development of the specific project presented in the proposal.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Aeros is a mobile wallet that allows members to Earn and Redeem Aeros currency that can be converted to miles or used as a payment method.", "experience": "We have been working with airlines for many years, United Airlines, Avianca, British Airways. We have developed a solution for end-users to accumulate a universal currency (Aeros) that can be connected to many loyalty programs. Our background is in Economics and fintech products."}