{"id": 400771, "author": "robertc3", "title": "Oracle Developer Portal", "url": "https://cardano.ideascale.com/a/dtd/400771-48088", "category": 26438, "amount": 195000, "description": "DApps using off-chain data feeds can provide a richer end-user experience. There is no easy way to consume off-chain data feeds on Cardano.", "f6_no_assessments": 6, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Enabling a sdk for a Cardano Oracle is a huge step for dApp integrations, enabling oracle calls for smart contracts.  This will help to make dApps more integratable with data that is located off-chain and will impact any dApp that will require the sort of information that an oracle could provide.", "q0r": 5, "q1": "the charli3 team is a well-known entity within the Cardano ecosystem and has been slowly developing their oracle solution for many months now.  Their team is over 15+ people and have sufficient knowledge and expertise in both oracles and the Cardano blockchain to help develop the sdk kit to their oracle as planned.  They also have a high level roadmap included of a phased approach to their solution.", "q1r": 5, "q2": "The roadmap provided provides a very detailed plan on how they are planning on developing the solution, where time and resources are going to spent and where deliverables should come in the schedule.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "There is definitely a need for a secure oracle protocol in the Cardano ecosystem. With the Charli3 team working on becoming a provider of information to many projects being built on Cardano, they have a lot to get done. There is clearly a challenge that needs a solution. Creating this developer portal will likely benefit the community so that people can go to the portal and find all the information needed in one place. ", "q0r": 4, "q1": "This project will very likely be implemented successfully due to the nature of the C3 team. They have been able to prove themselves with their developments and they gave a great amount of detail in their proposal. After looking into the LinkedIn profiles that were provided in this proposal, I see very bright things coming from this cause. ", "q1r": 4, "q2": "The information provided was very well written and concise. They had a lot to break down and I was able to understand how this project will benefit the community. They have a great description on the roadmap of this idea and they gave a great breakdown of where the funds will be going. This will be something that could impact the ecosystem greatly.", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "As far as proposals go, this one is carefully thought out. I love the way that you mapped out each step, with sub-sections that broke down your goals or numbers even further. This proposal actually addresses multiple challenges in the Fund 8 challenges. Open source development ecosystem, Developer ecosystem, and Dapps and Intergrations! I feel that the treasury's ADA will be well stewarded by Charli3 and the team.", "q0r": 5, "q1": "The fact that Charli3 is willing to expand the team, and communicates their timeline and hours spent even at this early stage gives me great confidence that that they will achieve their goals set for building an Oracle Developer portal. The team has a long track record of successful execution of their stated plans. Having an easy to access resource to quickly build in high-end UI additions will help our ecosystem greatly.", "q1r": 5, "q2": "As I stated above, the Charli3 team took a lot of time laying out exactly the how and where and why to what they are doing. Seeing this time dedication shows me that they are ready and willing to be held accountable to the community and show the progress every step of the way. They have clearly defined goals for a problem that is very complex. Charli3 has self-set metrics and levels that they are hoping to achieve, and with that I believe catalyst funds will be well placed in their hands.", "q2r": 5, "assessor": "z_assessor_1548", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "Well worth the MASSIVE price tag. While I was prepared to score low just based on the price tag, the proposal makes a bunch of strong points about the greater benefit to the entire Cardano ecosystem. With the variety of problems that this proposal addresses, I feel that this tool could be its own separate project that would see strong success. The educational portion of the proposal has great potential to improve user experiences for Cardano Dapps all across the ecosystem by addressing some of the knowledge gaps that might exist between developers and the use of oracles. This feature alone has the capability to encourage greater innovation among Dapps on Cardano, greater adoption for new and migrating projects, and smooth onboarding for faster development. ", "q0r": 5, "q1": "If you can find me another more detailed and cohesive roadmap than this one, we can just give them $200k. The level of detail provided for every micro-step of this proposal tells me that they know exactly what needs to be done to make this happen. They have the feasibility planned down to every step, with a calculated plan for every dollar, and a role for every member of the Charli3 team to play. This proposal makes it extremely clear that they have the talent and experience to complete this project with ease and they demonstrate that each dollar is being spent very efficiently and reasonably. Even though most of us know who these people are already, they STILL make sure to include LinkedIns and websites to ensure full transparency and ease of access for information. It's this level of integrity and thorough thought that proves that they will be successful in producing a functional product (that will also be well known to developers). ", "q1r": 5, "q2": "Charli3 completely opens themself up to public accountability. They plan to provide monthly updates, public demonstrations of their work (via the website, GitHub, and socials), and all with detailed information on timeline progress and budget efficiency. I appreciate that their KPIs are not based on what gets completed because that shows me that they know that they can complete the functional product. Success, for them, is measured by how many developers actually use the product to carry that value onto their own projects. They even produce a meter for themselves of what levels of success they would like to see accomplished based on the real-world impact on the Cardano ecosystem. This is the best audibility section I've seen on any Catalyst proposal. ", "q2r": 5, "assessor": "z_assessor_1896", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is created by charli3 - a well known oracle in the cardano community. An oracle is an important part of  the defi ecosystem as it provides dapps with off chain data. These data feeds can be real time prices of the stock markets or data from the weather etc. That said, the proposers want to build a portal that will help dapps integrate the oracle data. Long story short, they want to make the process of using their services as smooth as possible for the dapp by providing an SDK and documentation. I think that charli3 can be a fundamental part of the cardano defi ecosystem because they are one the first oracles built with haskell. However one of the problems they are facing is that their token is a ERC20 token which lives in the Ethereum network. Once an erc20 converter will be available, they should be able to convert the token to CNT. That said, I think that they have explained very well the purpose of this proposal and all the benefits that it will provide to the cardano developers and to the cardano ecosystem as well. Needless to say that the proposal is in the scope of this challenge and its goal aligns with the challenge setting.\n", "q0r": 5, "q1": "I have high confidence in the successful implementation of this challenge. The proposers have provided all the information on the team which will be composed of their development team and contractors that they will hire according to the proposal. One of the most important parts of a proposal is the budget. The budget is broken down and the allocation of the funds is  explained. However I recommend to the team to be more precise by adding the rates and the profiles they intend to use. Other than that, I think that the proposers have done a great job adding a detailed roadmap that is divided by 3 phases which should lead to deployment of the feed portal and fee estimator on mainet. Altogether, I think that the project can be successfully implemented by the team based on their experience.\n", "q1r": 5, "q2": "I think that this team has done a great job writing this proposal because they have included as much information as possible . The roadmap is detailed really well and contains milestones until mainet. Furthermore, they have provided the KPIs that will help track the progress of the project. I recommend to the proposers to add github commits and monthly development reports as it will help the community get up to date on the progress of the project. Other than that I expect good things from this team and I hope they will deliver great results for the cardano community.\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Following Cardano's initiation to smart contracts in 2021 the new Dapps and utility of cardano has grown. Since we are in the very early stages of SC and Dapps, the first step was to involve internal contracts related to token exchange in DEFI. \nThe next maturity growth for SC and DApps is to start relating to the outside world and other blockchains with the usage of Bridge and more importantly  Data Oracles. \nCharli3 has been working steadily in this field since mid 2021 and had the vision to start working while the SC cardano ecosystem was just booting up. \nNow the need to for eternal Data feeds and Oracles will be the next building block needed for the Cardano DApps and SC growth. \nThe impact of this proposal will allow CArdano to offer trusted data feeds and expand their utility with more creative applications. \nUltimately the Charlie3 and project owner wants to inform and provide the node program for other members to run their decentralized Oracle feed and allow the tokenomics to rewards or slash the participants and node operators. This can bring great competition and techincal teams from other ecosystems into Cardano.  ", "q0r": 5, "q1": "The Charli3 Is has received from IOHK a security level 2 audit clearance and support from the Plutus program. Their team and tehcnical knowledge is a solid base to lead this project to success. \nThere are a multitude of risks related to this project and the proposer have worked in great deal to illustrate, put thought on how to overcome the risks while being transparent with the community. \nThe main risks as this Oracle deployment will be the first in cardano and the fast changes / upgrades of the cardano chain and SC PABs. There might need to be some recoding involved. The team has factored in safety margins to quickly adapt and build compartmentalized code that can be switched out in case of new revisions needed. \n\nThe plan for this proposal is for 15-20 weeks and broken down in 3 phases that increase in comlpexity and time as the phases progress. Initially a quick 1 week phase will evalute the basic prject scope and start the team building. Following by the indept coding and setting up. To finish with the mainnet and testing in parallel onboardind the node operator. \n\nThe team also identified the difficulty for the first few node operators onboarding and have installed a tokenomics reward/slashing system that will incite people to participate. \n\nThe funds are mostly spent on manhours between senior and junior programer. following by marketing and UI specilists. They have also taken into account some video making and editing. \nOverall the team is well balanced and have a solid history to succeed and interact with IOHK", "q1r": 5, "q2": "The team at Charlie3 has received funding in the past from Catalyst and participated in joint collaboration with IOHK in the past. Therefore they are well versed and aware of the reporting and auditing requirements. \nThey have listed the key KPIs for each phase and committed to provide updated on the website/twitter/telegram social media outlets they have. In addition the node program and other relating DApps will be listed in Github for review. \nThe resources spent and budget will follow closely the plan initiated, keeping in mind the various risks they have listed that have contingencies to over come them. \nThe success of this project also relies onthe support of Catalyst/ IOHK and security auditors that will further pad the project accomplishment. ", "q2r": 5, "assessor": "z_assessor_785", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a website with both a dev portal and a node/feed portal to easily access information, test, and integrate off-chain data feeds.", "experience": "The Charli3.io team has been actively developing an Oracle ecosystem since May 2021. Our MVP successfully passed the IOHK audit program receiving a level 2 certification by CertiK. The team consists of 18 people, including a partnership with a haskell lab. https://charli3.io/team"}