{"id": 400810, "author": "rg.admin", "title": "Research Guild: DApp Snapshot", "url": "https://cardano.ideascale.com/a/dtd/400810-48088", "category": 26438, "amount": 34200, "description": "Cardano values academic rigor; however, the Catalyst community lacks coordinated market research that collates DApp development forecasts.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7417, "q0": "I found the idea to be very important, it is about establishing a group of workers who will meet with the aim of researching opportunities and features of Dapps to be developed in Cardano. The Research Guild group, according to the proponents, is focused on understanding how the market is currently and what the development forecasts for Cardano in 2022 are. that I understand) for the Cardano ecosystem. In fact, one of the obstacles in developing projects with our blockchain is the lack of solid understanding of the market situation and how Cardano can be differentiated from other blockchains; In other words, I think that having research that makes it clear and proven how to proceed in these situations will be extremely useful for Cardano and will certainly develop for a future that is more conducive to the development of quality Dapps that generate returns for our blockchain. Proponents also mention that a consultancy service could be provided in private homes, that is, groups that intend to propose on Catalyst or even those that are already funded but need help regarding the paths they will take in their work. I found this idea really very positive, fitting for sure with the objectives of the challenge. We want to somehow popularize Cardano, exponentially increase the adoption of our blockchain; this can be seen by the number of Dapps created, active community members added, amount of Ada and CNFT being acquired and traded... I think all these small goals will be achieved if this project succeeds, once with the best guidance (promoted through these surveys), Dapps projects will certainly improve quality; this quality will generate results, such as greater investment and adoption of our blockchain, which is still in the process of expansion. The proponents, throughout the impact, explain in detail how this project would be constituted, by which parts and what each one of them will generate for the total process, demonstrating a lot of mastery and clarity about the entire extension of the project and making its characteristics understood by the proposal readers. For these reasons, I believe that this proposal deserves the maximum score in impact, its premise is extremely useful for Cardano and it can achieve the specific objectives of this challenge. \n", "q0r": 5, "q1": "Regarding the roadmap, I think the information that is given is extremely rich and explains in an extensive and detailed way what would happen during the project development process. One observation I would like to make is: it would be a little simpler if the bidders had split the time more explicitly. They are concerned with placing the readers of the proposal on which parts will compose the project and which activities would be necessary for each phase (I will comment more on this shortly). Now, talking about the temporal notion, we are told first that the “start of the project” would be in “May (Q2 2022)”, and then that “it is estimated that a DApp Snapshot (20 page executive report) will take three months (full-time) to complete: starting in May (Q2 2022) and concluding in August (Q3 2022).” From my point of view, if the proponents had organized the script into months and within these spaces they had divided the explanations about the activities, the visualization of the process linearly would be simpler. Speaking now of the activities explained, in fact this part is perfect, we know that they would be divided into two main groups: “the construction of the Research Guild (20% of the treasury)” and the “custom guild reports (80% of the treasury) ”. Each of them is explained with extreme care, so that we have full understanding of what would be done and how. The requested budget of 34,200 dollars, in my opinion, is a very fair value for the dimension and complexity of this proposal, I think it will really generate great results for Cardano and deserves this funding. The explanations about the money are extremely satisfactory (congratulations to this team!); We know that you will be charged a base fee ($32.74 per hour), a researcher fee ($75.00 per hour), and a research assistant fee ($40.00 per hour). Despite not being a conventional currency division, I found it totally satisfying in terms of making us understand how the money will be used. Finally, speaking of the team members, we know that they are 3 professionals: Troy Egan, Mina Cu and Séverin Bonnet. Total confidence in the trio is conveyed, as we know their professional attributions (levels of education and current area), a small curriculum and also links to pages such as linkedin, where we can see in practice what they have done so far and we have proof as well as the information provided. In summary, the auditability of the project is very high. \n", "q1r": 5, "q2": "Progress measurement is impeccable, proponents state three ways in which this project will be monitored during its development process, these being the establishment of a set of KPIs; involvement with internal peer review processes to assess project deliverables and also involvement with a Catalyst community consultant review and audit. They state what the variable KPIs would be, in the part of “researcher identification and dissemination + researcher integration + management and support for research projects (...)”; and also the fixed KPIs on “creating bespoke research projects targeting Project Catalyst campaigns + creating custom research projects for Project Catalyst proponent collaborations + identifying guild members for research reports and peer review (.. .)”. They also tell you what the reporting objectives would be. That is, all the ways in which the project can be measured, analyzed and reformulated are explained, making it very clear to the Cardano Community what should be aimed at during the progress of the project phases. Turning now to the final results, they explain more comprehensively what would have to be achieved (without setting enumerated objectives, for example); but we are also told exactly what to expect, my suggestion here would be that the Cardano community could have a direct dialogue with the project team through some participation in Town Hall, or even after that; in it, proponents could make an overview of everything that was done and what direct impacts were observed in the development of Dapps projects, and how this, organically, contributed to the popularization of Cardano. I think that just like the other topics, the auditability is very accurate and gives us all the information we need safely. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 777, "q0": "There is no denying that researching what Dapps or Dapp ecosystems that the market needs and aggregating the voice of the community is important in building viable applications. However, this proposal seems a bit out of place in this challenge as it goes away from the potential avenues the challenge team presented. But even though this proposal might not deliver an application or integration, what it offers is necessary pave the way for the development of better apps in future funding rounds.", "q0r": 3, "q1": "Most of the team consists of researchers and Ph.D. candidates who might not be at all new to research. The team also seems to have some experience in research from the citations they provided (except from one of the three who doesn't have references or links.) The timeline seems to be well though out, the project breakdown is clear. A 'Dapp Snapshot' - a 20 page report - is the main deliverable after a three month period. The team seems to have a clear vision of what it takes and how long each part of the project will take.", "q1r": 4, "q2": "The team has listed clear goals to be achieved throughout the timeline of the project which will make audibility easier. The KPIs are detailed and clear and appear well thought out. The deliverable is a 20 page report at the end of a three month period concluding around August 2022 and the quality of the research as well as whether or not the detailed set of goals (listed in the proposal) have been met should be quantify the success of the project. On the other hand, closely following the project's progress might be difficult as the team is relatively new and no social media has been listed on their proposal for this reason. ", "q2r": 4, "assessor": "z_assessor_1211", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2147, "q0": "NOTE for VCAs and voters: The Research Guild is a network that has launched 6 proposals during this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider Research Guild framework. My assessment takes into account aspects common across all proposals (the network’s organizational aspects, competency, research approach, workload, or similar reporting mechanisms and budget logic). You shall therefore find common parts across these proposals and parts specific to each proposal.\n\nKey takeaway: fair problem identification, good alignment with the challenge, fair to good potential for added value for Cardano if the report is shared with the community and thoroughly digested by future proposers in a very timely manner. \n\nThis proposal aims to deliver a report that targets DApp trends and solutions across blockchains, with key research insights and recommendations that can be implemented by the community immediately, or pursued through future Project Catalyst funding proposals. With the rapidly changing Dapps ecosystem, I am not convinced whether an academic approach would bring value to the community, since the benefits of academic rigor will have to be measured also against the long research times which might render any practical applications untimely / too late to be of use. ", "q0r": 4, "q1": "Key takeaway: A solid academic-oriented team behind the proposal, a clear plan and recruitment process for the actual researchers and a reasonable timeline for completion - with the added question that perhaps there is an added sense of urgency with regards to Dapps development. \n\nThe plan. The core team consists of 3 PhD / PhD candidates from Auckland University, Renmin University respectively University of Osnabrück, all currently undergoing blockchain-oriented activities. They would NOT conduct the research themselves, but instead they would extend invitations to their networks of academic and professional colleagues to participate in the actual research. Perhaps the standout of the team is the wide-net that they can cast within their own respective networks when searching for viable research candidates. They would subsequently undergo a recruitment / selection process based on received resumes / review of academic work published / blockchain experience. The actual work itself would be undertaken by this collective of independent researchers onboarded as above. \n\nBudget talk. 20% of the budget would go towards building the research network (research identification, outreach, project management, support, designing reporting templates, etc.). 80% of the budget would go to creating tailored research projects following a loosely based pathway which makes sense considering the knowledge-building capacity of the project. Payment for individual researchers would follow a determined base hourly rate, based on the average of online surveys already undertaken. There are extensive figures offered in the proposal, but the key figure to remember is the overall base pay of USD 32/hour and US 60/hour for highly specialized work.\n\nThe team estimates that the report will take four months to complete: from May 2022 until August 2022. There is a detailed project roadmap outlined in the proposal, with great granularity down to weeks necessary for each intermediary step.", "q1r": 4, "q2": "Key takeaway: very clear roadmap and extensive KPI list, great verification potential and clear communication channels for work undertaken.\n\nThis work will be delivered in the form of a public report with key research insights and recommendations that can be implemented by the community immediately, or pursued through future Project Catalyst funding proposals.\n\nThe project team will approach auditability in three ways: (1) establishing a set of project indicators, (2) engaging in internal peer review processes for each deliverable and (3) engaging in Project Catalyst community advisor review processes. \n\nSuccess would be measured 20% through the success of establishing a research network and 80% on the report itself. The KPI list for both items above is extensive and quite possibly very challenging to implement in practice, but they are definitely an excellent starting point. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "The Research Guild will deliver a market research report to investigate gaps and opportunities for DApp development on Cardano.\n", "experience": "Three PhD candidates studying blockchain applications in land management, intellectual property and peer production; a PhD in Law and International Relations; expertise in research, project management, community development, governance, teaching, license compliance and auditing."}