{"id": 400926, "author": "titan", "title": "Account authentication", "url": "https://cardano.ideascale.com/a/dtd/400926-48088", "category": 26438, "amount": 28000, "description": "Each online service account requires to create a user & password and can get hacked or you can forget it.", "f6_no_assessments": 4, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 398, "q0": "We realize that the proposal aims to create a new way to access online services, in such a way that it is not necessary to use multiple users and access passwords. As the objective is to solve this problem using Cardano technologies to design an integration of all accesses through the wallet, we believe that the proposal fits well to the challenge in question. In addition, with the success of this new way of using the wallet, Cardano's visibility would be increased, with a positive impact on our ecosystem. The budget being requested of $28,000 seems consistent with the work that is planned to be done (given some corrections that we will address next). However, one caveat is that this way of unifying access from a single place (wallet) may end up centralizing this function of performing logins, which I don't think is so interesting. It is true that the traditional way in which these accesses occur (with the person's data being saved on the service's server) can be more susceptible to intrusions, but we also end up having a greater decentralization of this responsibility, since in general each service has its server.", "q0r": 3, "q1": "A positive point of the feasibility plan is the understanding that this is a new concept and, consequently, it would not be so simple to build a tool and already promote strong adoption around it. With that, we see the coherent choice to first focus on implementing core functionality. In this context, we noticed that the actions to be carried out were distributed in weeks, which is a positive factor in relation to the organization. However, regarding the budget breakdown, we realized that some details could have been better specified. For example, we know the portion of the capital required that will be allocated to the Cloud infrastructure ($2,600), but it is not clear how the time allocated to the remaining activities (such as software design or documentation writing) will occur, and consequently we do not know how much of each of these activities will cost, although we know the amount requested per hour of work. It would also be interesting if a CV had been easily made available so we could have more information about the tenderer. Still in relation to the team, we realized that given the total budget ($28,000) and the objectives of the project, it seems important that other people also make up the team and that we have possible ways to contact them.", "q1r": 3, "q2": "Regarding the ways to monitor the project's progress, we noticed that pertinent objectives were stated and that they make sense in relation to the steps that were stated in the feasibility plan. Another positive point is that it was announced that the development will take place in a public repository, which helps in the monitoring by the community (mainly those in the technology area), it is also very interesting to note the constant concern to make the tool easily integrable, the which helps in its adoption and also in its auditability. It is worth noting that it would be interesting to adopt some quantitative parameter to better understand whether the project results are being positive. For example, after the MVP is ready, a survey could be carried out with the people who tested it to gather opinions that indicate whether the product is satisfactory or if it seems scalable.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 507, "q0": "The biggest miss here is that the proposer does not truly identify a real problem. Of course he mentions the problem of \"user names and passwords\" on the internet - yes that's a problem. But there is already a pretty viable and well-adopted solution, which is password managers. He acknowledges these, and/but if Password managers are NOT a sufficient remedy to the Username/Password problem.....? I'm willing to be convinced of it, but the proposer doesn't even try. As far as I can tell, from reading this proposal, password managers are a perfectly adequate solution. Therefore -- what is the problem we are trying to solve?\n\nWhat's more, the risks identified by the proposer are quite real, and he doesn't seem to have an answer: How to get providers OR end user to adopt this thing? \nApparently we don't know yet.\n\nI think the proposer would do well to try to dial in a real problem - perhaps a smaller or more specific one, and one which has a ready market of eager adopters!", "q0r": 2, "q1": "I assume the Ars Magna link is serving as the CV for this guy? He does not explain his qualifications in the proposal, and there is no \"team\" besides his allusion to a wish to hire someone. The roadmaps is extremely loose, and by his own words his is not particularly committed to it. \n\nFor a higher feasibility assessment, we need to see more details in the plan for budget, timeline, and deliverables. It is not possible to truly discern feasibility from the information provided.", "q1r": 2, "q2": "Some of the deliverables are fairly concrete. Others like \"Everybody stops using passwords\" seem glib and not helpful. I'd be less bothered by a bit of humor if the rest of the proposal didn't also seem a bit glib.", "q2r": 3, "assessor": "z_assessor_1180", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6216, "q0": "The impact segment of the proposal might be its weakest link, although I like the proposal. THe proposer has the idea of piggybacking on an idea (good) what has already been developed by another cryptoi community. Namely, Hive blockchain uses Hierarchical Deterministic (HD) wallets to authenticate users by signing authentication messages. The proposer suggests developing a similar system for Cardano that could potentially replace passowords. I commend the proposer for thinking about the challenges and risks. Namely, many proposals suffer from the \"build it and they will come\" mindset. This is something that the proposer also is concerned about. The proposer does identify a major issue. The \" two-sided market problem\", namely there is no demand and no supply of this solution. Effectively, the proposal might be completed... but never adopted as it needs \"users to want to authenticate with their wallets and it needs service providers offering that authentication option\". So the effective impact on the Cardano ecosystem is potentially low even upon delivery - as it is not a key application at the moment, a \"most profitable or most used application\" and how much measurable value is being delivered? Hence, I would suggest to the proposer - if his proposal does not end up being funded in F8 - to resubmit this proposal in the next Fund, but after partnering with one (or preferably more) Cardano/Catalyst ecosystem players (now there are many of them), who could help launch the use of this solution on their platform. This will ensure that any delivered technological product is not Dead on Arrival, but instead is just the first step ... in a planned chain of events. Why? Well, I can't think anyone who can better advocate the adoption of this solution than the Proposer himself. This proposer has so eloquently described his solution and its advantages and the challenges - I feel he just needs to make a step or two and will have potential partners in the bag.\n", "q0r": 3, "q1": "Too bad that the proposer did not include some additional links about himself, although the information is available through his https://arsmagna.xyz/ website, which in turn links to https://oscarnajera.com/ where we can see the proposer's interest for programming and elliptic curves - Bitcoin & Haskell... The proposer mentions that he is a \"software distiller & recovering physicist\" and if this proposal is not funded, I would suggest including more verifiable information about his professsional experience inside the proposal itself. The 14 week action plan for this web extension seems realistic. The proposed budget is partly dedicated to finance USD 2600 Cloud Infrastructure for 12 months. The remaining $25,000 is given as a lump sum for work compensation at a rate of USD60/hr. The proposal involves work over 17 weekends, which is according to my calculations 34 days. If 8 hours are devoted each day, that would be USD16,230 for the work. The author does propose the services of a video editor (tutorial video recording & editing) and a backend developer. WHich is now a team of three. Video editing will be hired. THis explains the relatively higher budget for a project this size, however - the budget seems imprecise. I would advise the proposer, if resubmitting the proposal, to come up with a more watertight budget and plan, with details on how much money will be allocated to his own work, how much to the backend developer and the video editing. The timeline would also benefit from including details about the release of the tutorial video recordings, the \"other communication\" etc... Also, the project would benefit from a longer-term vision how to keep the project sustainable after the 12 months of cloud infrastructure is over. What happens to the project? Is there a future for its existence and market expansion? What is the realistic scenario and what is the optimistic? How would the project generate cash, fix bugs, maintain the code, upgrade it, release new versions for browser stores?\n", "q1r": 4, "q2": "The auditability section is based on measuring deliverables, not adoption. This seems fair as adoption it is not part of the proposal. [However, if the proposal is resubmitted, try to resubmit it with potential partnerships in the pipeline - the proposer seems very articulate - enabling him to reach out to some of the established Catalyst/Cardano players who could benefit from using another Cardano technology, the one proposed here]. The Project will be developed in the open with a public git repository, which is great. I would recommend that the proposer includes (if not approved now and resubmitting in a new Fund) to include biweekly/weekend reports - or at least monthly reports - in the form of a couple of paragraphs detailing progress and challenges through a social media channel or the project website, to make auditing easier. The metrics/KPIs that define the success of the proposal are not listed very specifically in the auditability section. There are some milestones present in the proposal:  server side playground for application developers, release extension into mozilla addons and google store (presumably Google Chrome?). Does this release also mean that the extension will be incoporated in the store - or just submitted? Will some testing be done with some wallets and services? How will the functionality of the solution be verified independently?  Does the proposer plan to author the listed Cardano Improvement Proposal (CIP) to standardize the authentication path? I feel that the auditability of the technical solution and its merits can be clearer for an outside auditor - by including some quality parameters for the solution that are verifiable.\n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10617, "q0": "This proposal is offering an infrastructural tool that could be very useful for Cardano. Due to its open-source nature, other developers/projects can build on top of it. In that sense, this is a foundational jigsaw piece for service providers. Forums, email accounts, social media, marketplaces... if the future of the Internet is sovereign, then this would be an important piece of the puzzle. The proposal is aware of the risk in adoption and is aware of the complexities in development. But if successful, it would bring an impact to the ecosystem and could cut down the development time of future products. It addresses the question brought forth by the challenge: Did our efforts result in new, viable applications built on top of Cardano?", "q0r": 4, "q1": "There is a timeline with milestones and a breakdown of the budget. Both seem practical and realistic, even acknowledging the unpredictability of software development. More information on the proposer and team would help strengthen the proposal. There is mention of him winning Plutus Pioneer Capstone Challenge, his website, and the cardano transaction editor. Digging deeper into the website, I find a github for cardano.el. The proposer could include his github to show his expertise to other programmers who can better understand what was built.", "q1r": 4, "q2": "The proposal includes realistic KPIs and success metrics. As adoption is not the main objective, what is aimed for instead makes sense. How well it is accepted by other wallet providers could also be an indicator of proposal's success. There will be a github too so community an track progress of project. ", "q2r": 5, "assessor": "z_assessor_948", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A web extension that uses your HD wallet to sign authentication messages and lets you log in into online services. Backup is in your wallet.", "experience": "Author of the cardano transaction editor. Prize winner on the Plutus Pioneer Capstone challenge."}