{"id": 401127, "author": "checkpoint", "title": "NFT Multiverse Marketplace", "url": "https://cardano.ideascale.com/a/dtd/401127-48088", "category": 26438, "amount": 180000, "description": "There is a lack of integrated NFT to content solutions.", "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 10244, "q0": "The idea of an affordable, scalable and decentralized NFT marketplace for consumers to purchase items within the multiverse seamlessly, seems like a one much mentioned idea, in my opinion. It is still a nice idea, but it not something different than all the other gaming-NFT marketplaces. The description is very clear, there is no bad point in that and it is considered a Dapp, because of the fact that it considers a decentralized space, so is within the challenge settings. Given the fact, that this idea is an existent one, i don't clearly understand the problem stated. Maybe if you elaborate more on that, the whole idea will seem more appealing and one that differs from all the others. For all those points, i can not be sure about this proposal having a positive impact on the Cardano ecosystem. ", "q0r": 3, "q1": "Team members have managed to assemble a very diverse set of skills and experience across a wide range of disciplines. Referrals on LinkedIn were not provided, so experience can not be 100% verified from that perspective, but that is to facilitate the voting process and assessment. The plan is described clearly but there is no timetable, it is devided in activities but there is no time horizon. The budget is there and has been broken down into identifiable, very clear, items that don't need further explanation, from my point of view. Good job when it comes to referring to the risks that might emerge when tacking such a proposal. However, be a little more specific to the kind of the resources needed for this purpose and how you would mitigate on the event of a inhibitor considering the proposal.", "q1r": 3, "q2": "The fact that there is no clear roadmap and a time horizon makes me think twice of the success of this proposal. The fact that the one KPI described is not accompanied by a number, for example how many people using the platform and purchasing items from the marketplace and equipping them to their multiverse traveler, will be needed to think of this proposal as a success, adds up to that questioning of mine. Keep in mind that the key metrics and how you measure them, is a key for the auditability of the proposal. What is more, there is no way to track the progress of the proposal apart from visiting the github account, as i can imagine, something that is not very useful.", "q2r": 3, "assessor": "z_assessor_861", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 5659, "q0": "The problem statement in this proposal \"lack of integrated NFT to content solutions\" fits the Challenge question for Dapps and Integrations. The Problem solution however, \"utilising an already existing content solution to drive uptaking in meaningful digital assets, including NFTs\" does not really fit with the proposal outline. The solution \"To offer an affordable, scalable and decentralised NFT marketplace for consumers to purchase items within the multiverse seamlessly.\" Appears to already exist, yet the proposers request a significant budget of $180,000 will be used mostly to build content that they would be able to re-sell then it is used on building the actual marketplace. It's not clear how this would add value to Cardano, when you could argue the NFT market is considered by some to be already saturated, as it consists of almost 35% of the entire network traffic on cardano. It's hard to see how buying NFT's inside a closed source metaverse will add significant value to Cardano, or why this feature costs $180,000 to build. Cardano users who wish to support this project and \"own\" a part of it can purchase the governance tokens and/or utility tokens. It is not clear why this business also requires catalyst funding to get started, or how these funds spent on building NFT's for checkpoint will benefit ada holders. The checkpoint website contains the following statement: \"Unlike other outlets, Checkpoint centralises its contnet.\" (typo's included) ", "q0r": 3, "q1": "The team is appears to have extensive experience in journalism, media, and blockchain with somnium space, a metaverse built on ethereum.  They should have the ability to deliver \"an affordable, scalable and decentralised NFT marketplace for consumers to purchase items within the multiverse seamlessly.\" However; I question the choice of the word \"affordable\" as they are asking for $180,000, plus selling governance tokens to investors. Another quote from the checkpoint website: \"Initially Checkpoint tokens (Governance and Utility) will only be available for the UK, Europe, Australian and some other territories.\" and \"Investors will be able to benefit from having voting rights on some of the future direction of the business.\"\nThe budget in this proposal is not broken down into identifiable items, and it is difficult to understand how exactly this money will be used. The proposal does not include an overview of the architecture or development work that will be required, but it does include the following: \n\nSmart contract solution for cards - $40,000 (unique evolving smart contract)\nArtwork commission - $18,000 (4 sets of cards, each set containing 20 unique cards)\nCreation of NFTs and implementing parallax (3D versions made in Unity) - $5,000 per set ($20,000 for four)\nCreation of accessories (merch NFT) - $25,000 (this includes avatar customisation as well as pets, etc)\nUnity development costs for accessories - $8,000\nMarketplace integration into existing multiverse - $55,000\nMarketing - $10,000\nContingency - $4,000 \n", "q1r": 5, "q2": "The proposal does not include specific or measurable KPI's but a more general description of success:\n\n\"The measurement of progress will be determined after the marketplace (which is already available) is implemented. The take up of the digital assets, NFTs and other merchandise will give true insight into adoption and interaction.\nIt appears that this funding will actually be used to create the digital assets that will be sold on the marketplace, and to promote them, and not used to build the already available marketplace. \n\nWhat does success for this project look like?\n\"The success is quite simply people using the platform and purchasing items from the marketplace and equipping them to their multiverse traveler, or avatar.\n\nIdeally, we'd like to sell out of our stuff!\"  (why will ada holders want to fund this business, so they can sell this \"stuff\" back to ada holders?) It's not clear how ada holders would audit the success of this proposal or how they would benefit from it. The ada holders, as investors in this company, do not have a clear vision for realizing a return on their investment with this proposal. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6393, "q0": "The proposer doesn't make clear how this proposal will add value to the Cardano ecosystem and what problem the proposal shall solve. Neither the metrics nor the goals are clear enough to the CAs to understand fully the proposal.", "q0r": 3, "q1": "The proposer provides evidences and links that support the explanation of what the proposal is about. Despite of that, the roadmap could have been better explained with more details and there are missing the actions that the proposer would do if the risks he presented come true. How would the proposer manage the risks he pointed? The budget sum seems to be wrong, the amount requested is  $180000 and the sum of the broken down budget is $185000. The exposion about the team members is coherent with the formal education and experience that would be necessary in the project.", "q1r": 3, "q2": "In the proposal is missing some indispensable points to audit it. These points are mainly the metrics and KPI's that measure the progress and success of the project. The proposer could clarify better the problem the proposal wants to solve as well as the milestones, the time horizon to achieve them and the deadlines for each project phase. ", "q2r": 3, "assessor": "z_assessor_409", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6707, "q0": "I strongly agree that this proposal effectively addresses the challenge. With Facebook changing its brand name to meta, we all know that the metaverse is going to be the next big thing and Cardano is currently at a very early stage in terms of projects launching on it, let alone be the Metaverse specific projects.  \n\nThis proposal is bringing an existing web2 based content based solution to extend and revamp it onto web3 and blockchain based solution, bringing a wide variety of domains such as gaming, news content, magazines (e.g. kids magazines), movies, big data and much more to one metaverse solution. All of these domains will be interactive which means users will be able to not only incentivize for their attention and engagement but also would be as close as possible to real world interactions. This proposal, if implemented successfully will bring a lot of users and help catalyze the wide scale adoption of Cardano.\n", "q0r": 5, "q1": "The budget presented is split into various deliverables/parts of this proposal implementation. The Smart contract solution for NFT cards is around $40k, however, it would have been great to further elaborate upon in which terms smart contracts will be evolving.\n\nThe roadmap is available on the orange paper given by the team, which looks realistic, even though a further detailed description would have been a nice addition. The leadership team of this project is well presented and have significant experience in various domains such as journalism, media, art, startup founders, technologists. However, I am unable to find details about if they are planning to hire smart contract developers OR already have them within the team. It is not clear if CTO himself will do the coding in plutus (I think not :)). \n\nAdditionally, the risk section mentions one of the challenges about adoption of such a solution, especially to non crypto audiences. This is a valid risk and I was hoping that the team presents some ideas on how they tend to approach these risks. Overall, the write up is good with some room for improvement and hence I can not strongly agree. Good luck to the team.\n", "q1r": 4, "q2": "I really wished that the auditibility section was more elaborative. For instance, even though the project has provided an orange paper with the roadmap, there is no details on which project management tools/methodologies they will be using to keep track of the progress of this proposal. E.g. Github updates/jira board/AMAs with community/medium articles. \n\nThe final timeline of having NFT marketplace and digital store by Q3 of this year is given, but how we will reach there is missing. The youtube video digs into VR world, which is web2 based, but it would have been great if addition was made to fill the community with the detailed technical gaps and how proposals will reach from point A (current state) to point B (Q3 of this year). \n\nThe success metric is provided and further details on the project can be accessed through the gitbook link provided. Therefore, I agree that information provided is sufficient to audit the success of this proposal, but would strongly agree if progress per month or biweekly was available too.\n", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7760, "q0": "From looking at the video for their Multiverse, it’s a VR space which people can go to places and socialize within it, think of like Metaverse from Facebook. Checkpoint is an already well established platform with 350,000 highly engaged users (Checkpoint’s other proposal: https://cardano.ideascale.com/c/idea/404871). However, this proposal didn’t provide a clear reason or arguments about why it would benefits to Cardano ecosystem. Since this proposal requested a big fund ($180,000), explanation about why the Multiverse will bring user engagement and awareness to Cardano is crucial, since this proposal would be voted by the Cardano community. Providing a brief and concise reason on why metaverse or VR is a growing industry within blockchain would be a great start to improve this proposal. For what would be a decently written proposal regarding Impact, please refer to this: https://cardano.ideascale.com/c/idea/404177", "q0r": 3, "q1": "This proposal provides team profile with relevant experience. However, it would be helpful if they also include their LinkedIn profile, or other related work so the community can verify those profile. The budget is provided, but it’s not a detailed breakdown. From this challenge description, if a project have more than $100,000 funding asked, it should have broken down their budget accordingly, and in detail. With this proposal, it’s still too general for the budget description. A $40,000 for ‘Smart contract solutions for cards’ can still be further explained in detail, e.g number of engineers with salary per hourly rate, etc. The lack of roadmap detail, planning, and the technical aspects detail is rather concerning considering this proposal is asking for $180,000 funding. Providing those aspect would certainly increase the trustworthy of a project, since it will inform the community that the team knows what their plans are, roadmaps, and how to achieve their objectives. Please refer to this proposal for a well written Feasibility aspect: https://cardano.ideascale.com/c/idea/404177", "q1r": 2, "q2": "There isn’t any roadmap and timelines with milestones. The general description of KPIs and metrics could still be further explained in detail, such as: number of NFTs minted in the first 3 month, and so on. They didn’t include any platform or website link for the community to track their progress, other than their GitBook link about their Checkpoint orange paper. This proposal could be improved if they provide a roadmap, milestones, and KPIs/metrics in a more detailed manner. Please refer to this proposal for a well written Auditability aspect: https://cardano.ideascale.com/c/idea/404177", "q2r": 1, "assessor": "z_assessor_640", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9748, "q0": "The proposal outlines a decentralized NFT marketplace using an existing Multiverse product in the Oculus market place. The team propose a marketplace integration and a collection of NFT cards, merchandise and in-game 3D assets. The proposal does not effectively describe the value proposition of the cards, merchandise and assets that will be produced. Are the items just for being a collector? What integration will they have with some of the existing Cardano metaverse projects if anything? The team also mention an engage to earn model but do not add any depth into the idea. It would be good to know if no one else has tried this what numbers they are seeing if they've had a pilot or comparisons with similar markets to understand what is the potential impact and adoption of this solution. From the information provided it is not clear on exactly the value and impact this proposal could make in the Cardano ecosystem. It would have also been useful to know more about the background of checkpoint magazine. What viewership, readership and memberships do they have already? What interactions to they get with existing products? This information would have been useful to understand the potential impact.", "q0r": 3, "q1": "Six team members are added to the feasability section, there is also six covered in the GitBook provided. No LinkedIn profile links are added which would have been useful to more easily see the backgrounds of those involved. A minimal roadmap is provided and a breakdown of the different areas by cost. The website and background of the company provides some useful evidence that the team will be able to execute this proposal. To give a better rating more sources would be needed that the team has the capabilities to execute the more technical side of the proposal with either Github sources or better professional background sources beyond the text provided.", "q1r": 4, "q2": "The proposal team outline that they will measure success by tracking 'the take up of the digital assets, NFTs and other merchandise will give true insight into adoption and interaction.' And on from that they mention success being selling out their stuff. They metrics make some sense but add no depth of truly determining whether this proposal will create a high impact. Selling out of the merchandise does not mean it has created impact. Potentially it created impact for a very small amount of time and then this faded? The proposal team could have detailed what they want users to do with the assets and NFTs more and the engagement aspects. Why will they value these items and then how does this translate into suitable KPIs to try and determine the effectiveness.  The other area for auditability would be adding more depth in what will be open source if anything and how the community can audit any development efforts but also benefit from learning from them where possible.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Utlising an already existing content solution to drive uptaking in meaningful digital assets, including NFTs", "experience": "The team consists of veteran blockchain and industry professionals, and the partnerships with other projects allows a unique way of engaging wider audiences using videogames culture."}