{"id": 401423, "author": "kkleftog", "title": "Carbonno - Carbon Exchange dApp", "url": "https://cardano.ideascale.com/a/dtd/401423-48088", "category": 26438, "amount": 20000, "description": "Existing web3 approaches do not offer an easy-to-use way of buying/selling carbon credits or are limited to reforestation projects only.", "f6_no_assessments": 3, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal does not specify if it is an MVP or Proof of Concept or even earlier stage of development. It is inconceivable that and I quote \"investors will be able to choose a Carbonno Project of their liking and stake in it. Rewards will be calculated based on the specific Carbonno Project's carbon-reduction.\" From the timeline, budget and business plan provided, this is clearly not possible with the current proposal and the manpower and budget. Please say what stage of the project you are in, how this depends on other funding inside and outside Catalyst.\nDon't get me wrong, it looks like a very interesting project with a lot of thought about Game Theory and Staking and DeFi going into it. PhDs even. But it is a very, very grand vision and for 20k we may expect a mockup and some testnet trading - I have seen proposals asking for three times the amount to achieve half as much.\nI was torn whether to put this criticism into the Feasibility section or the Impact section. As you can see, I chose Impact - because I think for a mockup and research the project can be implemented successfully with the team - so I scored Feasibility higher. Impact will be low at this stage, and as we are promising a singing and dancing DEX, I am scoring Impact low instead. I hope the reader can follow my logic.", "q0r": 2, "q1": "The team looks very passionate and brings a good mix of expertise to the proposal. We see some examples of how the platform dApp may look like and there already are a website and whitepaper. There is a roadmap with three quarters of development and the budget is broken down into its components. As far as these basics are concerned, the proposal is getting full marks. Where things become less credible is the part where the product is transformed from front end UI to working dApp. How can we possibly expect a $10k software development process to suddenly magically yield various carbon projects to be minted into NFTs and traded on a DEX? Why would venture capital companies back blockchain startups with millions of dollars in funding if things are this easy? Who are the sellers, who will verify the offset? I have to admit that I am not an expert in carbon offsets, but to put the marketplace into context, OpenSea raised $100 million at a $1.5 billion and listing cartoon heads and other art requires much less provenance and financial audit I assume than a regulated asset.", "q1r": 3, "q2": "The Audit of the proposal is going to be difficult without some numbers so I am missing quantitative targets in this section. No mention of what has to be achieved by when. The Auditability input is a continuation of the business plan, listing some features that should have been explained earlier, like what the ISPO is about and if there are SPO partners for this project. Instead of KPIs I get action points, and I think auditors will not be able to do much with them to ensure the project is properly understood or monitored.", "q2r": 2, "assessor": "z_assessor_1329", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "We would like to express our gratitude to this assessor for providing a thoughtful assessment that, unlike some others, does indicate that the assessor read the proposal and put some real thought into it. We are flagging this one because we feel there is some ambiguity about the standards that are being applied in assessment and that this rating is lower than many other ratings of other, similar projects. Our primary concern here is that the assessor is unduly downrating us because this proposal is only partial funding for our project. Almost all of the criticisms presented in this assessment are ultimately based on that premise. We have read many Catalyst proposals and a number of assessments and it seems that there is wide variation in terms of what is considered acceptable here. The bottom line is that it is very common for proposals to be partial, in the sense that the funds requested in the proposal are only intended to cover part of a larger project. For example, the proposal for our closest competitor, Blockcarbon, was clearly structured the same way, they were not asking for an amount that would be sufficient for their entire project. In fact, they were funded in Fund 7 and now they are back again for more in Fund 8, which is entirely reasonable. But it is not reasonable to rate Impact very low because the funds requested, alone, are only enough for an MVP. And it is not reasonable to give a low rating for Feasibility simply because we can't \"expect a $10k software development process to suddenly magically yield\" a fully finished product. That's exactly why we made it clear that we have other sources of funding and that we are not relying entirely on the funds requested for this proposal alone. In fact we even have another proposal in the B2B category which focuses more on business development, which also might have addressed some of this assessor's concerns if they had seen the reference to the other proposal.\n\nOr, to be more precise, the guidelines for assessors should either be clarified that Impact refers to only the portion covered by the funds requested, or else Impact refers to the overall potential of the project. Right now some assessors use one standard and others use the other. So we might suggest that there is room for improvement in the guidelines that assessors receive and that this subject seems to be coming up a lot and ought to be covered.\n\nOn a separate issue, the assessor gives a very low rating for Audibility because, basically, \"Instead of KPIs I get action points\". But this is not entirely fair. Other than \"application launch\", three of the four bullet points listed at the beginning of the Auditability section of the proposal are numerically measurable items. We suspect that the assessor was looking for something like \"number of GitHub commits\" as the template suggests, but we felt it was more useful to indicate progress metrics specific to our unique project rather than bog-standard development metrics that everyone already knows about and which can be applied anyway regardless of whether we list them."}, {"q0": "There is u use case for Cardano to be made here. The certificates and smart contracts can be stored and verified using the Cardano blockchain to make it open and trustworthy for users.", "q0r": 4, "q1": "In the description, there is written: \"Based on reputable sources, demand for voluntary carbon credits could increase by a factor of 15 or more by 2030 and by a factor of up to 100 by 2050 and the market could be worth upward for $50 billion in 2030.\" I suggest you add a source to this claim. \n\nThere is no mention of where you would start implementing the platform (Global, USA, EU,?). I think it would be a real challenge to create Smart contracts and counter fraud. Every application for Carbon saving projects should be screened. For example, a company could be subsidized by the state and apply for a contract.", "q1r": 3, "q2": "The project is in the early stages of development so I understand the KPIs are not that well defined but I would like to see numbers and self-imposed deadlines to measure the success of the funding.", "q2r": 2, "assessor": "z_assessor_1387", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "Having a platform for carbon credit trading based on Cardano blockchain is a good idea and helps to leverage its application while solving enviromental issues. Proposal is also aligned with challenge, as it can potentially increase challenges kpis as \"NFT marketplace or facilitator\" and \"Solutions utilising the power of smart contracts\".\n\nI liked that a diagram explaining how it works is provided and some imagems of the UI, to give an idea on how it will look like. Problem statement is also true and solution seems to address that, promoting the trade of carbon from different sources of compensation (not only reforestation) and and possibly in a easier-to use way. This helps also to give insights on how this product will differentiate from others that trade carbon credits.\n\n\nAs suggestions of improvement, the business side of the project could be better explored. How will it generate revenue? Will there be a fee in each trade?\nI understood that the target audience will be ordinary people/investors (not companies). Was there any business case or research that indicated this market need? \nI'd also consider expanding this scope to companies. Nowadays, most companies have net zero target of emissions by 2050 and there'll certainly be a growing demand for that (it is necessary, however, to have a great availability of carbon credit if companies are included).\nAn advertise/communication strategy should also be ellaborated. how to explain to regular people about this app and educate them about carbon credits?\nThis is mentioned in the risk part but not explained how to overcome it.\n\n\n", "q0r": 5, "q1": "There's a simple but fair. time-framed and relaistic timeline in place. the project would take something around 1 year which seems reasonable for the development proposed. I just wonder which project management approach will be used. If it is an agile, maybe a broken down by sprint could be provided (if not now, during execution, to help track project progress).\n\nbudget is broken down by acitivites/development part and is reasonable. it could just mention how many hours each one would take. I'd also consider some budget for contigency and for marketing.\n\nThe team formed by 6 people have the necessary competencies to execute the project. They include software development, plutus, energy and carbon credits and block chain. To make it more complete, I'd add linkedin links and the roles of each person in the project.", "q1r": 5, "q2": "There are good milestones proposed that help to track key points on project. However, some kpis related to application usage, people reached and engaged, quality of final product, total carbon traded and so on could be included, even if in a pilot or MVP phase - in this case, targets could be set later, after for when product is commerially available.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create Decentralized Carbon Exchange dApp, where verified real-world carbon credits from various sources are traded in the form of NFTs.", "experience": "Plutus Pioneers, residential & commercial solar power/efficiency engineers, utility experts, CS/game theory and cyber security PhDs, blockchain and NFT enthusiasts."}