{"id": 401497, "author": "mehdi.wethio", "title": "Cost of listing on an exchange.", "url": "https://cardano.ideascale.com/a/dtd/401497-48088", "category": 26438, "amount": 25000, "description": "The cost of listing on an exchange platform is very expensive today, and because of this, many projects cannot be developed.", "f6_no_assessments": 5, "f6_rating": 1.4, "videos": [], "media": [], "f6_assessments": [{"id": 5944, "q0": "The proposer has identified a problem and a solution to the problem but they seem not to address something relevant to Cardano ecosystem. The people running an exchange have their reasons to ask for a prohibiting fee to list cryptocurrencies/tokens as they have a reputation to protect and this barely looks like a problem that needs to be solved.\nThe proposal doesn't fit into the Challenge brief as it doesn't follow the Campaign's goals and it doesn't seem to bring the impact we're looking for.", "q0r": 2, "q1": "It is unclear who are the people that will take care of the implementation of this proposal. Also it is unclear what is role of the proposer in this project as there aren't any references about the necessary skills and experience to successfully implement this proposal. What I miss is, in addition to knowing their names and roles in the project, a brief history of previous work and mainly: how do these professionals relate to the Cardano ecosystem? What are the ways they dialogue directly with our blockchain?\n\nThe requested budget is not broken down into identifiable items (development, marketing, stationery etc.) and the proposal doesn't offer a realistic timetable to complete the work.", "q1r": 2, "q2": "As it is, the proposal is difficult to assess as it lacks in providing relevant info about implementation phases and also it doesn't seem to address a relevant problem.\n\nNo KPI/metrics are defined to measure the success of the proposal.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6419, "q0": "The issue being cost to list on an exchange platform is very expensive due to this many projects cannot be developed. The proposer is suggesting an African exchange named \"wethiox.io\" which offers cheaper listing rate.\nThe proposer hasn't provided much details regarding how they are planning to tackle this issue and they have not given much details about the website too. The \"wethiox.io\" doesn't have much cryptocurrency listed on it and I don't believe they will be able to provided much exposure to the new projects. The proposal does identify the challenge that needed to resolved but they fail to provide any solution that can effectively resolve this challenge. The proposer haven't provided full details regarding how this proposal will be implemented so it is hard to say if this proposal add any value to the cardano ecosystem.\nThis proposal doesn't consist of any key metrics or milestones. The proposal isn't complete and still many info is needed to make sure this proposal really addresses the challenge. After going through the proposal I personally felt this proposal was written to promote wethiox.io website not to addresses the challenge", "q0r": 2, "q1": "The proposal doesn't consist of any information regarding the proposer or their team. They haven't mentioned any of their previous work and no details regrading the skills they know. With all these missing it will be not possible to say whether the proposer and their team has required skill and experience to implement this proposal. The proposer has requested a budget of $25000 but has failed to given any details on what they will be doing with it and also haven't provided any budget breakdown due to this missing info it's hard to say if the budget demanded is justified or no.\nThe proposal doesn't consist any plan or timeline on how this proposal will implemented.\nThe proposal is incomplete and given details won't be enough to say whether the proposal will be implemented successfully \n", "q1r": 1, "q2": "The proposer haven't provided a details regarding how the proposal will be execute and it also doesn't contain any plans or any roadmaps with goals to achieve within a particular time horizon. The proposal doesn't have any key performance metrics or any info on how to define the success of the proposal. Without these information it would be hard for auditors to track the progress of the proposal and also to make sure if the proposal is going as per scheduled. The proposal doesn't have a complete budget breakdown and also they haven't provided how the proposal will effectively solve the challenge based on these observation the info provided isn't enough to audit the development of the proposal and also it is not possible to track the success of the proposal.", "q2r": 1, "assessor": "z_assessor_419", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7619, "q0": "It seems quite weird why this proposal is listed in the DApps & Integrations challenge as the problem it suggests to resolve is the cost reduction of listing new cryptocurrencies in exchanges. The proposed solution is the usage of an existing exchange named WethioX that has low rates for listing new cryptocurrencies and intends to provide a commission fee to Cardano. This is mostly a marketing activity to expand the userbase of the specific exchange rather than to increase the utility and adoption of Cardano. For this reason, I strongly disagree that this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposal does not provide any information about required resources and activities, a time frame, a budget and the feasibility section is almost empty. This fact leads that nothing will be implemented so the score for feasibility is 1. As a Community Advisor I recommend that any proposals lacking basic information should be excluded from the assessment stage.", "q1r": 1, "q2": "The Auditability section is completely empty and it is obvious that the score is 1 without the need of further reasoning. As a Community Advisor I recommend that any proposals lacking basic information should be excluded from the assessment stage.", "q2r": 1, "assessor": "z_assessor_614", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8233, "q0": "Proposer points out the problem of cost listings on an exchange platform and claims that they are very expensive and offers a cheap listing solution on the WethioX platform that he has built. It would be good if the proposer wrote what kind of impact this project would have on the Cardano ecosystem and how it would add value to the Cardano ecosystem. Unfortunately, KPIs have not been written or presented and this proposal is not able to scale to address future challenges.", "q0r": 2, "q1": "There are links from which we can see the work and experience so far. I would like the team to be transparent and to know by name and surname who is behind this project. Proposer states that the team is based in Marrakech, Zurich and Dubai with more than 20 employees including 10 developers but this is not visible to us through the links posted in the proposal. The budget has been presented but it has not been worked out on what the money will be spent on. For the realization of the project, it is necessary to present to the community a detailed work plan and time frames within the project will be realized. It would be good to list possible challenges and risks.", "q1r": 2, "q2": "For some reason, proposer did not present a roadmap with milestones and KPIs were completely omitted. Maybe due to lack of time or some other reason. I suggest that the team behind this project join the weekly Town Hall meetings where they will get all the information they need if they need any help.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10593, "q0": "I opened this proposal because I think the title is interesting but I was not lucky (yet). I am not sure what the guy is trying to deliver here but I am very sure it is not a proposal. While the problem statement is somehow enticing and could be real, the summaries are not. When you continue reading the proposal, you will start to realize that this is more of an advertisement and promotion rather than a proposal. I believe misusing Catalyst proposal is violating community rules and ethics. Is it possible for a proposal to be so bad and probably malicious, it got filtered? Hell, I am not even mad if this assessment got filtered out. Luck to proposer, at the very least a star need to accompany a rationale, so there you go (also because the title is actually okay and might deserve a star by itself). ", "q0r": 1, "q1": "Nothing to see in this aspect as well. Just another line of advertisement. Going further to their website, you even start to feel if the proposer is conducting a scam/fraud/swindle (though I doubt anyone in Catalyst can be scammed with something like this). Hope no more CA come across this proposal and rant like me. Their precious time and other resources should be allocated to legit, genuine proposals in need of genuine and sharp feedback.  I apologize in advance if anyone found above offensive and/or if I did a false accusation. Still, one star since no (or even a fraction of a) star  is currently no can do.", "q1r": 1, "q2": "A star is one too many for this particular aspect in this proposal. Moving on. one of my concerns is if this Mehdi Wethio guy is actually attempting something right sincerely, but just not informed enough to do so, then we need to reach him and show the correct way. Another concern is this kind of attempt could hurt Cardano African community image to someone who is new in Cardano or Catalyst or even from outside of Cardano, trying to use this against us. My suggestion is to look further towards this, including the actor/proposer. I wonder if something similar to this had occurred before in previous funds. As an extra caution, probably our African communities need to do some legitimacy and background check towards the related parties mentioned in this proposal and advise a future warning (necessary if proven dangerous) to not to be relating to these parties so we can prevent someone in general audience to fall victim, since I suspect there is a chance they can abuse Cardano name somehow through this proposal. Another bad publication is the last thing we want for Cardano community. To the vCA QAing this assessment, hope you are entertained a bit by my light humour (unique to this proposal only). Many thanks for your time and attention. Also thanks for your effort and dedication in the QA phase. May your spirit be strong to do as many quality works as possible. Good luck and Peace out!", "q2r": 1, "assessor": "z_assessor_943", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "An African exchange linked to the first African blockchain provides a very attractive listing rate.", "experience": "The exchange platform \"WethioX\" allows this easy access to a cheap and ethical listing.\n\nThe team behind this platform is based in Marrakech, Zurich and Dubai with more than 20 employees including 10 developers.\n\nhttps://www.wethiox.io"}