{"id": 401445, "author": "adiuvat", "title": "ADIUVAT: Find your place.", "url": "https://cardano.ideascale.com/a/dtd/401445-48088", "category": 26438, "amount": 76100, "description": "Sedentary digital user, content consumer, and little purchasing power: replaces life situations that strengthen the human spirit as juncture", "f6_no_assessments": 4, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"id": 2791, "q0": "The typical user has become used to a sedentary lifestyle . His debt has grown and due to this as well as inflation and scarcity of resources he is stuck at home and unable to go anywhere..\n\nThe ADIUVAT service promises a great adoption, that is, if there are bubbles on the map in my town or wherever I go with respect to my location, I will always be connected with my surroundings . Sometimes when I go out, I ask my friends what is open, where we eat, or where we hang out and with this I can access and see everything, in addition to interacting within the application. If I have my TIPS, I can eat a pizza or go dancing anywhere so and I will have an experience that makes me see beyond my pizza or dance and I´ll part of content. Sounds like I can have a good time for the similar cost of Pizza alone. I don't have to do foreign badges... it seems to me that over time you can train external sales consultants in any continent, it's not something new... I like it.", "q0r": 5, "q1": "The team seems to be engaged but I don't really know much about Antioquia, Colombia.  However, if it is the seat of the 4th industrial revolution it may be a place where a Cardano seed can be planted.\nsources  such as Reuters, the world bank, the international monetary fund, prove that this  is happening and is a significant problem. \nPeople's purchasing power is very poor. This means that when they go out, they concentrate their activities on the first step of Maslow's pyramid which is food clothing and shelter.\nAdiuvat allows people not only to look for places around them to have fun and go out, but also gives added value based on human principles (activities that are complementary to basic consumption such as fun , enjoyment, reacreation and self actualization) that allow people to see beyond basic consumption and climb steps in Maslows pyramid.", "q1r": 5, "q2": "Maslow's pyramid is a psychological instrument that measures human needs, for this reason, Maslow's pyramid shows us how people choose priorities. And the data from the sources shows how they are chained to the first step with the statistics of debt, inflation and scarcity.\nminimum viable product is to register the establishment such as shops cinemas malls, salons, sports centers and other fun and recreational place.s    The registered establishment agrees to proactively offer information to users who migrate to Adiuvat so that they are updated on their activities /experiences.\nAlso we will onboard pubs bars clubs restaurants and other places which will force people to go out and have fun instead of sitting at home getting fat and sick.\nThe entire service has its objectives defined, so the work on them will be fundamental, the system works if the commercial establishments sign up, so I am curious about the growth capacity if there is a good touch.  What I mean is, you can work on it.  In any case, we are talking about decentralized physical places… it is a fundamental transformation and an ADA ideal I suppose.", "q2r": 5, "assessor": "z_assessor_1582", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3335, "q0": "The proposal is actually good for cardano implementation. Adiuvat talks about registering businesses, that is to say that they will be in charge of promoting registrations of establishments in their system, which they promote as bubbles on the map. I think of this as if I open the Application and there are bubbles of businesses or establishments that are open and accept my TIPS token, when I open each bubble I can see the content that the trade creates or the experiences that have been made, which seem to be cheap at be based on human principles...\nAdiuvat raises the current systemic problems such as debt, inflation and scarcity to determine that the lower-middle class has little purchasing power and therefore when they leave, they spend their resources on activities that are the first step of the Maslow pyramid (psychological source) ... With this, they seek that each business registered in the Dapp encourages the user to use ADIUVAT so that the service or experience is more economical and complete (that is to say that in addition to eating, at the same time I can participate in an activity where I can interact and earn at a similar cost), they speak of each social category so that each company administrator can create their Partner profile (have their bubble).\nFor the added value: The experience, ADIUVAT allows each registered user to apply as a Talent and to communicate with an establishment to create content/experience in the service. Products are not created but it is a service that connects peers, so it is a worked system and it is not an idea out of nowhere because it feeds back into itself, that is, the work is actually outlined: Enroll businesses to their terms and conditions and developing the Dapp and tips. But what I love the most is that your TIPS token will be accepted on every trade and exchange so Cardano network usage will explode. ADIUVAT is a brand in itself that could make me enter with my native cardano token to every bubble in every part of the world, so I am a decentralized user!", "q0r": 5, "q1": "Adiuvat presents not only his idea but also the website, the prototype of his Dapp, visuals, his YouTube channel and all the networks that we habitually use, they know that the budget is initial and that they will then have to risk it according to the value generated. of his company, his metrics are realistic and focus on two specific situations: The legalization of his token to operate in exchanges and register businesses to the waiting list that will position them. It is a realistic and achievable plan over time, they do not leave the context and they know the KPI metrics to advance step by step, it is clear that the future of ADIUVAT is very clear, these guys have impressed me.", "q1r": 5, "q2": "If it is enough, the data of the team and the scope expected by it is absolutely measurable, that is, if they hire 20 people to register at least 4 businesses a day each, in 3 months their database could be valued at 6000 or more, 4 deals seem like very little to me in 8 business hours but it makes them look conservative so they are committed to impressing. The prototype of the Dapp through the youtube video is easy to elaborate (I am a Software engineer) and the tips under cardano can actually be the global payment method, I like its generic name. They promised not to deliver everything but what is necessary to get the project off the ground. I searched for the aforementioned JIRA tool and it is a management tool that can help the CEO to see everything from a big picture, and that is not all, cardano can to be there. I suppose that to generate the decentralized world we need everyday use cases and I definitely prefer to do it in a simple way like when I order a car with Uber.", "q2r": 5, "assessor": "z_assessor_1646", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8615, "q0": "The idea might sound good on paper but is perhaps a bit too idealistic to have much of a real-world impact. Also, the connection to Cardano presented, seems a bit stretched\nI don’t see the immediate benefits that this project would have from being built on top of a blockchain, nor does the proposal convince me that Cardano would benefit from having this dapp built on top of its infrastructure.\n\nThe plan presented is more of an overview of the planned organizational structure, and does not relate to how the implementation will address the challenge. \n\nIf the proposer would want to resubmit the proposal I would suggest using less embellished language and trying to be more on point with their descriptions. For example a phrase such as “so the task of marking the (nothing new) cannabis market is given to focus on new horizons that come from digitization and the union leaving terrorism behind” is not very helpful in the assessment of the impact the project might have on the Cardano ecosystem.\n\nThe risks question is not answered, instead, the proposers present a roadmap that would have been better suited in the first part of the feasibility section. I would advise giving more thought to this question in the future.", "q0r": 1, "q1": "The roadmap presented is more of an overview of goals than an actual implementation plan, and even as such it lacks clarity in a lot of areas. Some of the goals mentioned do not seem feasible at all, at least not at this stage of development.\n\nThe budget breakdown seems to make sense at surface value, but given that the proposal is very ambiguous regarding what it wishes to accomplish it’s unclear what the hired team member would do.\n\nGiven the lack of experience of the team, the goals set in the project seem even less feasible. The team members provide links to personal profiles, but it's to their Facebook and Instagram pages which are not very relevant in a professional setting and do not provide much info to assess their ability to deliver on the proposal.", "q1r": 2, "q2": "After reading the ADIUVAT: Find your place. proposal twice I must admit I am still a bit confused about what exactly this project seeks to accomplish. One part speaks about developing a dapp, another about a legal service, unclear.  Since this rating is for clarity in addition to auditability this is a big minus for the proposal.\n\nNo clear plans for auditing are made, no KPIs given, no metrics set. Given the already very unclear nature of the proposal, I assess that auditing would be very challenging.\n\nThe definitions of success given, while ambitious, are for 2030 far outside the scope of this proposal. I would have liked to see clear goalposts set for the more immediate future, 3 months, 6 months 12 months.\n\nMy recommendations of what to include for a successful resubmission:\n- more clarity and fewer embellishments in the description of the problem it wants to fix\n- an easy to understand presentation of how they intend to fix the problem they have identified\n- identify KPIs and metrics that will enable easy tracking of the progress on the project that is within the scope of the proposal\n- goalposts (milestones) that create a clear vision of the expected success or progress of the project", "q2r": 2, "assessor": "z_assessor_681", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10554, "q0": "This proposal describes a global platform for entertainment activities, for which a very basic design is presented in a video. Payment for these activities would be done using a native token; no other use of the Cardano network is mentioned in the proposal, and there's no justification either for the need for a native token. All mentions of a Dapp could be replaced by mobile application, and there is no decentralized component.", "q0r": 1, "q1": "The plan presented is quite confusing. Apparently, proposer plans to hire 2 system experts and 2 lawyers and spend Catalyst funds on issuing a token, and listing it on exchanges (starting with Binance). The project would then self-finance with the proceedings of an ICO. Issuing a token is easier that the plan makes it sound, and listing on an exchange incredibly more difficult (and expensive). \nRoadmap extends until the end of 2023, when contracts would be signed with \"\"Google, Uber and the like\"\". In my opinion, there's no chance this project would be completed succesfully.", "q1r": 1, "q2": "The team plans to use Jira, which could be a good way of keeping track of progress, but there's not much info on actual deliverables and KPIs. A grand vision for year 2030 is presented, but that's out of the scope of the proposal.", "q2r": 2, "assessor": "z_assessor_941", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Connect experiences to people through commercial establishments with content based on human principles a bit or no extra cost to basic p2p.", "experience": "Want to go out today? Are you going to eat, drink, have a coffee or see an event? search our Dapp that is online around you and the world. we have an added value for each thing you choose to do that'll make you look beyond basic consumption. Can be alone, couple or family/friends"}