{"id": 401668, "author": "yobozorle", "title": "LOOZR", "url": "https://cardano.ideascale.com/a/dtd/401668-48088", "category": 26438, "amount": 350000, "description": "Loozr is a cryptocurrency-powered music streaming platform that allows everyone to invest in and profit from the success of artists.", "funded": 0, "upvotes": 26039794, "downvotes": 24115764, "votes_result": 1924030, "votes_cast": 100, "f6_no_assessments": 5, "f6_rating": 3.2, "videos": [], "media": [], "f6_assessments": [{"id": 402, "q0": "In order to facilitate the profitability of artists, the project tries to create a platform that brings more democratic monetization to musicians, creating an environment where there are several ways of financial return for them, and also for users or other stakeholders. We can thus see that the central idea of the project is to use Cardano technologies to reduce bureaucracy in a segment that is highly populated by intermediary agents that mitigate a good part of the gains. With this, the proposal fits the metrics of the challenge in question. And as music is an unrestricted industry, the success of this project could bring great visibility to Cardano's ecosystem, as the idea is highly scalable. However, we found a considerable problem in relation to the budget being requested of $350,000, as it is a very high value given the current characteristics of the project, as we will see below.", "q0r": 3, "q1": "As mentioned before, we have a problem regarding the amount being asked, and in fact yet another contradiction arises. When looking at the budget detail, the total capital required is $80,000, which is contradictory information to what was initially exposed. Considering this last mentioned value, we realize that by the current organization, we have that approximately 62% of the budget would be destined to marketing. It makes sense that special attention should be given to this point, as it is a new concept and should be introduced to the public. But perhaps this budget division jeopardizes the production of other steps that were described in the plan.\n\nIn fact, it is worth mentioning that one of the factors that seems to harm the viability of the project would be the amount of possibilities that the platform intends to deliver. We see the possibility of marketing different types of tokens, multiple forms of profitability, development of regional resources and even plans to launch versions 2.0 and 3.0. Bearing in mind that a beta version of this Dapp is yet to be released, it seems interesting that the number of features were a little smaller, so that there is a beta version that is less comprehensive and more focused on testing public receptivity. Additionally, considering the size of the project, it would be nice if we had the CVs of more professionals involved. Both in the proposal and on the project's website, we find only the curriculum of the founder of the idea. However, it is worth mentioning that the project presents some innovative concepts, such as the tokenization of moments ($MOMENT), as we know the popularity and reach of short videos on current social media. With that, it seems that with the adjustments of some points, this project that has good potential would become more viable.", "q1r": 2, "q2": "Given the entire audience that the project aims to reach, it seems interesting that there were more ways to monitor the proposal, which would work concurrently with the commits made on Github. For example, the Miro tool could be used to carry out periodic, perhaps even weekly, updates on the completion of steps. Another idea would be to create a group on Telegram with the participation of developers and the public, so that instant feedback could be collected.\n\nRegarding the team's perception of success, it is positive to see that a desired amount of artists and creators has been established that must be present on the platform in a given period. But in addition, it seems nice to stipulate other quantitative parameters that help in this measurement of success, such as:\n\nExpected engagement goal of the project on social media\n\nMonthly average growth in relation to listeners to be achieved\n\nExpected revenue in the beta version of the app", "q2r": 2, "assessor": "z_assessor_1146", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1501, "q0": "If succeeded it could bring millions of people to the Cardano blockchain from all demographics. Cardano could make the gap smaller between artist and listener/fan and could provide upcoming artists with a chance beyond the music producers. \n", "q0r": 5, "q1": "The idea is not completely new. If you do a quick google search for \"blockchain music streaming platform\" you notice a lot of teams working on a similar idea. If the execution and product give the users a better experience it could be possible to penetrate this market.\n\nMy concern is the lack of diverse team members (only one team member listed). To make a project like this work you need people familiar with developing apps but also with the music industry, lawyers, advertisers,... If there were no competing projects I think these challenges could be overcome but at this time I believe there should be extra team members. ", "q1r": 2, "q2": "There is a long time structured plan to tackle the project. There is also a clear end goal: \"Onboarding 5,000 artists and creators for our Q4 2022\". ", "q2r": 3, "assessor": "z_assessor_1387", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 1744, "q0": "The proposed solution implementation is quite clear and well described. The team did an in-depth study and analysis of the music streaming field. The proposal touches the core because the proposed measure has an impact on the challenge posed. The team has detailed and logical solutions to develop for the arts and the ecosystem. And also considered a number of risks and disarmament to minimize the risks they will face when implementing the project.", "q0r": 4, "q1": "The proposal's plan is laid out with a clear roadmap divided into four quarters and organized by milestones. However, the budget table does not seem reasonable for what is allocated. Teams are people with full experience and necessary skills to carry out the project. Proposal will be strong and transparent if there is a detailed timetable and budget. For example: Budget for each quarter, for each period, salary of each member, their job and working time...", "q1r": 3, "q2": "It will be easier to audit and measure the successful progress of the project if there are a few more KPI metrics in the milestones. How many artists, creators, user communities will be enhanced and promoted each quarter. A proposal will be more successful and transparent if it has a more in-depth, detailed plan.", "q2r": 3, "assessor": "z_assessor_1409", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2574, "q0": "This proposal is aimed at artists, musicians, composers or even fans, the audience community, the audience...Challenge A large community. This proposal, if successful, has a huge impact on the community, which is the integration of music and digital currency, which contributes significantly to the development of the Cardano ecosystem. I am very impressed with this proposal, it brings a breakthrough idea in applying digital currency to the music field. This amazing thing has made it possible for musicians and their music to be encrypted and anyone can buy, sell and trade these tokens on the blockchain... In our lives today, the music streaming sector is one of the fastest-growing in the world. This proposed idea aimed at the music world will be very beneficial for the growth of Cardano. Together with 5 years of experience in Game and Software Development, Over 7 years in the music industry, the proponent offers a platform that benefits both creators and consumers. It's the Loozr app. This app, allows artists to distribute music and receive direct investment from fans. Anyone can make money by investing in an artist's BIO or SONG. Artists can also earn money when listeners stream their songs. By using Loozr coin and Loozr coin is the native cryptocurrency of the Loozr platform. This is a new way for musicians to earn money while also being able to share their stream earnings with investors and fans. It empowers independent creators, musicians, and communities to create their blockchain-based digital economy, benefiting all parties in the music industry. This is a great solution, giving all the music community including Musicians, Creators, fans, audiences... the opportunity to earn money and increase their value. From there, this proposal is beneficial to many different levels in the development of the Canadian ecosystem. I strongly believe that this proposal can solve the challenge... Although this is a completely new field, not much experience yet But with the speed of development, cost, interactivity, and reliability they have created for the community...I still believe they will There are ways to overcome the risks to go to success. They also constantly approach more mentors and partners to gain more experience and create more value for themselves.\n\n\n\n", "q0r": 5, "q1": "\"Have a clear and reasonable time plan. The development roadmap is from Q1 2022 to Q1 2023. However, to easily manage, promote implementation or have improvements in the implementation process, I recommend that there should be Progress tables. implemented to easily monitor the schedule of activities or the management board of the implementation plan.\nThe budget explained in the proposal is divided into 3 clear parts: MVP $10,000, Campaign and Marketing $50,000\nUpgrade and Update $20,000. However, On Title The Requested Budget is $350,000. Request the Proponent of the next explanation, explain in more detail, what is the remaining budget used for, when will it be used?\nThe team has experience in the field of expertise, seniority, and reputation in the market such as VR, AR, iOS & Android Developers for more than 5 years of partnering with AppliedBlockchain, honored as one of 20 companies consulting and leading blockchain development from 2017 to 2020. I believe that with an experienced team, the project will be a great success, bringing a lot of value not only to the music-loving community but also to the community. the pervasive development of the Cardano ecosystem.\"\n\n\n\n\n", "q1r": 4, "q2": "Projects with a commitment to bring metrics through open source can be easily found on the Github channel, including KPIs/metrics, all EASY to measure.\nThis project is in the process of being built and implemented according to the given schedule. The goal in Q4 will be to successfully introduce 5,000 artists and creators to the community and make them richer and more famous on the blockchain.\nThis is a brand new project. However, with what they have been doing, I believe they will succeed in this project, bringing the music world to a new level. It is a wonderful combination of the world of Music and blockchain. ", "q2r": 5, "assessor": "z_assessor_1534", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8617, "q0": "The project presents a novel way musicians could interact with fans and supporters and possibly even potential investors. This in theory could have an impact on the adoption and usage of the Cardano blockchain.\nBut judging from the proposal I’m left unconvinced that the proposed solution would actually work in practice, thus substantially reducing the potential impact of the proposal.\n\nThe answer given to the “describe how your proposed solution will address the challenge?” is not adequate as it refers to the way the project will be tracked, not the way it addresses the challenge. Having said that the answer to that question and to the general impact question can be deduced from the first part of the proposal.", "q0r": 3, "q1": "“Roadmap Creation” is listed as a step on the roadmap presented, however, that would have been a necessary step to be included in the proposal itself.\nThe dates presented on the roadmap are not in sync with the Catalyst schedule and the team doesn’t make it clear if they intend to start working on the project regardless of the project being funded or not, or if they already started work.\n\nWithout knowing the exact roadmap how is the Catalyst community to know what exactly we are funding? The general vision for the project is presented in the first part of the proposal, but it’s not mentioned if the requested amount covers all the stages of development.\n\nThe budget breakdown is overly general and covers only a fraction of the total requested budget of 350000.", "q1r": 2, "q2": "Github commits are mentioned in the auditability section of the proposal, but apart from that this section is very sparse, almost none existent. No KPIs are present, no clear metrics to be tracked and verified by the community, no other efforts of self-tracking or reporting are mentioned apart from the Github commits.\nI would definitely recommend including all these elements if a future iteration is ever submitted, as they would be necessary parts of a successful proposal.\nThe very brief definition of success that is given seems unrealistic, especially for Q4, 2022.", "q2r": 2, "assessor": "z_assessor_681", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "It allows musicians and their music to be tokenized, and anybody can buy, sell, and trade these tokens on the blockchain.", "experience": "Over 5 years Software and games development, Over 7 years in the music industry."}