{"id": 403809, "author": "alex.pipo", "title": "cBilling - Cardano Billing DApp", "url": "https://cardano.ideascale.com/a/dtd/403809-48088", "category": 26438, "amount": 49150, "description": "Too few tools and dApp from Cardano support retailers & eCommerce. ADA holders need an app for easily retrieving their transaction invoices.", "f6_no_assessments": 5, "f6_rating": 4.933333333333334, "videos": ["https://www.youtube.com/shorts/ZOf6YCyp2YY", "https://www.youtube.com/shorts/ZOf6YCyp2YY"], "media": [], "f6_assessments": [{"id": 9718, "q0": "The ramifications the proposal brings are immense. The impact this could have on the payment methods through Cardano in a digital shopping-driven world of ours is huge. We have seen a lot of ideas that provides user gateways to pay through crypto coins, but this proposal goes a step further into providing the businesses to download invoices and other billings for various purposes such as taxation which was clearly something that is essential considering the adoption of crypto payments across e-commerce platform. On successful implementation of the proposal, something of this caliber would increase the rate of adoption and inturn traffic across the chains in turn boosting the overall value of the Cardano ecosystem. The proposer also makes points of how they plan to advertise their product through youtube and other channels, thus spreading the awareness of Cardano and its capability to a new untapped section of potential investors and users. ", "q0r": 5, "q1": "The proposer provides the community with an illustrative plan about how the team plans to reach its goals. The proposer provides a quarterly plan along with what short-term goals they intend to achieve along the way. The team is introduced brilliantly and the mix of members it comprises are no doubt experienced in the field and have had prior ventures in the field. The team is also aware of the obstacles they might face and also makes a brief mention of the solutions that can be used to overcome them. The requested fund of about 49k is reasonable and lies within the ranges defined in the campaign brief. The budget breakdown of the same adds more transparency to it and makes the proposal more viable and practical in nature. The expertise of the team and the impact the product could have are clearly on the positive side for the community and the world in general.", "q1r": 5, "q2": "The proposal's final outcomes are well outlined and quantifiable and are based on a properly defined roadmap. The number of users, number of invoices generated, number of plugins created are all measurable and aligned with the expected metrics defined in the campaign brief. However, a few managerial metrics such as cost of quality, productivity, customer satisfaction index, and daily active user to monthly user ratio, customer retention ratio will probably provide more insight during the periodic audit process. The team however has been an active member and was successfully funded in F7 and also has several proposals in the F8 round. But with such a detailed game plan, detailed metrics probably broken down quarterly instead of the just final outcomes would have done the trick and made the entire proposal complete in every way. Hence, I personally feel 4 out of 5 for the auditability would do justice.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 9726, "q0": "cBilling dApps, this is a proposal to create an application on Cardano's Blockchain platform to provide services related to e-commerce through transactions with cryptocurrencies, specifically in this case transactions associated with the ADA coin.\nTo support retail and e-commerce platforms, cBilling builds a platform with very useful functions on it: Invoice builder, Payment services, Retail sale PoS...\nWith the previous success of the proposal in the COTI challenge, the proposal continues to expand the features and inherits the achievements of the cPay project in Fund 7. It is true that there is a shortage of dApps developed on Cardano that support retail and e-commerce as well as online sales. The proposal poses a precise and highly impactful, widespread issue directly related to ADA transactions. The solution to the problem implemented at each stage is Developing APIs, libraries for accessing and creating databases for applications, developing applications, and integrating into e-commerce websites. , develop and improve functions, retail integration, and PoS points. The implementation solution is very clear and reasonable, the proponent has correctly identified the problem and the steps to be implemented in his project. In particular, the author also cites the important code of the project or the steps to build APIs tools with technical solutions (Authentication => API Response => API POST Fields).\nThe functions of the dApp are also fully described and easy to understand.\nA variety of KPIs are identified and listed as\nThe number of wallets that integrate and connect to the cBilling app.\nThe number of downloads of cBilling application.\nThe number of people who use cBilling applications regularly.\nThe number of invoices generated.\nProve that the proposal has evaluated the indicators that need to be implemented to be successful.\nIn addition, the risks are also raised along with it, and the solutions are very reasonable.\nOn top of that, the community creation campaign was also mentioned demonstrating the proposal to care about the users and commercialization of the cBilling product. You guys have come up with a highly impactful proposal and very sublime solutions, keep up the good work guys, I love this project.", "q0r": 5, "q1": "The team behind this proposal is diverse in skills, from software programming to product management to community leadership and development, to marketing and financial management. In addition, many software engineers from large technology companies will support the good development of this project. With many years of experience as the main members of the project, I find that they are highly capable people to ensure the success of the project, especially dApp projects that need a team of technical experts. You totally get it.\nAbove all, they suggested forming a team of talented engineers “ADAboys love Cardano technology”. I went through the team's GitHub link and saw that many of their projects with Catalysts are being actively deployed on it. I like projects that have teams that specialize in technology so it ensures better project development than outsourcing. The way you build the team and engage with the project is very reasonable.\nThe proposal also includes a very detailed development roadmap, many of the tasks listed start from Q2 and develop until Q1/2023, which proves a project with a long-term vision and series. items to be completed. I am not listing those details here, reading more closely I see there are milestones in each step of the logic implementation, from data analysis to application design, application development, MVP releases, and integration into e-commerce platforms. Those milestones are 3-6 months PC version, 6-12 months full version 1.0 which is great with a not too long time to have a dApp with so many useful features…\nWith a total funding requirement of $49K for 6 months of project development, that is quite a modest budget, above all, the cost table is detailed with a detailed description of the payables in the project including the tax and export tax. as server rental costs. I have nothing more to say about this part because you guys did a great job and made all costs transparent. With the above 3 parts about the development team, budgeting, and work routes, I see that you are completely capable of executing this project.", "q1r": 5, "q2": "Governance and transparency in this proposal, Your team has a very methodical working process, in my opinion, you are applying the scrum model to managing this project.\nYou have described very carefully the process of tracking the progress of the project, the working process of the team, and developing the product, it shows very science and logic in the work.\nI'm sure you've used a lot in your previous projects, which makes me feel secure when this project is funded. In addition to applying a great process, you also listed indicators to track the success of the project with milestones such as: Built a database system for cBilling dApp development, Complete the invoice forms, Build plugins for webshop platforms…\nFinally, here is the proposal that is part of a large project for you around the Cardano blockchain platform. cBilling is a key component of many of your major software platforms. I also clicked the links you provided to check out these very good projects and potential for the Cardano ecosystem. It is important that you have built a team with technical expertise working with the Cardano blockchain technology and are able to do even larger dApp projects.\nI love this proposal and support you to develop it for the catalyst community to use and enrich Cardano’s dApp ecosystem.", "q2r": 5, "assessor": "z_assessor_755", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1495, "q0": "Having an easy way to integrate with ada payment for individuals and SMES are essential for Cardano as they are the majority. Personally, I support the creation of such app as proposed in this project. I believe this DApp will help to attract more users/investors to join Cardano ecosystem. The benefit this DApp brings to users and community is clear and undeniable.", "q0r": 5, "q1": "Core team profile looks great. They have both senior develpers in software development and Blockchain in the team, which is a guarantee for the successful implementation of this project. The team is well organized with defined roles for members. The project roadmap is clearly stated with specific targets that the project have to achieve in both short and long terms.", "q1r": 5, "q2": "The estimated cost is divided by small sub-tasks and software modules, which I think clear and tractable for 9-month project. the metrics to evaluate the project output are also clear and sufficient and I have no objections on that. ", "q2r": 5, "assessor": "z_assessor_1385", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8771, "q0": "Problem statement Too few tools and dApp from Cardano support retailers & eCommerce. ADA holders need an app for easily retrieving their transaction invoices. Solution to build an invoice management application for crypto transactions on the Cardano blockchain platform. Invoice, send bill, export, QR code, PoS. Cryptocurrency payments will be analyzed in depth and stored in the database of the cBilling software system. From these data analysis algorithms, the data will be refined and queried to serve the functions of the retail and e-commerce industries. Like accounting, sales invoices, taxes, exchange rates. This will help develop units and individuals using electronic payments, now there are many dapps built to analyze transactions of individual e-wallets for investment instead of serving. for commercial payments. I find it interesting to integrate crypto payments with PoS machines for restaurants and retailers. The proponent gives 4 risks with clear solutions, it would be better to add security information when users use this system", "q0r": 5, "q1": "The project's development plan and roadmap is implemented in 4 quarters and ends in the first quarter of 2023. The work items to be done are very clear, I appreciate this information. The proposed cost has 2 main parts which are the quantity cost for the positions that perform the work by the hour and the appropriate unit price in addition to the required hardware cost in 6 months, so after 6 months, this cost will be provided. From what source? The project's team includes people with experience in the related field, the information of each member is provided in full, easy to verify.", "q1r": 5, "q2": "The proponent also states to use the scrum model to manage and track the progress of cBilling dApp development. There are also other metrics (Number of plugins built and deployed on E-Commerce platforms / Number of invoice forms created / Number of users, number of people downloading the application). The team also submitted 5 proposals at fund 8. The team also sponsored 2 projects at fund 7", "q2r": 5, "assessor": "z_assessor_697", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10286, "q0": "This is a project with great potential. It builds an invoice management application (with the name cBilling) for crypto transactions on the Cardano blockchain platform, invoice, send bill, export, QR code, PoS. It has effectively solved the challenge (cryptocurrency integrated into the application, number of downloads, number of uses, number of wallets connected to cBilling,...). It will impact and attract a large number of users with the audience being individual customers and retailers, e-commerce.", "q0r": 5, "q1": "Information about the team is very complete and detailed. It can be seen that your team consists of many members, each member has full knowledge, skills and experience in many fields: blockchain, software, cloud engineer, marketing,... Together, they have certain successes: funded at fund7, influential in the community, worked in many large companies and organizations, held important positions,... Contacts are also described specifically This increases the transparency of the team's information. Besides, with the help of COTI leading technology engineers, I fully believe that this team can carry out the project.\nThe project roadmap has been provided, it is very specific. This makes it much easier to identify the tasks in each stage. Risks and challenges are also listed, and I appreciate you identifying ways to reduce those risks. Reasonable and transparent budget allocation (determining specific hours of work, salary for each hour). The indicators to measure the progress are very complete, it makes it easy for everyone to track and evaluate the progress of the project.\nHowever, I went to the link you provided: \"https://github.com/adaboys/cBilling\" , it looks like the site is empty, it says \"This repository is empty.\" The time I access is March 22, 2022 (Vietnam time). If this is my mistake, I sincerely apologize!", "q1r": 5, "q2": "The information about the project is provided very complete and detailed. This will facilitate the assessment of its success. Personally, I fully believe in the success of this project. This is a very valuable project, if successfully implemented, it will certainly bring a lot of value (creating a total solution for the retail, e-commerce, and online shopping industry based on transactions via cryptocurrencies), contributing to the outstanding development of the Cardano ecosystem. Thank you for a great proposal!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Build an invoice management application for crypto transactions on the Cardano blockchain platform. Invoice, send bill, export, QR code, PoS", "experience": "We are computer science and software engineers, who have worked with many years of experience, specialized in software development, bigData analysis, AI, Cloud computing & Blockchain technology.\nwe are creative startups such as Games, Apps, dApps, eCommerce applying blockchain."}