{"id": 403924, "author": "rhysstoic", "title": "FreeLoaderz Token & NFT Distributor", "url": "https://cardano.ideascale.com/a/dtd/403924-48088", "category": 26438, "amount": 25000, "description": "Token Distribution is difficult to manage and often becomes very expensive for users and the network", "f6_no_assessments": 6, "f6_rating": 3.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 555, "q0": "FreeLoaderz would be a useful addition to the Cardano ecosystem, ISPOs / SPOs have become a very common way to distribute tokens and spending hundreds of ADAs to distribute tokens to eligible addresses can be a challenging process, especially as the number of those entitled. Currently there is a project that was born from a similar idea and has had considerable success, showing the need for this type of services, 85 tokens distributed for a total of 586,982 claims and 16991 registered users (data reported on their site as of 19/3/2022), but with FreeLoaderz there would be two big difference: NFTs distribution and, in addition to the possibility of claiming by users, projects that have to distribute tokens would be provided with the possibility of distributing their tokens to those entitled to it with extremely lower costs and ease, as shown in the video attached to the proposal. it is also essential to note that the costs (albeit low) and the commitment to claim the tokens, perhaps by a certain date, would no longer fall on users.", "q0r": 5, "q1": "I believe that the objective of this proposal is feasible, the times indicated for the achievement of the various objectives are short, but they seem concrete, considering that at least part of their product has already been developed, and as highlighted in the proposal, the main challenge will be to make to know and make their service used by projects and general users, in any case a realistic and achievable goal if the quality of the product is high. FreeLoaderz currently comprises a coalition of 53 stake pools, which have made public url api access to their relay servers to help improve transaction speed by opening up ports to user wallets. They have a website and active social channels that now have a limited number of users, but since their product is not yet available it is absolutely understandable. In conclusion, the proposal presented is clear, more details could be added on the objectives already achieved and on the marketing strategies, but it seems to me likely that the proposal will be successfully implemented.", "q1r": 4, "q2": "I think that the parameters indicated to evaluate progress and success are certainly important, but it is also important to consider the number of addresses that receive the tokens from the various projects, and even more important the number of different users who claim the tokens directly from the platform; other minority parameters could be the number of stake pools with which you will be able to forge partnerships and the total value distributed in ADA, I think it could also be interesting to calculate the savings in transaction costs compared to transactions without your service. Also, I noticed that you mention your Github as one of the main progress and development measures, I saw that it is reachable from your Discord server but I recommend including a link in the proposal or at least on the site.", "q2r": 3, "assessor": "z_assessor_1187", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 595, "q0": "- A simple solution that takes advantage of the features of the Cardano platform, bringing high efficiency, very suitable for the challenge. Project owners who do not need to be technically savvy can participate.\n- Reducing costs makes it possible for IDO projects to distribute tokens or Airdrops to users at low cost and fast speed, limiting transaction congestion. Users also benefit from trading multiple outputs with just one input with little cost and fast speed.\n- Solving the big problem in trading NFTs is high fees. Help develop the Game market, register copyright and many other areas that need NFT.\n- Reducing the load on the system, making the system operate more efficiently. Attract users as well as project owners to participate in the system more because of its convenience, fast and cheap.\n***Suggestions/ advices:\nMake more videos of many possible scenarios with 1 transaction to clarify, compare the cost effectiveness, speed between integrated to the FreeLoaderz SPO Coalition and not integrated.\nThis will help project owners as well as users have a better insight into the benefits of the project.", "q0r": 4, "q1": "- A clear implementation schedule for each weekly milestone is also very reasonable for evaluation.\n- 8 weeks to build web interface, improve UX UI without detailed solutions as well as specific indicators to measure.\n- Marketing plan is quite general, needs to be more specific.\n- Sections 1 and 2 are reasonable in terms of time as well as budget.\n- Section 3: Marketing is an important factor determining the success of the project, so it should be more detailed. The proponent needs to clearly state the marketing channels that will be used, and how much time to use the specific distribution marketing channels? Marketing implementation resources for the project.\n- Section 4: The proponent stated the idea for the long term, but it is still general and not specific.\n- The project provides information, linkedin of members on the project website\n- Mr. Chris Nunez has very detailed and specific information about experience and capacity. This is a plus point in terms of capacity as well as transparency of the team.\n- Mr Ryan and Mr Jim have sketchy information\n***Suggestions/ advices:\nThe project should add some additional content:\n- 8 weeks to build a web interface, improve UX UI requires more detailed solutions, what indicators will the project rely on to evaluate and to do this.\n- Add specific marketing channels to be used (medium, youtube, google, facebook, ...) The marketing strategy will be to use parallel marketing channels at the same time or will use them in turn in each specific period. how and why? How are the execution resources allocated? What are the desired results after implementing the marketing plan? It is necessary to have specific indicators to evaluate the success of a marketing strategy.\n- The project needs to be more specific about how to attract the user groups that the project is targeting.", "q1r": 3, "q2": "- The project has its own website, github \n- The project has not yet given the number of commitments in each development stage\n- Indicators of project success are still general\n***Suggestions/ advices:\n- The project should have a tool to measure specific indicators of the proposed solutions\n- The project needs to provide a minimum number of specific commitments such as: the number of projects, the number of users who will participate in using the dapp in each phase. And the project has a tool to measure and check these indicators.\n- The project needs to provide a specific minimum commitment number of projects as well as users who will participate in using the dapp in each phase and have a tool to measure and check these indicators.", "q2r": 3, "assessor": "z_assessor_1192", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1637, "q0": "The proposal is a solution to reduce Tx transaction fees when distributing airdrop tokens from DApp and Web3 projects by aggregating multiple inputs and outputs into 1 Tx. The project shows the effectiveness of being able to solve the cost problem of airdropping a large number of tokens, a simple solution that does not require too many programming skills. The proposal fits perfectly with the challenge \"DApps and Integrations\" presents. I quite like this idea.", "q0r": 4, "q1": "I completely agree with the work plans proposed by the team presented here.\nThe project will be divided into 4 phases and each phase will last for how many weeks (listed) => Make it easy for voters, community advisors to evaluate.\nI have a small suggestion about the marketing plan of the proposal, the proponent should make each task clear. For example, week 1: AMA with the community. Week 2: uploading short interview clips about each member, about technique on youtube, etc\n\nAbout the budget: I think the proposal will be more convincing to the voter if it is possible to provide here a detailed explanation of each cost per activity.", "q1r": 4, "q2": "I would agree with the project more if I could include specific numbers to measure the success of the project. For example, there will be 10 projects introduced and launched/distributed through your platform.\n\nIn addition, voter can check the work efficiency and work progress through the project website => good point", "q2r": 3, "assessor": "z_assessor_1394", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4490, "q0": "This proposal clearly states how it uses the potential resources to maintain the load of the transactions. So yes it does address the problem statement quite clearly.", "q0r": 5, "q1": "The actionable plan that is laid out here, precisely explains how they assemble the transactions together. But I do have to agree that marketing will indeed be their biggest hurdle to jump. I have personally had interactions with the proposer. I personally support their progress. I have not invested with them though. Only conversations about what they are doing and what they plan. ", "q1r": 5, "q2": "I've personally never used github. So I'm not exactly sure how it works. But I did just look into it. And from my understanding GitHub/KanHan provides what is needed to collaborate with others. So I feel that it is easy to follow the progress of the project. The proposer also is going to show number of onboarded, distributed, and successful projects", "q2r": 5, "assessor": "z_assessor_1733", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6620, "q0": "I think that this project is needed and can be a good addition to the cardano ecosystem. So the proposal is composed of a group of SPOs that want to make the process of token distribution in the cardano network easier. Although this can be a good idea, I recommend to the proposer to add more content to the proposal. Luckily I have found more information on the website. For this reason, I can give a rating for the impact.\n", "q0r": 5, "q1": "The proposer did not do a good job writing the proposal but thanks to the website, I have gathered information that gave me confidence in the successful implementation of this proposal. They have provided the linkedin of the team members linkedin profiles. They also have included the list of SPOs participating in this project which includes ADAOZ who produces great content on youtube about the cardano network. I recommend to the proposers to add to content available on the website to their proposal. \n", "q1r": 5, "q2": "I think that this proposal is auditable. The proposers have added a roadmap with milestones to complete the project. They have also included metrics such as github commits to help track the progress of the development. Altogether, I believe in the auditability of this project.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9719, "q0": "The NFT and tokens distribution has been the most sought out feature by every user looking to get rewards or incentives through drops and would love for this process to be as cheap as possible for both parties. The proposer provides a solution in the form of a platform whose capabilities can be leveraged by any application. Even though there are a lot of similar proposals this time, the team having a built-in FreeLoaderz SPO tool already available adds more value and viability to the proposal. The risks of not reaching enough audience is certainly an issue to consider but the team has promised to make a separate marketing plan to handle it in the later stages. But considering the gravity of the issue addressed and the criticality of the need for such a DApps compared to the others in the challenge, I would say a 4 out of 5 would do justice to the impact parameters.", "q0r": 4, "q1": "The action plan of the team is very fuzzy and the milestones set are very dull and inconclusive. The terminology used by the proposer isn't very descriptive and any reader would find it hard to identify the deliverables they can expect at the end of each phase. The budget requested even though is very small in absolute value, with no clear breakdown might not be just and sensible for the community to assume that it is put to the right use and cause. The team only mentions the required number of developers, but no one is introduced to the community and hence provided all the above observations, I feel it is very hard to make an assessment on the feasibility metrics of the proposal. I suggest the proposer returns with a more elaborate plan in the upcoming rounds.", "q1r": 2, "q2": "The team provides the community with appropriate tracking methods such as git commits, sprint boards, number of onboardings which are all augments of the development activities and highly appreciated. However, the success criteria and the outcomes of the proposal look very weak. There is hardly any information to draw assumptions regarding to what extent the proposal complements the challenge's success metrics. The proposal is an entirely new one and should have provided more details on how the audit process would be assisted to make it more meaningful and relevant. The KPIs are fuzzy and indefinite and with insufficient detailings, I have my doubts regarding the success of the proposals and the kind of impact they would have on the Cardano ecosystem.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Develop the FreeDropz Reward Distribution platform to provide a dedicated service to projects using FreeLoaderz submit-api Load Balancers", "experience": "A Group of SPOs operating under FreeLoaderz.io with software devs, front end devs and network admin experience, all working together by sharing skills and collaborating on this project."}