{"id": 404192, "author": "jhedai19", "title": "Cardano Rewards Program", "url": "https://cardano.ideascale.com/a/dtd/404192-48088", "category": 26438, "amount": 25000, "description": "Edu&tech barrier for adoption\nB&M businesses sale dropped\nReward programs are old & non-engaging\nLess funds in public schools\nData exploit", "funded": 1, "upvotes": 29642991, "downvotes": 16583776, "votes_result": 13059215, "votes_cast": 95, "f6_no_assessments": 4, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"id": 10622, "q0": "This proposal could benefit from a simple and easy-to-understand user's journey, both from the perspective of the customer and the business partners. Clanity is self-described as Yelp with rewards, but there is a disconnect in the proposal on what it means. Do I get rewarded when I leave a review? On a basic level, my understanding is it's a customer rewards program whereby every purchase from a business partner will be rewarded with $CLAN. I would like to understand more of the tokenomics. What's shared on the website shows: 20% for founders, team members, advisors; 20% for technology development & marketing; 10% for partnerships and events(where I assume the rewards will be from); 10% for foundation grants(also for CEX/DEX listing which is confusing); and 40% for liquidity providers and stakers. Liquidity providers will want to be rewarded for providing liquidity and stakers want to be rewarded for believing in the project long-term. Where will the customers' rewards come from. A side question would be, how does the ecosystem accrual value into the token? More details on this aspect of the project would build confidence within voters/readers of this proposal. I also think it would increase interest in the Cardano ecosystem and bring in more pre-sale buyers.\n\nIt gets a little confusing in the proposal as it also mentions Clanity will eventually allow the purchasing of goods and the monetization of data. For the former, details on PayCLAN would be helpful. And for DataCLAN, how will it be done? Does it require trusted parties or Atala Prism? Sharing technical details in an easy-to-understand manner in the proposal would help voters/readers see the widereaching impact of Clanity.\n\nThe idea of a customer rewards program and a payment gateway built on Cardano would be very impactful. It could increase the number of transactions done on Cardano and widespread adoption. But due to the proposal lacking details, I have given the rating above. ", "q0r": 2, "q1": "The roadmap to an MVP with milestones included could be included to strengthen the proposal. A referral program could increase the number of $CLAN holders and outreach so I think it's a good idea. But is it coming from the 20% marketing or somewhere else? \n\nMVP will be completed in a month, but the proposal should include projected completion of the product. The team and advisors' tokens are also vested for only 6 months. It could help confidence in showing when vesting period begins. Has it started, or will it start once complete product releases, or after pre-sale? \n\nThe budget breakdown is lacking details. 5k will be for marketing and 5k for prototype. Then the proposal mentions \"this partnership will also allow $CLAN to be available...\", what partnership is this referring to? More details would help readers understand. A payment gateway partnership with a reputable company would make this very feasible. But it is left vague in the proposal. \n\nThe team has an extensive and comprehensive background with linkedin and github links to their profiles. ", "q1r": 3, "q2": "The measurement for success is included. Some quantifiable projected numbers would help the proposal. It seems too unrealistic(for now) to have every store adopt Clanity when the proposal is proposing an MVP, and crypto adoption still at the beginning stages.  The company has a website where things can be tracked by the community and the dev has a github page. ", "q2r": 2, "assessor": "z_assessor_948", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1413, "q0": "Cardano Rewards Program proposal addresses the challenge DApps and Integration by onboarding mom&pop stores so users can locate them in the app. Then app users can engage them in social media or visit/purchase in store to gain reward. There is one big concern about this proposal is that it mentions that the token can be used to buy and sell data. Normally the consumers will get the option of opt in/ opt out of promotional materials. Their data shouldn't be sold liberately by the seller stores. It really raises a question as to how this token can be used to purchase data. Due to this unclear approach in solution, there is a limitation in DApp impact to the Cardano Ecosystem.", "q0r": 3, "q1": "Although the proposal has quite clear roadmap with token KYC and NFT selling and partnerships. The budget doesn't show a clear breakdown of how the total requested fund of 25,000 comes from. It is unclear how many working hours involved in the project and what are the role of each person in the team. The proposal would improve if the team could incorporate this information next time. ", "q1r": 4, "q2": "The project uses the number of businesses and users as the key metrics for measuring the success. They want to see Clanity using around the World and turn into self organized DAO. The proposer understand the problem clear. The solution (approach) is aligned relatively well with the problem statement. The proposal will need to provide more metrics like app download or number of transactions that occur within the app to monitor performance and whether the project would be a success.", "q2r": 3, "assessor": "z_assessor_1358", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2047, "q0": "From my understanding, this proposal is to help incentivize users to find different Cardano projects through this app? And there will be incentives in forms of staking rewards to join their project? If so, I think this could be a good idea because there are currently so many Dapps being built on Cardano, but it may be hard to hear about them all. This could be a form of a launchpad, just different from most launchpads. I give this section 4 out of 5 stars given that it will help these upcoming projects and businesses to gain traction. ", "q0r": 4, "q1": "I like to see that the team was able to give their names and list their experience. This is one of the most important parts that can be listed for this section of the proposal. It allows the readers of the proposal to find out information on the team to help determine how successful this proposal would be if funded. I like to see that the team has a lot of experience in marketing and leadership. This will help them to promote their proposal and allow readers to understand what the team strives to accomplish. Giving this information also allows the community to help the team stay accountable to creating this Dapp. For this reason, I give this section 4 out of 5 stars. ", "q1r": 4, "q2": "There is a lot of good information given. I have been slightly confused with the idea of creating the $clan token. Will this be the native token that you give as an incentive for people to join these other businesses? If so, I think that this could work. It would require a lot of good marketing strategies to get the community familiar with this project. The roadmap was written very well. There is a lot of information that details exactly what the team plans on accomplishing if given the requested funds. I also like to see the detailed budget breakdown. After looking through it, the numbers match up with the requested funds and there is a clear explanation on why these areas need to be funded in order for this proposal to come to fruition. I also like when I see that most of the requested funds will be going back to the community in form of a reward program. I give this section of the proposal 3 out of 5 stars mainly because I was confused with a couple of the areas such as the $clan token and exactly how that is going to work. Hopefully if I have misunderstood there will be another assessment that gives more information. However, based on my ability to look at the proposal and focus on the good of this project. The team information is really great and so is the budget breakdown. ", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7451, "q0": "I disagree that this proposal fits the objectives of the challenge. Because here our goal is to finance projects that are at the same time good for East Asia, helping this region of the continent to develop economically, socially and if possible environmentally (or at least one of these areas) so that our blockchain can also increase in level of popularity and investments. This proposal is about creating a token that would have multiple use cases; would be these “staking - users will earn rewards by betting + purchase promotions - business partners can use token to buy more social media promotion + buy goods - eventually can be used for payment + purchase data - use as payment for purchase /data sale”. But how will this specifically help East Asia and its inhabitants? Really, I can't see what the direct benefits would be for this location and its natives, so I think the proponent should make it clearer why she chose to launch this proposal in this challenge. It doesn't seem in line with the metrics here, maybe this project would fit better with the Dapps challenge, for example. Therefore, as much as the application is useful for Cardano, it would be meeting only one of the facets necessary for the challenge to be adequately addressed, with that, I will unfortunately give a low note for the impact. \n", "q0r": 2, "q1": "The presentation of the team is really excellent here, as we know the names, roles and professionals and very extensive explanations about the curriculum of those involved. With that, I think there is a lot of confidence in the ability of this team to execute the project safely. Some members have more detailed explanations than others, but in general, we have enough information on everyone, so I have nothing to criticize on this part of the feasibility. In my opinion, she is perfect. Now talking about the script, I think the proponent explains very well what would need to be done, detailing a lot about the activities that would take place. We have a solid understanding of what the process would be like, the problem I identified was that a well-established temporal relationship is not traced, that is, even though we know exactly what would be done, it is not so clear when such things would be done. And really, I believe that for the script to be perfect, these two parts would need to complete each other. Finally, speaking of the budget, the total amount is divided into 3 parts, the last one (Payment Gateway Balance for fiat-crypto is $15,000) could be better specified. Why would that cost $15,000? The first two could also contain more details, but it was really in this last installment that I was a little confused, without understanding exactly what would generate the expense, it is not so clear to us readers what that would be. Therefore, I think the feasibility is average, presenting some correct points (the team presentation stands out) but also others to be improved (the notion of time in the script and the explanation of this final value). \n", "q1r": 4, "q2": "I don't think auditability of progress is adequate because the proponent says it will base itself on numbers to understand if the partial results to be achieved are actually being achieved. I think we should also have some way of auditing the tasks of professionals, tasks that would generate the goals to be analyzed. Both parties are required to be evaluated. It is necessary for the team to prepare monthly reports, for example, on how their work routines have been, and make them available to the entire Cardano community. Regarding the final results, in my honest opinion, the goal is very ambitious: “The success of the project will be to see this in every store, in every country in the world and hand it over to the DAO so that it can run on its own. . We will continue to achieve this.” How can we more accurately and objectively measure whether the project is actually being adopted by stores? It would be interesting for the team to do some research gathering information about which stores are using the technology and in what way. It is also essential that the team analyze the direct impacts of all this for our blockchain and also for East Asia, after all, these are the two pillars of the challenge. How has this proposal contributed to the greater adoption of Cardano in this geographic region? And how has this impacted the lives of the locals? All this information must be measured precisely and brought to the Cardano community in a simple and appropriate way. Unfortunately, I don't think the auditability is enough for us to accurately monitor the project. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Easy to use app\n\nPromote businesses by offering rewards\n\nUse blockchain & socialmedia\n\nSupport low funded schools\n\nUsers own their data", "experience": "I have been in the startup space since 2012 and graduated from a Silicon Valley Accelerator Program. Been in the blockchain space since 2016 and I became an enthusiast after transferring my first crypto. I have experience in leadership or management role and project management."}