{"id": 404418, "author": "elliot.crabtree", "title": "Shimmy - Safe, Purposeful Social", "url": "https://cardano.ideascale.com/a/dtd/404418-48088", "category": 26438, "amount": 95000, "description": "Social media should be safe, decentralised and purposeful. However, data privacy, misinformation and lack of ethics are causing drastic harm", "f6_no_assessments": 5, "f6_rating": 2.6, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers want to build a better social media that is decentralized and that will propose better content. Decentralized social networks already exist and I think that it can be a good idea. However, I think that the explanation of the impact is a little thin. I think that the proposer should have explained better the benefits of this social network for the end users. For instance I want to know if the users get incentivized to create the content, because this can make a big difference on the success of this project. I think that the idea is good in general, but I recommend to the proposer to add more informations.", "q0r": 3, "q1": "I think that the proposers have done a good job providing a timetable of 6 months of desired achievements. However, I recommend them to break down the budget a little bit more. Regarding the team, they have 4 out of 5 of the profiles needed to complete the work. Altogether, they have done a good job providing the information needed for a successful implementation.", "q1r": 4, "q2": "I think that this proposal needs to be improved in the auditability department. To help track the progress of the proposal, one of the metrics that I recommend to the proposers is to periodically publish updates and reports on the development of the project. Other than that, the proposers have added a roadmap with milestones for up to 6 months. They also have metrics that define the success of this proposal. Altogether, besides minor improvements, I think that the proposal can be audiatable.\n", "q2r": 4, "assessor": "z_assessor_439", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Impact/ Alignment: The explanation of impact is largely self explanatory as it is the primary purpose of the platform and what drives the project. The users do get incentivised to use the platform via the $SHM Token and invite mechanisms. \n\n"}, {"q0": "The proposal identifies a relevant problem and gives broad context through links to articles and papers that corroborate the indicated problem. Social media has been a big challenge due to security, privacy and social issues. Some projects are trying to solve these problems through different approaches, including through blockchain tech, such as LBRY/ Odysee and Steemit, but a major obstacle has been UI (user experience) which, due to the use of blockchain, ends up making the experience less fluid and interactive.\n\nSocial media dapps have been around for several years and so far none has achieved wide adoption, there are major challenges for a social media dapp because when they try to look for privacy and decentralization in many cases it opens up space for bots and a bad user experience, this is because applications created based on blockchain technology are not so fast as they depend on a decentralized structure and in many cases on p2p sharing, which ends up limiting data/bandwidth communication.\n\nThe definition of success is too subjective, it is not possible to envision the potential for impact. I recommend that the proposer use a simpler and more objective definition of what the proposal seeks to deliver as output.\n\nThere are several success metrics, but the ones that have targets that can bring some sense of potential are:\n\nAVG. Per quarter member growth (+33%)\nTransaction growth rate (+33%)\nActive members (+100,000 Q4 2022)\n\nThe first two are not good indicators, since there is no initial number of established members. A 33% increase for a social network that has 10 members, for example, can indicate almost nothing, so what remains is the number of active members, +100,000, which I consider a relevant goal for impact on the challenge. Although the goal of reaching +100,000 members is very positive, there is no information about the marketing or development plan for the dapp, which brings uncertainty about the team's ability to deliver the goal.", "q0r": 2, "q1": "Regarding the team. There is mention that two team members, Daniel Tan and Franklin Lee, have experience as Senior Blockchain Engineers, but when checking their Linkedin I could not find anything related to development related to blockchain technology.\n\nOne point that caught my attention is that comparing Franklin Lee's profile picture on Linkedin and the file attached to the proposal, they seem to be different people.\n\nThe link to the Linkedin profile of the proposer and Founder - Elliot Crabtree is broken.\n\nOn the website https://shimmyapp.com/ it is possible to find some information about the project, but there is no information about the team.\n\nDue to the lack of information and reliable sources, it is not possible to confirm that the team has the necessary experience for the development of the project.\n\nThere is a detailed budget breakdown in several items, but some information raises doubts about the feasibility of the defined budget.(According to the proposal, the team intends to carry out a token sale, so it would be important to define exactly what the budget requested in this proposal is for.) There is no estimated workload for the development of the mentioned steps and the costs for developing a functional social media dapp seem much lower than expected, as this type of application would probably involve hundreds of hours of development, which would consequently involve development costs far above what has been established. I would recommend that the proposer better define the specifications of the dapp and development steps so that the budget assessment has a solid basis for comparison.\n\n\nRegarding the roadmap, the proposal describes a timeline with several monthly steps over a year. Some milestones were included, but no dates were associated with these milestones (there is only mention that they will occur in 2022).\n\nConsidering that this challenge is about Dapps, it is important that the focus of the roadmap assessment is on the delivery of a dapp. The timeline indicates several steps related to marketing campaigns even before the launch of the alpha and beta versions, sale of tokens and listing on exchanges and the technical development steps were mentioned the development of the MVP in the first 10 weeks, test versions and despite the dapp launch is not on the timeline, it was mentioned as a milestone for 2022.\n\nDespite the various steps mentioned in the timeline, I would recommend that the team focus more on presenting a detailed plan, both in terms of marketing and the development of the dapp, as without this information it is not possible to understand the feasibility of the roadmap presented.\n\nIn the project documentation I could see that there is an intention to use AWS as a back end, which is a problem for any dapp that seeks to bring a decentralized social media alternative. Back end in AWS brings fragility because users and the application is subject to censorship. We already had a case where a social media application called Parler was removed from AWS. Many people argue that a dapp that depends on a centralized framework like Amazon's AWS could not be considered a decentralized application (dapp) and I am among those, as this is a risk that was not considered in the proposal.", "q1r": 2, "q2": "There is clarity in the description of the problem, but the solution presented needs more clarity. The team mentions that it intends to conduct a token sale, so it is important to define the scope of this proposal and for which stages of development exactly the team is requesting funds.\n\nThere is a timeline with monthly deliverables/steps, but the mentioned milestones do not have specific dates, only the mention that they will occur in 2022, so they do not serve as milestones technically speaking\n\nRelevant metrics were defined, but only one relevant KPI, which would be to reach +100,000 members on the dapp in 2022. Many of the members on social media are bots, so this KPI could be compromised. I would recommend including more KPIs to facilitate project auditing.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This is a proposal  that requests funds for building a Decentralized social media platform called Shimmy. We all know that the current platforms are rife with problems such as misinformation, data leaks, censorship and a general lack of ethics and the proposer aims to build something better to replace them.\nWhile the idea sounds very good on paper, there are extremely few details to go by in the Impact section. First of all, a SHM token is mentioned, stating that “It enables users to create impactful content that sews the seeds of positive change and development across active communities”. I think the proposer should have provided a lot more details here, because I’m only left with questions: do you need this token to create content on the platform (create posts)? Right now there are Twitter competitors like Gettr and Truth Social which are trying to enter the market and are having really big trouble gaining traction, all while being normal, free apps (not blockchain based where you need crypto to use them). I’m sure anyone can understand what a huge impediment this approach would be to Shimmy having the impact it wants to have on Cardano and social media in general. Another question I have is: How will it “sow the seeds of positive change across active communities”? This sounds all nice and good but there is no explanation to substantiate the claim. The rest of the impact section continues on in the same manner, presenting lofty goals without any description of how they are to be achieved.\nAs risks, the proposer identified 3 issues: \n- the fact that the budget might be too small (which, as a person with 7 years of experience in IT, I can guarantee you is true - you are not building a twitter competitor with 95k USD), which they intend to mitigate by being very focused with their resources until they deliver an MVP (minimum viable product).\n- “international regulatory requirements & rules”, which is a valid concern, but no details are provided on how they would try to mitigate this risk\n- “communication challenges” caused by development being open source and the team being remote (no ideas for mitigation have been provided here either).\nTo sum this section up, the proposer has provided only general goals, not a concrete action plan and the case has not been made for how this project will bring value to Cardano, or indeed, why it requires blockchain technology at all (it’s still unclear why the SHM token is needed). I disagree that the proposal effectively addresses the DApps and Integrations challenge. Score: 2.", "q0r": 2, "q1": "The proposer has provided a detailed timeline for the next 6 months and summed up the milestones for 2022, giving a good overall view of the work that needs to be done here. The budget is also broken down in a decent amount of detail, with almost half of it going to marketing (which makes perfect sense), but which only leaves 60k USD for development. As I mentioned before, I have experience in this domain: we recently created an MVP for a lending app for a client and it took 5 months with a team of 8 people (2 QA’s, 4 Developers, 1 DevOps, 1 Scrum Master) to do just the UI of the app - the API backend was done by a separate team. The point of it is that this simple project cost our client over 50k USD per month (just for our team of 8 people). I have trouble seeing how the proposer would be able to accomplish their goals here in 6 months with 60k USD and the listed people: 2 blockchain engineers, one DevOPS which is still to be hired (for database and infrastructure) and the founder (I’m not including the marketing person in this, because we’re talking about the development for the app). If you have a separate funding source, this needs to be mentioned for clarity.\nThe proposer has provided details about themselves (note that the link to your linkedin is broken, I had to google your name) and the blockchain engineers and there are some serious issues here: Daniel Tan seems to only have experience as an IT Analyst and consultant, alongside some project management (so no blockchain or even development experience at all), while Franklin Lee seems to be a lawyer or something in that area - again, no development or blockchain related experience.\nDue to the above issues, I have serious doubts this proposal is likely to be implemented successfully. Score: 2.", "q1r": 2, "q2": "We are provided with quite a detailed list of KPI’s, that also have clearly set targets (for example 100k active members by Q4 2022, which is very ambitious, 33% user growth per month etc), but I also must mention that this list contains an item that is not a KPI: Penetration Testing. This is a constant part of development and if you wanted to add it as a KPI, the wording for it should have been: “Completion of security audit by a specialized company” (which seems to be Soken.io). While these are good KPI’s in themselves, I’m concerned by the fact that we are not provided with a Github and it’s not clear at all if this project has even started (I cannot find anything except the rudimentary website: https://shimmyapp.com). \nSuccess for this project, according to the proposer, looks like achieving global exposure and positive impact, delivering value to users and ultimately creating a better social media app. Again, these are general goals and hard to define in terms of tracking. A more realistic and specific measure of success could have been: having a working MVP with X number of users and a basis for continued growth.\nAs I mentioned, I have serious concerns about important parts in this proposal and even though we have some information in the auditability section, I can neither agree nor disagree that this proposal will be easily auditable by the community. Score: 3.", "q2r": 3, "assessor": "z_assessor_546", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "The idea is very abstract. The main objective is to create a decentralized, safer social network with positive content that is socially engaged, from what I understand. However, several important things are not clear: what kind of content would these be? How would Cardano technologies be used here? Of course, the proponent says that the social network would use a native token minted on our blockchain, but this is mentioned superficially. I cannot understand why it is a decentralized network and how it relates to the various technologies of our blockchain. Thus, I cannot visualize the specific objectives of the challenge being contemplated. I don't know why people would be attracted to this social, what is its differential for the public in relation to the others; what kind of people would they attract and whether they are likely to become active members of the Cardano community; it is not clear if somehow Ada would be used here, if this application would work in the greater adoption of our currency and smart contracts... Anyway, everything is a bit abstract and superficial, unfortunately.", "q0r": 1, "q1": "The script is satisfactory. Listed are some activities that would take place monthly. Although not as detailed, we were able to understand the general scope of the development process. So my suggestion would just be to increase the degree of specificity, but what is presented is not bad. However, when it comes to the budget, this part already leaves more to be desired. A lot of money is asked and it is divided into some parts that are not well explained. Because they are high amounts, it would be necessary for each one to be very well detailed. We were unable to understand with solidity and specificity how the requested budget would be used. For example - why would the legal part cost 3 thousand dollars? Team members are also presented in a very shallow way. Only their names and roles in the project are said. We don't know how they relate to Cardano or even past experiences, so trust isn't passed on to the team. The only part that I found really good here was the script.", "q1r": 2, "q2": "Speaking of the progress of the steps, various metrics and partial results are provided. What was missing was a better detail on how all this would be communicated to the Cardano community. That's a lot of qualitative and quantitative data - how would we know all of this with any frequency? What format and means of communication would be used? Speaking of final results, I believe that the proponent is very focused on the success of the application and not on the reflexes of the project for Cardano. It would be essential for us to know if the specific goals of the challenge were met and how it all benefited our blockchain. In general, the auditability is not bad, but it also has a lot to improve, especially in the second part. I suggest that meetings be held so that the community is always aware of partial updates and, when applicable, of the final result of the project.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Social media platforms providing options for owners to monetise their posts, restrict access based on many parameters and define an economy by a Cardano Token called $SHM has been proposed. The plan is ambitious and might provide some unique opportunities.  However similar capabilities are common in the non-crypto world, and the unique reason why mass adoption of the same is possible with Simmy need to be included in the proposal. There seems to be no major compelling reason why the user should trust Shimmy. Since it's a web app (WordPress) is it going to store user data in a centralised manner?. There is a need for clarity in this respect. ", "q0r": 2, "q1": "The proposal is by three people with substantial technical and professional experience the business document is daily clear and a case has been made. However, details on the technical side and the risks associated with the development of such a large scale system is required to be studied and brought out in detail.", "q1r": 4, "q2": "The proposal includes 15K USD for project management and 10K for advertisement, 10 K for airdrop and 5K for community management. 40K for non-development tasks and also 10K for a listing of tokens in exchanges. More than 50% of the fund requested is for non-development tasks. This does not seem to be in order. The specifications of the product and the UX is also not explicit leaving scope for interpretation. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Decentralised, cause-driven, safer social media. Exposing the audience to truer, purposeful use cases bringing positive social change.", "experience": "Highly driven multiple founder, curious learner and professional dedicated to delivering large scale positive impact. Significant practical & professional experience, including subject area & market knowledge. I have the attributes & commitment to lead the project to success."}