{"id": 404572, "author": "fuixlabs", "title": "Metaverse Builder with NFT Boosting", "url": "https://cardano.ideascale.com/a/dtd/404572-48088", "category": 26438, "amount": 254510, "description": "Unmet need for new NFT economies that go beyond the passive buy/hold scenarios, boosting NFT prices & winning the blockchain metaverse wars.", "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=30026", "https://www.youtube.com/watch?v=vagZOxGDjEA&list=PLgIO96BXrRnb51UTv6rvDcOH6YebH8RAN&index=23"], "media": [], "f6_assessments": [{"id": 748, "q0": "This is a fascinating dApp that is already being built out and promises to bring a no-code metaverse building platform to Cardano.  The key to the app is in leveraging NFT creation at every step with something the team calls \"NFT Boost\".  They describe a number of ways that this boosting is typically used to add value beyond just the purchase and hold/trade route, and then highlight their solution:  maximum gameification in a metaverse.  This isn't the first time I have seen this idea, but it is the first time I have seen such a robust plan to deliver a non-code platform for people to not only create the NFTs but to create the metaverse elements to allow them to \"play\" with the NFTs.  They include here a non-exhaustive list of ways to gameify traits, reverse XP protocols to create burns that increase rarities or exclusive NFTs, and many others.  They also include a branding protocol, which I believe is the secret sauce here, as most players want to play, not design, but brands will be able to come in and use the tools to create interactivity for months or years, depending on their marketing needs. With Cardano's in built NFT protocols and low fees, the team has the right idea to bring this idea from the high-fee shadows of Ethereum and get it released on Cardano.", "q0r": 5, "q1": "As I have said, I have seen ideas like this before.  What makes me sit up and take notice is the working prototype they include (and the ability to take beta testers as of 3/23) but just how developer heavy the team is.  While marketing is an important part of this, as basically a game development, the code will be king for this dApp, and seeing  multiple front end developers, multiple back end developers and even multiple project managers actually gives me hope that this is possible and not just a huge research budget.  The budget itself was a beauty:  broken down by phase, with each phase representing a key milestone.  The developer rates here are a steal as well, averaging $50/hr (and that includes the Plutus engineer).  The team also lists IOGs TimObrien as a principal, which I assume means they will have access to IOGs professional services for some aspects of this project, which is a great sign.  The only knock I see for this project is that its budget is asking for such a huge amount, at the expense of other funded projects, but the whole purpose of the high challenge setting budget in Fund8 is for larger projects to be able to start stepping into Catalyst for opportunities.  When considered on its own merits, the budget seems not only well apportioned and appropriate, but fair as well.", "q1r": 5, "q2": "The team lists some good KPIs for their GitHub and 3 different ways to track the project (their website, the cardanocode website, and through their beta cohort), but they didn't think to mention their milestones!  They have 5 milestones to be delivered over approximately 8 months, and each one has multiple measurables listed, including libraries and documentation, so there should be no problem filling out the progress reports. The one sticky area is for the last milestone which is basically just bugs and testing, but as a 4 week milestone, they may be able to just fill in all of their project completion data, which they have listed under \"Success\".  This success they intend to measure as the \"boosted\" value of NFTs on the platform, including internally native ones, but also for outside NFT creators and mission driven creators to see a \"boost\" to their products when utilized in this gameified meta verse environment.  A fantastic job staying true to the KPIs for NFTs which they claim to be targeting.  Mission accomplished.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5676, "q0": "This proposal directly addresses the challenge questions, specifically \"NFT marketplace or facilitator\" as this is exactly what the proposal aims to create. By creating a metaverse Builder Dapp this proposal aims to increase the use and utility of NFT's and create new user experiences on Cardano. This proposal will be able to scale and address future challenges because it will create opensource tools that are accessible to the community. ", "q0r": 5, "q1": "The proposal includes the teams background and qualifications, and they appear to have the skillset and experience required to deliver on this proposal. The budget it is broken down and clearly itemized in the proposal, however the sub total project budget is $328,300 and the proposal requested funds are $254,510. It is not exactly clear where this additional funding will come from, or if it is assumed that the difference will be covered by the proposing team (FuixLabs) and the token sale. ", "q1r": 4, "q2": "The proposal includes Phases 1 and 2, and also several milestones with itemized budget. However, the presentation of these makes it difficult to determine exactly what milestones are covered with this proposals budget, which milestones are part of phase one and which milestones are part of phase two. It will be challenging for the community to audit this proposal without more clarification. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9753, "q0": "The Metaverse builder proposal looks to create an application for building out NFT based economies through the implementation of a marketplace and tools for improving the use cases of NFTs. The proposer covers a mixture of ways to boost the value of NFTs such as direct rewarding, vaulting or metaverse gamification. One thing that isn't fully clear is what the proposers mean by metaverse. Do they mean the 2D/3D NFTs will be used in an existing 3D world being build such as Pavia or similar or that they are actually making a metaverse world that people can interact with? It appears it is focussed initially on the NFT creation side but there is also reference to Meta and Facebooks metaverse which suggests they are in fact referring to open world systems as well. If that is the case then the complexity of this project is high and should be noted! The proposal addresses the challenge and has potential to help make ecosystems richer with ways to improve the reasons people interact with and hold NFTs in these different contexts or a metaverse.", "q0r": 4, "q1": "The team break down a set of milestones each with a detailed itemised list. The budget is broken down based on the role, hours required and using an hourly rate determine the final amount. The budget was done for each of the milestones.A long list of seven team members is provided, each with their LinkedIn profile so that their backgrounds can be verified. Information is given on their background that is relevant to the project. The timeline and budget appear to be reasonable given the long list of members provided. From the details provided it is not clear on how much Plutus experience any of the team members has and as such appears they are fairly new to the ecosystem. Due to the complexity of the task they are looking to implement this reduces some of the confidence that the team will be able to execute effectively and on budget due to the risk of Plutus requiring sufficient time to learn and use effectively.", "q1r": 4, "q2": "The team details out a list of ways to track their delivery of the project. They mention a Github repository to track their progress yet do not give a link to the profile. Upon searching the website and on github it was also not easy to find a repository to verify any previous work from the team. In terms of measuring success the team detail a list of ways that NFTs will be enhanced to give holders more reasons to hold and buy them in different ecosystems that utilise the features offered from the execution of this proposal. It would have been good to see some more information on what will be open source, a github repository link for reference and KPIs that were a bit more specific and targeted rather than the general ones provided such as 'Increase of value of CNFTs' which may be hard to track, audit and fully determine whether it was due to the tools from the metaverse builder tool if they are using a number of approaches and services.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": " We are building a metaverse builder platform that in phase II will include integration with Unreal Engine etc. We do not presume what the current or future of definition of metaverse is but will be sensitive to the users of our platform and will build our the features they value the most. \nWe have been working with Cardano since Fund 5 and have Haskell/Plutus experience.  \n\n "}], "solution": "A metaverse Builder DApp for creating new NFT based economies and a new kind of NFT marketplace that will boost the value of NFTs", "experience": "FuixLabs is a boutique blockchain development company with a team of 15 blockchain and usability experts.\n\n\nT E S T I M O N I A L \n\nSee what Vogu Collective founder is saying about our NFT sales product for Ethereum\n\nhttps://www.youtube.com/embed/nvuLL0fuLFc\n\n"}