{"id": 404895, "author": "travisyatsko", "title": "ARTEM: NFT/Token Gallery Extension", "url": "https://cardano.ideascale.com/a/dtd/404895-48088", "category": 26438, "amount": 12000, "description": "NFT images can be difficult for the average consumer to access, downloading files from IPFS is not as intuitive for the average consumer.", "f6_no_assessments": 6, "f6_rating": 3.4999999999999996, "videos": [], "media": [], "f6_assessments": [{"q0": "In my opinion this proposal could improve the stakeholder participations in the Cardano community NFT exchange and improve transaction of NFT market on cardano blockchain.\nThe proposal solution would be a Chrome extension that would build upon the Artem App allowing access to the users NFT collection and associated metadata, with integrations on Google Photos and other third party storage applications.\nHowever the objective of the proposal is interesting and it’s good for growth the blockchain adoption, but I think it's important to enrich the proposal with other kind of support for users and related functionalities.\nI think it's important to improve details about the proposal deliverables for the challenge (eg. business case for adoption, business case for NFT exchange, margin of the services …).", "q0r": 4, "q1": "The proposer seems to have the necessary experience, because he’s an SPO and developer, but there aren’t link to professional profiles (eg. Linkedin), so it’s difficult to assess. Also for the rest of the team tere aren’t link to professional experience and curricula.\nRoadmap and milestones are described. The budget’s information provided is described.", "q1r": 3, "q2": "The metrics for the assessment isn’t given or is given partially or related only to technical assessment.\nThere aren’t a lot of KPI to identify the proposal goal, but only deliverables. There aren't more details how the revenues of the proposal service, also I'm trying to discover attachment to deep dive the solution.\nThis proposal is a continuation of a previously funded project in Fund 7.", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "I really like the idea of making things easy and the fact that this applies to a project, such as the NFT space that accumulates great hype, nowadays, makes it even more appealing to me. The access to each one's NFTs is going to get very simple with that Chrome extension you mentioned, as the browser's extensions have become a daily thing with the crypto wallets. The community has got used to how to deal with them. From that point of view, i think that the proposal effectively addresses the challenge of Dapps, as it is a great Dapp experiment and that it would have a great impact on the whole ecosystem making space for future similar challenges to be addressed as well. ", "q0r": 5, "q1": "I see that there is some previous experience when it comes to the team members of the proposal, given the fact that they have worked on their field at least 6 years. It's quite unfortunate that you don't provide some links, for example their linkedin profiles, for the community to verify this experience and feel a bit surer for the successful implementation of the proposal. The plan defined to implement this proposal is clear and sufficient for me. The budget has been outlined very clearly and the identifiable items are being described in great detail, not letting the voter to doubt. I also find useful the fact that the plan rolls down to at least one year time. ", "q1r": 4, "q2": "It is mentioned that the progress will be tracked by the ability to meet the milestones outlined in the roadmap but I also would ask for a link to follow up with the progress of the proposal, if that's possible. The KPIs were described in the above section and in the auditability section the proposer refers to the total installs  as the primary KPI at the one year mark and also quantifies it. Don't you think that you would have to quantify the other KPIs as well? Would one metric be enough to measure the success of one proposal and, in fact, in one year time? ", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"q0": "Unfortunately, nowhere in this thread is it said why this chrome extension would be beneficial specifically for Cardano. Sure it would make life easier for users by allowing easier access to their NFT collections/associated metadata. Some actions cited by the proponents, such as associating with other applications, such as google photos, excluding the need to retrieve wallets to access tokens, etc, are really interesting for holders of these assets. But why would this all be built on our blockchain and not another? How would the technologies relevant to Cardano be used in a unique way, how would all this attract new users to our community? In other words, how would the specific challenges of the challenge be achieved? In fact, the project does not seem to me to be a Dapp in itself, but an extension of a web browser, so I know if the proposal fits structurally as well. There are many flaws, unfortunately, which makes me think that the impact could be low for Cardano.", "q0r": 2, "q1": "We have a script that is not bad, but not ideal either. It would have been better if the activities had been divided into less and more regular time intervals, such as months. The proponents should also have detailed each of the actions in greater detail. The time from 6 months to 1 year is pretty abstract. All we know is that \"ongoing maintenance and additional campaigns\" would be done. What would that maintenance be, and what additional campaigns? What would be the objectives of such campaigns, why are they necessary? About the budget, it is possible to understand the basics of how the money would be used, but again there could be more details. Why would the engineering part cost $6,000? What would be the working hours of these professionals? I think the same for developers and designers. If we knew what their routines would be like and the value of their working hours, surely the understanding would be much deeper. Team members are not properly introduced. We only know their names and roles, but not about their resumes and their involvement with Cardano. This doesn't give you much confidence.", "q1r": 2, "q2": "It is said that progress will be made by tracking the roadmap's milestones, but as I mentioned above, it's not that detailed, so we couldn't understand with as much specificity how this monitoring would be done. As I have already said, it would be ideal if the time intervals were smaller and the activities explained in more detail. As it stands, I believe the monitoring would not be as specific as is necessary for the project to be securely audited. When it comes to success, proponents focus entirely on what the expected results for the project itself would look like, but not how it would affect Cardano. It would be necessary for quantitative and qualitative metrics to be used to understand how everything was reflected in our blockchain and if the specific objectives of the challenge were achieved. Therefore, auditability needs real improvements.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "As I am not an NFT collector (or an “average consumer”) it is difficult for me to evaluate the need for this product. I own some NFTs and so far I have been happy accessing them with available wallets and services like pool.pm that show the NFTs difrectly. If I had hundreds or thousands of them, I’d probably need a service like ARTEM.\n\nBuilding on the Fund7 funded mobile app proposal, this is the next step to provide a Chrome extension for the same service. This will enable users to share their owned NFT art collections in mainstream services like Google Photos or to place them in digital image frames at home. When framed like that (pun intended), the impact becomes more obvious.\n\nIf the problem statement is written from the perspective of the average consumer, so should be the proposed solution. Now it sounds unnecessarily technical and lacks the benefits to the end user: \"Create a Chrome Extension that ingest wallet address’ and access linked NFTs for organizing, downloading, and sharing.\" The 'what' is there but the 'why' is missing.", "q0r": 4, "q1": "This is a strong proposal because it is already being developed, and according to the set timeline it only takes a month from receiving funding to finalize the user interface. That is followed by a step by step plan to roll out the service, first for 100 test users and ultimately to 5,000 end users. It’s a modest goal for something that doesn’t necessarily sound like a niche product. The team profile is very convincing and it’s quite obvious they have the capacity and know-how to pull this through. The fairly low budget of $12K includes both technical development and marketing costs. If there’s anything to improve I’d say it’s not enough to just outline what the risks and challenges are — e.g. lack of trust from the potential end users — but there should be a carefully considered risk mitigation plan included. Now the questions are left up in the air and there isn’t much deliberation on how these risks are being addressed.", "q1r": 4, "q2": "The plan is very clear and the budget almost overly simple. The bit that I didn’t quite get was the “potential Blockfrost cost and other hardware related expenses”. It would be good to state exactly what is needed and why. There are some gaps like this in the information provided and, all in all, the auditability section should be more fleshed out. Although goals are clear and they enable auditing the success of the proposal, it is not self-evident how the progress can be tracked.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Given the challenge goal \"What applications will provide the most value for end users in 2022?\" I believe that this proposal is completely aligned and impactful. \n\nThe proposal aims to provide a chrome extension that would access a user wallet with NFTs and allow more easier manipulation (display, download, share). Nowadays, users if they want to display their NFTs using e.g. Daedalus, they must to go to pool.pm, search their wallet and then viewing of NFTs is possible. I imagine this proposal as a bridge, which would remove the step when searching for your wallet, but an extension is downloaded to chrome, you insert there your wallet and you can view your NFTs directly. So in the end, it results in more effective and more intuitive manipulation for less experienced users. ", "q0r": 5, "q1": "The roadmap of the extension is set to six months to one year, where only the first six months are actually involving tasks to be performed. Even tough a final task is set for each e.g. one month, and then to three months, nowadays using most of the time agile management, in the most cases with two weeks sprints, a more details would provide more clarity.\n\nUncertainty - whether a mistake of a proposer, or an intention, a month 2 is missing. \n\nThe budget asked is 12 000 USD, but it is unclear what hourly rate was used, and even that on a roadmap e.g is one month goal - it is unclear whether it is full time task, or less amount of hours is required to complete the set task. \n\nThe team is described - having three members, all sw engineers with 6+ years of experience. Despite that LinkedIn profiles are not posted, the team was funded in F7, increasing creditability. \n\nDue to unclear roadmap and budget calculation, I am taking one star down. ", "q1r": 4, "q2": "The proposer states, that the progress will be tracked by meeting the goals of the roadmap - but it is not mentioned where (website? social media? telegram? discord?) and how often (monthly, bi weekly, weekly?) I suggest to specify these. Also, nowhere in the proposal is stated whether it is open source, or not, so I go with No, therefore tracking the progress needs some improvements. \n\nThe success will be measured by the number of installs/downloads and the finished product. ", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "Not many new users on the Cardano blockchain know the ins and outs of NFTs and how \nto access the files. This browser extension will be an easy way to access and organise your NFT files, integrating with third party storage apps like Google photos etc allowing users to use their  NFTs on more devices like digital picture frame devices. The value it will ad to Cardano is somewhat uncertain. Cardano NFT holders will have more uses for their NFTs is the only value I can think of. As wallets evolve this feature will most likely be added to wallets in the future, though some users might prefer to have this feature seperate from their wallet, which makes  the scalability also somewhat uncertain. The key metrics of getting more users to install  their extension is somewhat aligned with the challenge, as many of the users is already on Cardano to begin with.\n", "q0r": 3, "q1": "The team needed to build something  like this seems on par with the team they presented.  They havent provided much as far as background and experience goes. I was able to get  a github account of Travis from the previous fund's proposal. More detail here will boost voter  confidence. 3 months to  complete the  MVP seems doable. The budget is reasonable and is broken down into development, server expenses and marketing. They explained what is being built. They  mentioned a dedicated IFPS server and a chrome extention, but they didn't go into much detail on how it is being built. The challneges they considered is  new blockchain user trust and the slow performance of IFPS. They solve the IFPS with the dedicated server, but no mitigation is provided for the new Blockchain user trust issues.", "q1r": 3, "q2": "The roadmap is broken up into quarters with clear milestones, making it easy to \ntrack the progress. The KPIs are based on installations which is also easy to track.\nOne more KPI they can ad is user ratings. The description for the targeted problem is clear,\nbut it is unclear how many people will find their solution useful. ", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a Chrome Extension that ingest wallet address’ and access linked NFTs for organizing, downloading, and sharing.", "experience": "Travis Yatsko: 6+ yrs Software Engineer, SPO, TPM\nJia Yang: 6+ yrs SpaceX Engineer\nIsmael Munoz: PhD, 6+ yrs Engineer"}