{"id": 404963, "author": "victorcorcino", "title": "Fiverr Clone on Cardano", "url": "https://cardano.ideascale.com/a/dtd/404963-48088", "category": 26438, "amount": 250000, "description": "Sites like Fiverr take advantage of service providers by enforcing high fees (20%) without providing much in return.", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal addresses a concerning problem, which many freelancers and employers face. The propose solution would be a great addition to the Cardano´s ecosystem and the Blockchain space as a whole. The proposal clearly addresses the challenge and could bring thousands of users to Cardano, great potential for impact", "q0r": 5, "q1": "The team seems highly qualified and known members of the Catalyst community, no doubt the team will deliver the project. Timelines seem carefully thought after. Due to the level of expertise the team has, I wouldn't doubt their ability to deliver, but what comes next. Marketing will play a crucial part on this, but if the platform works people on the Cardano ecosystem will probably use it (I know I will) \nLinkedIn links would be appreciated ;)\n", "q1r": 5, "q2": "The team thought about auditability and provided good KPIs for the project´s development, my thought is how will the community be able to audit, before the launch of the platform. Before Marketing starts, will they have a place to audit development?", "q2r": 5, "assessor": "z_assessor_1190", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Building a platform similar to Fiverr on Cardano will solve many users of Cardano's needs when it comes to providing and seeking freelance services online. This will bring many new users to Cardano and cause a lot of new traffic and value for Cardano and its users. Their product's use of smart contracts aligns with the challenge in providing “Solutions utilizing the power of smart contracts”. The freelance market is an ever growing market as more and more people are looking at working remotely. With web3 also on the rise, this application is bound to scale and ready for the future.", "q0r": 5, "q1": "They provided a link to their website and provided written profiles of the core team members. They have been successfully funded in the past and are active community members. Looking at their website, it is clear they have the necessary team capable of building this. The budget breakdown also shows that they know the kind of resources they need to build this. The  budget is reasonable for a project like this and is broken down into tasks and hourly rates. Launching this product in Q2 2023 is achievable. They explain in detail what is being built, but don't provide any detail on the frameworks or languages they will use to build this (Except for Plutus). Providing these details will give a clear picture on how you are approaching and solving this problem. Looking at the team's GitHub pages they are all strong in JavaScript. One of them is a MERN stack engineer so we would have to assume that this is the route they are taking. The only challenges they foresee is related to adoption and marketing. They are still looking for a marketing professional and this might slow them down. ", "q1r": 5, "q2": "The roadmap completes in Q2 2023 and the milestones are singular tasks making it easy to track the progress. The KPIs are user/services and transaction driven which can easily be tracked by visiting the website and looking at all the  active users and their reputation. They describe the high fees problem of these freelance marketplaces on web2 and the solution to this is clearly making it decentralized and bringing down the fees considerably.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal effectively faces challenges with the implementation of smart contracts in the application that will be made. As a dapps marketplace that will run within the Cardano ecosystem, making it easier for people to sign up and use it. The idea is to take fiverr as an example and upgrade it in a web3 application which will certainly increase performance a lot compared to fiverr itself. The goal to be achieved by the maker is clear and concise. One thing I would suggest is to keep using ADA as the main transaction tool, being able to attach mockups and work clearly through the medium website.", "q0r": 4, "q1": "The plan is presented optimally, there is a high possibility that this proposal can be successfully implemented as described by the proposer. The roadmap is created and estimated, the terms are clear, the team is well trained, professionals and engineers experienced with cardano ecosystem development. The budget is clear and reasonable to achieve the goals set, but should still be reduced and be in the $100,000 range for a development like fiverr with blockchain and web3 features. Even so, for the proposed budget, if you look at the target and the time to be achieved, it can be accelerated, I think it is reasonable. Moreover, the team is very professional and will be full time.", "q1r": 4, "q2": "As I explained earlier, a clear and complete roadmap like the one above will make it easier to carry out monitoring, supervision and evaluation. The description is very clear and the target to be achieved/KPI is also clear with the number of users who will use it. My suggestion is that the source code can be uploaded to github for further development.", "q2r": 5, "assessor": "z_assessor_1681", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "So I just clarify if this idea is the first Freelance Platform Blockchain-Based in the internet. The answer is no. Once there is Orbi.network in Ethereum (which I think it's a scam, note: check their Telegram) and Argon.run in BSC (which there is no any jobs update there since July 2021).\n\nThis could be a huge advantage for us (if team runs it well). What will proposer sell with this Freelance Platform Blokchain-based? A decentralized platform who not enforcing high 20% fees to users, like Fiverr? Is Fiverr's user complained about it? If yes, why Fiverr still the most use platform for freelancer?\n\nAgain, I think it is a great idea. But to make the projects sustain we need to know first: What world-wide users want. Doing some early research will help you to strengthen the core ideas for this proposal.", "q0r": 3, "q1": "As proposer foresee the risks of this project are about marketing and adoption after the Dapps ready, I think it's better if your marketing starts at the same time as phase 1 running (to steal a start). Or maybe recruits any ex-Freelance Platform marketing professional to your team would be a good fit.\n\nI love your work as you explaining the roadmap and your budgets at very detail way. And about there's no link about your team credentials, I think url to your Team page in your website already covers everything.", "q1r": 4, "q2": "Roadmap and key metrics are already there. Proposer clearly explained to us in this Auditability section. Again I just concerned about the adoption after the dapps development done. What will professionals or customers switch from Fiverr to our platform? Consider early interactive marketing in todays mainstream social media will help proposer achieve their key metrics.", "q2r": 5, "assessor": "z_assessor_639", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Build a fair marketplace with fair fees to benefit both sides of the marketplace.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans, UX specialist, art direction and designer."}