{"id": 404984, "author": "adrien.cirou", "title": "NFT Bids - Powered by Balou", "url": "https://cardano.ideascale.com/a/dtd/404984-48088", "category": 26438, "amount": 20000, "description": "NFTs are difficult to buy/sell after the initial drop, building trust between the buyer and seller is critical in developing the ecosystem. ", "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem is not completely clear in my opinion, Cardano does in fact have several NFT stores with Bid capabilities. Your solution is to do in a mobile app, and thats great. So I would focus the problem on why traditional or computer experiences are not good and then your solution will be better perceived. Because if you say \"NFTs are difficult to buy/sell after the initial drop, building trust between the buyer and seller is critical in developing the ecosystem. \" It doesn´t seem to contemplate existing working platforms that do that.\nOutside that part, a mobile app would be a great implementation to the ecosystem  that will contribute to Cardano´s mainstream adoption. Addresses the challenge objectives clearly", "q0r": 4, "q1": "The team seems up to the task, but not much info was given about the team (Next fund I would recommend putting some LinkedIn Links) Amount of team members is clearly thought and stated and the timelines are feasible. Not much information was written about the outreach of people, if getting people is clearly a challenge and a MUST for the platform to succeed, why is there no specific information about how are they addressing that part? Where are you looking for? Which target, Only CNFT holders, regular NFT holders?", "q1r": 3, "q2": "\"Financially the project's ability to stay within budget will be an indicator of planned progress\" How will the community be able to audit this? \n------\n\"UI/UX - $2,000 - Flutter Developer(s) - $6,000- Backend Developer(s) - $6,000\"\nSalaries seem to be asked for around 6 months of work, after that where will the salaries come from? By that time you aim to be at +-100 Downloads, will that be enough to sustain the platform? Are you making another proposal in future funds? \nMore information about the 1 - 2 Year mark could be added, are you just doing marketing?", "q2r": 3, "assessor": "z_assessor_1190", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is well done in scope, background and intended execution. Furthermore it addresses the very real need for more user friendly, trusted (d)apps to facilitate the capitalization provided by tokenization and the current media-based NFT trend. Furthermore it fits right into the category as I understand it (both the category and the proposal) because it would provide an successful example for others looking to do the same, and it could also have other benefits such as helping the formation of standards for (media based) NFTs and their sales. However, what's missing is the smart contract developer (no offense Tanner, I just don't see \"much\" that shows you know anything to do with Marlowe, Plutus or what it would take to make a secure, Cardano based escrow wallet--not that you couldn't or don't already, but the provided background information is very limited as to your expertise given you'd be the one responsible for doing this). On that note, this proposal almost seems like it could split into two proposals: one making this kind of app, and the other making the secure escrow exchange wallet that Cardano user's would find favorable; perhaps if this doesn't get funding this is the approach that could be used next funding round to spread your leverage of success.    ", "q0r": 4, "q1": "While the apodictic evidence of the existing Balou app is very convincing, as well as the background of each of those involved in making this proposal being properly balanced to handle the task at hand, the task at hand is actually dividable into two parts: one that I have no doubt could be completed (creating a mobile app to facilitate the exchange of Cardano based nfts); but the other, a secure escrow wallet, does not seem feasible by the given information as there is no specific allocation for the smart contract development work (or even handling the Cardano protocol's interaction), and I don't see how from this proposal how that could be achieved even with the best intentions of those involved. So while I strongly agree with the first part, I do not at all agree with the later, hence the 3 stars.", "q1r": 3, "q2": "Please read the previous assessment note, in addition to that as context let me state: specifically delineating how that secure escrow wallet would go from an idea, to a compilable and usable code base, and integrated into an exiting marketplace app, is enough to fill its own proposal and should be provided for this proposal to get the funding it seeks to deserve. So while the roadmap and auditability are provided and could fulfill accountability for the Cardano based NFT trading app itself, the secure escrow wallet not being realistic in terms of iteration or accountability (as far as the proposal states) leads me again to 3 star rating. Furthermore, the NFT collection used to seed the app's success could be quantisized or determined before hand by picking or finding an artist (or artists) to collaborate with to lend credibility to this proposal. ", "q2r": 3, "assessor": "z_assessor_1238", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The problem addressed in the proposal refers to the difficulty to buy or sell NFTs after the initial drop.  This is critical for the ecosystem and in building trust between the buyer and seller. The solution is to build an iOS and Android application in an auction format allowing users to buy/sell NFTs in an auction format with an escrow service that protects the transaction. The proposal has a positive impact on the development of cardano ecosystem and KPIs of the challenge are aligned with those of the proposal.  The application will be developed for the cardano community and the feature of auction is taking the NFT world a step further.", "q0r": 5, "q1": "The proposer has provided a clear and feasible plan and timeline. The project will be completely implemented within 12 months and from then on it will be maintained with the goal of reaching at least 10,000 users. The team is composed of 4 professionals who are qualified to implement the project. The budget is reasonable and is detailed. The proposer has identified as potential risk the building of trust, as users must be convinced that they can control the wallets they create. The details provided in the proposal create a positive feeling towards a successful the project completion.", "q1r": 4, "q2": "The proposer has provided a roadmap and milestones that assure the completion of the project. ROIs and download KPIs will be used to ensure metrics that the community can track. This is a useful proposal, with enough information provided to assure its feasibility and successful completion.   ", "q2r": 4, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal intends to create a mobile application to buy/sell NFTs in an auction format with an escrow service protecting the transaction, building trust between the buyer and seller is critical in developing the ecosystem. It will create an NFT marketplace, to attract many users, help to increase utility & adoption of Cardano as the challenge setting. But it lacks of evidence to show the difficulties in buying and selling NFT after the initial drop. So I suggest to provide some evidences to justify the untruthful of current platforms for example the Binance NFT Marketplace or other exchange. \nBy combining NFT with escrow wallet, we ensure trust in the auction process where NFT will belonged to the highest price bidder. This is a unique solution to address the problem better than existing solutions.\nIt'll be more clear if the proposer give out a sketches or whitepaper detailing how they would go about to launch the proposed solution.\n\nThe proposer mentioned some risks and rational solutions, but it's better if the Author in-depth reviews the lack of auctions on the blockchain standard solutions and violated ability to existing regulations, quite different to the custom Balou application.\n\nIn general, this proposal is so good, has Impactful for the Cardano community.", "q0r": 4, "q1": "The proposal provided a detailed plan for delivering the solution but the budget is just for 1st year except budget for server, I think the proposer could intend some budgets for the 2nd year and later (if any) such as: maintenance and additional campaigns for reaching 10,000 users. It's also possible to fund raising this Fund for the 1st phase to the end of this year for aligning to the challenge goals and depend on the result assessing, you could join next Funds.\n\nThe proposer gave out relevant experience in UX/UI Designer, programming, software development, Business Development and Marketing,... but I couldn't find any reference link directly to detail experience and PoW of each members, even on website, especially experience on the Cardano blockchain DApp development. The team has blind spots regarding the shortcomings in their composition and not properly identify a path to addressing these staffing/expertise shortcomings. But by using Google’s Flutter Framework, I think your team could now easily integrate into current platform using a third party API, Blockfrost for example (https://blockfrost.io).\nThe proposed budget has limited details so I cannot define whether the requested amount is enough. It could improve by breaking down to working hour/labour, for example: 2 engineer for UI/UX designing in 40 hours * 50USD/hour = $2,000.\nThe proposer explained quite clear about the technical aspects in solving problem but it'd be better if giving out a diagram/scheme/whitepaper as I told in the impact assessment.\nThe Author aware the importance of marketing campaigns and listed in proposed budget but unfortunately it lacks of a marketing plan/strategy with detailed about what type of media, channel and target audience, such as: Telegram, Discord,...\n\nWith these above reasons, I doubt about the feasibility of this proposal, hope it would improve better in next Funds.", "q1r": 3, "q2": "The proposal's KPIs are auditable but they are not available for community easily tracking how the proposal is progressing for need reasonable effort of the community. The auditability could improved much more if the proposer give out communication methods such as: an item on website for updating progress of project according to the roadmap, or buiding a communication channel such as: Discord, Slack or Telegram,… for contacting and updating information to the community.\nAbout the proposal defines what success means, they are quite clearl and derived from their KPIs, and easy to track on the iOS and Android App Store.\nIn general, I neither agree nor disagree the auditability of this potential proposal and hope the proposer pay attention much more on it in the future.", "q2r": 3, "assessor": "z_assessor_775", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"q0": "An 'auction house' for NFTs would be useful, as the ask price for an NFT might not be what a user is willing to pay. Bidding is pretty standard practice, in cNFTs and in other chains. Currently, most auctions as far as I'm aware are done in Discord. There are also website marketplaces that offer auction type sales, like Tokhun. According to opencnft.io/market-overview, the majority of sales happen on jpgstore, where auctions are not yet supported. Once auctions are available on jpgstore, people could stick with the familiar and stay there. Furthermore, nfts are usually adopted by crypto enthusiasts and more specifically that particular chain's enthusiasts. Due to misinformed news, nfts are also painted in a bad light. Newcomers also would usually flock to the most known name which is OpenSea. Thus, there could be a risk of having an empty marketplace. Granted, jpgstore requires smart contract wallets so it is unavailable on mobile, as far as I'm aware, so Balou could find an edge there. By addressing some of these concerns, this proposal stands to fortify its case as a competitive, impactful marketplace.", "q0r": 2, "q1": "The proposal includes a roadmap with milestones. The budget is broken down and can be clearly understood. More details on the team members would be helpful, as well as reference such as linkedin, github, or social media. Balou is live on Google Play and Apple Store which indicates their ability to deliver, but it is difficult to judge adoption levels. ", "q1r": 3, "q2": "The roadmap, as well as marketing ROI, are set forth as metrics to measure in the proposal. The proposal would benefit from including links to where the community can track their progress. The proposal should also include quantifiable KPI numbers for community to gauge success.", "q2r": 2, "assessor": "z_assessor_948", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "An iOS and Android application allowing users to buy/sell NFTs in an auction format with an escrow service protecting the transaction.", "experience": "Adrien Cirou: CEO Balou - 15+ yrs Business Development and Marketing\nMichele Pires: 10+ yrs UX/UI Designer, PgM\nTravis Yatsko: COO Balou -  6+ yrs SWE, SPO, TPM\nTanner Cox: 10+ yrs Senior SWE"}