{"id": 404903, "author": "nullvalues", "title": "Contracts as a Service", "url": "https://cardano.ideascale.com/a/dtd/404903-48088", "category": 26438, "amount": 97330, "description": "Developing with Plutus Application Backend requires a setup and configuration process that will slow developer adoption of Cardano. ", "funded": 1, "upvotes": 42821712, "downvotes": 11681965, "votes_result": 31139747, "votes_cast": 129, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 332, "q0": "The proposal would be within the challenge goal, this is a great idea, and I think that this proposal probably will increase utility & adoption of Cardano Smart Contracts  challenge and builted for a great community (developers and consumers). At the same time the statement of how problem is to be solved is explained with a technical elements of the offered services, so I suggest to define use cases and offering, because in the documentation provided there are only component use examples.\nHowever the objective of the proposal is very interesting, but I think it's important to improve details about the proposal services solution for the challenge (eg. Typical services use case for developer, example benefit for service creator and community, …)", "q0r": 4, "q1": "There are links in the proposal, which allowed me to verify the application engineer David Jacobsen, the senior developer Brice Sinkule and the project manager Hal Arnold with their credentials. \nThe proposer team is well skilled about the partial context of the proposal (Application angineer, full stack developer, front-end, etc..), but in my opinion the point of attention is the lack of the infrastructure lead and application architects, and the proposer don’t explain how to increase the teams.\nThe scope of the solution is explained (e.g. how the funds will be spent, what features will be implemented, and so on…). There is a too simple cost worksheet, that doesn’t contain all costs (eg. Infrastructure, cloud license, etc.)\nThe plan for implementation could have been a bit more specific, but as it is now it's good enough as well. The proposal doesn't go into too much detail into the technical aspects like architecture, language and technologies for the implementation. The proposers have not mentioned some potential challenges and how they plan on solving them.\nThe entire budget requested is very high and positioned at the top of the challenge, but there aren’t MVP or other concrete achievements to see, understand and evaluate feasibility. ", "q1r": 3, "q2": "The given metrics measure what the proposer wants to do, but the success of his actions is not defined. As mentioned above, the description of the solution is explained (e.g. how the funds will be spent, how the solution improve their customer experience, and so on…), so the progress of this proposal is not simple to assess.\nThe metrics for the assessment isn’t given, so it’s impossible to assess what the proposer wants to do, but the success of his actions is not defined. ", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1361, "q0": "The proposal tries to offer Plutus service that allows users to run Contracts as a Service that leverage a shared off-chain infrastructure as a foundation for lightweight contract containers. The proposal clearly articulates how they gonna bring the proposed solution that tackles the problem outlined in challenge settings. If they successfully implemented the plan it will add value to the Cardano ecosystem. The proposal has provided two main risks/challenges to the project and the way to mitigate them.", "q0r": 5, "q1": "The proposal outlined clearly the roadmap and what will they do in the timeframe (from the first week until the 18th week). The team provides a concise of how they will use the proposed budget. However, based on glassdoor data, the median salary of Haskell developers are ~66$/hour, and the experienced are ~116$/hour, meanwhile in the proposal remuneration for the Haskell developer is as high as 150$/hour, the same goes for the high paying front end developer and sysadmin. The high cost of the developers can be justified if the proposal elaborates more on the experience, past achievements, and the workload of the engineer. The team also gives concise information of background, relevant skills, and experience for each team member. All team member also has a LinkedIn profile that can be checked for further information by the community.", "q1r": 5, "q2": "Metrics that are used for tracking progress are clearly defined as three distinct points. The indicators for success are also outlined clearly by technical success, operational success, community success, and --as the proposal stated it-- back-slapping success.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2169, "q0": "The proposal aims to develop a Dapp that allows users to run Contracts as a Service that run off-chain through private data centers. I confess at this point that while understanding the highly technical nature of this proposal and the fact that such a value proposition is probably very interesting from other Dapp developers that can use an already developed module into more complex applications, I cannot truly visualize concrete examples from the end user’s point of view, and perhaps the proposers could have done a better job at finding ways to explain their proposal into a language more relatable to the average Cardano user / CA / voter. \n\nI offer four stars due to my limitations, so please read other reviews that hopefully do a better job at explaining the impact of this proposal. ", "q0r": 4, "q1": "The core team behind the proposal consists of three members, with extensive experience in engineering and software development, as well as Plutus Program pioneers. Their bios and social profiles are readily available for anyone wishing to take a closer look. \n\nThe project would take 18 weeks to implement, with 4 intermediate milestones before the final release. The budget would be split as follows: 20% for front end / API, 20% for Plutus backend development, 20% for system administration and 20% for 9 months of hosting. A very small budget of 2k would go towards a third party security audit, and this is definitely a point of concern where maybe the team must come up with a more realistic budget for a competent audit, whereas 2k is definitely not enough for this. \n\nWith a strong team and a detailed plan, I deem this project as highly feasible, with the caveat that the technical solutions chosen will hopefully be reviewed by dedicated CAs with extensive development / engineering / systems experience.  ", "q1r": 5, "q2": "The team proposes that the progress be measured through three highly technical avenues: SSH access, user interface being operational and being able to initiate activities, demonstrated through direct testing. As far as my understanding goes, these are all measures of the project’s functionality once the development is complete. However I have not seen any promises regarding the way in which the community shall be kept informed during the development phase. But again, a more technical pair of eyes might shed more light into this matter.", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3813, "q0": "The idea to create a contract as a service is very good because it is based on the experience of the proposer described when participating in the Plutus Pioneers Program Cohort 3 where the participants had difficulties and took a long time to setup for the use of Plutus and the Plutus Application Backend. All developers who are interested in cardano developers can take advantage of this CaaS to create their contracts. A very complete plan that is neatly written including to conduct a security audit which is a very important part. It would be better if you also make an explanation to answer the question that does this CaaS service not eliminate the concept of decentralization? And won't it slow down the transaction process? because of course it takes good device specifications to be able to serve all hosted contracts.", "q0r": 3, "q1": "The costs involved are quite large, but that's reasonable for a project like this CaaS. The implementation steps are well structured as are the components that need to be financed. The work team is experienced in their respective fields and one of them has passed the Plutus Pioneer Program who understands how contracts at Cardano work. In the security audit fee component, it needs to be added so that it can really ensure that the contract is not easy to be hacked and it is better to add a special budget related to security. There is no need for additional funds, just by rearranging the budget in each component that has been written in the proposal.", "q1r": 4, "q2": "We recommend that you include an explanation that will provide a github link or website to provide reports on project implementation that are always updated. Especially if there is a script code that is created and also the costs incurred every time until this project is completed and also its continuation, as well as a statement that will continue to do security updates on the system that hosts CaaS.", "q2r": 3, "assessor": "z_assessor_1681", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8190, "q0": "The body of the proposal addresses the issue that developing with the Plutus Application Backend requires a setup and configuration process that will slow developer adoption of Cardano. The solution to this is to offer a hosted Plutus service that allows users to run Contracts as a Service leveraging the shared off-chain infrastructure that underpins lightweight contract containers. Great idea for a proposal. Propose indicates a legitimate problem and then provides an idea of a valid solution. In addition, this proposal considered the risks and challenges associated with successful implementation.", "q0r": 4, "q1": "The proponent provides a very detailed plan for implementing definite milestones and timelines. Looking at the proposal, I can understand how the proposal works to achieve the goal. For this proposal, the required budget is $97,330 which I think is appropriate for the size of the proposal. The budget breakdown is also very well explained, showing what the money will be used for in a very specific way.\nThe proposal implementation team consists of 3 main members: 1 / David Jacobsen has more than 20 years of experience in the fields of engineering, software development, consulting and traditional IT management. 2 / Brice Sinkule has over 5 years of experience developing user interfaces with Reactjs and React Native using Redux state management and 3 / Hal Arnold is a Seasoned Software Expert, Advisor and Executive Leader experience, he is also an experienced programmer and pairing team leader with seniority at TDD/BDD. In my opinion, the proposed team has an extremely relevant and relevant background on the goals of the project. The team's description is great and there are links to their Linkedin profile for information, which gives us confidence that they'll be able to deliver on what they promise.", "q1r": 5, "q2": "Progress can be measured in three clear and conspicuous ways for technical evaluation:\n1. SSH access to manually created containers is live and contracts can be run using shared node and chain index infrastructure\n2. The UI is live and can read the state of the container created and linked manually on the server\n3. The UI can initiate container creation on the server and can affect the container's state\nThe success of the project is very well described. This proposal provides a good timetable and roadmap that can be used to assess project progress. At some point along the way, there's a verifiable action that allows an audible hearing. Proposal is more likely to succeed and is presented as a work plan, with a defined roadmap with milestones and timelines for achievement and the proposed experience.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9755, "q0": "The proposal outlines a service for DApp developers that allows them to more easily develop and interact with the Cardano blockchain to make the experience easier to get started and use. The product has potential to become a business by charging developers for usage of it on mainnet whilst providing an easy to use and free version on the testnet. The team identifies a number of users in different use cases that would benefit from the execution of this proposal such as those not running a full node or stake pool. Attachments on the proposal help to visualise the different ways that the off chain infrastructure can be hosted and run for different use cases. The proposal team identified a fully hosted solution as an appealing option for developers who are completing courses such as the Plutus Pioneers course. The risks are notable and important as they highlight the free tier will mean incurring all of the costs relevant for running the infrastructure. Although there are inherent risks in terms of whether this model is sustainable there are clear benefits to the execution and the lessons that can be learnt from this proposal. It must be noted that this proposal also was suitable for the Development Ecosystem challenge however as they are turning this into a potential business then it is suited in DApps and integrations as well.", "q0r": 4, "q1": "The team provide a stepped break down of the tasks that need to be completed for this proposal. Along with that a breakdown of the costs are also provided against the different roles and hours required. The team provide their GitHub profiles and LinkedIn profiles that provide good evidence of the teams background being suitable for the proposal that has been outlined. The team has articulated and visualised the solution the are suggesting to a high standard. When combined with the background of the team and the information provided it appears very likely this team will be able to execute this proposal to a high standard.", "q1r": 5, "q2": "The team provide information regarding KPIs that include SSH access and usage of the applications interface to show the progress that has been made. It would have been nice to understand at this point what parts of the project will be open source, if any, so that the community could follow and learn from the development progress as well. Some metrics on how the project gets used by users could have been some useful additional KPIs to add to better demonstrate some of the success outcomes. The proposal outlines a number of different use cases that would help to determine whether the execution of this proposal is a success. Usage from Plutus Pioneers or Marlowe users are two good examples for determining a good outcome.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will offer services for users to run Contracts as a Service that leverage shared off-chain infrastructure with private containers.", "experience": "System Administrators with high availability experience in fully virtualized environments; full stack veterans; developers from Plutus Pioneers Program."}