{"id": 405050, "author": "aticomismana", "title": "P2P Fiat Exchange [cardway.finance]", "url": "https://cardano.ideascale.com/a/dtd/405050-48088", "category": 26438, "amount": 38152, "description": "For merchants from developing countries it is not practical to accept ADA as a means of payment. Therefore, restricting mass adoption.", "f6_no_assessments": 5, "f6_rating": 3.2666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal addresses a relevant problem and the described solution could mean massive improvement for the Cardano ecosystem. In many countries, high volatility is indeed a problem and currencies like the dollar are used as collateral. Currently, we are extremely reliant on CEX. A decentralized network to exchange FIAT into crypto would be extremely helpful and would help mass adoption.", "q0r": 5, "q1": "The project is a very large undertaking with many individual parts that can go wrong and thus jeopardize the success. The team has a lot of experience, yet it is relatively small for such a project. \n\nThere is no MVP yet and the first phase is prototyping. This means that we are very early in the project so that it can still develop in any direction. The schedule that the team has set for itself is tight, but seems to be achievable under the condition that everything goes smoothly. \n\nAll in all, the project is in a very early stage of development, so it is impossible to say with certainty how the project will develop.\n\nIf the team can implement their project, there is little to stop it from being successfully applied in the real world. The likeliness of that happening is pretty uncertain.\n", "q1r": 3, "q2": "The team provides a roadmap so that you can follow the progress. However, the individual steps are not precisely formulated, so that they cannot be exactly evaluated for success.\n\nFurthermore, the project's code can be found publicly on Github, so it tends to be observed by interested parties. \n\nThe goal of the project is clearly defined. The target parameters are ambitious, but fit the overall plan of the project. However, exactly how these goals will be achieved is not specified. Little is known about the marketing.\n\nTaking these points into account, 4 stars seems a fair rating to me.\n", "q2r": 4, "assessor": "z_assessor_1147", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aims to develop an app for merchants to receive payment in ADA and to allow conversions to stablecoins or fiat. I have two points to raise regarding its impact. Firstly, any apps that will involve fiat conversions will be very problematic from a KYC point of view, and adoption might be a door-to-door battle in each country. Second, while being a true believer in market economies, I highlight the fact that a similar solution already offers such services and was previously funded by the Cardano community. ", "q0r": 3, "q1": "The two person team has made a fair job at presenting themselves and their experience, so this is a very good sign. The project would take 6 months to be implemented and a sketched plan is presented, but I feel that a bit more thought could have been put into making sure that it is well structured, organized and offering a bit more detail into the production phases. The budget on the other hand I think does a job at showing how the money would be spent and at which hourly rates (USD 30) and therefore voters can definitely judge for themselves the perceived value for money. ", "q1r": 4, "q2": "The team promises that documentation and source codes from GitHub shall be open source under the Creative Commons \"BY\" license, a good indication that the team values openness and transparency. Any additional efforts into making sure that communication channels are open, or perhaps a few explanatory videos to help the community understand the product better and quicker would have definitely turned this part of the proposal into an excellent one. Four stars. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I found interesting features of Dapp mentioned here, such as some mailings (if the recipient sends the buyer does not receive), some recipient in game 3 mediators for example to check all the documentation and financial solver. However, those people who would do the mediation would be pagans, or who would generate more for the merchants; and the problem commented by the proponents is that precisely these merchants do not have the time or resources to spend converting Ada into their local currencies (such as reais, pesos, etc.). The definition of the problem can be seen directly in the following excerpt “Merchants do not have the time and resources to spend on receiving payment in cryptocurrency (b2) and on converting to a stable currency such as the dollar or even a fiat currency (...) ”. I think the idea of ​​Dapp itself is good, but I disagree with this proposition, because to convert Ada into any other currency, be it a cryptocurrency or fiat currency, it is not necessary to pay any fees, this process can be done for free on cryptocurrency exchanges such as Binance, for example, and in a matter of seconds. So I don't think it's true that someone doesn't have the time to do something so fast, and that they don't have the resources, since it's a free conversion. The problem that I think is real is an approximate desin of how to create a digital wallet for payments in Ada, how to transfer from the wallet to the correct one, how to convert the correct currencies and how to send them to your traditional bank accounts. Receiving payments in Ada is also an issue due to its volatility, but that is not the crux of the matter as the bidder would just facilitate Ada to be converted into fiat currency, as I understand it, automatically. I think that Dapp is not well suited to the objectives of the challenge because it does not represent an idea that is enough to explain, this conversion, as I have already done, can be done quickly and free of charge on brokers that already exist, that traders are properly instructed to do so. Therefore, the project would contribute, popularization and wide adoption of our blockchain, not increase the technology expansion of the merchant community; precisely because it is something that already exists (even if it is not the same, but there are already simple and practical ways to do this). \n", "q0r": 2, "q1": "The roadmap provided is satisfactory, we know which phases would be developed (phase 1, 2 and 3), how long they would take in total and also by what smaller topics they would be formed. The presence of these topics breaks down the information about each of the phases, my only suggestion would be that the notion of time was divided into a smaller scale, that is, we knew how long activities 1.1, 1.2, 1.3 and so on would take to develop . If we knew this, surely our understanding of the process would increase and become more solid. However, the script is already good, this is just a suggestion to make it even more understandable in terms of time. Now, talking about the budget, the total amount is broken down into a few parts and these are generally well explained (e.g. we know exactly how many hours per week the developer and DevOps specialist would work; we know the total work time per month and how much he would get paid per hour, so the $28,800 allotted to his salary is well justified); however other parts of the funding should be explained in more detail as well, eg “1 scalable application server (6 months) = $6,400”. What server is this and why does it cost over a thousand dollars a month? What technical role would this service play for the whole? It would be interesting if this part was explained better so that all readers of the proposal, including those who are not very tech-savvy, could equally understand how the budget would be used for these more technical parts. Finally, speaking of the team, it is actually a duo; We know a good deal about each one, which includes their training areas, where they work professionally, examples of some experiences they already have and how they relate to the Cardano ecosystem. The only part that was left pending was the provision of their linkedin profiles, so that the information they were told could be substantiated. However, I still think a lot of confidence is given to this duo by the level of detail provided on their resumes. The viability is good overall, with only a few points to improve to make it perfect. \n", "q1r": 4, "q2": "Unfortunately, the auditability provided is quite superficial. As a way of monitoring the development processes, the proponents inform the time that each phase would take to complete, however these are very extensive intervals of 3, 2 and 1 month. It would be necessary for the proponents to prepare reports at the end of each month, explaining how the development of this project was, both in terms of tasks and partially achieved goals. The tasks in this case would be a summary of the work routine of all the professionals involved, if they did what was planned at the right time and in the right way (the script is well broken down in relation to the phases, so I think we have a good material to serve as a basis for this auditability); it would also be logically necessary for them to establish KPIs that indicate what should be achieved gradually. These reports should be made available to the Cardano community in a simple and practical way, so that we all stay abreast of the project's progressive updates. Regarding the final results, I found the chosen metrics to be completely numerical, numbers are indeed important, but I would like a qualitative analysis about the results of the project, its consequences for both merchants and the Cardano ecosystem. How has this Dapp contributed to our blockchain being more widely adopted? Despite the purpose being to convert Ada, did this Dapp allow more payments to be made with our cryptocurrency? Have merchants somehow become interested in Cardano's technologies and started to try to understand more about other of our technologies? And what was the impact to the local economies where this Dapp was implemented? I think that more comprehensive and deeper research would be needed on the measurable impacts/end results of Dapp, and that it also be shared in a simple way with all members of the Cardano ecosystem. Finally, my opinion is that auditability is not adequate, deserves to be further explored and more details need to be added here. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "I think this idea is cool, but something is bother me.. The problem statement is to find the practical means of accepting ADA payment. I am not sure the inclusion of fiat currency and stablecoin in the solution can effectively provide the solution. Taking payment in ADA and having it automatically converted to local currency would be very practical for sellers with no education about crypto. The one possible improvement idea I can see if what are the plans to spread initial adoption and awareness for those who may be reluctant to use the platform.\n\nTherefore, proposer gives us very good explanations about his dApp, so that we can understand well how his activities would work in practice. I recognize that it would be a project that could greatly benefit the Cardano ecosystem. I found that proposer make an adjustment to their budgets (Fund7: $156k -> Fund8: $38.2k), I hope these significant changes do not have a bad impact on the progress of this project.", "q0r": 3, "q1": "The script is divided into phases, each phase being very well explained through subtopics. In relation to this part of the proposal, I believe the author provides us with a very good amount of detail, so that we can have a very solid view of the process. The solution, though, seems still quite complicated since it needs the p2p trader, the merchants have to confirm within the time or time limit is reached. It will be better if the proposal includes \"the selling point\" of this app. Why should local merchants use this platform?\n\nSince proposer did the budgets cutting, and I see no marketing budgets in this proposal. If this platform is ready, can it attract merchants / users with no marketing? Will they find this platform individually?\n\nAlso about the team members, A number of members are still to be hired. I believe these vacancies are essential to get the proposal implemented on time (deadline 6 months). I hope proposer can get capable members to make sure this proposal can be implement.", "q1r": 2, "q2": "This proposal includes roadmap to track the progress of the project and the KPIs which is very transparent and useful to measure the success of the project. The author sets metrics to be achieved 6 months after launch. In this way, we would have something to monitor as the semester progresses: were the promised results really achieved? Therefore, I believe that yes, the author provides us with auditable information.", "q2r": 3, "assessor": "z_assessor_639", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is looking to create a person 2 person fiat exchange to help enable merchants to accept ADA payments that can be automatically converted into a fiat currency, such as a stablecoin. The problem is articulated and makes sense given the circumstances of the merchants who do not have time to do exchange transactions after every sale to a stable currency. The importance of lower volatility also offers insight into how this proposal could be impactful. It is clear how the ADA payment could be turned into a stablecoin, especially with the stablecoins soon to be released, however it is less clear on how they may exchange that to a normal fiat currency in the short term. The off/on ramps for normal fiat currency could likely be a blocker for many individuals where the business suppliers they use aren't accepting cryptocurrencies yet. It would have been good to understand these risks more from the proposal team and potentially outline some of the example users who could start using the solution immediately and would have fewer issues.", "q0r": 4, "q1": "For the timeline three phases are provided by the proposal team with the number of months it should take and an itemised list of tasks. For the budget break down the roles, hourly rate and number of hours are provided to create the final budget along with other infrastructure and admin costs. The team provide two members as the information but do not provide any professional profiles such as LinkedIn to verify their background. The proposal team also do not provide any existing code or Github repositories that would give evidence that they can feasibly execute the proposal. Due to a lack of sources as evidence it is hard to give a high confidence the team is able to execute this proposal.", "q1r": 3, "q2": "The team list out the phases as the key roadmap deliverables they will be tracking for auditing. They also mention that all IP will be open source and available on Github which is good for auditing and also for the community to learn from their work. The team also provide some high level metrics for tracking success such as number of merchants, number of transactions and number of p2p operations completed with some objective numbers. The proposal team mention this only includes 'This proposal ONLY involves the p2p liquidity exchange.' It would have been good for better clarity to make it very clear what they are executing for this proposal and then potentially link to other sources on the other aspects that are not covered. This clarity helps with improving the ease of auditing that the team execute what they have stated in the proposal.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Development of a dApp for merchants to receive payment in ADA, allowing automatic conversion to stablecoin or fiat currency.", "experience": "Developer for over 10 years, with experience C++, Java, C#, Python and Javascript. Stakepool Operator since Shelley Testnet, Plutus Pioneer."}