{"id": 405041, "author": "victorcorcino", "title": "Adatar.me Address Book", "url": "https://cardano.ideascale.com/a/dtd/405041-48088", "category": 26438, "amount": 10000, "description": "Making repeat payments currently in Adatar.me involves the search or multiple URLs.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=1834"], "media": [], "f6_assessments": [{"id": 7462, "q0": "The idea is very simple and super interesting, meeting the objectives of the challenge very well. It is about evolving a project that already exists, which is based on the following situation: our wallet addresses are very large and complicated, people are insecure about making transactions on the blockchain because they are not sure if any characters are wrong, so usually they do a test sending 1 ADA just to check if everything is ok even with the address created. This is quite problematic because, as the proponents report, it ends up causing people to spend twice as much on transaction fees. It is much better in fact if our addresses were shorter and simpler, this would convey much more security when receiving or sending our cryptocurrency. The idea of ​​this proposal is to create a list of contacts, that is, addresses, that are saved so that we can transfer or receive Ada more quickly and safely from frequent contacts. Let's imagine that a company decides to adopt payment in Ada and asks its employees to create wallets. Even if the group of employees is not that large, for example, it could be 5 employees, the boss would probably do the test transfer to verify that their wallet addresses are correct. This is problematic on two points: the first, which has already been explained by the proponents, in which the employer would pay double the fees (which gets worse if we are talking about executing the payment of 5 employees, as there would be a total of 10 fees paid) ; and the second problem would be the work it would take to get the addresses of each employee, this would take some time since each one has its own very extensive code. 582 / 5.000\nResultados de tradução\nIf this payment is made monthly, for example, if the boss already has a list of his permanent employees in his portfolio, he can select the payment in a much more practical way. That is, the evolution of this application really aligns with what we are looking for in the challenge, as the proponents themselves claim, the proposal would meet the following commands: “what needs do Cardano users have that can be solved by new applications?” + “which apps offer the most value with the least technical sophistication?” + “Integrations with existing products”. \n", "q0r": 5, "q1": "Regarding the script, I thought that the proponents could have been a little more specific about the activities that would be developed in the months in question, August, September and October. They tell us the main tasks for each month, but it would be even better if they had detailed each one more. For example, we know that in August we will be working on the “Address Book UX Design”. How will this be done? How will the designer propose this interface, what would his work routine be like so that this goal is delivered at the end of the month? My opinion is that the schedule is not bad, but also has a more basic character. Now talking about the use of funding, the amount requested for the project is 10 thousand dollars, the proponents explain that this funding would be used for the salary of the professionals involved. It would be $1,000 for the designer, $1,000 for the project manager, and $8,000 for the software engineer. I believe that, as with the script, a little more detail could have been delivered here. How many hours a day do these professionals intend to work? For how many days a week? Since the engineer will work part-time, would it be 4 hours a day of work, taking into account that a daily is usually 8 hours? I believe it is possible to understand the reason for this amount, and I really think it is fair for the proportion of the project and the benefits it will generate for the Cardano community, however I would be more pleased if these more details were provided. And finally, speaking of the team, in my view this part is perfect, we know the names, the professional roles and some past experiences of each member of this team. They are very experienced in their areas of expertise, having already delivered several projects and tools, and are very active in our community as well. Trust is also passed on because they are already developing this project, this proposal would be an evolution of the product. So, about the team, I really have no criticism to make as I think that part is already ideal. In summary, the feasibility is good, but deserved better detail, especially in the script part. \n", "q1r": 4, "q2": "The auditability of this proposal is high. The proponents claim that they will have a way of organizing themselves, through the Agile methodology (I would like to know more about this), and in relation to the community, they will create a “progress report that will be done through monthly meetings with the challenge team and coordinators' meetings with the IOG team”. In other words, it is very clear how the Cardano community could track partial results and gradual achievements. It would also be important for them to include in this report a session dedicated to talking about how the tasks were performed, that is, how the professionals' work routine took place in each month of this trajectory. Maybe this would be easier to visualize with the roadmap detail, but if they tell us about the goals and tasks, I think the auditability of the progress would be perfect. Now, speaking in final terms, we know that success is “successfully developing the adatar.me address book and getting users to use it to facilitate their asset transfers in Cardano”. We have a very accurate scenario that can be verified, did this really happen? Proponents also report what they expect to achieve for the project within 3 and 6 months of launch. I really believe that this idea will greatly benefit the Cardano community, because it would solve a problem that is common to all holders of Ada and digital wallets, and I think it would be interesting for proponents to conduct a user survey to find out how it went. the individual experience of each, as this application contributed to better adhesion of transactions on the blockchain. This research could be made publicly available to all members of our community. Therefore, I believe that the proponents provide us with good information on how the gradual advances would be perceived and what the successful scenario would look like, making it simple for us to understand (and monitor) if the proposal is following the intended path/results. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 10601, "q0": "Adatar is currently still lacking adoption very much. The number of users and adatars created so far is still well below 100. We can go to their website directly to verify. Based on the metroc or KPI stated in the initial proposal of adatar in Fund 6, we should have seen nearly 5,000 adatars created by around this time. There are various causes that can make the adoption of adatar is lagging. One of them could be the lack of interesting and useful features. If this proposal is voted for and implemented well, it might help to alleviate the adoption issue mentioned above. One of the the key impact adatar is trying to deliver is acting as a gateway by onboarding the general audience outside of crypto space to try using crypto as payment, and in this case exclusive to ADA for now. This will help the bottomline of Cardano adoption, though probably less impact on existing audience who is happy enough to use normal address format. Since they mentioned that many people are experiencing inconvenience of double transaction fee to make sure address is okay and got no problem, maybe the Loxe Inc. team can consider developing a feature that assist user to check if an address/public key is valid and has no issue to receive a transaction, just my two cents.", "q0r": 4, "q1": "Because this proposal is one of the Adatar series proposals that Loxe Inc. submitted, it is written just as fine as the rest. Well, what can I say more? Loxe Inc. team have written a lot of proposals to Catalyst, so they know what to write while presenting it clearly. The team’s track record is clear with the right skill sets to execute this proposal while also backed by a decent number of relevant experiences, both collectively and respectively. The timetable along with the items the team will deliver is presented in a concise and clear fashion. The duration is also within executable reach. Budget and its breakdown pose no problem and rates are standard in the industry. It is also comparable to other proposals both in this Fund and dApps challenge in particular. Overall, nothing seemed to be overstretched in my opinion.", "q1r": 5, "q2": "Loxe Inc. is no stranger in Catalyst and they had secured some funds previously. Probably due to this fact, they have developed a standard in their project management scheme both internally and externally. They mentioned Agile and monthly reporting to challenge and IOG team as concrete action to monitor progress and development which is an adequate and acceptable practice. I believe they will put extra effort into communicating with the community through their social media as well. The description of the success is fair in my opinion and metrics are stated in an adequate and explicit manner.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10808, "q0": "The proposal is aiming to create an address book -  a feature where users will insert the addresses of e.g. their next wallets, or relatives, friends, and have them on \"speed dial\". I find it very useful. From my personal experience, I performed the double send of tx many times (a situation when you are scared to send all your funds once, so you perform a smaller tx to check whether it arrives), so I can imagine that it would find application among many people, especially newcomers, which I believe could result in more adaptation of blockchain in general. ", "q0r": 5, "q1": "The feasibility of the proposal is on a high level, due to the fact that team is composed of loxe.inc, represented by 4 key members in the proposal. The rest of their team is found on the webpage, where are also posted their linkedin profiles. The budget requested is 10k, where 8k is spent on SW engineer per two months. \n\nThe expected roadmap is set to 3 months, with deliverables set to each month.\n\nTo improve proposal, it would be nice to see the following:\n\n1. given the fact that expected works are set to 3 months, a more detail could have been provided on expected hours spent\n2. the roadmap could have been divided more in a detail. I know it might seem redundant, if you are working as IT on a daily basis, but to approach voters from different fields and areas, it can provide more confidence", "q1r": 4, "q2": "The progress of the proposal will be measured by agile project methodology (for non IT voters - it lacks more detail, \"how it will serve to progress tracking?\"), and monthly reports. It would be nice to add where these reports would be put - webpage? any social media?\n\nSuccess of the proposal is measured by finishing the product, and a longer success (6 months) is that at least 50 percent of adatar users will have this address book set (it would be nice to see the current numers, how many users there are in total. It will not increase auditability, but it can provide more clarity). ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10941, "q0": "Dealing with wallet addresses is indeed an awkward process, although copy/paste is not a bad solution (really, the only safe solution to avoid human errors). Moving to a more user-friendly solution is a good goal, and an address book is a sensible solution that is familiar to essentially anyone who uses a computer. However, there are many kinds of address book and it would have been preferable to understand what specific features will be delivered in the address book -- surely for a proposal delivering only one feature, more detail would be appropriate.", "q0r": 4, "q1": "This is an experienced team that is well-regarded in the Catalyst community, and has successfully executed other proposals, including the original Adatar.me proposal. This is not a particularly complex software development task, and the budget for it is reasonable with a sufficient breakdown to be understood. There is every reason to believe that this proposal will be successfully executed.", "q1r": 5, "q2": "This is a software development project to add one feature to Adatar.me, so success will be measured by delivery of that feature. Reporting against the straightforward milestones for that development should be sufficient for auditing. ", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10945, "q0": "Known as the cheaper alternative for ADA Handle (and the one where you actually have to login), Adatar allows for using memorable addresses when transferring ADA. It was originally funded in Fund6 (https://cardano.ideascale.com/c/idea/367448) and is now a functioning product. This proposal is about adding an Address Book feature into Adatar. Would this be one of the applications that will provide the most value for end users in 2022? Probably not. Therefore the impact of this solution is not massive, although it does improve the user experience in their existing product. ", "q0r": 3, "q1": "It’s a simple plan with a simple budget and a somewhat simple implementation. They allow for a few months to tie up loose ends with their previously funded proposals before commencing work in August 2022. The team has proven themselves and there’s no doubt this would be delivered as planned. ", "q1r": 5, "q2": "The plan is quite straightforward and the feature is easy to understand even if you don’t have prior knowledge of using Adatar. In fact, the plan is almost too simple a plan. August: UX. September: development. October: integration. Even if the sum is only $10,000 it would have been nice to have a bit more meat around the bones. Internally, the team tracks their progress using agile methodology. Externally the reporting happens via Challenge Teams and the standard monthly reporting to IOG.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Develop an address book for Adatar.me.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans."}