{"id": 405110, "author": "revelar", "title": "Private Gated NFTs - Revelar", "url": "https://cardano.ideascale.com/a/dtd/405110-48088", "category": 26438, "amount": 105250, "description": "Projects don’t have a way to protect the consumption of public IPFS media enclosed in NFTs.", "f6_no_assessments": 5, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "I love the idea of a subscription-based business NFT model. I could see large fortune 100 companies using this as a way to gate subscription services and get rid of the credit card middleman completely. I would have liked to see some given examples of how this could be used in real world cases, since I'm having to make assumptions by just reading the proposal.", "q0r": 4, "q1": "Revelar isa well known entity in the Cardano ecosystem. I have full faith that you guys could bring this technology into reality. The amount of funds requested is costly, so would like to see a working example before catalyst spends over 100,000$", "q1r": 3, "q2": "As I stated in one of your previous proposals... I would like to see some social media integrations to help promote to the general user base, even if they won't be using your products. Thereby increasing visibility for the entire ecosystem. Wonderful idea, you guys have some awesome use cases for just about everything you propose!", "q2r": 4, "assessor": "z_assessor_1548", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement in this proposal is clear, and the solution proposed directly addresses the challenge question \"What are the key applications that underpin the application ecosystem on other platforms?\"  because providing gated or private NFT services would allow for more use-cases of NFT's where traditional business have relied on secured private databases. This increases the functionality and potential number of use-cases for cardano and NFT's. The KPI's are aligned with the challenge question: what does success look like? \"Novel and viable applications get built of top of Cardano attracting users. Integrations manage to pull in more adoption.\" I believe this additional use case can bring more business and use cases to Cardano. \n", "q0r": 5, "q1": "The team are highly skilled and experienced game developers. The proposal includes details about the team and the team members backgrounds and qualifications. The budget is reasonable and broken down into identifiable milestones, and a detailed 6 month timeline with 12x two week sprints. The budget is a little high, but reasonable for a team of this calibre. They have the resources and technical knowledge to complete this proposal, and they have provided detailed discussion of the potential risks, including centralization, NFT standard changes, and software delays, and addressed ways to mitigate them. ", "q1r": 5, "q2": "The proposing team has been transparent with previous catalyst funding, and has a section of their website detailing their progress for each. The proposal includes a clear roadmap with timeline and milestones. The KPI's will be available to the community, and they are providing specific quantifiable criteria for success: \"35 unique “Gates” or projects being created during the Launchpad access stage, and cohort retention of > 60% through the end of the project timeline.  ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is another proposal by Revelar, a company which has been working on Cardano projects since Fund6, using Catalyst funding. In this instance, ask for funds to build a private IPFS cluster and a DApp called The Revelar Gate, which would allow NFT projects to be built cheaper and faster.\nI have to admit that this proposal is very specific and technical and even though I have over 7 years of experience in the IT industry, I do not yet know enough about how NFT’s are created and what the issues in that space are for my opinion here to be very pertinent.\nI can only comment on how the proposal is written and what information is provided, and in that respect, it’s comprehensive as every Revelar proposal I come across. Regarding risks, the proposers identified 3: \n- this solution, by nature, will introduce a certain degree of centralization, in the form of this service being owned by Revelar, but to mitigate this, the tech will be open sourced in the long term\n- nft standard changes, meaning that currently the standard is CIP-025, but if this changes, it will have to be addressed in the future\n- software delays, which are a risk in any software project, but as a way to mitigate this, Revelar plans to re-use existing tech and they are also partnered with a company called Excellarate, which they can obtain developers from on demand.\nAll in all, in my opinion, I think this proposal effectively addresses the DApps and integrations Challenge. Score: 5.", "q0r": 5, "q1": "The proposers state that the deliverable here is an MVP of the above mentioned app and they also list the functionalities which will be expected to work, so this helps with auditability as well.\nThe timeline is outlined in a professional way through something that as a person with over 7 years of experience in IT I love to see: sprint planning. We are presented with the tasks for the next 12 sprints (2 weeks each for 24 weeks in total) in a very detailed manner.\nWe are also given a very good breakdown of the budget in weeks and cost per hour, my only observation being the calculations seem to be for 12 weeks, instead of 12 sprints. This is only half of the time needed to complete the proposal? Perhaps the rest is covered through other funding methods available to the company. I would recommend that the details here be explicitly stated, however, to avoid any confusion. I will also mention that even though the entire requested amount is large (105250 USD), it’s less than 5% of the DApps and integrations total available amount and I think it’s reasonable for the complex tasks they are undertaking.\nRegarding the team, we are provided with proper descriptions and social links for the company’s CEO, CTO and CCO. The fact that we are not given the profiles of the developers should not be concerning in my opinion, because it’s up to Revelar to do resource allocation based on their workload and which projects get funded, etc. It’s a common practice for companies (note: *companies*, not small projects and initiatives) to not name specific developers in Catalyst proposals (other examples include Five Binaries and dcSpark.\nTo sum up everything I analyzed above, I believe that this proposal is likely to be implemented successfully. Score: 5.", "q1r": 5, "q2": "For Auditability, as usually Revelar provided us with their website (https://catalyst.revelar.co), where they post regular updates on all their Catalyst proposals. As they deliver open source software, the appropriate repositories will also be synced with this Gitbook. We are not given specific KPI’s, but the demos at the end of each sprint will be made public, so that will be a tremendous help with the progress of the project.\nThis proposal will be considered a success if Revelar manages to deliver the MVP outlined in the Feasibility section and as a concrete target, they expect to have 35 unique “gates” (or projects) being created during the launchpad which starts in Sprints 10-11.\nRevelar has historically been very transparent and easy to reach, so I believe that with the information they have provided and with their openness, the community can easily audit this project’s progress and success. Score: 5.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "IPFS and NFT media were explicitly made for decentralised storage of open media. In case a particular media has to be private protected by secure encryption. IPFS may not be the ideal solution since without pinning it to a specific node that has the decryption capability, the media is lost. Therefore the proposal is for centralised storage; There is a need for more technical details to explain why this process is selected since there is a much better way to secure data in a centralised manner. The proposal also needs to bring out who will have the capability to decrypt the data. ", "q0r": 2, "q1": "The proposing team has combined experience of more than 20 years and has undergone prism and Plutus courses. They also have good experience in building major projects. Therefore there is a very high chance that they will be able to complete the proposal. ", "q1r": 5, "q2": "\nThe proposal is for a fund of $105250 half of which is for the pay of sr lead engineer at $135 per hour for 12 weeks. The proposal is expected to be completed in 12 weeks. These are relatively high amounts. The time estimation for UI/UX design and architecture design is for 2 weeks it also looks to be on the high side. A better-detailed plain with fine details for the budget would have added more value. The software is also not going to be open-source fully. Therefore there is more required for auditability than the regular reporting. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"q0": "This project generally seems like a useful tool to manage private NFTs and has the potential to be useful towards the Cardano ecosystem. The question that remains however is, how will the created tools be available to the public? With this unanswered, it will be difficult to assess the exact scalability and scope of benefit it will have.", "q0r": 4, "q1": "The planning is overall good. A good implementation plan is supplemented by a well-reflected contingency plan. The team is well-known and has a good track record. While the budget is transparent, it bothers me a bit that upper-end industry rates are charged for producing content that is not open-source.", "q1r": 4, "q2": "With auditability, the team of proposers has done a really good job. The problem and solution description are there and make it clear what is to be expected. A tracking tool is said to be provided and the success criteria add up.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Enter the Revelar Gate, it’s a managed private IPFS cluster to control access to your NFT media content, allowing for gated content.", "experience": "The Revelar team is a known contributor & has been received funding on several projects in previous Catalyst Funds. We have a growing team of experienced software architects & engineers from around the world, Plutus Pioneers, & startup experience to manage a bootstrapped project."}