{"id": 405211, "author": "jwayte", "title": "Self-Sovereign Health Records", "url": "https://cardano.ideascale.com/a/dtd/405211-48088", "category": 26438, "amount": 888000, "description": "Patient’s health records are stored in centralized databases where the patient does not own (nor can they profit from) their own data!", "f6_no_assessments": 3, "f6_rating": 2.444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 7469, "q0": "The idea is good in theory, but there was a lack of explanations to understand how this Dapp would work in practice and also how beneficial this would be for Cardano. It is a place where people can store personal information such as their names, addresses, ages, allergies, etc., as well as health-related data. First problem I've identified here: what kind of data? “Health data” is something very broad, and can include exams they performed, appointments scheduled, history of exam results, treatments they undergo, medicines they take, in short, many things that are not specified here. It is said that this information would be anonymously coined on the platform, and in case doctors/institutions wish to have access to it, a fee would be paid to people in Ada. This is the only relationship between this application and our blockchain, and honestly, it doesn't seem to be valid enough to justify the 888 thousand dollars requested as an investment. We do not know for example how often these fees would be paid; how those interested in this information would find this data; what is the approximate amount paid for each information provided; anyway, we know little about how this Dapp would work in practice. Besides selling their data, what could users do here? The proponent claims that furiously, Dapp would integrate other solutions pertinent to the Cardano ecosystem, such as our decentralized Atala Prism identities, that medical data would be processed through smart contracts (what data?) and etc. However, all this still seems like a promise to me, because we don't know when or how these other technologies would be integrated here. Unfortunately, I don't think that this proposal represents a good positive impact for Cardano, due to the lack of explanations of what the Dapp functions would be; and also for the lack of certainty as to how this would achieve the specific objectives of this challenge, which would be, in short, to popularize Cardano; through various strategies, such as: greater adoption of Ada (this would be done on a small scale, as I understand it), sum of new active members in the community (how to ensure that users of this Dapp will explore the other possibilities that Does Cardano have?), more active tokens being minted, more smart contracts being made on our blockchain, etc. \n", "q0r": 1, "q1": "The proposal's script is very superficial, not allowing us to understand with solidity what was to come. The tasks necessary for the accomplishment of the whole are not explained, they are only mentioned. For example, in “Developing iOS Apps”. What small activities would be necessary for this larger goal to be achieved? Mobile application development is extremely complex, requiring the continuous work of programmers and designers at the very least. What would they do here, what would their work routines be, what demands would they have to deliver weekly, for example? All activities are just mentioned, it would be necessary for each one of them to be broken down, so that we have a way to understand exactly what would happen, how, who would do it and when. Speaking of time, the given intervals are very extensive, each activity described would take months to be done, it would be necessary for the proponent to define more exact metrics of how we could control what would be done monthly, for example (ideally weekly). Turning now to the budget, the asking value is extremely high, the highest I have in all the proposals I have analyzed so far. To justify the need for an investment that takes on such a high proportion of the entire amount allocated to the challenge, it would be necessary for long explanations to be provided on how the amount would be divided; it would be essential that each of the parts was detailed in detail, so that we could understand how the money would be used and why so much money was requested. However, that is not what we see happening here. You see, the proponent claims that $270,000 would go toward \"leading engineering, full stack development.\" All that money would go to just one person? How many months would she work on the project, what would her hourly work be worth (and why so expensive?). Orders are $135,000 for Cardano Mithril lightweight client integration (what is this? Why does it cost that much?). Regarding the team, we don't know anything about those involved. We do not know their names, their resumes, previous experiences, how they relate to Cardano, why they are qualified for this project, their linkedin profiles, in short, we do not know who they are or why they would be qualified to develop this proposal. All we know are the necessary roles (founder, architect, project manager, dev ops, product leader, quality control, engineering leader, full stack developer, etc.), but it is no use knowing what kind of professionals would be involved and we don't understand who they are. \n", "q1r": 1, "q2": "The auditability of the process is practically non-existent. The following phrases are said: “biweekly sprints” and “incremental milestones”. But they are loose, it is not explained how the process would be monitored; we don't know what biweekly sprints are, nor what milestones would be defined so that we could verify if the partial results were being obtained on time and in the desired way. We do not know how the work of the professionals involved would be monitored, not least because we do not have a detailed roadmap that allows us to have exact knowledge of what would be done and when. For the situation to improve, it would be necessary for the bidder to first detail the roadmap, so that we have content to base ourselves on when monitoring the work routines of the team members. It would be necessary for the team to prepare periodic reports with partial advances, small monthly achievements, for example, and make them available to the entire Cardano community (it could be through a website they created, online tools like Notion, google docs, or even the our community's telegram channel, for example). The meetings with the IOG coordinators, in order to promote an audit of the process, were not mentioned here, it would be necessary for the team to maintain this contact with them as well, and that all updates discussed in the meeting were duly disclosed to the members in our ecosystem . Speaking now about the final results, the auditability of this part is also basically null, because the proponent does not inform us anything different from what is already described in the impact of the proposal. How could we find out if the project was so successful in terms of benefiting users, in terms of controlling their health data, if they are somehow profiting from it, receiving in Ada, investing the amounts received...? And mainly, as we can see in a verifiable and objective way how all this reflected in the Cardano ecosystem, if these users would be getting involved with the community, becoming active members, understanding what is the differential of Cardano in relation to other blockchains, if they would be acquiring more Ada in addition to what is provided as rewards in Dapp and etc. We don't know how to measure the success of either Dapp itself or its impact on our blockchain. It would be necessary for this information to be gathered, and as with the partial results, it would need to be made available in a simple and practical way to all members of our community. In general, the proposal is not auditable at all. \n", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 6791, "q0": "Securing a person's health record in their mobile and sharing it with health care providers on the content and an option to monetise the use of one health record is an emerging requirement. The proposal addresses a critical use case for Cardano and DID solutions.", "q0r": 5, "q1": "The project is large and has a very significant multifunctional team. The proposer claims 20 years of experience in a leadership role in IBM. This is a significant advantage; however, there are no references to his past work is enclosed, and the website reference is a under-construction site. Detail of the team which the proposer wished to use will add value to the proposal. ", "q1r": 2, "q2": "The project has been estimated to cost 888K USD based on block calculation of hiring charges. For a project of this size, there is a need to develop a project document and a management structure for overseeing the implementation. Therefore it would be better if the proposal is first made to prepare a project document with detailed budgetary calculation. With the available information regarding the scope of work and the tasks breakdown, it is very difficult to estimate the audit ability of the proposal. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7252, "q0": "The problem statement is clear and easy to understand, as it points out a well known issue: user data (health records in this case) is owned by companies and is kept in a centralized database, meaning the user cannot control it easily. The solution to the problem however, is a bit confusing to me: “Securely store health records on your phone”. Throughout the rest of the proposal, it seems to be confirmed that the intention is to store data on the phone (not the blockchain). As a person with 7+ years in IT, I personally don’t see how this solution can work. Phones can be lost, stolen, broken etc. Data is supposed to be stored in a remote database (centralized or decentralized), where it is kept safe. It is stated that in later stages, an integration with Atala Prism is possible, but until then, the question of how this data is kept safe remains.\nThe rest of the plan here is to have this app that stores your data integrate with a healthcare industry standard (FHIR), so that your conditions and treatments can be anonymized and subsequently stored in a database, so that medical researchers and insurance companies can make use of it for a fee, without affecting your privacy in any way. The incentive for the users and healthcare providers to share this data would be ADA payments in this app, that would integrate with a crypto wallet. All in all, sounds like a very cool idea, but I’m still concerned about the part with data being stored on the phone - I wish the proposer had explained this better.\nIn regards to risks, there are several pertinent ones outlined, but unfortunately, the proposer has not also mentioned ways they can be mitigated - this is an important part of the risks section.\nDue to the above concerns I cannot fully agree that this proposal effectively addresses the challenge (giving it a score of 4).", "q0r": 4, "q1": "The proposer claims to have 20 years of experience in software development and project management at IBM and also at a start-up, but unfortunately there are no social links to verify this (please consider adding them in the future, it’s an important part of Catalyst proposals). I found the relevant LinkedIn profile easily enough, however: https://www.linkedin.com/in/julian-wayte and it seems to confirm Julian’s experience.\nThe roadmap here is very well broken down, as well as the budget for the next 18 months. 888k USD is a large sum, but for the project Julian is proposing, I think it’s realistic. My only recommendation to the proposer is that it would probably have been a good idea to split this up into several different proposals (preferably across different funding rounds). For example, you could have asked for funding for getting the project started and building an MVP of the app in 3-6 months, which would have meant asking for less funds and being more likely to get funded (asking for ⅓ of the funds in such an important challenge is unlikely to succeed I’m afraid).\nI also think it would have been worth talking about an Android app as well, since that makes up almost half of the mobile market at the moment, along with iPhones.\nIn regards to details about the rest of the team, the intention here is to use a contractor called Bacancy, which seems like a viable option. A company like them could provide all the required resources for a project like this.\nGiven Julian’s experience, I think the proposal is highly likely to succeed, but I can only give a score of 4, since a complicated project like this one will have many hurdles to overcome, if it gets funded in the first place.\n", "q1r": 4, "q2": "The proposal is a bit lacking in the Auditability section. The purpose of this category is to outline KPI’s, metrics and milestones which would help Catalyst track the project’s progress. Unfortunately, these are not provided.\nOne option here would have been to provide a Github and state a target for github commits per week, month etc. Also, since the project would be Agile with 2 week sprints, it would have also been an option to provide Catalyst with demo’s of the progress at the end of each sprint, or every two sprints, etc.\n\nUnfortunately, due to the lack of information here, I can neither agree or disagree that the information provided here is sufficient to audit the progress and success of the proposal, so I am giving it a score of 3.\n", "q2r": 3, "assessor": "z_assessor_546", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Securely store health records on your phone, check-in to a new healthcare provider using a QR code. Get paid in ADA for (approved) data use.", "experience": "20 years experience in software development, people and project management at IBM, and cloud native start-ups (Uptycs.com)."}