{"id": 405271, "author": "adosiawolf", "title": "Uber of 3D Printing Manufacturing", "url": "https://cardano.ideascale.com/a/dtd/405271-48088", "category": 26438, "amount": 275000, "description": "Custom manufacturing services are expensive. Peer-to-peer manufacturing platforms currently do not exist. We need better Cardano full nodes.", "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal intends to create an open p2p marketplace combined with Cardano smart contract, NFT metadata and Adosia ADO tokens, a good way to develop the Cardano ecosystem by enabling monetization of 3D designs and print jobs. As an IoT technological person, I found it will have good impact but it could be improved if the proposer provides some evidences to show expensiveness and limitation of the custom manufacturing services to enhance the impact of the problem, for example comparision fees of traditional ordering process from the 3D designer and manufaturer to users or so on.\n\nThe proposal is scalable and has inherent growth and longevity using a unique solution, bring its competitive advantage compare to other competitors by giving the outlined process with expected MVPs, identifying what is missing for full experience, using Cardano Box to connect and pull data from the Cardano blockchain(SpacePrinter),...\n\nThe proposal justified its relevance to the challenge brief and identified a desirable outcome that is relevant to the goals of the challenge through clear and understandable explainations on how this new application integrated to existing products and deliver the highest amount of value, boost NFT marketplace and utilise the power of smart contracts.\n\nThe proposer also identified many challenges/risks in establishing and consolidating the decentralized 3D printer operators network, shipping logistics and provide the ways to mitigate by incentives for serving the protocol such as: aiding in dispute resolution (quality), software development, decentralized operational infrastructure,...\n\nIn general, I found this is a perfect propsal and not many things to concern in its impact to the community.", "q0r": 5, "q1": "The proposal uniquely equipped all member relevant skills to implement their solution successfully with clear roadmap, planned milestones, main deliverables and outputs of the project.\nThere are reference links on Linkedin and Github to publicly identify capacity and works of each member so undoubt to think that this team uniquely equipped to address this problem and execute on their proposed solution.\n\nI found a marketing staff/expertise shortcoming in their composition that the Author considers to equip to ensure a rapid time to market and quick turn to operational sustaining revenue. But I think proposer has calculated in marketing budget but not provided here.\n\nThere is a cost breakdown in the proposal that is generally reasonable but it could be more detailed in working labour hour and hiring fee for each items, especially the budget for 3D Printable NFT Marketplace ($85k) is not explained clearly how NFT value sale/testing fulfillment and delivered step by step within 4 months?\n\nAs a whole, the proposed solution is reasonably within reach given the requested budget.\nThe progression of KPIs and their associated values are reasonable with the regards to the problem, the complexity of the solution, and the team's capabilities. KPIs are generally measurable.\nThe proposer clearly explained architecture and technologies for successfully implementation the proposal. But the only thing I concern is the Buffy Bot used in Smart contract and NFT marketplace that need to provide more information about it sometime just need a web link.\n\nThe author gave out marketing task and budget but it'd be better if it has a marketing plan with detailed about type of media, channel and target audience to compaign and boost the market.\n\nIn common, I highly appreciate about the feasibility of this proposal and hope it will be funded and deployed under a good supervision.", "q1r": 4, "q2": "The proposal gave a clear 3 phases roadmap but it could be positive if the proposer give out a reasonable timeline with each phase and items such as: the first phaste is 3 months from funded. With regularly 6 times per week teams meeting, I think it's helpful for community tracking how the proposal is progressing. But it is more audited by proving an updated item even on the Adosia Whitepaper for the community regularly track relevant action items, tasks, needs and progress.\n\nThe proposal's KPIs and other measures of success are auditable and available but it need reasonable effort of the community. I suggest to improve the KPIs for example: the number of NFT sole each month before marketplace, how many 3D printer operators and business attracted each month,...\n\nBut anyway, this proposal is still audited by the community with all given information.", "q2r": 5, "assessor": "z_assessor_775", "no_vca": 5, "ne": 3, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "The proposal tries to create a 3D printable NFT marketplace that houses user-submitted 3D printable NFTs which contain one or more .stl files along with any designer royalties referenced in the NFT metadata. Users will be able to buy an NFT of a purchase order that will allow them to choose to print one of our special designs via a registered space printer. The printer will then ship the 3D object to the user. I found the ide is very interesting and can bring great value to the Cardano ecosystem. They are also already running the project with an experienced team. The team also provides the potential risks that they may face and the team has a reasonable solution to overcome them. With the resource, experienced team, and the thorough plan they have I think the proposal has a great chance to be successfully implemented.", "q0r": 5, "q1": "The proposal has clear milestones but not a roadmap with a time horizon for the milestones. It would be better if the team provide the phases on a timeline, for example, the first phase for the first 3 months, the 2nd phase for the next 2 months, and the final phases for the following 3 months. The team provides detailed budget information but due to their very high budget requirement, some items need to be explained in more detail. For example, they stated $85k goes to 3D Printable NFT Marketplace, how much of the dollar goes for the remuneration of the developer? How much goes to pay the hosting name? Or to pay the server? the $40k for the smart contract development / expert consulting fees also needs to elaborate more. The proposal elaborates the background and experience of each team member, they also give a LinkedIn profile for each member. The LinkedIn profile made the community can easily verify their funding goes to the legitimate team.", "q1r": 4, "q2": "Metrics and KPIs for success are clearly defined but are not measurable enough. For example, adding participated more than 100 3D printer operators, more than 50k$ revenue/month, or more than 100 NFT sales in the first-month release, etc.", "q2r": 4, "assessor": "z_assessor_1342", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I believe this proposal is very suitable for this challenge. Manufacturing services are expensive and almost not exist at this moment. Take 3d printer as an example, this proposal will show the world that decentralized manufacturing is possible and will soon be a reality. If successful, this will bring up a totally new chances that we can provide decentralized manufacturing services.", "q0r": 5, "q1": "The plan is clear  and well defined. They also suggest several solutions for their ideas. The budgets are break down carefully. The team is rich of experience and qualified. I have checked their Github, websites and documentation. Honestly, I was really impressive of what they have done and respect efforts they put on the projects. ", "q1r": 5, "q2": "This project is an extension of Fund7. I have checked the progress of the team in Fund 7 and do feel satisfied with their progress. What I need to see that the author should give specific metrics to audit this project. In general, I do hope that they can be funded in this round too.", "q2r": 4, "assessor": "z_assessor_1623", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal aims to integrate a peer to peer manufacturing marketplace to help designers to monetize their works. \nThe proposal effectively addresses the challenge by providing a case study to prove the application of smart contracts in real economy to satisfy a consumer and business need (quick and cheap 3D printing manufacturing).", "q0r": 5, "q1": "The team provided their LinkedIn profiles, and shared the link to previous proposals, one of which got funded in Fund7. The adosia white paper was also provided, which lists very accurately the stages of the 3D printing from design to shipping, https://logicalmechanism.gitbook.io/adosia-white-paper/\nThe app used (Space Printer) has been studied to run on a Rasperry Pi and the team provided two possible solution for the app to pull data from the Cardano blockchain and feed them to the 3d printer\nIn order to make the marketplace even more complete, I would suggest that users can upload their own designs to then trigger a request for a 3D print, and not only choose a pre - made design by a third party. \nAs the marketplace would be delivered in 4 months after funding, I wonder how the marketing would be effective in that period of time to attract a sufficient number of users. Most of the time a project fails because of the very small pool of users that is collected before the project starts.", "q1r": 4, "q2": "The team provided a general flow chart of the whole process from a customer point of view. The stages of the project are well summarized, and they include a first proof of concept NFT to test the process and raise additional fund, a 2D to 3D conversion, and finally the full marketplace implementation.\nThe budget breakdown seems overestimating some items such as smart contract auditing (50K USD), and the total amount is 275K USD.", "q2r": 4, "assessor": "z_assessor_530", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Such a project would definitely bring huge value to the Cardano ecosystem and to the NFT space. This projects also specify how it aligns with the challenge which is reasonable. Such a project definitely has the potential to have a global impact in the NFT space. The scaling also is covered by the description, the only problem I see is the ability of the project to assure good faith in the dapp when having large number of users. ", "q0r": 5, "q1": "The team consists of prominent figures in the Cardano ecosystem most of which had some projects funded in Catalyst before. Their experience would make such a complex project achievable but still with many risk that they discussed in their proposal. Furthermore, they specify their budget and the time frame in great detail and also with much technical information detailing the solution.", "q1r": 5, "q2": "The project specifies many milestones and a specific time to produce an MVP that will show the community if the team is doing well or not.", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "Decentralized manufacturing is a radical and innovative concept. This proposal is offering something very impactful: basic infrastructure for an economy of users, designers, and printers to transact with each other through smart contracts. The proposers are well into the development of the project and will continue development regardless of the outcome of this proposal, which speaks volumes on their conviction and drive. The team is also thinking of self-governance for Ardosia's future. The proposal addresses this aspect of the Challenge: solutions utilising the power of smart contracts. Furthermore, the printer registration process has already been started by the team and may interest outsiders on the promising features of blockchain, potentially increasing adoption. In my opinion, this proposal would benefit the Cardano ecosystem and if successful, would be a good step towards decentralisation of society. \n\nAs a side note, this proposal presents the information clearly, simply, and comprehensively, and I think readers would be able to fully grasp the team's vision. Amazing proposal.\n\n", "q0r": 5, "q1": "The proposal includes a clear roadmap. The team will launch SpacePrinter, a dapp that will give the 3d printer access to the smart contract marketplace, and CardanoBox, the underlying application for CardanoOS. I am guessing this is needed for user to create purchase order NFT, or for designers to upload their designs. I think it can also be used for other purposes where a node is needed. But some clarification in the proposal on where it fits into the Adosia ecosystem would be helpful for non-technical readers like me. \n\nThe 3 steps(spacecoin rockets, 3d lithophane, then full marketplace) makes sense and I expect participation from the NFT crowd.  A budget plan is included and it includes marketing. The team members are also experienced(with references) and their projects are well-received in the Cardano community. In short, I think they would get a good reception and have excited users using their marketplace. \n\nI think the proposal could benefit from a time horizon in the roadmap.", "q1r": 4, "q2": "The team seems to have good communication and documentation in between them, but the proposal does not include links on where community can drop in and check progress. The proposer has defined success in the proposal and expects delivery of marketplace in 4 months. A suggestion for quantifiable metrics could be: X number of onboarded 3d printers from Ambasssador program, X number of printed nfts, X number of Cardanobox made.", "q2r": 4, "assessor": "z_assessor_948", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Create new economic opportunity by deploying open p2p marketplace (Uber of 3D printing) to enable monetization of 3d designs and print jobs.", "experience": "The Adosia team has a proven record of deploying highly successful projects on Cardano and includes Kyle (CEO DripDropz), Quinn (smart contract dev DripDropz, Tokhun), Mike (seasoned multidisciplined engineer), Jia and Jonpaul (SpaceX engineers), Ron Hill (SPOCRA) and many others"}