{"id": 405209, "author": "victorcorcino", "title": "Adatar.me to NFT", "url": "https://cardano.ideascale.com/a/dtd/405209-48088", "category": 26438, "amount": 80000, "description": "The adatars created at Adatar.me are not tradable NFTs at present.", "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a straight forward and easy to understand proposal.  This proposal in an improvement of a previously funded project \"adatar.me\".  New features are added to the Dapp that will increase the use of adatars and make them tradeable.  The proposal meets the challenge's criteria and attempts to increase utility and adoption of Cardano.  It attempts to increase usability through the extra features added e.g. the minting of NFT that would make adatar tradeable. The problem statement is clearly stated (adatars created at Adatar.me are not tradable NFTs at present) as well as the solution to the problem (convert adatars to Cardano NFTs).  The goal and metrics are aligned to the challenge. It is unclear to me though how the lack of adoption will be tackled (pointed out as a risk). ", "q0r": 5, "q1": "The team is highly experience and known to the Catalyst community from the previously funded project .  They can implement the project in full and perhaps in less time than the one indicated in the timeline.  The breakdown of the budget is specifies how many people will work on the project in regards to the technical part.   What is unclear to me is how will the team go about the marketing and outreach partnerships. Who will perform this task? Who is the population they want to attract? Is there an indicative number of users when the addition is completed? Breaking down the budget in regards to marketing will clarify further the roadmap of the project and the deliverables. Technically wise, the project is feasible and can be performed by the proposed team.  Marketing wise, the team does not specify someone that will perform this task including the marketing goals that justify the 8K.   ", "q1r": 4, "q2": "In regards to auditability, the proposers provide some information but it is not clear enough as to how will the KPIs will be transferred to the community.  How will the community follow the development of the project? Will meetings as defined in the proposal be enough to show deliverables, or other actions may be needed for this to strengthen clarity and auditability?  Furthermore, financial reporting other than working hours should be considered (marketing process) as the amount requested is not fully justifiable. ", "q2r": 3, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This meaningful proposal seeks to Integrate NFT minting onto the platform to convert adatars to Cardano NFTs. In term of impact, some issues that should be noted as following:\nFirst of all, the problem statement is simple and clear and relevant for the given challenge, solving this problem may have positive contributions for achieving this challenge's goals and KPIs. Besides that, the solution has been well-written supported by a detailed roadmap with milestones and measurable metrics [Number of new Adatars created as NFTs, Number of Adatars migrated to NFTs] for measuring the success of this proposal, as a result, transparent positive impact for the Cardano ecosystem in the long term can be seen. This solution shows the possibility of adding value to the Cardano ecosystem and scaling to address future challenges by further directions beyond the scope of this proposal.\nBased on the given information, I can rate the impact of this proposal with a score of 4", "q0r": 4, "q1": "In terms of feasibility, there are some issues that should be noted, including:\nFirst of all, this team is consist of funded proposers with provided profiles that were described enough for understanding show suitable skill, experiences for implementation, however, there is not any reference/proof (documents/links,...) for confirmation; I think it would be great if some external link of each profile provided for confirmation. This proposal's goal is clear and realistic supported by convincing arguments, along with a quite specific roadmap, some logical, measurable KPIs/metrics, and a budget breakdown for assessing the detail of the implementation process. Risk is defined but not clear enough, and without any mitigation.\nBased on the given information, I can rate the feasibility of this proposal with a score of 4.", "q1r": 4, "q2": "Generally, there is a lot of information provided. Firstly, as can be observed, this team description is sufficiently explained and offered for comprehension; but, there's really no source (documents/links, etc.) for reviewing the information. Secondly, the roadmap is adequately described for comprehension. For measuring the success of this proposal, the proposer(s) choose some measurable KPI/metrics [including number of new Adatars created as NFTs, number of Adatars migrated to NFTs]. This proposal provided a total budget, with a clear structure, however, there is no explanation of the calculation base [number of employees, number of working hours, labor price,...].\nIn conclusion, based on the provided information, I agree that this proposal provides me with adequate information to evaluate progress toward the proposal's stated objectives", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The “Adatar.me to NFT” proposal requests funds from the Cardo Treasury to build an NFT minting engine for the adatar.me service that is also a Catalyst funded initiative from Fund 6.\n\nWhile this, in theory, addresses the criteria set by the Dapp and Integrations challenge setting I've identified several issues that may limit the impact that this project could have on the Cardano ecosystem.\n\nAfter visiting the adatar.me website I've discovered that only 96 users have signed up and only 76 adatars have been created so far (at the time of writing). Considering that the project has received the exposure of being a successfully funded Project Catalyst initiative I find these numbers to be very low and may be a signal of disinterest from the community towards the project.\n\nThe proposers identified this risk and plan to mitigate it by allocating a percentage of the budget towards marketing but after taking a look at the budget I've noticed that only $8000 were allocated, which I find to be completely insufficient (see also my note from the Feasibility section of the assessment). For instance, the adahandle standard has already gained a lot of momentum in recent months and already has tens of thousands of handles minted as NFTs and in use today. On its current path is set to become the standard for ADA. The team probably has a good plan to tackle this challenge but my rating reflects the content of the proposal and there just isn't sufficient info in this iteration of the proposal.\n\nApart from this the asking price of $80,000 for creating an NFT minting engine is rather high, as such I don't see it as a value investment for the Cardano Treasury at this point. To be clear there may be very good reasons why the team is asking for this amount, such as developing an entirely new and innovative way of minting NFTs through smart contracts that could benefit the entire community later on, but that is simply not described in the proposal. Simple NFT minting engines should be way cheaper to build as there are already countless examples running on the Cardano mainnet that can serve as a template for the team and speed things up considerably.", "q0r": 3, "q1": "The implementation plan provided in the proposal is sufficiently detailed and makes sense given the scope of the project.\n\nThe budget is broken down as requested, with each expected task having its own separate budget line.\nHowever, in order for the Catalyst voters to know exactly how the Treasury funds will be allocated, the budget breakdown should have contained hourly rates attached to each one of the described tasks. As it stands now the budget simply mentions the cost per month. It's not clear from this if that refers to full-time (40 hours/week) months or part-time months or otherwise how much volume of work exactly the requested amounts represent. For this omission, I have subtracted a point from the final score for this category.\n\nAs I've noted in my assessment of the potential impact of this proposal, the budget seems pretty high for developing a standard minting engine, if that is indeed what the project intends to deploy. I would like to point out that I don't have a problem with the requested amount of $80,000 specifically, however, I think there's not enough justification provided for it and I much rather would have preferred to see it allocated differently - for instance half the budget, $40,000, going towards marketing and creating awareness about the project. The project certainly has potential and there seems to be a highly skilled team behind it however I don't see the value proposition in developing a product that nobody knows about or uses. (The team has submitted a separate proposal for the growth of the adatar.me platform “Adatar.me - Growth Acceleration” https://cardano.ideascale.com/c/idea/404995 but I found that to be inadequately budgeted for and as such with little potential impact). I have subtracted another point for the lack of clarity around the exact type of work that the project seeks to do (the exact type of NFT minting engine that they plan to deploy).\n\nThe team describes itself in great detail, and if taking into account the provided credentials, they should be more than sufficiently capable of executing the scope of this proposal. However, I would recommend the inclusion of links to professional profiles or examples of other relevant previous work, so that the community of voters can easily verify their claims.", "q1r": 3, "q2": "The KPIs, milestones, and metrics provided in the auditability section should enable following the progress on the proposal and its deliverables with ease.\n\nI very much appreciate that the team has taken the time to include in their definitions of success not only what they view as the overall goals of a successful deployment, but also the expected evolution of a successful project over time, 3, 6, and 12 months. A lot of projects have omitted this in Fund 8.\n\nHowever, since the score for this section also tracks the clarity of the proposal overall I have subtracted one point from my final score for the reasons mentioned in the Impact and Feasibility sections of my assessment.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Note to VCa : this proposal being very similar to several other proposals by the same team, my assessment may include similarities, intended to explain to voters the big picture project of the team.\nThis proposal offers to integrate NFT minting in the adatar.me platform. \nThe proposer claims that if Adatars are minted as NFT, it opens the way to more adoption of the service and to gamification. The added value I agree on is that after sending the Adatar to a new address, all payment to the Adatar would be rerouted to this new address. However, it is unclear to me how this rerouting would work, and I recommend to the proposer to make a step-by-step description of this process/use-case.\nAs another use-case, it is said that Adatars would become an asset on Cardano’s Blockchain and become tradable. While true, I don’t see how one would want to buy an Adatar to someone else, that is buy a sort of web address pointing to the address of a wallet one does not own.\n\nThe proposer should elaborate the use cases, give more concrete example of the potential brought by turning Adatars into NFT. This proposal would meet the challenge if this demonstration was stronger, but from my understanding I disagree that this proposal effectively and heavily improves the application. \nNote to summarize for voters what adatar.me does (previously funded proposal): it offers to simplify ADA payments between people by offering an avatar connected to a wallet address and a search engine. It should avoid dealing with long wallet addresses and avoid copy-pasting in payments. \n", "q0r": 2, "q1": " The team does not anticipate a risk in developing a NFT minting module. The roadmap and budget breakdown show that the structure of the coming work is well anticipated.\nConsidering the Loce Inc team is identified and has proven its ability to deliver, I strongly agree that this proposal will be successfully implemented.\n", "q1r": 5, "q2": "Progress reports will be provided by the team according to the roadmap. Kpis to measure the success of the project are centered on the number of Adatars minted or migrated to NFTs. \nTo assess auditability, I also consider how Loxe Inc Team has reported in the past (see adatar.me gimbalabs playground session for example).\nI strongly agree that the community will have the capacity to monitor this project, if funded.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Current version of Adatar delivered through Fund 6 is addressing quite an unique issue and gives differentiation when compared to similar project like adahandle. However, this proposal in Fund 8 currently feels like reinventing the wheel by adding feature that currently the community already enjoyed from adahandle (which is already up and running in mainnet). I cannot see the urgency to fund this proposal, at least in Fund 8. When I am checking the adoption metrics (10,000 adatar(s) created around mid-2022) as they described in Fund 6, we are behind by a considerably wide margin. At the time of writing this assessment, just 75 Adatars have been created so far. Catalyst needs to fund other more urgent projects in this challenge for now, especially considering Loxe Inc.’s asking price. On the other hand, Loxe Inc. is submitting a proposal to help with the Adatar’s adoption and growth acceleration in F8 Misc. challenge. That one might be more urgent to be funded. I digressed. Still, I might be wrong and this adatar-as-NFT additional feature we can fund in Fund 8 is the thing they need to be more widely adopted. This may very well be a chicken and egg situation now so I can rate no higher than 3 stars. Maybe other community advisors and voters can have a fresher and brighter perspectives compared to mine.", "q0r": 3, "q1": "Loxe Inc. is an experienced team and reputable member of Catalyst. Their resume will be able to handle the implementation of this proposal if the community does wish to have this NFT feature promptly through votes. Plan and timeline look well within executable range and evaluated every two months starting from August through December 2022, which is to be expected since Loxe Inc. is accustomed to writing and had written many good proposals during their participation in Catalyst. We should have no  issue to know what to expect during those period. Budget is also fair and reasonable with fine details. I agree with them that the implementation risk is low (if successfully funded) since we already have a similar concept implemented and running in Cardano blockchain through adahandle. Adoption is currently a tough challenge for them to solve but this proposal will allocate USD 8,000 as a separate budget for marketing and outreach, which hopefully mitigate the risk and occurring issues.", "q1r": 4, "q2": "Relevant metrics and KPIs are selected and detailed explicitly throughout 3-,6-, and 12-month period so I believe it is up-to-standard. Their Agile methodology is also a common framework in project/software development and a highly acceptable practice to manage the internals. I also doubt the team will miss the reporting and monthly meetings with challenge team and IOG deliberately. Team and individual social media are managed good and also in regular basis. We can easily meet the core team members in Catalyst activity such as Town Hall. Loxe Inc. has been a responsible and delivering proposer so far and no doubt they are a valuable member to the community. I trust they will maintain-if not improve their great contribution and service into the future.", "q2r": 4, "assessor": "z_assessor_943", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Integrate NFT minting onto the platform to convert adatars to Cardano NFTs.", "experience": "Loxe Inc. team, experienced and hackathon winning group of Plutus and AtalaPRISM developers, Gimbalabs PPBL veterans, UX specialist, art direction and designer."}