{"id": 405338, "author": "leminhtuan0810", "title": "Decentralized Metaverse Mall - DMM", "url": "https://cardano.ideascale.com/a/dtd/405338-48088", "category": 26438, "amount": 76320, "description": "Only 6.1% of Vietnamese own cryptocurrency, how to convert non-crypto to crypto users and keep them in crypto space[1]", "f6_no_assessments": 6, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 7471, "q0": "I think this proposal fits more or less with the objectives of the challenge. The idea is to launch a platform called Decentralized Metaverse Mall (DMM), which will use “blockchain, metaverse, Web3 and the very Web 2.0 of partners such as online merchants, payment gateway, auction house to create the first Consume to Earn (C2E) model. )”. The goal is for the Vietnamese to start using more cryptocurrencies, according to a survey cited by the proponents (it is very positive how they attach the link to it, proving its existence), few natives of the country actually use technologies from the cryptographic world; however, there is great interest in accepting cryptocurrencies, with people claiming that they would use them as an investment or even to make purchases of products and services, currently. Therefore, the proponents intend to take advantage of this gap to create a platform that captivates people to use cryptocurrencies, more specifically Ada and a so-called C2E, which would be created in this ecosystem, which for me is a problem; why not just Ada? We don't know how many % would be accepted from Ada and how many % from C2E, so we have no way of predicting how our blockchain will benefit from this. Maybe they use their own currency and have included Ada so that it was justifiable for the project to be released on Catalyst, anyway, that worries me. Returning to analyze the platform that would be created here, the proponents claim that people would be rewarded when they carry out transactions with partner merchants (a way to encourage the target audience to use this application). Another point that concerns me here is that the proponents do not explain whether other technologies pertinent to Cardano would be used here, or just our cryptocurrency. Would smart contracts be coined? Would users of this platform be somehow encouraged to use other Dapps? Would the Ada that could be received as cash back be invested in some pool? Anyway, I found the idea very interesting, its target audience is certainly promising, one for the key to be invested by our blockchain (including I already have several proposals that talk about Vietnam, so I'm sure about that), but I don't think it stays explicit if Cardano would benefit so much and not as during this project. \n", "q0r": 2, "q1": "The proposal script is very basic, that is, we do know what would need to happen for the project to be developed; however, all in a relatively superficial way. The whole process is divided into 3 phases, and for each of them, we know the most important tasks. What I think could be modified, in order to improve, is the temporal division. For example, in the first phase we have several tasks, we know that together they would amount to a time of 2 months; but how long would each of these design-related actions take to materialize? Could some of them happen in parallel, or one at a time? I think if the proponents had been more specific about this time division issue, our understanding of the whole would be solid. Phase 2, for example, would take 4 months, and 3 tasks are explained (building the website, the Dapp (for mobile devices) and the DMM platform, along with the integration of APIs from partners). Because these activities are complex, I think it would be necessary to go into more detail about each one. For example, building the website encompasses several small actions. Who would make them, in what way, and through what work routines? Regarding the explanation of the financing, I found this part better, the proponents explain how the total amount requested would be distributed, and each part has a parentheses that better details what would be done there. As in infrastructure and data design, we know that it would consist of: “server system, network, security, cloud services, customer data, 360 customer profiles, etc”. We also know the hourly price of the professionals involved in each of the parties, that is, the understanding of how the requested money would be spent is very specific and adequate. Finally, analyzing the team involved, this part is also very good. We know the names of the professionals involved, their roles in this project, a very well explained curriculum containing previous experiences and how they relate to Cardano (and if they do), social network profiles where we can verify what is said... part of the proposal is impeccable and exemplary, as it is explained in great detail who each person who makes up the team is, conveying total confidence in the team. Therefore, the only suggestion I make is for the script to be more specific in terms of time. \n", "q1r": 4, "q2": "Auditability is excellent when it comes to process. Proponents define several specific KPIs for each phase of the project, and say that partial results will be made available on a website. It would be interesting to know how long these updates would be released or if they would only be at the end of each phase (in this case, I consider it a very long time, making it inappropriate. I would like at least monthly reports to be shared with the Cardano community, even that do not say about all the aforementioned KPIs). It would also be interesting if we had knowledge about how the tasks were performed, in addition to their results (goals and tasks are different things: they are tasks that generate the goals, they are behind them). I would like to know if this issue would also be addressed in these updates made to the site. In any case, the auditability suggested for monitoring the development is very good, it is very specific and conveys a lot of confidence as to how this project will be monitored over time. It is critical that a bridge be clearly established between the team and the Cardano community, as the proponents do early on. Regarding the auditability of the final results, I don't think the suggested analyzes are that good, because they only talk about the space that would be developed (\"an MVP version called Decentralized Metaverse Mall (DApp)\"), and numerical metrics that would point how many users would be using the platform, how many transactions were carried out in relation to a certain period of time and so on. I think they are safe ways to see if success has been achieved for the platform created, but they are not direct ways to see what the consequences of all this were for Cardano. Are these users using more Ada or C2E? Did they somehow become active members of the Cardano ecosystem? Would they be investing the Ada received in cashback in pools? Would they be using other Dapps besides this one? In other words, has this project contributed to the expansion and greater adoption of our blockchain technologies? It would be necessary for the proponents to collect this information and carry out an analysis of the case, in addition to being quantitative, qualitative. And for all the data to be made available to our community, it could even be through the website they cite in the progress monitoring part. Finally, I think auditability is very good for progress, but unfortunately it drops a lot on the final success part, as it focuses solely on Dapp, not the Cardano ecosystem as a whole. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 9758, "q0": "The proposal looks to create a mall metaverse in which customers can browse a set of items which they can purchase using crypto and then be delivered the physical item. The application can be seen as a digital shopping mall. The team also introduce a consume to earn model where the metaverse would take a percentage of the revenue generated from sales through their store and then the metaverse application can use that revenue to provide cashback to users or other retention schemes. This could create an effective feedback loop for consumers providing the experience of shopping in this way had advantages over more conventional e-commerce routes. At this stage it is not fully clear whether this new approach has significant advantages over normal e-commerce stores as you could achieve this consume to earn model in simpler ways on a e-commerce website. This is an important consideration as if the consumer behaviour does not prefer this approach then the application will not be impactful. Due to this being a new approach to browsing and purchasing physical items there is a lot to be explored and could provide a high impact to the ecosystem for certain items where this model is preferred.", "q0r": 4, "q1": "The team have a background in auctions and selling products through e-commerce stores. The mall metaverse application being presented is an evolution based upon that experience and a different opportunity for customers to buy. The team break down the roadmap into multiple phases with each phase having an itemised list of tasks to complete. The number of months is attached to this list and for the budget breakdown they provide the number of hours and multiply this by and hourly rate to achieve the final budget that is being requested. Five team members are provided who are working or advising this proposal. Each of the team members provide a LinkedIn profile allowing us to verify their backgrounds. The complexity of the proposal being suggested is high for both graphics and integration of any contracts required, the team appear to have a good background in relevant product selling companies however more evidence would be useful to give a higher confidence that they will be able to execute the complexities of this proposal. ", "q1r": 4, "q2": "For the KPIs the team break down for each of the phases the steps required to complete the execution of the proposal from a functional perspective. The team mention the code will be accessible from a Github repository which will be useful for shared learning in the community and auditing the work that is completed. The team break down some high level numbers as targets that will help to determine success. It would have been good to have some more granularity or information that this is based off. For instance the usual conversion for views on a product through to sale in their own websites could be 15%. This information could be useful to then do comparison metrics to see how impactful this new shopping experience is.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 205, "q0": "As far as I know Vietnam is a really big market and mentioned research confirms it. Also the sentiment of people is optimistic towards crypto which may make Vietnam a great place to develop such solution.", "q0r": 5, "q1": "The team is presented well, with appropriate experience and suggested funding to deliver the product. Even though marketing funds are not clearly stated (and such project will require huge marketing efforts), between the lines it can be found that there are funds planned for community engagement and so on. I may only suggest to put it more straight in any other material. Business plan is well written.", "q1r": 5, "q2": "The proposer presented KPIs and expected stages pretty well. In my opinion progress can be wel tracked here.", "q2r": 5, "assessor": "z_assessor_1086", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 2533, "q0": "Decentralized Metaverse Mall (DMM) is trying to tackle two problems in its problem statement: bring in non-crypto users into crypto space and keep them in. It is also supported by a finding that there are potential users who are willing to use crypto for online payments in Vietnam. \n\nDMM uses cashback business model to attract the non-crypto users into the platform. However, the proposal didn’t mention anything about how DMM would compete against existing platforms with the same business model using FIAT. Hence I think DMM should explore more strategies to gain significant market share advantage, for example by incentivizing not only the consumer, but also the seller with a similar Sell To Earn model. Lastly, there are no further explanation on how DMM would retain its users therefore as of now it is unclear how DMM would scale with its users. However, DMM, if it were to be developed successfully, would indeed adds value to the overall Cardano DApps ecosystem in terms of usecases.", "q0r": 2, "q1": "The proposer have outlined the core team and based on their profiles we could see that they have relevant experiences in their field. There is no mentioning about recruiting any other team members, so I assume DMM would be fully developed from scratch by the core team. \n\nAs a software engineer, I am a bit concerned with the Software Development Life Cycle (SDLC) the proposer used for developing DMM, which could be categorized as Waterfall methodology. When creating an MVP, it is crucial that we receive user feedbacks as early as possible in order to reiterate and actually captures what the users want. With Waterfall methodology we simply could not receive those feedbacks until the whole application is ready, therefore I suggest the proposer to implement Agile methodology as the SDLC in order to reiterate quicker to adapt with users needs.\n\nThe proposal have outlined the budget and timetable and they are indeed realistic, though it can be improved by further explaining how they would handle unforeseeable risks, such as being over budget and having development delays. Perhaps those are already considered and calculated into the budget and timetable proposed but there is no mention of this in the proposal.", "q1r": 4, "q2": "The proposer have outlined the metrics they would use to define the success of the project. However some metrics, as of now, are not well defined. For example, the proposal has not defined what active users means, how do we define “active”? Does it mean the user open or access the app atleast once a day? \n\nLooking back at the problem statement, the metrics do reflect the first problem, which is bringing non-crypto users, however I don’t think 3 months are enough to reflect the second problem, which is to keep them in. Therefore I suggest the proposer to extend the time horizon to 6 months or longer to better reflect user adoption and retention.", "q2r": 3, "assessor": "z_assessor_1522", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4902, "q0": "\"The proposal begins with a very great impression as from problem statement to profile introduction, the proposer attach a lot of reference links so as to prove everything he presents. \nAs reading the proposed solution, the first thing I can see is the writing style of a academic when he uses numerical evidence for problem illustration. The introduction to the platform and its main fuctions as well as features are easy to follow and understand. The proposer express his idea in a way that makes us feel it is quite professional and innovative, thus more persuasive. The operation of the product is explicitly described to great details. The proposer is seemingly has built a very careful plan beforehand as he already possesses several partners, he knows well the current situation of Vietnam and already calculates the way to cope with that. He also shows the connection of the project with Cardano ecosystem and how it gets benefits from the project. Yet, if the proposer could provide some more information on how strong the project could make impact on Cardano ecosystem, this part would be greater. \nIn the demonstation of how the solution addressing challenge, the proposer should bring more evidents to clarify his statement about Cardano ecosystem and its problems. The proposal somehow shows it alignment with the challenge as it yearns to attract more non-crypto users to the ecosystem and use ADA.\nThe foreseen challenge is clear and the proposer proves that he is able to handle the challenge by having a first-step solution with backing strong partners and collaborations. \"", "q0r": 4, "q1": "\"The roadmap of the proposal is incredibly comprehensive as it is divided into 3 particular phases with time duration and for specific purposes, and each includes itemized tasks needed to be done. Yet, there is still rooms for more information about how they would achieve those tasks but the current presentation is enough. \nThe budget breakdown of this proposal is quite impressive and the proposer are showed to have a great deal of expriences and know very well all the process, the time required in order to implement the whole project. Since the budget is broken down into particularized tasks and required hours to accomplish the tasks, the feasibility of this proposal is believed to be significantly high. \nAnother merit of this part is the imposing profile introduction of the proposal's team members. All is provided with a long-listed experiences, specific roles and accomplishments that could contribute to make this proposal more viable. \"", "q1r": 5, "q2": "The KPIs of this proposal is a great match with the presented roadmap. The fact that they could provide all relevant reports through their website is a good point for auditing process. The success illustration is also clear with numerical and measurable outcomes. They also include their SDG rating, which is another plus pont. In general, the proposers have proved a high auditability in this part. ", "q2r": 5, "assessor": "z_assessor_1796", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9959, "q0": "DMM effectively addresses this challenge since this project increases the utility and adoption of  Cardano to both solve the problems of existing Cardano owners and increase the number of Cardano users. I believe this proposal is what this challenge is asking for - a DApp and Integration that boost the mass adoption of the Cardano solution.", "q0r": 5, "q1": "I'm impressed by the team under this project. As a Vietnamese citizen, I know how massive the past projects of this team are, and they have partnered with major retailers and manufacturers in Vietnam like Korea or Samsung. This team has professionals in marketing, operating, technology, and logistics. These experiences are vital for the project's success but are still impressive. The team knows about the Vietnamese market well, as they have presented data-supported information regarding the current market. The proposal is well-thought-out and informative. They already have some important foundations for the implementation of the proposal. I do not see why they can not carry out a successful project.", "q1r": 5, "q2": "As I mentioned above, this is a well-thought-out and informative proposal. I have everything I need to know to predict the project's success. The technical aspects of the DApp and Integration are described in detail. The presenter also mentions their plans of operation and marketing in the proposal. The targeted market and potential customers are fully described. I am also pleased with the project's budget breakdown and KPIs. Human resources for this project is also a vital part of this proposal, and yes it is very impressive.", "q2r": 5, "assessor": "z_assessor_780", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a platform for cryptocurrency users to buy tangible items as consumer electronics and convert new-to-crypto to cryptocurrency users.", "experience": "Tuan completed his PhD with many publications and led a technical team with 10+ years of experience in software development. Building successfully the first authorized auction platform and Online to Offline ticketing system for Landmark 81, the tallest building in Vietnam."}