{"id": 405326, "author": "matthiasksieber", "title": "shac.ai - Shared Housing & Cardano", "url": "https://cardano.ideascale.com/a/dtd/405326-48088", "category": 26438, "amount": 188515, "description": "Governments, nonprofits, and the craigslists of the world are not effectively solving the housing crisis.", "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"id": 9723, "q0": "The housing problem has been a long-lasting issue across the world and this generation also saw a bubble form and also burst during the 2008-09 crisis. Its clearly one of the top world problems along with global warming and nuclear crisis. The manifesto expresses its urgency and focuses on providing reliable housing options to the deprived and poor. The impact no doubt is huge, but the proposer having prior experience of developing housing applications, seems to have underestimated some of the risks involved in the project. The development no doubt has more or else looks complete from a planning perspective but how do they reach people, how do they make people trust their product and increase the usage and transactions. I feel the plan although looks impressive, there are several places that the proposer might have to provide more details on for the community to completely understand their intent and approach.", "q0r": 4, "q1": "Loxeinc is clearly one of the many names that are heard a lot in the community, and the housing issue has been the bedrock of the team. The team has all the traits to implement the proposed idea and has proved their worth through AROYO, but personally, there are several areas that the team might have to take back to the drawing board. Budget even though is not a huge chunk of the allocated funds, there seems to be an overestimate of the number of interface developers required. Compared to the similar proposals submitted under different challenges all trying to save the same issue, this proposal in particular needs some refining. The road map seems to be very vague and might need more detailing considering the fund involved in development. As a reader I feel, if the plan was as crystalline as the other proposals of the team, it would have had made the cut, I hope their venture is funded in the other challenges so that they can apply in this category in the further rounds with more evidence for the voters.", "q1r": 3, "q2": "I have to disagree with the entirety of information provided regarding the metrics and KPI the auditors could use to monitor the proposal. Having seen the other proposals of the team, I personally would have loved it if the proposer had provided dainty more information regarding the success metrics. Considering the proposer's remarks regarding this proposal being a completely new one, a few quantifiable metrics to track the progress of the project once funded would have had done a great deed for the auditors. But the lack of such transparent KPIs I feel the auditing process to be challenging. With no clear indicators to monitor the development process or the business-related outcomes, I feel the proposal is incomplete in terms of auditability.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1951, "q0": "Housing is indeed a major problem nowadays especially when it comes to young people who are not earning enough as to support their own household.  The proposer has addressed a real community problem and provided an excellent solution. The project will have a positive impact on cardano ecosystem because it entails using cardano as a means to transact and it will also attract new users in the community. The KPIs described in the project are aligned with those of the challenge.", "q0r": 5, "q1": "The proposer has provided in detail the qualifications of the team members as well as their expertise. Links to websites and to integrated proposals were provided.  The duration of the project is 5 months and for each month the tasks have been provided that also align with the KPIs described. In my opinion the budget provided seems a little unrealistic (a little high I believe) for the task that needs to be implemented.", "q1r": 4, "q2": "The proposer mentions the milestones to track the progress of the project.  The metrics to audit the project although not clear in the auditability section, they are well defined in the feasibility section.  This is a good project for cardano ecosystem as well as for future users.  It's achievable and can grow cardano.  My only concern is the budget which is find a little bit inflated.", "q2r": 4, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5688, "q0": "This proposal contains a problem statement and solution that directly align with the challenge brief, and has the potential to onboard many new users to Cardano through this housing app. The proposed solution could provide Cardano with a top tier app, (similar to a decentralized air B&B) that is used globally. If this project is successful, it will have significant impact on Cardano, with the potential to reach millions of users, however there are significant inherent risks that this may not see widespread adoption as discussed below. ", "q0r": 5, "q1": "The proposal includes the team and their relevant qualifications and experience. I believe they have the technical skills to deliver the application described in this proposal. However, there are some unknowns around the feasibility of this proposal, as there is no discussion about the legal implications and process when disputes arise. While they suggest \"In the case of disputes, we provide an integration into mediation services through mediators.ai (launch in Q2 2022) and may even provide proactive communication training through ombuds.ai.\" This is a great concept, but the service is not yet launched and available, so the risks inherent in that project come into play for the feasibility of this proposal. Additionally the the phrase \"may even provide... communication and training through ombuds.ai\" is no guarantee that this will happen, or how this process will be implemented. \nThere is also some risk inherent in the fact that this proposal is in addition to another proposal requesting $60,000 for the tenant profile (https://cardano.ideascale.com/c/idea/405158) For these reasons this proposal has lost 2 stars for feasibility because there is significant risk that this project depends on other proposals being funded. Additionally, for this to be successful and provide value to the Cardano ecosystem, it will need to be widely adopted. The team is highly skilled, and have successfully launched https://adatar.me/ which is an elegant solution, however this has received significantly less market share, use and adoption compared to the similar product adahandle.com. At the time of writing this assessment, there are only 95 users for the adatar platform. For this reason, I doubt the ability of this team to deliver world class marketing that would be required for this project to see mass adoption. Given the risks mentioned above, I am concerned that the proposal only includes the following statement in regards to potential risks: \"No risk as the team has built a more complex shared housing application before. For main adoption, Djed should be ready.\" They may be confident in their ability to deliver, but it would be helpful to see more discussion about how they will mitigate these potential risks. Additionally, the timeline includes \"2023, Start of “no-cost” marketing campaign\" but there is little explanation on how this no-cost marketing will function, and why it will be successful. There is also almost no discussion of how DJED will be implemented once launched, or the costs and technical development required to integrate DJED with this app. \nThe budget for this proposal is significant, and appears high, but perhaps this is reasonable considering the ambitions of the project. The timeline is also quite long, stretching until Feb of 2023, and very little detail is included in the timeline. The budget is broken down and clearly itemized. The final KPI of this proposal is stated as: \"By the end of 2023, shac.ai will have matched hundreds of users across all continents.\" While this does seem feasible, \"hundreds of users\" is a little vague as a quantifiable target, and I'm not so sure that a minimum of only 200 users would justify the development costs of funding this project. ", "q1r": 3, "q2": "The auditability section of this proposal is lacking KPI's and how the community will audit this process. It appears only the proposing team will be able to track the progress, and will decide what and when they report back to the community. They include only the following two sentences: \"We will measure the progress of this project for community auditability based on our milestones. Internally, we assess our progress formally weekly with retrospectives and sprint planning.\" It would improve this proposal significantly to have a more clear and comprehensive overview of how the community can audit this entire project which spans multiple proposals, and also this specific proposal. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10606, "q0": "I am excited when reading this proposal. The idea is fresh and standing out among other proposals in challenges. It is not quite often to find dApps that can directly affect and solve real-life problems such as housing crisis. Loxe Inc. described the problem well, clarifying how it should be addressed, and how it is connecting with challenge. DApps with implication to real world issues and trying to resolve it with blockchain advantages (such as decentralization and reducing the need of middlemen) will award Cardano with the most adoption and long-term, ever-growing value. The concept of almost automated marketplace for housing (AAMFH) is very enticing too. Proposer explained the methodology of how the dApp will work in an easily understandable way and mentioning their target market quite explicitly is very appreciated. The teams are also building other integrated auxiliaries that can support the dApp, particularly the Win-Win for dispute resolution. I think the idea behind this proposal is well-thought and carefully developed. Integrated implementation with stablecoin such as Djed will unlock new users and help discovering more and novel use-cases.", "q0r": 5, "q1": "This proposal can serve as a good pilot project for developing and implementing similar dApps later in the future. I am aware that we already have Empowa presenting the novel idea and trying to solve similar issue in the same industry of real estate/property. However, Empowa is focusing their effort and resources in developing Africa. shac.ai could take role as the model and case study in more developed markets or countries, which I believe can be contributing by providing valuable feedback for implementation in developing/less developed markets where Empowa is. Timeline is detailed enough, stating what we can expect in each month progressing into the dApp launch. Budget is just as good and looks reasonable to deliver such project. The record of team members is also extensive and capable of attaining the objectives mentioned in the proposal. I commend their confidence to state no risk with the implementation of this proposal and they have the receipt with the mentioned AROYO, which they claimed to be the more complex (probably less decentralized) version of the shared housing application. With this, at least we already have a teaser on how the dApp version, shac.ai, will be performing.", "q1r": 4, "q2": "In my opinion, the goal is measured in a rather all-or-nothing and elusive manner. I think they stated the metrics or KPI too implicitly, mentioning hundreds matched users by the end of 2023. This possible lack of conviction makes it contradictory since they had foreseen no risk in successful delivery due to more complex app has been built by the team before and Djed will help with mainstream adoption. It might be their intention not to overpromise or so us not to over expect, but this gives off an impression of they might somehow underdeliver (imagining probably due to lack of marketing or extreme competition from existing platforms) or the impact of the dApp is not as strong we thought would be. I think they can detail the relevant metrics or KPIs stronger and more explicitly. Above thought aside, Scrum used as the internal method to manage this dApp development is the gold standard in the industry, so no concern whatsoever there. However, we will need further information on the method to audit progress externally with Cardano community. Since Loxe Inc. has been around in the Catalyst and the core teams are regular contributors, I believe they are familiar with and will utilize existing communication channels such as Catalyst Town Hall. They also can post regularly in their social media including Twitter and LinkedIn to reach wider and more general audience outside of Cardano. ", "q2r": 3, "assessor": "z_assessor_943", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Shac.ai - a shared housing dapp that circumvents ineffective middlemen.", "experience": "Loxe Inc. Experienced team with developers and designers that deployed a shared housing app in 2021."}