{"id": 405486, "author": "cardahub.io", "title": "Cardahub-One Stop Shop for CNFT", "url": "https://cardano.ideascale.com/a/dtd/405486-48088", "category": 26438, "amount": 33600, "description": "CNFT is exploding.\nBut there is no Smart Contract-based One Stop Shop for everything CNFT on Cardano Blockchain yet.", "f6_no_assessments": 17, "f6_rating": 3.411764705882353, "videos": [], "media": [], "f6_assessments": [{"id": 2883, "q0": "This 'one stop shop for CNFT' is an excellent idea which is important for ongoing and future use of CNFTs; an area that is growing. This proposal effectively addresses the challenge. A suggestion for improvement would be to do further 'competitor' analysis and to explicitly state the USPs (unique selling points) of Cardahub vs other solutions. The proposal included competitor analysis, however, further analysis would be useful for the growth of their platform. For example, it would be great to see how their features compare to Fibo.Art which is another NFT Marketplace built on Cardano. Nonetheless, the Cardahub proposal definitely identifies a problem within the 'DApps and Integrations' challenge which needs to be solved and they have outlined how they attempt to do so. They did also mention that they have new features which will be launching in March and that they'd update everyone in the comments of their proposal. Hence, there is articulation on how their platform will add value to the Cardano ecosystem. For example, their 'NFT Dual listing' is an interesting concept and it would be great to see some case uses of this feature. \n", "q0r": 4, "q1": "The experience and educational background of the Cardahub team is extremely strong. They state that half of their team have PhD's in relevant areas - they provided evidence of relevant skills and experience, namely LinkedIn urls and upon inspection, the term certainly have the know-how needed to implement the proposal. Additionally, the platform is already at an advanced stage as they have been building it for a while. Hence, the proposal is likely to be successfully implemented.  Their website is sophisticated yet user-friendly. Their immediate call-to-action buttons make the process seemingly straight-forward. As for the budget, it is broken down into identifiable items, however, some of deliverables mentioned have seemingly been done already. Perhaps the team have made some progress since they first wrote the proposal. Subsequently, they could consider re-allocating and spending more on the fund on 'Survey, research, networking, community outreach' as mentioned in their proposal so that they can get more users on board using Cardahub. ", "q1r": 4, "q2": "The proposing team made good use of visual aids in the form of videos to really illustrate their offering, this was very helpful in seeing how Cardahub works. There was so repetition in the proposal especially in the feasibility section. They listed several milestones which have been completed already but less so on new tasks which the fund would be used for. It is certainly impressive how much they have done so far - though, my suggestion would be that they re-consider the allocation of funds and create a breakdown of exactly where it would be spent for their new objectives. Overall, it is a great, well-thought out proposal and it is clear that the team has worked hard to create a marketplace which is useful for the future of CNFTs. It may be that they need to invest more in social media to get potential users to register on Cardahub, start creating and minting NFTs. Also, to encourage engagement in their community (stimulated by social media and subsequent campaigns) - this can include blog posts to build their community and generally more crypto community content (tutorials etc). At this stage of their proposal, this may be where the greatest priority should be held as a marketplace needs users. I'm excited to see how Cardahub grows! ", "q2r": 3, "assessor": "z_assessor_1586", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 3508, "q0": "As I understand it, Cardahub is seeking to create a one-stop-shop for the listing and buying of CNFTs in the Cardano ecosystem. What I am missing is a clear definition of what “one-stop-shop” means and how in clear, concrete terms addresses an existing issue within the existing CNFT marketplace. \n\nThere is a mention of a unique feature called “Dual Listing” which as I understand allows a seller to list an NFT and at the same time receive a credit token representing the NFT that can be listed on another marketplace thus increasing visibility and improving the odds that the NFT gets sold. There is no further explanation about how this will be implemented, its technical features, or its potential impact on the CNFT space.  It would be beneficial for the proposer to align this feature with a clear problem faced by the creators and buyers of CNFTs and communicate how the solution can benefit the Cardano ecosystem. \n", "q0r": 2, "q1": "The provided links of the proposal do not showcase anything uniquely different that allows it to stand out from existing CNFT platforms. By viewing the proposal through the eyes of a marketing professional, I see no verifiable unique selling points that justify funding a general CNFT platform. \n\nThe proposal provided very vague details of the team involved and did not exhibit any clear qualifications of the team members that would support the claim that the team is qualified to complete, sustain and scale the project.\n\nThe budget request of $33,600 seems excessive considering that the projected timeline for this proposal only covers Q2 of 2022. I would suggest that the proposer reassess the longer-term intent of this project and provide a more detailed vision of what they plan to do and a more detailed account of how they plan to do it. Also, give more details about the team and concrete details of their qualifications and how they can impact the success of this project.\n", "q1r": 1, "q2": "This proposal's roadmap calendar is too short and lacks details of the team's qualifications. There is no clear problem being addressed nor are there any clear metrics to identify what a successful outcome for this project would look like. The proposer should consider expanding the scope of this idea to ensure that it addresses a clear and concise problem and provides a clear, sustainable, and scalable solution that can be measured over a reasonable amount of time. If the proposer can do this it may also result in a clearer idea of what the budget requirements are over a measurable amount of time.", "q2r": 1, "assessor": "z_assessor_1658", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 301, "q0": "I agree that this proposal effectively addresses the challengeF8: DApps and Integrations by proposing a \"One Stop Shop for CNFT '' where those wanting to create on the Cardano blockchain have all they need in one location and all based on Smart Contracts.\n", "q0r": 4, "q1": "The team has demonstrated that they can do what they are proposing as from the looks of their website, https://cardahub.io/home, everything has been created and is up and running. Not clear if they need funds to continue to grow or if they got ahead of themselves and are no longer in need of the funding.", "q1r": 3, "q2": "While The team has provided clear information to audit the progress of the proposal moving forward it seems, as per their own proposal, everything has been accomplished. The only things pending are “Upcoming features” in which their main feature is not explained at all and presented as a “teaser”  and the others just vague 2 and 3 word statements.", "q2r": 3, "assessor": "z_assessor_1137", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 6682, "q0": "This proposal certainly addresses a need that this challenge beckons, specifically that of an NFT Marketplace and that of an NFT Facilitator in that you can create NFT's, mint collections, and initiate distribution. An additional value-add that distinguishes this project from other NFT projects that already exist within the ecosystem is the ability to create a dual listing not only on this site, (cardahub.io), but also on another NFT marketplace via a credit token (see the excerpt below copied verbatim from the proposal).\n\n*Dual Listing : Dual Listing is Cardahub's unique feature that you can't find anywhere in any NFT marketplace out there. Dual Listing allows you to put your NFT on sale on our marketplace, but at the same time you receive an credit token representing that NFT. And you can put the credit token on another market for sale at the same time. That means Your NFT gets listed on two marketplaces at the same time, thus doubling the chance it will get sold.\n\nFurther, the requested budgetary amount of $33,600 falls within the scope of an intermediate project, meeting the following conditions of the challenge/campaign brief:\n\n*For smaller teams (4-5 people) with proven competence, relevant experience and technical skills with sketches/whitepaper detailing how they would go about to launch their proposal, the budgets would typically be in the range $40,000-$80,000.\n\nGiven the already functioning and attractive website that already has traffic in terms of collections and individual NFT's listed, with some minimal data at bottom of the homepage of recently sold items, it is clear that the project is already drawing a user base to the Cardano ecosystem. And the videos were very helpful in experiencing the ease of use of the project. That being said, I would like to know more about the dual listing function and how it works in order to properly assess whether or not it is viable (since, though Cardano in itself is very collaborative, I can't see another marketplace accepting a credit token from cardahub.io unless there is some form of compensation attached). Also, though I have no doubt in the capabilities and skills of this All-Star caliber team that are potentially overqualified to deliver on this project (I'll address further in the feasibility section), I do ask the team to think more deeply about their unique value proposition and how to distinguish cardahub.io from its direct competitors. I myself might lean into thinking about the possibilities of adding functionality (and what would those functionalities be?) to the NFT process of creating and minting NFT's. With such a highly intelligent and accomplished team, I have no doubt that they could come up with innumerable possibilities. And if they can attach functionality (potentially through a partnership with an already existing dex for example), it would be a truly distinctive advantage.", "q0r": 4, "q1": "This project, which is already functioning as of January 1st, 2022, is applying for funding to complete its explicit and detailed roadmap, including forming Strategic partnerships, NFT Browsing and Ranking, creating Developer API Access, enhancing their NFT Collections, implementing NFT Auction and NFT Staking, an NFT Mystery Box, and Marketing Campaign. The budget asks to sustain 3-6 people for 3 months time who will complete the smart contract, UI and backend, and research, networking and community outreach to bring more visibility to the project.\n\nWith the impeccable credentials of the team members that show a wide range of the skills and abilities needed to implement the project, I feel very strongly that this proposal meets the following standards of feasibility:\n\n*The proposer provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal.\n*The proposer knows, in an identifiable manner, the type and number of team members required to implement the proposal.\n*The budget is outlined clearly and broken down into identifiable items. \n*The budget is reasonable to achieve the set goals.\n*The proposal offers a realistic timetable to complete the work.\n*The proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how.\n*The plan describes the resources necessary to implement the proposal.\n*The proposer has considered challenges and risks relevant to a successful implementation.\n\nHowever, the only two caveats I have are that the proposal does not fully explain its current distinctive feature of dual listing and how the credit token will function, and the proposal hints at a valuable feature that is not explicitated in the proposal itself (see the language from the proposal itself, copied below).\n\n*An extremely hot Feature is coming soon on March 2022. To the best of our knowledge, Cardahub is the very first platform in the whole CNFT Space to have this unique feature, and is the only one that could provide this offer. (we'll update in comment below when it's ready. Stay tuned! )\n\nTherefore, I cannot abide that the proposal has accomplished the following important aspect of feasibility:\n\n*The proposal clearly explains technical aspects like architecture, language and technologies if they are crucial for implementation.\n\nThat being said, I reiterate that there is no doubt in my mind that, after examining this proposal and its links thoroughly, it will be fully implemented and is extremely feasible.", "q1r": 5, "q2": "This proposal is clear and sufficiently audit-able. The roadmap is clear and provides distinct milestones and a time horizon for achievement, and gives ample evidence of past milestones achieved, which are verified by using the already existing website to create individual NFT's or collections. This adds confidence to an assessment that future as yet unaccomplished tasks will be accomplished in the time stated.\n\nAlso clear is the description of the problem of this challenge, which is addressed by proposing to enhance an already existing NFT marketplace. I hope the proposers can wisely implement the budget to gain traction in the already/soon-to-be-crowded NFT space via community outreach and marketing, but it is clear that they have provided a valuable option for a creator or buyer searching for an NFT marketplace.\n\nThe only other thing I would add is that I'd like to see more detailed and specific metrics/KPI's for each task in the roadmap. For example, the NFT Auction - what would make this successful in the team's eyes? But I do understand that it would make an already long an detailed proposal much more unwieldy and potentially unreadable. So I understand the exclusion of such minutiae, but this should suffice as a note to the team to be aware of the success of each component on a granular level, if need be, so that they know whether a particular component is adding to the ease and understanding and success of the user or not.", "q2r": 5, "assessor": "z_assessor_452", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10214, "q0": "The proposal addresses the challenge correctly. The solution enters into the challenge possible directions (nft marketplace), and the team had already achieved a functional product, so the asked budget enter the typical 40-80k USD range (although budget breakdown it's unclear, but it doesn't correspond to Impact criteria so it'll be taken into account later).", "q0r": 4, "q1": "Regarding team experience, I strongly agree that team is highly likely to implement the proposal successfully. However, when it comes to the plan details, it's not completely detailed which will the next steps (different features are mentioned, but not explained, for example their unique differentiating feature coming this month, but no hint whatsoever on what it does or how it works)\n\nMaybe you can improve your proposal by focusing on the next steps of your roadmap and explaining clearly how the budget breakdown is related with future steps of the project. I don't think the budget breakdown it's well explained. The team mentioned working on the proposal is composed of 7 people, however asked funds are for 3 persons/roles only, and it's not mentioned who will undertake each role.", "q1r": 3, "q2": "The proposer didn't add additional information into the auditability section. it mentions it's kind of the same thing as he/she stated into the feasibility challenge. However, it's not the same thing, and the auditability should help to better address the progress and success of the proposal, it's not about the likelihood of its completition (feasibility) but about it's transparency, accountability and delivery methods. Proposal could be improved by adding some KPIs regarding to the NFT marketplace and expected product growth, in terms of users, nft lists, artists, on chain statistics, etc. Also, it'd be good to break down the proposal progress monthly (instead of only mention all features in one Q, it'd be better to put different milestones monthly for the 3months timeframe), to be able to know what features will be delivered in each month (or which ones they'll tackle first), to better address the correct progress of the project.", "q2r": 2, "assessor": "z_assessor_833", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10047, "q0": "NFT market places are a growth factor for mainstream adoption of Cardano in the crypto space. If we look at all influencers/artists/actors in the mainstream they are float around their NFT projects and help guide and incite newcomers to question what are NFTs and how to get them. \nUnfortunately many of the major NFTs are sold and minted in other platforms, that also applies to metaverses. \nCardano is not far off the race and are building the tools and platforms to offer a solid base to creatives and projects to blossom in the space. I must add that even if compared today the benefits of minting in Cardano outweigh the benefits of other cyrpto blockchains (ETH SOL and AVAX). \nCardahub is one link to the chain that will pull in the masses and will allow for SC and mangement of NFT by ranking, selling and minting. \nThis team is constantly building and improoving their website to offer more options and safer transactions. \nThis project is an already running project and wishes to improve ont he smart contract space of listing/dual listing and other type of transactions around NFT sales. ", "q0r": 5, "q1": "As mentioned in the body of this proposal. Cardahub is a running NFT marketplace that also allows for minting your own NFTs. The added value they are aiming to bring forward are the integration of SC in the selling and transactions of NFTs on their site. \nThe team have a good work cohesion and have produced and completed various stages of improvement on their site.\n They seek to get funding on mainly manhours of SC coding and UI/backend improvement to the website to rival the other NFT market places. \nI feel the success of this project is innevitable and would be a great use of ressoruces and momentum to accelerate this with the funding of this project. \nThe timeline/roadmap of closing the required upgrades are slightly vague, explaining that the whole project will be delivered in 3 months. Since it is a small project there was not detail on the deliverable other than the main objective of the proposal. ", "q1r": 5, "q2": "I am a little underwhelmed by the auditing part of the proposal. They simply refer to the project timeline/budgetary plan to review as part of the auditing. It is clear the team has a great following over their social media. And they have insisted that the updates/improvements will be posted and shared once completed. However I would feel some sense of responsability for the catalyst fund to obtain more clarity and visibility with reporting (weekly / monthly) and an added granularity on the tasks that will be accomplished. \nHaving said that there is ample enought details on the deliverables to confirm that the essence of the proposal was accomplished to shed out any doubt that the teamembers have performed their commitments. ", "q2r": 3, "assessor": "z_assessor_785", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9832, "q0": "The team already has a feature that is unique to NFT marketplaces, and adding other features to their dapp will have an impact on NFT adoption on the Cardano Blockchain.  This projects does indeed fall under the challenge and as the team expresses their willingness to scale, it seems that such project can indeed bring value to the Cardano ecosystem.", "q0r": 5, "q1": "The team indeed showcases the exact budget spending and the milestones they will be covering. They also already have an already established dapp which makes the proposal more credible. On the other hand, not many risks were stated.", "q1r": 4, "q2": "The team specified a time-based roadmap that is a continuation of their already established project. This roadmap include multiple milestones and delivery dates that can easily be checked.", "q2r": 5, "assessor": "z_assessor_768", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7052, "q0": "NFT marketplaces are very important for the ever growing NFT space. Cardano has several cNFT marketplaces, including Cardahub. Having a single marketplace might make it a little more convenient to mint, search, buy and sell cNFTs, but goes against the Cardano ethos of decentralization. \n\nIt is unclear what the proposers would like to implement. Cardahub.io is up and running and a very nice place for all things cNFT. If the proposers were suggesting something which would add benefit for the Cardano users, new and old, like a global cNFT search function, an ability to list across marketplaces (which they allude to, but which already seems to be in the works), or similar, that might make sense. But the proposal only aims to be a \"one stop shop\", and provide a bullet list of a few features which given the timeline should already be in progress. Thus I do not agree that this proposal would attract new users to Cardano nor introduce new, viable dApps.", "q0r": 2, "q1": "The team is excellent, one of the more experienced I've seen on paper, and they have a cNFT marketplace in production. However based on the proposal, it is very unclear what this proposal aims to achieve. \n\nThere is a bullet list of functions which the team aims to achieve by Q2 2022. However the funding for fund 8 will be revealed in May (i.e. end of Q2 2022), thus the proposal seems just to be a bid to fund the continued development of Cardahub for 3 months.\n\nGiven the unclarity  proposal it is very hard assess the chance of success.", "q1r": 2, "q2": "As the aim of the proposal is very unclear it is very hard to understand what the proposers aim to achieve. The budget supplied is only for the team's salaries for 3 months. No milestones are supplied, nor any metric to become the \"onte stop shop for cNFTs\". Thus it is impossible to audit the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_533", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7046, "q0": "The proposal aims to leverage smart contracts to mint and trade NFTs in a decentralized fashion, using custom made smart contacts.\nThis will offer protection against open source smart contracts which can be modified and affecting the platform, and more stability and security, being the platform decentralized.", "q0r": 5, "q1": "The team provided a series of tutorial, available on YouTube, showing what has already being implemented. \nThe platform is really similar to Opensea, so supposedly the user experience will be close to the current higher standard.\nThe progress made in the first months suggest that the project is destined to succeed.\nThe experience of the multidisciplinary team has been proven not only practically with tutorial and the project website, but also with links to their LinkedIn profiles/website.\nHence, the team will be able to implement the missing features for the platform and planned to be implemented next quarter of 2022, such as NFT staking and auction, and advertise the website once completed.", "q1r": 5, "q2": "The budget breakdown justifies the amount required, about 30k USD.\nThe timeline has been accurately outlined as well.\nThe team is also releasing regular updates via different social media, like Telegram, Twitter, YouTube and even after funding it would be obvious to follow their progress.", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5266, "q0": "As a growing CNFT market, this proposal tries to create a new and easier way for people to create and market their CNFTs in a more practical and faster way, thus adding a new way to explore this new functionality.\nBut an NFTs market doesn't have much to go on, being around the same and only updating when necessary, but I think it could be useful to attract more artists to Cardano's network.", "q0r": 3, "q1": "The team seems to me to be quite competent with several PhDs and Masters within the areas suitable for the job, as evidenced by the links provided.\nAs for the budget, I think the amounts they're asking for the work I think will be needed are too high, as a lot of the work they're asking for is already done according to the roadmap, I think.\nHowever, the way in which they will continue to develop is a bit confusing, as it is not explained how they are planning to develop the next aspects of the list, in terms of the type of technologies and programming languages ​​needed to finish developing the project.\nIn spite of that, they present their competitors that, because they will be on the market for a longer time, may represent a great risk for the completion of this project.\n", "q1r": 3, "q2": "The owners of this proposal present a very precise roadmap, but only of what is already done, and what is still to be done are presented as mere reference points. The only way we can verify the success of this proposal is only if this platform becomes one of the main CNFTs marketplaces.\nSince the CNFTS market is \"exploding\", I don't think that a new platform for its creation and commercialization is the solution, but if it becomes influential enough to bring new users to Cardano's network, it will be good to spread its various uses.\n", "q2r": 4, "assessor": "z_assessor_1897", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5376, "q0": "The proposal presented clearly identifies that with the CNFT environment booming there is a problem that there is no smart contract based, one-stop-shop for everything CNFT on the Cardano Blockchain. This proposal will add value to the Cardano ecosystem by exploring their competitive advantage of not being a platform using open-source-based contracts which face the risks of contracts being exploited. The angle of Cardahub using its own contracts, also add value to the Cardano ecosystem through new innovations. The proposal has shown clarity on what the success of their project looks like although haven’t provided relevant information on clear goals and key metrics to measure their success. It is evident that the challenges Cardahub foresees is other platforms in the Cardano ecosystem and that these other platforms may take away market share from them. Although this is true, they should explore challenges and risks that could be facing with their own project (i.e. technical or security issues).", "q0r": 4, "q1": "Relevant skills and experience are shown and it gives the impression that they are very capable to successfully implement the proposal. The team is diverse with each member specializing in different aspects of the project (as shown through their linkedin). There is assurance that this there is a high rate of success as they have already established this product and it appears to be working. Their roadmap is a little misleading - this is because the majority of phases stated of their roadmap are said to been completed and that there is insufficient information on future phases. The future phases on their roadmap appears to be heavily concentrated on development and new features of the platform. It is important to have more elaboration on their future phases and whether they are also going to focus some attention to other business aspects (i.e. marketing). There is clarity in the budget that is outlined - it is evident that the funds allocated will be used for compensation of work the team will have to undertake improving, developing and engineering Cardahub. What raises concern is that the budget being requested only covers 3 months. What will happen after 3 months? Will developments and improvements to Cardahub stop? It is essential for the proposal to have a strategy in place to remedy the future viability of the project. It is important to know future challenges and potential risks and how the team plans on solving these.", "q1r": 4, "q2": "The roadmap and milestones of the proposal appear to be realistic, though it was also vague in regards to their future developments. The budget requested is reasonable, although it doesn’t justify the future viability of the project as there is uncertainty on how the business will scale and if they are able to scale. This could have been addressed if the proposal included information on the business’s future challenges and risks. The team seem to be very competent; I believe they have the necessary skills and experience to implement this proposal and they do have a clear understandable solution to address the problem. Although with the lack of key metrics and KPI’s considered to help define the success and with their inability to clearly identify future potential risks of their project – there was insufficient information for me to fully audit the progress and success of the project. ", "q2r": 2, "assessor": "z_assessor_1953", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 431, "q0": "As seen in the last year NFTs are a huge hype-factor in the Crypto-Market and they are a huge opportunity for an ecosystem! Cardano supports NFTs since a long time and CNFTs are truly decentralized other than NFTs on other platforms. \n\nNow the question remains why people don’t just mint their NFTs on Cardano. One possible answer is that people want an easy “all in one” solution. \n\nThis is where this proposal jumps in. They already build an MVP all in one solution which is being used. There is reasonable competition in the field and they aren´t the leader in the market but that’s not necessary. The recent history has shown us that the dominance in a market can change fast. \n\nThey did a market analysis and outlined the strengths and weaknesses of their competitors. Competition is good since it leads to a better product for the consumer.\n\nLast but not least they will allow all NFTs minted in compliance with the CIP-25 to be traded on their platform which is really good and reflects the values of Cardano.", "q0r": 5, "q1": "The team consists of highly trained academic members. They showcased their skills in the deployment of their MVP in time. \n\nThe size and timeline of the project seems to fit the team’s capacity and capability. \n\nIt is not clear on what feature the development team will work with the money given to them, so it is hard to measure the progress. Maybe they want to keep it a secret, but it is hard to give somebody money if they don’t tell you what for. \n\nThere are may things they plan to work on, but a detailed roadmap or upcoming features would be nice!\n\nSill given the history of the project and the sum they are asking for it is reasonable to assume they will work on improving the product!", "q1r": 4, "q2": "Since the goal of the proposal is to create an “all in one” NFT marketplace it is easy to check if it was successful or not. But in my opinion the proposal lacks a certain sharpness in the definition of the timeline which males it hard to measure if they are on track. \n\nIf the team would give an update and add a roadmap or at least the features, it is working on it would really help the community! The vague description of an “extremely hot feature” sounds a bit like clickbait since nothing more about that feature is known. \n\nAll in all it is somewhat hard to monitor the progress but it is easy check for an end product.\n", "q2r": 3, "assessor": "z_assessor_1147", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 5264, "q0": "This is a great/reputable team with extraordinary capability behind a poor/outdated proposal. First, I get the sense that this proposal was copy and pasted from previous work (based on the indication that CNFT.io is by far the top marketplace - which is now a BIG lead for jpg.store). This is not meant to be a petty point, it just doesn't look great that the people behind the proposal are not well-plugged into the very industry they're trying to break into - from which they also left out about 4-5 developing marketplaces from their list. Second, it feels like the main value proposition here is a custom smart contract that would be more secure. However, the NFT marketplace is already completed and functioning. So I question why the project needs funding if their product is already completed. It's not clear what the impact is because they don't point out exactly what new things are being provided by the funding of this proposal. I feel like I'm reading an overview on why this marketplace is already awesome, rather than what change/benefit the approved funding would provide. If there was more clarity in that area, I still might raise an issue with the highly competitive industry and the lacking guarantee of success - but I think I've said enough. ", "q0r": 2, "q1": "The team has all the talent and experience in the world to accomplish what they set out to accomplish, which is the unclear part. Based on the budget breakdown, it looks like this funding would go to general technical development and market research. I only give a low rating because I'm unclear on what this specific proposal is looking to accomplish, but I'm entirely certain they have the capability to accomplish it. ", "q1r": 2, "q2": "I'm surprised by the overwhelming amount of information given in other sections, while this one gets pushed to the wayside by telling CAs to reference other sections. I think they let themselves off easy by choosing not to creatively give KPIs that they are paying attention to. The proposal assumes the only measure of success is a completed product. There could easily be other measures of success in meeting deadlines, amount of users, feedback metrics, and marketing (which is extremely overlooked in this proposal). I think what this proposal comes down to is an incredibly talented and capable team, with a \"messy\" proposal. If it weren't \"messy,\" I might have some questions regarding marketability, the potential for success, and lack of perceived uniqueness. I, personally, don't think capability (even extremely talented capability) to produce a product is enough to approve. I want to know what I'm voting on, and I don't feel like I get that here. ", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1005, "q0": "Cardahub sets its sights on what is currently a highly in-demand application of blockchain technology: the creation and marketing of NFTs. This proposal benefits greatly from its \"show rather than tell\" approach, with videos walking the user through minting, listing, and buying processes, all of which appear to be well-thought-out and well into development. With a conservative approach emphasizing simplicity and UI, a fully implemented Cardahub could serve as a great entry point into the Cardano ecosystem for NFT creators and enthusiasts. The experienced team looks to be more than a match for the project, which is already well underway. \n\nThe proposal correctly notes that Cardahub will be facing stiff competition within its niche, particularly in the form of CNFT.io. To this end, Cardahub hangs its hat on proprietary smart contracts over platforms that are using open-source code, citing security risks for the latter. I'm not sure the proposal, as written, fully makes its case here. It may be helpful to elaborate on the example it alludes to, as well as head off counter-arguments in favor of open-source contracts. It may also be helpful to give a more detailed description of the dual-listing feature since it's among the key difference-makers cited by the proposal.\n\n(Please note that, at the time of review, the last video embedded in the Impact section was throwing an error.)", "q0r": 4, "q1": "As the proposal notes, Cardahub is already well into its development cycle and has delivered on multiple milestones from its roadmap. Team bios are prominently linked and introduced. After following the provided links, it's clear the team is capable of delivering an attractive product, and there's little reason to believe they won't be able to meet their remaining goals if adequately supported. Of course, the \"hot new feature\" alluded to in the Q2/2022 roadmap is intriguing, but a potential risk. That said, given the team's apparent competence, I'm not too concerned about this. \n\nThe biggest risk factor is likely to be competition and visibility. To that end, I'd like to see a bit more detail on how the team plans to make Cardahub stand out from the crowd, not so much in tech but in marketing.", "q1r": 5, "q2": "This section is sparse, with the proposer pointing to past deliverables as KPIs. While the existing product does make the case, this approach sacrifices what could be a clearer and more concise appeal. As I noted earlier in the feasibility section, there's little reason to worry that the team can't deliver on the technicals. We don't, however, have much information on how the team plans to approach its strategic partnerships or marketing, which can easily make or break a project working within such a crowded niche. How will Team Cardahub communicate its successes to the community?", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 778, "q0": "With the introduction of smart contracts, Cardano is indeed in need of applications that utilize them. And NFT marketplaces are at the top of that list. So it is indeed a big market in the dApp ecosystem. The proposer and their team has experience in this space since they have a working marketplace already deployed.  'One stop shop for CNFTs' seems more vague than intriguing when assessing the proposal and the proposer hasn't seemed to respond to clarifications asked via the comments. Nonetheless, the project's success is definitely a boost for the NFT spaces that Cardano provides and growth of the platform is to the benefit of the protocol.", "q0r": 4, "q1": "The project's team members seem to be highly qualified individuals with PhDs seemingly being commonplace, and qualifications seem to be more than enough. The team have already delivered a working project, their marketplace. It is up and running, and upon testing, looks great and. seems to be working fine. Another positive point that I have noticed is that many wallets have been integrated on the platform which will make onboarding users easier. ", "q1r": 5, "q2": "Many details are lacking when it comes to what to expect from the project. The budget breakdown is for three months, while the projects timeline is more vague with plans for the whole second quarter of 2022 being listed down. The exact features to expect from the funds is not clear, which will make auditing a struggle. Also, comments by the community for clarifications have not been answered. On the upside, the project seems to be active on social platforms and updates about the platform will be easy to follow up on. ", "q2r": 3, "assessor": "z_assessor_1211", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 557, "q0": "The proposal agrees with the objectives of the challenge, since it is a marketplace for CNFT. They are aware that the main challenge of the platform is the competition of other CNFT marketplaces. So they developed their own code that distinguishes them from others and supposedly makes the platform more secure. Although they do not present evidence of this.  The platform has a mechanism called \"dual listing\" thay allows the artist to put at sell their CNFT in two marketplaces at the same time, that is a great idea. \n\n\nThe advantage that I see is that it's really easy to mint tokens in their platform and the “how to” communication of the platform is well done. Also they have a strong presence in all social networks from where it is easy to follow the project and its evolution. \n\nThe Cardano ecosystem can benefit from Cardahub marketplaces. ", "q0r": 4, "q1": "The team behind the platform seems to be legit and qualify to push forward their project. The best proof of this is that the Cardahub marketplace already works. The team is open to the public and there are links to their linkedin profiles. They have a strong background in computational science. \n\nThey expose a timeline with all the things that they have already done. But, unfortunately, they are not abundant in the next features of their project. They talk about an extremely hot feature for the platform coming in March 2022, but they don’t explain what it’s. You can improve your proposal by being more specific in your budget breakdown and explaining the tasks of everey professional needed for developing and improving the platform. Because, as you stated in the budget, the fund will be used to pay their salaries.  ", "q1r": 4, "q2": "The idea is neat and the project is already working. The proposal provides 5 videos explaining in a clear and concise way the activities that can be performed on the site: minting, simple listing, dual listing, cancel listing, buying. \n\nI think you can improve your proposal setting objectives or milestone for your platform. For example: numbers of transactions from Cardahub as a proxy of users of the platform. Also the amount of minted CNFT per period of time, etc. They can sert you as a metric of succes of the proyect and a metric of how you expect to grow in the future. ", "q2r": 4, "assessor": "z_assessor_1189", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10324, "q0": "When reading the problem raised in this proposal, it seems to me that there is no clear need identified, as at the time of writing this review there are several -if not all- smart contract enabled marketplaces in the Cardano network.\nAccording to the proposal it seems to me that Cardahub seeks to be the dominant marketplace, however I fail to identify enough elements to clearly differentiate this platform from its competitors, beyond developing its own smart contract and offering minting services for users. Reference is made to an exclusive functionality, but no further details are given as to what benefits it could bring to the network or its users.\nI would recommend the proposing team to work on redefining their value proposition so that the impact that funding this project would bring to the Cardano community, is evident.\n\n", "q0r": 2, "q1": "The team is highly competent and have clearly developed a functional solution that has a running product. \nOn the other hand it seems difficult to displace most of the competitors that are already positioned, especially since no clear differentiator is identified to convince users to prefer Cardahub as a one-stop-shop for all things Cardano.\nAs mentioned above, the site is well developed and functioning, the team has extensive experience in developing solutions, a realistic breakdown of the budget needed to develop for a given number of months is provided, but it is not specified what they want to achieve beyond being the dominant marketplace solution in Cardano. This seems more of an aspiration, rather than a need or a problem that requires a solution, therefore, I would kindly recommend the proposing team to focus on refining the proposal and the objective they are looking to achieve if funded.", "q1r": 2, "q2": "Unfortunately, the team does not provide clear metrics, milestones or KPI's to measure progress in case of funding. Reference is only made to past achievements during the development of the platform, but given that it fails to identify a clear objective to be achieved going forward, I believe the proposal would be difficult to audit.", "q2r": 1, "assessor": "z_assessor_883", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Providing Smart Contract-based One Stop Shop for everything CNFT for those who want to work with NFTs on Cardano blockchain", "experience": "Ten years of experience in software application development, Ph.D. in distributed systems"}