{"id": 383611, "author": "raz", "title": "Marketing Training for African SPOs", "url": "https://cardano.ideascale.com/a/dtd/383611-48088", "category": 26246, "amount": 8000, "description": "C'est un défi d'être le premier OPL dans un pays, en plus des compétences techniques, les OPL ont besoin de compétences en marketing et en gestion pour fonctionner de manière durable.", "funded": 1, "upvotes": 58885604, "downvotes": 8192619, "votes_result": 50692985, "votes_cast": 207, "f6_no_assessments": 3, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have been able to collect a lot of experience on sustainability topics. And can hence competently evaluate sutainability criteria in proposals in this category. The proposal matches the challenge well and it is clear the proposer has properly read the challenge and knows their way around the topic. Their proposal has the potential to add quite some value to the Cardano ecosystem.\r\nThe proposal clearly articulates how it will add value to the Cardano ecosystem, notably by supporting African SPOs.\r\nThe key metrics are aligning very well with the challenge settings KPIs. From its makeup, the proposal is able to scale to address future challenges, by a multiplicator effect.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. Even challenges and risks are considered with mitigation strategies. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 22, "ne": 4, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The need of marketing and managerial skills for a SPOs on top of technical skills to operate sustainably. The proposer wants to help SPOs with with social media, marketing and managerial skills to operate sustainably Hence this addresses the issue effectively", "q0r": 5, "q1": "The team consists of people with required skills and enough experience to make this proposal a reality. The proposer have given a detailed plan and a roadmap with 6 months and 12 month target. The proposal also consist of risks and Impact Benefits with all these it will be very possible the proposal will be implemented successfully", "q1r": 5, "q2": "The proposal consists of detailed fund distribution and required KPIs. It also consists of roadmap with a timeline which makes the proposal trackable. These details will be enough to audit the development and success of the proposal successfully ", "q2r": 5, "assessor": "z_assessor_937", "no_vca": 24, "ne": 1, "ng": 16, "nfo": 7, "vca_o": 1}, {"q0": "In my opinion this proposal could improve the stakeholder participations in the Cardano community Stake Pool Operators and the developer work on cardano blockchain, but It isn’t clearly articulates how it will add value to the Cardano ecosystem and for the stakeholders (in deep detail for users, developers and so on.. ).\nActually any SPO’s risk himself and doesn’t need to funding his Pool with catalyst funding, so what are the benefit of this proposal for cardano community?\nHowever the objective of the proposal is interesting and it’s good for growth the community, but I think it's important to enrich the proposal with other kind of support for SPOs, because only marketing support doesn’t enough to improve African communities.\n", "q0r": 4, "q1": "The proposer has the necessary experience, because he’s an experienced Catalyst member, but not a SPO, so it’s clear the experience in general, but I don’t discover team member details and professional experience to imagine the project’s success. The metrics for the assessment isn’t given, so it’s impossible to assess what the proposer wants to do, but the success of his actions is not defined. Roadmap and milestones are not very well described (only actions list).", "q1r": 3, "q2": "Roadmap and milestones are basically described. The budget’s information provided is very poorly described. There aren’t a lot of KPI to identify the proposal goal, but only deliverables. There aren't more details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution. Futhermore there aren’t basic information to asses.", "q2r": 3, "assessor": "z_assessor_114", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}], "solution": "Renforcement des capacités permettant aux OSP pionniers en RDC et en Côte d'Ivoire de fonctionner de manière durable grâce aux médias sociaux, au marketing et aux compétences de gestion.", "experience": "Educateurs | Wada | Entrepreneurs sociaux | Développeur Plutus | Emurgo Fondements de la blockchain avec Cardano Aperçu certifié"}