{"id": 413980, "author": "headelf", "title": "Cardano for Seniors SPO", "url": "https://cardano.ideascale.com/a/dtd/413980-48088", "category": 26595, "amount": 6200, "description": "Cardano for Seniors as a platform for educating Seniors about Cryptocurrency, Defi and Cardano with emphasis on Risk Management needs to become a self-sustaining ecosystem with a community token & DAO", "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 4559, "q0": "Cardano for Seniors, a project that was previously funded through Catalyst, offers an onboarding ramp into Cardano for a segment of the population that is all-too-often written off by the crypto community. The project is now seeking to add a staking pool and a DAO as part of its efforts to scale up and become self-sustaining.\n\nThis proposal is a natural outgrowth of the previous round of funding, and fits in well with Cardano's general community values and guidelines. One could argue this proposal could better fit into the Cardano <3s DAOs challenge due to the DAO component, but in light of the broader project, Dapps, Products, & Integrations should be broad enough to accommodate it.", "q0r": 5, "q1": "The team has a good idea of what this phase of the project will entail and has laid out an adequate roadmap for getting there. Creating an SPO is well-worn territory, but, as the proposal acknowledges, the team is seeking external talent to build and operate C4S, which could lead to some potential complications. At the same time, leadership seems knowledgeable and proactive in forming the necessary partnerships.\n\nThe proposal could also be improved by a further exploration of how the new native asset will work. Tokenomics can be tricky, so this isn't a trivial issue to leave hanging. ", "q1r": 4, "q2": "A stake pool is one of the more visible and obvious components of the Cardano network, as well as one of the easiest to get metrics on. Therefore, it should be very easy to audit this aspect of the project. The commitment to transparency and Agile development by the team should also make development easy to track.\n\nOn the other hand, there are still some unaccounted for aspects to the DAO element of the project that may be harder to get a handle on. While tokenomics aren't yet finalized, a preliminary strategy would add clarity to this project.", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7462, "q0": "I have gone through a couple of your proposals already, and I have to give it to your team. You are truly tapping a demographic that very few of us even consider. The amount of knowledge and experience that we could gain from seniors could be game changing for us as an ecosystem. One of the biggest things about Cardano is the fact that we have so many highly intelligent, mature adults in our ecosystem ready to help change the world. This project furthers those goals by tapping into a resource that most chains completely overlook. This thinking outside of the box is what makes us so strong as an ecosystem. I think Catalyst needs to fund more independent stake pool operators if we want to become as decentralized as we need to be. My concern right now is the fact that some of the largest corporations, such as coinbase, own an absolutely massive stake in Cardano as a whole. We need to get as far away from centralization as we possibly can if we ever want to not fail where almost every other VC chain has. ", "q0r": 4, "q1": "Seeing that you are considering AWS as a reliable partner to run the stake pool worries me. Not only for security reasons, but for lack of decentralization implications. AWS is also notorious for going down, and a successful stake pool (especially one that is brand new) MUST be up 99% of the time if you want to have any measurable impact as an SPO. Your team seems very capable of pulling this off, however, the fact that neither of you have the time to dedicate to this worries me that the funding may not be enough to get done what you need. You are asking for a relatively small amount, and I think if you are going to start a stake pool... you should have some personal skin in the game to begin with. I see stake pools as a great way to have long term investment return, but the fact that you are doing this in order to launch just another asset on the blockchain worries me. Your proposal doesn't seem to have as much thought and effort put into it as your others, either. With all of that being said, I will continue to support and champion the ideas your team is striving for. I hope I do not discourage you at all, because what you are doing is truly important work. I just think you should start building a community around your project and leverage them as help for getting your initial costs of running an SPO off the ground.", "q1r": 3, "q2": "I think your success metrics are severely lacking in this proposal. There is almost no way to transparently show us, as a community, that you are using the funds in a wise manner. I would like to see your team documenting this as an experience through youtube videos and leverage social media such as Facebook and Twitter to show us what you are doing along the way. I have apprehensions giving funding to anyone that cannot break down every metric they possibly can to indicate success. As an ecosystem, I think it is EXTREMELY important to gain more independent SPOs on Cardano. With that being said, I believe that you guys should secure your team prior to funding and get the initial leg work done to have a solid plan in place before coming to catalyst for funding. Stake pools are the life blood of our ecosystem, and as a result, I feel like if you are gaining funding to create one, you need to be as transparent and open as possible to the community. I would like to see your team build awareness to the C4S team first as to not waste the funding that would be given to you. Build out on social media and make your presence known, gain the followers and potential stakers that you need, build a plan and get a solid team together, and then I will feel comfortable granting funding for such a project. Thank you for all your team does for this ecosystem, and I hope to see you guys continuing your great work!", "q2r": 3, "assessor": "z_assessor_2895", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 9466, "q0": "This proposal cannot stand on its own as there is contextual drivers that contributes to the understanding of this proposal. I end up ranking this section a 4 because I’m optimistic about the whole C4S ecosystem (all 4 proposals including this one). This one is extremely cheap compared to most other Catalyst proposals and it provides a plethora of benefits for this ecosystem, so I greenlight it. I will point out that this proposal is mistaken that the stake pool will not increase Cardano’s TVL because ADA staking is not locked. So that’s not actually a benefit from this proposal. This section does not list a lot of benefits that it will actually bring like measurability of the C4S ecosystem to give us a guage of how much conversion in the senior population that this program has seen. This stake pool will provide a branded stake pool that seniors can develop trust for when being introduced to the Cardano ecosystem because I expect a lot of skepticism for the senior populations. I think they’ve properly assessed the risks and have a solid long-term plan to multiply the resources approved from this proposal. ", "q0r": 4, "q1": "Since it seems like they have a dedicated stake pool operator that has all the technical skills necessary to run this SPO, I give this section a solid 5. The team will also be engaging with experienced entities with ISPOs to prep for the potential future of building out their own native token (which would be another bonus for developing trust among seniors). They cite projects like Maestro or Genius X to consult for ISPO development but I wonder why they wouldn’t engage with players that have more ISPO experience like MELD and SundaeSwap. I could raise some concerns about whether or not $2500 is necessary to build a sufficient stake pool machine but I feel like it’s insignificant to the greater mission and they certainly do want to provide something that will be reliable long term. If they did want to secure greater voter confidence, I might suggest breaking down budgeted items more to determine spending efficiency. Overall, this seems like an easily accomplished proposal for a potentially high-impact mission. ", "q1r": 5, "q2": "This section lists various guiding questions as a measuring stick for success but I think there’s a missed opportunity to aim for target metrics on the success of the stake pool. 3 stars. There’s a lot of goals that can be aimed at with a stake pool including uptime, # of wallets, and staked amount. Since C4S has a direct audience that they’re trying to convert into the Cardano ecosystem, this stake pool is basically an additional measure of success for the greater ecosystem. So I think voters would like to see target goals for these metrics to secure voter confidence in ecosystem success. This section does give one quantified metric for success in “100 seniors that stake with the C4S stakepool” but it doesn’t give a timeline for it. I think an objective target would give voters an idea of how successful they expect to be, and committing to a certain level of performance. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 15026, "q0": "I am not sure why the proposer decided to submit this proposal in this challenge, as this proposal intends to subsidize the creation and operation of a staking pool to fund a DAO and create a tokenomics model for an ISPO, which is not within the potential directions of this challenge.\n\nIt is true that this challenge has a relatively high budget and this could be a reason to submit to this challenge, however there is a challenge dedicated to DAOs in Fund9:\n\nhttps://cardano.ideascale.com/c/campaigns/26594/stage/stage-assessqa429167/ideas/unspecified\n\nThe proposed metrics are relevant and indicate a relationship with the staking pool operation and the creation of tokenomics/ISPO, but they do not have targets (KPIs), which prevents the projection of impact and are not aligned with this challenge.\n\nThe team intends to carry out an ISPO to fund itself in the future but has not yet defined the token's tokenomics and depending on the complexity and costs of the tokenomics plan, it may request funding again.\n", "q0r": 1, "q1": "The team presented will coordinate and manage the development of the proposal, but there are no team members with the expertise to operate a staking pool and they will need to hire someone from the community. The team will also hire third parties to develop the DAO and create the ISPO model.\n\nThere are links to the C4S social networks, but there are no links or sources to verify the experience and profiles of the members mentioned in the proposal.\n\nThe budget for this proposal will go towards bootstrapping the staking pool and the team intends to return the deposit to the Cardano community (there is no mention of how the money would be returned).\n\nThere is a budget breakdown, costs were mentioned in a generic way, there is no mention of how long the pool will need subsidies. To operate a staking pool there are recurring expenses such as servers, hardware, cloud, internet, electricity, costs with the pool operator and these costs depend on how long the pool will operate.\n\nThe staking pool may or may not get a good volume of delegation and be able to pay itself off, but this is unpredictable.\n\nI would recommend that the proposer establish a period, perhaps in months, of time for the operation in order to associate for how long the treasury will subsidize the operation, so it will be possible to say if the proposed budget is adequate and if the workload of 50 hours for the operator is enough.\n\nI consider that the time set for developing the proposal is adequate, but there are no great details, detailing the steps over the quarters and almost no information about the plan for developing the ISPO/tokenomics model.\n\nThe team considered risks and proposed appropriate solutions.e.g. Low volume of delegation in the pool and risks to the creation and operation of the pool.", "q1r": 3, "q2": "There is a roadmap and milestones. Despite the low complexity of the proposal, the roadmap could be more detailed. Leaving a gap between Q2 and Q4 to create the tokenomics model makes the evaluation very subjective. Between April and December 2023 is a very wide window for just one ISPO model definition.\n\nThe mentioned metrics are adequate and relevant to evaluate the performance of the staking pool and the creation of the ISPO, but there are no KPIs with targets, which reduces the effectiveness of auditability.\n\nThere is no set fee for pool operation.\n\nThe team will share project development and metrics on their social media.\n\nAlthough the problem implicit in this proposal (DAO's financial sustainability) is not related to this challenge, there is clarity on how the team intends to be financially sustainable (ISPO).", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15166, "q0": "Impact\nThe target audience for this proposal is the 2 billion seniors. Seniors means(? 55 years and above?). It's to create a platform for educating the seniors about cryptocurrencies, Defi and Cardano with emphasis on Risks Management. The means is forming a C4S single stake-pool and to initiate an ISPO to finance the DAO so as to create a sustainable platform for future operations. \n\nThe team consists of 3 members initially. A coordinator and two project developers and operators of the Stake - pool. More talented resources will be brought in to operate the SP professionally. \n\nThe fund requested is 6200 USD\n\nThe impacts on Cardano as stated are :\nPrepare people willing and able to contribute to the ecosystem. \nIncrease users through  an added stake-pool to increase the total value locked \nTokenized, creating a new asset \n\nThey recognize risks inhibiting success of not getting the right talented candidate for operating the SP.  But they have identified alternatives to mitigate that. They are also concerned about not  getting enough funds to meet the ROI. \nThe mitigation: use the fund from the team to start the pool and run for a term even without achieving profit. The DAO and ISPO should bring in liquidity. \n\nAnother risk is improper running, maintaining upgrading and general operations. Mitigation is to get the right talent. \n \nI understand: \nTheir problem statement and their intended solution. This proposal is one part of the many that aims at their MISSION STATEMENT which states in their website:  \"Cardano for Seniors is dedicated towards educating senior citizens globally, about cryptocurrencies, DeFi, and Cardano with risk management techniques\". They have clearly stated the impact of the proposal clearly in line with the Challenge and I agree with them. I support and strongly agree.\n\n", "q0r": 5, "q1": "Feasibility\nThey have detailed plan \nPhase 1\nQuarter 3\nDecide on the use of bare metal SP or use of web service, or use of Community pay for service \nQuarter 4\nInitiate SP \nPhase 2\nQuarter 2 to 4 (year 2023). Initiate SPO\n\nBudget details \nStakepool 500\nFunding 3000\nBare metal or service 2500\nOperator initial 50 hours at 40 =2000\n\nThe sum does not add up 6200 (should be 8000)\n\nMore funding may be required depending on the Tokenomics study \n\nThe team members are involved in other projects in fund 9 and from earlier funds \n\n\n I understand:\nThat the proposers have the ability, capability and experience to manage and coordinate this project with resources from hired personnel or outsourced services, a decision to be made in their meetings. Their success in bidding the previous fund,  and the webpage they have done show their confidence in this current proposal.\nThey have detailed the plan of implementation which includes exploring and studying, selecting and decision making process on the secured alternatives. \nTheir budget items tally to the plan (except that they may have to recalculate the total sum; it should add up to 8,000USD and not 6,200). \nThey identified several risks that may hinder the success of the project but they have explored the possible mitigation. \n\nHowever, I don’t see any marketing effort and promotion in their plan or in the budget, unless they have another proposal earlier or later, and they don’t have any marketing resources.  I think the promotion on their website alone is not sufficient and good enough to attract the attention of the seniors.  This may hinder the success of the 100 seniors in a foreseeable period. Therefore I rate this as 4.\n", "q1r": 4, "q2": "Auditability \nKpi used for project progress decision making from information \nPhase 1\nEnough number of  information sources?\nActually received the information?\nSufficient information for decision making? \nDecision made? \nFund initialization when? \n\nPhase 2\nHow much fund was attracted? \nTokenomics finalized? \nISPO issued? When? \n\nSuccess \nSingle stake pool first block, up. \nISPO initialized \nFirst 100 seniors who stake with C4S \n\nThis proposal is a continuation of Fund 8 C4S that was to develop an understanding of senior learning patterns, develop ELI65 dictionary and marketing via YouTube. This project is on track. \n\nThe previous project second part concurrently submitted to animate learning segment for global distribution. \n\nThis project is to make the C4S self sustaining community project. \n\nI understand that:\nThey are reporting the project progress via several channels with a list of identified KPIs and They are looking at success as the first block in their single Stakepool, the initial stake pool offering and having the first 100 seniors stake with the SP.  However, the proposers do not have a timeline for achieving the 100 seniors threshold, nor do they have a success target for the fund raised from the  IPSO.  The lack of marketing and promotion effort may inhibit their achievement. I would settle for a 4 that I agree that the information is sufficient to measure the progress and success of the project. \n", "q2r": 4, "assessor": "z_assessor_2631", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Our solution is the Formation of a C4S single stake-pool and to initiate a Cardano4Seniors Initial Stake Pool Offering (ISPO) to fund the DAO and create a sustainable platform for future operations.", "experience": "The team has a diversity of tech talent and while we have the experience we are also smart enough to know to bring in experts, which is what we plan for the C4S Stake Pool."}