{"id": 413990, "author": "wada", "title": "Wada Product Integrations", "url": "https://cardano.ideascale.com/a/dtd/413990-48088", "category": 26595, "amount": 128000, "description": "A lack of integration between dApps and products means that projects are often working in silos.\nThese projects miss out on the benefit of shared user bases and seamless user experiences.", "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 3193, "q0": "The proposal is built under a very good design and it has excellent readability. To exemplify what I’m saying, one can see that deliverables are put in concise terms, and the proposers managed to bring an example of user of their platform. This helps readers to understand how normal people could be impacted by their platform. \nProposers say that they will host “Wada and Wada-affiliated products”, but they didn’t specify if non-Wada products would also have a place on their platform. This is important to give clarity for the community about the scope, size and market of the proposed solution. Having a Wada-only platform might be a limiting issue. It’s not that they are saying it is, but they are not saying it isn’t. Finally, they address correctly the challenge and gives future use-cases that can be more related to Cardano ecosystem. ", "q0r": 5, "q1": "Budget is not well detailed. Proposers do not tell how they arrived to those numbers (eg. Team fees and developer fees), by saying how many people or how many human hours are expected to be paid with such values. In addition, I the proposal doesn’t tell in any moment where it will be developed, or at least which country(ies) they are taking as reference for the budget and salaries. In a relatively high budget as the one they are asking, it is important for the community to see more detailing of how it will be spent.", "q1r": 4, "q2": "In terms of auditability, the proposal has clear deliverables and a reasonable roadmap. Moreover, the team has provided some evidence of their previous experience in such projects, and they will recruit more developers to complete the team once they are funded. They have presented product-related metrics and their key-metric will demonstrate the success of the project (“number and percentage of its products that have been successfully listed,”). To improve the auditability, proposers could have been presented an estimate of this number of products that they expect, or some evidence that shows their knowledge of the market. However, this doesn't compromise the overall auditability. ", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5626, "q0": "The problem described in this proposal is highly related to the Challenge. It seeks to introduce more high quality use-cases to the Cardano ecosystem through a marketplace poised on product integration and shared user base, while introducing quality products and Dapps in an accessible manner for all actors (users, developers, businesses). \n\nThe solution given has provided ways it could improve the marketplace aspect of the Cardano ecosystem. Notably, the solution heavily centres on providing greater access to all actors, great user-experience, integration of all products with Wada marketplaces, a standardised practice for high quality products and scalability. Hence, I foresee a marketplace useful for the masses as it provides a more interactive, participatory environment for all with lower barriers of entry. Additionally, the proposal even highlights the potential future use cases of its marketplace, further establishing itself as an impactful proposal. \n\nI believe the key metrics provided by this proposal serve as great indicators of the potential of this project. As the Cardano ecosystem is still at its infancy, there is a good chance this marketplace would encourage the development of new products within Cardano, bringing about integration between products and user base while levelling the playing field between users and solution providers. \n", "q0r": 5, "q1": "The proposal has provided us with a detailed explanation of the team member’s individual professional experiences, role and responsibilities within the team and their respective experiences in Blockchain technology, particularly Cardano. This implies a capable team that understands their tasks, end-goal and how to steer the project towards the fulfilment of this challenge for the benefit of Cardano. \n\nDetailed role explanations aside, I think the team conveys much confidence due to their active participation in Cardano Catalyst (in which they have several funded projects from previous funds). This showcases a dedicated and committed team with an excellent track record in Catalyst. Given the potential of this project and presence of an excellent team, this further increases the feasibility of this project. \n\nI think the proposal has done excellently in identifying potential challenges. The challenges and solutions to the challenges cover the nature of this project thoroughly, that is involving tight collaboration with various teams, technical capabilities and requirements. \n\nGIven the technical requirements and scale of this project, I think the proposed budget of $152,000 is completely justifiable for a duration of 12 months. There is also a detailed budget breakdown of how the proposed budget will be distributed amongst various roles and tasks. \n\nTimeline given is reasonable and comprehensive wherein there is no sign of overpromising. We are given a clear timeline with deliverables/milestones on a quarterly basis. However, one issue I have is the typical Blockchain development cycle where delays are seemingly inevitable due to technical issues. Given the high possibilities of this happening, the team does not present a contingency timeline in case of hiccups. Despite the team having several underway funded proposals and proposals in Fund 9, the team conveys confidence in executing their projects (should it be funded) with no hiccups as they ensure they will assign dedicated project managers for only up to 3 funded proposals. \n", "q1r": 4, "q2": "Description of targeted problem is well-defined, along with a solution and proposal that align with it. The given roadmap has sufficient information to audit the progress and success of the proposal in the first 12 months. \n\t\nThe metrics and KPIs serve as great indicators to evaluate the project’s success as it is highly relevant to the proposal (a marketplace) and the Challenge’s goals. To be specific, the chosen metrics and KPIs are founded in terms of 1) quantity and quality of product listed in the marketplace, 2) traits of a successful marketplace. \n\nAs far as transparency and integrity go, the team has conveyed much confidence as they have identified public channels for the community to evaluate its success and progress. \n", "q2r": 5, "assessor": "z_assessor_2729", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8556, "q0": "According to the proposers, there is a lack of integration between dApps and products, resulting in projects functioning in silos. To make the problem more explicit, more information and examples would have been beneficial. The proposers solve the issue by establishing a platform marketplace where innovative Cardano dApps and products may host their solutions and get access to new markets. I think the proposal is valuable and aligns well with the challenge's aims. It's also great that the team gave a link to clarify their experience. The proposed solution was described in a well-structured manner, with main deliverable and secondary deliverable which are relatively a landing page directory that hosts Wada and Wada-affiliated products, providing product roadmaps, sign-up information and launch details and an online platform that hosts Wada and Wada-affiliated products in an integrated fashion, paying close attention to seamless user experiences and standardized design principles. To me, the proposal clearly defines how and why it would offer value to the Cardano ecosystem, and hence the KPIs are linked with the outlined challenge. I appreciate the effort they took to explain risk management. However, the only suggestion I have is that the proposers include a risk section that analyzes possible threats to the proposal's success and how to minimize or lessen such risks.", "q0r": 4, "q1": "In terms of feasibility, the strategy specified to implement this idea is clear and reasonable for me, providing a vision for the first 30 days, three months, six months, and twelve months, for which I praise them. Members of the core team have assembled a highly varied mix of talents and expertise across a wide variety of fields. Referrals on LinkedIn were presented, so experience may be validated from that standpoint. I note that the proposers intend to bring in more talent for the project. It would be more beneficial for the team to provide detailed info on the requirements for applying for a position in the core team structure, as “who can act as both project manager and solutions architect for the duration of its implementation” seems quite subjective. However, when it comes to the budget, there is a fairly specific description of the elements that comprise it, and the cost is also attached with each item, which seems reasonable to me. As a result, it is easy to make an accurate assessment of the fairness of the fund requested. My only concern is that the team requested $128,000, but the overall budget is $152,000; where would the remaining funds come from? Overall, I believe this plan has a high probability of success.", "q1r": 4, "q2": "The welll-defined measurements make it even more compelling, as do the well-described 30-day, 3-month, 6-month, and 12-month milestones. Key metrics and KPIs are relevant, described in detail and most importantly present. These metrics, in my opinion, are critical markers for tracking the impact. It is also commendable that the team provided quantitative measures and a defined definition of what success looks like. Because of the reasons stated above, I believe it is rather simple to determine whether the project is a success.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12330, "q0": "The idea to create a platform marketplace for new cardano dApps and products to host their solutions on a gain access to new markets, hence contribute to the cardano ecosystem. To address the challenge the proposal has an outline of solutions with clear headings showing Wada's approach to the solution. The project has currently a 15+ dApps and products which seeks to create more to add to the blockchain space. The proposal provides information to a more developer experience which seeks to use this platform to create an access marketplace for dApps and products in the blockchain area. The project intend using a team who are familiar with the cardano blockchain together with technical hands outside the community as well. The project is in alignment with the challenge settings.", "q0r": 5, "q1": "The team to work on the project are a group of developers and people familiar with the cardano blockchain. There is a clear detail on how the project intends to address the problem. Furthermore, the budget has been put into breakdown of items which is clearly stated. The proposal has provided a clear roadmap with milestones showing a timeline of activities. In addition, the project shows what is to be done between the first 30days to 12 months of the project. I believe if the project receives the necessary funding it will be implemented.", "q1r": 5, "q2": "There is clarity of information that have been provided.The proposal provides a clear roadmap with milestones on how set timelines will achieved. The proposal has given key performance indicators to measure the work progress when it is implemented. Examples are the number of products listed on the platform, the number of products agreed and standardized design principles, web traffic and email sign ups. The information provided for the project is clear and detailed for its implementation.", "q2r": 5, "assessor": "z_assessor_3401", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 13332, "q0": "The synthesis and connection of dApps with these products is very nice and convenient, easy to use. This seems to be a long-term visionary proposal for expanding Wada dApps and bringing convenience to users in Wada's projects, providing a connection between the Cardano ecosystem with African people, the project is very humane and worth recommending.\nHowever, with the storage of linked products between Wada and Wada, in order to be more scalable, expanding the link between Wada and other products is also worth considering, especially for projects with involved in the development of the Cardano network in Africa.", "q0r": 5, "q1": "If your proposal is successfully funded, your project offers a roadmap of 22 months to complete the project, this can be considered a period of time neither long nor short because I know the Wada team still has a long way to go. Many projects run in parallel, so to optimize, you should indicate how much time your team spends on this project to work more efficiently and ensure progress.\nThis is a project that requires a lot of brainpower and time, so the budget can also be very large, the Wada team has divided the budget for each plan, which is very good.\nYour team's team is very strong, but each task should be allocated to each person to be clearer.", "q1r": 4, "q2": "Can you tell me how much Wada's products are, so that the community can verify the number and percentage of Wada's trawmg is successfully listed?\nI have a small suggestion that Wada should display a pie chart to quantify the products listed and the level of user satisfaction with each product.\nThen there is a graph of user survey results on the Wada web homepage, if these quantitative assessments are done on smart contracts then great and can be trusted.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 14569, "q0": "I believe the proposal has a large impact on the Cardano ecosystem. The information of the products is fully demonstrated. I understand that the team currently has 15+ dApps and products and they would like to form an integration among them from both a technical and user-experience perspective. The team builds a landing page directory and an online platform which host Wada and Vada-affiliated products. In this writing, I find it clear about the idea, the components to carry out the project, and the potential objects that they orient. The example of Sarah Lakely is a bright point of the proposal. The example is that Sarah can apply for a loan to cover her rent and school fees with two ways. The first one is through a haphazard search of available products of various discords, search engines, social media, …And the second way for her is to visit Wada product dashboard to see where each product is in its development cycle which have integrations. This has shown the outstanding strength of Wada. Another point of this proposal that I highly appreciate is the results of the projects. This is explained clearly with Future Use Cases.  On answering how the proposed solution will address the Challenge, the proposer has given two apparent points: the idea helps create and improve different Dapps, products, and integrations and raise the integrations with other existing services, products and protocols that improve the end-user experience. These are closely aligned with the KPIs or key metrics of the challenge. The proposal has illustrated three kinds of risks which are coordination and agreement, but it is better for the team to give full solutions to all the problems. The first one is that pre-existing coordination and agreement between hubs and product teams can reduce full independence and deny the integration requests. The second one is the V1 product will likely require a custom build due to the nature of accessing products directly. And the last one is proof of concept. With three risks, the team has had a suitable solution for the second one, but they could have had solutions for the first and the last one. ", "q0r": 4, "q1": "I believe that the proposal is feasible to achieve the objectives that the team expects. The plan is written apparently with quite full information of the roadmap. The plan is arranged in months or quarters. In each period of time, the results of the projects are listed which is easy to understand. The use of the budget is separated into categories like team fees, marketing and brandings, design fees, platform fees. The total fee is $152,000, but the proposed budget is only $128,000 then the gap will be covered by treasury funds and other funding sources. About team members, they are the ones who joined Catalyst in the previous fund, worked as a Haskell and Plutus trainer, consultant, graphic designer, … They will be the talents for the success of the project. However, it would be great if the proposal includes the work they do or their responsibilities in the team’s projects. ", "q1r": 4, "q2": "The proposal gives information about measurements adequately. Key metrics are the number and the percentage of its products that have been successfully listed, then integrated on the platform; web traffic analytics and user surveys to measure user engagement. Also, alot of quantitative measures are listed such as No. of products listed on the platform, % products agreed to standardized technical specifications. This data makes it easy for the community to follow and assess the success or the completion of the projects. The picture of success demonstrates that users have integrated solutions with fully displayed products on a singular dashboard, which contributes to the convenience of the user’s dapp management and discovery.", "q2r": 5, "assessor": "z_assessor_4073", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a platform marketplace for new Cardano dApps and products to host their solutions on and gain access to new markets.", "experience": "Cardano-based community network of 25+ professionals focused on connecting the world to Africa using blockchain and AI. 20+ funded proposals with strong partnerships within the Catalyst ecosystem. A trusted source for both Africa-based projects and wider ecosystem contributions."}