{"id": 413989, "author": "headelf", "title": "C4S-Cardano4Seniors Incubator", "url": "https://cardano.ideascale.com/a/dtd/413989-48088", "category": 26595, "amount": 225000, "description": "There are 2 billion Seniors age 55 plus which will double in 10 years. This niche market has unique market needs. How can Cardano establish itself as the go to Block Chain for 4 billion Seniors?", "f6_no_assessments": 9, "f6_rating": 3.4074074074074074, "videos": [], "media": [], "f6_assessments": [{"id": 122, "q0": "The proposal mentions the problem in a superficial way, there is no information about the context of the problem, I would recommend providing more information about the senior market and how blockchain can be useful.\n\nThe proposal is actually not a dapp, product or integration, but a DAO/treasure that intends to recreate the challenge setting with a similar theme. The reason I see alignment with the challenge is that the proposed treasury restricts the use of funds to proposals aimed at developing dapps.\n\nIn the field of metrics most of the information is actually a roadmap with steps and not metrics. The suggested metrics are not aligned with the challenge brief metrics for this challenge. There are no KPIs with targets that allow understanding the potential for impact.", "q0r": 2, "q1": "The proposer mentioned experience as a serial entrepreneur with over 20 years working in the Financial/Risk Management fields marketing to & advising Seniors, which is relevant to this proposal, but did not cite sources to support this data.\n\nThere is a link to a Linktree where there are links to various social media, but none that indicate who the team members are or sources for checking qualifications (on Linkedin).\n\nThe proposal mentions that the team has 4 members with experience in Catalyst, as PAs and vPAs and in Challenge Teams, but there is no mention of who the members are, which compromises this feasibility assessment. Considering that the team members are PAs and vPAs it was to be expected that there would be a more detailed description of the profiles, but I didn't find anything in the included links.\n\nThere is a budget breakdown and there is not much to say about the budget as the idea is that almost the entire budget is earmarked for future proposals, so it seems to be appropriate. Administrative fees are reasonable.\n\nThere is no detailed plan in the feasibility section, just an unrefined idea that a treasure will be created that will be managed by the team and that eventually submitted proposals will be evaluated by the team members, which is a concern as it indicates great centralization to decide who will receive funding.\n\nIn the auditability section some additional points of the plan were included that allow to have a basic notion of the schedule in 3 stages, team formation, marketing and proposal stage.\n\nThe project timeline is 2 months post funding, but it is not clear how long each stage will last.\n\nConsidering that this proposal is to create a side treasury, there is still a lot of information about the processes missing, the plan needs more detail.\n\nOne risk that has not been addressed is corruption. I'm not trying to imply that the team has shown any signs of bad intentions, but we are in the blockchain industry and one of the mottos is \"Don't trust, verify\". A treasury managed by only 4 people and proposals evaluated by only 4 people open scope for corruption, how can we guarantee transparency and avoid bias in the process?", "q1r": 2, "q2": "There are no appropriate metrics/KPIs to audit proposal performance.\n\n\"The team will use a transparent Agile system to publish, market, measure and audit all aspects of this Proposal.\" This should bring some transparency to auditability, but could they have explained what \"all aspects\" comprise?\n\nThe suggested roadmap/timeline is 2 months but there are no milestone dates to measure progress.\n\nThere was a lack of clarity on the problem and on how the solution will address the problem. I would recommend going into more detail about the seniors problem and detailing the proposal plan better so that the solution is more understandable.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1, "reply": "The PA did not understand the wide range and nuances of the DAPPS Challenge by the statement -\"The proposal is actually not a dapp, product or integration, but a DAO/treasure\". (Also I do not know or understand what a DAO/Treasure is). The actual Challenge statement of this category allows and encourages a much wider range of Proposals then just DAPPS, etc. Also in the impact section the PA is referencing KPIs ( \"There are no KPIs with targets that allow understanding...\") which assessment should be limited to the Audit Section."}, {"id": 2050, "q0": "The proposal is targeting 2 billion seniors aged 55 and over. In my opinion, this is a fairly potential market because there are very few ideas aimed at this audience. The idea of ​​the proposal is nice to set up an independent incubator within Cardano to start funding projects that focus on the growing niche Aging Market. The scope of the Senior Incubator project will attract and target DApps and projects that focus directly on the Middle Ages market. While the idea for this proposal is nice, I think it won't have as great an impact and I think it would be better suited to the \"Challenge setting\" challenge you suggested in the \"Fund 10 Challenge settings\". We cannot submit 2 proposals with similar content at the same time, this will reduce the chances of getting funding for other potential proposals. Setting this proposal in a Challenge setting will be attractive more proposer focus, right from the moment of this project evaluation.", "q0r": 3, "q1": "It is difficult to assess the feasibility of the project because the project does not have a specific product. So it doesn't have a roadmap for everyone to follow, what I understand is that after receiving the funding, The fund would be directed by an independent panel of five community members. The members would vote and award grants to Proposals to kickstart Senior targeted projects. This means that the proposals to be funded or not will be decided by these 5 members based on their knowledge and experience. However, the proposal did not disclose who these members were, he said it would be managed by him and four active members of the Catalyst community. But how can we verify whether their qualifications are suitable or not?", "q1r": 3, "q2": "The success of the proposal seems rather vague \"Success looks like 9 plus projects focused on the 2 billion global Senior projects being funded.\" The required budget amount is $225,000 -$4000 (admin fees) = $221,000. Each proposal will be limited to a maximum of $25,000 so if the project is successful I think at least 10 projects will be funded. On project testability, the team will use a transparent Agile system to publish, market, measure, and audit all aspects of this Proposal.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2897, "q0": "The problem of the proposed proposal is the difficulty in connecting blockchain in general, cardano in particular to the elderly (aged 55 years and older) compared to other age groups, this is a potential customer group but little access. care about.\nThe solution is to create an independent incubator fund to finance projects focusing on development for the elderly market, (less than 25k $ per proposal)\nThe anticipated risks are not receiving funding, no proposals will be eligible for award, in addition I suggest additional risks that the proposals that receive funding may not be completed, deficit. budget, non-refundable.\nThis fund is aimed at projects, Dapps for the elderly such as health, insurance, finance, wills... The users of this project are people who have ideas and proposals but lack capital and the end user is to serve the elderly customers", "q0r": 5, "q1": "The proposed team of 3 people, Tom Frey, Theresa K, Kevin Burke, announced they were an experienced and senior team to complete the project but I could not find any documents, personal links to prove it. For what they claim , I suggest you add information that although C4S is active in the community, a complete proposal would need this information.\nThis is a continuation of the project funded at fund 8: \"C4S - Cardano Center for Seniors\" https://cardano.ideascale.com/c/idea/396845/attachments, Budget The request is 225k $ for the administration and disbursement of the proposal, the budget has not been detailed, the roles, selection criteria of 4 community members. \nBecause of the lack of link to personal information, I rate 4 stars for this criterion", "q1r": 4, "q2": "In addition, I found the team used the Agile system to measure and audit aspects including budget and progress before - during - after disbursement to ensure project transparency.\nHowever, this proposal does not see income sources, especially plans to generate revenue from funded projects or end users, or revenue from 3rd parties, advertising, intermediaries when there is traffic. large users, that's my contribution, the team can consider it to suit the project's goals.", "q2r": 5, "assessor": "z_assessor_2359", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 4882, "q0": "The proposal looks at the 2 billion agree 55 yr and above seniors as the niche market. It proposes a fund separate and independent from the challenge settings. This fund is to initiate focused projects each to be capped at 25000 USD.  Such projects would focus on health, insurance, tax, legal, wills, etc related to seniors' needs. However, I am not clear whether the project initiators should come from the seniors only or is open to the catalyst community. \n\nThe fund requested is 225000 USD. The proposer is an entrepreneur with more than 20 years experience in financial/risk management and have been marketing and advising seniors.\nHe has an ongoing F8 funded senior learning project.\n\nIf the fund attracts no interest and / or no qualified proposal, the fund will be returned to the Treasury. If fund does not gain the confidence of the community and it does not think it's fair, then the fund would be returned as well.\n\nI agree to the proposed solution that more people (seniors) will be brought into the Cardano community and getting them willing and able to make contributions to the ecosystem does meet the challenge priorities. It looks like it is also meeting the campaign need of implementing Dapp and helping drive more adoption, as proposed.\n\nI therefore strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal is setting the fund 10 challenge. However the funding is set to be paid out with ADA.\n\nThe budget is for one cost item and that is administration cost 800 USD each for 5 community members appointed,  including the proposer himself. It's not clear whether it's one time compensation or more to come when the project proposals start to come in after theThe balance of 221000 USD is not a cost but it's reserved for funding future projects.\n\nThe proposal does not state how many projects would likely deplete the fund allocated, but if fund 9 approves this, the proposer will again propose it again in the next fund. I am not sure whether this trend of proposal submission will continue until the fund is depleted.\n\nAs I see it, this proposal is not like a project proposal that would spend the fund allocated for immediate and targeted benefits, but it is a proposal to set aside a sum of money for projects (for vetting by the 5 community members and vote for approval again by members?) meant for specific category of community, namely seniors of age 55 and above. \n\nI am not clear about the plan and am not clear about the duration, nor am I clear about the technicality of the proposal. On the whole,  I am not sure about the feasibility of this proposal and I can only think about the benefits that can or can't accrue with this kind of arrangement as opposed to the status quo. And this is not my jurisdiction to assess. Therefore I neither agree nor disagree that it is highly likely this proposal will be implemented successfully.", "q1r": 3, "q2": "The proposal will report on the progress using an Agile system.\n\nIt proposes to form an admin team, then market the fund seeding, and then set the process to voting and rewarding. \n\nIt looks at 9 or maybe more projects that only focus on the needs of seniors.\n\nI am not clear about the time of accomplishment, I am not sure about the proposal can solve the problem stated. Because of this, I neither agree nor disagree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_2631", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6635, "q0": "This is a very interesting proposal which builds on top of an already existing project funded in F8, Cardano for Seniors Hubs, which is intended to disseminate information to a new target market, senior, for whom communication channels and the general fashion of shaping the message obviously has to differ from the way in which the same message should be delivered to younger generations, who are more tech savvy or even digital first, and much more acquainted to the technology, general way of doing business and the jargon used. For seniors of course this is not the case and more appropriate mechanisms have to be found if the aim is to increase their participation in the blockchain industry in general and within the Cardano ecosystem in particular. \n\nThe proposal is interesting from another point of view, namely that it better resembles a funding mechanism than a general proposal to build a solution. I would define it as a rather unorthodox combination of rapid-funding mechanism, alternative (or rather additional) review mechanism to Catalyst itself.\n\nMore specifically, the project intends to launch an incubator for projects focused on the senior market, with each project capping funding at 25k USD. Of course, this is something that Catalyst can do on its own, but let’s see in the following section some of the advantages and disadvantages of this newly proposed mechanism. \n\nThe incubator would run independently from the Catalyst process and would be directed by five community members with the power to award funding. Overall there would be a positive impact for the Cardano community if this project were implemented, but with significant risks of overlapping the Catalyst function, so only four stars I deem as appropriate. ", "q0r": 4, "q1": "Governance is hard, governance is tricky and governance is important. This is valid across the entire world, when we talk about governments, institutions or even functioning smaller entities like small businesses or families. Charles has said it himself several times, and Cardano has in its DNA the governance-exploring and research gene: the many IOG studies in this area and the excellent level of debate in the Cardano communities regarding governance are a strong statement in this respect.\n\nI start the feasibility part with this governance introduction only because it is highly relevant for this proposal - since it basically asks for a certain portion of funds to be disbursed towards the community through an alternative funding mechanism. This in itself is a blessing and a curse at the same time. A blessing because imagining a better governance mechanism requires experimentation - and this proposal is exactly this. Different, agile, innovative, with unknown rewards in the end. \n\nA curse because there are big unknowns. We are not being told how the board would function. Will the proposer’s place amongst the five be permanent, will there be checks and balances if he doesn’t act in the interest of the community, and who can challenge that and what can be put in place? What about the other four members, how will they be chosen and what will be those mechanisms to keep their actions in check? How will the board handle conflicts of interest? Are there good enough selection skills within the team to make sure viable projects are selected? \nBudget discussions are fairly simple - the majority of the budget would be passed along proposers. So the system will be agile in this respect. Only a fraction of the budget would be used to remunerate board members.\n\nI am indulgently offering four stars in the feasibility section, but only because within Catalyst we are supposed to “break things”, and this proposal is possibly an excellent candidate for such a “breaking” experiment. ", "q1r": 4, "q2": "We have a rather weak, or uncertain case for auditability here, and I don’t think that the projects funded this way would be subject to the same scrutiny that general Catalyst projects.\n\nThe team stars the section by informing us that they will be using an Agile system to make relevant information available. The transparency process will focus on three parts. First, a formation period is mentioned, in which the admin team would take shape. This is however an information not really connected to the auditability so it’s not very clear how it connects to this section. Second, the efforts would go towards marketing the funding round, and we are being told that this would be a “joint community” effort. My reading of this phrase is rather negative, since I understand that the onus will be placed on the community rather than the team behind the proposal to spread the word, and I’m not sure this is a very constructive attitude. Third, there would be the proposal period, similar to the one Catalyst organizes, and a voting process. Another significant question mark, since we have not been given any indication that the team will be able to handle the voting process on and  off-chain, in a similar fashion to what IOG is performing now. A slightly positive aspect is that the team sets out a clear and simple success metric: over nine projects funded, focused on the global senior market, but this is all that we are being offered in terms of measuring success, so there is definitely a lack of clarity and loss of focus in this section.\n\nAn excellent proposal would have included perhaps relevant metrics comparing impact from similar Catalyst funded proposals to some funded through this mechanism, or a comparison of “time-to-market” for products, building an argument that this mechanism is more agile / faster / better / more impactful than Catalyst. Perhaps future iterations can take this into account. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8240, "q0": "\"The proposal was coming up to address the challenge of increasing the number of Senior to Cardano market. It is suggested that the proposer can add more case-studies about incubation with small budget to increase more trust of readers. Thanks to this proposal, the number of seniors joined in project will be increased. \nThe proposer already mentioned about metrics of procedures to collect the incubation for funding. It is suggested the proposer team can include some expected number for each step to ensure its feasibility. \n Risks were clarified by the proposer with some tentative idea to solve it. It supports the team to take more initiatives if risks happen and mitigate the affection\n\"", "q0r": 4, "q1": "\"In the timeline, there was no information about what the proposer is going to do to realize the plan. Although they have ideas that the funding would be done in next Fund. So, it is suggested the proposal team write again this part, from starting ideas till select the funding proposals. \nBudget currently is quite simple, just only focus on the fee for administrator and funding award. However, in case of changing proposal timeline as mentioned hereabove, there might be some changes in the budget. The proposer can consider once again about it. \nTeam will include five active members who will grant for the Incubator. However, information about the team and roles of each member haven’t been available that. Therefore, the proposer can think again and add more information about team members. \n\"", "q1r": 3, "q2": "\"The proposal already includes information regarding to the steps of collecting candidates to be awarding. However, it is necessary to include the expected number for each step to measure easier.  \nThe success seemed to be the future after funding by this proposal and its expansion to more global senior project to be funded. It is quite clear and have open future to let all senior members join in Cardano by being funded. \nThe project is the new one in Catalyst in this round, with the intention of team to apply for next round funding, as well as the team worked with others project in this round as well. \n\"", "q2r": 4, "assessor": "z_assessor_2969", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8394, "q0": "Generally, this proposal provides a moderate amount of information related to its description, or more precisely,this Impact section. After reading carefully the description of your proposed solution, I can capture the adequate data of your project’s main functions, and target audience. However, I realize that the impacts of your project are not concentrated much here. Would your aimed subjects receive any good values from your project other than funds? Please answer this question in more detail. Next, you declared clearly that your project specifically addresses the DApps challenge statements, but your thesis is not strong enough to prove it. This part needs more information or evidence to demonstrate its ability to solicit and grow the Senior niche market so that your key metrics could fully fit the challenge in the most convincing way. Your anticipated issues and their solution directions are expressed rather explicitly.", "q0r": 3, "q1": "By and large, reading this section of your proposal, I just wonder whether you are serious about conducting the project or not. Truthfully, this is the worst part of the proposal I have ever read. No detailed work plan, sketchy budget breakdown and finally, no clear member list! As you announced, Funding would set your calendar to the Fund 10 Challenge calendar where C4S would have a targeted Challenge, similar to the current F9 Challenge setting of CardaShift. So the matter is: what does that calendar contain? Does it have any certain timeline and milestones for the project? If yes, please elucidate them in this proposal for the voters to know. This problem is similar to that of your member list. The request is to provide details of the people who will work on the project; yet the most basic information about these members is “The Project will be administered by myself and four members” without any specific names or profiles. Why don’t you introduce these colleagues and yourself for the community to acknowledge and they could have a basis to evaluate your project? In terms of your requested money allocation, it’s easy to see that its transparency is really low due to limited information. I recommend you shouldn’t summarize your budget breakdown with only two fees for administrators and proposals. Tell the voters what main activities are involved in each of them and how much it costs. Try to bring more data since you must understand that $225,000 is apparently a gigantic amount of money which must be declared in detail.", "q1r": 2, "q2": "Well, this Auditability section is totally different from the others. I have to admit that the way you describe how you measure the progression for tracking is explicit and persuasive. You manage to show the voters your measurement tool (Agile system) as well as three detailed measured aspects. In addition, I love your definition of success for this project because it contains transparent data. 9 plus projects focused on the 2 billion global Senior project being funded is a well-suited data for the voters to assess whether your project can reach it and succeed. Yet I think this answer is too short (only one sentence). If possible, I hope you can add more information about your thoughts of success for this proposal.", "q2r": 4, "assessor": "z_assessor_2980", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9467, "q0": "If I had seen this proposal by itself, I would be giving it a hard pass rank 1. However, when you take in the full view of different C4s proposals and what they’re doing to serve senior communities and enable major adoption of Cardano from a high net-worth population, I rank this section a 4. I acknowledge that a proposal of this amount definitely needs to have a greater level of detail but I will defend my ranking, as I think this organization is a very forward thinking long-term benefit for the Cardano ecosystem. The other proposals are centered around creating communities that are designed to deliver specially designed education to seniors that facilitates adoption BEFORE the event that has recently been called “the great wealth transfer.” While education for this population can make a big impact, this is the only proposal that will build out more relevant/innovative Dapps that seniors can use to secure their assets on the blockchain, as opposed to traditional centralized services. I vote positively on this section because of the contextual information obtained from other proposals, so I recommend reading those before making a decision on this one. ", "q0r": 4, "q1": "These sections are appropriately short because this particular proposal is just a fund that will encourage future partnerships that can design Dapps that are aligned with C4S overall missions. I rank this section a 4 because I this funding is appropriately managed by this organization to facilitate development aligned with C4S audience needs and the team is reasonably capable of managing said fund. This essentially creates a sort of mini C4S Catalyst program that “pays forward” funds awarded by Catalyst. I don’t think there’s much to evaluate here on this point of feasibility because of how simple it is, so I guess it’s mainly just a matter of if you vote favorably for other C4S proposals. ", "q1r": 4, "q2": "Similar to feasability, there’s not much to evaluate in terms of definitions for success on this proposal. I do think there was a missed opportunity to provide public transparency for storage of funding, so I rank this section a 3. Voters will want to know that anyone could watch the storage of incubator funding to keep this group accountable to responsibly managing approved funding. I don’t think there’s a lot of KPIs or success metrics to draw from, so transparency is the only thing that could be done for voters here. I vote neutral because the absence of provided transparency essentially leaves voters with nothing substantial to vote on. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9580, "q0": "\"The problem is that more than 2 billion people over 55 years old are currently worldwide. How can this group of people join Cardano?\nThe solution proposed to solve the problem was by setting up an independent funding fund with catalyst, having its appraisal panel of 5 people consider proposals for granting funding.\nProposals are targeted at teams that submit proposals related to the elderly population.\nStill meet the requirements of the challenge. Proposing the establishment of a grant fund to target elderly users, helping to increase the number of users and increase the number of transactions.\nMeet the SDG goal of Ensuring healthy lives and enhancing happiness for people of all ages\nAlthough the proposal meets the challenge, however, the proposal to establish a separate funding fund with only 5 people to manage and operate is not effective. While having catalyst is doing the same thing but much more efficiently. I think you should send to export in challenge setting will be more suitable. So I give 3 points.\"", "q0r": 3, "q1": "\"The proposed solution is to establish a grant fund for projects focusing on Seniors. The most significant risk is that the proposal is not funded, there are no projects to fund, or the project is not eligible for funding. The proposal has raised the most significant risk. Still, there will be another risk that the projects are not of sufficient quality and the evaluation is not transparent enough for the projects. This dramatically affects the proposed results that have not been considered.\nThe admin is Headelf, and 4 members are an active PA or vPA members of Catalyst. In addition to the recommender's information, the remaining members are not presented. There is no reference link of members.\nIt is proposed to have no other source of income other than catalyst funding. The plan does not have specific timelines. No work items to be solved have been identified.\nFor the above shortcomings, I give 3 points.\"", "q1r": 3, "q2": "\"Budget required $225,000. The Proposal does not clearly explain expenditure items. It is better to have a clear budget that is calculated based on the amount of work to be done, the number of employees, and the number of hours worked. eg: 2 designers x 20 hours= 2 x $80 x 20 hours = $3,200. If this is done, the evaluator can get more information on whether the workload and costing are reasonable.\nThe Team will use a transparent Agile system to publish, market, measure, and audit all aspects of this Proposal. All indicators will be based on a calendar that starts with money and will run for two months. However, the Proposal does not provide the metrics needed to measure progress and success.\"", "q2r": 3, "assessor": "z_assessor_3067", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Establishing an independent incubator fund within Cardano to initiate the funding of focused projects on the developing niche Senior Market. The funding would be capped at $25,000 per Proposal.", "experience": "My experience was as a serial entrepreneur with over 20 years working in the Financial/Risk Management fields marketing to & advising Seniors. I grew an organization from zero to $25mil with five offices. C4S was funded in F8 to develop a Seniors learning project- it is on track!"}