{"id": 414047, "author": "margarita", "title": "HONEYBEES ON BLOCKCHAIN", "url": "https://cardano.ideascale.com/a/dtd/414047-48088", "category": 26595, "amount": 23320, "description": "Honeybees are in decline on a global scale due to human activity without getting the economic recognition they deserve, while beekeepers are struggling to sustain honeybee population.", "f6_no_assessments": 18, "f6_rating": 4.518518518518519, "videos": [], "media": [], "f6_assessments": [{"id": 1590, "q0": "In terms of impact, the proposal is fully aligned with the objectives of the challenge. NFT collections will be created from the cause for the protection of bees, which is at the same time benefiting the activity of beekeepers and developing our blockchain, as the digital tokens will be created will help popularize Cardano. I think it's a very good idea because it can attract a new audience to our ecosystem, not those who are necessarily interested in the cryptographic world, but those who want to support the cause of bees. The objectives that would be directly met in the case of funding this proposal would be: the creation of \"Marketplaces - Total number of users, number of transactions carried out\", in addition the proposal would also work with \"Social Media - Total number of users, number of significant interactions” (because it is said that the project’s publicity campaign would be through social networks; and finally, an issue would be addressed in relation to “Environment - Total number of users, total CO2 sequestered, amount of awareness being produced, number of people changing a habit harmful to the environment.” In this case, we are not working with the CO2 issue, but fighting to combat the decline in the number of bees, due to human predatory activities, is a way of benefiting the environment, without The proponents well argue the need to carry out this project, since the bee market, according to them, moves around 30 billion dollars annually. Currently, in addition to being very important for the balance of ecosystems (we know, for example, that bees spread pollen from flowers, even helping in the matter of maintaining the flora). The project would, as the proponents claim, “increase and sustain the bee population, support the work of beekeepers, expand the use of Cardano in commerce, increase Cardano users/holders, and ensure sustainable living for all.” This would be done through some actions, such as the creation of NFT collections, from what I understood, 25 unique works would be created initially and each one would be directly linked to some hive, so once the NFTs were purchased the money would be destined for beekeepers treat bees better, acquiring more materials, fighting diseases, etc. In addition to this initiative, a web page would be created with the objective of keeping people informed about the subject. Here, I think further explanations would be in order. How would awareness of the issue be raised, what would be the approaches? Some examples of posts would be interesting. Another question that came to me while reading the proposal would be: how would beekeepers be instructed to take their first steps in cryptography? Who would teach them how to create digital wallets, cash out Ada, turn our currency into local currency? Finally, two other comments I would like to make are: it would be positive if the proponents explained more about the videos that will be posted for dissemination and also about the trips to find the hives (why would they be done?). In general, the proposal is very interesting and deserves maximum marks in terms of impact, although some doubts remain in the air after reading it.", "q0r": 5, "q1": "Unfortunately this topic is not 100%, some details would need to be corrected for the proposal to be fully viable, in my view. Talking first about the script, the way the information is passed we only have a superficial notion of what would be done during the project development process, without the appropriate level of detail. To start the temporal division is every 3 months, several activities would be done simultaneously in this period of time, the way they are scored we can't understand what would happen in month 1, 2, 3 and so on. The detailing of each activity could also be better. For example, in the first quarter, we could have more details on how the team meeting and task definition would take place; how the web page would be developed; how NFTs would be created; we could have a better idea of ​​how the interaction with beekeepers would take place and also how the marketing campaign would be developed… In other words, all the actions could be explained at length, so that we have a more solid view of the process and the progress of the phases (however, the way the information is passed we do have a considerable understanding of it, it just wouldn't be ideal). When we think about the budget division, this part is better than the roadmap presentation, because we know how the total amount would be divided into small parts (for example, web development would include both the developer work - who would do the configuration, plugins and graphics), when domain and hosting and maintenance). Even so, some more information could be passed on, for example how much time the professionals involved would dedicate to the project (what is the value of their working hours); how the meetings with beekeepers would take place (whether they would be online or in person, with how many beekeepers, or individual); and mainly the management of the project that alone would cost 3500 dollars monthly (it's a very high amount, so what would the manager's job be like?); why would the promotional video cost 2000 dollars? Although we have several divisions, it would be important for more detail to be provided on some specific parts so that we have a better understanding of the need for such expenditures. Finally, speaking of the team, this part is ok, but like the other topics, some more details could have been provided so that we had a clearer understanding of those involved. We know their names, a small summary of their professional performances and some links are also provided that allow us to see what was said in practice. The issue that concerns me here is that, apparently, none of the professionals have experience with Cardano, in the case of the developer, it is not clear if he has already done work previously in which he developed with our languages ​​(haskell and plutus), or even that Georgios, responsible for marketing, does not seem to have previous experience with blockchain and etc. In this way, these issues could be revised to make the proposal more safely viable.", "q1r": 4, "q2": "As to whether the proposal is auditable or not, I believe the proposers have suggested good ways for us to track progress and success, but I would like to offer some suggestions so that this monitoring can be taken even further. In addition to the suggested partial results, such as “number of registered hives (linked to the number of NFTs sold), products developed (webpage/marketplace, NFT artwork), user engagement on the webpage (through CRM)” and etc, it would be important that we had a way to audit the proposal development process behind this. There are several activities that would lead to these partial successes, as we can see in the script, from initial meetings between the team itself, contacting the beekeepers, carrying out the trips, creating the web space, starting to design the NFTs, until they are ready for commercialization… How could we follow these processes? It would be necessary for the team leader to gather information so that the Cardano community is constantly updated, abreast of situations and how the phases are unfolding. It would be appropriate for a monthly report to be made available, since the project is quite complex and involves many different activities, that is, all information must be gathered and summarized in a simple way, so that we can follow each step. In total it would be 9 months into the project, so estimating 9 progress reports would be ideal in my view. Talking about the end results, I believe the most accurate KPI this project could achieve would be “increase the number of integrations that unite existing solutions for a more integrated and connected experience across different products” (challenge description). How could we be sure that the sponsorship of the hives, the generation and commercialization of the NFTs and the creation of the web page not only addressed the problem at hand, of greater protection of the bees, but also actually helped the Cardano ecosystem to become more popular? The KPIs suggested by the proponents are very good because they think about these two sides: from bees (sell the first collection of NFT, have a sustainable number of populated hives and integration of beekeepers from different countries) and from Cardano (increase cardano users and increase the adoption of cardano by all parties involved in beekeeping (beekeepers, NFT buyers, etc.) So I think the only thing that would be pending here would be precisely that these data become more tangible for our community. carry out studies and research aimed at understanding who these new members of the community, brought by the project, would be, and also how they relate to our ecosystem. That said, in my view we have great material to be worked on, the proposal is very auditable, just a few tweaks would be beneficial.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 4, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "FALSE INFORMATION RPOVIDED IN THE ASSESSMENT. Inconsistencies of the PAs assessments \"the management of the project that alone would cost 3500 dollars monthly (it's a very high amount, so what would the manager's job be like?); THE MANAGEMENT COSTS 3500 FOR 9 MONTHS.  THIS IS MISLEADING INFORMATION.  FURTHERMORE, MANAGEMENT COSTS AS PER EU MANAGEMENT SERVICES AND EU MANAGEMENT PROJECTS IS 53000 MINIMUM PER YEAR.  PA: \"why would the promotional video cost 2000 dollars?\" Almost the whole Cardano Community is using the same producer and the costs given by tis same producer are 2000 and 4000 per video.  The producer is also a co-proposer and well known to the Community."}, {"id": 13992, "q0": "Nobody can deny the role of honey in our daily life and cuisine. However, this becomes a danger to the honeybees since the demand for honey has been increasing day by day. This proposal aims to create a special NFT collection for the honeybees only and sell it to environmental conservationists and people who yearn to use the collection to inspire the protection of honeybees and their hive activities. This is a quite meaningful proposal, definitely. The NFT will link all the relevant information about the geography of each hive, number of hives, and honey production in detail and all information is stored permanently, of course. Because NFT is on Cardano blockchain and the integration of NFT with the hive protection, the benefits will not only be commercial economy but also number of concerning people toward this problem and be attracted to Cardano. Thereby increasing the popularity of Cardano blockchain.", "q0r": 5, "q1": "In the feasibility, to begin with, the roadmap and plan in description are evaluated by me that are quite specific when there is the division for each stage in the 9-month duration. All the information is presented chronologically and the budget costs for each of them are provided quite clearly and reasonably. It assists supporters to follow the plan's progress smoothly and also gain on reliability for a more acceptable percentage. A plus point here is that they explain how to calculate those numbers of costs. However, I’m still confused about there are some potential risks in this proposal. How can the proposer ensure that the in-time information will be delivered for the buyer and updated on blockchain remotely in case there is a change in number of hives, or the problem related to those honeybees’ health? Maybe it seems impossible but if the buyers do not care much about this problem as much as at the beginning, what will be the marketing strategy at this stage and is there any back-up plan if the amount of supporter’s declines? Anyway, the specific description about the team’s members and attached with their CV, information is another plus point and it can create a strongly persuasive effect for more support from people in the Cardano community, as my viewpoint.", "q1r": 4, "q2": "The auditability of this proposal is at an awesome level. There is a description about what the proposer defines the success and how they can definitely gain on it definitely. The proposer also provided the relevance criterions for people who are avid about this topic to keep track of the proposal easily and directly. There is a little recommendation that visualizing the target number for those setting goals would give us a more obvious imagination about how large the proposal is and the expectation of the team toward this proposal’s success.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA we appreciate the time taken to assess our proposal.  Your concerns have been taken into account.  Regarding the in-time information we are hoping for more humane ways of communication between buyer and beekeeper - a small video of the hive, how much honey it produced, its location - and all provided through communication channels such as twitter, discord etc. which are easy for beekeepers to use and don't take a lot of their time. It is part of the marketing to keep the buyer happy hoping that they may bring more buyers in.  At this point, I am not in the position to say if it is feasible to update info on blockchain as you suggest.  This is something that needs to investigated further and we will look into it in good time."}, {"id": 13921, "q0": "This project fits perfectly with this challenge, it covers a wide range, MARKETPLACE is one of them, this project is about NFT MARKETPLACE, helping to increase and maintain honey bee colonies, each NFT is a proof of the work of the bees, protecting the honey bee ecosystem. In recent years, the bee ecosystem is really decreasing due to climate change and ecological changes, I believe it is something that the CARDANO community would be very happy to see if there is something that can maintain the ecosystem working properly, I think this idea is very creative and will have a positive impact on the CARDANO ecosystem and will make CARDANO more diverse, would love to see more similar environmental projects!", "q0r": 5, "q1": "Based on the team's past experience working on social welfare-related topics, including technology, nature and neuroscience, I believe she and the team will be able to complete this project successfully. I think the reason for the success of this team is that they clearly enumerated all the elements and goals of the project. At the same time, they promote the use of CARDANO and its holders, while maintaining the work of beekeepers.\nBy combining beekeeping and blockchain, and then making and selling NFT to help Cardano beekeepers maintain their colonies and protect the bees, by creating proof of the bees' work on the blockchain, I think the adoption of beehives is very innovative and I am very supportive of this kind of practical action from the artists. I think they will be successful in the implementation.", "q1r": 4, "q2": "The progress of this project to be audited can be determined for the number of beekeepers onboarded (number of new wallet registrations), number of hives registered (in relation to the number of NFTs sold), products developed (web/marketplace, NFT art), user engagement on the web (via CRM), web traffic analysis and reporting (via CRM,) number of NFTs sold (visible from the marketplace) and total revenue from NFT sales (ADA in the beekeeper's wallet), so the assessability is high and the information they provided is sufficient to audit the progress and the success of the proposal.\n\n", "q2r": 5, "assessor": "z_assessor_3848", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "Dear PA we appreciate the time spent and support to our project"}, {"id": 12046, "q0": "The proposal specifies very clearly the problem of the honey bees extinction as well as the ways that can increase awareness of the problem which definitely needs to be solved. This proposal indicates exactly the procedure to expand cardano community with a non stop continuation.  It will show the way to integrate real life situations with blockchain technology, and increase onboarding. The proposal meets the KPI's addressed in the challenge. This proposal can open the way for more proposals concerning the balance of ecosystems. ", "q0r": 5, "q1": "The proposer already did his research of what it will take to make it happen. The people of the team have the evidence, as well as the skills and experience needed to bring this proposal into success. The team has a detailed plan and strategy that it will continue even after the project is completed. And although there are a few risks mentioned, they are passionate to succeed. They are determined to increasing awareness on the bee problem caused by humans and to gaining trust of the beekeepers for Cardano family.  The team is already working on their plan and acting for the awareness of Cardano ecosystem and Catalyst Community. The budget breakdown provided is clear. The amounts shown are studied very well by the team and they meet the reality. The overall budget is reasonable to achieve the set goal. The team has a schedule of certain actions to be taken that shows how they will get this done. The time is enough to achieve the milestones. The proposal includes the technical aspects and tools are going to be used for the implementation.", "q1r": 5, "q2": "This proposal provides a roadmap with milestones and KPI's to track the project's progress and success. The team provides a list of what will be measured and how (KPI's). A list of their final goals and success is also provided. Community can track the progress of this project through sales and registrations. ", "q2r": 5, "assessor": "z_assessor_3338", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Dear PA we appreciate the time taken to assess our proposal."}, {"id": 11983, "q0": "This is a problem that all of us need to consider and support the proposal.  It is well known that we gradually destroying our environment.  The proposers addressed this problem and specifically they stress that without the honeybees our world will gradually collapse.  They also stress that we take advantage of the honeybees work but we never acknowledged their work and offerings to humans.  The solution they offer is very simple.  Develop a marketplace with NFTs that will support the beekeepers in order to continue their work.  The link of NFT on blockchain will represent the work that honeybees constantly perform to keep the environment alive.   In regards to the KPIs, the proposers are bringing onboard a number of beekeepers, as well as members of he implementation team.  Additionally, using blockchain and development also adheres to the challenge's KPIs.  The proposal will definitely have a positive impact on Cardano ecosystem as it will increase the number of users, users will use cardano in their transactions to buy NFTs, and most of all Cardano will be acknowledged for the support provided to save the environment.", "q0r": 5, "q1": "The proposers have written an easy to read proposal.  Everything is explained clearly.  The team is well qualified to implement the project. It's good to see people in different professions been sensitive about the environment and for the good of humanity.  The timeline and roadmap have been clearly stated in a step by step way.  They pointed out that tasks will begin co-currently within the first three months an that tasks such as beekeeper onboarding and NFT art work are already in process. The budget is enough to implement the tasks.  They have also added a small amount referring to hidden costs.  This is quite clever I must say because indeed and we implement a project there are times that unexpected expenses come up.  The project team seems really ready to complete the project.  Reading the proposal I got the feeling that \"they are powerful with their engines ready to go\".  The proposers have identified certain risks which in my opinion are mostly related to how each individual perceives the importance of environment in our lives.  I believe that we should always perceive environmental issues important.  ", "q1r": 5, "q2": "All information regarding, budget, timeline, roadmap, progress of implementation have been laid out i detail and one can easily understand what the proposers want to implement.  The project is feasible and measurable with specific deliverables.  With no reservation I truly support this proposal not just because I am sensitive about the environment, but I believe that it will give a strong boost to Cardano outside its community.  The fact that Cardano shows a different face than the \"crypto\", \"blockchain\" etc., show to the world the potential of the Cardano Community and how far it can go.  ", "q2r": 5, "assessor": "z_assessor_3325", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA your comments are encouraging.  Thank you for the support."}, {"id": 11970, "q0": "Climate change and human activities are heavily impacting the lives of many species in nature, including honey bees. This proposal aims to create 25 NFTs of honey bee art on the Cardano platform and sell them on the market. Information about a honeycomb's location, progress, bile production, etc., will be integrated into this artistic NFT. Proceeds will be used to support beekeepers. The success of this proposal will help the community better understand the value that honey bees bring to take action to help increase and maintain honey bee populations. In addition, beekeepers are also more interested in the community, and they can keep their jobs. This process also expands the commercial use of Cardano, increasing the number of ADA holders. I like this recommendation and rate it as the perfect fit for the “Dapps, Products & Integrations” challenge.", "q0r": 5, "q1": "The proposal team members are all members with experience in project management and coordination, marketing, web development, and a freelance artist with expertise in sustainability, modeling- and evaluation systems. I find that the feasibility of this proposal is very high. The proposed implementation time is nine months and is divided into three primary implementation timelines. The proposal team has prepared an excellent budget statement; therefore, I fully agree that the plan for this proposal is highly viable.", "q1r": 5, "q2": "The proposal team explains the metrics in detail so that progress can be tracked and the ability to measure them. Metrics like the number of beekeepers involved, the number of registered hives, the number of NFTs sold, etc., are listed, and the community can use them to gauge the success of topic publishing. The actual risk management section is described in detail, and the proposed team is capable of overcoming them. I fully agree that the information provided is sufficient to assess the progress and success of this proposal.", "q2r": 5, "assessor": "z_assessor_3321", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "Dear PA the whole team appreciates your time and support for the project."}, {"id": 11921, "q0": "The proposal has an out-of-the-box target of approach, by targeting to develop a NFT marketplace and its art collection would be a real beehive. The profit from these art will then be spent back on the beekeepers, enabling them to sustain the farm. Kudos to the uniqueness of the idea. Along with the creativity, the proposers has also outlined the upcoming risk with their development, revolves not only on the code-development segment yet also the beekeepers, legal, and even beekeeping risks, yet all are mitigated and explained decently.\n\nThe impact they will deliver is something extraordinary too, creating opportunities for the beekeepers to enter the market of technology, while also giving them new horizon of knowledge in technology and Cardano, as Cardano sustain their beehives from the NFT selling. An interesting loop indeed.", "q0r": 5, "q1": "3 months gap in 9 months run plan has been explained thoroughly with each specific action items on each period. \n\nThe budgeting has also done very well, mentioning every aspect in details, including the breakdown on campaign, onboarding, different segment of development, etc.\n\nThe proposers experiences, background, and contact very clearly too, including some of their CV are attached.", "q1r": 5, "q2": "Metric of KPIs and success measurement are articulated very well. This might be improved by defining countable number on each of the KPIs, such as the ‘n’ number of beehives registered, the ‘number’ of total gains from NFT sales, and etc. Overall, every points in the proposal auditability completely logical and monitorable, as they will also share monthly reports on the program containing the reports of the defined KPIs.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Dear PA we appreciate your support to the project.  As you comment: \"n’ number of beehives registered, the ‘number’ of total gains from NFT sales, and etc\", the totals will be given as per timeline and deliverables.  In regards to the number of beehives registered within the 9 months we have set a minimum goal of 25 hives corresponding to 25 art work = 25 NFTs.  We hope for more but successful completion of the project is our priority."}, {"id": 9449, "q0": "The project offers an innovative solution on how to better sustain beehives and beekeepers thus increasing the bee families and creating sustainability for beekeepers. It promises an answer to a challenge to secure sustainability of honeybees communities and beekeepers' profession as well as increase honeybee population.\nThe project creates an environment to attract and onboard new categories of users in the Cardano community – Cardano Beekeepers.\n \nThe applicant has identified six risks for the implementation of the project - Instability of the bee population;  Reaching the location of beehive populations (mileage and/or traveling costs); Beekeepers to be reluctant to the idea of blockchain; NFT buyers to be reluctant to spend Cardano for the bee population; Critics to the implementation team for getting involved in an area outside their expertise; Implementing the project without other stakeholders involved. The team proposes concrete measures to overcome them in case of manifestation.", "q0r": 4, "q1": "The timeline described is understandable without many details. The proposal will be stronger if there are clear measurable activities set, like number or frequency of Team meet-ups; Number of frequency of meetings with beekeepers; target number of beehive locations to be visited and beehives to be “on boarded”; targets for the Social Media campaign.\n \nBudget is detailed and specific. For some elements might be provided a harder proof of relevancy of the costs. For example:\n- Campaign $5630 – what are the targets and campaign metrics of the Digital Marketer; what are the number of articles and blog posts for Content writer; Duration of the video and the production cost details.\n- Project Manager $3500 – what are the tasks and workload (hourly, daily) to the project manager and how the cost is calculated.\n \nThe team members professional experience and expertise are connected and relevant to the project aims and objectives.", "q1r": 3, "q2": "The KPI identified are relevant to the proposal. What is missing are the measurable targets that can provide proof for achieving the project results – HOW MANY of the following are expected to be reached with this project funding (number of new wallet registrations, number of NFTs sold, Users engaged on web page etc.).\n \nIt is also not described how the project results will be announced and reported to the community and how the team will make the project transparent and visible for the wide audience.", "q2r": 3, "assessor": "z_assessor_3061", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Reasons for flagging the proposal: Feasibility: PA: \"... if there are clear measurable activities set, like number or frequency of Team meet-ups; Number of frequency of meetings with beekeepers;...\" Proposers: We clearly stated \"as many as needed\".  The PA suggests that we put 5 meetings, for instance, but if more are needed we will not do more just because we wrote 5.  PA:  \"Target number of beehive locations to be visited\" - There is no target number for location, we have to visit as many locations as possible.  We have the 25 beehive target to meet even if we have to visit a hundred locations.  PA: \"...beehives to be on boarded” - it is mentioned that 25 beehives correspond to 25 NFTs.  Each NFT corresponds to a beehive (Found In Impact: Please provide your proposed solution).  In regards to campaign costs, the funds requested are for 9 months constant work.  The total has been doublechecked both within the Catalyst Community and in European union funding bodies.  The budget for the campaign is within reasonable limits.  The cost production of the videos is well known to the Community because the person who will perform the task is already filming for the Community. The project management costs trending in the Community projects are minimum $2000/month.  The project suggests a $388.88 per month and 3500 for 9 months.  The lowest in the European Union is $53000 for 12 months.  These are not tasks to be measured hourly.  It is not up to one person to solely complete a task and control implementation time, others are involved too that have their own pace and obligations (e.g. beekeepers, web developer & marketer cooperating, etc.).  The first measurable targets are in the timeline for months 1-3 and the deliverables, the rest will be reported to the Community according to the CRM tools (Info in Impact).      "}, {"id": 9283, "q0": "This is my first time reading such a unique project. It sounds like two unrelated fields but if you know the benefits of blockchain and apply them, I think the development of the NFT market and the unique collection of NFT art to help increase and maintain the bee population confidentiality is possible. I always agree and hope that projects like this can develop in reality. Because we need to love the environment and the animals around us. Need to do a lot of good and positive things to build things up for the better, specifically here. Honey is very important in life. Your proposal also clearly states why to develop honey on Blockchain and I completely agree. You also presented specific risk challenges. I hope in practice to limit the risk as much as possible. And hopefully the project will be funded to be implemented. I look forward to this project.\n", "q0r": 5, "q1": "After reading the FEASIBILITY section I found that the proponents are not beekeepers and do not have much interaction with beekeeping communities. I think it would be better to cooperate with projects that have both people who are experienced in beekeeping and who are tech-savvy. Since all the team members are new to the Cardano Community in an effort to expand the Cardano family as well as introduce the younger generations to the Cardano world, I think you need to have a high focus on the Cardano community. collaboration with the Catalyst community as well as actual engagement with beekeepers, there is information available to participating beekeepers prior to receiving funding so voters can see the effort and dedication interested, and believes that the project is not just an idea but a real passion project for which the proponents are willing to work hard.", "q1r": 4, "q2": "I agree with your criteria. However, to see the progress of your work, where will you see it? Where will you report it? You guys should add this in the proposal. In addition, you should have a larger long-term goal to promote this project in other areas. Besides, you should also include the progress reporting criteria on the health of the bees because this also shows whether your project is doing well or not.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for assessing our proposal.  We are not flagging the assessment but we feel that there are points that the assessor crossed the line. To your comments we add: \n Feasibility: (a) \"Proponents are not beekeepers\" - we are not beekeepers and we do not need to be beekeepers to write a proposal about bees. Our knowledge and expertise can help beekeepers (b) \"they do not have much interaction with beekeeping communities\". This is a wrongful assumption towards team members. We did not wake up one day and decided to write about the bees (c) \"since all members are new to the Cardano Community...\" Not all members are new to the Community, the PA did not research well.  (d) \"collaboration with the Catalyst community as well as actual engagement with beekeepers\". Again the PA assumes without researching and is wrongfully assuming about the lives of the team members. (e) as stated in the proposal, there are tasks that are already in progress.  The outcome of these tasks will be made public only if the project is funded due to confidentiality reasons.  Not all information can be publicized.  "}, {"id": 7954, "q0": "The proposal intends to identify bee colonies via NFTs on the Cardano blockchain. It's a very good idea in recording the death rate of epidemics and other impacts. This proposal well fit into the  challenge in creating trust among customers through traceability. The connection beekeeper community to the Cardano blockchain will add value to the Cadarno ecosystem. This model could be applied to other zones of agriculture if successfully deployed.\n\nThe risks and challenges are foreseen and explained honestly and tradable. Due to the actually high death rate of the colonies, the purchase of assigned NFTs sponsorship idea is a really good method.\nIn general, this proposal has a high impactful.", "q0r": 5, "q1": "The proposal provided a specific timeline in 9 months and broken down for each milestones for delivering. The plan timeline is reasonable and rational to complete the proposed work but it's better if the proposer provide a web link for the community easily tracking the progress of the project. \nThe budget is broken down for each items with estimated budget, but it would be higher confident if it is broken down into hourly working salary.\nThe proposer identified a 4 suitable experienced members team with famous scientists, working on subjects related to the well being of society including technology, nature and neuroscience, with full reference profile link for identifying.\nOne positive thing of this proposal is the marketing campaign has planned and on going with cleared budget for community broadcasting.\nIn general, I hope this proposal will be deployed and controlled successfully. Good luck.", "q1r": 5, "q2": "About the auditability, the team delivered full measurable KPIs to track project's progress easily. But it'd be more clear if the proposer point out a web link or channel for updating them. \n\nThe definition of success is also a positive point for this proposal, very cleared and independently verified by the community. \nThe only missing thing is a convincing communication strategy with the community that I suggest to provide a point of contact by building a social channel such as: Telegram or Discord for connecting and upating progress to the community.\nIn common, I still highly appreciate the auditability of this proposal.", "q2r": 5, "assessor": "z_assessor_2938", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Dear PA thank you for assessing our proposal. Answering to your suggestion about providing a web link for the Community to track progress: this is in our plans if the project is funded.  The Digital Marketer has suggested many ways to communicate the project not just to the Community but outside the Community too, but I leave it to him to show his expertise when time comes."}, {"id": 5990, "q0": "The idea of ​​the proposal is very good and makes a lot of sense for the environmental impact as well as the honey bee population on Earth. The idea behind the proposal is to create a separate NFT collection of honey bees. This collection is then sold to environmentalists who wish to contribute to the protection of honeybee hives on Earth. Buyers of NFTs will be able to know the geographic location of each hive, the number of hives, and honey production because this information has been incorporated into the NFT from the time of its initial creation and This information is permanently stored on the blockchain. On the side of the seller, they will receive a sum of money from the buyer and will use this money to ensure the sustainability of the honey bee community as well as increase the honey bee population (care for treatment / protection of the hive). This proposal is completely consistent with the criteria set forth by the challenge. Integrating NFT on the Cardano blockchain into honeycomb protection production will result in more on-chain activity. Because the community is well aware of the value that beehives bring to the commercial economy and therefore attracts many people interested to join hands to protect these hives. It also increases the popularity of the Cardano blockchain.", "q0r": 5, "q1": "Considering the feasibility of the project, I think there is a risk that the attraction of people interested in protecting the hive is lost. In case when the hive has a change (such as moving to another location, changing the amount of honey due to not ensuring the health of the bees), how can NFT buyers update the situation? change this remotely on the blockchain? This means that it is at the risk of the NFT buyer not to know if the beekeepers really take good care of the beehives. And what measures has the proposed team taken to solve this problem? This issue in my opinion is an extremely important point to consider whether the project can be implemented successfully or not.\nIn addition, in terms of the project implementation roadmap, I strongly agree with the information that the proposed team provides here. Each job will be completed in what time and the order of execution of the jobs is also arranged scientifically. The budget to implement this project is also listed fully how much it costs for each work item to be done, detailed to each unit price.", "q1r": 4, "q2": "The audit side of the project I rate is very good. The Proposal gives us specifics on how to check the progress of the project. For example, we can measure progress through the number of beekeepers participating, the number of NFTs sold in the market, user interaction on the website. I have a small suggestion that should be specific to each number to take them as KPIs to achieve the goal. The example has introduced the project to more than 5 countries and regions, reaching 1,000 Cardano users on the network.\nThe information check of each member is also listed clearly and in detail, we have references to each person's profile page, we know who they are and how they work.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "Dear PA thank you for the time taken to support the project.  To your comment \"in case the hive has a change\".  One of the proposal's goals is to have beekeepers take an active role in this project by taking responsibility towards the NFT buyer.  This means that the beekeeper that takes care of the hive will inform the buyer of the whereabouts of the hive, whether new population was added, how much honey was produced per season, etc.  This is part of the marketing plan because an NFT buyer who is satisfied from the investment she/he made, may introduce another buyer or even buy another NFT.  Thus, having sustainability.  "}, {"id": 5700, "q0": "This proposal is a very good and interesting idea, the problem raised by the team is very detailed and it is clear that honey bees are declining on a global scale due to human activities without receiving recognition. the economic rewards they deserve . realized the potential of honey bees to make money and keep the ecosystem in balance . The project owner came up with the solution identified , aimed at maintaining and avoiding the extinction of bees this will help to increase and maintain the honey bee population , maintain the jobs of beekeepers , expand the commercial use of Cardano thong , increase Cardano users / owners , ensure sustainable life for all . these can be achieved by creating proof of work of honey bees on the blockchain, how did the team show how to include it on the blockchain? how to try? How about sustainability? What will the campaign include? thereby seeing how the team's results are great for the ecosystem and in line with what's in the challenge. the solution will solve the challenge, the blockchain is very powerful and Cardano has the means to bring anyone who wants to be a part of the ecosystem, including the bees and their holders, generally the team proposes to build on the software. Cardano platform software is more secure thus promoting future blockchain usage. talk about the risks of the proposal proposed by the team and offer solutions to address those potentials such as , unstable bee populations , location of bee populations , beekeepers Without a deep understanding of blockchain, the team proposed to work outside of their expertise, thereby seeing the project inadequacies and how the project owner overcomes them in great detail. I like the idea as well as what the team put forward for the proposal", "q0r": 5, "q1": "The team has determined the time frame to complete the project's work is 9 months, this timeline is very suitable for completing the set work, the team has divided into small working time periods. from 1 to 3 months , 3 to 6 months ,6 to 9 months , the set monthly goals are detailed and specific by the team , so the progress is easily viewed and monitored by the community of the proposal , as of the first 3 months of this period all activities will run concurrently with team meetings to set up task allocation strategy and set progress , web development , beekeeper referrals , site visits Points , marketing and advertising campaigns NFT income . March to June linger on the NFT collection, marketing campaign. June to September disseminating results to the community will be even better when the team breaks down even more in terms of time, but splits up to add an increase in information to capture progress. But for me, the above scenario is fine. talk about the budget with the amount requested by the project owner $23320 that amount is in line with the proposal . I believe it is very simple to understand the expenditures and the value of time used for the proposal as well as the video recordings with detailed budget tables I find very detailed for each section and breakdown The amounts are very public about how much money is spent, what's even better is to see the preparation for the unforeseen cost option (budget budget) that few teams come up with, which I highly recommend for the project. export . Talking about the project team, the project owner has provided information about the members who work and have related experiences, authentic identities, and attached links to individuals and companies. work , I think the feasibility of the proposal is good the team has provided detailed information", "q1r": 5, "q2": "With a description of the project's measurable progress, indicators to measure such as the number of beekeepers participating, the number of registered hives, the product being developed, the user interaction on the website. , the number of NFTs that have sold indices is very detailed and the specifics are easy to check and track . Talking about the success of the project, the team has come up with fairly descriptive results such as, 1 selling the first NFT collection, 2 having a sustainable number of beehives, 3 introducing beekeepers coming from different countries ,4 increasing Cardano users ,5 increasing cardano adoption by all parties involved in beekeeping . Some of the successes mentioned above will give the community confidence worth considering. as this is a new proposal that is not related to any other submissions by the fund so the community will give the most consideration to the project's success and possible funding. good luck on this proposal.", "q2r": 5, "assessor": "z_assessor_2735", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear PA thank you for the trust and support.  May your wishes be heard."}, {"id": 5119, "q0": "The proposal wants to create an NFT marketplace and NFT art collection of a real beehive, in which beekeepers can get a fund to sustain their beehive. The ideas are very unique and tackle a real tangible problem. Overall the proposal is well written and has a thorough plan. Personally, I have confidence in the team and am really curious to see how the project turns out. There are various risks outlined in the proposal, from the instability of the bee population, the adoption of beekeepers, reaching the location of the beehive, etc. However, from each of those risks proposers provide a mitigation plan to overcome it.", "q0r": 5, "q1": "The milestones provided are specific and comprehensible, each divided into three phases, from the first three months to month 9th. Proposers provide a detailed broken down of how they will use the requested budget, from web development to onboarding of beekeepers. The proposal outline detailed information about the background, experience, and previous projects of each core team member. They also provide a link to their previous projects/profile so the community can easily verify their credibility.", "q1r": 5, "q2": "There is a various KPIs used to measure the project progress, from numbers of beekeepers onboarded, user engagement on the webpage, etc. All of them are clearly defined and quantifiable. The success of the project is also clear and valid, however, I suggest adding an exact number that can determine how successful the project is. For example, more than 20 beekeepers on-boarded, beekeepers on board in more than 2 countries, total sales in NFT more than 100 Mio in ADA, etc.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "Dear PA thank you for the time taken to assess our proposal.  In regards to your comment on exact numbers, I inform you that intentionally we have left the number of countries open.  At first we had only one country but people that read the proposal spread the words about the project and we have been contacted by beekeepers from Italy and Greece.  Therefore, we thought it would be unethical to exclude other countries and we left it open. Everyone is welcomed onboard."}, {"id": 4515, "q0": "I am neutral on the impact of this project. This proposal addresses an environmental issue and will help build a real-world solution for Cardano. While I think this is a nice idea to raise awareness regarding the decline of the honeybee population, I am not sure about the impact and scalability. In particular, the proposed target is to sell 25 NFTs for this phase, and I think it is too small to make an impact and create a marketplace. If they increase the number of NFTs, they may lose the \"uniqueness value\", if there is any to start with. I also hope to see more thoughts regarding scalability in the future, for example, how could they reach out to more beekeepers, how could they onboard them, and what about ongoing support and technical education as they grow. Overall, this is a very kind and nice idea, but I would suggest the team think further about the business model to make it sustainable and scalable. \n", "q0r": 3, "q1": "The team seems to be experienced in marketing (website, filming) and artwork. I think they may be stretched though, on the operations, onboarding, and ongoing support as there is only one project manager who assumes would do all the tasks I've just listed. The roadmap looks to find and budget is not out of ordinary, even though the proposer did not specify a target (e.g., the number of beekeepers that they look to onboard), thus making it harder to estimate a Return on Investment (ROI). I would suggest the team treat this phase as a Proof of Concept phase with a lower budget overall - do not need to go full-fledged on marketing, and think further about the business model going forward. Currently, they are suggesting a budget of $23000 for 25 artworks, equivalent to $920 to facilitate one piece of artwork. I figure it is a bit high not being clear on what will happen next, thus a more minimum viable product (MVP) is encouraged.\n", "q1r": 4, "q2": "The team proposes a good roadmap with milestones and a list of metrics to track the project. I would recommend the team to have a long-term vision of the impact (e.g., put a number for each of the metrics) and break it down to each phase to deliver a better sense of auditability. This is a very unique idea and I hope the community will support it, but we will only know how sustainable such support is after the MVP version, otherwise, some other ideas would be called for to achieve the long-term vision.\n", "q2r": 4, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the support."}, {"id": 2739, "q0": "\"The idea that offers a convincing solution and meets the requirements of this challenge is: to create an e-commerce marketplace for the bee colonies of their beekeepers, by encoding each swarm into NFT form and content. in it will be videos about how it works, and the process of protecting the bees to increase the number of bees,\n  The ways to bring bees to Cardano are generally Blockchain. It is proposed by the team to clearly state clearly how it works and the details of the conditions, in order to be able to participate in bringing the beekeeper's colony to the Cardano ecosystem in the form of NFT. However, in the advertising and marketing section, in my opinion, the proposed group should have statements for the initial target group who will be the first to own the bee colonies, here the group only mentions the farmers. Bees in Cyprus, Greece and Italy have only just stopped in their interest in the project, so where should the target audience be expanded for marketing to more effectively network these interests.\n  One more small comment to the proposed team is: it will be necessary for the evidence to support this claim of the proposed group: \"\"Honey bees are responsible for making $30 billion a year for crops and keeping \"Balanced Ecosystem\"\n  * the proposal brings a very good idea to nature conservation and also affects the self-consciousness of protecting bee colonies to let everyone know about this proposal,\n   most of the possible risks are seen by the proposed team and there are measures to optimize those risks, if the team has presented the two contents I suggested above in this presentation, then surely Sure you will have my 5 points but unfortunately can only give the group 4 points because they have not met those criteria. \"", "q0r": 4, "q1": "\"I have no opinion with the presentation of the proposed team about the time to implement the project and the steps are reasonable, at the same time the budget and team information are also presented in detail. transparent details, team information and links to each member's social platforms, as well as assigning specific work to each member, however I have two questions to send to the proposed team. specifically explained for:\n  * Firstly, what is the business strategy that the team proposes to support the owners of bee colonies, for example: determining the user's needs, who will want to own the swarms? bee is encoded into NFT, which is essential for the identification of these targets.\n    second with this model of the proposal, does the team intend for the issuance of tokens (token) for this proposal,\n I hope the group proposes to collect these comments from me. thank you \"", "q1r": 4, "q2": "“The activities of this proposal will largely operate outside of our on-chain world, and they are primarily marketing and commercial so the proposal needs statements that support the monitoring and verifying the metrics that the proposed team has provided, for example: weekly or monthly reports on social media platforms or all activities to be updated on the website, or communication channel of the proposal group, if so, the proposal can receive the highest rating from the evaluation community,\n   success is also clearly defined by the proposed team, and the scale of the proposal is raised.\"", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 5, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 2714, "q0": "This proposal and its well-thought-out plan for tackling the decreasing number of beehives in circulation is interesting and also admirable. I believe this proposal addresses the challenge for this reason. \n\nDwindling honeybee hives is a hot topic in many areas of the world right now. I have listened to many conversations about this at local farmer's markets and farms I deliver to in my personal field of work. Considering the popularity of this topic, I do not think the team will have issues finding people willing to buy the NFT, which in turn will make this successful. I believe incorporating NFTs to fund the beekeepers is a great method to raise funds, considering there are other environmental NFT projects on Cardano doing the same. \n", "q0r": 5, "q1": "Onboarding new and old beekeepers using an existing registry will add a great layer of success since the proposer will not have to go looking for random beekeepers to participate. The proposal highlights that there is current interest from the beekeeper community and that a good portion is looking to partake in this venture. I see no issue with the plan presented. I believe the project will be successfully implemented based on what the project is using to measure its progress. Considering the roadmap highlights that they are already creating the NFT art and discussing this project with current Beekeepers. The only thing I could see being more helpful is posting the progress of this on social media, prior to the close of this fund. ", "q1r": 4, "q2": "The project plans on utilizing multiple forms of media to show proof and market this project. A detailed timeline breaks down the steps being taken to market this proposal prior to the voting round. I believe the information is sufficient enough to audit as long as the proposal is updated with the project's social media and links to accounts that could be used for the average voter to track its progress. Currently, the project is in its infancy and little is auditable at the moment.", "q2r": 3, "assessor": "z_assessor_2348", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Dear PA to your comment \"posting the progress of this on social media, prior to the close of this fund.\", as stated in the proposal social media are part of the campaign.  The campaign already began with our first video posted in the Community and on Vimeo, but regardless, it is also stated in the 1-3 months timeline.   "}, {"id": 14481, "q0": "This concept aims to grow and preserve the honeybee population by using blockchain to distribute knowledge about how honeybees work. Currently, there aren't many initiatives that concentrate on raising public awareness and information about particular creatures, therefore this proposal has a highly distinctive viewpoint and goal that absolutely briefly addresses the topic. As a result, they came up with the concept of employing blockchain technology to make the honeybees' labor profitable with the ultimate goal of growing Cardano's commercial use and ensuring sustainability. This demonstrates that their approach closely aligns with the challenge's goal and benefits the Cardano ecosystem. Other experts and small enterprises can join Cardano's family by offering cutting-edge services on the blockchain by putting the bees labor on the blockchain. The plan calls for exploiting NFTs' characteristics to drive the blockchain. The proposers name a significant issue and propose a solution utilizing the ecosystem's built-in building blocks. It is made quite obvious how this will help the Cardano ecosystem in general and its consumers in particular. Metrics are in line with the challenge settings and are quite clear. I fully agree that this proposal successfully addresses the problem.\n", "q0r": 5, "q1": "The proposal includes a great summary of the team's qualifications and expertise, along with links to resources that can verify them. The proposal's level of information gives the community an understanding of the procedures involved in implementation. Throughout the project's nine-month duration, they offer a clear action plan. We can clearly see that the proposers' listing of all the activities for each phase and who is responsible for them is a positive development. The community will benefit from being able to track the project and quickly identify who is responsible for any issues. Each feasible section's costs are stated in detail and are based on the section's action and development plan. The community may track and evaluate the success of their spending with the help of this budget breakdown, which is also reasonable in view of the planned objectives. The team outlines a whole section that details the risks that are involved as well as the steps taken to mitigate them.", "q1r": 5, "q2": "Three significant milestones have been identified, each with a brief description, so that the community is aware of both what will happen and when it will happen. The success measures are analyzed, and once again, a great job is done, as the metrics are linked to milestones over time. it offers the required information to understand the immediate activities following the allocation of funds as well as an overview of the 9 month plan. The proposal's lack of key performance indicators, which would have been useful, is the only drawback. Consequently, the information provided is adequate to audit the proposal's progress and success.", "q2r": 4, "assessor": "z_assessor_4060", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "We appreciate your support to the project, thank you for the time taken to assess our proposal."}, {"id": 14711, "q0": "\"Honeybees contribute greatly to the ecosystem and has great economic importance since they produce honey. However, extensive human activities are detrimental to bees and bees are facing the risks of extinction. To deal with this problem, the idea to monetize the honeybees’ work is a bright idea, covering from protecting the sustainability aspects of honeybees and beekeepers, and boosting users to the Cardano ecosystem. \nI like the idea of selling NFTs of bees’ artworks to the community and the ADA obtained will be returned to the beekeepers, motivating the beekeepers to continue taking care the hives. This model opens up the opportunities for small businesses e.g., beekeepers to join the Cardano ecosystem. Thus, this problem and solution perfectly aligned with the challenge setting. \nIn terms of the risks, the proposers have excellent risk managements: most of the major risks was thought of, and the solutions to encounter for each risk were also addressed. I firmly agree with the solutions proposed here. \"", "q0r": 5, "q1": "\"The project was divided into three main phases, and the proposers have attached the smaller task processes to each phase. In my opinion, just merely listing the sub-tasks was not enough. It could be better if the proposers attached the due date for each sub-task, and a clear execution protocol for each sub-task. For example, in the first phase (month 1-3), for the task (b), the deadline is set: finished after the first month. The development of webpage method could be described as what coding language used, who will do it (the developer from the team, or freelancers?).\nIn terms of the budget breakdown, the proposers calculated the costs needed quite carefully. The proposers also gave explanations for the costs needed (for example the salary per hour in each job position, the petrol price when calculating the travel costs, etc.). In my opinion, this calculation is good, and help to increase the credibility of the project. \nIn terms of the human resources, even though most of the members are newcomers to the Cardano community, they are all experienced people in their own fields (for example developing or digital marketing) indicating that this project could be feasible.\"", "q1r": 4, "q2": "Because the project was related to the sustainable development, the SDG Rating was used here. The KPIs/metrics and measurement methods were well-addressed, and I think these metrics were sufficient for project launching. However, to improve the auditability of this project, the proposers should provide the target KPIs/metrics in a time length. For example, after three months of project launching, there are 5000 beekeepers onboard to the project. This clarification will help the community to audit this project.", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Dear PA we appreciate the time taken to assess our proposal."}], "solution": "Develop an NFT marketplace and unique NFT art collection to help increase and sustain honeybee population. Each NFT address is the proof of honeybees' work.\nhttps://player.vimeo.com/video/718752105  ", "experience": "Dr. Margarita Mouza has been working on subjects related to the well being of society including technology, nature and neuroscience. She is a teacher, proposal writer and managed a number of projects funded by EU and UNOPS/UNHR until today."}