{"id": 414056, "author": "bgordon", "title": "NFT Farming on Cardano with Tangent", "url": "https://cardano.ideascale.com/a/dtd/414056-48088", "category": 26595, "amount": 74000, "description": "Non-Fungible Tokens (NFTs) need more utility to drive long term engagement. As of yet there is no leading platform on Cardano that allows for NFTs to be staked and farmed in DeFi smart contracts.", "f6_no_assessments": 13, "f6_rating": 4.384615384615385, "videos": [], "media": [], "f6_assessments": [{"id": 1591, "q0": "I believe that the proposal is well aligned with the objectives of the challenge. Here, we are looking to fund projects that somehow benefit and help boost the Cardano blockchain through the development of Dapps and applications, and one of the use cases would be marketplaces. In this case, the objective here would be to create a platform where NFT owners and developers can stake their active tokens on ergonomic and pleasant interfaces, according to the author. This, necessarily, is a marketplace and that would be using our blockchain technology to boost the practice of minting, selling and exchanging NFTs, something that is already strong within the cryptographic community. At least, in my understanding, this makes a lot of sense with what we are specifically looking for in the challenge, being able at the same time to engage those who already have CNFTs, for example, by developing a more attractive space dedicated to this activity; and at the same time it can attract new users interested in the subject to the Cardano Ecosystem. I thought it was quite smart of the authors to use a statement by Charles Hoskison himself to argue the need for such a project, in which he says that there are still no great interfaces related to NFT. In my view, the project would also attract users as it would not only be aimed at displaying NFTs, but also staking and DaaS processes. Another positive point in relation to the impact of the project is that the authors define very well what sets this proposal apart from other similar ideas, classifying the space they want to create as “operative art”. From my understanding, they are quite aware of the traditional use of NFTs, not disregarding it, but also adding it to other applications that can generate profit for users and move this market. I believe that currently most people, especially those who are not active in the cryptographic world, do not understand all the possibilities and activities that surround the universe of NFTs, so it is interesting that the funded projects go beyond the traditional in this regard, contributing to diversification and expanding the knowledge of the masses in relation to the subject. In addition to such positive points mentioned, another relevant observation is that the authors demonstrate a solid awareness of the possible difficulties encountered during the development of the project, and how they can be mitigated. Therefore, I believe it is a high-value proposition that fits well with what is being pursued in the present challenge, deserving the highest mark in terms of impact.\n", "q0r": 5, "q1": "The roadmap of the proposal is in gitbook, it is very organized, dividing some phases, what would be done in each one of them (subdivisions) and the status (whether it was completed or not). It's a satisfying way of presenting what will be done and in what order, but this aspect of the proposal could be a little more fleshed out in my opinion. From gitbook we know which phases would be needed (phase 1, phase 2 and so on). In the ideascale breakdown, this timeline is divided into quarters, which makes the visualization less clear. My difficulty was, a little, to associate which phase would correspond to which quarter. It would also be interesting if the activities cited in each quarter were divided into months, so we would have an even more detailed view of the process. However, I think that this part of the proposal is good, it just needs some clarification to make it ideal. The schedule provided in the gitbook is also very important for us to audit the proposal, as I will comment in more detail in the topic below. When it comes to the financial issue, I think more detail would be needed here. The asking value is high, 125k dollars. It makes sense given the complexity of the project. Some parts are split, but could be better unraveled. For example in marketing, we know that 15k would be earmarked for this, but why? How would this budget share be used? Who would be the professionals involved here, what activities would they do in favor of publicizing this project? How would they reach the target audience, through which platforms, etc.? Another example: in auditing the staking code, 20k dollars are requested. Perhaps the value is understandable for people who know better the task performed here, but for the general public, an explanation of why this type of audit would cost this amount would be interesting, since it is a very technical/specialized activity. Finally, speaking of the team, I think their presentation is great. Although there is only the name and role of each professional on the team on ideascale, the proponents provide a link to a website where we can see the photo, a more detailed explanation about each of those involved, including a small resume, and also the contact directly from each. My only suggestion here would be that they clarify better if any (or some) of these people already have experience and contact with our blockchain and its technologies, this is not so clear to me. However, this does not compromise the trust that the team conveys, it would just be a bonus for us to understand better if they already have some involvement with Cardano. Therefore, I think that this proposal is quite viable, requiring only some deepening in the commented parts.", "q1r": 5, "q2": "I believe the proposal can be audited satisfactorily, but like the previous topic, I would like to suggest minor improvements. Talking about the final product first, the proponents focus on success entirely with the launch and evolution of the product, which is fine, but I think they could also pay more careful attention to how this is all going to impact Cardano. We know about the general and specific objectives of the project, but how can this be measured qualitatively and quantitatively, how can such impacts be reflected and proven on our blockchain? How can we be sure that yes, new users were attracted to Cardano and stayed active, helping to nurture our community? I think it would be worth a more direct study in relation to these aspects, some time after the launch of the platform. Regarding the monitoring of the process itself, the proponents provide us with a series of safe ways in which we can, in case of successful financing, follow the development of the steps. Starting with the gitbook timeline and the explanation of the proposal breakdown roadmap. It becomes auditable because we know what is predicted to happen and when. Additionally, the proponents promise to provide weekly community updates on social media (it would be interesting to know which ones); also the publication of reports every two months; and finally, they claim that they will have an active participation in community events, such as the Town Hall, especially in the after-main meeting rooms. That is, they outline several ways in which the public could keep in touch with the development and partial results of the project, being my only observation really about the direct impact of all this on the growth of our blockchain. It would be very positive if there was a final survey that collected data directly related to the specific objectives of the challenge, if, in the end, the success metrics that were mentioned in the challenge summary were achieved, and it is necessary that these data are verifiable. So a suggestion would be to carry out this study and present the results obtained in a community communication channel, a practical example would be during a Townhall or even in a breakout room after the main meetings, which may be posted on youtube, so that it stays accessible to all community members. However, I still believe that this topic deserves the maximum grade, because of the wealth of details.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 9, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 6638, "q0": "The value proposition behind this proposal is very straight forward - building a platform that enables NFT staking and farming, in other words a place where NFT owners can derive economic rents from otherwise less liquid tokens that under normal circumstances they would not be willing to sell, but would be happy to use them in decentralized applications if this can lead to a certain annual yield. \n\nThe subject of NFTs is definitely a polarizing one within crypto enthousiast communities, and the technology gets its fair share of both love and hate. To add an additional layer of complexity, the subject of NFT yield farming is definitely one step further in this direction so there will definitely be many distinct views on whether this proposal is beneficial or not for Cardano. But from an ecosystem perspective, there are no downsides to building such a platform, on the contrary. After doing a bit of research, I was unable to find any meaningful competition within the Cardano ecosystem, and only a few other similar dapps across other ecosystems. If you look at things from this perspective, having a low competition and being amongst the first to capitalize on the NFT segment can be a great business move, and I believe the proposal definitely has a strong merit attached to it in terms of advancing the Cardano ecosystem. The future of NFTs is widely unknown, but if the technology adoption picks up and real use cases emerge, having a yield generating solution on chain is an excellent strategic choice for Cardano.", "q0r": 5, "q1": "The proposers have done an excellent job at describing the roadmap of the entire project. The work is already underway, and it seems that with or without this Catalyst funding, the wheels have already been set in motion. Another important point is to recognize that the team starts from a very humble position and they have already split the work (and funding) into an F9 and an F10 project, they are therefore not biting more than they can chew, and they are very pragmatic in their choices. \n\nThe team behind the proposal also seem to be very well positioned to deliver on such a project. They have extensive bios presented in the relevant section, and it would take a significant amount of time for anybody wishing to go through their entire list of past projects, gitbook libraries and general background checks. They have already built similar platforms across other distributed chains in the past years, with many examples showcased within the proposal: Citrus, NFTchain, Chainport or Hord, to name only a few of them. The technical team is also complemented by a compliance advisor who can most likely keep them out of trouble, and they also have on boarded a digital artist, which is again a good news since a few pieces of art developed in-house are always a good start-up point when launching such a product.  \n\nThe team has also set aside a significant portion of the budget for a third party audit, and this is a very good tactical decision. Let me explain why, while offering a bit of context. In case you don’t know, IOG has recently released a video outlining the future of Cardano dapps, especially offering details regarding how their security would influence the way in which the dapps will be displayed on the upcoming dapp store. This highlights Cardano’s increased focus towards greater security, and the fact that this proposal sets aside a very significant portion of the budget for a third party certification is definitely an advantage over other dapps which will soon have to compete for “prime space” within a dapps marketplace where being certified will matter a great deal. \n\nI perceive the budget as a rather weak spot of the proposal (but not enough to subtract a star), and let me tell you why. From the overall budget of 75k USD, 30k goes into, and I quote, “Staking Contract Development, internal and external”. For such a big caption of the entire budget, and considering the novelty of the entire business model, I would have expected much more details regarding this staking (smart?) contract development, an estimation of hours involved and hourly rates for the developers. ", "q1r": 5, "q2": "The team behind the proposal is well positioned to keep the Cardano community informed. They already have Telegram / Discord / Medium / Twitter own channels, and they have pledged within the proposal to offer non-tech updates via these mediums, while the tech updates would come via bi-monthly reports.\n\nAn interesting aspect is that while reading this section, you can actually feel their excitement when explaining that they have recently discovered the Cardano ecosystem, and there is a great amount of energy in their explanations on how they intend to attend as many town halls as possible and have a few break-out rooms to better connect with the enthousiast. I have never seen so much energy into the auditability section, and I’ve done quite a few assessments so far. \n\nThey are also doing a very good job at defining what success looks like for the project. Success will mean having a live product in 2023, the successful sale of their artwork and a fully functional Defi-as-a-service platform for digital artists. \n\nI do have to subtract a point for auditability, and this is because given the nature of the project (higher than average risks), I would have expected more explanatory materials that go into the detail of how NFT staking works, you know, the nitty gritty details: where does the yield come from? What are the risks of staking? What are the liquidity constraints of such a service? Which NFTs can be staked, and which cannot? If yields will differ, does the additional yield stem from an (unknown) additional risk? To their defense, they do have a few docs explaining a bit the entire process, but in my opinion, the level of detail needs to be greatly improved in order for the community to truly understand the business model. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1499, "q0": "The market for buying and selling non-fungible tokens (NFTs) on the Cardano ecosystem is expanding rapidly, and the transaction fees are not excessively high in comparison to those of other ecosystems. And when investors own NFT, they simply buy and sell or hold that NFT, keep it in their wallet, or put it up for sale on the exchange. Even with DEXs, there is no web application or decentralized application (Dapp) that can support farming for non-fungible tokens. It is therefore very interesting to have a platform that can farm NFT because it eliminates the risk of buying and selling for speculators and the waste of that NFT that occurs when the NFT is kept in the wallet. Do not use it. The team is developing a farmable platform that will allow users to bet multiple NFTs on a beautiful interface while simultaneously generating external rewards for each user. This is something that I personally am very much looking forward to and that excites me. With the completion of this project without any problems.\n\nBecause of the dangers posed by the group, I wholeheartedly support the concept of drawing on the resources of the community in order to be able to develop effectively and make up for any deficiencies that arise during the course of project implementation. I give this impact a score of 5 points.", "q0r": 5, "q1": "Regarding the roadmap and whitepaper that the group cited and stated in the proposal, I found them to be quite detailed with the work for each quarter ever since the project was funded. With a roadmap of 15 months, which is equivalent to 5 quarters, and work for each precious, I found it to be rather informative. In regard to the operational budget of the group, I believe that it is not yet detailed enough; the group needs to state each item, along with the equivalent number of working hours and the amount for each working hour. With the platform having such a significant influence on the Cardano community, it has been determined that the cost of $125,000 to develop the platform is reasonable. It is believed that the eight-person team that possesses the necessary skills and knowledge to successfully construct and develop the project will be able to do so on time. And I have a question about something that I can't find on https://tangent.art/team/, which is the description for Henry (Kwrtz Artist) or Bohemian Artist. I believe that you ought to add all of the members to the website in order to provide the community with a deeper and more comprehensive understanding of the team. I believe it is reasonable to be able to go through the 15-month roadmap, needing a large and sufficient fund to develop the project. The group also mentioned asking for funding for the next fund. I think it is reasonable to be able to go through the roadmap. I give the feasibility section a score of four points.", "q1r": 4, "q2": "In order to audit and evaluate the success of the project, I believe that the team should include key performance indicators (KPIs), and all progress should be posted on the project's website or on Github. It is essential that the community be able to keep track of all of the project's development roadmap if they are to succeed at this point. The community wants everything to be more specific and understandable, but the team only demonstrates success at the very end of the project, after everything has been completed. Consequently, with regard to this AUDITABILITY, I will comment on 4 points.", "q2r": 4, "assessor": "z_assessor_2254", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 1995, "q0": "The proposal idea is to create a platform which allows the use of ‘operative artwork’, that are NFTs which “can also perform functions within smart contracts”. This solution addresses the problem stated, which is the lack of a leading platform on ADA blockchain that allows staking and farming of NFT.\n\nThis is a nice solution because it can foment the movement of artistic class onboard Cardano blockchain. Besides that, it unifies the ordinary investment world, as in Yield Faming, with NFT.\n\nThe timing could not be better. The NFT market size is expected to be USD 211B by 2030 with a CAGR of 33% (2022-2030) (https://www.globenewswire.com/en/news-release/2022/05/27/2451899/28124/en/Non-fungible-Token-NFT-Global-Market-Growth-Forecasts-A-211-Billion-Market-by-2030-with-CAGR-of-33-During-2022-2030.html#:~:text=The%20global%20non%2Dfungible%20token,%2Dfungible%20token)%20market%20growth.) , which is incredible. Therefore, ADA must have a good solution to explore this market and, having this platform with the farming functionality is a next step.\n\nThat being said, this proposal has the potential to arise the attention of a class of people which could not be aware of ADA, generating value to the blockchain and impact in the lives of several artists, investors and enthusiasts.\n", "q0r": 5, "q1": "To create this platform the proposal provided the proof of knowledge and experience of the whole team, which is diverse, summing all the competences needed to develop the platform, interface, contracts, etc.\n\nThe roadmap is well defined and seems feasible. Since the team is well experienced, the path is well outlined and shall be conducted without any major problem.\n\nThe budget is detailed, being the majority of it destined to pay the development of the platform and functionalities. A part of it is also dedicated to marketing, which is a really important aspect of the business that some of them forget to address, and a huge thing is that there is a part dedicated to third party audits – de proposal states the necessity of code audition in the risk section, which is a must do. \n\nTo finish, the project was divided in 2 phases, being the phase 1 contemplated in the budget asked and, therefore, the aim to this fund. To accomplish this, all the needed information was given to verify if it’s feasible or not.\n\n", "q1r": 5, "q2": "In order to be auditable, one important thing to be provided is time schedule of the activities to be carried out and that is exactly what they did. The proposal has a plausible timetable and a way to verify it (links provided). Besides that, there are the social media platforms that are used to provide info and townhalls attended.\n\nThe phase 1 metrics and KPIs are associated with the full development and creation of specific parts of the project. That seems fair since the phase one consists in create the main functionalities and the platform for tests. Besides, it would be good to measure the community participation, e.g.\n\nThe problem to deal with and the proposed solution are clear and well defined, meaning that is easy to follow the development and verify if the team is going to the right way.\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 2740, "q0": "this is a very influential idea, it fits inside the vast DEFI that contributes to the promotion of the Cardano ecosystem in general and the NFT array in particular, along with the meaning of the title to know just by looking at it. The goal of the idea is to develop lending for profit, I am very much looking forward to the success of the proposal, which is a positive development, ensuring transparency for investors who own NFT, ensuring security confidentiality for the transactions between the parties, I have no opinion on the description of the solution of the proposed topic, in the summary of the solution when I read it, I have a lot of questions and concerns about how but right after that I was really satisfied when I read your Whitepaper, very clear and detailed, and impressed with the Economics - Tangentada section because especially the Tangent Foundation 10% these are the criteria in the very There are many criteria by which I will invest your Token when it is released and allowed to circulate on the market. In terms of risk management, most of us Understanding this array will have a lot of potential risks that we may not be able to anticipate, especially low-quality Tokens, but the proposed topic has also clearly stated these weaknesses and has some limitations. More cautious and thorough before putting it into the financial sector, the advantages of eUtxo, and Cardano's smart contracts will somewhat reduce unnecessary risks, but the topic of the project still needs to be more cautious. for absolute risk optimization,", "q0r": 5, "q1": "The timelines for completing each goal have been provided in detail by the project topic, but there will be a note for the progress of the proposal if in 2022, the second quarter of the goal of recruiting more personnel includes: many positions such as programmer, Haskell/Plutus Back End developer, and Full Stack developer, so if hiring could be delayed such a delay could affect the progress of the projects. next goal? The proposal team has also determined the time to complete the project, it is expected that more than 1 year, 2023 Q3 will hand over the DAO to the community, the budget for the proposal is also provided by the proposed team, but in my opinion To make it easier for the community to understand when reading, maybe the project team considers that it would be better to separate the spending for internal and external, and there is also a small suggestion for group costs, here I I'm understanding that this is the right development team, and so is there a guarantee for the team's hard work? Through the Whitepaper, I have seen the professionalism of the team and had the individual disclosures, as well as the appropriate experience, organized assignment, wish the team success.", "q1r": 4, "q2": "This is a completely new idea, but I see professionalism and experience from many criteria, can see that the group provides relatively transparent information, and also has plans to organize their own emergency rooms. In the near future, the team will use the budget from the group's fund, and the team is also committed to timely updating the progress and implementation results of the project to the community on social networking sites. of the team, however if publishing the written reports as the team intends every two months, if it can be done once a month that would be great, success is also identified by the team as a task. great service to the Cardano ecosystem, time is also set for success, the measure of future success is to create a foundation for DEFI, and generate additional revenue for artists, and owners NFT", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 4516, "q0": "The team proposed a well-thought-through solution to provide configurable platforms to create NFT farms, thus helping accelerating the growth and evolution of developer & app ecosystem, which is one of the Fund9's strategic goals. The urgency to have NFT-related interfaces had been stated by Hoskinson in the June 2022 Town Hall. Being a user on multiple blockchains myself, I intuitively understand the vitality of NFT platforms on other chains and I trust that this solution addresses a sizable untapped demand. What I wish to see in order to more precisely gauge the impact of the proposal is numbers and metrics that highlight the expected value added that this proposal could bring to Cardano. For example, the proposers could highlight how significantly transactions on NFT platforms have contributed to a chain's activities, adoption, and TVL. Having those high-level numbers is helpful for the voters to visualize the potential impact of the project.\n", "q0r": 4, "q1": "My due diligence suggests that the proposal is highly feasible. The team has already started the project with well-built presence such as a website, whitepaper, deck, roadmap, and media announcement. In terms of experience, the team profile is very informative and solid with relevant experience in building similar products in other chains. The team has been active in addressing the community's questions and provided their Discord for further discussion. The roadmap timeline is comprehensive and reasonable, and the budget for development is not out of ordinary. My only comment for the team is to go one step deeper to break down how many man-hours it would require to complete one feature, thus they could provide more basis to estimate the budget.\n", "q1r": 5, "q2": "The project is auditable based on a high-level thanks to its roadmap with detailed milestones and time horizons. However, I would love to see some metrics to define success for their platforms and, if possible, for the major feature releases. For example, the metrics could be # of developers who build NFTs farms on the platform, TVL, or # of transactions. The proposers provided a clear understandable description of the targeted problem and solutions but they lack supported numbers. As this is a proposal with very high feasibility, I strongly suggest the team provide more clarity on the auditability aspect for the community to assess it down the road.\n", "q2r": 4, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6287, "q0": "This proposal intends to create an NFT Staking platform that allows NFT holders to earn yield while staking their NFTs on this platform. It is aligned with the Challenge as it involves the development of a product that will add value to the Cardano Ecosystem. The NFTs have a big market, but very few NFTs are offering attractive benefits to the token holders.\n\nThe staking feature of this platform to earn yield rewards will add value to the NFTs issued by the proposer. In addition, the other NFTs launched on this platform will be added to the yield-generating options. Furthermore, Tangent will launch their 'Tangent/Kwrtz' NFTs soon.\n\nThe proposer is aware of the risk they will face in developing the protocol and will mitigate this risk with the support from the Cardano Community and by performing the audit of the Smart Contracts before launch.", "q0r": 5, "q1": "The proposer and his team's details can be found in the proposal and on their website, where LinkedIn profile links are shared. The team seems qualified; additionally, the proposer mentioned that they would hire two more developers to carry out this proposal. The team has also done an NFT project on another chain.\n\nThe asked budget of $125,000 is segregated into identifiable tasks such as staking platform development, front-end development, audit, marketing, etc. Therefore, the amount requested is reasonable to execute this proposal & it will be used for the engineering, audit, marketing, and team expenses.\n\nThe roadmap is provided and is divided into quarterly intervals. This I found pretty long in comparison to several other proposals in Catalyst. I suggest it should be divided on a 'monthly basis' with assigning the tasks to be achieved monthly. I feel optimistic about the marketing of this proposal, which is essential for onboarding people. The proposer stated that they would update the community about the proposal's status via social media platforms and thus make the community feel important.  \n\nGiven the above facts, the proposal will likely be executed if funded.", "q1r": 4, "q2": "As the proposer stated, they will update the community on social media platforms about the non-technical updates. About the developmental updates, the auditors can utilize bi-monthly written reports prepared by the team to audit/track the technical progress of the proposal.\n\nThe provided timeframe is in quarters with the tasks mentioned to be completed every quarter. This also serves as the delivery dates which is quite long in comparison to similar kind of proposals as I already described above.  \n\nAs mentioned, the success metrics of this proposal will be the successful sale of the NFTs, its staking on the platform, and the use of the platform by other artists for their art projects.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7964, "q0": "The problem is that NFTs need more utility to drive long-term engagement. The intent of the creator is to develop a platform that allows owners and developers to create farms where users can deploy multiple NFTs. Rewards will also be provided for users. The proposers want to create an NFT related interface. The aim is to merge art and finance with Tangent on the cardano network by focusing on the development of NFTs. This project will have a positive impact on the Cardano ecosystem as it will attract people interested in NFTs and developers. Key statistics and targets are included in the proposal to meet the outlined challenges. These are all recorded very transparently. Future challenges are also included. The good thing about these challenges is that the submitter has always defined a possible solution.", "q0r": 5, "q1": "A list of the people who will participate in this project has been included. These people have relevant experience. You can find these people via their Linkedin. You can also find the team on the Tangent website (https://tangent.art). The submitter shows in a recognizable way who is needed to implement the proposal. The team has helped create multiple NFT platforms at other chains (eth,BSC,Matic). This experience will be necessary to implement the proposal. The timeline also states that a few additional team members will need to be recruited (Plutus developer, full stack developer). A breakdown of the budget is included in the proposal. It might be better to explain in more detail what is meant by team costs ($500). It would also be helpful to include working hours in the proposal. The budget certainly seems sufficient to me to implement the proposal. The budget is only for phase 1. The intention is to return to fund 10 for phase 2 of the implementation. The proposal offers a realistic timetable divided into quarters. There is a clear implementation plan that is included with the timeline with the most important milestones. The technical aspects are also present with the timeline and it is very transparent. A very extensive risk analysis has been carried out. It is good that it is divided into different themes (budget, product, technical complexity, team resources,...). Solutions are always provided for the risks. A lot of research has clearly been done to ensure that the project is carried out properly.", "q1r": 4, "q2": "The roadmap with milestones is well chosen and clearly shows that extensive research was done before this proposal was written. The roadmap is divided into different quarters with the technical aspects that will be achieved. It's good that the community will be updated weekly through social media platforms. A report will also be published every two months with information on the development status of the proposed areas. Most importantly will be the full launch of the Tangent staking platform (2023). A clear description of the intended problem has been made. The maker offers a clear solution by offering Tangent. Tangent will ensure that the Cardano ecosystem will become more widely known in the field of NFTs.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8108, "q0": "Staking and Farming is a way for users to earn rewards as a passive income in the crypto space without selling NFTs or transferring ownership. Instead, the proponent raised an important issue for the Cardano ecosystem and the general blockchain. The issue raised was that \"NFT needs more utility to drive long-term interaction. To date, there is no leading platform on Cardano that allows NFT to be Staked and Farmed in Defi smart contracts\". Therefore, the idea of ​​this proposal is necessary for developing the Defi array, thereby attracting more users and promoting the development of Cardano.\nTo solve this challenging problem, the team's solution was to \"Build a platform (Tanget) that allows owners and developers to create a farm where users can bet multiple NFTs on one beautiful interface.\" while generating an external reward for each user\". The proposal describes specific solutions in detail, clearly, and rigorously argues. Active artworks can be placed alongside other assets in Liquidity Mining and Yield Farming Pools to generate passive income for investors. Functional artworks can also be locked into NFT Farming Pools for additional rewards or loaned to other users in exchange for a flat fee.\nI learned about Tanget through the links provided by the proponent, Tanget is a radical art & financial project built exclusively on Cardano. Tangent's mission is to merge art with finance on the Cardano Network by focusing on the development of NFTs and their applications in finance and gaming.\nBesides, the team has also anticipated the risks encountered when implementing this project. Risks associated with possibly missing pre-existing and audited open source libraries and farming smart contracts mean a lot of code will have to be created from scratch. Risks related to smart contracts and user experience. The risk of asking for a DAO structure when they want to help drive NFT creation and artistic expression on Cardano by sponsoring Artists. From anticipating these risks, the team devised appropriate solutions to overcome them.", "q0r": 5, "q1": "I have read through the link Tanget Whitepaper carefully and somewhat visualized the entire project. The project has a long-term vision, a clear roadmap, and a specific timeline with planned goals. The project has a token issuance (TANG), a transparent public tokenomics, and Token distribution table. Total supply is 3,141,592,650. Listing time in Q3/2022 on Cardano Network DEX (such as SundaeSwap).\nThe budget for this proposal is only 0.94% of the total Challenge budget. This amount has been amortized and presented for expenditure. This funding is for phase 1 of the project roadmap. However, I find that the period of phase 1 is quite long (from Q1- Q4/2022) while the calculation part is only calculated in a short time, such as: Staking Contract Developer 1 x 3 months; Staking Contract Developer 2 x 3 months; Full Stack Developer x 3 months; Staking Platform UI / UX Designer x 1 month. The team can help me with this additional explanation to better understand how the budget is allocated.\nIn the description of group member information, they presented coherently and full of information I needed. There are titles, assignments, and biographies, which also link to their profile, making it easy to verify your identity. They are all experienced and competent people suitable for the proposal. In addition to this proposal, the team also made several other proposals in Fund 9. This shows that they are hard-working and have many good ideas. They trust and choose the Cardano ecosystem as the place to build those ideas, helping to promote the development of the system. However, there will be many opinions that this will not be good when in the same period, the team participates in many projects, human resources are scattered, and the quality of the projects is guaranteed and on schedule or not. I found that, in this proposal, the team assigned each person tasks, and they recruited two other programmers. With the experience and achievements that the team has achieved in the past, I believe it is entirely doable.", "q1r": 4, "q2": "For the progress measurement part of the project, the proponent says that they will post updates on the project on social media weekly; they plan to publish a written report and commit to attending the Town Hall per week... However, I think the proponent should provide more community indicators that need attention when reading the report and monitoring the media to make it easier to measure progress.\nThe team has clearly defined the success of the project as: creating and fully launching the Tangent staking platform in 2023; successful sale of Tangent x Kwrtz Active Artwork Series; Starting with artwork done in the Dapp area; ultimately creating a permissionless Defi-as-a-Service (DaaS) platform that Cardano digital artists and developers can use to create their own NFT farms.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8559, "q0": "Due to the lack of a leading Cardano platform that enables NFTs to be staked and farmed in DeFi smart contracts. The proposal's solution handles the issue well, offering to provide a platform that allows owners and developers to create farms where users can stake numerous NFTs on an aesthetically beautiful interface while producing extrinsic rewards for each user. I would advise the team to detail the problem with further data if possible, as well as provide a concise overview of why it is a problem that must be addressed. However, I appreciated the overall concept, the project proposal, and the overall outlined tasks and milestones. The recommended solution is detailed and sensible, leaving no room for doubt. The links offered make it simple to verify the team's experience and increase voters' trust in their ability to complete the job. I congratulate the team for outlining potential risks to project implementation and for already devising strategies to mitigate them. My sole suggestion is that the proposer attempt to quantify the impact. It may have been stated here, for example, how many people are targeted and should join this platform.", "q0r": 4, "q1": "According to my understanding, the project will run from 2022 Q2 to 2023 Q3. The team shows a precise and logical road map with tasks to be done at each step, which is a first plus point in terms of practicality. The proposal outlines the development milestones, allowing us to see a thorough implementable strategy. Very professional and transparent manner. There is also a completion date for the solution, making it easier to decide whether it can be done in a particular period of time. Furthermore, they performed an excellent job of providing relevant references to validate the team member's knowledge and skills. I understand who they are and what they are capable of. I truly believe with such a talented core team, the project is highly successfully implemented and can grow the voter’s trust. However, the team mentions two more programmers for staking platform development. I genuinely think the proposers should consider providing more information in that field, such as whether they have already found the two new members or are still looking for them; if they are still looking for them, there should be answers to the questions: what are the criteria for being a member of the team? Or what precise work would they be required to complete in order to contribute to the project? Concerning the budget, it is divided into seven distinct 6 components. If I may suggest one improvement, it would be the way each element's cost is defined. For example, the team ask for $10,000 in order to do marketing, I recommend the team to break this total of marketing expense into small identifiable items and add through which channel or platform will the project will get the community’s attention, how much it cost for each channel (in the situation the proposers use various sources of marketing).", "q1r": 3, "q2": "Given the combined experience of its team members, the project is extremely likely to be a big success. The team gives a suitable plan with specified milestones and requests a total budget that appears to be reasonable in general. Because the team promises to offer regular updates, I believe it will be simple for the community to assess the proposal's execution. However, no KPIs are provided, leaving room for imagination of achievement, despite the proposers' definition of success. The key metrics are mentioned, but they are vague. My recommendation to the team is to amend the proposal with further information on this.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9912, "q0": "NFT infrastructure is moving from minting tools and marketplaces to staking platforms and farming contracts. The very nature of NFTs is being able to capture virtually any information of reality. So the potential ways to use them are virtually limitless. \n\nThe challenge asks for an increase in the number of integrations that bring existing solutions together for a more seamless and connected experience between different products. Because the use and utility of NFTs is growing explosively, the number of NFT services and tools is growing too. This proposal aims to provide a platform which enables staking their multiple different kinds of NFTs, as well as customize the system for their needs and thus addresses the challenge very well. This proposal takes important steps at helping toward new ways to utilize non-fungibility of digital tokens and connect them more deeply to the DeFi ecosystem. It also synergistically leverages other infrastructure of Tangent. The proposers mention a lack of security audited libraries as one of the potential risk factors for successful delivery in time. However, I think despite possible delays, creating these secure solutions as they are planning to do with CertiK, is a much needed value added to the ecosystem.\n", "q0r": 4, "q1": "There is a very clear and realistic roadmap for the project covering years 2022 and 2023. This funding round is specifically for developing the NFT staking platform as well as required interfaces and user tools on Cardano testnet. This is stage one of the project. After completion, the second stage consists of auditing the infrastructure for mainnet release and DAOfication which are planned to get funded in Fund10. I don't see any big financial risk about follow-up funding. \n\nThe budget breakdown is exceptionally clear and detailed all the way to individual member level. The funding asked is reasonable and in line with market prices. The team members have a long experience developing many kinds of blockchain solutions outside the Cardano ecosystem. The members’ track records, skill sets with relevant links and the responsibilities in this project are given in a detailed manner. \n", "q1r": 5, "q2": "The team has a plan to provide regular updates about the technical and non-technical progress. Attending town halls and hosting breakout rooms give the community an interactive opportunity to get information directly from the team. It increases the scope of transparency because anyone can ask whatever they have in mind. The well-thought-out roadmap offers a good background for the development to be projected against. After launch KPIs include the amount of use of the final platform. The goal is to make NFT farming as popular as yield farming in DeFi. If this becomes reality and Tangent’s role in the Cardano ecosystem remains significant, I would conclude that the project has made a great contribution to the topic. ", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11432, "q0": "The proposer has idea about a platform called Tangent - a decentralized art project built on Cardano blockchain that focusing on the development of NFT and their applications in art and finance. Tangent combines Defi farming with NFTs in a modern digital art gallery experience while creating an NFT marketplace for artists, built on smart contracts for community. Therefore, Tangent will act as a bridge between artists and investors which promotes users to participate more in trading, staking NFT on Cardano. A good point is that the team has quite good preparation and basic foundation before raising fund in term of whitepaper, roadmap, community support via social channels, website. As far as I know, they have developed in collaboration with a leading Japanese bohemian digital artist but detailed information related to this is not shown in the proposal. In general, the idea is suitable to the challenge. ", "q0r": 4, "q1": "Well, I find some part of this feasibility is not clear. In terms of plan, they do provide a very long-term plan ahead from Q2 2022 to Q3 2023, however in budget, expense is required for a task for 3 months, some tasks is for 1 month, some tasks is not clear about the time. Moreover, the detail of the budget is not clear. For example, they ask $50,000 for staking contract development, $30,000 for front End Development, $10,000 for marketing, but do not provide exactly how many people will carry out this task? how much will be paid hourly? A good point from this proposal is that they have a very qualified team members with detailed profiles with link for reference. In general, I'm not impressed with this part. ", "q1r": 3, "q2": "Well, the auditability part is ok. The proposer suggests some ways that community could follow the development of project: non-technical updates published via social media weekly, written report published bi-monthly but not clearly state where will they publish this report? which tool will they use?, or attend Town Hall each week and host breakout room for answering further community quesions. However, the proposer should have KPIs for communication and results of the project. After all, this part is ok but need further detail.  ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "budget breakdown and team roles / responsibilities have been updated since this was posted"}, {"id": 14529, "q0": "The project solution proposes further use cases for NFT. This essay will focus on discussing the impact it’s had on the community. Traditionally, NFTs are only collectible digital art pieces and there is little utilization related to them. By allowing staking and farming, NFTs can now function as a part of decentralized finance. This will boost the trading activities and add more value to the NFTs. However, as mentioned in the paperwork, NFT farmers and stalkers can earn rewards but what exactly is the reward? The proposal should discuss more on this aspect since it is what directly attracts the community. The project also aligns with the challenge target: driving acceptance of Cardano ecosystem and enlarge its community. To do so, the project will open source the smart contracts behind the platform and make them permissionless so that anyone from the Cardano community can use it to create configurable NFT farms for their own communities. In short, their goal is to create a platform that explores a new innovative concept ( NFT farming) and also provide permissionless Defi-as-a-service that anyone can use.", "q0r": 4, "q1": "The project's roadmap is in great detail with a specific timeline from Q3 of 2022s to Q3 of 2023s. From the roadmap, we can see that there is a relentless effort to minimize the error of coding. For Q3 and Q4 of 2022s, after developing the platform, there will be a series of testing and their party audits to receive feedback and improve the platform. A notable point is the fact that after each audits, the result will be published to the community in order to maintain the project clarity. The roadmap also shows a strong commitment to what they say in the solution part. Starting from Q2 of 2023, they will focus on developing the configurable NFT farm maker and hope to officially launch it in the next quarter of the year. As for the budget breakdown, it is thoroughly distributed to each sector. For example, they plan to use $30000 for staking contract development (internal and external) with a specific time of 3 months. However, the budget of $500 for team expenses is rather vague. The proposal should explain more on this to maintain its clarity. With reference to the team member list, this is clearly a big team with competend abilities that are able to carry the task. Each person is listed with a LINKED IN profile and an overview of their relevant experience.", "q1r": 4, "q2": "First of all, publishing updates on social media is a great way for the community to track the project development. A more interesting point is the fact that these updates are published on a weekly basis, giving them the most recent knowledge about the project status. More than that, the team intends to host a breakout room to answer questions from the community about the project. As a result, the users will not only learn more about the project but also can evaluate the competency of the team members and their vision of success. The success for this project is the full launch of the Tangent staking platform and the creation of a permissionless Defi-as-a-service platform. In short, their goal is to complete the whole system. However, the ultimate goal should be driving acceptance of the Cardano ecosystem and attract more users. They should also consider adding several key metrics as the trademark of development. That way, the community can consider the project potential.", "q2r": 4, "assessor": "z_assessor_4071", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A platform that allows for owners and developers to create farms where users can stake multiple NFTs on an aesthetically pleasing interface whilst generating extrinsic rewards for each user. ", "experience": "The team have helped create multiple NFT platforms on other chains (Eth, BSC, Matic) & have experience in the coding and deployment of DeFi (liquidity pool farming, etc) & NFT related projects (gallery, marketplace) since 2019. Refer to github & team experience for more info."}