{"id": 414199, "author": "benmahmoudoussama", "title": "PeakChain Car-Sharing Platform", "url": "https://cardano.ideascale.com/a/dtd/414199-48088", "category": 26595, "amount": 85500, "description": "Connected vehicles require enhanced layers of security and data privacy. Current car-sharing solutions are centralized platforms.", "f6_no_assessments": 15, "f6_rating": 4.488888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 4667, "q0": "In my opinion, this proposal matches the requirements presented by the challenge. In addition to helping consumers use renovations with information security, the initiative intends to push Cardano into the automotive industry market. I appreciate the presentation of the proposal because it has a tight layout and is tied together in each section. If this project is successful, this DAPP will bring Cardano huge value, and also, users will get huge value. The project also focuses on privacy factors and improving transparency. Enhancing blockchain data security would be a complete solution. This is also the money to develop not only the automotive industry but also many other industries, helping the value of Cardano spread. Even the fact that they want to promote in Germany, where personal information is concerned, is a great option, allowing the project to grow an interested number of people without spending a lot of money on advertising. Using Blockchain Smart Contracts instead of traditional centralized digital contracts will improve billing calculations while reducing third-party actions and protecting personally identifiable information. More than. I am also delighted by the concrete solutions that closely address their anticipated challenges. Overall, they all deserve a perfect score for this segment.\n", "q0r": 5, "q1": "First of all, I would like to get a comment about the team of this proposal: The team has a lot of technical experience (software development, quality, hardware integration). Furthermore, LinkedIn links are provided along with team qualifications, experience and roles per person so that the information can be verified, and I also found their qualifications to be sub-par with the role. They are in charge of the team. The way they clearly allocated the tasks to do on this project is also very nice. This part is really complete in the proposal.\n\nSecondly, I would like to talk about the budget: the team provided an excel file named \"PeakChain_Carsharing_Feasibility\" which includes the following contents: Roadmap, project plan&Milestones, resources profiles, finances, and carsharing platform deliverable. The budget section I can see now that the finances section here provides a lot of information, but I think the team should provide more detail than the finances section on how the monthly rate is calculated.\n\nThe third of the steps explain how the project will be developed, this proposal is very detailed and rich in relation to the explanations of each step organized by the team. Starting with a review of the team members, we found that they all seem to be very skilled and have considerable experience in the tech sector, as there are several senior developers on the team. But, in an additional way, project managers and others not necessarily affiliated with the technology are also present, showing the completeness of the team. A positive point regarding the experts involved is that they work at the technology company Peaksoft GmbH, whose address has been provided: https://peak-soft.de. The company's website is very well structured and presents several aspects that professionals approach in projects, some of which are also covered in this proposal. CVSs of all professionals involved in the project were provided through LinkedIn addresses, helping to demonstrate their previous experience. For example, we have the CTO curriculum available through the link:\nhttps://www.linkedin.com/in/abderrahim-issaoui-b3149227. Honesty and transparency in the use of finance certainly make investors feel confident. Maybe all I need is a brief request that the proponent gives each action a specific amount of time to complete. While this list is great for the moment, I feel they could do much better.\n", "q1r": 5, "q2": "With the specificity of this project being software development, it's hard to set KPIs, but I appreciate it when the team uses agile software development methods. A Scrum board will be created in the Atlassian JIRA Tool to track the project's progress.\nThe Product Backlog, which includes the tasks planned in the user stories, will also be generated in the Atlassian JIRA Tool. Scrum will greatly increase the transparency and suitability of the project progress status and its deliverables. However, I wish the team could have a demo of the agile software and a scrum demonstration board. as well as instructions on how to check project progress on Agile software.\n\nIn short, I appreciate that the team has applied the software to check the progress of the project, but I would like the team to provide a more detailed description of how the test is performed as well as images. and so this part I rate 4 points.\n", "q2r": 4, "assessor": "z_assessor_2583", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 2054, "q0": "According to proponents of connected vehicles that require enhanced layers of data privacy and security and currently there is no global blockchain standard for the automotive industry. The mission of the proposal is to establish Cardano as the blockchain standard for the automotive industry with a vision to become the world's leading automotive industry blockchain solutions provider based on the Cardano blockchain. The solution is to build a connected automotive platform and DApps on top of Cardano, aiming to establish Cardano as a standard for the automotive industry. I like the idea, and I think it fits the specific goals of the challenge very well. This idea, if successfully implemented, will ensure the privacy and security of companies and the data of drivers using fleet management services — especially when compared to other fleet management services. Fleet management communicates with centralized services.\nThe success of the project, as stated in the proposal itself, could, in the medium and long term, strengthen Cardano's blockchain as a pioneer in this car-sharing segment, increasing Cardano's forecast not only in Germany, which can spread to other places.\nThe proposal has also outlined 3 main challenges that may be encountered during the project implementation, and also given very solid solutions to overcome the challenges or risks that may be encountered.", "q0r": 5, "q1": "The feasibility of this proposal is very high, besides providing the elements of roadmap, budget, and team, the proposal also meticulously provides additional details related to the feature analysis. Because this is a project that is both technical and automotive, it is essential to fully explain the components and explain what the project will accomplish. The project did a great job of that and helped us have a better overview of how they did it and a better understanding of a new area. The company's website is very well structured and presents several aspects that professionals approach in projects, some of which are also covered in this proposal. The members who are supporting this initiative have pretty great backgrounds in my opinion. They are all people with years of expertise in different but connected professions. They are all highly qualified or work for reputable organizations. And all of them have been allocated the tasks to perform in this project. Besides, they provide each member's Linkedin link so their information is easily verified.\nRegarding the budget, $85500 was requested, and they had a clear explanation of the cost distribution. It was shown how much each professional would earn and the monthly total was calculated. Regarding the roadmap, there is a detailed timeline in the spreadsheet provided, and the team is also interested in illustrating how the tool will work in general, describing the technologies involved, and communicating between them the system, thus representing a very detailed plan. From all this information, it can be concluded that the team has a very detailed execution plan and cost control along with a great team, thus giving the feeling that the feasibility of this project is excellent.", "q1r": 5, "q2": "Since this is a software development project that still won't put a commercially available product, it's hard to set some KPIs. However, the recommended way to assess project progress and success seems to be sufficient to audit it. The SCRUM method allows to verify what is done at the end of each iteration, and the Scrum board will be able to help keep track of that. The Sprint reports mentioned and the backlog provided are also essential to track project progress. The authors also establish what will be successful and acceptable projects, so that we can analyze the results. It is also very possible to audit the progress/development of the project, through the very detailed task list contained in the previous topic. So in my opinion this is a fully trackable project through the strategies developed by the team and also through the live tracking of the tasks to be performed.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4240, "q0": "In recent years, carpooling services have become a daily reality for millions of people, we are talking about a business that should reach 16.24 billion dollars by 2026 with an annual growth rate of 8.3%.\nWhen we talk about carsharing we are talking about a service that allows us to pick up a car on reservation in a parking lot, use it and return it (even in a different parking lot) generally paying based on the time of use. To use this service, the driver must provide the car sharing company with their personal data to demonstrate suitability to drive. These sensitive data are then saved within the centralized servers of the respective companies together with the data relating to the movements made. Saving within centralized servers exposes the data to privacy and security risks. The proposal therefore wants\nA decentralized platform will also make it possible to improve transparency in the calculation of commissions thanks to intelligent smart contracts.\nThe proposal therefore responds to the objective of the challenge of building a Dapp that is configured as an increasingly valid alternative to the service provided by current centralized providers (e.g. enjoy), given the size of this market, the advantage for the Cardano network is evident. (volume of transitions, increase in the number of users...)", "q0r": 5, "q1": "The proposal aims to create a decentralized car sharing platform that allows to eliminate the privacy and security risks deriving from the saving / management of data by centralized servers. The platform that will initially be built will not be completely decentralized, it is an MVP (minimum functional product), therefore the gross data recovered from the vehicle's CAN-bus (data collection center of the various car components) will be sent directly to the Peakchain server where the data will be decoded to obtain the travel information, then a smart contract will calculate the costs and process a transition which, once confirmed by the customer, will allow the data to be saved directly on the blockchain in a private (encrypted) and secure manner. As anticipated, this solution is not totally decentralized as the data passes through a server before reaching the blockchain, this exposes them to potential interference and / or manipulation, for this reason the team plans to integrate a car wallet device that allows decoding data at the level of the hardware installed in the vehicle and then run a cardan node independently without the presence of a server in the middle. This device is part of another team proposal in this fund (https://cardano.ideascale.com/c/idea/414249). It should be noted that although not totally decentralized the implementation of the platform (MVP) will serve to demonstrate the technical feasibility of the project, the team is in fact working on a prototype that uses a VW Passat. The team shows that they have the necessary experience to carry out the project, the team members (whose linkedin references are provided) are part of a consulting and software development company duly registered in Germany as GmbH (https: // www. unternehmensregister.de/ureg/result.html;jsessionid=E1F379FD0E14C05649CD0444BC13B884.web01-1) and ISTQB certified (international standard certification of software testing skills), they also have the necessary Cardano development skills. The proposer provides a feasibility sheet in which the team members necessary for the implementation of the proposal and the role of each member are precisely defined, the budget is clearly outlined and divided into identifiable items. The budget required for each member is high when compared to the average salaries received in Germany, but this cost can be justified by the knowledge of Plutus development as regards the figures of front end engineers and project managers, I find instead excessive the budget required for a front end developer. For this figure, $ 6000 are requested which means $ 72000 per year, which is excessive compared to what can be found online (https://www.glassdoor.it/Salaries/germany-front-end-developer-salary-SRCH_IL.0 , 7_IN96_KO8,27.htm? CountryRedirect = true). It should also be noted that the team's working weeks in some cases overlap between the various proposals presented, which risks creating a work overload. The proposer reports that, as a software consultancy company, it should have no problems in finding the necessary staff, however this could still be a critical element for the implementation times that the proposer defines in detail in its feasibility sheet. The proposal is presented clearly and presents the technical aspects such as the architecture and the necessary technologies. The proponent expresses the will to present other requests for financing in subsequent funds but does not present a precise plan in this regard.", "q1r": 3, "q2": "The proposer provides a feasibility sheet in which clear acceptance criteria are defined that should allow the first increment of the product to be delivered within 3 months. A scrum board will be created in Atalassian JIRA Tool, this will allow the community to check the progress of the project and its results.\nAfter the Sprint Review Meeting, a Sprint Report will be created, including the KPIs, however the proposal does not specify which KPIs are specifically measured as a success metric", "q2r": 4, "assessor": "z_assessor_2531", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4523, "q0": "The proposal is highly impactful as it targets large real-world market needs. The global ride-sharing market size is growing at 17.3% and is expected to reach the size of USD 61 billion in 2026. The centralized parties (e.g. Uber, and Lyft) are taking a big cut of fees from the drivers. If this solution could directly connect drivers and passengers and let them settle the service fee on Cardano via smart contract, it will potentially attract a great number of new users to the Cardano system. It also has great potential on a global scale. In short, this idea aims to solve a significant pain point in a real-world big, fast-growing market and it hits multiple strategic goals of Cardano and Fund9.\n", "q0r": 5, "q1": "I strongly agree that the implementation of this prototype is highly feasible. The team is already executing its roadmap. In terms of human resources, the proposer clearly identified the type and number of team members required to implement the proposal. The team composes members highly experienced in both connected cars, software development, and Plutus. The proposal included detailed write-ups and elaboration on the concept, system design, system components, key acceptance requirements, business model, roadmap and roadmap tracker, milestones, and resource profile. The budget proposed is reasonable given the team's level of experience. The proposer also well addresses the key risks and proposes mitigation for those risks. Overall, I think the proposal is well prepared with strong backup to demonstrate the feasibility of this prototype, I would suggest the team to include a broader roadmap for the minimum viable product (MVP) and go-to-market strategies (GTM) for their next phases.\n", "q1r": 5, "q2": "This proposal is highly auditable. The timeline is relatively short (3 months), which the proposer has broken down into detailed milestones to achieve for each week. From the technical perspective, the team also documents the system requirements and acceptance criteria very well, making it easy for the community to verify if they have been implemented accordingly. The proposal demonstrates a clear understandable description of the targeted problem and success is well defined, i.e., delivering a prototype that meets all the requirements.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4844, "q0": "I think this is a great idea from the proposer. These days, car sharing services have been growing in popularity which raising problems of protecting customers' data from hackers and privacy in centralized servers. Therefore, the proposer suggests the idea of building Peakchain Car-sharing Platform based on decentralized Cardano blockchain. In my opinion, the proposal absolutely fits well with the Challenges and brings many positive benefits for the users and Cardano ecosystem. As we know, this is an idea from a company located in Germany, and they plans to cooperate with a carsharing company in Germany to implement the pilot project in the future, and their solution will assure the privacy and security of the users' data. If carried out successfully, more companies will want to use Cardano blockchain as a platform for carsharing services. Cardano, as a result, could be established as a stardard for data privacy and security. There might be some risks such as problems for implementing this project, however, the proposer gives a very detailed solutions for mitigating these risks. In short, I think this is a very promising and pratical project.", "q0r": 5, "q1": "The proposer provides all the necessary information for the feasibility of the project. They have a very good team to deliver this innovative solution. Through their introduction, they prove to have technical and management competency to fully run this project. All members lives and works in Germany, as I know, they work full time for PeakSoft Gmbh company. Their expertise, experience, position, project's role is introduced clearly for each member with their Linkedin link, which I am more convinced about the ability to carry out this project. For the project plan, I know exactly what activities they would do in the next 3 months from September to Novermber 2022 in their Excel spreadsheet that is implemented on a weekly basis. In addition, for the project expense, fixed monthly salary is paid for both technical and non-technical workers in 3 months which I think it is reasonable for full-time workers, and the amount they propose is okay for professionals, I know the total required project cost is $85500. However, as I know, this team is also in charge of carrying out other proposals in Fund9, so my questions is how could they manage their time? how many hours per day could they spend on this project?. After all, I think the feasibility of this project is high with all of the above reasons, but a little bit explannation about time management should be added. ", "q1r": 4, "q2": "I think, the proposer provides very clearly on how they would manage the progress of the project. As I know, to manage the project development, the team would use Agile Software Development Method, particularly on Scrum. This tool will help decrese the time to market and accelerate the development pace, and Scrum will significantly increase the transparency and auditability of the project progress and its deliverables. Besides, to track the project progress, Atlassian JIRA tool will be used to create Scrum board, Product Backlog (including the planned tasks in user stories). In addition, the team will make Sprint reports, including relavent KPIs and accomplished user stories after the Sprint review meeting. Most importantly, they have clear acceptance criteria for the project components and deliverables, so based on these criteria, the first product increment will be delivered within 3 months. Therefore, I think, the team could monitor this project well. However, I would like the proposer to tell a little more about how community could follow up their project development. I know, community could join their stake pool, read more about project on blog posts on Medium. However, for the checking of the project, my recommendation is that they should tell exactly where community could give feedbacks, ask them questions? where could the community check it? on their website? social media account such as their Twitter, Linkedin? or in forms of public reports, documents? Will it be reported monthly, weekly? For all of reasons above, I could not give them full mark for this part, but it is not hard for community to follow the development of the proposal. ", "q2r": 4, "assessor": "z_assessor_2622", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5469, "q0": "The Proposal targetting one of the most worrisome problems of the digital world, data security is sure to draw some attention. Car sharing is one such facility that is highly susceptible to it, and there is almost no existing decentralized platform to use. The proposer presents the community, with a solution to tackle this and has done an extensive amount of background work already related to it. The proposer mentions the various challenges involved and also provides the readers with their mitigation policies that look feasible and competent enough. The proposal being one of a kind could do tricks considering it is implemented quickly and efficiently. The proposal could help Cardano improve its identity in terms of privacy and security. The car-sharing industry could become completely dependable and increase trust both from the owner's and user's perspectives. The tourism and in turn economy of many nations could improve multiple folds once Car-sharing is completely trustable and this proposal could be a way to achieve that.", "q0r": 5, "q1": "The proposer makes no mistakes in providing the community with a detailed road map. The feasibility spreadsheet attached to the proposal contains almost all the required details for one to construct an image of what the team is planning to achieve. The team members are also introduced beautifully, the experience and skills the members bring in are humongous. Each member's role is distinct and lucid and the breakdown of the budget over the 3 months is very reasonable and necessary. The development phases and the technical aspects are also not left out, the proposers make the necessary mentioning of the same for the technical readers to get a grasp on it and make necessary recommendations if any. The team is to return in the further rounds too for more funding, which shows the commitment and passion the team carries towards this project, adding up to their credibility. Thus, I as a reader would provide 5 out of 5 for the feasibility metrics.", "q1r": 5, "q2": "The apostle is aware of the expectations of the challenge at hand and provides relevant auditability metrics to track the progress of the project. The team is to employ Agile software development methods using spring planning and JIRA tools to maintain a SCRUM board, which are universally accepted methodologies to track software-wise development progress. The proposer also mentions providing relevant KPIs to show their progress. Using user stories to track the acceptance metrics could be another methodology the audit team could use to keep a close check on the proposal. The proposing team running a stake pool adds more value to the project and shows their commitment to the community, hence the community can be certain that the team would take all necessary steps to make sure that the auditing process will be fruitful. However, the real success of the proposal can be easily realized once a car-sharing company is onboarded and the usage and acceptance metrics are captured.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6295, "q0": "This proposal wants to create a Car Sharing platform and DApps on Cardano. This proposal is one of its kind as I did not come across any such proposal on Cardano. Car sharing is where people share cars for short periods, often by hours. So naturally, any such platform needs privacy and data security.\n\nThe proposer wants to utilize the Cardano blockchain for this purpose. As this proposal is about creating DApps & other products on Cardano, this proposal aligns with the Challenge.\n\nAs stated, this is the innovative use of blockchain. This will bring a different niche of users and hopefully turn them into Cardano enthusiasts over the long run. In addition, this will bring a lot of activity to the Cardano blockchain.  \n\nThe proposer first wants to introduce the solution in Germany, and this can be scaled to implement this solution in other regions. If implemented as stated, this proposal will have a great impact on a national level in Germany, if scaled, globally.", "q0r": 5, "q1": "The proposer and his team look well qualified to execute this proposal. The team members' names and brief details are provided along with the LinkedIn profiles. The proposer and his company 'PeakSoft' CTO are Plutus pioneers and have long experience in a similar field.\n\nThe detailed roadmap is broken down into identifiable tasks. These tasks, however, are technical as it is regarding the development of DApp. Moreover, the timeframe is stated as three months. It would have been great if the proposer corresponding could assign the timeframe to each task.\n\nThe proposer is aware of and conveys the risks and challenges posed to him in the execution of the proposal and shows in the proposal that he is well equipped to face these challenges.\n\nThe budget is $85,500 and is broken down as per the monthly salary of each team member. Given the volume of work required to execute, the budget is reasonable. However, I suggest the proposer divide the budget based on the tasks.\n \nConsidering all the above and the fact that the proposer already deployed a Prototype, it is very likely this proposal will be executed if funded.", "q1r": 4, "q2": "The proposer will use the Agile method 'Scrum' for DApp development. To keep track, they will create a Scrum board in Jira (A Trello-like service for software project management). Hence the progress of the proposal can be audited and tracked on Jira.\n\nThe budget is provided with a break-up based on 'monthly expenses required by each team member.' The timeframe is stated as three months to execute the proposal. As stated above, the proposer can break this timeframe per the tasks mentioned in the proposal. Then it will help the auditors and interested parties track the proposal.\n\nThe success of this proposal is the successful execution of each stage of the proposal mentioned in the detailed tasks script. More details will be updated on the KPIs data by the team. In my opinion, the KPIs can be the number of car-sharing platforms using the PeakChain Car-sharing solution, the number of car users opting for platforms utilizing the Peakchain Car-sharing solution, and the number of transactions on the Cardano blockchain via the Peakchain Car-sharing solution. ", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8562, "q0": "There is tremendous value in the way the proposer presented the problem and the proposed solution. There is a clear-cut problem statement, connected vehicles require enhanced layers of security and data privacy. There is no global blockchain standard for the automobile industry. This proposal aims to establish such connected car platforms and DApps on Cardano. The idea is interesting and tacked the aforementioned accordingly. It is easy to comprehend the idea as there is a video summarizing the car sharing project as well as an article relevant to it. In addition, the proposer has included key metrics that are ideally aligned with the challenge. There is a section dedicated to discussing how this Dapp works and the specific benefits it would provide not just to the audience and user group, but also to the Cardano ecosystem. Given this information, I agree that this approach meets the objectives of the challenge and wish the team the best of luck. If there is potential for improvement in the proposal, I believe the team should clarify on how Cardano will be used and fits right in for the solution of the problem statement, which might have been extended as a separate part within the comprehensive explanation. This would allow the other community voter to constantly understand why Cardano is needed and why this solution requires Cardano.", "q0r": 5, "q1": "We are well-versed in the areas of expertise of the main author as well as the other team members. I appreciate that the team provides information on each of them; we know what their previous experiences were, mentions of projects they've completed, how long they've been in the area, and so on, and this was also associated with their LinkedIn and other social media profiles,… Concerning the project's execution, I think they were successful in explaining what would happen, when, and in what order. With weekly and monthly milestones, the timeline table is presented delicately. There are several activities, and it is a major benefit because we can see how everything will play out chronologically. Considering the period of three months, such actions are likely to be completed, especially given the entire team's high level of expertise and knowledge. Budget-wise, the budget division is pretty well-explained; while it is high, it is reasonable owing to the specifics presented. As described in the proposal description, I feel such a project will need several hours of work from those involved. The developers would be paid a monthly salary of $6000-$6500, which I believe is reasonable for the role. It's also intriguing to get a quick glimpse at who will perform which roles. Something I missed here was money set out for marketing (as I saw mention of marketing tasks), such as how they plan to promote the dApp. This might have been stated more clearly. If there were additional explanations, we would have a clearer picture of what would happen with the requested funds and whether the financial plan is adequate for the project's successful implementation.", "q1r": 4, "q2": "Proposers do an excellent job of outlining their main success metrics and deliverables, which we will use to determine whether or not they were accomplished. The proposal's success criteria are acceptable and feasible, making the project viable and realistic. The potential dangers are also stated, giving the ability to keep risks in mind when the community audits the progress of this challenge. Furthermore, the team appears to already address the potential obstacles and risks involved. I am quite certain that the team will be able to overcome these obstacles as the answers offered are really convincing. Nonetheless, the team does not formally specify where they will share project execution progress, leaving their website as the only source to monitor and audit the project. From an overall perspective, given the aforementioned aspects, I don't see any concerns with tracking the proposal's development and success.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9287, "q0": "\"wow. After reviewing the team's proposal, I found the team's proposal to be very detailed and professional. The team's proposal details clear solutions, with very vivid and easy-to-understand videos. Your team presents clear challenges and then devises a detailed strategy to address those challenges. I see this as a really good idea and a good project in the future because connected vehicles need to elevate layers of data security and privacy.\nYou have a vision to be the world's leading automotive blockchain solution provider based on the Cardano blockchain. Your team comes up with a concrete plan, offering solutions to achieve your goals by getting ready to use Cardano connected car DApps. In particular, you have also developed a prototype... I really see the seriousness of your ideas and ways of working. Great. Therefore, this project has a lot of potential in the Cardano ecosystem.\n\"", "q0r": 5, "q1": "OH. After reviewing the team's proposal, I found the group's plan to be really detailed. The group's proposal details what needs to be done in each phase. Budget details are publicly available by Link and I have access to it. I have a strong impression that the project members are all talented and experienced people with a clear and transparent source of information through links. I have read a lot of different projects but really considering your project, I am sure that you will be successful in the future.", "q1r": 5, "q2": "In my opinion, the team you measure to track project progress using Agile software development methods and especially focus on Scrum. I find it good for your team to use this software because Agile Software Development methods will reduce time to market and speed up development. Scrum will significantly increase the transparency and auditability of the project progress status and its deliverables. The acceptance criteria of the project, schedule, team and budget have been updated in detail in the link docs. Overall, this is a good proposition that needs to be put into practice.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9472, "q0": "There appears to be no reference to alternative platforms to compare to this one, so I am not entirely sure if this is something that users would find appealing unless some kind of competitive advantage can be demonstrated. I score this section a 2 because I think there is a lot of missed opportunity to provide modeling evidence, market research, and competitive appeal to give voters confidence that this project will see succes. As an entrepreneur, I’m aware of popular side hustles like Turo, which appears to have first mover advantage in Germany. I think this section needs to be providing more information on the user base in the area, the competitive advantages that this platform brings to the table, and how this project is going to get from “zero to hero.” I think there’s a lot of factors that need to be addressed here, like other platforms ability to provide insurance or pricing model information. I don’t think voters get enough information here to confidently vote positively without details about what this app will do, even at the MVP level. It could also help to disclose some awareness data on social media or something else that can quantify the impact that we could get from this proposal’s passing. ", "q0r": 2, "q1": "Between the development team, the clearly laid out plan for development and testing, and the sufficient funding to proceed, I think this section deserves a 5. Many of these core team members have multiple years in both software and auto, which gives me a large amount of confidence about the niche capability of this team. It appears like a few of these team members have actually worked on car connectivity projects before, so I expect this portion of the proposal to be accomplished with ease. The roadmap appears to reveal these skills as well because they thoroughly layout which steps need to be taken in order to accomplish every aspect of this proposal. The funding seems to fairly compensate each team member for their work, so there is nothing in this section that gives me any reason to worry that approval would be a waste of funds. ", "q1r": 5, "q2": "This section appears to display an advanced measure of evaluation and success that identifies the kind of measurables that I would expect to see, so I rank this section a 4. Where I deduct some points here is for voter simplification. The whole proposal should be easily understandable to Cardano community members, so these advanced methods/standards of evaluation need to be simplified and organized in a way that breaks down what will be measured and why that should assure a rigorous standard for performance along the way. I think voters would be more likely to vote favorably for something they can clearly understand, as opposed to something that voters would have to assume seems adequate.", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10256, "q0": "The purpose of this proposal is to build a car sharing service solution (PeakChain) on Cardano. The proposer team acknowledges the weak points of the centralized car sharing services, such as vulnerable servers, data scammers, customers' information being compromised. To overcome these weaknesses, they create a car sharing application on Cardano blockchain. This application allows customers and vehicles to connect each other through smart contracts. The customers need to create a crypto wallet and payment is made in ADA currency. All activities are automatic and transparent, without the need of a third-party side. Trip data and driver behaviour is encrypted, uploaded and stored on blockchain. PeakChain's company has a big ambition to become a world-leading automobile blockchain solution and a model for other automobile companies to follow and deploy their services on Cardano. If this product is built successful and widely deployed in society, I believe it will bring more users, more companies onto Cardano and significantly raise the number of transactions on Cardano network. In my view, this proposal About risks management, the proposers have pointed out 3 main issues that could hinder the success of the project and provided effective solutions to overcome. However, I see another technical risk: According the proposal, Smart Contract automatically transfers ADA from the customer's wallet to the car wallet after the trip, which means the customer's Spending Password must be included in Smart Contract and it could pose a financial threat to them. For recommendation, I suggest that the proposers should add more payment options (e.g. stable coins like Djed, USDT, USDC) other than ADA due to the fluctuation of ADA price on the market.", "q0r": 4, "q1": "The development team comes from PeakSoft GmbH, a German company specializing in software development and software quality/test automation solutions. Some team members have years of experience with Connected Car projects in huge car companies like Volkswagen and Porsche. Several members are Plutus Pioneer which will be really valuable when they build any applications interacting with Cardano blockchain. In general, I believe the development team have sufficent abilities and experiences to complete the proposal. About the roadmap, the proposed three-months period can be considered as too narrow for developing such type of the product. However, the proposers affirms that they have already created a prototype and successfully implemented most of its components. Futhermore, the development team decides to use Scrum (one of the most flexible and innovative method in software agile development methodologies) in order to complete the development quickly with high quality. For these reasons, I have confidence that they will finish the proposal on schedule. In terms of the budget, there is no detailed information about numbers of working hours/day, cost per hour, jobs assigned to team members. Therefore, it is really difficult to assess whether the budget is appropriate or not.", "q1r": 4, "q2": "This proposal has specific timelines, clear and understandable KPIs for each stage. However, the team has not said anything about updating the project's progress on the internet (e.g. Github, Google Drive) so that the community can monitor and check the work have been done.  Moreover, the proposers need to demonstrate clearer evidence (image, video) about prototype which they claim to have implemented successfully.", "q2r": 3, "assessor": "z_assessor_3168", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11434, "q0": "The idea is about building PeakChain Carsharing Platform on Cardano blockchain. Their solution comprises of 5 unique components: Hardware, data decoding and processing, vehicle wallet, carsharing smart contract, web app. I think this is a pratical idea as it mentions about solving the problems of privacy and security in Carsharing services in centralized servers, utilized the advantages of decentralized Cardano blockchain in their solution. I fully support their idea. ", "q0r": 5, "q1": "The proposer provides a very detailed plan for the next 3 months from September to November in their feasibility spreadsheet. I know who will be in charge of which part of the project in their project roles. And the budget part is also very clear as they are full-time employees and salary is calculated based on monthly rate for professionals job which I think, it is suitable. Moreover, I believe in the implementing ability of this team. They are professionals, specialists in different fields as Engineer, Developer, Project management, Accountant, Administration,..with many years of experience. Community could find out more about them via Linkedin link given. They all works in PeakSoft Gmbh company with different positions in Germany which I think, they could work well with each other, and do well with this project. ", "q1r": 5, "q2": "Well, the proposer clearly tell how they could track their project development, but not gives enough information for community to follow their project progress. So, they will use Agile Software Development methods to manage this project which I think, it is very good. Moreover, they will base on Acceptance criteria for their project components and deliverables to deliver their first product increment. For community, they only said we could check their blog posts Medium for a summary of their projects, which I think it is not enough for community to follow and engage in their project development, so the proposer should explain a little bit more ways on this. After all, this is an auditable project. ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14482, "q0": "The concept behind the proposed solution is to build a tool that enables the shared use of cars utilizing Cardano's technology, primarily to guarantee confidentiality for user data as well as agility and reliability through the use of smart contracts. Having said that, we can see that the suggestion matches the challenge's objectives and is creative for suggesting a solution that best satisfies a social need. According to the plan, if the project is successful, Cardano's blockchain will become a leader in the car-sharing market over the long term, enhancing Cardano's projection not just in Germany but also in other countries where PeakChain is used. We came to the conclusion that the budget is appropriate because the variables taken into account to determine this value were clearly articulated, and the figure of $85,500 seems perfectly reasonable considering the size of the team and the team's capacity. The fact that the pilot project would be conducted in Germany, a country with a strong and developed automotive market and a desirable location for product validation, is another aspect of the plan that works in its favour.\n", "q0r": 5, "q1": "In respect to the team's planned descriptions of each phase, the proposal is incredibly deep and detailed. Given that there are multiple senior developers on the team, we can observe from an examination of the team members that they all appear to be highly skilled and have a lot of expertise in the technological field. However, project managers and other team members who are not necessarily connected to technology are also present, demonstrating the team's completeness. The company's website is very well organized and features a number of professional project-related components, some of which were also included in the proposal, that are approached by specialists. All experts involved in the project had their CVs made available via their LinkedIn profiles, which helps to demonstrate their prior work history. By breaking the task into sprints and employing the agile method, the team has defined the steps necessary to arrive at the desired outcome. This shows the team's compatibility with some of the project management concepts that are currently in use and also increases the likelihood that the outcome will be successful because this project structure allows for better goal segmentation and results monitoring. The team was concerned with displaying a very clear plan during the project's explanation of its stages by defining the technologies used and the communications between the systems, as well as by showing how the tool will generally operate. We had a detailed breakdown of the cost distribution for the project budget, which set the parameters for the amount asked. Each professional's expected salary was listed, and a monthly total was calculated. It is possible to infer from all of this data that the team has a highly thorough execution plan and strict cost management.", "q1r": 5, "q2": "For auditability, we observed that well-defined procedures were followed, including the utilization of user stories, frequent meetings, and the delivery of new features every three months. The methods of auditing the project are also easier and more straightforward thanks to the technique and procedures selected for its construction. And in keeping with this reasoning, the team suggested presenting the findings on an ongoing basis. JIRA, a popular application for this purpose, will also be used for such monitoring. We can therefore draw the conclusion that the proposal adhered to a fairly consistent pattern of idea organization throughout its earlier stages, and that this pattern was also upheld in respect to the metrics for result monitoring. One thing to keep in mind is that it would also be interesting to have a follow-up with an experienced Cardano member to confirm whether the project is making the best use of technological advantages.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14817, "q0": "I greatly appreciate the spirit of diligent research that resulted in a proposal that meets all of the project's requirements. Rather than writing long explanations or introductory paragraphs about the product, as many other projects do, the proposer chooses to express it in the most understandable and scientific way possible. We have the project's mission, vision, and plan presented in a very smart and concise manner. Furthermore, to ensure that voters understand the PeekChain Car-Sharing Platform application correctly, the author attached an introductory video that clearly shows the key points. This platform will ensure Data Privacy and Augmenting Data Security, in particular for technologies related to user data, a feature that users will undoubtedly appreciate. And of course, in case the project is approved then Cardano, as a result, could be established as a standard for data privacy and security. Moreover, the proposed future solution to the proposed problem is completely grounded, and I believe it will solve it well while not interfering with the project's progress. Overall, I agree with everything in this section and hope that the project is approved by Cardano voters soon.", "q0r": 5, "q1": "So far, I am still very impressed with the proposal presentation even in this Feasibility section. First of all, let's talk about the staff. We can see that the proposer has summarized the accomplishments and experiences of team members in part 1 rather than listing them in detail like in other proposals. Furthermore, in part 2, each individual's tasks are clearly assigned and are completely consistent with their capacity. This type of presentation is very simple to understand and assists voters in understanding the lineup as well as the tasks of each team member. Following that, the proposer intends to use the proposed budget to pay employees on a monthly basis. Not only that, but the proposer creates a separate file that includes the responsibilities of each member as well as payroll to help investors see how their money is used transparently and accurately assess the capacity of each person. Finally, the author's plan is divided into two major sections, each with extremely detailed multilevel lists. There is only one point where I am not entirely satisfied, and that is the lack of a milestone for each task in the project. The presence of milestones in a roadmap is absolutely required, and without them, the project will struggle to be appreciated by voters.", "q1r": 4, "q2": "At the end of the proposal, we can clearly see the points that the proposer considers the success of the project, and I have nothing to add. All ideas are well explained, and the proposer also attaches some necessary files, such as their contribution to the Cardano network or a summary of their projects, to help investors understand the project more thoroughly. It's not necessarily related to what was asked in this section, but the addition of such an idea shows the seriousness and determination of the whole team for this project. However, it would be preferable if the proposer included appropriate timelines when writing about the project's development.", "q2r": 4, "assessor": "z_assessor_4104", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14945, "q0": "First, I have to say that the plan to deliver the solution for this challenge of the team members in this proposal is really detailed, well-prepared, and fully functional. I can see that they are well-awared of the challenge they have to solve and what they are doing. This part shows that they are trying to reach 3 main key metrics of the challenge very well (by building ready to use Connected Car DApps on top of Cardano; bringing traditional existing solutions for car sharing and Cardano as well as ADA and e-wallet together; improving transparency and trust, augmenting data security and ensuring data privacy for car-sharing platform). The idea and methodology is demonstrated intuitive and attractive through the video on Youtube and project's page. Besides, they also have clearly strategy to mitigate the risks they can face. However, I suggest that the team member can highlight more what your platform better than the existing ones when using it instead of focus on only the value it can bring (for example: friendly UI/UX, easy to use, faster, simplicity steps or else).", "q0r": 5, "q1": "This feasibility session is actually quite detailed and basically meets the demands of a proposal. It has roadmap, timeline as well as milestones. The proposal also showed that this project has experienced team members and suitable experts (both in Cardano and Car Service). The way the proposal gave the information, as well as professional qualifications of their team member with their Linkedin links, is really clear. Their project management's also trying to enhance his IT ability for this project by getting the ITIL certification. I think it's a plus. There's also technology architecture and a prototype. However, I think the proposer can add more the working hours of their team member, and a number scale for acceptance criteria to help it more intuitive and clearer. Moreover, the team should provide more details at the budget so that the community can accurately evaluate it as the money provided for each team member is the same in 3 months while there's a month, only a few tasks are on track. Besides, there're some point confused me. Firstly, the project delivering a new product every 3 months, I don't know if the team members have particular goal specified for each of them. Secondly, the proposal wrote \"most components are implemented and tested successfully\", so if there's any fail case, the proposer can show it up with a solution. I think it will help the proposal stronger. Finally, the plan in the impact session mentioned to promoting as well as marketing (run in all 3 months), however, there's no mention of what team or who will in charge this scope of work, and the budget break down part hasn't included the promotion fee. If the outsourcing does those tasks, I think the proposal should also have a budget for it and an expected efficiency.", "q1r": 3, "q2": "In this auditability session, the team once again showed their excellent work. They keep track and manage their project by using Agile Software Development methods and JIRA tool, a good platform to track the project's progress. The only thing I concern here is the income in the future of the project. If the proposal provide more the income range it can reach if it meets all the success criteria, I think this will be a strong proposal.", "q2r": 4, "assessor": "z_assessor_4114", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We aim to develop a Cardano Car sharing solution on the blockchain, guaranteeing privacy and security for the provided services.", "experience": "\nMore than 5 years of experience working on connected Car Projects alongside Germany's world-leading car makers\nMore than 10 years of experience in Software Development\nMore than 8 years of experience in Software Quality Assurance and Test Automation\nPlutus pioneers\n"}