{"id": 414100, "author": "defi.babylon", "title": "JUS: Decentralized On-Ramp + Credit", "url": "https://cardano.ideascale.com/a/dtd/414100-48088", "category": 26595, "amount": 250000, "description": "In countries with high inflation, many are still economically marginalised, undocumented and unable to access banking systems- let alone Web 3.0", "f6_no_assessments": 8, "f6_rating": 3.541666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 839, "q0": "This proposal’s motivation is the need to provide a financial alternative for the Sub-Saharan African population that has historically been marginalized by the traditional financial systems. Today, through using centralized solutions, this population currently has an alternative in the \"mobile money market\". According to the Global System for Mobile Communications (GSMA), in its latest report, there are 1.35 billion registered mobile money accounts, which account for a total of $1 trillion in annual transactions. This translates into over $2 million worth of transactions per minute, 24 hours a day, 7 days a week, 365 days a year. Having a success story that leverages the benefits of blockchain in this market could not only be a headliner in the industry, but also be an opportunity for Cardano to attract a new type of user. What is their goal? In its first version, it would be a solution that enables the common citizen to purchase and exchange stable currencies with their biometric data which is stored in a digital identity. Version 2 would include the ability to lend and borrow funds. This is explained in a straightforward and easy to comprehend manner. By comparing it with the objectives of this challenge, I can clearly see the alignment between the two. Despite the long-term nature of the proposal, the impact metrics are simple and appropriate to quantify success.\n", "q0r": 5, "q1": "The team behind this proposal possesses the necessary skills and experience to carry out this project. They are part of teams with prominent projects in the ecosystem such as Liquid, WMT and Ardana. There is an appropriate description of the number of people, and the technical level required to carry out the implementation of the proposal successfully. Budgeting is a bit confusing since it includes all aspects of the MVP construction, which, within it, are described in broad terms, durations, and costs. Although it was structured as it was, it is extremely difficult to analyze if the team's logic to reach the requested amounts is appropriate, since, for instance, the cost of hiring a front-end developer is not the same as hiring a Haskell/Plutus developer. The implementation plan provides very few details. The work packages are described as taking a total of 50 weeks to complete, however, there is no information regarding the delivery date for the MVP. How was the work distribution determined? Are there any dependencies? When submitting a proposal to Project Catalyst, these questions should be addressed to the community.\n", "q1r": 4, "q2": "The roadmap was provided in 5 stages. However, it is difficult to evaluate the suitability of it because it does not show a start or end date, and it is not clear whether or not there is a dependency between the work packages. While the budget described exceeds the amount requested (reasons were addressed by the team), there are no indications of which work package will be advanced in the event the budget is allocated, which reduces transparency. I would recommend (in case you are selected or for future funding) that you describe minimally at a high level, time periods (e.g. in months) and accompany them with the deliverables expected. Although timeframes in software development are not expected to be highly precise, they are necessary so that a general assessment can be made of how the team is approaching this issue. Regarding the success metrics presented, I must say that they are simple and relatively easy to measure. However, since the metrics are centered around the concept of \"active users\", I would recommend defining what the team considers to be an active user, for example, \"number of swaps per period.”\n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2749, "q0": "\" one of the main goals of the idea is to develop lending services to some areas that are not financially developed and do not receive support from banks, this is in line with the requirements of the challenge. proposed in the loan puzzle (DEFI) when this idea brings services to the targeted areas, it will greatly boost the confidence of the system for indigenous populations, but it will also directly continue to have a major impact on the understanding of the Cardano ecosystem of underdeveloped regions,\n\n    lending with simple procedures that do not require identification and cumbersome verification procedures of traditional banks, the idea of ​​​​providing a quick process and applied by mold biometric technology face, and mobile phone number and with certain conditions satisfied by both parties, the transaction will be executed, the target markets are targeted with the team's statistics, the potential and advantages of This service is very large, in the form of proposed swaps will help the middle class have room to store Stablecoins to avoid inflation and can also help meet the needs of those who need to mobilize.\n\n    This is a potential market but also with many potential challenges and risks, the first risk to mention is the ability to pay for new users, but this service also has provisions to optimize risks. This is for bounty hunters, but that does not mean that we ignore the potential risks that may occur in the future, for example, the devaluation of the currency ensures the birth of a stable coin. the group needs to be as careful as possible\"", "q0r": 4, "q1": "\"this is an idea that has a big impact on the geographies of the target area, so it would be nice to have a website or link to a reference document, there seems to be a mistake in the disclosure statement. process, progress, content which is the same as in the budget section, is there a mistake or is there something different so milestone timelines have not been provided, as a basis for monitoring the group's work process.\n\n   there is an anomaly in the release of the budget details which add up to $500k and the requested amount is $250k. I read in the explanation of the team's response on a proposal similar to this one, but the team can explain more about the request for funding is less than the amount spent on the development of the proposal, if the team is afraid of more % than this. with a total challenge capital that can be divided into several funding stages, that proposal is in the challenge (Africa Development, Cardano Development). this proposal may be suitable for these same two challenges however i am not sure if it is forbidden but if for example both of these proposals are sponsored in this round and the solution content is like two drops of water, So what will be the treatment of the group if that happens, it will probably destroy the funding opportunities of other proposals. the group has publicly available the number of members and relevant experience as well as the positions held by each member. \"", "q1r": 3, "q2": "could be a weekly or monthly presentation of work progress, milestone updates to meet the tracking needs of the PA or the constituency, but this has not yet been committed to action by the team. . there are many indicators to track progress but all are difficult to verify and update. If the group had a main page and provided this information there or the social networking pages of each member, it would be much easier. the success of this proposal will be measured and accounted for year by year and the increase in the number of users will indicate the success of the proposal.", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 4519, "q0": "The proposal did a good job of highlighting the impactfulness of their solution. The problem (unbanking population lacking means to acquire and swap stable coins) is well defined, with strong supporting numbers. With the large market and high demand for crypto in African countries, this project, if implemented successfully, will significantly drive the adoption of the Cardano system. I just have some reservations regarding the scalability of the project beyond the MVP stage as it was not presented in the proposal. If the team could elaborate further on what they think (on a high level) to scale the product across multiple African countries (for example, technical requirements, legal requirements, partnership requirements), it would be very helpful for me to assess the long-term impact of the project.\n", "q0r": 4, "q1": "While the proposer did very well on the impact criteria, I have yet to see the same caliber for feasibility criteria. First, the budget requested is inconsistent in different parts of the proposal: at the beginning, they requested $250,000, then at the MVP roadmap, it was $500k, and further down the proposal, it was $50,000. Lacking a well-presented roadmap adds to the confusion. The MVP development plan roadmap is very high-level for the large budget ($500,000) requested. I would recommend the team to spend more effort breaking the MVP into details such as system design, acceptance criteria, user stories, wireframe, mock, etc, for the community members to assess the feasibility of the progress. I understand that this is a large scope project, at this initial stage, the team should probably ask for a smaller budget to build a whitepaper and prototype before asking for a big one without many supporting documents (there is a website but with no content). In addition, the risk section should be further considered. Currently, the risk section only has one sentence, which is overly simplified for a project of high budget and large scope. Some other risks you should consider are legal complexity (many African countries have unclear regulatory frameworks for crypto), dispute mechanism beyond community mediator (especially for a large amount of money), partnership challenges (mobile payment app partners, 3rd party KYC partners) and address those risks accordingly.\n", "q1r": 2, "q2": "I disagree that the project is auditable, mostly because it is not clear which phase of the project this particular proposal is addressing. I again strongly recommend the proposer to elaborate the roadmap, add in milestones by months and by functions (technical development, product development, business development)\n", "q2r": 2, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6291, "q0": "This proposal is about creating a 'peer-to-peer, decentralized marketplace and wallet' to facilitate secured crypto/fiat swaps and non-collateralized lending. The platform will utilize the 'Atala Prism' DID solutions to authenticate the new users of the platform. As this proposal is concerned with creating a product on Cardano, it is aligned with the Challenge statement. It will solve the problems of the unbanked in terms of crypto/fiat swap and lending and thus bring many people to the Cardano Ecosystem while offering services to them. \n\nThe proposer is eyeing the remittance market in Subsaharan Africa. Suppose the platform can solve the inherent problems in the field. In that case, it will provide value, provide banking facilities to the unbanked, and onboard the untouched chunk of the population to the Cardano Ecosystem.\n\nThe proposer did mention the three risks he may face in the execution of the proposal, lack of funding, marketing & Atala Prism release delay. But I feel the main risk the proposer will face from the regulatory bodies as the platform involves fiat/crypto swaps and fiat lending. Unfortunately, the proposer did not provide his ideas on how he will tackle the regulatory hurdles. This exclusion is one of the reasons why I rated it four stars. \n\nThe proposer is initially looking to provide solutions to the remittance market. Then he wants to scale the platform to include Small and Medium Enterprises by providing them with lending services. ", "q0r": 4, "q1": "The team consists of three individuals who have worked or currently working on other projects in Cardano Space. The proposer is the co-founder of Liqwid protocol; two other members worked on Ardana and World Mobile. However, the proposer did not provide the team's LinkedIn profile, but anybody can manually search on LinkedIn and find their qualification and experience details. Hence the team is capable of implementing the proposal.\n\nThe proposer provided step-by-step details on how the platform will work after the launch and how he will utilize the Atala Prism, a third-party biometric authentication service, stablecoin, and mobile money services in Africa. This reflects the proposer is clear about how the platform will operate on swaps.\n\nBut the proposer did not mention the details of how he will provide the non-collateralized lending. Moreover, the provided technical details of the plan on which the platform will be built are limited; only brief details are listed under the plan and timeline. \n\nThe proposer needs $500k to build the Minimum Viable Product. Since he does not need all the money now, he submitted the same proposal under three Challenges and asked for $350k in total. In this proposal, the proposer requested $250k; in 'DAOs<3 Cardano', he asked for $50k, and in Grow Africa Challenge, he asked for $50k. This makes sense from the point that he does not need all the money here and does not want to take a big chunk of the Challenge allocated amount. But I was expecting more details on how this $50k will be used in the proposal. It seems more appropriate to mention specific information or at least provide the facts of which stages of the development will be prioritized and allocated the total $350k.", "q1r": 4, "q2": "The proposer mentioned that to track the progress of the proposal; he will post the Development updates, keep the interested parties engaged on Social Media, and also by undergoing the audit. However, the proposer did not mention on which platform he will post the updates like GitHub or Jira. \n\nAs mentioned above, the proposer did not provide more details on the technical development; only brief details are stated. Therefore, I think this will be a hurdle for the auditors or interested people to track the progress. \n\nRegarding the budget, as I mentioned above, more specific details are required being the proposer is not asking for the total required amount of $500k in this fund 9. Instead, he asked for a fund of $350k in total, $250k here, and the remaining $100k in two other challenges. \nThe timeline and milestones are stated in detail. The total duration mentioned is 50 weeks, divided into five stages based on the tasks to be achieved in each stage. \n\nThe success metrics will be that a novel product will be built on Cardano under this proposal, bringing many users into the fold. Moreover, its use of the 'Atala Prism DID' solution in the protocol will pave the way for many others who wants to utilize the same solution in their products, and thus, more DApps and products coming to Cardano. As per the proposer evaluation, he considers success in onboarding 100k verified users in year 1 and 1 million verified users in year 2.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8111, "q0": "This is a fresh idea for the financial industry. Especially in the context of Blockchain technology increasingly developing and applied to life. This proposal meets the challenge and the size of the impact is relatively large. It creates a peer-to-peer, decentralized application (JUS) and mobile wallet that makes it easy for anyone to buy stablecoins. All that is needed is their facial biometrics, phone number, and mobile money payment method.\nThe proposed solution identifies most of the challenging problems and makes a sound argument. By giving specific examples and analyzing aspects of the problem in detail. The author also presented how JUS works and the target market that JUS targets is concentrated in Africa. JUS will be an out-of-the-box peer-to-peer platform that will attract many users and be an effective use case for the Cardano ecosystem. Although the proposer has raised risks, he has not stated specific solutions to minimize these risks when implementing the project.", "q0r": 4, "q1": "The project plan also states the work to be done and has a timeline. But for the better, I think this plan should present the work in more detail so that it is easier for the community to visualize. The team can provide a website link or a whitepaper of the project so that the community can learn more information. As far as I know, the project has a token issue (JUS DAO). So I want to learn more about tokennomics, listing time and token distribution table. I hope the team can add more information on this issue.\nThe presentation of the budget analysis of the proposal I found was not clear. This proposal asks for $250,000 but the budget analysis totals $500,000 and there is no allocation for $250,000. In addition, I saw the team saying that Fund 9 will apply for funding of $350,000 (this is the total amount of 3 different proposals) and $150,000 will apply for funding in the following Funds. Personally, this presentation is somewhat confusing. My suggestion is that the team should provide a separate budget analysis for each of the different proposals and only ask for the exact amount of that proposal. The more detailed and clearly explained the budget is, the more feasible the project will be.\nThe proponent should provide more complete and detailed information about the group members for the community to have a basis for evaluation. Specifically, it is a biography (experience, capacity, achievements if any....), a job assignment for this proposal and a link to a personal profile (Twitter, Linkedin, Disco... ) to verify identity.", "q1r": 3, "q2": "The proponent has described how to measure, but it is not detailed, or specific and there are no measurement indicators. For example, \"development update\", where is the update and what indicators should be taken care of? \"Audit\" is an audit of which part, who is the auditor? How to \"connect the community\"?...\nThe success of the project is described by the author by giving specific KPI numbers that are: 100k verified active users in year 1 and 1 million verified active users in year 2.", "q2r": 3, "assessor": "z_assessor_2956", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 8195, "q0": "\"The proposed solution has been well illustrated in the proposal. Cryptocurrency has increasingly adopted and financial inclusion is significant to developing the economy in general while 1.7 billion people remain unbanked. The team has used some fascinating statistics to back up, which enables the community to visualize the potential of the project. They also explained the definition of JUS, how it works, its benefits and target markets in a clear manner. By clarifying these aspects, the team will be able to focus their resources on the right goal, minimalize any derivatives that might happen. \nThe proposers have raised the problem faced by some countries and analyzed their competitors in this field. They have proven the remarkable features of their product by pointing out and addressing the drawbacks of other trading platforms in the same category. However, there is a need to have a better risk management plan. Instead of just mentioning the challenges, the team can work on how to solve them or minimalize the loss. For example, when it comes to marketing strategy execution, they can figure out what phase in the customer journey they are stucking on, thenceforth trigger proper campaigns. Another approach is how to promote the project, what channels are involved, how to access their target audience. By doing this, I believe the team can show their capability to run the project and facilitate the calling for capital process. \n\"", "q0r": 4, "q1": "\"The timeline and budget breakdown seem a bit vague to me. The team can work on more details at this section so that the community has a clearer base to access the feasibility of the project. For example, with “provide an order-book swap contract + JavaScript SDK”, the team can clarify “10 weeks” at which time (e.g from May 2022 to mid-June 2022), who will execute this task (e.g. IT department or certain members) and how $100k will be allocated for these activities. By including these information, the team will make their plan more specific, practical and feasible, which fundamentally supports the decision-making process of the community.\nThe information on the team member is not good enough for the assessment process. The community can’t know who they are, what kind of working experience they have or are they capable of running this project. I think the team can provide a summary of the team members’ positions, experiences, backgrounds here. It is better to have a team’s portfolio that can support the community in reviewing the potential of the team.\n\"", "q1r": 3, "q2": "Some of the indicators have been mentioned in the proposal. They also have a solid goal for each phase of operating the project (e.g. 100k verified active user in year 1). However, there is still room for improvement. Regarding the community engagement, how can they measure that? What metrics are used to identify the interactions between their platform and the community?(maybe through the transactions record). The team also ensures the development updates, but how they will do that? (by monthly reports or using a third party to keep track of the project). I believe such information and plans will significantly help the community in visualizing the project’s prospects and hasten the decision-making process. ", "q2r": 3, "assessor": "z_assessor_2966", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8430, "q0": "\" The cardano ecosystem challenges that ideas that help drive adoption. Yes, your group's proposal has done the right challenge, it seems that your group is trying to implement modern technologies of ways of buying and selling via stablecoins to economically disadvantaged inflation countries, even without a license. their own identification to access the banks in the most optimal way. In the future, your group's project is also promising, but reading your entire project I see that if In many countries with unstable economic inflation, the use of JUS has not been used by many people because they find that their life is difficult, how can they have excess money to exchange cryptocurrencies or buy stablecoins or even use money to buy a phone because even the country has a difficult time, even the electronic ATMs do not have, can be used to do those things. Your project is good because it solves the problems for people who want to access or use technology to buy or sell related to cryptocurrencies but it will be difficult for difficult countries. Presenting and presenting the figures we have read and are working on including your relevant experience I found that to write on such a large project involving the community and our cardano ecosystem Need more experienced people.\n   Your solution is quite complete in terms of examples and examples. You guys explain that JUS is a peer-to-peer, decentralized marketplace and mobile wallet that allows users to facilitate secure crypto/fiat swaps and collateral-free stablecoin lending. Built on top of Atala PRISM, JUS requires new users to verify and associate their biometrics with a DID which they can then use to initiate swap and referral requests to earn and build on-chain history and credit scores in a privacy-based manner. But to implement and put it into operation, it is also a process that users have to go through a relatively lengthy process and need modern things like phones with network access to basic applications. , as I said above, the impact is that for people with poor economics, it's difficult for them. Besides, you have solved your solution that if they are allowed to operate legally, centralized exchanges require a bank and basically you want to apply the messaging application. Simple societies like Telagem and Whatsapp have many disadvantages.\n   While looking for specific and detailed solutions and solutions, looking at the risks, I see that you have not shown us the important problem and the importance of implementing the problem. What risks will this project face because for any project there are big risks and risks spreading when they go into operation. Your only risk is \"\"Lack of funding, marketing strategy implementation and delay of public release date of Atala PRISM\"\" but you also can't tell us how to deal with that risk. ? What do you need to fix it?\"", "q0r": 3, "q1": "\"When a project is launched, we look at the process of implementing a specific timeline as well as the amount of money required by the investor as well as how the work is divided with the listed cost, I find that the How much do you divide the working time along with the corresponding amount? But I found that the amount you declared in detail along with the job is not valid with the amount you requested to be funded, I found that the amount of the bank you declared it was many times higher than the amount you requested. the money you are applying for. Are you confused here? Or do you mean that when it goes into operation, the cost will be enough? Can you help me with this problem?\n  Finally, when it comes to your working group, I only see you list the names of three people in your group, we can't find any basic information about the members of the group such as: the name of each expert has related, a detailed description of each person's professional profile, an explanation of how they are related to the blockchain as well as providing us with linkedlns where we can have proof of trust offer... in general we don't see any confidence in your team. It is concluded that the feasibility of the project here is low and needs to be supplemented to make the ideas clearer and more detailed.\"", "q1r": 3, "q2": "\" Finding out about your group's project comments, in the end, we were confused about the measurement indicators of the project and your group: \"\"Development Update - Audit - Connect Community and Users\"\" active\"\", but we can't see any other data. We want your group to give us an explanation as to how to know the project's objectives, to measure this project? It will be essential for the proponent to provide us and the cardano community with confirmation that the grand goal of this project has been achieved. Hope your group can complete the project so that it can be completed.\n   Being a new project still makes us vague about the success because the data that your group has given is not specific, it is a bit superficial for us to believe in the project completely. You have successfully outlined that: \"\"100k verified active users in year 1 and 1 million verified active users in year 2\"\", this needs further review and verification over time. if the idea goes to work.\"", "q2r": 3, "assessor": "z_assessor_2984", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9604, "q0": "This proposal effectively addresses the goals outlined in the challenge. It provides a solution for those unable to access banking systems to purchase stable coins through peer-to-peer transactions. This greatly helps people in developing countries avoid inflation and send remittances with lower fees. The adoption of DIDs also helps users build an on-chain history and credit score, leading to easier access to borrowing services in the future. In countries with high inflation, there are billion of people, predominantly women are undocumented and unbanked. If the project is successful, it could bring millions of new users to the Cardano ecosystem.", "q0r": 5, "q1": "The team is very experienced in implementing dApps on Cardano, one of them is the Co-Founder of the Liqwid project, one is the CTO of Ardana and the other is a full-stack developer at World Mobile. The budget has been broken down for each task, but I suggest the proposer needs to break it down further. For example, with $100k for providing an order book swap contract, the proposer should add information such as the number of programmers performing the work, how many hours each programmer works a week, and the pay rate of each programmer. Technically, I believe they can implement this proposal, but they have not specified how they reach their potential customers, what channels they use to communicate, how they can market products, and what marketing strategies they use to reach customers who have little understanding of blockchain and Cardano. Product marketing will be one of the challenges they will need to face for them to reach the stated target of 100k active users in the first year.", "q1r": 4, "q2": "This proposal outlined specific KPIs to determine the success of the project. More specifically, 100k verified active users in the first year and 1 million verified active users in the second year. The solution they came up with to solve the problem was also very easy to understand. They even describe how the dApp works when put into practice. But the measures they outlined have not been detailed. I would suggest the proposer to add more details about how they measure those measures and how the community can audit the proposal's progress by themself.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "JUS makes it easy for anyone to purchase stablecoin. All that's required is their facial biometrics, phone number and mobile money payment methods.", "experience": "\nTashoma Vilini: UI/UX Designer, Atala Prism Pioneer and Liqwid Co-Founder based in Senegal\nSiddi BarracK: Distributed Network Engineer Msc, Atala Prism Pioneer, Full Stack Dev @ World Mobile based in Senegal\nIsaac Shapira: Platonic Systems - Top Rated Plutus/Haskell Firm, Ardana.\n"}