{"id": 414213, "author": "danadak", "title": "Global Collaboration Platform", "url": "https://cardano.ideascale.com/a/dtd/414213-48088", "category": 26595, "amount": 57000, "description": "Our Catalyst community lacks the means to tap the enormous potential skills and experience in our global multilingual community. This limits our capacity for collaboration in solving our problems.", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"id": 2756, "q0": "The purpose of this proposal is to create a project, within that project is to bring together communities from many countries that come together, and interact and then come to an agreement to cooperate in developing potential ideas in the future. community, and the multi-national community support tool this proposal provides is: Natural Language AI Solutions. In general the same is consistent with the challenge problem required.\n\nThere are a lot of goals and features that are put in place to overcome the language barrier, and help developers with ideas to collaborate with the right audience in the community. For example: Collaborative platform for continuous community interaction, there are many integrations and features in the goals of the proposed proposal, there are also countless other arguments and benefits to be provided. the proposed group put forward a series of,\n* above is a brief summary of the proposals presented by the proposed team, with many more stated objectives,\n- although there are many features to attract the community, but that is not enough, still need a marketing plan, so the proposed team can analyze more specifically about the partner's marketing plan provide a little more, you know no matter how good your product is, it still takes marketing to have a high volume of users, the team that needs to pay more attention to this issue would be great.\n\nIn addition, the proposed group also points out solutions for the anticipated risks.", "q0r": 4, "q1": "The project implementation steps are meticulously planned by the proposed team, divided into many small steps for implementation, and have a set of 6 important steps to be easily audited. however, there are still some points that are a bit confusing to ask for a confirmation of my understanding, which is: is this proposal in stage one that the team has presented the footnote below?, and so on This project will be completed after 3 months including 6 steps as shown, please suggest the team to confirm again,\n\nalong with a table of spending for ideas implementation activities proposed by the team broken down into each goal for presentation, and with subtitles for how many dollars an hour, ensuring transparency, easy to understand,\n\nThe information about each member of this project is provided very fully and in detail by the group, but because your team's army is very large, if you can divide it into small groups or assign each position To each person, it would be better to be in charge of appropriate work areas according to experience.", "q1r": 4, "q2": "All work in the process is aggregated and committed to monthly report by the team on Github, but hey, the team recommends it! Does the team also need marketing, if so please refer to the video or documentary steps that could put them on social media sites for wider publicity, would that be neither of the two goals, one can satisfy the curiosity of the community about your progress, the other can promote your project to more people, you know,\n\nthe proposal clearly defines how success will benefit the community when it comes to setting short-term goals and long-term goals, I am envisioning the success of the proposal as people living in other countries can work together to build together, without any language barrier, wish the proposal team success.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 8243, "q0": "\"The proposal team has prepared very well about their tentative products. Information about the project includes its vision, features, goals , objectives. With the detailed explanation of the proposer, it is found out that the platform will bring benefits for all community members to work more effectively. \nThe outcomes of the project are clarified by the team, including all they want to achieve by the end of project. It is better to include both quantitative and qualitative data to confirm the feasibility of the project. \nIn addition, it will be insufficient if there is no mention of how the platform influence to the Cardano network ass well as ADA usage. \nRisks were clarified by the proposer with some tentative idea to solve it. It supports the team to take more initiatives if risks happen and mitigate the affection\n\"", "q0r": 4, "q1": "\"The proposer shared the whole roadmap of this platform development, in which stages will be last within 3 Fund round. In which, in Round 9, focusing mostly to Stage 1 within 3 months. Team already clarifies all steps which they will do in Stage 1, however, it is suggested to include how they are going to do and tentative duration or timing of each step. \nBudget was allocated with the conversion all steps to labor on hourly rate. The itemize is quite clear, including both tentative duration for each work, and how long will it take. The way of calculation is applied in such a creative way to make all stakeholders understand easily. \nTeam was created with experienced people in DAO and cooperation online, developers as main team, consultants and partners…. The strategy of team combination is relevant to the development of the platform. \n\"", "q1r": 4, "q2": "\"The proposer already mentioned what will be their aims when conducting this stage. Project tracking will base on the monthly report of team, and products of several activities such as documentations… Qualitative data of checking is very clear, by the way, it would be better to add quantitative data more. \nThe success of the project is clarified as the completion of stage 1 in which the first-generation platform is launched. It is compatible with the roadmap set and metrics for the first challenge. It is a part of the whole product.\nThe project is the new one in Catalyst in this round, with the intention of team to apply for next round funding.\n\n\"", "q2r": 4, "assessor": "z_assessor_2969", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10005, "q0": "The problem is that the exchange of skills and experiences in the Catalyst community is facing language barriers, the solution to the problem is to build a platform to create interaction with the Catalyst community in the world. The proposal to identify the problem in the challenge that needs to be solved is in line with the challenge presented. The language barrier separates the activities of members of the Catalyst community around the world, which greatly affects the Cardano ecosystem. The proposal is the right solution for the Cardano community to come together. The implementation of the project will have AI Solutions in natural language, really great with AI the translation and definition suitable for the native languages will help the best interaction. Building a Collaborative Platform in the Cardano community achieves many of the same goals as the proposal stated. Creating knowledge exchange cooperation and also competition in accordance with this is in line with Cardano's development. The implementation solution of the proposal has very clear objectives, implementing the installation of the appropriate software: HYPEinnovation, IdeaNote, Concept, SDKs thereby performing an evaluation of language concepts. Integrating Miro, Audio, Video, Messaging helps to make language communication. The proposal implemented will have a tremendous impact on the Cardano ecosystem, where people are exchanged easily without being deterred by language. The implementation solution of the proposal depends quite a lot on external software, worrying about the risk of compatibility with the Cardano platform. The author has taken measures to minimize the risks because by applying open source tools this is reasonable. Establishing relationships with partners who jointly support the development of DAO platforms will make it easier to implement the proposal. I have an opinion on the need to identify the risks posed by the fluctuating ADA that affects the amount offered to not be sufficient to implement the proposal. To solve this problem, the author needs to reserve some money in case of risk.\nRating: 5\n", "q0r": 5, "q1": "The plan is described in detail, how to implement it in accordance with the expected details that have been given in the solution section. The proposal is the first phase of the project, the implementation in the first 3 months can affect an entire project implementation process. The author planned to lay a solid foundation from the first step, the implementation of the selection of the planned interactive communities. The content of the work given is logical from the time of implementation until the test product is available. Implementing community-interactive UX building is built through 6 important steps, each of which is specific tasks. Installing and integrating software on the Cardano platform is made, HYPE, SDK and Miro tools, Spacial chat etc. will be integrated. The planned community building makes up catalyst town, community conferences. The plan needs to be more detailed for sampling from Rats DAO, ADAO, Snapbrillia and the purpose of use. In addition, the timetable for implementing the proposed plan in 3 months requires a specific time for the work to be completed, helping the manager understand the work is being done on schedule. The proposal has identified the number of people implementing the 12-member project. Implementation members have clear information that indicates that they are capable of completing the intended plan. In addition, the proposal also adds members to make connections between the hemispheres, in collaboration with Cardano communities to implement the project successfully. The total required budget is $57,000 allocated and spent on jobs in a reasonable manner, and the salary per hour of labor is $50. The budget table shows that the performance of the work is calculated according to the hours of active labor, there are reasonable calculations for the installation, configuration, integration of tools, the community connection takes place in 6 weeks with 220 hours i.e. spent $ 11000. It's easy to see how much money is being spent in the right way as planned.\nI rated: 4\n", "q1r": 4, "q2": "The plan is implemented with a 3-month roadmap that can identify indicators/KPIs that demonstrate the success of the proposal. The tools installed on the platform, miro & video have been integrated, have had the first interactions with the test product. The proposal is part of a project that has long-term success for connecting Catalyst communities together. In order to audit the implementation of the plan, the author committed to monthly reports submitted via GitHub, clear research data. Community connections are recorded, videos of research are presented. We can see that the proposal is going according to the plan and the success of the project.\nRating: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11437, "q0": "The proposer would like to create a Collaboration Platform for effective community communication and engagement between individuals, communities without language barrier . In my opinion, this platform would help maximize our ability to work and solve problems in groups together. Besides, this project will partner with HYPE Innovation and employ Natural Language AI Solution,.. for better platform solution. I think, this project is good and will encourage better connection between individuals, communities in a organized way.  ", "q0r": 4, "q1": "The proposer plans to start this project on Q3 2022, independent from Catalyst funding, and has one-year success vision of the project. The proposer makes a list of 6 steps for carrying out this project, but doesn't clearly shows how long does it takes for each step, and what exactly the main task for each step? Will each task be done daily, or weekly? For the budget part, I think the proposer do it better for showing the details of each job and the total hours, the number of people needed which I think is okay. I'm impressed with the team members, they are talented and has many years of experiences with Linkedin link for community checking. I think, this team is qualified to carry out the job. In short, I think this proposal is still at the idea stage, it might better if there are some proof of work. In short, I think, the feasibility part is okay, but some parts need to be more detailed. ", "q1r": 4, "q2": "As I know, community could check Github product code and monthly report on the development of the project. Besides, the proposer said they will report fully back to the community in open source Gitbook form including: project progress, weekly team standup and sprint meetings, tracking progress using Kanban and Agile-Sprint methodology, open-source products, interviews with community members, documents of new techniques, reports of effectiveness of techniques, testimonials from community members. I think this part is okay, but I would like the proposer to clearly tell more about their quantitative goals of the project such as their KPIs for reaching communities like how many numbers of users, communities use their platform, how many members joining their platform,..I think this would help them to have a clear picture of where their project stands. ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14570, "q0": "I think this proposal will affect the Cardano ecosystem. First, the team's proposal describes in great detail the functionality and features of the collaboration platform. The ultimate goal of the project is to create an online environment that can coordinate countless individuals around collaborative projects. In addition, the project details include five tasks to complete: building a Collaboration Platform, Collaborative Data Platform, AI Sentiment Analysis, Interactive Network Visualization, and Collaboration Model. . This project gives consistent and synchronized results with KPI/Key metrics of challenges, especially after communication, this collaborative platform will provide a generation of Social Media and Social Interaction new association to establish Working Relationships among members around the globe. Faced with risks, due to their dependence on external software, the team provides mitigation solutions that are quite reasonable with their existing conditions.", "q0r": 5, "q1": "I appreciate the feasibility of this proposal. The team provides a detailed plan of the timeline and milestones. The team's plan is to start the collaborative work in the third quarter of 2022, they set goals for work to be done and products to be completed. In terms of budget, the team gives the total estimated budget and necessary costs for personnel and assets hourly. The group has many famous figures in the industry with many years of working experience such as Dan Kimball; Michael Avis; Alex Thayer; Harsha Gullapalli; Dennis Rivers; Sheida Mirahsani; Peter Wolcott; Mike Brunt; M Whisperer; Scott Luxor; Dr. Gene Bazan; Jerome Kelsey; Jerome Hartigan and software partner - HYPE Innovation, a world-class innovation platform company. This can be said that the team invests a lot of time researching the project to develop the Cardano ecosystem.", "q1r": 5, "q2": "In terms of auditability, the team provides a lot of quantitative indicators and methods to track these quantitative indicators, besides they also make weekly project progress reports. This makes it easier for everyone to see the neatness in working style and easily track the progress of the project. In addition, they also provide criteria to evaluate success from short-term success to long-term success. Overall, the project is consistent GOAL 9: Good cooperation in Blockchain projects will lead to all aspects of the GOAL in the Sustainable Development Goals (SDG) Rating.", "q2r": 5, "assessor": "z_assessor_4073", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "To install & evolve existing proven collaborative tools into a platform designed to catalyze interactive project creation and leverage our community’s extraordinary knowledge, & skills.", "experience": "Dan Kimball: 40yr Tech Entrepreneur, ConceptNet Development. \nCoFounder of FreeDAO.io & Freeos.io \nAlex Thayer: 7yrs Full Stack Java Dev- HYPE Innovation Dev-Team,\nMultinational Collaboration Platform Design\nMichael Avis: 15yrs Director of HYPE Innovation Business Development"}