{"id": 414255, "author": "benmahmoudoussama", "title": "PeakChain Uber on Cardano", "url": "https://cardano.ideascale.com/a/dtd/414255-48088", "category": 26595, "amount": 294000, "description": "Ridesharing apps, such as Uber, are exploding in popularity worldwide, being used by millions of people. Still, the data sent from all apps is still controlled by centralized institutes.", "f6_no_assessments": 11, "f6_rating": 4.424242424242425, "videos": [], "media": [], "f6_assessments": [{"id": 1177, "q0": "The concept behind the suggested solution is to create a Cardano car-sharing service similar to Uber but on the blockchain, guaranteeing customer privacy and security while also being completely controlled. With that said, we can see that the approach fits the challenge's purpose and is inventive in suggesting a solution that best satisfies the demands of society over the long run. If the initiative is a success, it will be a trailblazer in using the cardano blockchain to run the auto sector specifically and the transportation sector generally. Because Germany has a robust auto sector, we believe that the project's decision to use the German market as a pilot is rather reasonable. It fits with a capital of 294.000.It is appropriate for the team's size and functioning.", "q0r": 5, "q1": "\"Project members are clearly announced functions as well as responsibilities . Listed with professional experience as well as specific linkedin, all team members live and work in Germany, so communication and working with each other is very convenient. Everyone has a specialty and is working for reputable organizations. On the project, each person is assigned a clear task to perform.\nThere is a spreadsheet provided that clearly shows the cost of each stage and is very transparent . Financial transparency is what investors will see first and believe in the success of the project.\nIn general, I find the project to have a great possibility of success with the efforts and efforts of the team members.", "q1r": 5, "q2": "\"Using the Agile software development methodology, the team tracked the project development progress, with a particular focus on Scrum to increase transparency and auditability of the project progress status.\nDefining clear goals with a successful roadmap for the first product within a certain period of time, I trust the project once again to congratulate the development team members for their time and product quality investment. Products.", "q2r": 5, "assessor": "z_assessor_2216", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1190, "q0": "The \"ride sharing and hailing apps\" service is quite popular in most countries. This service is convenient and reasonably priced, so it is popular in many places. I am also a regular customer of this service.\nThis proposal team would like to propose the development of such an application, but they will develop on the cardano decentralized platform. The biggest advantage of the cardano platform for this application is security. Customer information will be better secured than centralized platforms.\nThe next advantage, in my opinion, is that this application can be replicated not only in Germany (where they implement the proposal) but also in every country that is familiar with this service.\nMany years of professional experience in the car industry is also what makes me like this project.", "q0r": 5, "q1": "They have a build plan through February 2023 in place of the FEASIBILITY presentation: https://docs.google.com/spreadsheets/d/1_DSXCxeZezbaVTHWHENLTH7nxqfrzNVf/edit#gid=1303540346\nI consulted this content and found that they have a detailed, clear and easy planning method to track progress. This is encouraging.\nRegarding the funding application budget, they also detail each job, who is in charge, and the amount required for each job.\nAbout the personnel, this is the part that impressed me the most, because they are a working group in a car company in Germany. Each of them has a clear linkedin profile, and has many years of relevant experience. This is the factor I highly appreciate showing their ability to implement this project.", "q1r": 4, "q2": "They will use Agile Software Development methods to report work and progress. As I understand it, Agile software development - also referred to simply as Agile -- is a type of development methodology that anticipates the need for flexibility and applies a level of pragmatism to the delivery of the finished product. Agile software development requires a cultural shift in many companies because it focuses on the clean delivery of individual pieces or parts of the software and not on the entire application.\nAccording to this method, they need to change the way they manage their work, work progress, combined with both development and research to make the product match reality. They will successfully deliver within three months the first product increment. This is very encouraging.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2392, "q0": "According to the ideas presented about this project, we were able to define that its objective is well aligned with the goals proposed by the challenge. Furthermore, we have here an example of the use of blockchain technology to innovate in a segment that has a wide popular reach and that already suffers from problems arising from centralized technology. In this way, an eventual success of this proposal would help to bring great visibility to the Cardano ecosystem, in addition to building a product that obtains great advantages from the web3. We have that the budget being requested is quite considerable, however, the team behind the project has an impressive experience, with countless years of experience in this segment. This is a proposal with lofty goals, but which, if successful, could be one of those that raise public awareness of Cardano's usefulness and possibilities.", "q0r": 5, "q1": "We observe that one of the factors necessary for this project to be viable in the long term is considerable popular adoption. At first, we can imagine that this is not so simple, as it is a technology not yet well known. But one of the strengths of this project would be the possibility for users to give their opinion on the application's regulation, which can provide lower fees for its use, increasing its adoption. Despite the innovative idea, the main advantage of this project seems to be the human material. The team proves to be highly competent, having excellent technical requirements in the area of ​​technology, but also having experience in other very important spheres such as accounting and administration. There is even a very well-structured website where you can find the curriculum of all the professionals involved. We were able to perceive a high degree of detail in the explanation of various stages of the project, including separate spreadsheets to demonstrate greater clarity. Regarding this, we have that the feasibility plan is very detailed, explaining several steps that will be carried out throughout the project, and which are not restricted to software development. Regarding the budget breakdown, we also find a well-distributed division of expenses. It also seems valid to mention that some higher expenses seem to be related to the place (Germany) where the professionals are.", "q1r": 5, "q2": "As this project has a strong technological bias, it is to be expected that the stated ways to follow the development of the proposal would also belong to this sphere. And in this context, we noticed the presence of several technical parameters to track the evolution of the project, such as analysis of user stories and use of agile development methodology, including these are some of the most used practices to monitor software development. It is also interesting to note the indication of tools that will be used in this process, such as JIRA. All the excellent organization of the proposal during its development and also in relation to the parameters previously mentioned made the perception of success could be easily defined. And we perceive this good definition through the mentioned delivery times and acceptance criteria.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3422, "q0": "Proposer presents a very true problem statement, regarding the feed and the centralized model car sharing apps have nowadays, which is present in our daily lives, and experess its solution in a very articulated way, saying how the Dapp will resolve the issues in 5 ellaborated topics. It's also good that this product will be built in a phased way, first developing Cardano native token and then, only after expanding its costumer base, it wll be developed the full Tokenomics. Risk management is also well done, with 3 challenges identified and properly mitiagated. Proposal is also well aligned with challenge as a new product using Cardano blockchain will be developed (challenge kpi of \"Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases\").\nAs for the value of the solution itself, having a ride-sharing solution that uses a decetrilized data model, can indeed improve users security (one of the main concerns today in centralzied models), make its user safer and even lower costs, making it potentially available to a broader audience.", "q0r": 5, "q1": "For the feasitiblity section, na online spreadsheet is provided. There's a detailed timeline in place, with a series of good activities and their duration distribuited in the weeks until 2023. There's also a product backlog avaliable with the main develiverables/features in the final product and their acceptance criteria. This is imporant for the agile approach they will adopt in this project.\nThe budget breakdown is done by the amount of monthly work each team member will execute, with each month well detailed, which matches the plan. For the exetanal resources, the hourly rate is provided.\nRegarding the team, there are 6 people committed, from peakchain, with experience in project management, software development, Quality, PMO, and eletronic engineering. All this capabilities combined seems to make this project feasible. there are also linkedin links provided, good description on each team member background and their roles, which makes this part very complete. In general, PeakChain has industrial experience in this type of project and should be able to succesfully execute it.", "q1r": 5, "q2": "As already said, this project will be developed using na agile framework. This makes it very easy to communicate (and audit) this project, and propsoer leverages this well. The progress and backlog will me shared in a Scrum board format using an online tool, so anyone can access it. Sprint Reports will also be made available, witth the user stories developed (available in product backlog in the spreadsheet) and kpis (I just wonder what kpis they  would be, which could be clearer here).", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 4244, "q0": "Ride sharing is the activity of transporting other travelers by a private individual who provides a ride with their own car.\nIn recent years this type of services have exploded in popularity, just think that Uber since its founding in 2009 has steadily increased the number of active users reaching a peak of 111 million users in Q4 2019 with more than 13.51 billion dollars in bookings. (https://www.affde.com/it/uber-users.html). The problem with current ridesharing solutions is that they are centralized, which poses a greater risk to data security and privacy. When you use centralized applications such as Uber your sensitive data is recorded in centralized servers and could be misused by the service provider. Information such as your workplace, commercial destinations, number of trips, residence transform companies like Uber into real \"data-mines\". It is therefore not surprising that users were concerned when uber was hacked in October 2016 and the data of over 57 million passenger and driver accounts were stolen. (Https://nypost.com/2017/11/21/uber-paid -100k-ransom-after-57m-accounts-were-hacked /? Utm_source = maropost & utm_medium = email & utm_campaign = nypevening & utm_content = 20171121 & mpweb = 755-5128328-719508838 /). Centralized management also involves higher costs than decentralized governance systems, which translates into higher commissions for the user, who has no decision-making power on the application of any changes to the rules (eg change rates).\nThe proposal aims to solve these problems by creating a completely decentralized ridesharing application, which uses the Cardano blockchain to save data in a private and secure way, thus involving users in corporate governance systems thanks to a native Cardano token, they will then be able to propose improvements that will be implemented only after a vote by the community.\nGiven the size of the ride sharing market and the growth prospects for the coming years, the advantage for the Cardano network is evident.\nThe proposal therefore wants to create a decentralized application that acts as a valid alternative to the current centralized ride sharing services such as Uber, for this reason it responds to the objectives of the challenge.", "q0r": 5, "q1": "The proposal aims to create a decentralized ridesharing platform to solve the problems of privacy, security, high commissions and lack of decision-making power on the part of the user typical of centralized services. However, the platform that will be created is not a complete solution from the point of view of decentralization, it is an MVP (minimum functional product), therefore the data collected by the CAN-bus (which can be imagined as the nervous system of the vehicle that collects all the information of the various vehicle components) will be sent to the Peakchain server in raw format. The server will decode the data by retrieving useful information such as speed and will send a transition which, once confirmed by the user, will allow the data to be saved securely and permanently on the Cardano blockchain. Since the vehicle data passes through the Peakchain server, the proposed solution still presents a problem related to the possible interference or abuse of the data, for this reason the next step in the development will be the integration with a hardware device that will allow the decoding of the data to locally before running a full cardan node without the need for centralized servers in between. The proposal for the construction of this device was presented by Peakchain within this fund (https://cardano.ideascale.com/c/idea/414249) together with other proposals in this fund.\nThe proposer stresses the independence between the proposals however, for the reasons indicated above, to have a truly decentralized solution a future integration with the hardware device will be necessary, without this device the proposal only partially solves the problems of the current centralized clients (lack governance, high commissions).\nThe proposer provides the linkedin references of the team members, who live and work in germany at a duly registered software development company and GmbH (https://www.unternehmensregister.de/ureg/result.html;jsessionid=E1F379FD0E14C05649CD0444BC13B884.web01 -1) and ISTQB certified (international standard certification of software testing skills).\nTeam members possess the necessary Cardano development elements and have deep-rooted experience in the automotive industry.\nThe budget is divided into identifiable items, however external profiles are indicated for the following roles 2 Ext BE Developer and UI / UX Designer (65 $ hourly / rate) but precise references are not provided. The salaries required for team members are .. above average but still in line with the salaries received in Germany.\nExt BE Developer is quoted an average salary of $ 70 now for a total of $ 22,400 per month. 22400/70 = 320 hours, considering working days of 8 hours are 320/8 = 40 days. With a monthly wage of $ 22,400 and an 8-hour workday, the hourly wage is about $ 100 now, not $ 70.\nUI / UX Designer ($ 65 hourly / rate) (check hourly cost online) for a total of $ 10400 per month.\n10400/65 = 160 hours, considering working days of 8 hours are 160/8 = 20 days which is reasonable.\nA critical aspect is the fact that team members are found to be engaged in the same weeks on different projects in this fund, which risks creating a work overload if all proposals are funded. In this regard, the proponent reports that as a consulting / software development company they would have no problems in finding the necessary staff.\nThe proposal provides a detailed implementation plan and defines precise acceptance criteria as well as a defined time frame (6 months for the first product increase). Agile software development methods will be used, with a focus on scrum in order to reduce time-to-market without compromising the quality that will be guaranteed by the use of the ISTQB standard.", "q1r": 3, "q2": "The proposer defines precise acceptance criteria to measure the success of the proposal. To allow the community to keep track of progress he plans to create a scrum board in the atalassian JIRA tool as well as the product backlog, including planned activities in user history. Furthermore, after the sprint review meeting, a sprint report will be created with the relevant KPIs and user stories created", "q2r": 5, "assessor": "z_assessor_2531", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8565, "q0": "This proposal is a fantastic idea that satisfies the objectives of the challenge. Not only is the issue statement clear and transparent, the solution addressing it leaves no room for imagination. Very well-structured, and intriguing proposal, I must say. According to the author of this, the proposal aims to develop a Cardano ride sharing and hailing solution, guaranteeing privacy and security in the services provided, as well as being fully governed by users of the platform, which is, in other words, a market size of Ridesharing/ridehailing like uber. Both the problem and the solution are relevant to me. For further improvement, the proposers can consider adding extra information to clarify the part where they state: there is expected to be significantly increased demand in the number of Cardano Wallets and transactions, as well as the demand for ADA. Why do they assume a growth in the number of ridesharing users would lead to the aforementioned statement, since I feel there are other options outside Cardano Wallets? What does the team aim to do to persuade consumers to use Cardano wallets?", "q0r": 4, "q1": "The core team's competence includes a wide variety of talents such as frontend development, connected car hardware components and integration, software quality assurance, and so on. This collection of competencies demonstrates a wide awareness of what is required to develop and maintain this project effectively. It is also beneficial that the proposal already included links to additional evidence of expertise for each team member, such as a LinkedIn page. The team's significant effort in presenting the defined timeline with logical milestones impressed me. They undoubtedly provide a reasonable timeframe for completion of the task. According to my understanding, the project runs from September 2022 to February 2023, displaying what tasks are carried out on a weekly and monthly basis. Furthermore, the budget leaves nothing to be desired and allows voters to easily comprehend how the proposer reached the exact number. Each role's monthly rate is indicated, as well as the overall payout for each month. If there is something I can advise, I will suggest that the team mention an hourly pay, as well as how many hours the team members work each week or month. To summarize, Given the experience and strategy outlined, the idea is almost certain to be implemented effectively.", "q1r": 4, "q2": "The proposal includes a detailed timeline, tasks, budget, deadlines, and deliverables. The issue at hand and the solution are inextricably linked. To measure progress, the team use Agile Software Development methods as well as other reliable techniques. Unfortunately, the key metrics are ambiguous, and no KPIs have been identified. I understand this since such initiatives are difficult to measure while they are in the process. Also, it would be beneficial to provide a monthly project status report with the community, preferably through a platform or channel that everyone can easily access. Nonetheless, this is a very auditable proposal; it is sufficient that such monitoring be implemented.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9291, "q0": "\"I agree with the proposed solution to the problem you have given is to develop a Cardano ride-hailing and sharing solution. Because I also see the potential of blockchain technology. Essentially, blockchain is a technology that helps create a single, reliable record of data for a system or network of many devices. Most importantly, blockchain networks are not owned or operated by anyone individually, but by the entire network. Vehicle owners, service providers and car manufacturers are the three central actors in the transportation services ecosystem. Applications of blockchain technology directly impact all three of these actors.\nIf a vehicle is the hardware foundation for transportation services, blockchain technology is a software candidate that could make these services possible. Blockchain will ensure the accuracy of the underlying data, help make transactions and automatic payments secure, with few errors (my opinion and in your suggestions are the same) In Your proposal has clearly analyzed the limitations of current centralized solutions. You also give specific challenges and strategies to reduce risks in detail. This is a proposal that requires a lot of investment to be able to implement in practice.\"", "q0r": 5, "q1": "When I followed the link of the recommender and went to the googledrive you provided I got a good impression of your detail. I think I give it a high score on feasibility, I believe you have shown people the ability to work in a good team. With this project to develop, it requires a large team of people and good experience, I see that you all have enough. But why does a member have an access link but a member does not? I wonder about this. I think you should sync the same.", "q1r": 4, "q2": "\"I found that the team identified specific progress measures detailed in the proposal and the success of the proposal also. However with the proposal after the Sprint Review meeting, a Sprint Report will be generated, including the relevant KPIs so where are the KPIs? You should indicate the expected KPI so that everyone can see and imagine the success of the project. Please note that I cannot access this website (https://medium.com/peakchain)\nto view your project summary.\"", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Hi, thanks a lot for you valuable assessment and comments!\n\n1- The link https://medium.com/peakchain should work. Maybe you have a trouble accessing medium. Please check hat again.\n\n2- Regarding this point, please i need more clarification:\n\"I see that you all have enough. But why does a member have an access link but a member does not? I wonder about this. I think you should sync the same.\"\nI appreciate a lot if you can reach so i can get your point. Thanks in advance.\n\n3- As a scrum project, your most valuable KPI is the number of done stories (requirements) within your time plan.\n"}, {"id": 9476, "q0": "For providing thorough market research that demonstrates the level of volume that could flow into the Cardano ecosystem but falling short in providing compelling reason for users/drivers to adopt this platform, I end up giving this section a 3. I think it’s worth prefacing this review by acknowledging that I think this is a rather good proposal (better than most) but it must get judged with a more extreme level of scrutiny with the $294k price tag (not including the other two proposals for PeakChain priced at $85k each). The high price tag poses a tremendously higher risk at the point where these funds could otherwise provide for 10-14 other Catalyst proposals with more average requested funds. With that, I think this proposal needs to stress the problem statement much more because the current layout does not compel me to believe that the issues centralized alternatives pose a major need for this type of platform. I think that the brief market statistics about the trajectory of the industry is great because it quantifies how much money could be shared with the Cardano ecosystem through this platform. The proposal just has to convince me that they could create a product that is significantly different/competitive enough to reasonably capture some of the market share. There needs to be strong appeals to reasons why both drivers and users will switch to this platform based on factors that THEY care about. In the gig-economy world, you don’t have a product without only one or the other participating. Generally, in this section I think it’s missing an element of urgency that demonstrates very obvious appeal and need for an innovative alternative. \n", "q0r": 3, "q1": "For displaying a stacked team with loads of relevant expertise and experience I rate this section a 4. This section is like a Tesla Model S Plaid, in that it’s a very unique car that proves to be capable of very high levels of performance but has a few rough features that we really shouldn’t have to deal with for such an expensive price tag. I highly recommend developing a simple and concise roadmap and budget that can be put directly into the proposal as voters will not want to click links to navigate through business documents and trackers. The good news is that this proposal is not outright wasting the requested funds on overly exorbitant salaries and overpriced equipment (though the pay rates are very clearly on the higher end of industry standards). The budget breaks down month by month payments that are within fair compensation for the type of work being done. It may be concerning to voters that the proposers are asking for $460k (cumulative) and states that they plan on returning for more funding, so I would advice providing some greater justification about keeping up with competitors or wanting to avoid reaching out to large investors. I think voters would appreciate feeling like funding is not being taken for granted. The roadmap is a little less clear, which should be simplified and packaged for any average voter to be able to understand it, but there’s enough to clearly understand that there is a plan. ", "q1r": 4, "q2": "For providing minimal KPIs with actual metrics for an objectively measurable success criteria, I end up ranking this section a 3. This section suffers from similar issues as the previous section where it creates work for voters, rather than simply/concisely displaying for ease of use. Still, as a auditibility section it produces a common practice of only listing product completion as the standard for success of the proposal. However, in a world where a completed product is accomplished but does not see any interaction beyond the directly involved parties, the proposal makes no actual impact on the world. It is for this reason that a proposal must provide additional metrics in areas like social media following, social media engagement, website traffic, devices accessing the app, satisfaction ratings, volume traded on the platform and a wide variety of metrics that shows the voters that this team has an objective definition of success. It’s one thing to identify different categories that are intended to monitor and measure, but it’s another thing entirely to set targets for what levels of adoption/usage the team wants to see at different timeframes/milestones in the life of the project. This creates the perception for voters that they are committed to specific levels of performance and that they know when there is a need to adjust operations to improve. I’m neutral here because I think voters deserve more for this amount of money. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "Hi, thanks for valuable assessment. But please allow me to disagree with you in some points.\n\n1- \"falling short in providing compelling reason for users/drivers to adopt this platform\" : Some of the Goals of the blockchain technology is ensure data privacy, security and decentralized governance compared to centralized solutions, where user data could be tracked or manipulated.\nIs this not a sufficient reason to adopt such a platform?\nIf no, we do not need blockchain at all for our real life use cases.\n\n2- \"The high price tag poses a tremendously higher risk at the point where these funds could otherwise provide for 10-14 other Catalyst proposals with more average requested funds\"\nI think the judgement on the budget should be done based on the effort and cost for building such platform and the features delivered. I think goal of catalyst is not delivering a big quantity of projects, but should rather focusing on quality projects with real impact and real life use case. \n\n3- Regarding the KPIs, our project is a scrum project, that means our KPIs will be the implementation of our stories (Requirements) with the acceptance criteria that we have set. Please keep in mind that this solution is an MVP, that means it is not the final commercialized solution that will generate big traffic. In the next iterations we will finalize the complete ready for market solution.\n\n\n\n"}, {"id": 11439, "q0": "The proposer aim to develop a ride sharing and hailing solution, like Uber, but on Cardano decentralized blockchain. If executed successfully, this platform could overcome the drawbacks of the current centralized solution in term of privacy issues, security, high fees, governance. Moreover, this mobility sector is very promising and profitable and expect to increase in the number of users, and the user base is over the world. Therefore, it is expected to significantly increase demand for Cardano Wallets and transaction, as well as Cardano native token (used to pay fees) will create this huge demand for ADA which boost the adoption of Cardano. A good point is that the proposer clearly determine some main risks in delivering this project and give out a very good strategy to mitigate these risks. I would like to give this idea a full mark. ", "q0r": 5, "q1": "The feasiability of this project is very high. The roadmap is built from September 2022 to Frebuary 2023, and they detail the tasks need to be carried out to complete this Peakchain Uber project. Moreover, detail of how many weeks are needed for each task also be provided in the Spreadsheet which is very clear and easy to follow. For finance part, fixed salary is paid for full-time position and for external profiles will be paid $70 hourly rate. Besides, I know their position, who will be in charge of what position and their required monthly rate (USD) which I found reasonable for job requiring deep technical understanding. My concern is that this team members are also in charge of delivering other related proposal in Fund9, which also requires a lot of works; will they be able to do this large amount of work in time? About the team, they have a very good team members with years of experience in related position which convinces me to believe in the succeess of this project. Detailed profiles are provided with Linkedin link for community checking. Therefore, I fully support and believe in the success of this project. ", "q1r": 4, "q2": "To track the project development, Agile Software Development methods will be used, with focus on Scrum to increase the transparency and auditability of the project and accelerate the progress pace which I found very suitable for manage big project. Also, they have clear acceptance criteria for each deliverable. I think, though this proposal has all the neccessary and basic project foundation in term of website, blog, twitter and Linkedin,.., but my suggesstion is that I would like the proposer to tell a little more about this auditability part for increased community engagement in project, better contact and feedback between project and community. After all, it is absolutely possible to monitor this project progress. ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Hi, thanks for your valuable assessment.\nHere are some clarifications about some of the points you mentioned:\n- If all projects will be funded, we will recruit contractual external employees with the same degree of expertise. As a software development consulting company, we have the experience to do manage that.\n- Regarding Auditability, we will inform Cardano community with the actual state of implementation of our project progress.\n\nIf you have more questions, you can reach out to my social media accounts. Happy to further clarify any questions.\n\n"}, {"id": 12742, "q0": "The proposal wants to create a decentralized alternative for uber as a ridesharing solution. The relevance of the field in obvious. The market of ridesharing is big and a great chance for Cardano to position itself. The current systems are centralized, not that safe, have high fees and are governed by a corporation. The suggested proposal addresses these shortcomings from the current market and creates a better product by solving these problems.\nIn conclusion the proposal creates a new better product into a currently big and growing market and creates a new real world usecase for the Cardano blockchain. Therefore this proposal clearly matches the challenge criteria. ", "q0r": 5, "q1": "The team clearly described their experience and skills ad they have linked their LinkedIn to proof their CV. Overall they seem competent and able to fulfill the implementation. \nThe budget is clear. The monthly pay seems relatively reasonable for their experience. \nThe timeplan is clearly stated in excel. It is fully comprehensible, easy to read and in total it makes sense. They will use scrum methods for project management. \nIt´s important for me to note that they will come back to catalyst for additional funding for further implementations and they have other proposals running which directly influence the usability of this proposal. As from them stated in the proposal they want to create a hardware that can be used to make the data collection and decentralization easier. \nOverall it makes sense, the team is competent and the budget is reasonable. Therefore I strongly agree that they are able to implement the proposal. ", "q1r": 5, "q2": "The project management is clearly described and they have made many acceptance criterias for each step of the progress. \nThe team will create reports to further increase the transparency.\nThe success metric is more project centered and not vision centered. They have many metrics to measure the progress and the usability of the dApp. It would have been nice to see what you think about how the project changes the carsharing industry to solve the stated problem in the end but it´s clear from the context of the proposal. In conclusion I think it´s easy to audit because there are many metrics and the report higher their transparency. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 14717, "q0": "\"Thanks to the development of smartphones and Internet, the ridesharing services industry is huge. I agree with the proposers that current ridesharing services have some major disadvantages: privacy issues, security, high fees, governance/centralization. Therefore, the demand for decentralized ridesharing is urgent. \nThe Cardano (ADA) will be used to pay for ridesharing. Thus, a large number of users will join the Cardano ecosystem, boosting the users of Cardano. From this perspective, the solution is well aligned with the challenge setting. \nIn terms of the risks, the proposers addressed well and gave logical solutions. \nHowever, until the end of this part, I still do not understand how the proposers incorporate blockchain technology into Uber platform; and with this technology, how do the users and riders perform on this application? It would be clearer for non-tech person like me if the proposers explain further what “decentralized ridesharing” means.\n\"", "q0r": 4, "q1": "\"The project timeline was illustrated by the Gantt chart. The tasks were listed out quite clearly. In terms of the budget, the proposers divided the budget by months in accordance with the project timeline, which was easy to catch up. This will increase the feasibility of the project. \nRegarding to the human resources, the core team included many experienced members, having strong backgrounds related to project management, software development, software quality assurance, cars, etc. These skills and backgrounds are necessary for this project implementation (which was related to blockchain and cars). With such team, I firmly believe the project could be done in a given timescale and funding. \nJust a small point that it would be better if the proposers allocated the human resources into the timeline. \"", "q1r": 5, "q2": "\"In terms of the project management, the proposers used Agile Software Development Methods, with a focus on Scrum. \nIn terms of the metrics, the proposers listed out the criteria in accordance with each task in the project timeline (illustrated by Gantt chart), which was very easy for the community to follow what the team has accomplished. The criteria listed here are sufficient and enough to evaluate each task/phase of the project. \n\"", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We aim to develop a Cardano ridesharing solution like Uber but on the blockchain, guaranteeing privacy and security in the services provided, as well as being fully governed by users of the platform.", "experience": "\nMore than 5 years of experience working on connected Car Projects alongside Germany's world-leading car makers\nMore than 10 years of experience in Software Development\nMore than 8 years of experience in Software Quality Assurance and Test Automation\nPlutus pioneers\n"}