{"id": 414263, "author": "cryptoloops", "title": "Minimizing Risk in the NFT Market!", "url": "https://cardano.ideascale.com/a/dtd/414263-48088", "category": 26595, "amount": 49500, "description": "With the NFT market growing, scams such as rug-pulls are becoming increasingly common. If we want to grow the Cardano NFT market and bring the public into this space, these risks need to be mitigated.", "f6_no_assessments": 9, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 1601, "q0": "I found this proposal extremely relevant and it certainly meets the objectives of the challenge well, especially the topic \"Existing products or integrations - What products or integrations already exist in the ecosystem? What are the core differences between the proposal being presented and those existing ones and why will that provide impact to the ecosystem?\". I think that because it is based on something that already exists in other blockchains, and in fact, the cryptographic world as a whole is a big risk, and precisely this lack of security is what prevents more conservative users from investing in cryptocurrencies or getting involved. in projects with NFTs, for example. This project would act precisely in the sense of trying to minimize the risks, danger and possible blows that involve the projects and negotiations with NFTs. This would be done through a reserve, a percentage of the money in question that would be kept in a safe (individual for each project), and in the event of a cancellation or some kind of problem, the buyer would receive part of Ada back. I thought that the way the idea was explained was very simple, so that all readers of the proposal can understand what is to be done, not just those who already have understanding and familiarity with the relevant blockchain technologies. The use of examples is always very good to ensure that CAs and future voters understand well the processes that will be developed, and this is done successfully. Another positive point regarding the impact and confidence in the benefits that this project could bring is that they already have a website where we can understand and get to know better who they are, what the CNFT Alliance is about, who are their partners (I noticed that they have with Flooftopia and AdaQuest, two important games for our ecosystem - without demeaning the others, because at the moment I only have knowledge of these two and I understand the seriousness of these projects and their teams). That is, through the attachment of this website, we can have an even more assertive confidence in the commitment and preparation of the team to carry out its mission. I believe that if the entire project is carried out as promised, this can lead to an increase in the number of more conservative users in transactions involving NFTs on the Cardano blockchain, and I think it is very important that our community presents solutions and reasons that make Cardano different. and better than other blockchains, as we know that there are other better-known alternatives, and we need to give a boost so that our blockchain can grow and spread. With that, I reinforce that, in my view, for all the reasons explained above, the proposal is very much in line with what the challenge is looking for, most likely creating a high-value Dapp that will be very useful for the Cardano ecosystem.", "q0r": 5, "q1": "The project roadmap allows us to have a general understanding of what will happen, however this could be more specific. For example, they divide the timeline into quarters, we know what activities they would do in each of them. Some quarters are more detailed than others, with more activities listed. For example in the third quarter of 2022, we know that a series of activities would be done, such as the full launch of the project website, reveal of partnerships, release of Litepaper and etc. However, in the next quarter, we are only told that metrics of the effectiveness of the CNFT Alliance project would be provided. Okay, let's break it down: in relation to the first quarter, what exactly would happen each month? It would be interesting if we knew which professionals would be involved in this and what their work routines would be, for example. About the last quarter of this year, which metrics would you mention? How could we understand what their functions are in relation to our understanding of the whole? I think there was room for more detail here, in the explanation of the script. If the parts were more unraveled, surely our view of the whole would be more solid. Going now to the budget analysis, I believe that the asking amount, of 35k dollars, is quite fair and consistent with the complexity of the project. We know which parts it would be divided into, such as legal, coding, project management, etc. I believe that some of these parts could be better explained. For example, why would the legal part cost 4k dollars? What kind of legislation and sector actions are involved in this project? How exactly would the marketing take place? In my view, these two expenditure topics could be addressed a little better, the others are satisfactory. Finally, analyzing the team, this was the part that satisfied me the most regarding the feasibility of the project. At first, the team is confident because of the attached website, where we can see the photos of each professional on the team, their names, professional roles and linkedin profiles. In addition, they also attach more details about each of them to the description of the proposal, and we realized that there are people who are well experienced in relation to Cardano in the team, such as Conward, which conveys a lot of confidence that it is a team that is well prepared to run this project successfully. That said, my only suggestions for feasibility are more specificity of the script and a more detailed explanation of the legal and commercial part of the budget.", "q1r": 4, "q2": "In my view, the project is highly auditable in terms of measuring success and also KPIs that represent partial results, but not so possible to monitor in relation to the development process. Speaking first of the end results, the proponents paint a very clear picture of how success would look: by comparing the number of hits across CNFT Alliance projects compared to the overall CNFT ecosystem. The number of “pulls of the rug” would also be analyzed, as they themselves designate the hits, amount of Ada/USD lost by parts of the purchased, NFTs sold, completed projects, etc. In other words, the proponents indicate several direct ways, most of them quantitative, that serve to understand if the project in fact achieved what it set out to accomplish. I would like these studies to be combined with a kind of user satisfaction survey, that is, how do teams or individuals who have proposed to participate in the CNFT Alliance feel about this? In fact, they now have more confidence and tranquility in trading NFTs, have they recommended the service to acquaintances, etc? Has this really increased the number of active members of our community, digital wallet, amount of Ada being delegated, etc? I think that these analyses, both quantitative and qualitative, can be done by the team members and presented in a clear and direct way to the Cardano community. As they already have a website, my suggestion is that they keep the partial results available on some page there, so that the community access to this information is free. Regarding the monitoring of the development phases, I think this part leaves much to be desired. The proponents do not seem to have any plans to directly demonstrate progress in the tasks to the community (not what was generated, but how it was done, the daily work of professionals, etc.). In my opinion, this is quite important. I suggest that they use the site itself to create a checklist of tasks, dividing the temporality more specifically (for example, monthly). As they already have an interface and a direct communication channel with the Cardano community, I don't think it's necessary to create other forms of contact, such as online meetings or discord channels, etc., but it's always good to have as much access as possible to the partial advances made. That said, I believe that the proposal is auditable, with only a few points to improve.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 2393, "q0": "With the growth and popularization of the blockchain market, the number of scams or attempts at dishonest actions by users of the technology are also increasing, and the most affected are those new to this market. In this way, the objective of this proposal is well founded, as well as it is correctly aligned with the objectives of the challenge. We can already see a positive impact on Cardano's ecosystem in the short and medium term, if the project manages to convey the feeling of greater security to users. In this context, the amount being requested seems consistent with what is desired to be accomplished, also considering the experience of the professionals involved. However, it is worth noting that the task of convincing users and services to adopt the CNFT Alliance may not be so simple, which casts doubt on the possible impact of the project.", "q0r": 4, "q1": "In accordance with the aforementioned, one of the biggest differentials of the project in question is the extensive experience in the area of ​​technology on the part of the professionals involved. But it is also possible to perceive that the field of action of these is quite broad, not limited only to exact areas, but also interpersonal. Another positive factor is the availability of the curriculum of these professionals so that their experiences could be proven. From the way it is written in the feasibility plan, we understand that professionals are ready, just waiting for funding to execute projects that involve bringing more protection to NFT services. From this, we have the positive factor that the team is already on the verge of generating revenue, however, due to the innovative nature of the proposal, it would also be interesting if some partnership had already been established and a pilot project carried out, to test the current model of Business. But taking into account the company's current action plan, we managed to find a good organization of the activities to be carried out, given that they evolve gradually, including determining how many partnerships should be carried out at each moment. Regarding the detailing of the project budget, we also have that the allocations are consistent, with the largest allocation of capital (about 51% of the total) being focused on development, which makes perfect sense given the scope of the proposal. It remains as an observation, however, that it might be interesting to allocate a greater amount to marketing, given the need to convince the public of this innovative type of service.", "q1r": 4, "q2": "We noticed that the team was very accurate in determining the ways to verify the project's progress, since parameters were established that cover very well what should be the advantages and benefits achieved when transacting NFT's with the help of the NFT Alliance. Additionally, the team's perception of success matches very well with the parameters previously established and even the ideas exposed in this section build a good vision of what is possible to achieve in the future. Finally, there is the observation that, in addition, it would be interesting to expose some percentage of expected improvement (even if estimated) after the implementation of the service. In addition, some tool could also be chosen to gradually show the community the results being achieved.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5040, "q0": "The proposal fits very well with the objectives of the challenge, and has as one of the most basic objectives, attracting new users to the Cardano ecosystem, creating something that the NFT market is in great need of lately, which would be greater security and guarantee to investors, who live at risk of their investments being knocked down through a rog-pulling scam, and even though they have different approaches to dealing with this problem, as is the case with the token refund that will be implemented in the ERC-721R, the leaving 45% of the amount received as a guarantee fund, also has the potential to drastically reduce the amount of investments lost because of such a practice, and although I believe users will not be happy knowing that they still lost more than half of the total invested, It is very likely that many users who plan to carry out this scam, go to other platforms without this guarantee, thus presenting a differential to the product exposed in the proposal. Apart from the security issue, there is still the push that a qualified team can give to several people interested in starting their own NFT game, improving quality control, and allowing more ideas to be taken off the paper and put to good use, increasing the chances of community-generated ideas being successful, although I think third-party game production has a tendency to standardize their end products, I believe this can be partially resolved with some creative freedom given to the customer.", "q0r": 5, "q1": "Fortunately, the proposal team is quite vast and qualified enough to supply different projects from different clients, and from what has been presented, it has more than what is necessary to develop a quality standing NFT game or even above others more established in the market, the team's presentation is also very clear and objective, with links to the linkedin profiles of each member. In terms of costs, the amount requested is quite understandable and realistic, for the size of the team involved, and there is a breakdown of what the invested amount will be spent on. The planning of the production process, although simple, is effective, and provides 3 milestones for different quarters, until the first or second quarter of 2023. In short, a highly qualified and verified team, added to an affordable and realistic production cost considering how large and influential the final product hopes to be if completed correctly, accomplished through simple but effective planning, greatly increases the viability of the proposal itself.", "q1r": 5, "q2": "Regarding audibility, as fluxus is a product that aims to be the very soul of a certain client's application, providing data that proves that the proposed product works as it should is essential, considering the amount of adas that will be in circulation if the flux is successful. And on top of that, the team plans to provide direct information on the number of ADAs that were protected from rug-pull schemes, and something even more important than that, a comparison of numbers of rug-pull schemes committed in other applications of the Cardano ecosystem, this in itself, depending on the number of users initially interested in using the services of Fluxos, will generate a snowball effect that in itself will end up attracting even more users, as good data need a large sample space to acquire considerable credibility. Finally, considering the fact that just one user check is enough to measure fluxus' success, it will be easy to know if the investment received in catalyst fund 9, if received, was put to good use.", "q2r": 5, "assessor": "z_assessor_2665", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7286, "q0": "The impact the proposal can have on the NFT Cardano ecosystem is numerous, the proposed solution to addressing the current risk constraints such as rug-pulls in the NFT market is new but full of potential. The participation of the CNFT alliance with the projects will reduce risks, bring more confidence and peace of mind to the NFT buyers of the project, and contribute to the increase of users in the NFT Cardano space. The proposed group offers risks and ways to limit the risks, but I think the risk here is not just capital, but can also include legal issues, disputes, and marketing, taking What guarantees the project and the buyer to trust, use and comply with the rules of the game Fluxus.", "q0r": 4, "q1": "The proponent provides full information about the members' work experience through LinkedIn, showing that their skills and experience are suitable to be able to successfully implement this project. The proponent also provides a detailed plan, assigning tasks to each member and how they will be completed, with clear timelines for setting goals. The proponent also gave a relatively reasonable budget, with clearly outlined items, hourly amounts should be easily identifiable. However, the proponent should state the criteria required to evaluate a project transparently, how it is collected and used and returned, how collateral it takes place, on a case-by-case basis, a A little more insight into that will make it easier for the reader to visualize and understand the success of the project.", "q1r": 4, "q2": "The information provided is sufficient to assess progress and monitor the success of the proposal. The schedule is described and listed, corresponding to specific timelines, so it is easy for the community to follow. The solutions offered to solve the challenge are clear and easy to understand. The proponent has a pretty detailed product presentation and KPI calculation, but instead of putting the words 'numbers' in front of each sentence, it should be specific numbers instead, to help the community easily. track and grasp more, or let the proponent know his target number to strive for in the implementation process. No products or tools are presented for the public to view. It is better if the proposal provides, details of KPIs and results achieved in each month, to easily track the success of the project.", "q2r": 4, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7984, "q0": "The intent in this project is to grow the Cardano NFT market by tackling scammers. I personally experienced that I bought an NFT that no longer existed an hour later. This makes you feel like you never want to buy NFTs again. It would therefore be useful if this proposal came up with an appropriate solution. They would create a system that would provide transparency and thereby minimize the risks for participants. All people involved in NFTs will be very happy with this system. We are therefore protected against all the scammers in the NFT world. If this project is funded, it will have a major impact.", "q0r": 5, "q1": "The people who will participate in this project all have relevant experience (CNFT Alliance). Alex is the head of Game Design and co-founder of CNFT Alliance and will be putting his weight behind this project. A big name in this project is Dirk with his 20 years of experience as a Technical Architect. There is a budget plan that clearly states how the money will be used. It would be useful to describe the budgeting in a little more detail. For example, there is marketing. It would be helpful to explain how this marketing will be done. There is a timeline that states which objectives must be achieved in certain periods. The technical aspects are included in the proposal. I think that the objectives have been well chosen and are certainly achievable. The proposal states what it takes to complete everything. An implementation plan is included that shows how the project can be implemented. The biggest challenge is financing. Many people are already ready to start working, but without funding it is not possible to keep these people employed.", "q1r": 4, "q2": "There is a road map with important milestones mentioned. The goals are certainly achievable. The roadmap offers sufficient time to evaluate the progress of the project in the interim. The success of the project would be a big decrease in the average losses of users. This is to the advantage of all users who are involved with NFTs. Another success is a unified CNFT ecosystem that wants to join the CNFT Alliance. Clear KPIs are also included in the proposal that are clearly measurable (NFTs sold, projects completed, NFT games). The main problem with this project is financing. It will also be important to get exposure in the NFT world so that people know who CNFT Alliance is.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8566, "q0": "The problem is stated simply and clearly: scams like rug-pulls are becoming more widespread as the NFT business expands so dangers must be minimized if we want to expand the Cardano NFT industry and bring the public into this space. The proposers address the widespread of scams by introducing CNFT Alliance, which will minimize the increased cost to users in the form of rug-pulls and other dubious practices that make NFTs less attractive to users. The goal of bringing more people into the Cardano ecosystem by increasing users in the NFT space is certainly in line with the challenge's purpose. With the information provided, it is simple to determine the project's impact. The solution statement makes sense in light of the issue statement, and both are well articulated, as are the proposed success indicators, which are both appropriate and in accordance with what this challenge is looking for.", "q0r": 5, "q1": "Members of the team have amassed a highly diversified set of talents and expertise in a variety of fields such as coding, project management, NFT, and business . Referrals from LinkedIn were supplied, so experience may be validated from that angle. Furthermore, we are provided an outline of who will take on certain positions, which adds to the project's legitimacy. The roadmap is ambitious in terms of a thorough project plan, but not so ambitious that it will be unattainable. The team did an excellent job of presenting the quarterly phases, each with a quick summary of what would happen. Milestones are also reasonable and attainable. A clear and comprehensive budget breakdown is offered showing how capital will be spent; it is evident that coding costs will be prioritized. It's great that the team thought this out because it increases the odds of success. However, the $3,000 definition for \"Marketing\" is ambiguous to me, which jeopardizes the feasibility evaluation of the requested budget. I'd like to see more information on how the team plans to promote. Another point of concern is the expense of website development; I'd want to have specifics on the time necessary X associated remuneration. Similarly, I would recommend that the proposing team give a clearer and more extensive analysis of the proposal's risks and problems, followed by suggestions for potential mitigations.", "q1r": 4, "q2": "Yes, the information supplied is adequate to audit the proposal's development and success. The team does an excellent job at identifying the problem and offering their solution. With their names, positions, and competencies, there is a pretty good team behind this idea. The team also provides a reasonable roadmap with goals and activities every quarter leading up to the final delivery, making it simple to assess this proposal. Furthermore, it is encouraging that the team has already established certain success measures that are properly linked to dates. This can aid in measuring the proposal's impact, as well as the KPIs, which are easily trackable, relevant to the proposal scope, and also connected with the challenge goals. The team has a functioning website that would offer the most recent project updates; this would increase the auditability of this plan significantly, but there has been no update of it yet. The update status of the progress is critical for the community to understand the project's progress and to be able to contrast the real information with the planned information.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8731, "q0": "There have been many projects on the development of the NFT market, but the projects on risk reduction in this market are quite few. So I am very impressed with your proposal. Regarding the presentation layout, your proposal is full of necessary information. You described your solution and gave an example to illustrate. The project will also attract more users in the NFT space if it is successful. This is a great value for Cardano. At the end you just mentioned the only risk that is funding. Personally, I think during the construction process, there will be some other risks. However, your presentation is relatively complete and clear.", "q0r": 5, "q1": "The project roadmap spans 4 quarters and promises to deliver results in 2023. In the proposal, you also provided a detailed budget breakdown. Besides, the project team members were introduced. Each member is responsible for a specific task. Your experience and abilities make me very impressed. In general, the presentation of the proposal guarantees the feasibility of the project.", "q1r": 5, "q2": "Your audit section presents the criteria for measuring project progress. A picture of success has also been described at the end of the proposal. With the metrics you give, I believe the project is auditable. The project promises to bring many benefits to our ecosystem. This is a project worth looking forward to. If possible, let us know on what platforms we can track the progress of the project.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11119, "q0": "\"Now that the NFT market is growing, scams like carpet pulling are becoming more and more common. According to the author, if you want to grow the Cardano NFT market and bring the public into this space, these risks need to be minimized. The solution is to form a CNFT alliance that will solve the carpet pulling and other transparency issues by bringing the next evolution in the NFT ecosystem. The CNFT Alliance will provide services for many types of NFT projects, most importantly transparency. For example, when an NFT project wants to join the CNFT consortium, certain requirements must be met including transparency requirements such as full working group, open target, plan, etc. For NFT sales, CNFT Alliance will provide minting functions or market partnerships, where a percentage of the revenue is used as collateral against price drops or not. deliver what was originally promised to their buyers. If the project decides to pull the carpet, this mortgaged ADA portion can be returned to the buyer. So, if the project decides to pull the carpet, this mortgage ADA from previous sales can be returned to the buyer, reducing the risk for users participating in the CNFT ecosystem. In my opinion, this project perfectly fits the goal of the challenge as it helps to increase users in the NFT space whether it is with dApps or projects that are integrating NFT.\nAccording to the proponent with a qualified and experienced team, the biggest challenge they faced in this project was the issue of funding. So, they came to Catalyst to apply for funding, but listing it as a big challenge in implementing the project is a bit inadequate because in my opinion, if a project wants to do it, the first thing they want to do is do it all. All need capital, without capital, no project can be implemented. Finally, congratulations to the team for the great idea that the team has brought.\"", "q0r": 5, "q1": "\"Feasibility starts with roadmap analysis: there is a timeline that allows us to visualize what activities will have to be done over what period, to achieve the result. However, the time division here is quite wide, instead of reporting the activities that will take place every quarter, I think it would be better if they planned the activities on a specific month-by-month basis. We need to know if these activities will take place consecutively or in parallel, how long will each activity take to complete? For example, in the third quarter of 2022, the proposal says to \"\"Complete the CNFT Alliance website\"\", how long will it take you to complete it, and how many people will it take to complete it? it is the same for the other activities, it is suggested to include here a little explanation of each of them, this way we will have a much more solid view of the process.\nMoving on to the budget section, the total request for this proposal is $49,500. We know how the total amount will be divided into basic parts, but each of them can be analyzed in more detail. For example, the legal fee is 5000$? What does that cost include, and why is it $5000, the same goes for marketing costs. And I have one more question is the 7% tax cost, why is this cost necessary? (I wonder because most other projects I know don't mention this cost)\nAnd finally talking about the team, this is the part that I consider the best in the feasibility of the project. I know the project has 10 members involved, the great thing is that all members are assigned roles clearly, we know what their work is, and what experience and ability are. as well as their involvement with Cardano. Affiliate profiles of members are also provided so that all information provided is verifiable and we can also know more directly what they have done so far and how they were founded in their professional context. In general, the feasibility of the project needs to be improved a bit in terms of schedule and budget, but because the project team I evaluate is quite quality, I agree with the project feasibility with a number of the score is 4.\"", "q1r": 4, "q2": "\"The proposal identifies several ways that the progress of the proposal's development can be tracked such as \"\"Number of carpet pulls committed by CNFT Alliance members compared to the ecosystem average\"\" or \"\" \"\"Amount of ADA or USD loss prevented by CNFT Alliance actions and policies\"\" and \"\"Compare CNFT Alliance KPIs with Cardano Ecosystem average\"\". But how can community members track these metrics? I think the proponent needs to provide a platform like a website, Google Docs, or some other app where members of the Cardano community can update the project's information.\n And finally, the success of the mentioned proposal is a \"\"large reduction in the average loss of users who want to participate in CNFT projects in the CNFT Alliance compared to the average CNFT Ecosystem\"\" I complete. fully agree because the main goal of the project is to reduce the risk for users participating in CNFT Projects. I realize that the success of the project is also related to the goal of the challenge, I appreciate the idea of ​​this project, so I hope the project will be accepted by the community so that the project can be successful may soon be put into practice.\"", "q2r": 4, "assessor": "z_assessor_3223", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12743, "q0": "The project wants to increase the credibility of NFT projects by putting a percentage of the funds from the NFT sale in a vault which gets locked up until the creators have made all their promises. In theory this project looks very useful. It makes the market more transparent and gives the creators of the NFTs a bigger incentive to fulfill their promise and diminishes the revenue of a rugpull. But I see a problem with this. Many NFT and Metaverse projects need the income from NFT sales to develop their promises. The creation of these assets with some usability in whatever way is expensive. For example, Cornucopias sold NFTs to fund futher development of the metaverse. To reduce the capital income isn´t always efficient and effective. Risking the successful development because of a lack of funds just to create more credibility isn´t always logic. Maybe you could make a mechanism where the NFT holders can vote whether the NFT team can have access to a part of the vault if the funds run out. This would mitigate the inefficiency.\nNevertheless the idea seems useful and can protect buyers from rugpulls. This can make cNFT space more secure and thus attract more users, more new NFT projects and more dApps but the inefficiency described lowers the impact. \nTherefore I agree that the proposal addresses the challenge.\n", "q0r": 4, "q1": "The team has provided their LinkedIn accounts. They have relevant experience from development, crypto marketing, programming, project management etc. Therefore they should have the skills to create this project. \nThe budget is clearly broken down. The individual fields seem reasonable. The coding is comparatively expensive but by looking at the skill and experience of the developers it is fair.\nThe fundingrisk is addressed in the proposal. And they will “most likely apply for further funding in future rounds “ but they plan to get to a point of financial sustainability. \nThe timeline describes the next 4 quarters. They want to publish a website, making more connections with projects and in the end full their goal by creating more trutst and decreasing the rug pulls. The timetable is easily understandable. \n", "q1r": 5, "q2": "The first and third KPIs are good. They want to compare rug pulls and other values on their Alliance with the overall rugpulls on the cNFTs. That’s a very good measurement because it directly shows the effect of they service. \nThe second KPI okay. They would probably have to estimate these values from statistics but there isn´t a real way to measure this. \nThe roadmap is clearly shown on the timetable. They provide only a roadmap unitll the 2nd quarter of 2023 but most likely need more funding. I´d would haven been good to clarify why they need this additional funding because the roadmap/ timetable implies that they are finished in the beginning of the next year. \nThe solution overall is easy to understand and to audit by its usecase", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "There has been an increased cost to users in the form of rug-pulls and other dubious practices that make NFTs less attractive to users. Our CNFT Alliance will minimize these risks!", "experience": "Co-founder (CF)/Game Design: Alex\nCF/Marketing: Conward\nSr Programmer: Dirk\nProjects Coordinator: Sam\nAssistant PC: Jye\nNarrative Design: Chris\nGame Programmer: Simon\nArtist: Dilara\nIllustrator: Ann-Kathrin\nProducer: Christian\nSFX: Rudi\n(More Details Below)"}