{"id": 414367, "author": "seirayun", "title": "Recognize Impact through DIDs", "url": "https://cardano.ideascale.com/a/dtd/414367-48088", "category": 26595, "amount": 68967, "description": "There is no impact score system that visualizes and attributes social & environmental impact to decentralized identities.日本語", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 1606, "q0": "The proposal is quite interesting and I believe it aligns well with the objectives of the challenge. Here, we seek to create Dapps that are positively impacting the Cardano ecosystem, increasing the number of active members in our community, the number of digital wallets being created, smart contracts being formed, etc. In my view, the fundamentals that would be better served based on this project would be “increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products”. This platform would work very well on these issues, since the idea is to create a space that can assign, as the proponents themselves say, an impact score based on the good deeds of users. This score, from what I understand, can generate crypto rewards (I believe in Ada). They also want this platform to become a market for ethical products in the future, that is, products that are sustainable or contribute to a social cause. The Cardano ecosystem would benefit greatly as all this data would be minted on our blockchain. Another very relevant point here would be the future tool that would allow users to make loans among themselves, without intermediaries. These transactions would be smart contracts, containing interest, and the risk of the loans would be calculated based on the reputation of the borrower. In other words, there would be several tools coupled to this interface, using Cardano's technologies so that they can be executed. One point that I would like to comment here, which was not so clear to me, would be how the Atala Prism DIDs would be associated with all this. However, I think that this project can bring many benefits to Cardano, since it seeks to create a kind of social network that measures the good deeds of those involved, that works to generate rewards for them and also contributes to a sustainable trade and system of less bureaucratic loans. I think for the project to be successful, it would need a lot of outreach and broad community adoption, as it's an interface geared toward many activities that multiple users would need to be using. A question that came to me when reading the proposal was how, exactly, these good deeds would be linked in user accounts. How can we be sure that they are actually doing those actions and gathering “dots” from that? Apart from these issues in general, I believe that it is a proposal that is very much in line with what the challenge seeks and even innovative, since it intends to boost this wave of good deeds, through direct benefits to users and involving cryptography.", "q0r": 5, "q1": "Yes, and here are some valid explanations of how the plan could be successfully implemented in practice. Talking about the development process (script), the first three months are very well situated, we know exactly which tasks happened in each, I believe they were also said in order. This is very important so that we have a solid understanding of how the development process will take place here. However, in the following months (from the fourth to the sixth month), the level of specificity about what will be done drops significantly. We know that bidders will “monitor KPIs, prepare technical documentation and deliver the final report”. But in which month will each of these activities take place? Or would the 3 happen in parallel? It would be important for us to have better clarity on this point. I would also like to know how they would follow the aforementioned KPIs, how would this monitoring of the interface be, how would they understand if the operation is going as planned, how would this information be studied and then passed on to the final report? In my perception, the script starts off perfectly but lacks a little detail in relation to its second half. We also have a series of tasks listed, it would be very positive for those who read the proposal that these were delegated to a specific professional. For example, who would be responsible for “giving users an impact score”? The deliverables and technical aspects are fundamental for us to solidly understand the different facets of the proposal, what worries me a little is that in the blockchain part it seems that not only Cardano would be used, and the project is quite expensive, so in my view ideally, it would be fully developed on our blockchain, so that the benefits fall 100% on our community. The Milkomeda sidechain would also be used, and from my research this project links Cardano with Ethereum, forgive the technical error if I misunderstood. The budget division of the proposal leaves something to be desired because we know the price of the hour of work for certain tasks, but not how many hours the professionals delegated to them would dedicate to the work, which does not allow us to have an idea of ​​whether the amount requested is it fair or not. I would like proponents to identify exactly how much time would be spent for each cited part. In general, the information is passed from a basic one when it comes to financing, since we have a table at our disposal, but the information cited in it is not so well developed. And finally speaking of the team, I think this part is perfect because we have a lot of information about the team members. We know their names, their roles in the project, their linkedin profiles and a short biography, so a lot of trust is passed on. With that, I think the proposal is viable, having only a few points to be better clarified.", "q1r": 4, "q2": "In terms of monitoring progress, I think this part is perfect. Proponents allow us to understand various metrics that would be used, both qualitative and quantitative, to understand if the project was being done right. We have some deliverables such as “the Atala PRISM integration code deployed and available on GitHub” and “a full demo video” as well as numerical data regarding registered users in DIDs and number of transactions that affect the impact score on our blockchain. In addition to knowing very well what would be measured, the proponents establish very solid bridges with the Cardano community: they claim that there will be monthly reports and also a final report, as well as participation in community meetings, Towhhall and etc. Not enough, they make clear some tools that will be used to monitor the activities, such as the Agile methodology, Trello, Github and etc. That is, we have several ways to verify if the process and the desired partial results are being obtained. Therefore, there are not so many comments to be made about the process, since the information has already been provided in a very adequate way. Speaking now of the success scenario, this part is less detailed, unfortunately. Proponents point to two key indicators (ProofSpace/Atala PRISM is integrated into the existing Socious app and the Impact Score Calculator is developed and deployed so users can start visualizing their social and environmental impact). I believe these indicators are very focused on the performance of Dapp itself, but maybe they don't point out so well the impacts of this for our blockchain, our community. It would be interesting for them to do a study pointing out how many digital wallets were created, profiles in Atala Prism, how users of this application would relate to Cardano, in general, that is, if they became active members and why. In a simplified way, I believe that it is also important to understand what was generated from the Dapp, and not just the success in its performance. A targeted study with the target audience should have been carried out, so that we had a solid and verifiable view of the consequences of the development of this dApp for each member of our community. More to these issues commented at the end, the inclusion of details is never too much, in my view, so it would be very positive if the proponents had included as much information in the auditability of success as was included for us to follow the steps and the partial/small advances.\n", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2770, "q0": "\"There are many tasks in this proposal but the main idea is to move towards a decentralized environment that can watch the social community voluntarily perform good deeds with environmental and social impacts as well as ethics. This makes me think towards a Blockchain that can score Dapps, for example google play they have ratings of Dapps for users to choose to use this will motivate developers New development establishes useful Dapps for the ecosystem and society in the future, so this proposal has fully met the requirements of the challenge.\n\n   There are two major stated tasks of the proposal in this presentation.\n       -The first task is to enlighten users so that they can promote their skills in good deeds to influence the social environment,\n       -task two makes it possible for them to get rewarded for useful activities, rewards include crypto tokens and their active profile to give another Lending Dapp upon integration, so there can both help users with rewards and also help KYC their identity and positive profile when they are active. ensure the user's profile included in the transaction is transparent, moreover the proposed team has a future statement to provide the Socious Impact Lending, borro wing example service by including the impact point in the smart contract to the two deal with each other, this will be a very ambitious idea that will probably take more time to put together the impact lending service\n    \n     there are many risks listed here and all of them have been mitigated, however, regarding future lending, the proposed team has not mentioned potential risks to lenders but it's a matter of the future I believe the group can have the best mitigation measures. \"", "q0r": 5, "q1": "\"The successful implementation of this proposal will require a lot of academic and technical experience, but the proposed team has announced that the delivery of the new site will be between the 4th and 6th months. very amazing to experience this roadmap presentation by the team it's really meticulous in every detail this is the ultimate for you when few proposal groups out there can present it like this,\n      The detailed budget table is also provided with a picture of the full notes by the team\n   The group includes people from many countries from Europe and East Asia, all assigned to positions that match their experience. it's amazing how the team can work together so closely,\n  There may be a small question that is:\n  Do you have any language difficulties or do you all communicate in plain English?\"", "q1r": 5, "q2": "\"This proposal has the strength of measures of work progress that four out of many goals are completed and in place, and many more are also made available to the community that can be easily accessed. easily measure the next work, especially that anyone can register to experience the process, the team also commits to publish to Catalyst and the community monthly with reports\n\n      The success of the proposal is when the community can integrate the Dapp on operating systems like iOS and Android, and experience the impact score individually.\"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 4848, "q0": "I think this is a very interesting and great idea from the proposer to create a Dapp called Socious to attribute \"Impact score\" to volunteers ,freelancers, individuals or organizations for their social and environmental contributions. In my opinion, this project is highly relevant to the challenge \"Dapp, Products & Integrations\" as its unique Impact Score has many use cases to Cardano Ecosystem and will significantly increases the adoption of Cardano. For example, users could be rewarded in THANK tokens, access to investments, or exclusive economic opportunities such as financial products. And in the future, this Impact Score system could be used to facilitate users to progress in their impact careers, connect with like-minded people, buy a variety of sustainable products, lend and borrow THANK token,...Moreover, this project will increase the number of integrations with different products such as Atala PRISM, Milkomeda, ProofSpace and ERC-20 compatible wallets,..For example, this Dapp will use Atala PRISM for facilitating KYC compliance, impact score certification and asset transaction with trust and transparency. I think this project is explained simply and clearly by the proposer for community understanding of their project with given Socious website, Github link, and video explanation of Atala PRISM for reference. As far as I know, this Dapp is completed to some extent as I could download this Dapp from my mobile phone and experience it and see what I could contribute to the environment and get Impact Score. From what I know, only those who have an impact score above 700 are issued verifiable credentials. So I just wonder and I would be appreciated if the proposer could explain a little more about how could new member contribute to get \"Impact Score\" on the Dapp? How will the Impact Score calculated? Does it based on any criteria? I suggest that the proposer could make a video to show how a member could contribute to environment issues from the Dapp. Regarding the risks of delivering this project, I agree with the proposer's opinion, Socious will work with Atala PRISM/ ProofSpace for integration with existing mobile app, therefore depend on ProofSpace/Atala PRISM capacities, and working time difference between Europe and East Asia. And a good point from the proposer is that by predicting these risks, the proposers have idea on how to mitigate them. After all, I fully support this proposal and hope it could get funded. ", "q0r": 5, "q1": "The proposer has quite detailed plan for delivering this project to the market within 3 months of approval of funding from September to no later than the end of 2022 and will monitor the results and submit the final report in the sixth month. For each month, the proposer lists out some main tasks which make it easier for community to visualize what the team is doing on the Socious project. A good point from his plan is that the proposer knows exactly each step for carrying out his project, clearly show the breakdown of tasks for \"Workflow between Socious and ProofSpace\", show what deliverables need to be given, mentions about technical aspects and clearly show the link for the workload management of Socious and ProofSpace. However, I think, there are some parts in the proposal need to be explained a little more. For example, for marketing, I do not know who is in charge of the marketing task (as 4 people are mentioned in your team as a Founder, 2 developers and 1 designer); I would be appreciated if the proposer could give breakdown of marketing task too. Also, the proposer mention about monitor KPIs, I just wonder about which indicators in KPIs will the team use to monitor it? And if possible, I would like to know more about the long-term vision of developing Socious after 2022 release?. Regarding the project's expense, I am impressed about this part because the expenses for delivering each task is clearly calculated by the proposer: I know exactly the total budget's cost, how many hours needed for each task, the number of people will be in charge of that task, the As I know, the hourly rate is $100 which I think is quite reasonable for professionals.Finally, I believe the proposer and team members are qualified and experienced enough for carrying out this project successfully as I know their name, position, nationality, education background, expertise and motivation for sustainable development with technology,..Moreover, with the Dapp are completed to some extent which show their seriousness and evidence of what they could do in reality. After all, although I fully support this project and this team, I could not give them full score for the feasiability because of lack of detailed explanation of budget part. ", "q1r": 5, "q2": "I think the presentation of this auditability part is very good and easy to understand. The proposer clearly tell us their four deliverables as proofs of completion: the code of Atala Prism and Impact Score Calculator deployed and available on Github, demo video, members sign up. Therefore, it is possible to monitor the success of this project. Also, the team has specific KPIs for this project: 2000-4000 users registers with DID, 6000-12000 transactions that affect impact score recorded to the Cardano blockchain. In addition, they also measure project development based on Milestones & Deliverables plan which will be reported monthly and in the final report for Catalyst. Besides, the progress will be tracked by Trello Kanban Board, Github issues, and commits. They might also present Townhall and other meetings. In general, auditability is adequate for community to follow the project. ", "q2r": 5, "assessor": "z_assessor_2622", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11123, "q0": "\"According to the author, no impact point system visualizes and allocates social & environmental impact for decentralized identity, so the author wants to use blockchain technology to provide trust, transparency, and decentralized. The solution is that Socious will leverage Atala PRISM to allow users to become the owners of their digital identities and personal data. Atala PRISM facilitates KYC compliance, impact point certification, and asset transactions with trust and transparency, ensuring traceability and transparency of transactions/action points dynamic using blockchain technology. Thereby user actions will be recorded on the Blockchain motivating everyone to realize their full potential of the positive impact increasing the reliability of resources in the ecosystem. In my opinion, this proposal is perfectly suited to the challenge as it solves the problems of \"\"Create or improve various Dapps, products, and integrations that provide value to the Cardano community and ecosystem wider than \"\". Socious is a decentralized application (DAPP), this project will greatly increase the utility and adoption of Atala PRISM/Cardano.\nThe proponent provided the 3 biggest challenges and risks that could be encountered during the project implementation, and they also provided methods to deal with/overcome those challenges, showing that they can be met vision as well as the careful preparation of the team for this proposal.\"", "q0r": 5, "q1": "\"Regarding the roadmap of the project, I think the proposal presented very well. We know how long the whole project will take and what to expect each month. The related activities are accounted for and we know well what to expect in each subsequent month. Especially the project provides the tasks and the products will be delivered in phases, we can easily visualize the implementation process. This is a pretty technical project, and the author also provides technical aspects (architecture, language, technology) that make it easier for the community to see and understand. project process.\nIn terms of budget, the proposal asks for a total of $68,967, I think the proposal is very informative so that the community can audit this amount. It is proposed to provide an excel sheet with pictures, it is divided into categories and each of them is very detailed in the sense that we know what tasks the project includes, and how much each task costs. how many hours to perform and how many people to do the same task. Therefore, our understanding of the budget is quite solid, so in my opinion, the budget has been explained very well.\nFinally, about the project team, certainly the project development team is quality. The group consists of 4 members: Seira Yun, Jayson Ilagan, Cristhian Tejada, and Raphael Hode, the description of the group is very detailed, we can see where they come from, and their biographies, work experience, and connections. their relationship with blockchain. The experiences presented, and details are given of what they can help ensure about making the development outlined in this proposal successful (attached to each member's LinkedIn profile), which helps us to better understand them and increase confidence in the ability to complete the project). Besides, there is also the contribution of ProofSpace team members working on this project. We also got to know the members' names and their roles in the project, which is amazing. In summary, in my opinion, the feasibility of the project is very good, we are provided with the necessary information about the roadmap, and budget, and with the qualifications of the team, I am very confident that this project will be implemented successfully labor\"", "q1r": 5, "q2": "Regarding the transparency of the project, in my opinion, the team presented it very well, the community can easily track the progress of the project which will be reported in the monthly report for Catalyst and the final report of the project. judgment. Besides monthly progress reports, progress will be tracked by Trello Kanban Board, Github issues, and commits. Therefore, it shows that the group is completely open and transparent about the results that it commits to the community. The KPIs are also very clearly defined which are \"number of users registered with DID (Atala PRISM): 2,000 - 4,000\" and \"number of transactions affecting the impact score recorded to the blockchain. Cardano: 6,000 - 12,000\". In addition, the team also provides what the goals of completion will be, making it clear to the Cardano Community what to aim for during the implementation of the project phases. About the successful presentation of the project judgment. The team identified two successes. Each success is very clearly described as stated in the proposal and has specific results to be achieved. I see success closely related to the challenges of the campaign. Overall, the project is very well established, I highly recommend this project, because overall I think it is very perfect, hope that the project will receive the community's approval so that it can soon be completed and come into operation.", "q2r": 5, "assessor": "z_assessor_3223", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14703, "q0": "\"By using Atala PRISM, Socious can attribute social & environmental impact to individuals/organizations and provides crypto rewards based on their impact score, which increases utility & adoption of Cardano. They also use blockchain technology to provide trust, transparency, decentralization, the platform can continue to create social and environmental impact on a permanent basis.\nThrough the proposal, authors show the potiental objects they aim for – young people, then the funtions and features of product, the project allows users to become the owner of their digital identity and personal data, even transact their asset safely and share the profits with the community members……Proposers also present the main components (Decentralized Identity, Impact Score,…) and the main activities of project. They develop an algorithm that will recognize a wide range of behaviors to generate an Impact Score for each user. How they build their Impact Score, how they use “Socious Deeds” for governance purposes.\nThe proposed solution solves the challenge because Socious is a decentralized application (Dapp) and its unique Impact Score can be implemented to bring many impactful use cases to Cardano ecosystem, that significantly increase the utility & adoption of Atala PRISM/Cardano. Socious is directly in many areas: “Marketplaces”, “Social Media”, “Environment” and DeFi, and predicted creating greater value and efficiency in the future with products: “ethical product”, “Social Good”, “impact job”, “impact lending”,…..The project is highly appropriate and comprehensive with the KPI/Key metrics of the challenge, increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, as well as increasing the number of integrations that bring existing solutions together for a more seamless and connected experience between different products. In this section, proposer wrote very clearly and detaily, not only the specific evidences but also the gained results when the project succeeds.\nThe proposers have given the main risks to delivering this project successfully, including: Integration of ProofSpace/Atala PRISM to an existing mobile app rather than a web app, Collaboration between Socious and ProofSpace with the time difference between Europe and East Asia, ProofSpace has an F8 proposal entitled “Credential-based token, e.g. KYC”, which depends on ProofSpace to deliver that proposal. At once, they also explain the strategies to mitigate each risk, and these explanation are very clearly, even in the third risk, the dependent proposal is scheduled for completion by the time this proposal is funded.\n\"", "q0r": 5, "q1": "\"The proposed project is planned to every detail, from when brought to market after aprroval of funding, monitoring the results after the launch, until practicing officially. The proposal has got a practical timeline to complete the tasks given appropriately with specific target milestones and deliverables and the details of technical aspects (Blockchain, Design tools,….) to implement the plan. It presents not only a breakdown of tasks, but also how they manage the workload in links. With the deliverables and their funtions involve to “Impact Score” and “Socious Deeds”, we can see the potential of project in increasing adoption of Cardano.\nProposer hasn’t given a detailed budget breakdown and the necessary expenses payment they need use the budget to spend on. It is difficult to assess whether the fund they offer is reasonable or not when they haven’t clearly written what the identifiable items. The plan will be enough to achieve the targets that the proposer desired if the the budget is segmented and clearlier bulleted according to each timeline, each activities, and human resource,…. \nIn my opinion, proposer decribes quite detail about the people who will work on the project, about their positions, and their skills, experience needed to implement the activities mentioned in the proposed project. \n\"", "q1r": 4, "q2": "\"The progress of proposal will be tracked based on the tools provided by Trello, Github issues, commits, and reported for Catalyst monthly. They will also measure the project progression against the clear quantitative indicators, as Information, Milestones and Deliverables in the roadmap and timeline to complete the target. The proof of completion show the action of the Deliverables as well as the specific Key metrics/KPIs numbers, as the number of users and transactions.\nThe success of the project is expressed by its products: the existing Socious app (iOS and Android) integrated from ProofSpace/Atala PRISM, and the Impact Score Calculator developed and deployed so that users can show their social and environmental impact.\nBy providing the Subtainable Development Goals (SDG) and through the specific indicators, milestones and deliverables,…, this team is really serious and clear about their targets and align with the detailed plan.\n\"", "q2r": 5, "assessor": "z_assessor_4097", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}], "solution": "Socious uses Atala PRISM/ProofSpace to attribute “impact score” to visualize users' contributions to impact projects and reward them with crypto tokens, which increases utility & adoption of Cardano.", "experience": "Socious is a fast-growing impact community with 1000 MAU, supported by 500Global and Microsoft. The team has expertise in impact measurement and blockchain development. ProofSpace has deep SSI experience and a proven set of no-code tools for building and deploying SSI workflows."}