{"id": 414428, "author": "alex.pipo", "title": "Cardano NO MORE Plastic Straws |C4O", "url": "https://cardano.ideascale.com/a/dtd/414428-48088", "category": 26595, "amount": 86708, "description": "Too many animals, marine life are victims and hurt by plastic straws, plastic waste entering the ocean, the environment is affected. Does Cardano know that? How does Cardano act to solve this problem?", "f6_no_assessments": 8, "f6_rating": 4.791666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 11534, "q0": "Plastic waste in the oceans is a major concern that society is dealing with. The proposed project aims to create an eco-friendly alternative to plastic straws with ADA payment integration in order to reduce plastic waste. The problem statement is well defined, and it is further supported by illustrative emotion-evoking videos and provided dedescriptopn of the end product. Furhermore I like the idea of using Cardano to solve real-world problems, proving the ecosystem's utility, which is well aligned with Cardano's main goal. Furthermore, the project appears to be well aligned with the current challenge, as it proposes the development of a tokenized product that will use ADA payments and integrate Cardano's payment ecosystems. Furthermore, the project aims to address an imported environmental issue that Cardano regards as a top priority. This is also an excellent opportunity for the community to expand, as increased adoption of the ADA and cryptocurrencies in general will result in the realization of other blockchain-related ideas, such as the use of the blockchain for supply chain monitoring, identity storage, and so on. The proposed solution, if implemented, is likely to have a global impact because it addresses a global problem; however, it is fair to say that the effect will be marginal because plastic straw litter accounts for only 0.03 percent of the plastic waste in the oceans (sources on Guardian, National Geographic etc.). On the other hand, proving the validity and utility of this project could lead to blockchain solutions in other areas of closely related to plastic waste, such as fishing (more than 50% of plastic waste is fishing nets and so on.) by storing information about the plastic impact of fishing companies tied to their identity on the blockchain and so on.", "q0r": 5, "q1": "For a number of reasons, the project is likely to materialize. To begin, the project's team has extensive experience with IT and e-commerce-related projects, as well as experience with eco-friendly product design and trading. Everyone is internally motivated since they see the project as a mission. The proposal is also rich in details about team members' contacts, proving the validity of their previous experience. The team was previously funded by the Catalyst project for integration solutions for shops and e-commerce platforms, which is an important step in this project as well. The team's final point is that each member's responsibilities are pre-determined, filling all of the important responsibilities for project execution. The timeline is well written, with a clear short and long-term plan. The goals, on the other hand, are only written for each quarterly ommintg specifics on a monthly basis. Furhtermore I dind the long-term goal to be slightly ambitions (or perhaps I don't have a good overview) i.e. \"Top #1 grass straw provider in the world payment by crypto\". The budget breakdown is, in my opinion, reasonable for a given type of project over a 6-month period and includes all necessary costs for labor, technology, and logistics. What I would recommend is also stating what other funding will support the project so that you can get a better idea of how feasible the idea is, as it will undoubtedly include other costs related to IT development and so on.", "q1r": 4, "q2": "The timeline and milestones are clearly defined. KPIs mentioned in the project are relevant for tracking the project's exposure, both in terms of the working process and ADA utilization. While delivery dates are only provided on a monthly basis, I understand how difficult it is to predict all of the circumstances that may affect the entire process. The authors also provided a plethora of risks associated with delivery in great detail and solutions. Furthermore, the community could expect a high level of transparency in the ongoing activities, as the team provided numerous channels to monitor project execution on the designated website and social media platforms.", "q2r": 5, "assessor": "z_assessor_3256", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4617, "q0": "The proposal addresses a real environmental issue: plastic straws, which cause harm to marine life and animals while also harming the ecosystem. This is an excellent choice for the challenge. The proposal addresses two Challenge questions: creating a product that influences the sense of environmental protection and this product being instantly usable to solve the problem of plastic waste. At the same time, the product may be connected with ADA coin payment. This is a proposal that can be expanded in the future. The proposal addresses a real environmental issue: plastic straws, which cause harm to marine life and animals while also harming the ecosystem. This proposal contributes to Cardano's aim of addressing environmental challenges, waste, carbon emissions, renewable energy, and food. This proposal results in the release of plastic straws into the ocean, which helps to reduce waste to the ecosystem and the ocean.\nIn reality, plastic straws harm wildlife and marine life by polluting the ecosystem. As a result, it is proposed to provide a solution to this problem by producing natural grass straws to replace plastic straws. Propose presenting relevant evidence and arguments. The proposal also discusses the potential risks to the project, such as climate change causing drought, salinity, and water shortages, which impact the development of raw material locations. The second risk is that natural grass straws are more expensive than plastic straws. The third risk is that cryptocurrency price fluctuations may lead the project to be underfunded. The third risk identified is that the covid-19 epidemic interrupts the export and transport networks, which might result in long and sluggish shipment and delivery times to international clients. The proposal has solutions for the first risk of excavating natural water reservoirs and storing water for farming to reduce the above threats. The proposed team's answer for the second risk is to preserve and safeguard the new raw material location in response to natural environmental changes. Exploiting and discovering new raw material locations unaffected by climate change. Plant cultivars that can adapt to new weather and soil conditions will be tested. There is a plenty of natural grass with knives, as well as self-control over the source of self-cultivated grass. Due to the risks of cryptocurrency price changes, the proposing team selected a cash payment method and by ADA; Covid prevention measures are now being improved, so the supply chain will be restored shortly. The proposed team has implemented a solution to establish raw material sources and automation in the production line in order to cut expenses and lower the price of grass straws. In this regard, I see a possibility that restaurants and consumers are increasingly using plastic straws, which has a negative impact on the environment. The solution to this problem is to distribute the harmful effects of plastic straws and plastic garbage in commercial centers, restaurants, and schools. \nThe product provided in the proposal is highly valuable; it is chemical-free, biodegradable, and decreases CO2 waste as well as the problem of plastic waste and marine pollution. This is a problem for the world in general, and for Cardano in particular, in terms of sustainable development. The risks and solutions offered by the proposal are both realistic. The product will have an impact on the user's awareness. As a result, I scored myself 5 points.\n", "q0r": 5, "q1": "The proposal is divided into two phases that will be implemented over four quarters. This is an acceptable timetable. The proposed group provides a phase 1 implementation plan: Started construction. The projected group's activity in the second quarter of 2022 focuses on the construction of factories, working groups, and the development of natural grass raw resources. Build factories and recruit local workers and farmers. Establish production procedures and train employees. Purchase and begin exploiting the raw material area. A well-established production crew and a grass straw production line are in place. Develop retail channels, SNS community channels, and e-commerce channels. Build an online store that takes ADA as well as cash payments. Design of product packaging Bring the first product to market; The group proposed doing the following in the third quarter of 2022: Investing in automation and equipment to replace manual labor. Increase the amount of straws produced. Product categorisation should be checked and shaped. Products that are printed and packed. Product marketing and promotion Exports to other countries are looking to support sales growth. Create an e-commerce web store and sell online. The Global Campaign \"Cardano 4 Sea - C4S\" and \"Cardano SAYS NO TO PLASTIC STRAWS\" are launched. Phase 2: Q4 of 2022 Carry on the \"Cardano 4 Sea - C4S\" and \"Cardano SAYS NO TO PLASTIC STRAWS\" campaigns. Plant materials are harvested from the start of the project (harvest time is about 7-8 months). Increase the number of local employees. Factory and manufacturing line expansion Increase the export of grass straws to other countries. Establish new raw material locations. Launch a grass straw marketing and communication campaign. The planned alliance would campaign and persuade other governments to ban plastic straws entirely in the first quarter of 2023. Support for transfer of knowledge and skills in the manufacture of grass straw. Provide partners with communication and export assistance. ADAPay payment connection is complete. Continue on with the global campaigns \"Cardano 4 Ocean - C4O\" and \"Cardano SAYS NO TO PLASTIC STRAWS.\" The project's progress is posted on Telegram and Facebook. The financing budget for the proposal is $86,708, which is less than 5% of the total Challenge budget and offers a reasonable redundancy cost. The proposal has a redundancy cost of $7,882.5.\nThe proposed group consists of three main members and two teams of engineering and technology professionals. Members are allocated tasks that are commensurate with their responsibilities. LinkedIn, Github, Twitter, and the website all provide information about the proposed group's members. The proposed team is led by Trong, who has proposals and active activities in the Cardano community in Vietnam, and there are 17 more proposals to support the Catalyst community. This is an excellent idea, and I give it 5 point rating for project feasibility.\n", "q1r": 5, "q2": "The proposal provides a table that will be used to measure the project's success as community activities. Number of retail orders, exports, and e-commerce activities completed online. Project management tool index The proposal indicates the use of a manual manufacturing process that incorporates light industry into operation. As soon as ISO standards and occupational safety indicators are created, they should be applied. Using and applying fire prevention and fighting standards in production management and operation. This is a proposal submitted to fund 8, however due to funding exhaustion, it cannot be implemented, thus the proposed group continues to implement at this fund. The proposed team has completed various tasks such as creating a sales website and stockpiling raw materials so that information regarding the project's progress can be easily verified. Individual assessor have no more suggestions for the project's success metric. The proposing team has built concrete successes for the project that include ideas about creating a mindset in the Cardano community that says no to plastic straws. Based on Cardano funding, the proposed group might create grass straws to replace plastic straws. The project would incorporate the product to develop an economic model for bringing natural items linked to ADA copper, as well as the creation of a commercial website for the product. According to the proposal, the initiative will rely on funds in the first year. The proposal is planned to operate the firm independently after the second year, without the need for another round of funding. The project will provide local job opportunities, contribute to local economic growth, and forecast land and water resources from climate change. This is a proposal to inspire anyone interested in applying for Cardano funding to produce ecologically friendly products. In the future, the proposal will continue to invest in other similar business models based on the experience and information obtained from this project and used the profits from the current business. These milestones are all attainable and linked to challenges. The proposal already has a test product and is brand new. \nThe proposed team's products are realistic solutions for reducing CO2 emissions, plastic waste problems, and marine pollution, while also raising user knowledge about environmental protection, at least in the Cardano ecosystem. Furthermore, the product can be linked with an ADA for payment. I completely agree with this fantastic proposal, and I hope it is funded by this fund. The average score for transparency is 5.\n", "q2r": 5, "assessor": "z_assessor_2576", "no_vca": 5, "ne": 2, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 9295, "q0": "I really enjoyed your team's suggestion to solve the problem. Because I really love nature and also want to have more environmental protection projects. With your suggestions, you have brought cryptocurrency closer to reality, which is used to pay for things that benefit both society and the environment. Your IMPACT part is really detailed, you have put a video about the impact of plastic waste on the surrounding environment for everyone to see their dangers. You give arguments explaining why we should use co-bang (lepironia actiulata) straws. Your team also exposes the obvious risks to come up with a reasonable remedial solution. About labor: Your group has the idea of ​​Hiring local people to participate in the project in planting materials, harvesting and production. This I think is very reasonable because it will help many local people have jobs to do during the Covid epidemic, many people are unemployed. Moreover, these people are close to the place of lawn care, so it is very convenient for the work, saving a part of the cost.", "q0r": 5, "q1": "Amazing good job. After reviewing the team's proposal, I found the group's plan to be really detailed. The team's proposal details what needs to be done in each quarter clearly, your team also specifies each task in great detail. The budget provides public details of labor costs along with hours worked. I am also convinced that you also have an online website and created an online Amazon store: $3,000 and especially you did not raise capital. The members of the project are all talented and experienced people. Therefore, this project has a lot of potential in the Cardano ecosystem to make the ADA coin a good value, helping Cardano to bring a great mission of value to people and to our environment. .", "q1r": 5, "q2": "I find this project practical and good for everyone's life and the environment, I hope this project will be chosen to make it a reality. I also really love the earth and want to protect it. Thank you for the great idea. I see you have worked very seriously. Your project measurement progress is very detailed, broken down into months. In addition, you have also carefully calculated the break-Even Point in this Funding. You have also set KPIs that need to be achieved and have specific goals. Once again I appreciate your project and this proposal.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9480, "q0": "For clear justification of need, through exploration of the problem statement, effective contribution to the solution, and impressive consideration of the risks, I rank this section a 4. This section is a clear winner for positive change but loses a few points from me in a few different areas that I would like to see explained, if another attempt is needed. First, as the section is currently framed, the proposal seems hardly relevant to Cardano as it’s only connection/contribution is the option to pay for services in ADA. In theory, the 20% discount for paying in ADA is an incentive to adopt assets from the ecosystem but that depends on the business seeing substantial success AND that clients find the discount appealing enough to participate in what is generally recognized as a risky asset class. So, essentially, this proposal is mainly just funding a startup company that will utilize existing Cardano infrastructure as an option, which is ultimately up to the community to decide if that is aligned with Catalyst values. Voters may also raise some concern with the acknowledged fact that grass straws are more expensive than plastic straws, which might cause this product to be found in the same sort of purgatory as paper straws. I think this section of the proposal could benefit from some market research on grass straws and how this team stands out from the competition. Aside from concerns about the legitimate possibility of having any impact on the Cardano ecosystem & adoption, this seems like a very clearly positive proposal to me that earns my confidence with the honest effort put into considering risks. \n", "q0r": 4, "q1": "For comprehensive transparency, impressively specific detail in roadmapping, and strategically efficient use of funds, this section earns a 5 from me. If voters are evaluating the feasibility of this proposal through the lens of the capability of the core team, then this plan is in demonstrably good hands. The team appears to have a comprehensive set of skills relevant to this endeavor, including ecommerce and global markets. The spending appears to be impressively efficient and spent entirely on the investment of the operation (not to any self-determined salaries to the core team members). The only concerning part of this section I see is the reference to Amazon webstores, which doesn’t have impact on feasibility but does further impact the capability of this proposal to contribute to the Cardano ecosystem. The roadmap is plenty detailed for a long-term timeframe, so this section effectively provides voters with assurance that this team knows what they’ll be doing every step of the way. ", "q1r": 5, "q2": "For the most impressive auditiblity section I’ve ever seen, that provides a variety of success metrics, timeframe based KPI, and even a revenue model that shows the break-even point, I rank this section a 5. In terms of defining success for what this proposal aims to accomplish, I don’t think there’s any denying that this team has very clear targets on where they intend to be, so much so that they target 10-12 months to see a positive ROI. I rank this section based on the auditibility of what the proposal aims to accomplish, not based on its contribution to the Cardano ecosystem directly. If there are voters that are specifically looking for this assurance, it may benefit this section to include direct metrics on how much ADA revenue will be aimed for and what actions the team might take to reinforce this impact. Aside from that, this section provides everything voters could possibly need to prove that they have very thorough and ambitious definitions of success. Unlike most Catalyst proposals, this section enables effective guages that will help the team monitor progress in a way that keeps productivity up and allows the team to know if adjustments need to be made along the way (if KPIs are not on target). I’m very impressed with this proposal and especially this section. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10337, "q0": "I hope the idea of this project will become reality and get the success. First, there will be the significant change for the environment. Second, it will contribute to promoting entirely the image of the cardano ecosystem via the payment by exchanging ADA and there are not many projects that bring the real value in VietNam and this project will help to change this perception. The author mentioned many risks that could affect this project's delivery and i think that among difficulties existing the team should have more careful research for solution as proposed. Moreover, i see the KPIs listed in detail for this part with the explanation of each job made me feel more confident about this project.", "q0r": 4, "q1": "To get the success I think this project need a long term from the stage of seting up to the stage of running. So in this part the author gave the full detail of all the aspect that will encounter when it is on-going. The roadmap was devided into 2 phases with many tasks proposed quaterly that quite clearly, but in the part of hiring the worker and team member for this project i think the proponent should give more details, because this project need too many section with the capability  of experienced human resources to manage. And this project need tobe funded continuely for phase 2 as mentioned. I think this project is feasibile but need a long term period with the effort of the leader as well as the participant who will support this idea for saving the environment and bring  the cadarno blockchain to the community's real life.", "q1r": 5, "q2": "It is provided community tracking via  channels as well as clear timeline to measure challenge progress, the point for me is that how can measure the community awareness of saying no to  the plastic straw in just 1-3 months? I think that the habit of consumer can not be changed easily in just few months. But i found that an offer of 20% for ADA payers as the proponent suggests can contribute to the motivation of customer using grass straw. The success of the project with the cardano platform payment via ADA coin will be a great  prospect for the new era. We are eager to track the continuation of this project.", "q2r": 5, "assessor": "z_assessor_3182", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12068, "q0": "The proposal \"Cardano NO MORE Plastic Straws | C4O\" is proposed to match the challenge, to solve the problem that too many animals and marine life are victimized and hurt by plastic straws and garbage. plastic waste into the ocean, the environment is affected. Does Cardano know that? How does Cardano act to solve this problem?. The problem solved the 3 questions of the Challenge. It provided solutions to a problem in the development of the Cardano community and also in the protection of the environment. The solution is to produce natural grass straws to replace plastic straws. The goal of reducing waste is plastic straws into the ocean environment. ADA payment integration. Therefore, this campaign will help raise awareness of increasingly urgent environmental protection and encourage the Cardano community to switch to using more eco-friendly straws.. The proposed team gives evidence. specifically in the presentation with appropriate arguments. The proposal identified a number of risks in the implementation process and proposed solutions to overcome all those risks. Those risks are climate change causing drought, salinity, water shortage, affecting the development of raw material areas. The price of natural grass straws is higher than that of plastic straws. Crypto price fluctuations can cause the project to be underfunded. The covid-19 epidemic disrupts the export and shipping chain, which can lead to long and slow shipping times and delivery of final products to overseas customers. The way the project overcomes it is to dig natural water reservoirs, storing water for farming. Maintain and protect new material areas to cope with changes in the natural environment. Exploiting and discovering new material areas that have not yet been affected by climate change. Will test plant varieties that can adapt to new soil and weather conditions; Regarding Crypto price fluctuations choose cash payment and ADA; There is an abundant supply of natural grass, self-reliance on self-grown grass. Currently, Covid prevention measures have been stepped up, so the supply chain will soon be restored. Create material sourcing and automation in the production line to reduce costs and reduce the price of grass straws. . Restaurants and consumers have a habit of using plastic straws a lot, which seriously affects the environment. Propaganda in shopping centers, restaurants, schools the harmful effects of plastic straws and plastic waste.. The prediction of many risks shows that the project is carefully and meticulously prepared. In line with Cardano's vision that IOHK and the Catalyst community are working towards the goal of “Make the world work better for everyone”, our slogan is “For the Future, Together Save the Earth Me” Rating: 5 points.", "q0r": 5, "q1": "The proposed proposal shows a detailed and reasonable plan or target to perform the work. Regarding the timeline, the Proposal is divided into 2 phases of implementation in 4 quarters. Stage 1: Initial goal. Stage 2: Global strategy. The balance of time with a suitable work plan. Check project progress at Telegram, Facebook Fundraising $86708, less than 5% of Challenge. Budget with a reasonable spending plan. There is an additional estimate of $7,882.5. Proposing to assign specific tasks to each member; Have experience related to the assigned task; The identities of team members are easy to verify. The group consists of 3 main members and 2 teams of technical and technology experts. All members are assigned specific tasks. Identity verification at Linkedin, Github, Twitter and website..I rate 5 points", "q1r": 5, "q2": "Proposals provide KPIs, making it easy to accurately quantify a proposal's effectiveness and easily test it. Projected adoption metrics / Public SNS channels will be used to exchange project progress and information with the community such as: Community activities: Telegram, Facebook…; Project progress: Construction of grass planting area;Setting up production line and installing machinery and equipment;Starting production of grass straw; Hire 10 local workers;…;Breaking point in Capital. Check easily and quickly on Website, App.. again, the project is successful with all participants and everyone wins Win-Win-Win…Farmers have jobs; Cardano is liquid higher payouts for ADA holders;The environment is not damaged by plastic straws; Proponents and implementers add creative impetus; Create good effects for society about cryptocurrency and its purpose; Increase green area, reduce CO2, keep water.And win many more…Successful specific project is to create a good mindset for those who want to apply for Cardano funding to develop other eco-friendly products. In the future, with the profits generated from the current business, it is proposed to continue to invest in other similar business models based on the experience and knowledge gained from this project. . Success is related to Challenge. Test product is available. Originating from another project has adjusted the project's time and budget, which ensures a low-risk project more and ensure the successful implementation of the project. In addition, the proposed headline level is consistent with the United Nations SDG's Sustainable Development Goals, Goal 14. Conserve and sustainably use the oceans, seas and marine resources for sustainable development. If funded I think the proposal is in the top 10% of votes. I rate: 5 points.", "q2r": 5, "assessor": "z_assessor_3353", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14445, "q0": "The proposal is a startup for grass straws as a replacement for plastic straws which integrates ADA payment. This closely adheres to Cardano’s mission aiming at world betterment. The project is founded based on concerns for the environment and marine lives. The proposal introduces a type of grass that is capable of making into biodegradable straws with clear benefits for the environment listed. With an environmentalist foundation, the project manages to specify their positive impact on the Cardano community. The grass straw is envisioned to replace plastic straws completely in some countries. Therefore, Cardano will receive more publicity if it involves itself in this environmental project and expands its brand awareness through these relevant projects. The integration of ADA currencies in purchasing these straws directly benefits Cardano liquidity, as mentioned by the proposers. Another strong point that is being mentioned is that this project could be the pioneer for blockchain technology to engage themselves in the sector of environment. In the future, similar eco-friendly products may follow suit, popularizing the Cardano community. The solution is clearly demonstrated in step-by-step procedures from production to export to payment. The idea of cash and ADA payment with the latter being offered with a discount is a good way to utilize ADA while still being flexible. This paves the way for gradual transition to ADA. The proposer is able to list the positive impact on not only the Cardano community but also for the environment and local employment rate. The KPIs are reasonable and easy to track. The main risks and mitigation are clearly brought forward and are well-aligned with each other, with the mentioning of agricultural risks, pricing, risks from the pandemic and the volatility of ADA currencies. As the solutions to mitigate these are clear and sufficient, it gives the impression of a well-thought-out proposal.", "q0r": 5, "q1": "The timeline is detailed and well-presented with two phases lasting until 2023. The specific activities in Q2, Q3, Q4/2022 and Q1/2023 show a comprehensive plan that caters for production, employment, and lobbying which increase feasibility. The plan shows that the project aims for the global market as well, with the main target being the developed countries in Europe or Japan that highly appreciates eco-friendly products. The plan has the vision of short-term, mid-term and long-term success. The budget breakdown is done satisfactorily with each expense clearly specified, allowing for transparency. Team members are given with specific names and linkedin which provides reference for credentials, who are all specialized and experienced in the technicalities of quality control, software development, international trade, e-commerce as well as environmental start-ups. The team also has Cardano experts from ADABoys Lab. The proposer has set up a sufficient team with people covering all the necessary positions required in making this project successful. The reason for further support in funding is reasonable.", "q1r": 5, "q2": "Key metrics are quantifiable using social media tools on Facebook, Telegram and Clickup. ISO standards are also applied in the project which assure the quality of this project. The proposer goes as far as to provide the formula for break-even point and give specific figures for it. The vision for success includes employment created for farmers, the environment being protected, the investment received from ADA funds is recycled, Cardano receives more liquidity. SGD goals are detailed and well-aligned with the solution proposed. Overall, the proposal is really exhaustive in auditability.", "q2r": 5, "assessor": "z_assessor_4055", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14889, "q0": "The enviroment is increasingly being destroyed by humans, thanks to the project to reduce plastic straws will help the world a lot. They have given bad results as global problems including environment, waste, carbon emissions, green energy and food caused by plastic straws. Because it cannot be decomposed, it cannot disappear, and it will cause harm to the marine environment along the water route. I completely agree with the way they give coherent and convincing arguments, the evidence of which can be found almost all around our region. The project mentioned a youtube video but still no link, need to add a few links to a short clip about 2-3 minutes long to give an example. The team is also worried about the problem that plastic straws may be discontinued in Europe, the US, and Japan in 2023, so creating a straw made of natural grass will help increase income and develop public health. . They researched and discovered the natural grass straw field in the Mekong Delta – Asia, which shows how dedicated they are to the project. In addition, they also provide information about natural grass with full functions and 100% guarantee of no harm to health. The values they bring will help inspire other people to work on new eco-friendly products. In particular, they also mentioned ADA, a useful means of transaction during the epidemic. They are even more careful than showing themselves a picture that clearly summarizes their purpose. Each section is clearly numbered so it is easy to observe and follow each stage. First of all, it is reasonable to use 7-8 months-old sedge plants to start planting because at this time the plants are in the growing age, but not yet stated what type of soil is used and not How much is the area, for example, the type of soil in a wet or dry environment, how many square meters. Projects that provide jobs for local people can help them get jobs. Advertising works great because it knows how to leverage social networking sites that connect people. The team not only wants to develop domestically but also for export. Especially, the online method is quite reasonable in the covid situation but has not said how to use it to get the best incentives. The progress of the project is completely synchronized and closely aligned with the KPIs they have given. I believe that after the project is completed, it will receive a lot of support and have a positive impact on the human environment because of the meanings that the team has given me. I completely agree. They present the challenges of the cost of natural straws is higher than producing plastic straws. And especially emphasizing and full on how they can do to reduce the risk caused by the weather, although I am not an expert in this field, I can completely understand and agree with their way. handle. Just as the amount of money traded on ADA is always volatile, they also need to focus on it. Each risk they put forward includes a solution below. I believe the project has really brought about a sustainable and environmentally friendly economy.", "q0r": 5, "q1": "To avoid confusion, the road map has two distinct parts. There will be two timelines at the beginning, Q2 and Q3. They intend to establish a factory and working groups, but they haven't specified how big the space will be or how many people will work there. They should also specify which media they'll use to introduce their first product. The early stages' activities are perfectly reasonable and organized in the right order. In the way the product is made, I also see commitment and care. The project campaign's second phase will primarily consist of propaganda and advertising, and I really like how the slogan raises awareness of the negative effects of plastic straws while also promoting the ecosystem Cardano’s  sustainable green. They grant successful wishes that are timely and have positive effects on the community and the economy. The costs are very thorough and simple to calculate, and they account for any potential risks. to incur unforeseen expenses. The total price is the last item. I believe they give each budget a lot of thought. There is a total number of people, not just generally speaking, as the team members are not discussing their industry but are quite full of experience. They are all experts in IT and green products, so the project will definitely be completed on time. The group responded to the query, and in their response, I could see their enthusiasm for their work.", "q1r": 4, "q2": "The team has come up with popular social networking sites but can't say how they will work, can be added such as creating a page to promote or post an article and share every day, so it takes time. will be online like how many hours a day should be spent on the internet. They will use the Clickup application but have not yet told how to use it for members. The team gives reasonable numbers and calculations to be able to reach the break-even point in 1 month, but suitable for those who have sharper calculation ability. I strongly agree with the definition of success that the team gave. Not only it helps people get jobs but also helps the earth reduce waste. Thanks to the product of plastic straws that change people's thoughts. Offering eco-friendly options that are enough to provide a source of raw materials for life. The team has a good marketing plan such as giving trial products to customers, I think the proposal should have more ideas such as calling to share with friends and family to make the project more and more spread and develop.", "q2r": 4, "assessor": "z_assessor_4108", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "Dear vPAs PAs \nThank you for assessing our proposal. \nAll comments are great and meaningful for our proposal, the scores do not match the rating. \nI think this assessment is inappropriate, no and it should be filtered out.\nThank you so much"}], "solution": "We produce natural grass straws to replace plastic straws. The goal of reducing waste is plastic straws into the environment ocean. Integrate ADA payments.", "experience": "We are startups from technology to environmentally friendly products applying high technology in production and consumption. With 15+ years working in many countries such as Japan, USA, Netherlands and Vietnam with experience in technology, marketing, eCommerce, retail & export."}