{"id": 414441, "author": "seirayun", "title": "Impact lending for the unbanked", "url": "https://cardano.ideascale.com/a/dtd/414441-48088", "category": 26595, "amount": 63600, "description": "Financial services for 1.7 billion adults who are unbanked are limited. Microfinance’s interest rate (global average: 35%) is much higher than that of bank credit (10.31%). 日本語", "f6_no_assessments": 5, "f6_rating": 4.800000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 1611, "q0": "The proposal is excellent, meeting very precisely the objective of the challenge of increasing the use cases of Cardano technologies, bringing new users to our blockchain. This is because a DeFi platform would be developed focused on making loans with lower interest rates than the traditional banking system, these loans would be carried out with Dapp's own digital asset, carried out on the Cardano blockchain. The intention is to allow those with less conditions to obtain funds to carry out projects and break the cycle of poverty, according to the proponent; benefit, in other words, the population that cannot access banks. I believe that the crux of the matter is perfect, and in addition to most likely bringing new users to Cardano, it contributes to the wider ideological goals of the ecosystem, since this Dapp would have a socially beneficial role, contributing to an improvement in the quality of life. of the people who use it. My two observations regarding the impact are: first, I would like to know how people who don't understand the cryptographic universe would learn to transact on the blockchain; would the Dapp Socious interface be user-friendly, simple, ergonomic? Would there be a tutorial, some way for people who don't know about blockchain to learn how to ask/offer loans? I was also in doubt about the active token used; what would be the market value? I did a little research, but couldn't find this data. Another question I thought of was - how exactly does this impact scoring system work? Unfortunately, nowhere in the proposal is this detailed. Perhaps Dapp is also made up of other parts, other tools, which as users use will increase or decrease their points. But it would be important for us to have complete clarity about the working mechanism of this point mediation; that would make us understand more solidly how the loan system would work. In general, I believe that the proposal is very well aligned with the objectives of the challenge, it will generate a Dapp of value, which can provide financial opportunities for those who need it and cannot find the means in the traditional system; which automatically generates an increase in the number of smart contracts and membership of active users on Cardano, even if it does not involve Ada, directly, but another active token also relevant to our ecosystem. My reservation is in relation to the aforementioned doubts, which, if clarified, would increase the degree of understanding about the impact of the project.", "q0r": 5, "q1": "The script starts in a way that I consider ideal. The temporal division is initially done by months; we know what would happen in each. Even if not much detail is given regarding the activities, due to the degree of temporal specificity and the vast number of topics (corresponding to goals/tasks), it is possible to have a solid understanding of the process in these initial months. However, this level of detail decreases over the months: from the fourth to the sixth month, for example, it is said that the KPIs would be monitored, the technical documentation prepared and the final report delivered. How would KPIs be monitored? Who would, and how often? By the way, what would these KPIs be, exactly? How would the technical documentation be prepared? This work is extensive and complex, it would be important to clarify what the work routine of the professionals involved in this part would be like. Overall, I believe that more details about the activities would go a long way towards increasing understanding of the process. Talking about the team, in turn, this part is perfect. We know in detail who the members of this team are: their names, roles in the project, a resume of what they have done so far, how they relate to Cardano, and their linkedin profiles are also provided, where we can verify all the information passed. . Due to this detailed presentation, total confidence is conveyed to the professionals involved, we know what they have done so far, which generates certainty that they are capable of carrying out this project more successfully and calmly. Finally, in relation to financing, information is passed through a table. We know in a superficial and basic way how the requested money would be used, even though some important and necessary information is given - for example, what would be the expense, how many people would be involved with it, how many hours each person would dedicate to that activity (and also the total number of hours that would be allotted for each activity), some activities, such as the development part, are quite expensive ($30,000 is asked for just that). So, a little more detail about the work routine of professionals in this area could have been provided; the asking price per hour of work ($100) is also high, more than I see in most proposals. I found the value expensive, but it is also up to the other PAs and voters of the proposal to conclude this; the professionals are well qualified so in a way the hourly rate is justifiable. So, regarding the topic of feasibility, I believe that we do have a viable proposal, it is possible to visualize how the plan would be put into practice. Some improvements could be made, but overall it's still a very good topic as well.", "q1r": 5, "q2": "The auditability of the process is perfect. Regarding the measurement of progress, the proponent gives us a lot of assurance that the development of the project will be monitored carefully and periodically. We know some direct numerical metrics, which would be the number of users who will receive loans and the amount of loans; and qualitative, such as “Impact Lending smart contract code deployed and available on GitHub” and “Impact Score code incorporating Impact Lending transactions deployed and available on GitHub”. Furthermore, the process behind such partial results will apparently be very well monitored. According to the proponent, the process itself will be accompanied by the Agile methodology, based on the tools of Trello and Github (it would be interesting to give a brief explanation about this methodology, for those who don't know). This progress will also be reported as Sprint Burndown. Not enough, the proponent states that monthly reports will be prepared and that the team would participate in Townhalls and community events, to keep the contact always active. I thought they took a lot of care to make both the end results and the tasks behind it achievable by the Cardano community, suggesting various ways to look at this and also establishing various channels of communication. The final success is also well defined, we know how this scenario would be considered reality. It is said that a final report and technical documentation would be made, but I think it would also be important to develop surveys in accessible language to prove that the desired effects were achieved. In fact, did more people have access to loans? More users have become active members of our community? How can we prove the beneficial social effects generated with this DeFi platform? I believe that the proponents will do this type of analysis and make it available to the community, but it would be important that this be ensured in the detail of the proposal. However, I will give it maximum marks, because it seems to me (because of all the material that will be made available) that this team is very aware of the importance of monitoring as much as possible all stages of the process.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 10, "ne": 8, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1193, "q0": "This is a proposal on unsecured lending services for users who have difficulty accessing loans from banks. P2P lending is completely decentralized on the cardano platform - ie directly between lenders and borrowers. This will ensure unlimited capital. At the same time, the project can fully develop and expand customers globally.\nAs we all know, in less developed countries in terms of banking services, people have to borrow through other forms with very high interest rates. This slows down economic development and widens the gap between rich and poor. Therefore, if this project is successful, about 1.7 billion people around the world will benefit from this service. (data as analyzed by this project). That's why I support this project with the highest score.", "q0r": 5, "q1": "The project has a pretty clear plan. In this section they divide the work by month of work.\nThey will develop their application through website and mobile application. And they will deploy the project from September 2022 to February 2023. Estimated time is 6 months and the goal is to become a decentralized autonomous organization (DAO) by 2026.\nThey attached a cost proposal, which I went through and found to be perfectly reasonable costs, calculated in hours worked.\nProject member info section, they have public linkedin and github profiles and related experience for each. This makes me appreciate it.\nHowever, they have not presented in-depth solutions to the risks when implementing the project, especially the risk of bad debt appearing in the platform, and the guarantee of interests for borrowers. Perhaps this is the biggest drawback of this plan.", "q1r": 4, "q2": "They have a website and technical updates available via github to support reporting. Also, they use an Agile (github) approach for reporting. These are all popular tools, easy to track progress, easy to update information.\nThey also set clear KPIs, consistent with the content they presented in the previous two content sections. The parameters of the number of users using the loan service, the amount of capital granted, the number of new wallets of the cardano platform... as of the end of December 2023, to measure the success of this project.\nThe team is open-minded, committed to actively participating in regular project meetings. This makes me appreciate it.", "q2r": 5, "assessor": "z_assessor_2217", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4633, "q0": "The idea is not new but very good. Because this is the idea of ​​setting up a Defi mobile application for people without a bank account, doing peer-to-peer lending (P2P Lending) using a guarantor's reputation. Proposed is a new improved version of P2P that uses credit history assessments, and common credit scores.\nThe proposal solves the requirements of this challenge such as contributing to increasing the number of new users on the Cardano ecosystem, increasing products and apps for the community to use, and enriching the Cardano ecosystem. And this is also a solution that integrates existing solutions such as Muilkomeda and Proofspace wallets that have been built on Cardano.\nThis proposal, if successful, will have a great impact on increasing utility on Cardano, attracting the unbanked user community.", "q0r": 5, "q1": "The proposal is highly feasible. The reason is as below:\nThe plan is written in great detail. The timelines and corresponding work items are given very clearly. In particular, before implementation, there are always steps of research, analysis, testing, monitoring, and evaluation. Besides, the technologies and techniques used to set up the application are also listed in detail. This shows the scientific and logical thinking of the proposer. I believe project managers can track progress and manage projects well with this planner.\nThe budget is calculated in detail. The items are clear, and the necessary costs are explicitly calculated and clearly. The total budget is less than 1% of the Challenge's budget.\nExperienced development team, highly specialized knowledge, rich life experience, active social activities. All have attached links, and proof of expertise. This is an experienced and reputable project development team. Therefore, project management and operation, in reality, do not seem difficult for them.\nFor the above reasons, the proposal deserves a high score for feasibility.", "q1r": 5, "q2": "The proposer provides quantitative indicators and KPIs to measure project progress. Specifically, 1000 users will receive a loan, the loan amount was 300000 USD, and 1000 new Cardano wallets. The proof of project completion is also clearly listed. In addition, in addition to the community and Catalyst tracking progress through monthly progress reports, it is also possible to track and check the progress and activities of the development team through GitHub, Trello, and Sprint Burndown. The proposal is very clear and highly transparent.", "q2r": 5, "assessor": "z_assessor_2578", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6001, "q0": "This proposal builds a decentralized lending and borrowing protocol. A Defi app called Socious Impact Lending allows anyone to access most financial services without going through a bank. Lending and borrowing arrangements were presented in the proposal with the protocol's native token THANKs. The innovative idea here is that instead of assessing credit scores based on collateral or history credit, this protocol will be evaluated based on the Impact score, the calculation of the Impact score is also presented in the proposal. This proposal addresses the \"Dapps, Products & Integrations\" challenge appropriately. Here we have a product to increase the utility and adoption of Cardano. We have a Defi application to increase the number of daily/monthly users. Thereby enriching the system. ecology with various use cases, increasing on-chain activities as well as the number of individual wallets.", "q0r": 5, "q1": "Here the feasibility of the project is relatively high. I will go over a few aspects for us to discuss.\n- The first is about the risks and challenges involved when implementing this project. I agree with all the risks that the proposer has listed for us but there is still a big risk in my opinion. It is the code of our project that is safe and error-free. To limit the risk that hackers can find system vulnerabilities to perform user withdrawal attacks, the measure to reduce this risk is audit code (by a reputable 3rd party in the market).\n- The second is about the roadmap. The project will be implemented within 3 months to launch the product. The first month is to complete the workflow and conduct UX design/engineering architecture, the second month (October 2022) is to complete the architecture and run tests. As far as I understand, the project already has a blueprint for the protocol available from the beginning to be able to implement immediately within 2 months. So how does this protocol work, is there a blueprint for the protocol security mechanism? What about the risk management mechanism, asset liquidation when the user fails to return the loan? I think we can solve the above questions through a diagram that describes how this protocol works, helping users and the community better understand our project.\n- Third is about budget breakdown. I find it unreasonable to take into account the system engineer's salary and the cost of marketing. Both have the same rate of $100/hour. The effort of the programmer is higher because they have to use a lot of gray matter and the accompanying responsibility is higher due to ensuring the security of the software. So I see an asymmetry when balancing the costs for these two positions. I have suggestions to adjust accordingly to ensure adequate budget balance for implementation.", "q1r": 4, "q2": "The audit side of the proposal is high. We have evidence about the members who will be involved in this project, who they are and what positions they hold in the project. We can check the progress of the project. What stage is the project at through code updates that the project will post on the Github page (https://github.com/socious-io) The KPIs given are appropriate for measuring progress. The success of the project through the number of users, the total value of loans and the number of new Cardano wallets, thus, the proposal has clarified the transparency as well as the way to track the project.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13999, "q0": "The productivity of the protocol will assist the Cardano ecosystem to attract a large number of new users and also diversify the features of Cardano’s blockchain system. I think the idea in this proposal is quite practical since it allows the users to access financial services which are not necessary to be approved by the bank. This idea is to build an Defi app named “Socious Impact Lending”. This would be a timesaving and convenient approach and impact largely on our community. The THANKs protocol is applied to evaluate the impact score rather than relying on collateral asset or credit history. By this proposal, the lending users are able to earn interest that borrowing users pay. The mechanism of the protocol is described in detail on how to calculate the impact score, which base for allocating the interest rates reasonably, etc. The potential risks and corresponding strategies to solve them are also presented in detail perfectly. This proposal is really appropriate with the challenge in \"Dapps, Products & Integrations\".", "q0r": 5, "q1": "From all answers below each question, it is obvious to see a relatively high successful possibility and of course still contains a little of the unreasonable points that are presented in the description. Firstly, the proposer provided a general roadmap of how to develop the proposal chronologically. The proposal is divided into two main stages as my understanding towards the roadmap, which are before and after the launching stage which totally costs 6 months for completing. The team will provide a final report after 6 months. There is a brief description on which technical aspects are involved during the project’s time. However, there should be a more detailed mechanism description for the protection or managing risks as well as other back-up like what decision for asset if the user is not able to return the loans. I think there would be a number of voters who have the same questions as me. Nevertheless, I agree with the list of risks and challenges that are predicted to incur if the proposal is activated, honestly. I just have a small suggestion that it would be better if the proposer can mention the risk that the system may be attacked by hackers through the break/errors of it and withdrawing the users money either from lenders or users. This one would increase the reliability of the proposal since the voters can observe that the team has predicted all possible risks and prepared the back-up solution for it. On the other hand, the proposer has provided full information of each member in the team and their relevant experience toward this time fund. People in the community can verify that information easily via the attached links in each member’s description and make decisions whether to vote or not for this proposal. I am quite impressed by the profile of some members like Cristhian Tejada, Jayson Ilagan. Last but not least, the budgeted plan has shown a big problem that the developing engineer’s wage and the marketing cost are calculated unreasonably. Due to the number of listed risks and the danger of them, the developing engineers have to try their all best and a lot of efforts are involved in order to build a strong enough system and coping with those risks or there would be none of guaranteeing for the sustainability of the system and the commitment of the user's money security.  Thus, it is obvious to see the importance of these developing engineers much higher than the marketing section. As the Cardano community’s scale is very large and it is not much difficult for the team to attract the number of users in the community when they introduce the system and then, spreading the app to a larger number of outside users if they know how to take advantage of the available crowd in the community. Briefly, I am pointing out the difference between how hard developer engineers work and how simple the marketing strategy can be. Then, it is unreasonable for the same amount of money for these two sections. In other words, the team should consider the balancing level of payable wage for them and the reasonableness of the use of funds.", "q1r": 4, "q2": "The auditability of the proposal is written in very detail, and I have compliment on it. The targeted KPI is mentioned here to simplify the evaluating process for voters and also indicates that the team understood what they have to give effort for in order to achieve the key “success” of the proposal. By the project code, which is updated on Github, the voters can keep track of the progress easily and quickly.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A P2P lending platform with low interest rates for the unbanked, powered by Impact Score instead of credit history.", "experience": "Socious is a fast-growing impact community with 1,000 MAU, supported by 500Global and Microsoft. The team has extensive experience in the impact sector and is comprised of experts in impact measurement, finance, data science, and blockchain development."}