{"id": 414477, "author": "uptodatedevelopers", "title": "ADA to Mobile Money App", "url": "https://cardano.ideascale.com/a/dtd/414477-48088", "category": 26595, "amount": 44000, "description": "Many Africans refuse to receive ADA cryptocurrency because of the difficulties they face in exchanging ADA into a locally used currency.", "f6_no_assessments": 16, "f6_rating": 3.4375, "videos": [], "media": [], "f6_assessments": [{"id": 1613, "q0": "Yes, the proposal is aligned with the following specific objectives, present in the challenge summary: “increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products”. However, I did not find the idea of ​​this proposal so innovative. It is about creating a mobile application, which would operate on Android and IOS, to convert Ada into the local currency of the Democratic Republic of Congo. The proponent claims that many Africans are resistant to receiving payments in cryptocurrencies due to the difficulty in converting them, but I believe that this functionality already exists on Binance, in a very simple way. Instead of suggesting the creation of another Dapp, it might be interesting to educate the local population about the use of the tools that already exist. I believe that in this way the objectives of the challenge would be achieved, that is, more people would start buying/selling/delegating Ada, becoming active members of the Cardano community, as they would better understand how to carry out transactions on the blockchain, which would then expand the popularity of our ecosystem. I believe that the asking price of $44,000 should not be directed towards developing an application that would have functionality that already exists. The proponent cites some advantages of the project he intends to develop, such as being “possible to receive ADA cryptocurrencies from anywhere, giving the possibility to go through any African telecom operator for conversions into Mobile Money” and optimizing the “conversion structure to maintain rates as low as possible while opening up its API to any developer who wants to integrate it for ADA to Mobile Money conversions.” It would be interesting if these features were better explained; in this way, perhaps we readers of the proposal would understand the differential of this service, if compared to the brokers that already exist. Therefore, unfortunately, my opinion (based on the arguments given) is that the proposal does not have much difference in relation to pre-existing Dapps with the same purpose; despite achieving the objectives of the challenge by facilitating transactions in Ada, the asking cost is high, and I believe that it could be better used in a more focused approach to educate the target audience, such as, for example, holding some events/workshops addressing this theme, teaching people. So, in general, the proposal fits with what we are looking for here, the idea is good, although I think that the same topic could be approached in another way, which maybe can better take advantage of the applications that already exist on this subject.", "q0r": 4, "q1": "In general the proposal is very viable, the topic that I would like a little more detail would be the script. The explanation regarding this is reasonable, but it is not detailed enough so that we can understand well how the process of producing this project would develop. The whole is divided into phases, and these are briefly explained. Some phases last longer than others, but none of them have very detailed activities. It would be important for the phases to be divided more specifically, such as by month, and for the activities to be better detailed, for example in “Creation of the ADA Exchange App wallet with the possibility of sending and receiving ADAs”. This activity is complex, what would need to be done to make it happen? When it comes to the budget, the level of detail is quite choppy. For example, $7,000 is requested for 3 activities: “Detailed Study of the Problem, Implementation of a Basic Architecture, and Grappa Proposal”. How would those 7k be divided? How much would be for each, and why would this value be necessary? In other parts, as in administration development, with the senior web, we know that the work would be 6 hours a day with 10 dollars per hour (quite detail and full understanding of the expense). However, when we get to UI/UX design, $1350 is asked, but we don't know how many hours the designer would work, so our level of understanding has already dropped. Therefore, I think that the explanation should be more balanced, that we know better how the money would be used in all cases. Finally, looking at the team, this part of the proposal looks great. A part of the team is presented on the attached website (I had to dig around a bit to find it); where we see your linkedin and twitter photos, names and profiles. Here in the scope of the proposal, I present a curriculum of them, and we know if they have experience with Cardano or not; for example in:” Vital yengayenga: Community Manager | RS content strategy, Digital Marketing, Graphic Design, User Experience Design (UX), Copywriting, Copywriting, User Experience Writing, Content Strategy, Blog, Languages ​​: French | English + linkedin profile; and also: Luccin Masirika: Web and Web 3.0 developer, Software Engineer | Web & Blockchain Developer at Update Developers, Development and design of new relevant web technologies. Design of optimized web applications, Data structure, Productivity and professionalism on adequate solutions,, Specialized in JavaScript d, Backend: NodeJs, Language: French + linkedin profile”. In fact the presentation of the members of this team is very rich and satisfying. Finally, I think the feasibility is good, having some points that can certainly be improved, so that the process is better understood, that we can understand more about the project development process, mainly, which is the part that is less detailed .", "q1r": 5, "q2": "Unfortunately the suggested auditability is quite superficial. Regarding the process, it is defined that updates will be posted on Gitbook and Discord. But what kind of updates, exactly? And how often will they be posted? How will the community be aware when news goes live? I would like these details to be clarified better, so that we have more peace of mind about how this development process would be monitored. The project is complex, creating a Dapp always requires a multidisciplinary team, so it is important that we carefully follow every step, from small advances to problems, and how they were resolved. The information given is the beginning of the right path to be taken, but it is not detailed enough; Will they report on their work routines, the unfolding of the phases, or just the partial results obtained? Talking about the ultimate success, the proponent defines it as the existence of the “First tests of the application by beta, to fix the first version of the application that will be published”. However, in my view, this is not enough to understand whether the project actually achieved the desired results. In addition to the launch of Dapp, we would need to understand several things: 1) how was the acceptance of the target audience? 2) has there been an increase in the circulation of Ada in the Democratic Republic of Congo, as a result of this initiative? 3) how are people who have started using Dapp involved with Cardano, become active members of our community, and if so, through which projects? 4) what was the number of transactions reached per month, and of Ada circulating? Finally, we need more data so that we can truly understand whether the specific objectives of the challenge were met. In general, I think that the auditability of this proposal lacked a lot of depth - it is well underway, but it does not correspond to the totality of information that we should know to guarantee that the project would be well monitored and studied, after being launched. Much more detail would be needed for this topic to be adequate, both in terms of the auditability of the process and the final results - the proposal was keeping very good until then, but unfortunately I declined in this last topic of analysis.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "We have read this last part on auditability, and we say thank you for these very crucial remarks for this project, but then let's point out that we have launched anquette with google form on how the population could, 1. understand the project and 2. For github and Discord, not to mention Trello, these platforms are dedicated to the tech community cardano who would like to follow the project in tech format, but this says for the non-tech community, we will create a mini web platform called Atm_money Forum, In this part we will have to publish statistics on the number of transactions, track a conversion, filter by region of transactions, new users, active members of our community, total users and many other important states for the transparency dedicated to the community."}, {"id": 1506, "q0": "It's not a terrible idea to trade the local currency in Congo for ADA using a mobile app designed to look like a FOREX trading platform, and vice versa. by developing an application for the ADA exchange that can receive and convert transactions using ADA as well as the local currency of the Congo. But in point of fact, I also need you to answer some of my questions, such as the fact that the current CEX exchanges in the Congo are not even available for you to come up with an idea like that because they are so underdeveloped. The ADA exchange app, which includes integration with personal wallets, is the next step. Another thing to consider is the legality of the situation; in that area, the government has really acknowledged the presence of cryptocurrencies, and people are able to conduct normal business. I hope you guys can answer my questions and provide additional information. to add to your proposal. The team believes that the rollout will take place in the Congo. However, there is no reason why it couldn't take place in other parts of Africa, particularly in regions where the growth of the Cardano ecosystem is robust. Trading in cryptocurrencies is an issue that is completely acknowledged.\n\nYou have mentioned that the most challenging obstacles the project encountered were the problem of users, developing the community, and making people aware of cryptocurrencies in general as well as Cardano. However, the solution to the problem that what you put out did not really satisfy me personally requires everyone to have hope and faith in it, as you have stated. Therefore, I give this impact a score of 3 points.", "q0r": 3, "q1": "Your proposals have been sent to funds 7 and 8 with a rating that I consider to be average, and it appears that you have no intention of editing your proposal in either fund 9, nor do I see that you have no intention of editing your proposal in fund 10 either. You have copied the majority of the items from the previous fund 8 without making any edits. There is a section that reads, \"We want to provide a working proof of concept for Fund 8,\" and you have left it unaltered so that it can be incorporated into your content. The rating that was given to your suggestions is one that I would classify as being about average. Concerning Fund 9, I believe that you ought to pay a greater amount of attention to the reviews and comments made by the members of the community so that you can add suggestions that will assist in making your proposal better in the future. In addition, I believe that you ought to pay a greater amount of attention to the reviews and comments made by the members of the community.\n\nRegarding the cost that you provide, I am of the opinion that it has been debated and calculated for a considerable amount of time, and as a consequence, the reasonable level that you give is acceptable. Regarding your team, this is a sizable group that contains components that can successfully build a project. However, in order to compete for the next fund, I believe you will need to improve the level of preparation you have. As a direct consequence of this, I will give a total of three points for the feasibility of this section.", "q1r": 3, "q2": "It is really about the progress and how to measure the progress of the project. You have also stated that there is a commitment to https://github.com/UPTODATE-DEV, but with such a community, it is really sketchy. We need to see the key performance indicators as well as the timelines. How is the project implementation roadmap done? And after the project is successful, will the community really accept it? It is shown by parameters such as the number of wallets created, the number of ADA transactions, and And from the perspective of the project's impact on society and the future, you will see what can happen in the future, as well as your successes and the exact achievements you have accomplished. Therefore, I will award this section's auditability a score of 2 points.", "q2r": 2, "assessor": "z_assessor_2254", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for these corrections and suggestions on the project, I'll start by answering the question about github and monitoring the evolution of the project, we have a github with more than 80 repositories (Projects developed) but also a github of the project ada to mobile money, the only reason for which is not visible is because it is in private mode, we also provided a workspace trello that will be public the major tasks and subtasks to allow a clear evolution of the project. Regarding the key performance indicators, we are still working on it with a collection of data on google form, we have not yet tried to finalize this part, but if ever the project we will do everything to present it. For the future of the project, we will add a very small commission for the exchange of ada to the local currency but not the other way around because we need community involvement in cryptocurrencies in Africa."}, {"id": 2190, "q0": "I feel this proposal is well suited for the challenge \"F9: Grow Africa, Grow Cardano\" (https://cardano.ideascale.com/c/campaigns/26600/stage/all/ideas/top) but can be debated.\nThis is a well written proposal and i believe i reviewed one of your proposals in another challenge.\nThe proposal intends to build a mobile app with flutter : https://www.flutter.dev (I am the King of Flutter in Africa, JK) \nthat will help in converting ADA to CDF (DR. Congo Currency).\nThis proposal did a great job at highlighting the challenges and potential solutions and a justification for the app.\nI will like to ask the proposing team if the laws in DR.Congo permits crypto on that level considering i am a Nigerian and in Nigeria \nthere seem to be a ban on crypto and it will be illegal to have such a service not even on mobile money.\nI will be giving 5 stars for impact according to the PA guidelines because this proposal is going to boost Cardano real world usage.\n\n** you can checkout the flutter (built the game engine) made card game here if you like card games:\nIOS :   https://apps.apple.com/us/app/id1488600103\nAndroid :  https://play.google.com/store/apps/details?id=com.sourcecard.whotfire", "q0r": 5, "q1": "This proposal provided a detailed roadmap with associated timeline of the events which looks realistic to achieve.\nThe budget breakdown is very detailed and justifies the requested amount.\nThe Details of the team members were provided alongside the verifiable links to the teams bio.\nI honestly don't have much to contribute here as this is a well written proposal.\nConsidering the presented information i feel confident that the team are capable of delivering the proposal to success.\nI will be giving 5 stars for feasibility.", "q1r": 5, "q2": "The proposal provided a GitHub link(https://github.com/UPTODATE-DEV) in which anyone in the community can track the progress of the proposal(Commits).\nI will encourage the team to try have also a link from lets say kanban(https://www.atlassian.com/agile/kanban#:~:text=Kanban%20is%20a%20popular%20framework,of%20work%20at%20any%20time.) or Jira that updates can be written for the non-programmers to easily understand what is going on.\nConsidering the provided information, i agree that the proposal can be audited but i will like more avenues to access how to measure progress and audit.\nI will be giving 4 stars for audibility.", "q2r": 4, "assessor": "z_assessor_2301", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "Thank you for these corrections and suggestions on the project, I'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders."}, {"id": 2575, "q0": "The issue proposed by the team gives a true response to the current crypto market realities. When users want to convert ADA cryptocurrency, they must have an account at centralized exchanges to be able to convert it into local currency. The problem with centralized exchanges is that KYC is complicated, security is poor, and users are forced to trust the exchange. those who do not know the technology background will find it more difficult to participate. so the Team proposed Design a mobile application that allows the exchange of ADA cryptocurrency to local currency through the Mobile Money app. If this is done successfully then any user with a smartphone can own and use ADA easily. This proposal was originally designed for use in the Democratic Republic of the Congo. They say that the App will work like a Forex exchange allowing users to exchange ADA from their wallet to Local Currency and vice versa. If successful, it could be applied elsewhere as well. They designed a mobile app that converts ADA into local African currency. If this is done, the ADA has the potential to be widespread in Africa. If successful it will also be deployed elsewhere. They presented themselves using Flutter an open-source framework from Google to build apps and using MongoDB as the database. The proposal raised the risk of attracting users and said that with this mobile app it would be easier to exchange ADA in local currency. From the above information, it is clear that the proposal fully meets the challenge.", "q0r": 5, "q1": "The proposal team is quite strong they have a group  Uptodate Developers, project leaders, and members. They have listed the positions needed to implement the project, each of which has a specific person in charge, and the people in charge have the skills and experience related to their position. This is a quality team. on a project budget Asking for $44000. they have been mapped out into sub-categories with corresponding amounts for each category. However, I think the Proposer should clarify the information \"Research the problem in detail\nImplement a basic architecture, Recommend a graphical model to use\" to me it is quite general, I think it is necessary to clarify specifically what the work to do, how many people each job needs, and how much time it is expected to take to complete. The same with phases 1 and 2, they have listed the amount to be paid for each hour of work, have the number of people needed to implement it, unfortunately, it does not have the total number of working hours to completion of those works. If there is some more such information, it will be easier to assess the reasonableness of the budget. Regarding the proposal implementation roadmap, I don't know if there is any misunderstanding as it is currently in progress. is fund 9 but the proposer gives the following information\" We wanted to provide a proof of concept that works for Fund 8. For our developers and all members of the community to try it out. In in-depth testing, we will provide a version that will work with the Cardano testnet. users will be able to perform checkout and conversion tests without having to spend your ADA.\"\nWith the information mentioned in the proposal, I understand it to be for proof and concept development, creating an ADA exchange app wallet with the ability to send and receive ADA - This content if the proponent can provide some more The technical solution is perfect. Next comes the stablecoin and API integration. Total implementation time up to 5 months. The last part is internal testing, unfortunately, I don't have this information about the time to finish the proposal. Furthermore, an estimated start date for the project is not given anywhere in the proposal. To continue to develop new features, they said that they will continue to return to the catalyst in the next round to ask for more funding. In this Fund 9, the team only implemented this one project, this is a plus point showing the focus of the proposal. In addition, the team has also proposed to be funded in the previous rounds, so it has a certain amount of experience and prestige. With the information I have, I believe the proposal will be successfully implemented, but I will not give a perfect score because I want the proposal to include the above information.", "q1r": 4, "q2": "The auditability of this proposal is very simple, the proponent says that we can track the progress of the project through the Github commits, following the link provided (https://github.com/UPTODATE -DEV), It is also possible to track completed works on Asana, Discord but I don't see any link to Asana nor project discord. I think to make the project audit more serviceable, it is recommended that people who are not very technical should progress through the work contents and specific timelines. Regarding the success of \"First tests of the app by beta testers to fix the first version of the app to be published\" it's pretty generic. it can be more specific eg When will the beta be released, how many testers will be, whether the testers are internal to the team or from the community, and if it is an internal team how to do the testnet parameters honesty guarantee. I will give it 4 stars because the proposal is auditable but it can be presented in a more specific, understandable way for the community.", "q2r": 4, "assessor": "z_assessor_2323", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for these corrections and suggestions on the project, I'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community.\n"}, {"id": 7995, "q0": "This project aims to develop a mobile application that enables the exchange of ADA cryptocurrency to a local currency or vice versa via Mobile Money (target group: African population). The problem is that many Africans refuse to receive ADA cryptocurrency because of the difficulties in exchanging ADA and the local currency used (CDF and USD). The application will first be deployed in Congo (about 89 million inhabitants). Thus, the project will already have a major impact on the Cardano ecosystem. The advantage is that this application can be expanded in the future to integrate even more different African currencies. The main risk included in the proposal is to persuade people to use the application. There could possibly be an even greater impact if strikes are offered in the future. The simplification of the local currency with this application will certainly make the people more likely to use Cardano.", "q0r": 5, "q1": "The team that will work on this project is included in the proposal. Their relevant experience is described and can be requested via their linkedin. The members have relevant experience and together they form a good whole to implement this proposal. The board committee is listed on the website. The proposal also includes several developers who will participate in this project. A breakdown of the budget is included in the proposal. It is good to carry out this project in different phases. It is good to do a study and analysis on the problem of converting ADAs to local currencies in the first month. The budget is clearly defined and includes the number of working hours that will be required to complete a phase. I think the budget is certainly sufficient. Additional funding can be used to create new functions. The timetable seems realistic to me to carry out everything. It might be useful to add a point about how to convince the local population to use this application. The plan clearly states the resources that are needed. The technical aspects are included in the breakdown of the budget. The creator of the proposal has clearly considered the challenges and risks. These will be examined again during phase 0. With this team it is certainly feasible to implement the proposal. The creator of this proposal offers a lot of transparency.", "q1r": 5, "q2": "A roadmap with associated milestones is included in the proposal. The proposal is divided into 3 phases. There is a good indication in which time frame each part must be completed. The completed tasks can be tracked via Github, discord and asana. The project will only be a success if the application can be tested and the errors can be removed (beta version). The authors of the proposal have clearly defined the problem. The problem of converting the local currency to ADA can certainly be solved by this application. In the long term, if the project can expand further across Africa, this application will certainly be used often.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8301, "q0": "This proposal is about a Mobile Money application that will offer a currency conversion feature, specifically from the Cardano-native ADA to the national currency of users. I believe that this feature will be necessary not only to the initial target audience of this project, which is the people of the Democratic Republic of Congo in particular and Africans in general, but also to the people in nations where ADA exchange is still more or less a hurdle. The proposers claim that this project will function similarly to the well-known Foreign Exchange Market, or Forex in short. But what sets it apart from Forex and other potential competitors out there is that the ADA Exchange App - the name of this project - will be optimizing conversion structure to minimize the amount of transaction fees and the native API will be publicized so that any interested developers could utilize the app. In addition, the team also plans to put in use Flutter, an open source framework by Google, to create the mobile version of the app, available on both Android and iOS. \nSo far, I believe that the proposal is lacking the pivotal key metrics (or KPIs) needed to measure the progress or state of success for the project. For instance, they could measure the pace at which the team rushes to complete the components, or perhaps the number of aforementioned CNFTs made for the project. There are also no case studies or proof of concept provided just yet, and it turns out that the team is going to start making the proof of concept in parallel or after this proposal.\nThe biggest hurdle that the team expects to face, interestingly, also happens to be the objective that this Dapps, Products and Integration challenge is aiming at. And the team has not offered a firm and viable resolution to tackle this problem, hence I would suggest that they get to it quickly, because this could potentially be intimidating to the project.", "q0r": 3, "q1": "For this section, the proposal lists out 4 milestones for the team to achieve in their roadmap, starting with the proof of concept that I mentioned to be missing in the Impact section, working their way up towards the foundation, feature integration and ultimately a functional app that serves its purposes effectively and smoothly. Personally, I would wish to see more content regarding each milestone, for example, what internals each component contains, their roles to play in the formation of the app and perhaps the time It would take to successfully integrate each internal.\nIn the requested budget part, this time the team has provided a more detailed look at the steps to take at each stage, which is commendable. Now, being a Community Advisor, I must admit that I don’t have much expertise or knowledge in terms of app development, so I can’t conclusively tell whether the total funding is reasonable and will leave that in the hands of those capable.\nAs for the currently involved individuals, other than the administration committee presented on their website, the project also has some developers on deck who are highly interested. And they have all been listed with their positions and responsibilities for the project, along with affiliated LinkedIn profiles for those who wish to have a closer look at. ", "q1r": 4, "q2": "In this not-too-lengthy description, in terms of auditability, the proposal has enclosed a link to a quite informative GitHub page where viewers can keep pace with the project progress and any achieved milestones. And the team reports there are also tasks on Asana and Discord that are to be completed as well, which boasts another mark to keep track of progress.\nThe envisioned success, however, seems to focus mainly on the initial success of the project as a beta version, which goes to show that there are still tweaks and updates to be made before a fully functional app could be publicly released. I think that the team should still include what they have in mind for the success of this project in the long run, perhaps describing how the final product would perform and aid the process of conversions, and seeing how welcomed it would be by the public, measured by an estimated number of users. Additionally, this section could be further solidified with the presence of SDGs as well.", "q2r": 2, "assessor": "z_assessor_2974", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for these corrections and suggestions on the project, I'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community.\n"}, {"id": 8569, "q0": "It is indeed a valid and realistic problem statement. Due to the fact that many Africans refuse to receive ADA cryptocurrency because of the difficulties they face in exchanging ADA into a locally used currency, the proposal wishes to develop a Dapp that enables the exchange of ADA cryptocurrency to a local currency via Mobile Money, there comes the ADA Exchange App, This solves the aforementioned problem and is in accordance with the challenge. The plan also includes a section on how it will function and how it will address future challenges. Furthermore, the team includes plans for scaling up the project and anticipates certain potential issues. I would have liked it if the team had come up with more specific potential answers to those difficulties. Given how valuable this concept might be on so many different levels in the growth of the Cardano Ecosystem, I firmly believe it effectively addresses the challenge.", "q0r": 5, "q1": "The team consists of individuals with expertise in a variety of disciplines. They have knowledge in a variety of areas critical to the successful completion of the project, including software development, mobile app development, IT, UX/UI, and so on. Their experience is publicly available with Linked profiles to verify, providing a strong initial picture of the team's technical and business ability to accomplish the proposal's aims. They performed a good job outlining the budget. The team requested $44,000 and identified it in an excellent manner with a timeline associated so that we know not only how but also when and how much money is spent for each step. Concerning the development team's salary, the community is provided enough information to know the number of individuals assigned to the project, the description of their tasks, and the hourly rate allocated to each. For that, I hold so much appreciation for the team. Although the budget breakdown is quite detailed, there is still opportunity for improvement. My recommendation is that the funding allocated for stage 0 be clearly specified. Instead of presenting a total of $7,000, the author should try to estimate the cost of each element. This would undoubtedly aid understanding of the number's rationale and make it easier to assess the proposal's feasibility. In terms of whether the project's plan is detailed, I believe the plan stated to implement this proposal is clear and adequate. There is a timeline that explains the activities that will be performed, which I believe is realistic. There are four major stages, each with attainable milestones that allow us to track the progress of this Dapp. However, I would appreciate it even more if I were given a precise time frame from when the project would begin to when it will be completed.", "q1r": 4, "q2": "The project's traceability is not an issue, since the team has indicated social media presence as well as platforms through which the community would be able to track the project's development or activity, such as Github or Discord,...but there is now just a concrete link directed to Github. The problem, solution, and their alignment with this challenge are all clear. The roadmap and milestones are fair and precise, making project tracking easy. However, there is no discussion of success indicators or KPIs, which are critical for tracking the process and increasing voter trust. The success definition is brief, the proposer defined success as first tests of the application by beta testers in order to correct the first version of the application which will be published. It would bring more benefit to the proposal if a long term vision is provided.", "q2r": 3, "assessor": "z_assessor_2992", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for these corrections and suggestions on the project, \nFeasibility:\nAs for the detail of the budget for stage 0 we have planned:\nStage 0: Proof of Concept (up to 1 month):\n\nIn this stage, we will focus on the detailed study and analysis of the problem of exchanging ADA into local currencies.\nWe will need to perform the following steps:\nDetailed study of the problem: 1880 USD\nImplementation of a basic architecture: ( 6hours/day for 12days | 2developers workin on ) 20$/hours * 120hours/dev = 2880 USD\nProposal of the graphic model to be used: Design thinking (20$/hour for 112h = 2240 USD)\n\nFunds needed: 7000 USD\n\nAuditability :\nI'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community.\n"}, {"id": 8666, "q0": "The idea of ​​this proposal is to design an integrated application on Cardano that allows people in Africa to exchange ADA cryptocurrencies for local currencies. The information provided by the proponent has not really convinced the reader to believe in the potential of the project that it brings to Cardano. There are many issues that the proponent has not yet clarified at this moment, firstly why choose Africa as the primary market for developing this application and not in other markets, although the author mentioned “many Africans refuse to receive ADA cryptocurrency because of the difficulties they face in exchanging ADA into a locally used currency”, but is the number of people with this need really enough to develop and maintain the application? The author can conduct market surveys and give more specific numbers to provide an overview of the feasibility of the application in this market. Second, if this application is put to use, what are the benefits that it brings to Cardano, and what will it solve the problems in the Challenge that have not been presented by the author. Third, how can the language barrier be solved when Africa is a multi-lingual continent and not everyone can speak English, it is necessary to solve this problem because according to the author mentioned that this project should be implementing Blockchain / Crypto Education and Marketing activities for people in Africa before the application is launched. The plus point for this project is that the proponent has a clear definition of how the application works/the mechanism for converting ADA into local currency and the tools (programming language, framework, database) to build it.", "q0r": 2, "q1": "The project is still an idea, although there are preliminary outlines of the main work to be done, but the proponent is still vague about the completion timeline, and I cannot find an exact time for the official version launch of the application. Although the marketing offer is covered in the Impact section, I haven't seen a plan/strategy for it yet and what the proponent will do to make the app is known before rollout and popular after its official launch in the African market is still left out. In the budget section, it is positive that the costs for the members working on the project are allocated based on their hours worked, which may prove their work effort is appropriate. The rest of the cost is allocated based on the main activities/resources to build the application and is presented in quite detail here. However, as I mentioned, marketing can be seen as a key activity in user platform development projects, so there will be costs incurred for this work. The brief descriptions and attached profiles of the key members in the project development show that they have the experience and expertise to be able to design and build this currency exchange application.", "q1r": 3, "q2": "The proponent provides us with a variety of ways to track the progress of the application, which are popular and easy to use by the community. Because the project development plan is only about presenting the application development process, the KPIs they mainly revolve around is whether they complete the work as expected or not. The metric for measuring the success of a project is still very vague, the KPIs should be estimated and represented by specific numbers, for example, 3 months after the app launches in the market in Africa, what are expectations for the number of users, the number of ADA to local currency conversion transactions, ...", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "We would like to directly start with the first question which is why Africa first, we are based in Africa, in Congo, we had the chance to be funded in one of our previous catalyst project, We were lucky enough to be funded in one of our previous catalyst projects, but can you imagine we had to use a Canadian account to exchange, and to exchange 1750 we paid 50$ fees, then the second thing, using woldremit to send the money, do you think we will be able to convince others to use crypto ADA? But also, we organize meetups on cardano, after meetup we disburse some amount in ADA, the second time the member asked how to get the amount in local currency, explaining the processse they were discouraged and I'm sure the majority still have more than 50ADA given. So why Africa and not elsewhere, because first of all they need it the most, elsewhere these possibilities exist by converting the ADA into stable Dollars, but without forgetting it is not said closed for other continents, other continents can use this application to make transfers to African countries and this will be the third question how about the adoption of the blockchain cardano, because if the use of ADA is now practical in our region and the exchange facilitated; the population will use it then we will now be able to develop apps with ADA payment method based on cardano and be used.\n\nAuditability :\nI'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community.\n"}, {"id": 9257, "q0": "The proposal talks about creating a mobile application to be used in the Congo that converts ADA into local currency. Their application is similar to forex software. As far as technology goes, I don't see it having any impact on the cardano blockchain. but in terms of coverage, it is clear that if this proposal is successful it will promote Cardano to a wider audience in the Congo. and then it can expand to other places. the only thing I'm thinking about is whether it's legally possible.", "q0r": 4, "q1": "The project development team is quite strong, they have positions for each of the key members, and have a large developer team. this meets the requirement. The development roadmap of the project I do not have information about when it will start and when it will end. the work content is not specific, looking at it I don't know what they are doing. on budget, it is broken down. but as noted above it is not detailed enough to judge the reasonableness. In short, it is feasible but not powerful enough.", "q1r": 4, "q2": "This proposal is auditable, we can track the progress through GitHub, Asana, Discord. However, for completeness Proposers should provide links to the above addresses. The definition of success is publishing a beta version of an app that is fairly easy to test. however if there is a process, and quantifiable numbers, it will be more complete. All in all, it's measurable but still needs to be improved", "q2r": 4, "assessor": "z_assessor_3037", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9482, "q0": "I gave this section a 3 because I see potential in the idea but the proposal does not provide a lot of assurance that impacts are reliable (as adoption/risks aren’t thoroughly addressed) and it doesn’t really explain what the greater impact would be to its full extent. This section could use a lot more market research about population metrics, usage potential, modeling evidence, target audience, and user trends. For a proposal that is a bit more expensive than an average Catalyst proposals, this information will help provide voters with a sense of understanding the magnitude of the impact and why it’s worth the requested funding. The first step of improvement here would be more thoroughly addressing the problem and the conditions of the status quo. The next step would be to take an extra step on the impacts and explain what a post proposal world looks like. The section here alludes to adoption in the Democratic Republic of Congo but voters want to know why that is a good thing. The elaboration on the problem statement will help voters understand what this proposal solves and the expanding of the impacts will help voters see how the world has been made better because of it. I also don’t feel like the proposer put enough honest effort into thinking through all the risks of the project, which will show voters that the proposers have thoroughly stress tested the potential difficulties they may be faced with and that they are prepared for it. I think this proposal is a good idea that needs to be further explained before I can give full confidence in the vision of the proposers. ", "q0r": 3, "q1": "For a clear display of the expertise it takes to accomplish such a project, with a roughly functional outline of what it would take to accomplish the final product, I rank this section a 4. If voters are looking at this proposal through the lens of the experience of the core development team, this project has more than enough experience and expertise behind it to get the job done. Though, the roadmap and budget for this proposal needs to be cleaned up quite a bit to provide voters with confidence that there is a clearly thought out plan to accomplish the end goal. These portions of the section describe what is going to be built but it doesn’t really breakdown how they plan to build it, so they need to put some work into explaining to the community how they will further breakdown each task into different steps. I can appreciate some of the breakdowns of hourly rates and costs of various portions of the project, so I can sort of tell that there is reasonably calculated spending happening here. Still, there are some issue with how things are adding up and there could be further elaboration into how many hours are estimated to accomplish each task. I barely vote positively because I can clearly see capability and a general plan to reach completion but I do think voters could use some more assurance with greater detail. \n", "q1r": 4, "q2": "Since this section only has 2 sentences of content to describe the proposals definition of success, I am forced to give this section a 1. With the small amount of content that is given, the proposal provides one source of public updates and defines success as completion of the first version of the application. I think it’s essential for this project to further define success with target metrics on product usage because a completed product with no users interacting with the platform will make no positive impact at a $44k price tag. There is a lot of room to provide various KPIs with objective target metrics for user count, platform activity, site/app traffic, regional awareness (perhaps by social media engagement), relevant counts of partnership, and greater elaboration on completion of the product. The best proposals that I’ve seen give target metrics in similar areas at different timeframes of the life of the project, to create progressive milestones for them as they go. This will help secure voter confidence that there is a clear definition of success and that the proposers have clear ambition for where they want to be. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "The alpha testers and the beta testers, for the alpha testers, it's really a closed circle of developers, but the beta testers phase is really open to everybody from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will publish statistics about the number of transactions, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important reports for the transparency dedicated to the community.\n"}, {"id": 10560, "q0": "“ADA to Mobile Money App” is a good idea and fits the challenge “DApps and Integrations”. Here the proposer has raised a very big problem and is of concern today, that is: \"Many Africans refuse to receive ADA cryptocurrency because of the difficulties they face in exchanging ADA into a locally used currency\". I found that, in the beginning, the proponent identified the audience they wanted to target and the current state of the problem, helping people understand the information and impact of the problem. Africa is an area that has not developed, and still needs to improve and innovate a lot, many areas are still limited, which leads to Blockchain is an area that is even more difficult to access for people African people. Therefore, it is extremely important to reduce the barrier to entering this community due to people refusing to receive ADA cryptocurrency due to difficulties in exchanging ADA into a currency used in the country. Here, I see that the proposed group has come up with a solution to solve it, it has identified most of the problems of the challenge. As we all know, now all over the world people can easily access technology regularly through tools such as phones, computers, etc., so designing a mobile application allowing the exchange of ADA cryptocurrency to a local currency through Mobile Money is a fast, convenient solution. However, I think the proponent should plan to design and build the interface to ensure it is both attractive and user-friendly, and suitable for everyone, from all walks of life, to improve usability and familiarity for users. To successfully implement the project, the proponents have foreseen the risk they face that is attracting users to use this application in the DRC because there are many Africans who do not know about cryptocurrencies. In this part, the group has raised the risks but has not given specific disarmament to overcome this difficulty. In my opinion, the proponent should add this part to the project to increase the persuasion and prepare solutions to solve arising problems, which will help the team be more proactive, and handle quickly and accurately more precisely. As mentioned above, my suggestion in this part is to design an attractive interface but still ensure the familiarity to excite users is also a solution, I think that it helps a bit for the team to propose in planning the implementation of this project.\n", "q0r": 4, "q1": "This proposal presented full information and layout in 3 parts: timeline, development roadmap; budget, and project participants to make it easy for everyone to follow. For the roadmap part, although the proposer has given the milestones but is still not detailed, I think the proposer should plan in more detail about what will be done in the future every month. Currently, the information presented with the main stages is stage 0: Proof of Concept (up to 1 month of development), stage 1: Active development (up to 3 months): Create ADA Exchange application wallet with the ability to send and receive ADA, and there will be 3 months to implement this phase, stage 2 Conversion solutions (up to 1 months of development), stage 3 Testing with internal users, but it will be clearer and easier to control if the proponent continues to break down the roadmap into milestones, periods smaller, such as by month, by week, and at the same time determine the main tasks and tasks of each month, each week, what is the target result to be achieved, who will be responsible for monitoring and checking the entire implementation process and the results of those jobs. In addition, these jobs will be done in sequence or can be done in parallel to save time and costs, then I see that the proponent has detailed how to allocate capital and explain how they use that capital For example: developing administrative software with 2 developers premium web (6 hours per day due to $10 per hour) x 2: 6240 USD; or Develop the user part with 5 Senior Mobile developers (IOS and Android sheet forms at the same time) (6 hours per day due to $8 per hour) x5: 18720 USD; Integrated mobile money Aggregators 250 USD,…. With a detailed budget plan like this, I believe it will be easy for everyone to track and control the capital, which makes the proposal more convincing. However, if possible, I think that the proposed team should deduct a small part of the budget to set up a reserve fund in case of unexpected occurrences or a reward fund for individuals and groups that work well to encourage them. Creative and effective working spirit. Regarding the project participants, the proposed team has also detailed 10 participants, information about the full name and title of each person along with the addition of LinkedIn to help the community easily follow, check more information. However, I think it would be more clear and convincing if the proponent could mention the members' previous working experience, qualifications, and suitability for the particular project. In this way, everyone will be able to know who has the experience and is related to Cardano, thereby increasing confidence in the success of the project.\n", "q1r": 3, "q2": "As for the auditability, I found that the proposed group's presentation was not as good as the two parts above. The proponent has indicated that updates will be made on Github commits (https://github.com/UPTODATE-DEV), Tasks completed on Asana, and Discord. This will help the community to track the development of the proposal. However, here it is not yet clearly defined how often the updates will be. In addition, the proponent has not stated that for each phase of this proposal, the results will be published. Where, what is the result, for example, for phase 1, is the result to be produced as a demo, a video or a presentation, or a specific website? I think, in this section, the proponent should give more specific KPIs or metrics to easily measure the progress and results of the project. As to what the success of the project looks like, the publisher also said that the first tests of the application by beta testers to fix the first version of the application will be published. Although it can be seen that this product is related to the challenge, there is not enough information to confirm the success of the project. I believe people will want to see more of that, especially the alignment of KPI milestones with the roadmap and budget allocation so that the team can track the performance and success of the project judgment.\n", "q2r": 3, "assessor": "z_assessor_3190", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 14447, "q0": "The proposal sets out to develop a mobile application to convert ADA to local currency in order to boost the adoption of ADA. The target market is Africa, with initial deployment in Democratic Republic of Congo. However, there is no background information about why African people are the target audience of this proposal (what potential does this market offer?) and what impact will the application have on the Cardano community. The solution to the problem is fairly explained - the application is available for both IOS and Androids. The example of Forex helps users to imagine how the application will work. The proposer mentions a clear approach to designing the application (using Flutter for the framework, Mongodb as a database). While the reason for choosing Flutter is clearly delivered, the proposer could also demonstrate how Mongodb is an optimal choice for database for this particular app. The main risk is the lack of cryptocurrency users in Africa. However, the proposer fails to come up with an effective way to mitigate this risk. The proposer should bring forward research that shows the reasons why African people don’t use cryptocurrency widely. The possible reasons could vary from the lack of awareness about cryptocurrency, financial problems, ignorance, no transactions - many of which won’t improve even with the presence of ADA to Mobile Money application. Therefore, to mitigate this risk, the proposer should focus on promoting the adoption of cryptocurrency alongside with developing a conversion application, since if people don’t know about cryptocurrency in the first place, there will be no chance for them to use the application, not vice versa.", "q0r": 2, "q1": "The timeline is clear and detailed enough, although some milestones, specific dates could be included to increase feasibility. In step 3, the proposer could elaborate more about “testing with internal users”. By saying “internal”, does that mean the team members? It is worth considering how these users give feedback and if these feedback will be open to external viewing for transparency. In the budget breakdown, funds needed in stage 1 and 2 are detailed and sufficient. However, in stage 0, the proposer should account more specifically for the fund of 7000 USD. How will this amount of money be allocated to each of the steps listed? If provided with an explanation, the feasibility will be increased. A point is that the budget does not account for marketing expenses. I understand that maybe the commercialization of the application belongs to further stages while this stage of funding only focuses on application development. If so, I think the proposer should brief through their future plan regarding the marketing aspects to show feasibility and careful consideration for further stages. The team members are experienced in relevant areas (banking, programming, web developer, UI/UX designer,..). Linkedin attachment is helpful for identifying the members and their credentials.", "q1r": 3, "q2": "The auditability of this proposal is still underdeveloped. Key metrics are not quantifiable and need more demonstration as “tasks done in Asana and Discord” is not a straightforward indicator of progress. Furthermore, are the “tasks done” open to external audit? Clarifying this will help increase auditability. The vision of success does not seem to aim for future virality but rather a simple milestone of correcting the first version after beta users. However, this gives a negative impression that the project does not have a clear vision of what the application could possibly achieve in the future, therefore needs more information. The proposer has not provided SDG goals and KPIs, which greatly detracts from auditability.", "q2r": 1, "assessor": "z_assessor_4055", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Impact / Alignment:\nWe gave ourselves as target Africa for 3 key reasons but there are several, firstly because we are based in Africa, we live this reality, secondly because mobile money transactions in Africa have surpassed the $701 billion mark in 2021, according to the latest data released by the GSMA, an international association representing the interests of more than 750 mobile operators and manufacturers from 220 countries worldwide.\nSpecifically, the number of registered accounts in Africa grew by 17% to 621 million accounts while active accounts increased by 12% to 184 million. In total, more than 36 billion transactions were processed on platforms providing mobile services on the continent. the success of mobile money in africa is due to its accessibility and ease of use, banks are losing the market because of intermediary procedures, but the mobile money market is not efficient for two reasons, firstly, the limits of regional transactions, secondly, the limits of transactions per day and/or month. Cryptocurrency is a solution to two problems of mobile money, but it is not very popular (few people accept it and use it). It is acceptable in a region if and only if it can be used, exchanged, etc... Third reason, international payments, we can accept in Africa to be paid in Euro or $ because we can exchange in local currency and use it, if this is not possible, we will be forced to refuse the use of the currency even with its advantages, There are of course several problems with the adoption of crypto in Africa but that's the goal of the catalyst, with several information and meetup and promotion of Dapps in Africa, we will be able to make the adoption of ADA in Africa. But another major reason to know about Africa is that in other continents this system exists, for example we use a Canadian service to do so with high transaction costs.\n\nFeasibility:\nAs for the detail of the budget for stage 0 we have planned:\nStage 0: Proof of Concept (up to 1 month):\n\nIn this stage, we will focus on the detailed study and analysis of the problem of exchanging ADA into local currencies.\nWe will need to perform the following steps:\nDetailed study of the problem: 1880 USD\nImplementation of a basic architecture: ( 6hours/day for 12days | 2developers workin on ) 20$/hours * 120hours/dev = 2880 USD\nProposal of the graphic model to be used: Design thinking (20$/hour for 112h = 2240 USD)\nFunds needed: 7000 USD\n\nPhase 0 Ideation \nIn this phase 0, we will focus on the research of information, infrastructure, data, api, important resources, manpower, architecture, smart contract, and, this phase will prepare us for the development of the app, in this phase we will also prepare the different interaction (Design thinking).  \n\nphase 1 Development\nIn this phase 1, we will start the actual development, set up, purchase the servers, incorporate the mobile money telecoms aggregators, develop our smart contract, send the information to the blockchain, work on the front end of the app to create an MVP (Minimun Viable Production) which at the end of this part will be considered as the version for the alpha testers\n\nphase 2 Media engagement \nThis phase works in conjunction with phase 1, as we are developing the app, our community manager will not only prepare the community for the different features of the app but also prepare the testers and the cardano community to be informed of the progress of the project. During this time we will use our social networks which already have more than 2000 followers and at the same time we will prepare the social networks of the application.\n\nphase 3 Testnet (Testing) Alph tester\nOnce the MVP is now available, we will open the app to the cardono community for testing but only with the testnet, also during this time we will be correcting the quick feedback before going into a live beta version of the app, this part is essential to minimize as much as possible the app's bugs.\n\nphase 4 Mainnet (Beta) Beta tester\nThe beta testers, it's really the use in mase but the users are informed that it's not a stable version, in this part even we will have a rating system followed by comments to allow us to constitute a first stable version ADA exchange APP v1.0.0.\n\nphase 5 FeedBack and LIVE V1.0.0 (Mini progress platform)\nThis phase is not the last one but rather the beginning of a live monitoring of the app, and of the users' engegement of the app. \n\nAuditabilité :\n\nI'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community."}, {"id": 14485, "q0": "There is little doubt that the overall concept has great value for both the Cardano community and developing nations like the DRC. However, the proposal fails to mention a few crucial details. the product that makes it simple to convert ADA to local cash to be pretty exciting. However, the proposer falls short of explaining how this is conveyed to the locals, who clearly lack knowledge of cryptocurrency and its uses. Before providing any new value, it is necessary to address the shortage of information in these nations. Considering the obstacles the team could encounter after choosing a nation like the DRC as their initial target audience, I personally believe the influence this would have would not be that significant.", "q0r": 4, "q1": "The proposal gets more credibility thanks to the detailed breakdown of the plan. The team is explained in great detail, however it appears that coders are dominating the mix rather than blockchain experts and marketers, who are crucial in proposals like this where the product and its uses are difficult for the target audience to comprehend or use. The team also offers a step-by-step action plan, although it appears to be very ambiguous due to the lack of an explanation. The team asks about $44,000, which is a bit excessive given the amount of work that needs to be done. The team dedicated to creating the wallet appears to be doing well, and having a \"Wada\" member on board gives it more confidence. There is a good chance that the project will be funded given the goals and the team's level of expertise as described by the proposer.", "q1r": 4, "q2": "Nothing practical to improve the audit process is mentioned by the team. The only mention is of getting the Beta version in front of people, which is not enough on its own. The proposal that was submitted in the previous round ought to have addressed every issue going into this one, but I think the team still needs to concentrate on presenting the community with a complete picture of their plan and what success would look like. More helpful metrics and KPIs must be provided by the proposer so that the community can assess the impact. Metrics like the number of users onboarded, the number of wallets generated each month, the number of active users, the amount of ADA exchanged and the amount of ADA charged as fees, among many others, are glaringly absent and could have given the proposal more weight. This proposal requires some more valuable information in the estimates provided, thus the proposer should make some more changes and resubmit it.", "q2r": 3, "assessor": "z_assessor_4060", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Auditabilité :\n\nI'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community.\n\nPhase 0 Ideation \nIn this phase 0, we will focus on the research of information, infrastructure, data, api, important resources, manpower, architecture, smart contract, and, this phase will prepare us for the development of the app, in this phase we will also prepare the different interaction (Design thinking).  \n\nphase 1 Development\nIn this phase 1, we will start the actual development, set up, purchase the servers, incorporate the mobile money telecoms aggregators, develop our smart contract, send the information to the blockchain, work on the front end of the app to create an MVP (Minimun Viable Production) which at the end of this part will be considered as the version for the alpha testers\n\nphase 2 Media engagement \nThis phase works in conjunction with phase 1, as we are developing the app, our community manager will not only prepare the community for the different features of the app but also prepare the testers and the cardano community to be informed of the progress of the project. During this time we will use our social networks which already have more than 2000 followers and at the same time we will prepare the social networks of the application.\n\nphase 3 Testnet (Testing) Alph tester\nOnce the MVP is now available, we will open the app to the cardono community for testing but only with the testnet, also during this time we will be correcting the quick feedback before going into a live beta version of the app, this part is essential to minimize as much as possible the app's bugs.\n\nphase 4 Mainnet (Beta) Beta tester\nThe beta testers, it's really the use in mase but the users are informed that it's not a stable version, in this part even we will have a rating system followed by comments to allow us to constitute a first stable version ADA exchange APP v1.0.0.\n\nphase 5 FeedBack and LIVE V1.0.0 (Mini progress platform)\nThis phase is not the last one but rather the beginning of a live monitoring of the app, and of the users' engegement of the app. \n"}, {"id": 14722, "q0": "\"Due to the fact that some citizens may encounter difficulties when using cryptocurrency; or some of them do not even know what cryptocurrency is. The same problem occurs in my country (Vietnam). I agree with an idea that create the easy-to-use platform for people. Specifically in this case is the app about exchanging ADA into local currency (CDF and USD). It would be more meaningful if the app extent to convert other currency for other countries, especially for Third World Countries/developing countries; to help people gain easy access to the cryptocurrency world. \nThis platform could be integrated the extensions of existing ADA wallets and Mobile Money applications. \nIn my opinion, the project is not so complicated to be built up, the major problem (as stated as the main risk in the proposal) is just that how to convince citizens to use the app? And I agree with the answer that is we should simplify the platform when approaching these types of users. \nIf this app is successful, a great number of citizens from this country (or other countries if the app is updated) will join the Cardano ecosystem thanks to its ease to use. The solution proposed here is well aligned with the challenge. \"", "q0r": 5, "q1": "The roadmap was included four main stages and clear enough. The tasks needed to be done were fulfilled. In terms of the budget, it was good that the proposers had allocated the money in accordance with the roadmap, making the proposal clearer. The core team members are experienced engineers and designers. I think the resources here are sufficient for project implementation. ", "q1r": 4, "q2": "It was good that the project had been committed to GitHub, and the tasks completed would be announced on Asana and Discord. However, from my point of view, to increase the auditability for the community, I would like to recommend some other metrics/KPIs that should be used such as the number of users, the total amount of money exchanged when using the app, the users’ feedbacks about their satisfaction when using the app (especially the ease-to-use feature, which the ultimate goal of the project).", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "We will start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community."}, {"id": 14890, "q0": "The team has not said the function of the project, but only said that it will be deployed initially in Congo, I think it is necessary to introduce more money mobile as an electronic wallet, it will help online transactions quickly. The team said that ADA will work like Forex but did not explain what it is for those who do not know, but only said that it is allowed to exchange from their wallets in Local Currency to Mobile Money. They introduce a little about ADA but still don't mention the customers they target, so for example, add customers in the field of business, foreign transactions or online shoppers. And how will their project affect those clients? Such as convenient trading, cost reduction or nationwide transactions. The application of the project will help receive ADA crypto currency from anywhere, which is extremely convenient for users. The project should have a Key metrics of challenge so that it can easily see the synchronization of the whole process, need to know which parts are missing or redundant. This application works as a currency converter on both Android and IOS mobile applications and has built-in extensions, I see interest in the quickness and ubiquity of the application. The team mentioned Mongodb but for those who are not tech-savvy, a few sentences should be added to it. They mentioned the challenges of limited knowledge about e-wallets but didn't say how to transmit it. download usage information to everyone especially Africans. I suggest a few ways that are holding small meetings to share knowledge about ADA or advertising in the media, radio. ", "q0r": 3, "q1": "I find the project has a very detailed roadmap structure, including step 0 as the first foundation to support the process, also very detailed and states how the team's wishes and users can experience it first  without spending a single ADA. That will help users experience and have feedback for the team to develop more. The next 3 steps all give activity information and a monthly timeline, the indicators are reasonable, but more attention should be paid to operational details such as adding where, with whom and with What are the benefits. The cost that the team gives is in the correct order compared to the roadmap, so it is completely understandable in the right order. The team gives full wages for workers and the value of machine products. The project shows the full name and industry of each member, each person is attached a linkedin link to understand more about the profile. But there are still gaps in terms of years of experience and positions they have worked.", "q1r": 4, "q2": "Only says used on Github commits without explaining what it is, missing detailed metrics to track. Why not add the number of users or the time to complete the test, it will become more complete. What are the completed tasks required, completed by what, completely lacking in parameters that the user cannot keep track of closely. The success is not defined yet, just saying the test version will help to edit the first version of the project. Thanks to testing, errors will be discovered to improve the success rate of the project but have not yet given the team-defined results to complete the proposal. I think the team should add like everyone successfully transacting on the application or passing it on using ADA wa.", "q2r": 1, "assessor": "z_assessor_4108", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "We will start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community."}, {"id": 14961, "q0": "Overall, the proposer stated a general problem, which is the lack of ADA adoption by Africans due to the difficulties in exchanging it into local currency. Accordingly, a mobile application is proposed to be developed, providing the service of exchanging ADA, and initially deployed in the area of Democratic Republic of Congo. Technically, the platform is described to integrate different ADA wallets, yet, I suggest that the author describe more about what specific wallets they are aiming for collaboration for a better vision about its impact. Besides, in my opinion, the exchange fees are mentioned to be kept as low as possible, though some clear expected figures should be given for better assessment on how it attracts potential users and how possible it is for maintaining the long-term operation. Moreover, the risk stated in this part is appropriate, but not mitigated properly. I believe that the team should reconsider to develop some strategy such as promotions, advertisements, crypto workshops to get more users. In general, I think that this is a possible idea that may popularize the use of cryptos, especially ADA. However, the popularity of cryptos is also based on many different criterias such as the adoption of technology, the knowledge standard of the local population, the development and living standard of the country,... As a result, from my personal point of view, developing such a platform would not generate too much impact on increasing the number of ADA users. I highly recommend that the team conduct a survey, collecting the community’s attitude towards the mentioned application (what other criterias should the team focus on developing, what functions are favored by the majority, how the application generates impact towards their intention to adopt ADA,...) to determine the necessity of the mentioned application. On the other hand, the information provided in this proposal is sufficient and logically ordered. Some integrations are also described and explained thoroughly for a good imagination about the project. To conclude, I highly recommend the team consider my suggestions above in order to improve the platform.", "q0r": 2, "q1": "In general, the plan is divided into 4 phases with around 5 months needed to complete the first 3 phases and conduct the final outcome. The final phase would be the conversion testing internally. Personally, I think that this is a quite detailed timeline with sufficient milestones, including steps required in order to develop such a platform. Besides, a very clear budget breakdown is also offered by the team. The information that can be obtained in this part is very obvious, describing the salary per working hour, total working hours and total fund requested for each sector, the number of staff needed as well as the tasks for each phase. From my perspective, this is a feasible roadmap, yet the figure of $44,000 still needs thorough consideration. Finally, a sector that introduces the core team members is given clearly, offering the roles of each one and their personal backgrounds through an affiliate link. After doing a quick research, I believe that the team is appropriately capable of actualizing such a project.", "q1r": 5, "q2": "At first glance, I think that the details contained in this section are quite humble. In my opinion, the GitHub commits and other communication applications given are reasonable. However, they should give more specific key metrics that they will track and follow to evaluate the developing process. Furthermore, the success measures and KPIs are still insufficient. They should keep track of some specific figures such as: the number of users, the total value of ADA circulating daily, users’ feedback,... In addition, some sustainable development goals should be added to describe the long-term growth of this platform. I believe these criterias, if presented thoroughly, would deliver a better vision about the project for the Catalyst as well as the community.", "q2r": 2, "assessor": "z_assessor_4118", "no_vca": 12, "ne": 2, "ng": 7, "nfo": 3, "vca_o": 1, "reply": "Impact / Alignment:\nWe gave ourselves as target Africa for 3 key reasons but there are several, firstly because we are based in Africa, we live this reality, secondly because mobile money transactions in Africa have surpassed the $701 billion mark in 2021, according to the latest data released by the GSMA, an international association representing the interests of more than 750 mobile operators and manufacturers from 220 countries worldwide.\nSpecifically, the number of registered accounts in Africa grew by 17% to 621 million accounts while active accounts increased by 12% to 184 million. In total, more than 36 billion transactions were processed on platforms providing mobile services on the continent. the success of mobile money in africa is due to its accessibility and ease of use, banks are losing the market because of intermediary procedures, but the mobile money market is not efficient for two reasons, firstly, the limits of regional transactions, secondly, the limits of transactions per day and/or month. Cryptocurrency is a solution to two problems of mobile money, but it is not very popular (few people accept it and use it). It is acceptable in a region if and only if it can be used, exchanged, etc... Third reason, international payments, we can accept in Africa to be paid in Euro or $ because we can exchange in local currency and use it, if this is not possible, we will be forced to refuse the use of the currency even with its advantages, There are of course several problems with the adoption of crypto in Africa but that's the goal of the catalyst, with several information and meetup and promotion of Dapps in Africa, we will be able to make the adoption of ADA in Africa. But another major reason to know about Africa is that in other continents this system exists, for example we use a Canadian service to do so with high transaction costs.\n\nFeasibility:\nAs for the detail of the budget for stage 0 we have planned:\nStage 0: Proof of Concept (up to 1 month):\n\nIn this stage, we will focus on the detailed study and analysis of the problem of exchanging ADA into local currencies.\nWe will need to perform the following steps:\nDetailed study of the problem: 1880 USD\nImplementation of a basic architecture: ( 6hours/day for 12days | 2developers workin on ) 20$/hours * 120hours/dev = 2880 USD\nProposal of the graphic model to be used: Design thinking (20$/hour for 112h = 2240 USD)\nFunds needed: 7000 USD\n\nPhase 0 Ideation \nIn this phase 0, we will focus on the research of information, infrastructure, data, api, important resources, manpower, architecture, smart contract, and, this phase will prepare us for the development of the app, in this phase we will also prepare the different interaction (Design thinking).  \n\nphase 1 Development\nIn this phase 1, we will start the actual development, set up, purchase the servers, incorporate the mobile money telecoms aggregators, develop our smart contract, send the information to the blockchain, work on the front end of the app to create an MVP (Minimun Viable Production) which at the end of this part will be considered as the version for the alpha testers\n\nphase 2 Media engagement \nThis phase works in conjunction with phase 1, as we are developing the app, our community manager will not only prepare the community for the different features of the app but also prepare the testers and the cardano community to be informed of the progress of the project. During this time we will use our social networks which already have more than 2000 followers and at the same time we will prepare the social networks of the application.\n\nphase 3 Testnet (Testing) Alph tester\nOnce the MVP is now available, we will open the app to the cardono community for testing but only with the testnet, also during this time we will be correcting the quick feedback before going into a live beta version of the app, this part is essential to minimize as much as possible the app's bugs.\n\nphase 4 Mainnet (Beta) Beta tester\nThe beta testers, it's really the use in mase but the users are informed that it's not a stable version, in this part even we will have a rating system followed by comments to allow us to constitute a first stable version ADA exchange APP v1.0.0.\n\nphase 5 FeedBack and LIVE V1.0.0 (Mini progress platform)\nThis phase is not the last one but rather the beginning of a live monitoring of the app, and of the users' engegement of the app. \n\nAuditabilité :\n\nI'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community."}], "solution": "Design of a mobile application allowing the exchange of ADA cryptocurrency to a local currency via Mobile Money.", "experience": "Startup working in the development of Web, Mobile, and Desktop applications; with more than 18 developers"}