{"id": 414457, "author": "npaquoc87", "title": "Cardano Forest - blocktree.asia", "url": "https://cardano.ideascale.com/a/dtd/414457-48088", "category": 26595, "amount": 37800, "description": "In Vietnam, most people know about crypto, they have limited understanding about other applications of blockchain ie non-fungible token.", "f6_no_assessments": 14, "f6_rating": 4.857142857142857, "videos": [], "media": [], "f6_assessments": [{"id": 4340, "q0": "When I read the proposal, I didn't think it would have an impact on the goal set at Challenge first. Gradually I came to see that the proposal to solve the problem of DApps with NFT integration involved crops. This is very beneficial for the ecosystem that is the common environment of Vietnam, Asia, and the world. The team raised the specific issue of people's limited understanding of blockchain and NFT. Based on that, the team came up with a solution that is to use NFT on the Cardano blockchain to manage afforestation work in Vietnam. Using NFT adds value to the Cardano ecosystem. I think this has the following benefits: Good impact on the green environment (especially in the future when the trees are grown, bringing significant value), improving the knowledge of the community because they have good conditions. approach blockchain technology - NFT, providing maximum support in working for partners (those who directly plant trees - Gaia nature conservation organization). This proposal is fully scalable and solves the challenge in the future. I have an impact question for you: Do you have any plans other than just supporting and managing tree planting? If you have other plans, it will have a different impact. I think in the future, the team can do more research on the goal of commercializing crops and taking money for social support. I vote 5 stars.", "q0r": 5, "q1": "You and the members are both involved in the Cardano blockchain ecosystem and have experience in the fields of event organization, finance, and media, especially one man who ber works full-time in the blockchain field. . In addition, the team has publicized the identities of all members through social networks (Linkined). As a PA, I am satisfied with the experience and materials that the team presented in the proposal. The above criteria are quite important so that the community can trust the team's reputation and demonstrate the feasibility of the proposal. The proposed budget has been broken down into categories. Regarding the plan and implementation, I realize that the money from organizations and communities for afforestation is very large, but there is no application to help control the afforestation effectively. In addition, many organizations and individuals in the large community want to contribute to afforestation but have not found a suitable application/partner to entrust/cooperate with. There are still many frauds in the use of funds for afforestation. This is a good opportunity for the team to develop the application and release the NFT - creating a transparent public platform for everyone to participate. I understand the team is going deep into technology to thoroughly support the management element for partner Gaia. The release of NFTs based on trees is also very beneficial in communicating and promoting the afforestation program so that everyone knows about it. However, the team should be more clear about how the NFT issuance will benefit its holders? Does this NFT only have the function of simply recording and monitoring the existence and development of trees? Is there any economic benefit to the holders? I would like to suggest that the team can consider bringing economic benefits to NFT holders in the long run when the trees mature and reach their use value. Then, in addition to meeting the quota of trees needed to protect the environment, several other trees can be commercialized to (1) Make direct economic contributions to society; (2) A small portion after commercialization will be distributed to the owner as a gratitude gift for supporting the project for a long time. Doing so will be good for both the ecological environment and the individual NFT holders. However, there is still a risk (this is my personal opinion) that during the growth process, some trees will die or be destroyed, then you will have a plan on how to handle them. who is holding the NFT of that dead/destroyed tree? (NFT once recorded on the blockchain is immutable) Another challenge that I want to mention in the technical aspect is the technological barrier of a web application, mobile application, dNFT, etc. .for the elderly. Is there a way for the team to make it easier for older people (with slow/limited ability to absorb technology) to use apps, NFT, etc...? My suggestion is that we should strengthen the instructions on how to use it in detail so that everyone can understand it as easily as possible. Detailed instructions can be implemented in many different ways (via the website, youtube, and volunteers...). In summary, I see the feasibility of the proposal is clear, just now I just stated the opinions of individuals in the direction of positive contributions. I vote 4 stars.", "q1r": 4, "q2": "Presenting a schedule of milestones in a clear and logical sequence demonstrated part of the proposal's transparency and auditability. This is easy to understand as it is done by professional members. I completely agree with the roadmap of this proposal. The team also stated key performance indicators (KPIs) in line with reality (development support, revenue generated, financial mobilization from economic tools). The team set out the criteria for success. The proposal is in line with the 15th of the 17 Sustainable Development Goals of the United Nations. It would be even better if the community knew the key metrics to increase the auditability of the proposal. I find this to be a highly practical proposition, worthy of being put to life. Especially when the proposal is impactful and feasible for the natural environment and the common interests of society. However, the team needs to understand clearly that its position is not the one that directly goes to plant trees, but the one that provides solutions and applies techniques to have appropriate plans and actions. Across several projects, the team clearly described the problem and offered satisfactory solutions. I highly appreciate the team's spirit of proposal-building and focused work. I vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 5, "ne": 3, "ng": 1, "nfo": 1, "vca_o": 2, "reply": "Thank you for your positive comments and judgment. We will consider your suggestion about the comercializing crops and bring more economics of NFT to scale the project. We think that's the very good idea. \n\nAbout your concern on the dead of tree, we will NFT an area covering a number of tree (not only 1 tree). The planter also responsible to fill the tree if it die within 4 years. We will only select to plant the tree in National Park which is under the protection scheme of goverment.\n\nAbout the UI, UX, yeah, I agreed with you about the friendly of app then every people can easily use (for elder people, low skill labour). We have the UI, UX designer, he will make sure that the elder people can easily use our app."}, {"id": 3086, "q0": "This proposal for further funding with 1 funded project in Fund8 is suitable for the goal of the challenge because the project needs to find funding for the second phase with the application of blockchain technology to solve the problem. Regarding afforestation in Vietnam, each tree planted in a specific area will be encrypted in the form of a non-fungible token (NFT) including: planting time, image, tree's coordinates ( latitude-longitude)…NFT will be minted using the cardano blockchain and made available to sponsors who can then easily check the results.\nProposal products include: a web application to track and report tree start progress, tree growth, impact calculation, NFT generation and donor reporting + a mobile app for growers to use to locate planting areas as well as collect tree data that will be input to dNFT + a mini ERP system for tree planting organizations that helps them transform existing manual processes to digital, can be understood as digital transformation for growers.\nTherefore, the difficulty of the digital transformation journey due to the design of products based on information about interviews with growers as well as field growers, the ability to apply NFT to each tree growing to generate dNFT is a challenge of the proposal to overcome.\nProposing practical application to life using blockchain technology to solve current problems of business and society, improve people's lives, create social and environmental impact.", "q0r": 5, "q1": "With the experience of the proposal writer and the support team, including 11 people, each person is in charge of a part of the job. The project director manages the entire project progress and KPIs, reports, connects with partners and sponsors; product manager with experience in product management; The product designer, marketer, and community manager are all experienced in the area of the proposition. At the same time, there is the technical support of the project consultant Ms. Huyen Do, an experienced expert in the field of afforestation and tree planting. Mr. Do Manh Hung, blockchain technical advisor, media partner advisor, has many years of experience in training, financial management, and has in-depth knowledge of the Cardano ecosystem...\nIn the proposal, Ms. Huyen Do is executive director of Gaia Nature Conservation - a Vietnamese non-profit organization focused on afforestation and nature conservation in Vietnam, calling for funding to plant more forests in Vietnam. She has extensive skills in managing an NGO as well as applying cutting-edge initiatives in nature conservation, especially in education and communication about nature\nThe budget for funding in the proposal is very clear and detailed with working with farming organizations, famous newspapers to PR for the project and crowdfunding, working with companies to Fundraising. Updated technical documentation for organizing tree planting on NFT and dNFT. Graphic design, content creation, grower's mobile app upgrade, Web application for communication and reporting, user interface finishing, product management. Hardware costs for planters are also calculated and included in the proposal. Community management, visiting and observing afforestation activities, especially group members spend time studying and researching the project without asking for additional funding. This further shows the determination of the proposal implementation team to make the proposal successful.", "q1r": 5, "q2": "The proposal has a roadmap with important milestones, clear work items with each clear cost, and the proposed implementation time is also very clear. Project progress is measured in 3 parts, including product development including website completion for sponsors, application and mobile devices for reforestation forces, mini ERP for farming organizations, portal administration for BlockTree; build community on fanpage, write 3 articles in famous newspapers, add more Cardano wallets created to receive NFT; fundraiser got at least 5 sponsors and planted 3,000 donor-sponsored trees.\nWhen the proposal is funded for implementation, the success of the project is also reflected in such things as increasing understanding of the application of blockchain technology in practice; create more new people to the Cardano ecosystem and create a Cardano wallet to store NFTs; attract more afforestation funds and apply digital transformation to organizations that help them be productive.", "q2r": 5, "assessor": "z_assessor_2397", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We are trying our best for the growth of communities as well as dealing with Climate Change impact.\n"}, {"id": 3717, "q0": "The issue of combating climate change is an issue that now countries all over the world are concerned about. One of the reasons for this is the indiscriminate deforestation in countries around the world, including Vietnam. The Vietnamese government has determined to plant 1 billion trees to overcome the problems caused by deforestation. Blockchain technology is increasingly being applied to serve many areas of life such as finance, health, education, agriculture, etc. However, applying blockchain technology in forest planting is currently not very popular yet. Cardano Forest Proposal - blocktree.asia is a good idea to be able to bring blockchain technology to forest planting. In particular, this proposal uses the Cardano network to do this. This can be considered a breakthrough, creating great prestige in Cardano's use of blockchain technology in this very meaningful job. This will help the community not only in Vietnam but also in the world community know more about Cardano, thereby creating a premise for other organizations and units to apply the Cardano network in their fields.", "q0r": 5, "q1": "The team implementing this proposal are all people with a lot of experience in the related fields. Members such as Mr. Quoc Nguyen, Mr. Ky Tong, Mr. Phuc Nguyen, Mr. Hoang Tran, or project advisors such as Ms. Huyen Do, Mr. Do Manh Hung, Mr. Tien Nguyen and other members are enthusiastic people and experienced. Information about these members is very complete, the community can easily find out via Linkedin, Telegram, Twitter. Risks that may affect the success of the proposal such as the difficulty of digital transformation or other risks are taken into account by the team and possible solutions are proposed. I greatly appreciate this.", "q1r": 5, "q2": "The roadmap for the implementation of this proposal from Q3/2022-Q2/2023 was given in detail by the group and full of work to be done. I believe that with the experience from Fun8 and the experience of the team members, the group will complete according to the plan the group has given. The amount of $ 37,800 is also provided by the group with a very detailed and transparent use plan. I believe the community also appreciates this. In addition, the KPIs given by the team are also very clear and specific in terms of numbers. This makes it easy for the community to measure the success of this proposal.", "q2r": 5, "assessor": "z_assessor_2476", "no_vca": 10, "ne": 1, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We are trying our best to bring positive to lives and Earth."}, {"id": 4849, "q0": "I'm interested in their idea as it related to protecting the Earth with the help of Cardano blockchain technology. As we know, reforestation is a very critical task in all nations to lessen the severe effects of climate change on our planet. Therefore, the proposer has the idea about creating a blockchain-based technology platform called BlockTree to connect Sponsors and Planters in Asia, (focus in Vietnam first) to manage the reforestration work in Vietnam by using NFT. Their products will consist of a Web app for tracking and progress reporting of the trees, a Mobile app for the Planters, a Mini ERP for tree planting organization. I think, this is a very good idea which could be scaled to other countries. A NFT representing a number of trees planted in a certain location will be created, and it will include the planting date, a photo of the trees, and their coordinates (latitude and longitude). We refer to each NFT as a \"Green Certificate\" and will mint them using the Cardano blockchain so that Sponsors can easily check the outcome. In addition, this proposal is suitable for the challenge because this will increase Vietnam's forestry efforts' transparency and auditability. Additionally, it will not only assist the Cardano Community in learning more about the practical applications of blockchain technology, but it will also enhance people's lives, have a significant positive social and environmental impact, and support sustainable development beyond Catalyst. However, there are some main risks such as persuading and taking time to educate Planters which are low-skill labors, and tree planting organizations to change their current manual process. My suggestion is to find the right professionals in that field to deal with the right risks. In short, I would like to give this proposal full mark because of all the reasons above. ", "q0r": 5, "q1": "The feasibility part is very good. In term of the roadmap, the proposal gives us a clear picture of how the project would progress with short-term and long-term vision so we can have a good view of the context. In this proposal (Phrase 2), it is easy for us to follow the plan as the detail of each task and description are provided in attached Excel sheet link. Moreover, the proposer has clear target in which they will focus on product development, and aims to have 2,500 trees planted and tokenized after 3 months since the funded date. It would be better if the proposer could add the name of the person who will carry out each task in the sheet. Regarding the budget, this part is also quite clear, leaving nothing to be desired: I know how many hours are needed for each task, the hourly rate per hour, and the total amount in USD including the risk management (5% of the total project's cost explained). There is nothing to comment more about this part. Last but not least, I am impressed about the introduction of each member which shows their confidence: I know who they are, individually, their name, position, what main task they will be in charge of, their experiences, and also provide links to their personal pages, where I could know them more intimately. In fact, I know, they have also been funded previously. Therefore, I am more convinced about the implementing ability of this team. I would like to give them full marks because each part is provide with a lot of information in a very detailed way. My only suggestion is that they should explain how their team members arrange their time  as they work in other proposals in Fund9 and previous Funds. ", "q1r": 5, "q2": "Well, I think, it is possible to track the development of this project. Therefore, based on their goals at the end of Phrase 2, in my opinion, to manage the progress of this proposal, the proposer could based on some key milestones of the platform: products development (completion of sponsors portal, mobile apps, devices for planters, mini ERP for planting organization, admin portal for BlockTree); community engagement ( the number of Facebook likes, the number of new members joining Zalo, Telegram group, the number of published articles on well-know newspaper, the number of new wallet created to receive NFT); and fund raising and tree planting (the number of corporate Sponsors acquired, the number of trees funded and planted). Besides, the proposer provide their long-term success vision of the project in the future which I found very promising. In short, this auditability part is okay. ", "q2r": 4, "assessor": "z_assessor_2622", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We already shared the detail of how can our team member can arrange time to work on other proposals at the end of the team experience part.\n"}, {"id": 5639, "q0": "This project surprised me due to their responsibility for the actual community because of the old perception of most Vietnamese people that blockchain is just for trading purposes.\n\nI strongly agree with the proposer's statement that climate change is a massive problem worldwide, especially in emerging countries like Vietnam, hence, it's essential to take action to help mother earth. And congratulation, the project has collaborated with Gaia after fund 8.\n\nThe reforestation deployment project has recently been a significant obstacle due to a lack of management skills or inefficient budget allocation (http://www.baohoabinh.com.vn/249/163161/Nhung-du-an-trong-rung-con-nhieu-ton-tai-can-khac-phuc.htm) (https://laodong.vn/xa-hoi/du-an-trong-rung-tien-ti-khong-thanh-lai-do-loi-cho-dan-932398.ldo).\n\nIn the sponsor's eyes, following closely the project that they spent their money on is very vital, especially if they know the progress of the project and its impact on the social and community. Additionally, the mini ERP for tree planting organizations transforms their manual process into digital, where everything is auto-updated transparently. I believe it will greatly impact all parties involved in the project and the global atmosphere in general. That said, I completely support this proposal as a great idea, it will make reforestation more efficient, effective, and transparent. Moreover, in the proposal, the proposer not only inputs the foresee risk but also has a specific solution. \n\nThough the proposer has updated that the project is on track to developing the solution and a lot of people are engaging in this as the sponsor, I think it would be helpful if you update more specific about the progress of the project, including technical features and the amount of reforestation. This will helps us gain a holistic view of your impact after fund 8. Besides, the eventual results have not been obvious, because this project is useful for all parties participating, so beyond the report on the number of trees planted and tokenized, I think it should have a target for deriving satisfaction from sponsor or how applying technology increased the effective working of the tree-planting organization is.\n\nAnyway, I totally support the sustainable project as blocktree, so I rate it 5.", "q0r": 5, "q1": "Clear understanding this is a continuation project from Fund 8, the main goal is to plant and tokenize 2,500 trees. First of all, the team has completed their goals with 500 trees, it will be a premise for beautiful results in Fund 9. However, the proposal commits to planting at least 2,500 trees, which is 5 times vs fund 8, so I am concerned about the cost per tree that the proposer hasn't input yet or how they can improve the productivity planting to gain that goal.\n\nAbout the timeline of the project, it provides clear information with different small phase breakdowns, this helps catch up quickly and easily. In terms of the budget allocation, the proposer has divided it into many items in a specific way, I think it's pretty full of detailed information.\n\nLast but not least, the project is led by 2 experienced project managers with many years in human, finance, and product management. Also, it is involved by departments needed for the project as Full Stack Developer, Designer, Marketing, and Partnership. With this, I believe the project will roll out successfully", "q1r": 5, "q2": "The project has a clearly outlined timeline, budget allocation, and target. I would appreciate it if there were planning for marketing to justify (as proposer input the KPIs here) because it's more than the number. But no worries, I think this is a product development focus phase, marketing, and community development are not necessary yet. In short, I cannot wait to see and have a chance to experience the product as at the end of this phase, the project will complete a web application for sponsors (sponsors portal), mobile apps and devices for planters field force, mini ERP for Planting organization, Admin portal for BlockTree.", "q2r": 5, "assessor": "z_assessor_2732", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We will consider your suggestion for showing people ow applying technology increased the effective working of the tree-planting organization is.\n\nAbout the budget for planting 2500 trees, we showed on the proposal that we will work with enterprises to get the fund from those."}, {"id": 8059, "q0": "\"The second phase of the proposal to continue the first phase in Fund8 is the necessary step to develop and improve the proposal. The proposal is to introduce blockchain applications to real life. The application sublime to combat climate change and disasters like flash floods and mudslides which is a thorny problem in Vietnam and then apply to other fields such as Agriculture and Livestock. The products of this phase like web application, mobile application, and mini ERP are fundamental and necessary for the project which is helped donors and community track the finished work.\nThe risk of lack of awareness of planter and the plan for the next coming Fund to create the lecture of technology for the planter is necessary for the success of the proposal in the future.\nThe risk of ADA slippage and the proposal requiring 5% more is reasonable at the cryptocurrency bear market recently.\"\n", "q0r": 5, "q1": "\"The proposal has a strong team with the fundamental skill needed for the proposal successful. With the experience of Fund8 and the clear vision of the whole project. The roadmap and the budget required for the building application are quite clear.\nThe concern of the proposer that is the risk of ADA slippage price and required for 1800$ for risk management is basis to make sure the proposal gets funded in the future.\"\n", "q1r": 5, "q2": "The auditability of this proposal and previous proposal at Fund8 is pretty easy to check. In this proposal in every phase is  into quarters in 2022 and 2023 is reachable. The success of the project look like is transparency, auditability and measurability of application help community understand more about the application of blockchain technology from that adopt into other field.\n", "q2r": 5, "assessor": "z_assessor_2943", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We are trying our best for a Greener Earth.\n"}, {"id": 8486, "q0": "This proposal aims to fund the second phase of the proposal that was funded in round 8. The project aims to contribute to the reforestation program in Vietnam. This reminds me of some other apps which were built for the same purpose such as Ecosia and Forest. In my opinion, this proposal addresses the challenge perfectly for so many reasons. It will certainly help Cardano spread a huge impact in the real world by using NFT and technologies to help solve such an important environmental problem. With its potential, I can see how this idea is going to enrich the Cardano ecosystem by increasing the amount of NFTs, attracting more users, and definitely drawing the public’s attention in a good way. It’ll also certainly deliver a positive message about the crypto and Cardano system to the outsiders who still have negative ideas about the whole crypto world that it’s not a way to become rich instantly but crypto will bring so much more good impact to the world. Hence, I find this proposal is aligned without the challenge’s scope. Moreover, the team already has a solid foundation for their project which is their ongoing work from Fund 8. They know where the rope is and I can see their commitment through and through to giving the project a huge development. Even in this proposal, the team has delivered their idea very well from every angle, and there is no struggle to understand how the project will be progressing like planter application, sponsor portal, mini-ERP using dNFT technology to provide transparency, auditability, measures, permanence in reforestation work in Vietnam and Asia countries. Besides, they have also set the project a goal to reach. I also agree with the risk the team mentioned as I understand the digital transformation will take time, especially in the third-world country where the organizations are still accustomed to working the old-fashioned way. However, at the same time, I can see that the team has had a plan to follow and solve the problem. I think it’s important that you have pointed out the risk of ADA’s pricing since the Crypto market has proven to be unstable, especially in recent times. I would highly recommend the team pays special attention to cashing out the fund at the appropriate time since we have witnessed how drastically the ADA prices have dropped in the past. I will give this proposal full writing because overall it is very well aligned with the challenge.", "q0r": 5, "q1": "In terms of feasibility, I have huge praise for the team. Each point is addressed in detail. The project is following a very well-organized ongoing project. Timing is planned closely and strictly with a details list of work. Despite this, there is an excellent description of skills and experience as well as links for verifying them. The level of detail provided in the feasibility part provides the community with an understanding of the implementation steps involved. Besides the short-term to launch the project, the roadmap is well articulated with a long-term plan until the 30th June 2023 and show how it’s aligned with the idea perfectly. Finally, there is also a high level of detail in the descriptions of the budget items. I can see how we can justify the requested fund with every budget object being listed alongside its required working hours. ", "q1r": 5, "q2": "This proposal is excellent in relation to the aspects which are necessary to assess auditability. Taking into consideration that the work is already progressing, we can partially have an image of how the community can audit it. To add it up, the team has built a lot more specific key metrics to measure the success of the project in this phase and how it’s catching up with their current work for phase 1, each of which is explicit in its objective. Although your presentation has been very almost perfect, I still want to suggest the KPIs should be time-related to make the audit more effective. For instance, how long will you aim to reach 3,000 trees that were funded and planted using your solutions? With specific time frames, the team can also keep track of their own progress and make adjustments if needed. ", "q2r": 5, "assessor": "z_assessor_2989", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We will update the community frequently status of our work for auditing purposes."}, {"id": 8732, "q0": "This is a meaningful and practical proposal. It's great that it completed a phase in Fund8. Information about the project is presented very fully in the proposal, including completed works, project products, and goals. The benefits that the project's success brings are also mentioned. The project fully meets the requirements of the challenge. Moreover, the risks that the project may face are also anticipated. What's even better is that you already have a way to solve these problems. Overall, the presentation and content of this IMPACT section is no problem at all. There is no reason for me not to rate 5*.", "q0r": 5, "q1": "Your roadmap is extremely detailed and clear. The goals, timeline and work are all updated in detail in the plan section. In addition, you also provided a link to the detailed product roadmap. I appreciate your careful preparation. Regarding the budget, I can see you present the tasks, description, duration, and amount very carefully in the sheet based on the link. However, if possible, you should present it directly in the proposal, which can be in the form of text or images. Because although presenting in sheet is easier to see and grasp, in the event of a broken link or a reader reading your proposal in paper form, your budget will not be tracked. About the members of your team, their information is provided extremely detailed. I am very impressed with their profile. This is a very talented and experienced team. They will be a good locomotive to steer the project to success, definitely.", "q1r": 4, "q2": "An extremely good audit section. You have set the goals for the project by the end of phase 2. The goals are very clear in the aspects: products development, community, fundraising and tree planting. This can be seen as a measure of the progress towards success of the project. The success of the project has also been described, promising to bring a lot of benefits to many stakeholders (environment, Vietnam, other developing contries in Asia, Cardano community, etc.) There is no doubt about the auditability of this project. This is a hopeful project.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for you suggestion on the budget part. The Google worksheet will help the voter easily to examine the calculation of the budget, google platform also stable."}, {"id": 10010, "q0": "Proposing to come up with a complete construction solution for forest planting management application, using NFT on Cardano Blockchain to encrypt crops is the right idea for the challenge. Plants encoded into NFT have specific information such as images, planting time, location of planting trees. We can see how crop management is scientifically encrypted, directly impacting the tree planting management process. The proposal has an impact on the expansion of the form of management by application on Cardano / Blockchain into the reality of businesses, organization. The impact is directly on the Cardano ecosystem as the number of businesses that know and use DApps on the Cardano platform increases. The proposal is that the next phase of the project has been funded at F8, the number of crops has been managed appropriately, the development of the mobile application is appropriate and convenient for the way of management. The goal of the idea to be implemented has a great impact on the environment, combating climate change, this goal is in line with the expansion of the project to countries in Asia. This is the second phase of the project We have not seen the author give the results of phase 1, How the project is being implemented, the result of 500 NFT-encrypted crops, organizations and enterprises receiving the use of Wed application. Implementing phase 1 of the project has had certain difficulties in the use of Wed, the application of technology of foresters. This is also the risk that the proposal presents in phase 2, the author has a way to minimize risks with technical support and training methods using technology. The way to minimize the risk to the proposal is suitable for the development and success of the project.\nRating: 5\n", "q0r": 5, "q1": "The implementation roadmap of the project is detailed by the author showing the Link Google Sheets, the implementation plan has given important milestones to complete the planting of 2500 civets and implement management. Implementing the upgrade and development of the application on mobile devices, perfecting the Wed application. Contact and impact cooperation with the proposed Planting organizations are interested, creating favorable conditions for the implementation of tree planting, NFT artificial token. The members implementing the second phase of the project are former members, the implementation of the project will not face difficulties to succeed. Information about the competence and assignment of work of members has been verified. Spreadsheets on the implementation of technical solutions, communication maketing with the amount of $ 36000 have been given details. The money spent on this is in line with the project's capabilities during this period. As a precaution for possible risks is that the $1800 funding for the instruction and training of technology users is suitable for the project.\nRating: 5\n", "q1r": 5, "q2": "In order to measure the progress of the project in this period, the author has come up with the achievements in accordance with the set roadmap. At the end of phase 2, the proposal completed the application on the Wed platform and mobile devices, developed different languages on the Wed platform. The sponsor's Cardano wallet was created 100 new wallets, with support from the community and 3000 trees were planted. Kpis are performed for audit work and determine the success of the project during this period. I have an opinion on the project progress report that needs to be detailed on the application construction, the UI /UX design of the mobile application. Reports need to be hosted on GitHub and your Wed platform for the convenience of monitoring and auditing the implementation process.\nRating: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We appreciate your recommendations about tracking of application progress and will bring them to our work."}, {"id": 11442, "q0": "This is a very great idea. The proposer want to create a platform on Cardano blockchain namely BlockTree to utilize NFT to oversee reforestration efforts with focus in Vietnam first which could be expand to other countries within Asia. Their project consists of 3 components: a Web app, a Mobile app for Planters and a Mini ERP for planting organization. Their solution is appropriate for the challenge as it will provide transparency in reforestration work in Vietnam, increase the real application of decentralized Cardano blockchain, and help Vietnam to combat against climate change and protect our green Earth. In addition, the proposer also lists out some main risks following the implementing this project: persuading planting organization to apply blockchain tech into their work, educate planters on how to use the platform which might take time and a lot of efforts...To deal with these challenges, the team will consult advisor and partnership manager, who has strong passion and rich exprience in education field. In short, I fully support their idea and hope the team do well and get more community interest. ", "q0r": 5, "q1": "I believe in the feasibility of this project. They provide a very detailed roadmap for both short-term and long-term vision. For Phrase 2, I know what will be done, the description of each main task, and clear target. For budget part, I think the required project's expense is reasonable and detailed. They provide clearly how many hours spent for each task, the hourly rate in USD, the total budget including the risk management cost. However, I would like the proposer to provide more information about who will do which task? Finally, I am persuaded about the feasibility of this project more because they are all talented with rich experience in the related field with provided profiles' link for community reference. I hope with these qualified team members, this project will do well. ", "q1r": 5, "q2": "Though this part is not provide detailedly from the proposer, I think, it is not hard to check the development of this proposal.Community could visit their website, join their social media channels such as Zalo, Telegram, Facebook and have direct communication with the team. Based on the community engagement in the project such as the number of likes, comments on Facebook post, the number of languagues translated on their website,..or base on some key milestones about the product development such as the launch of web and mobile apps, devices for planters, mini ERP for planting organization,.. or their target on fund raising of 5 sponsors and tree planting of 3000 trees,.. In short, it is possible to track the development of the project. ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for positive feedback and comment, we already provided the job description in the team member part. "}, {"id": 11974, "q0": "The phenomenon of global climate change, desertification, floods, etc.,  increasingly clearly affects people's lives. The development of human society and economic development activities have heavily impacted the ecosystem on Earth. Trees are an effective, low-cost, sustainable solution to help people improve the living environment. The idea of afforestation incorporating Blockchain technology is proposed and funded by Fund 8. Entering the stage of Fund 9, the proposed team continues to develop and perfect its product. The goal is to have 2500 trees planted and encrypted. This proposal has received trust from the community and is funded by Foundation 8. Therefore, I am confident that this proposal meets the requirements outlined in this challenge.", "q0r": 5, "q1": "Proposal members are still the same members who have participated in the proposal from Fund 8. Based on their knowledge and experience, they have implemented this proposal in Fund 8 and continue to take the following steps in Fund 9. The roadmap in this phase will take place in 3 months, with the main work items including continuing to raise funds for planting 2500 trees, upgrading set of tools for tracking the reforestation work, reporting the impact, work with planting organization to plant trees and tokenized, and reporting and Marketing the result to create greater impact. The budget breakdown for these items has been described in detail and care. I strongly believe in the feasibility of this proposal in Fund 9.", "q1r": 5, "q2": "•\tThis proposal is the next step in the roadmap of applying blockchain to finance reforestation from Fund 8. Implementing the proposal from Fund 8 gives the proposal team real experience, and they understand the risks well. Therefore, the risk factors and the remedial methods proposed by the group are presented very specifically. The research team has specifically suggested the success indicators to quantify such as 5000 people liking the Cardano forest Facebook fan page, three published articles, 100 newly created Cardano wallets, and 3000 empty trees and tokens (including Fund 8 and Fund 9). Multilingual website for sponsors, app, and mobile for the reforestation team, BlockTreen admin portal completed. These metrics can help measure your proposal's effectiveness and make it easy to track its success. I appreciate the suitability of this proposal.", "q2r": 5, "assessor": "z_assessor_3321", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We are trying our best for the growth of communities as well as dealing with Climate Change impact."}, {"id": 12598, "q0": "The project effectively addresses the challenge, afforestation is always the most effective solution to combat climate change, but this always has a risk of transparency regarding funds, grants that are not optimized for climate change. reforestation, the idea of ​​using NFT to solve this problem is great because it will solve all the problems.\nThe application of NFT will make the funding process transparent from donors, avoiding situations where receiving a lot of grants but afforestation is poorly implemented, not worthy of the funding received, typically the situation of double counting.\nI recommend that Nft represent an area or by any type or group of trees instead of individual trees, because the number of trees is too large will cause many difficulties, another problem is that the forest growers are mostly farmers, they have very little approach to NFT and blockchain,the solution you give is great as this problem will be solved by educating them, which increases the positive view for Blockchain and brings people closer to Cardano.\nI saw you mentioned doing the verifications, how does the verification work? I suggest BlockTree will visit the site to verify the planting area, I think the only barrier in the project is technology, it seems that the project is still in the process of technology development and I look forward to seeing the project more successful reports on this on subsequent funds.", "q0r": 5, "q1": "I highly appreciate the feasibility of the project when the project has a lot of support from participants and partners, especially the project has cooperated with Gaia Nature Conservancy, this is a prestigious organization. ,professionally. The team is very experienced in relation to the development of this project, and all the background information of the team members is provided very clearly and in detail, some of the people on the project I know have had lots of experience related to the fields of education or project management and finance. The roadmap is clear, it defines what activities will take place in which months and goals are set. Although not the most detailed scenario, it is enough for us to safely understand its development. I have no further comment on this part of the proposal, as I think the information provided is satisfactory. Financially, I think the amount requested is reasonable for the scope of the project, and fairly straightforward to understand how it will be used. I suggest in the future you should issue tokens so that the budget will be more abundant, the feasibility of the project will be enhanced in fund 10 and fund 11.", "q1r": 5, "q2": "The proponent makes it very clear and accessible that all previously funded projects can be tracked and audited as progress is made across a variety of platforms,This is a demonstration transparency that we want to see in proposals, where the proponent comes to the community and shows progress, not the community has to ask first. Regarding fundraising success, I think the project should aim to receive investment from a certain number of retail investors instead of just investments from companies, there will be a lot of people who like it interested in the project and the NFT.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your feedback and comment. Yes, we will have plan to go with B2C in later stage of the project, the B2B approach now help the project grow quickly with the considerable cost."}, {"id": 12873, "q0": "The community has demonstrated its commitment to your afforestation initiative by awarding you a grant in the amount of $24,150 through the Fund8 platform. Not only does it make jobs available for people, but it also helps prevent climate change, cleans the air, and protects us from natural disasters that mother nature can bring. Because there are so many positive aspects and benefits associated with afforestation, it is unlikely that we will be able to discuss all of them in this article. In addition to this, you will develop your very own web application, mobile application, and miniature enterprise resource planning system in order to monitor, collect data, pinpoint trees, and digitally transform organizations. plant tree. I believe that the new objective, which is to plant 200,000 trees by the year 2025, is a positive step, and the likelihood of successfully implementing this goal is very high. Not only will it assist in the regulation of the climate, but it will also most likely make the community aware of Cardano and allow them to learn more about it through the utilization of applications that you will set up in the future. You also have a great vision when setting a goal to be able to expand afforestation and tokenize trees in countries in the region, and I believe that what you are planning to do is really humane and noble.\n\nIn light of the risk that you outlined in the proposal, I concur with your recommendation to abandon the manual planting method in favor of one that makes use of science and technology. And I would also like to have a question that I would like you to be able to answer, and that question is as follows: the tree has been tokenized, but there is a problem in the process of development that the tree is dead or has been cut down. Can you please answer this question? Will you destroy that NFT token if the forest is cleared by loggers and then replant the tree that was cut down? The plan for the reforestation could be either industrial afforestation or primary or preventive forest. household. I will award five points for the impact of this.", "q0r": 5, "q1": "In this phase 2 (the part of the project that applies for funding in Fund 9), your objective is to plant and tokenize 2500 trees, which is an increase from the goal of 1000 trees that you outlined in the proposal for funding in Fund 8. green. Following the first three months of this phase 2 of your roadmap, you will be able to finish the applications and tokenize the trees. This phase 2 of your roadmap will continue until June 2023. It is understandable that you will submit an application for funding during the subsequent Funds in order to continue and advance the project. This is due to the fact that the project will take a long time and will require a significant amount of money.\n\nYou provide a full and detailed excel spreadsheet with the number of working hours and the price for each specific job, and I believe that it is appropriate given that the cost for this phase 2 (fund9) is $ 37,800. Vietnam's average income levelIn terms of your personnel, there are a total of 11 people: and you have added two new personnel, Mr. Hoang Tran, and Ms. Tu Nguyen (compared to Fund 8 with only 9 employees), in addition, there was also the advice of Mr. Do Manh Hung and Mr. Nguyen Anh Tien (2 people with a high level of understanding in the field of Blockchain as well as community development, project development in Vietnam), shows that you have a good orientation, supplementing the necessary personnel development of the project in a methodical fashion. I have the utmost confidence in your ability to win this competition and secure funding from Fund 9! The level of concentration is demonstrated by the fact that you do not have more revenue from the project, and that you continue to apply for funding in the next Funds, and then commercialize it so that you can have revenue from product development in the future. Keep in mind that the project you are working on is significant, and perhaps it is something close to your heart. As a result, I give this feasibility section a score of 5 points.", "q1r": 5, "q2": "You have provided the milestones and completion targets for the project through clearly divided concerns about the product, about the community, and about the support, relative information. This relates to the measurement of the progress that has been made on the project. It's close and doable, but all you've said is that the number of people who will follow your Facebook page is 5,000, and I only see that number mentioned. The rest of the issues and numbers include things like: 3 well-known articles, 3000 trees have been planted in your direction, and 100 new Cardano wallets have been created in order to receive your NFTs. However, you have not yet provided them. You can follow them on the project's website or Facebook page; I hope you will add more comprehensive details. If the project is successful, it will have a significant impact on reforestation and it will also bring about fundamental changes to the way reforestation was done in the past. These changes have the potential to spread to other countries in the region, allowing for more effective reforestation and monitoring of these efforts. In the not-too-distant future, it will become a new trend brought about by tokenization. This section's auditability earns a score of four points from me.", "q2r": 4, "assessor": "z_assessor_3497", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for your positive feedback. To address your questions:\n\n1. In the contract with tree planting organisation, we always require them to replace the dead tree within the first number of  years (depeding on the type of tree) applying the same process using our application. After that time, the risk that tree will die is minimal. Our NFT will cover an area contain a number of trees not only one tree per NFT, therefore the risk that all the trees die then need to destroy the NFT is very low. \n\n2. To minimize the risk that the tree will be cut down by human, we select to plant the tree in the national parks which are under the government's protection. Could not avoid 100% trees were not cut down but the risk is minimal."}, {"id": 14446, "q0": "In this proposal, NFT will be integrated to manage reforestation in Vietnam to increase awareness of people here about blockchain technology while preserving the environment. The proposer is already in partnership with an NGO Gaia Nature Conservation to help plant trees. A certain number of trees will be tokenized and they become NFTs with information of the trees (planting time, longitude,..). These NFT can be minted using Cardano blockchain - this is a good integration of Cardano blockchain where meaningful contribution can be made to the environment while the blockchain technology is promoted. This can have a big impact if properly promoted as Vietnamese people already know about blockchain technology and may participate in this tree-planting project as donors due to its environmental benefits. The proposer is able to specify what the product will be (tracking applications on web and mobile versions, ERP). The proposer intends to expand the scale of this project to other Asian countries by building communities and working with local authorities. The environmental impact of reforestation is undeniably beneficial and closely aligned with governmental plans in the home country Vietnam (planting 1 billion trees - with attached articles). The proposer is able to point out the extensive impact of this proposal on not only the blockchain community but also the life quality and sustainable development. The main risk is the integration of technology into the manual process of tree planting organization. The technical skills of planters must also be upgraded to smoothly carry out the technicality that this project entails. Mitigation will be thorough education and cooperation. Risks from fluctuating coin price are also concerning and the proposer has accounted for this by adding 5% in case there is a drop in ADA coin.", "q0r": 5, "q1": "The roadmap for phase 2 - F9 will start right after they receive funding. Phase 1 has received funds in F8 and there will be deliverables (MVP) at the end of August. There are specific goals and clear milestones (in months) of what will be done. The timeline is quite clear with activities focusing on working with tree-planting organizations, preparing tools, tokenization,.. A detailed roadmap up to 30/6/2023 is provided in the form of an attached link (https://bit.ly/blocktree_products). Similarly, the budget breakdown is extremely clear and provided in an URL (https://bit.ly/ADAforest_budget) that will lead to a google sheet with all the tasks and description of what that role involves as well as the money paid for those tasks per hour. The presentation is clear and ensures transparency. The team members are well represented with information about their working experiences, position that they are currently holding. The expertise of the team members proves sufficient to undertake this project. One of the team members is the founder and CEO of Gaia Nature Conservation which assures that the partnership between this NGO and the project is tightly-knit. The role that each member takes is also clearly specified so we can have a good idea who will be in charge of what areas and see that their experiences are well-aligned with the role they take. They will have to return for further funds (F10, F11) as in initial stages, no revenue will be expected but they will plan to commercialize the project in the future.", "q1r": 5, "q2": "The auditability is good with the output of each area (Product development, Community, Fundraising and Tree planting) is clearly specified with quantifiable KPIs and deliverables (the number of followers on Facebook, the number of corporate sponsors, of Cardano wallets). The proposer should also update regular reports on public websites for people to witness the progress of this project. All of the metrics are well focused on the proposal and the Cardano ecosystem as a whole. Similarly, the vision of success and SDG goals are also related to the objective of the proposal and focus on contributing to sustainable development, raising awareness about Cardano and blockchain community and more support for tree-planting organizations.", "q2r": 5, "assessor": "z_assessor_4055", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for your positive comments and judgment. We are trying our best for the growth of communities as well as dealing with Climate Change impact.\n"}], "solution": "The solution is to use NFT on Cardano Blockchain to manage the reforestation work in Vietnam.", "experience": "The team consists of Plutus Developer, Community Manager, Project Manager, Finance advisors, UI/UX designer, Digital Product Manager, Marketing, CEO of tree planting organisation."}