{"id": 414647, "author": "sampsondaniel", "title": "Metera: Impactful Token Portfolios", "url": "https://cardano.ideascale.com/a/dtd/414647-48088", "category": 26595, "amount": 92700, "description": "Earth's climate faces dramatic deterioration in the absence of collective intervention. Yet, impact initiatives face many challenges and disingenuous projects \"greenwash\" for marketing purposes. ", "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"id": 9211, "q0": "In this part, the proposers have stated clearly the problem that initiated them with the idea, quite a lot of background information for it, along with the target subjects of their product. They also provide some information on market demands for their solution, which is another good point. However, in my opinion, it would be better if they could describe more in details about their product, how it works and how it greatly benefits target subjects.  \nIn the next question of this part, the very first good point that the proposers have made is that they strongly prove how their product can serve and strengthen Cardano ecosystem by showing the difference between Cardano and other blockchains. They can also give out some existing projects as examples in order to prove their viability. In this part, the proposers do describe more on their product, its merits, and its operation. Nevertheless, if they can demonstrate the results that their product could produce, especially measurable results, the impact part would be way better. \nAs for risk analysis and management part, they are seemingly to be fully aware of the possible risks and they also prove that they have a bigger team to back them up, which is good. Even though, I prefer that they could express more on how they would handle the challenges mentioned including off-chain infrastructure and timely deployment. They should also clarify the complications that they have planned for in the budget.", "q0r": 3, "q1": "In the detailed plan part, the proposers in general could express the concrete goals and achievements that they would attain after 3 different stages. However, their plan can be considered as not detailed enough to highly likely persuade readers to give them the funding. Personally, I think they can describe more on what they have accomplished in v0.1 to increase the level of feasibility, and also their plan after the 8-month period, if they can show their long-term plan with their vision, people would have a greater view on their requiring funding for this stage. Additionally, they should also provide more specific information on not only what they would achieve but also how and by which tool, which technology they would use to achieve their goals, by doing that, I believe their product would be assessed more highly in feasibility.\nIn terms of budget breakdown, personally I find the way they calculated their working hours is clear and informative enough with itemized tasks.\nBesides, in the last part, the proposers have made an considerably good demonstration of their team which tells us in specific the professions, experiences and roles of each member. A vivid example for this is the very first introduction of their Chief Impact Officer, Santiago. It can be seen that his strength focuses on projects that relate to impact and sustainable finance, and they also showed his experiences in the fields, also later on the parts that he is incharge of in this project very clearly. Other than Santiago, they described the capacity of other teammates that points out a great relation to Cardano and blockchains in general as well. Along with this plus point, it seems that they have done also projects in previous fund, which could be one of their extra advantages.", "q1r": 4, "q2": "For auditability, both the tracking measurement and the success of the project is seemingly reasonably understandable. They did put the link of their v0.1 demo iat the beginning of the proposal, so the success would be more likely to be achievable. Nevertheless, for the tracking measurement, the proposers should make it clearer and more particular in terms of how the internal spec and development plan look like or how they work, how the community can keep track of that later. If they could do so, I believe this part would be way better and gain more trust from the community.", "q2r": 3, "assessor": "z_assessor_3030", "no_vca": 2, "ne": 2, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 2403, "q0": "We observe that this proposal aims, in general, to use a protocol to facilitate the investment in ecologically correct assets. We note that this could be a great way to expand Cardano's visibility, as green assets are on the rise in the traditional market, and it looks like a good opportunity to spread the blockchain concept. In this way, we can say that this proposal is aligned with the objectives of the challenge. We believe that the success of the project will contribute both to the preservation of the environment and to a greater adoption of tools that use Cardano's technologies. Furthermore, we see that the total amount being requested, which is quite considerable, seems consistent given the projection that the product can achieve. There are also other factors that support this budget, as will be described below.", "q0r": 5, "q1": "Given the scope of the project, we realized that its central idea has a considerable technical basis, which makes us expect the presence of professionals specialized in the area. And we realized that this requirement is very well met, since there is a programming company participating in the team. By the way, this team's website is available, and we noticed that both the projects already carried out and the team that makes up Mlabs are exposed. Furthermore, the steps described in the action plan make a temporal sense, and already aim to release a version on the testnet after 8 months. Another positive factor that makes us believe in the feasibility of the project is that it is not yet at the theoretical level, since there is already a prototype with a demonstration video. Regarding the budget details, we were able to find a good organization, as we saw that the activities were separated into working hours, which makes it even easier to justify the total budget being requested. We also noticed that the largest amount of hours is being devoted exactly to Off-chain development, which is one of the fundamental factors for building the application. For this, a total of 400 hours are being allocated, representing approximately 40% of the total hours, which is quite consistent. In short, after analyzing these factors and together with the fact that an innovative protocol is already being developed, we have that this proposal seems to present great feasibility.", "q1r": 5, "q2": "Regarding the ways chosen to follow the development of the project, we were able to find the explanation that the established development goals will be followed, and we also see what parameters to track the evolution of the project were established from that, such as the number of tasks completed. . However, it would be interesting if in the section on the perception of success, quantitative goals to be reached were indicated, thus facilitating a future evaluation of whether or not the project was successful. Such targets could be, for example, a number of users participating in the platform or expected volume of transactions.", "q2r": 5, "assessor": "z_assessor_2306", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2776, "q0": "Through the brief presentation of this proposal, I determined that the team would provide a tool to measure the actual impact of a centralized asset, e.g.: clean water and sanitation, jobs decent & economic growth. and investors can control and monitor their investment portfolio, by purchasing and using the metric that this proposal provides at the request of client investors.\nIn addition to the arguments stating the problem and the solution proposed by the team published in this summary, the team has also satisfied the conditions to be able to evaluate this proposal may have an impact on some investors and companies in the market.\nAt the same time, the team mentioned that the Metara demo v.01 version of the proposal has been started, and has video evidence, so the risks may occur affecting this proposal the proposed team confirmed it will be unlikely, and the team also stated that if it happens there will be an MLabs team with a team of experienced developers who will fix it.", "q0r": 5, "q1": "route plan provided by the proposed team and a commitment to deliver within a 13-month period, along with explanations for each proposed implementation timeline.\n All expenditures for each item and content of work are published and attached with the hours performed. and the proposed team also made a request for the contingencies budget, because the element is very technical, so it is necessary to have those provisions. However, for the best, the group should have a commitment for that backup, where it will be stored if not used, and developed for what purpose in the future.\nabout the information the team has met the conditions, because the team has provided all relevant information and assigned each item to the members of the core team to develop the proposal.\n so based on experience and published documents from the proposed group, it is very likely that this proposal will be successful in the future.", "q1r": 4, "q2": "Development plans and internal specifications are used to guide goals and progress. that is the commitment of the proposal but in my opinion that is not enough, the proposal should have plans to widely publicize or support those workloads for the community to monitor and verify them, so that it can be satisfied. transparency is guaranteed.\nIn addition, in the successful definition, the team only shows the success of the techniques that the proposal will develop, the team needs to add to the determination of who will benefit from the features that the proposal will develop. This proposal offers, for example, investors. As such, it may be difficult to track progress and determine the success of this proposal.", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 7527, "q0": "The fact that the Earth's climate is facing a serious deterioration is an issue that needs to be addressed in this challenge without collective intervention, it is not known how severe the degradation would be. This proposal fits this challenge this is a scalable problem for the future this proposal could help the Cardano community grow. To solve this challenge Metera created innovative wishes and smart contract to solve the problem of this challenge. This proposal is intended to fund development and testing. The risk in this challenge is that the low delivery process affects delivery.", "q0r": 5, "q1": "It is proposed to define a clear timeline divided into 3 main phases:\n1 month: Vault fee management system developed and integrated, Test suite, UI design and v0.2 specification in progress.\n4 months: Testing, UI design is almost complete and in progress. Off-chain work begins.\n8 months: Full testnet rollout is underway with some final improvements and optimizations still in progress.\nThis timeline is perfectly reasonable to make this project a success. The success of this project is related to the project's campaign challenges a smooth testnet deployment with the necessary infrastructure set up and the detected issues, if any, fully resolved. Success is the destination for challenges. The solution to this challenge is to integrate sustainability into the Cardano platform. The foundation of the proposal includes portfolios focused on high-quality, sustainable projects, built on Cardano. Metera utilizes a powerful oracle system to properly check and value tokens eco-friendly implementation of this process reduces the burden on individuals and users it also keeps users away “cleansing” in which companies set sustainability goals with the potential benefit of promoting their brands. The author has provided solutions and they also solve the challenge of the problem effectively to help participants have a better overview.", "q1r": 5, "q2": "This project's metrics are the author's implementation of a blueprint developing internal specifications used to guide the project's goals and progress. They measure the number of goals achieved as well as our implementation progress with the testnet. Well-defined success metrics and KPIs. The author has a strong team where Metera is a protocol for creating sustainable portfolios on DeFi it is built on Cardano. We can visit their website to join their movement to learn more about the team's vision: https://metera.io/.\nThe team consists of the following members: Santiago Portela Director of Impact is the co-founder of the METERA protocol, MLabs has quickly become one of the leading developers in the Cardano Ecosystem, they are Plutus's partner IOG and regularly work with IOG to develop the Cardano blockchain and ecosystem. They employ over 100 developers and have helped build community projects such as: Liqwid, SundaeSwap, Cardax, Optim, and many more...George Flerovsky is delivery manager, Vlad Posmangiu is gims project manager . The team has a large force with knowledge and experience that is very suitable for the project they have a lot of experience in participating in the crypto market and have a lot of in-depth knowledge about blockchain. With these skills, I think the project is completely feasible and can do more for the community in the future. The group's information is public and transparent and can be easily contacted. The funding applied for this project is $92,700 less than 20% of the total challenge budget. The project's budget is fully listed by the author, and I find those expenditures suitable for the challenge. This proposal is a new project and is seeking funding.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8733, "q0": "Your proposal presents us with Metera, a protocol that enables users to track and create portfolios of cryptocurrency-only impact-focused assets. I am very impressed with this idea. All solution information is provided in the proposal, including Market and Problem Space. You also indicate the proposal will address the requirements of the challenge. Cardano's shortcomings are given, and your Metera project promises to address these flaws, while integrating sustainability into Cardano. This is really something to look forward to. The value that the project brings is undeniable. At the end of this section, you also mention the possibility of a risk to the project. Overall, your IMPACT section does a great job. It is full of information and presented in a way that is easy to understand.", "q0r": 5, "q1": "I can see your roadmap, detailed budget breakdown and team members featured in this section. You provide us with a plan with milestones of 1 month, 4 months and 8 months. The tasks in each stage are also clearly mentioned. Expenditures are also provided fully and transparently in a detailed budget breakdown. Members who join Metera and MLabs are introduced to their position, education, and experience. Your presentation is really comprehensive. Thereby, I strongly believe in the feasibility of this project.", "q1r": 5, "q2": "In this section, you briefly describe how the project is measured and successful. However, in order for us to be sure this project is auditable, you must be more specific than what is included in the proposal. You said you would measure the number of goals that were outlined in the budget, but it would be better to rephrase that and let us know how you measure those goals. If possible, you can also come up with KPIs to measure and ensure the success of the project. Although the previous sections you presented are very good, with the information in this section, they are not specific enough for us to confirm the auditability of the project.", "q2r": 3, "assessor": "z_assessor_2997", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10528, "q0": "This proposal seeks to bring impactful uses to cardano by offering a way for mindful investors to find a trustworthy eco friendly business to invest in. This is extremely relevant as we all fight climate change today, and could bring very impactful and meaningful traffic into cardano. The author proposes vetting of the quality of investment options through a number of very well thought-out metrics. Perhaps a fuller description of these metrics, offering full transparency, would help people believe in this project further, and use the service more. This type of meaningful and foward thinking project is what is needed for cardano, in my opinion. ", "q0r": 5, "q1": "The environmentally friendly nature of the cardano proof-of-stake will help immensely in making this project a success. The team is very experienced in coding and development, so I have full faith that they will be able to deliver the project completely. However, it would be better if the team could elaborate on what kind of risks and challenges in the development phase that they have prepared for, and what their potential solutions could be. With a team of over 100 coders though, I don't think it will be a big issue to solve any challenges. The timeline seems realistic and within the capacities of the team. Regarding thebudget breakdown, it is very detailed, with coding hours planned in great detail. I believe this project is very feasible and the team will produce a quality product.", "q1r": 5, "q2": "The team has a full detailed timeline and concise goals for each step, so it will be quite easy to audit the progress of this project. They also offer to show the different errors and solutions to those problems throughout the development period. There will be no issue tracking progress. As for the success, it will could be tracked easily with the website available for the project. There is a community tab, where users and developers can interact, and fix any bugs encountered along the way. We will be able to see what the community and users think and read feedback. I think the audibility of this project is very high.", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14900, "q0": "The problem described in this proposal is pretty close to the challenge. Climate change is a global challenge, and addressing it will require a portfolio of responses with varying degrees of risk and efficacy. As they demonstrated, \"Metera is a protocol that enables users to track and create portfolios of cryptocurrency-only impact-focused assets\". Investors worldwide have invested in and are starting to invest in cryptocurrency. Through their supporting features, the riskiness of cryptocurrency can be drastically reduced so that more people will have an interest in cryptocurrency. The proposal has pointed out that Cardano relies on an environmentally-friendly proof-of-stake consensus mechanism with a markedly reduced consumption of electricity. They did a great job analyzing the environment of blockchains and what Cardano is capable of. The proposers have succeeded in showing the benefits Metera brings to the community. Helping users sidestep \"greenwashing\" wherein firms feign sustainable goals with the hidden interest of promoting their brand, is a great feature that can attract companies moving to the product in the future. However, a specific vision that is being aimed at as the main goal is crucial. Although all the features and promises were mentioned in the proposal, they seemed to have multiple technical challenges that have not been solved yet, making the possibility of success for this project uncertain.", "q0r": 5, "q1": "As far as how good the impact is being written, the feasibility has not been able to live up to expectations. They slightly listed the timeline and a vague explanation of budget breakdown. The timeline showed only the deadline for each part of the work in the project. Having the Vault Fee Management System developed and integrated, Testing Suite, frontend design, and v0.2 spec prepared are a considerable number of tasks that they plan to do, but with one month as described, more detail in what will be done in order for them to complete all the tasks so that the success of the project won’t be kept skeptical. To make all the listed work reliable, a demonstration of how the testing, design, and deployment are being worked on is important since the community needs to keep track of the project constantly. Furthermore, what are the main achievements they expect to have when finishing all parts of the plan are something worth mentioning. Despite a big funding request, the way the budget is broken down is completely unclear. Besides listing how much money they plan to spend on each category, the money that is being spent on each month, staff hiring, payment for equipment, and several in-depth technologies spending are needed. Since the skills required for the product were not mentioned, based on what is written in the proposal, they have a stack roster to prepare for the project.", "q1r": 3, "q2": "Though they have a big vision of the features of Metera. The progress seems quite opposite to what has been told, everything is still in the measurement phase and no particular number or calculated time KPIs have been settled. A demo or beta version of the current state of the project would be great to have. A bright future for Metera is expected, but to make it easier for the community to follow, goals and progress updates are required.", "q2r": 2, "assessor": "z_assessor_4109", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "With innovative oracles and smart contracts, Metera allows communities to collectively create impactful portfolios, bringing mindful investing into the crypto space and onto Cardano.", "experience": "Sustainability-focused and professional entrepreneurs partnered with MLabs, an industry-leading Haskell/Plutus and blockchain consultancy."}