{"id": 414687, "author": "larrisa.health.marcus", "title": "Digital Assisted Midwifery", "url": "https://cardano.ideascale.com/a/dtd/414687-48088", "category": 26595, "amount": 71070, "description": "Midwives could worldwide prevent 80% of deaths related to pregnancy.\nYet, these unsung heroes are still being overshadowed by obstacles in this task.", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 2777, "q0": "I really appreciate the idea of ​​this proposal, when the team raises the reasons that they will need to come up with a solution in this proposal, it means a lot to preserving and taking care of a world. future generations are children, in addition, it also contributes to promoting more attention of the community to pregnant mothers, after statistics on the number of pregnant mothers who are having difficulties in many countries. experts, and the team came up with a solution to support and also to solve this problem. by establishing a health consulting organization for pregnant mothers, postpartum mothers in general, of childbearing age, knowledge related to childbirth and the health of mothers and fetuses. Through digital, the proposed team will propagate and reach the target audience using technology platforms such as: website, YouTube, Twitter, Instagram and possibly TickTock. In addition, the group will also release books on related knowledge and books, two books are expected to be released, and there are also plans to release content in parallel with video, to serve those who have not. Conditionally, the team also announced its intention to raise capital by issuing native tokens, and revenue from book sales for the sustainable development of this idea. There are two risks that have been identified and all of them are. there are solutions to optimize them,\n* Through specific documents and plans and certainly announced by the team, this proposal is perfectly suited to the challenge. However, I would like to contribute some constructive comments to make the plan more perfect.\n- Firstly, on the issue of selling books, in my opinion, the group should not put all the content in the books that you want to sell on video, because that will be difficult to sell with the books and print. It can be a calculation to create scarcity for the product for the purpose of selling books.\n- second in the section of the group plan it is necessary to specify which areas the proposal will apply to the solution, i.e. the group needs to delineate the target area, or if the proposal is to be developed internationally, Therefore, the team needs to have a plan for removing the language barrier between the two subjects, the midwife and the pregnant mother. For example, if the mother tongue of these two subjects is not the same, it will be difficult to give advice or impart knowledge related to childbirth. that's an example if the proposal is intended to develop internationally, but otherwise the team needs to have statistics on the number of mothers of childbearing age and evidence for those statistics, i.e. target zone.", "q0r": 5, "q1": "The proposal team provided a detailed and detailed plan for the implementation of the idea. by having the symbols: O,H,W,C, based on these markers the group notes the work that is difficult, and the work that has been completed before and the work that has not been done, the tasks work in progress, in addition to examples of completed work with pictures. Overall a very solid and complete plan.\nIn parallel, the expenditures for the budget are also based on each work content mentioned in the roadmap, to attach the amount of money to be spent on that content, thus ensuring transparency and clarity for the project. every smallest expenditure,\n along with that information about the team is fully published, and related experiences such as medical doctor, midwifery. every member has been assigned the job to do according to the available member's own experience.\n So based on the documentation provided and the team's diverse medical experience I believe this proposal will be successful.", "q1r": 5, "q2": "Although there are community interactions with caregivers on social media platforms, the majority of work will also require the publication and support of the proposed team for the community to be able to monitor and control it. evidence, eg Number of critical cases recorded, Number of important cases resolved. so the team needs to have notes or statements that will support the community by making those metrics widely available on social platforms, or such periodic reports will ensure monitoring of the workload. resolved work of the proposal for community verification.\nsuccess goals are defined by the team in two as there are long-term goals for self-employment and revenue, while short-term goals are likely to impact the care and protection of the midwives. target.\nThus, based on the documents published by the group, the success of the proposal will be easily determined. As for monitoring the progress of the proposal, the team needs to have a plan in place to support the community in verifying the stated indicators.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1, "reply": "Some information will be published on the website and we are considering a discord solution to keep the interested community members up to date."}, {"id": 3668, "q0": "There are many parts to the proposal, but generally it is well intentioned and could help reduce new-born and maternity related deaths by spreading midwifery knowledge more broadly. Specifically, it would be better if the proposal could touch on one use case and illustrate how such a solution would be much better than existing alternatives. The team themselves noted that the main beneficiaries are from lower income countries which has a higher corelation to lack of internet access, if web2 websites and solutions aren’t serving this target demographic well, trying to get them to use web3 platforms would be even harder and less successful. It is an ambitious project which must be applauded but the benefits of using blockchain for many use cases aren’t well articulated or convincing eg increasing the reach of midwives and rebalancing their workload will probably be better done on web2 rails given that many more people use it and is much cheaper and efficient to compute. Some aspects make more sense like utilizing NFTs to build a community. Some aspects are promising but need more development such as using the blockchain for health records. A health record is only useful if other medical professionals acknowledge its legitimacy and use the data for medical decision making, if it is deemed as untrustworthy (Who recorded the data? What are their credentials? Are they legally certified?), then the medical community will probably disregard the data for fear of inaccuracy or lawsuits. Such projects can always be improved and while not perfect, still worth funding.", "q0r": 4, "q1": "This is probably one of the most detailed plans for timelines and budgets and it can be seen that the team is passionate and committed to bringing their plans to reality. Their team has a mix of software engineers, doctors and designers which provide a well-rounded skillset to achieve their goals. Though it should be noted that the team didn’t mention having specific experience with blockchain generally or Cardano specifically.", "q1r": 4, "q2": "A very good set of key metrics will be tracked and reported which are very relevant to the goal at hand such as number of midwives onboarded and number of critical cases solved. The only thing to add would be a regular community update and to open source the code, which is important to ensure that data can’t be compromised easily.", "q2r": 4, "assessor": "z_assessor_2468", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1, "reply": "This is one of the best and most valuable assessments I have ever read. It touches on relevant points. They are already in discussion, but I totally agree that they could have been added to the proposal. Thank you for taking your time as a PA."}, {"id": 6096, "q0": "Every day, there are still babies born in the world. Besides advanced medicine, midwives around the world are still actively bringing babies, young generations, and future generations into the world (preventing 80% of pregnancy-related deaths). However, midwives have not received attention due to obstacles in their work. Here, it is proposed to move towards the development of a digital platform, to increase the accessibility of mothers and midwives for knowledge sharing and governance, with the goal of reducing mortality, in reproductive health. The proposal is very good and suitable for the challenge and is described in great detail such as: Midwifery status and reproductive health; Approach. The biggest goal here is to increase accessibility and efficiency in the midwifery profession. At the same time, applying websites, media information, social networks, production and circulation of books to create awareness. The author has set short-term and long-term goals, expressing the author's vision, know what I will do, how to achieve the success of the job that I am trying to develop. Create and improve various Dapps, products, and integrations that provide value to the Cardano community and broader ecosystem. In addition, the author has recognized the risks in the project and has active solutions to minimize risks when the project is implemented, creating sustainable progress for the development of the project.", "q0r": 5, "q1": "The author has provided a blueprint for the project. The project roadmap has been prepared in advance. The work was carried out from June 30, 2022 to August 1, 2022. The works before being funded / voted, are listed densely, showing the enthusiasm and active preparation of the author. fake. dummy for this project. Following is the project's roadmap after receiving funding/votes. According to the information provided by the author. We know that the roadmap of the project will be in 3 months. At the same time, the tasks to be done in each month are clearly and specifically arranged. The proposal requires a budget of $71,070 to support the work on the project. The author has provided a detailed budget table for each month. Budgets are broken down for each job and explained in detail by estimated hourly rates. A clear budget increases the credibility and sustainability of the project. Finally, the team members join the group. The author has provided text introduction to each member and attached links, so that we can learn about each member and increase our confidence in their ability and experience suitable for the job. work on the project. We know each person's identity, skills, professional experience. Specifically: Marcus Ubani (Co-Founder, CEO/CTO); Marta Portella Gonzales (Design, User Interface, NFT, Video Production); Doctor. Joscha Beek (Advisor - Gynecology and Obstetrics, Health Infrastructure). etc. The members all have their own strengths and they make up a professional team. Members have achieved specific successes and held important positions. The team is an important factor determining the success of the project. The above information shows that the ability of each member is the strength that makes the project successful.", "q1r": 5, "q2": "The testability of the project is very good. Starting from the fact that, in this chapter, the author presented the project plan in great detail. Work needs to be done within specific established timelines. This way we can easily check that the tasks to be achieved have been done on schedule as described. At the same time, detailed budgets are analyzed over 3 timelines (in 3 months) to support easy and transparent audits. Besides, the team is members with enough professional skills, will be able to complete the project on schedule. The author provides a series of metrics by which we can measure project progress. Specifically: Number of books opened on the website; The number of NFTs requested; Number of midwives referred; Number of followers on social networks; users download Lace wallet; Animation is pushed to Arweave, then KYC, DID, SSI are generated etc. Which means we have multiple ways to test this project. In my opinion, the necessary, important information provided is established and satisfactory, allowing us to easily perform an accurate and transparent audit. and the final product was an unexpected success of the project, raising awareness about midwifery and midwife-led care; develop Larissa; become a catalyst for Cardano… If the proposal is successful, it will not only contribute to raising awareness among midwives, but will also significantly reduce mortality, related to pregnancy. Benefit the community and the growth of the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6883, "q0": "-\tThe submission is indeed very commendable for its objectives related to Sustainable Development Goals, education, promotion of midwifely and delivering real world impact in the healthcare sector in  the field of reproductive health for women, where their lives can at times be at risk\n-\tBuilding on Cardano further positions the ecosystem in the healthcare sector and will eventually allow a specialisation within the ecosystem with regards to standards and compliance with regulation, if this project succeeds\n-\tIt is therefore also in the interest of Cardano to support such initiatives, while also looking at the broader industry standards and regulations that need to be upholded for such initiatives to go to market successfully. \n-\tThis initiative will therefore both benefit from Cardano as well as challenge it \n", "q0r": 5, "q1": "The platform suggests a few key value propositions that may benefit from a comprehensive assessment of the business model and evaluate whether building a Web 3.0 social network with a Business to Business as well as a Business to Customer network may be worth investing in :\n-\tTargetting education by content, creation, communications (website, YouTube, Twitter, Instagram, and potentially TickTock.) is certainly a \n-\tSupporting midwifes provide education and support around sexual and reproductive health to women and pregnant women\n-\tCollecting data, using DID ( probably Atala Prism), KYC ( blockpass) to ensure security of data\nThe above value propositions could benefit from https://profila.com/ and https://hippocrades.org/ that are both building on Cardano ecosystem. Using a launchpad like Revuto or Cardashift may also help move forward quickly in introducing a self sovereign token that can help financing their roadmap as well.\nThe team is also looking the compliance requirements actively so it may benefit them to follow the Mica regulations proposals (https://www.consilium.europa.eu/en/press/press-releases/2022/06/30/digital-finance-agreement-reached-on-european-crypto-assets-regulation-mica/) to ensure that they can anticipate any changes in the upcoming 18 months regarding NFTs, or plans for getting listed on an exchange.\n", "q1r": 4, "q2": "-\tThe KPIs established will surely help the team move forward and pivot and adapt their capacity requirements. While it may be hard to measure impact of education and communications, the team is clearly making sure  that their activity is creating network effects between midwifes, the broader healthcare industry, women and girls.\n-\tMeasuring the impact of those network effects could also be of interest :\no\tAmount of funding/incentives made available to midwifes through the platfom from developed countries to developing countries\no\tImproved family planning for girls and reported data on better scheduling of pregnancies\no\tCreation of a marketplace allowing midwives and other partners of the ecosystem to offer their services  \n", "q2r": 4, "assessor": "z_assessor_2845", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you, for this fine proposal. We are aware of the given suggestions in the link and have tracking some of the named network effects on already our list but will enhance the list to your suggestions."}, {"id": 7364, "q0": "This proposal is very good and fits perfectly with the objectives of the challenge. The proposal clearly identified the problem, and they wanted to create a technical platform to increase the reach of midwives. It connects midwives, pregnant women and mothers to share knowledge and governance, in order to reduce mortality in reproductive health. The proponent, in addition to explaining what will be done, provides a lot of detail about the risks (human, environmental, technological, legal...). Looking here, I see that the proponent has precise goals, knows what he will do, and how to achieve the goal of success in the end.", "q0r": 5, "q1": "The team provides a very detailed roadmap explaining the basic activities to be performed for each day and each month. In terms of an almost perfect team, we have details to know who they are, what their roles are, they have enough experience, knowledge and expertise. Regarding the financial explanation: for this part, they ask for $7,1070. In this part, they present in great detail and explain the reasons for each part, for each hour of the month. The amount matches the stated budget.", "q1r": 5, "q2": "Although there are not many indicators to measure the success of a project, this part of the proposal is very good. The team told us what their specific goals were, the team provided us with good data to use to evaluate the proposal, and divided the phases of the project, with respective tasks on what to expect in each stage. In this way, we are provided with information about what will happen and when. Everything fits here in my opinion, the team explains very well what we need to know and what specific goals need to be achieved (including widespread Cardano adoption and blockchain diffusion), which fully meets what is required in the challenges).", "q2r": 4, "assessor": "z_assessor_2888", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13911, "q0": "There is clarity in stating of problem thus midwives preventing 80% of deaths related pregnancies by the creation of a digital platform that seeks to strengthen the reach of midwives. It connects midwives to pregnant women  for knowledge sharing and governance to reduce mortality in reproductive health. This proposal also addresses the challenge settings in the cardano system. In addition, key metrics and goals of the proposal aligned with the outlined challenge setting is clearly stated making the proposal very clear for a layman to understand every single aspect of it   without necessarily doing a personal research. \n    They however stated that their big goal is to increase the reach and efficiency in midwives which is great. When looking at how to scale ones proposal  to address future challenges, they did a great explanation there, also adding  up a presentation  of the plan for the project’s implementation and sustainability  was called for .", "q0r": 5, "q1": "From the experience and plan presented, it is highly  likely this proposal will be implemented successfully because of some experiences like service related industry, app development, economics and marketing, midwives, gynecology, obstetrics, hospital management that has shown that members of this team are professionals who have been in these fields for some  time now . A well detailed information was given with regards to all team members. \n      In terms of the amount to commence this project, a total amount of $71070 was required with a monthly spelled out expense of  3 months per the divisions which includes infrastructure and others. This project describes all resources thus; material, human  and others needed resources to successfully implement it and also a clear  and elaborative timetable . Considered risks and challenges are also clearly stated with how they intend overcoming it which is a great initiative and so therefore worth investment. ", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the success of this proposal in a sense that the roadmaps that are categorized under 2 broad headings thus ( roadmaps before funding (creation) and after funding with intervals of 1 month, 2 months and 3 months respectively show how they intend to go about the project. When measuring the success of this project, how to reduce mortality related incidents is prime. Relevant midwives have to improve their time schedules to prevent and improve efficiency. A lot of ways to track this businesses successes has also been mentioned but to mention a few thus: number of books sold, number of books opened website, number of midwives on board.  This proposal however not only shows clear understanding and effective solution that addresses the the problem with success but shows an accessible public channel for delivering regular updates to the community for auditing progress which I believe is worth investing in. This proposal is a good one with well elaborated details, if sponsored will help solve one of the very important challenges facing some countries. ", "q2r": 5, "assessor": "z_assessor_3847", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A digital platform that seeks to strengthen the reach of midwives. It connects midwives, pregnant, and mothers for knowledge sharing and governance, to reduce mortality in reproductive health.", "experience": "The seasoned team consists of experts in the service-related industry, app development, economics and marketing, midwifery, gynecology, obstetrics, and hospital management.\nSPO, active since F7, CA/PA, Plutus Pioneers III, Atala Prism Pioneers II, Proposal mentor.\nLoving parents."}