{"id": 414729, "author": "littlefish.foundation", "title": "littlefish - Shaping Action", "url": "https://cardano.ideascale.com/a/dtd/414729-48088", "category": 26595, "amount": 98667, "description": "In decentralized work, visibility to contributions is low, information doesn’t spread effectively. Action doesn’t align with common goals. ", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 6659, "q0": "Littlefish is a DAO that wants to reimagine work. In today’s world, the mechanisms we use to earn income are outdated and suboptimal. They limit autonomy within the workspace and represent a costly trade-off between financial stability and personal growth aspirations. Well, littlefish wants to start afresh with a model that stimulates individual leadership and initiative, asynchronous work, voluntary participation and a constantly evolving landscape. \n\nLittlefish have chosen the distributed ledger technology to set up camp because it can boost ideas like anything we have seen before, and they have chosen Cardano in particular due to its research focused ethos and the fact that Catalyst was the spark behind the idea rolling down the hill. As a personal note, I add that Cardano was an excellent choice also due to low transaction fees, best suited for such a project, but more details on this in the following section. \n\nTo fully understand their value proposition you have to visit their website and read the white paper. They have a fresh style, they keep all the information simple, easy to understand and it is complemented by very informative charts and diagrams. This assessment cannot really do justice to all their ideas, but here is the nutshell: the functioning model is built around the user (little fish) who is part of a wider entity (the colony). Littlefish are of course economic actors wishing to maximize their utility, while the colonies are created around a common goal / idea / task / cause / etc. The littlefish performs actions, and these actions are treated as an economic goods, thus carrying value and can be exchanged, or rather sold by the little fish. Another key feature of the model is a revenue sharing mechanism between the fish and the colony, complemented by a reward aging characteristic to incentivise fresh action over inactivity.   \n\nWhy are littlefish asking for funding? Because they want to build a decentralized platform, and at the core of this platform lies the Action NFT, the building block behind every action performed by the little fish (users). The Action NFT will be rather tricky to develop, since it represents human actions, it must be designed to be embedded with random combinations of images, videos, documents, time stamps, perhaps DID signatures in the future or even geotagged data. The aim is to have an MVP ready by September, extend its functionality until December and bootstrap contributors until February next year. Littlefish have six funding requests in this round, and they are all interconnected. Make sure to read them all. \n\nEverything within this proposal is a testament to the team’s rigorous process, no-nonsense approach of explaining their thinking and of course, it all fits extremely well within the challenge whose role is, I remind you, to foster the development of DAOs on the Cardano space and build the tools necessary for future projects. Well, this is definitely a perfect use case for that purpose. Moreover, if Catalyst would ever implement a sixth star, littlefish would be a prime candidate to receive one. ", "q0r": 5, "q1": "Let’s talk about the team first of all. You can search through the Fund 9 proposals high and low, it’s unlikely to find a better example of how a team presentation should look like. Each main team member presents him/herself in a few paragraphs, and it is all complemented by Linkedin profiles as well as the personal github repository, since most of the members have a strong technical background. Each member's presentation ends with highlighting the actual modules on which each member will focus, thus making the reader’s job effortless when trying to make connections throughout the text. I am extremely impressed by their meticulous approach. \n\nFor this proposal in particular, littlefish have partnered up with gimbalabs, and this is why we see its name popping up everywhere within the proposal. They are part of the core working group and are as well tagged as stakeholders of the two modules, a sign that the work performed will have implications in other areas in the future.  \n\nOf course, each of the modules briefly touched upon in the previous section are presented in great detail, and we can immediately realize what kind of activities will be taking place, as well as complementing the description with an estimation of the hours involved. Going further into the details, for each module we know the relevant stakeholders, the primary working group, the estimated duration and necessary hours. And if this wasn’t already enough, the entire proposal is sprinkled with useful links (especially here) where you go very deep down the rabbit hole into, for instance, past payment sheets for existing members, external case studies relevant to what you are reading or simply a beautiful post-it board to see the broad picture of how a certain module is intended to work. Just as an example, Module 1 delivers the technical specifications (metadata research mostly), Module 2 the minting contract and Module 3 the frontend part. \n\nThis is also one of the very few projects that do take seriously the task of going through a risk assessment, and actually identifying, documenting, finding ways to mitigate and properly disclosing some of the risks that could affect the project. Again, just to offer a flavor of what is presented, the team discloses in great detail the financial risk stemming from the fact that a significant portion of the team is based in Turkey, currently experiencing hyperinflation, and the mitigating actions to lower the future impact of the situation. Another example of a risk is the difficulty of humans to adapt to new earning solutions. One way littlefish intends to mitigate it is through pilot communities, in other words, experiment frequently, rapidly and on a small scale. Excellent philosophy. \n\nThe budget is built on very solid principles, however it works a little differently compared to traditional projects. We start with the key information that the budget is built around the base hourly rate of 50 USD, deemed by the proposers sufficient to sustain a living wage in most places around the world, thus offering financial stability to full timers. Each module has its own separate budget, and there is also an extra caption for each module, similar to an overhead. A part of it is to be spent at the discretion of the module team while the rest is pooled to cover common good expenses (videoconferencing tools for example). On top of all this lies an action fund (25% of the total) acting as a buffer mechanism to ensure short term sustainability and allow for estimation errors or even to fund additional modules if deemed necessary. \n\nIn conclusion, it is a joyful experience going through this proposal and again, reinforcing the message from the previous section, littlefish passes the feasibility test with flying colors. ", "q1r": 5, "q2": "Littlefish is built around openness, so ensuring full auditability of its activities comes rather naturally. The team publishes major updates on Obsidian (an online knowledge base solution), while their Miro boards are open to the community. The team uses Discord for daily activities as well as to “shout” when actions are done, in a similar way as to how Deworks / Discord works for Catalyst Swarm and bounties. The team will also use google analytics to track the overall success of the DAO (number of visitors, average time spent, etc.).  \n\nLittlefish also offers very logical solutions for tracking the proposal’s indicators. Generally, the team will maintain open source repositories and share updates with the community on their communication channels. For this proposal, certain specific performance indicators are proposed. For the Action NFT, it will be possible to track how many actions have been minted. For measuring the success of the system built the team proposes to use the unique number of users and the unique addresses to mint the actions as the most relevant indicators. The most interesting, and challenging, thing to measure is the use cases for action (actions can embed certain things, remember?). Again, the team has a plan in place in order to collect data specific to actions undertaken and turn this information into knowledge through the use of categories, raw numbers and general use cases encountered. \n\nLittlefish is a beautiful experiment and it will be extremely easy for the Cardano community to follow its development. Of course, five stars as well for auditability.", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4821, "q0": "This proposal is interesting and offers a nice use case for Cardano. This proposal firs of all is giving a problematic that is clearly aligned with the challenge and also gives a plausible solution. This solution is really well-thought and clearly stated how it will add value to the Cardano ecosystem, this use-case will help to build a new global economy and Cardano and its community members will be part of it. Most of their goals are aligned with the challenge objectives, which are bringing an indirect impact to the Cardano ecosystem by creating a good use-case for NFTs but does not really help to drive more adoption in the ecosystem. The proposal can easily scale to address future challenges and has taken into consideration a few important challenges that could happen during the project. This project clearly articulates a plan for a new global economy which can be really positively impactful in our society.", "q0r": 5, "q1": "The feasibility is also really nicely done, the timetable is clear and complete in order to complete the project. The timetable articulates all the tasks that will be done and what different tools are they going to use to fulfill their project objectives, they have really well-thought their timetable and all the details are here. The budget is broken down clearly with again a lot of details and they have taken into consideration the risks that can occur during the project in their budget. The budget is reasonable according to the tasks they have to do. The team is complete and has all the details, each member has its specialties and have the experience and skills to complete the project.", "q1r": 5, "q2": "Concerning the auditability, this proposal has a clear success metrics that are aligned with the challenge needs. There are clear descriptions of the targeted problem that can easily be measured by different outcomes, it is really complete. There is also an explanation on how to check their progress so the community can easily be in touch of the work this team is doing. This proposal is really well-written, well done.", "q2r": 5, "assessor": "z_assessor_2618", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7528, "q0": "In decentralized work the information is not spread efficiently and the visibility of contributions is low is a problem to be solved and it is related to this challenge. The solution to this problem is that Action NFT was born to create a more complete platform, which effectively solves this challenge. The solution and issue outlined in this challenge is linked to the recommended setting. The author's project is scalable to address future challenges. it helps people know Cardano more.", "q0r": 5, "q1": "Therefore, the risk of preventing delivery is very low. The main development challenge mentioned in this proposal concerns off-chain infrastructure and timely implementation. Potential complications were planned and accounted for in our funding budget. Our development team can rely on a larger team of MLabs — more than 100 developers — should unexpected difficulties arise, although this is highly unlikely. Littlefish Foundation is an original idea about cryptocurrency. This is an attempt to redefine existing monetization relationships and replace it with a model that serves the people. Action is its focus.", "q1r": 5, "q2": "The team builds a complete foundation, a strong team of network collaborators create an organizational model that matches a radical organizational approach. Form workgroups and start production on all of them. The group consists of 7 members: Cem, ChaKhan, James Dunseith, Nori Nishigaya, Mert Akyazi, Sebastian Pereira, Donald Isufi - Sinh, Emre Kurt they are all longtime members with the industry. They have developed a community of over 100 people starting in December 2021, a core team of 10+ and growing, 20+ years of experience in software development, plutus developers, designers design, startup and startup experience, and active members of the Catalyst community. The budget applied for funding in this proposal is $98,667, which is broken down by the author into reasonable expenses for this project.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9921, "q0": "If one sees all the real transactions (exchange of goods and services) in the world but not financial transactions one asks how those people know how to allocate these resources. The answer is that they have some kind of information system(s) in place. The most common information system, the money system, is simple and captures many actions but doesn't apply to everything. This proposal's goal of creating NFT designs which enables capturing the provable information of any activity, sets up infrastructure for building kinds of applications seen never before. It provides market mechanisms and business logic to places where they have traditionally been missing.\n\nAn impactful new information system should have certain properties like universal applicability (can include any type of action) and dynamism (can be updated and revalued over time). The proposal describes many requirements and plans to make an NFT-design capable of including these properties. Stages 1 and 2 focus on applicability domain and stage 3 is about adding extra functionalities to make NFTs more versatile and integratable with other actions as well as other digital infrastructure and applications. \n\nFor future considerations:\nTo have an even stronger impact on reputation building, I would like to see discussion and tooling for connecting actions with identity. For example action NFTs coupled with identity linked action NFTs. Even if you have sold the representation of the action, the proof of you being the original actor remains as part of your track record and reputation. This enables different people to value you as the original actor however they want. They can even mint proofs of their actions showing their appreciation to you and your actions. \n\nSecondly, to achieve scalability at an individual level, how can one easily create an investment portfolio of actions according to the set of one's values? How could the structure of the action NFTs help at enabling automation of finding action investment opportunities (by digital twins)?\n\nLearning one's values from any kind of digital footprint directs toward those investments one truly values. It also incentivizes people to explicitly write down things they find important. These preferences of individuals, preferences of crowds would finally have a path out of people's minds into technology, products and services which shape our lives. For an individual investor, investing would not be anymore about predicting future outcomes but real problem solving according to their real values and preferences. This would impact the whole financial paradigm as we currently know it. \n\nConclusion:\nBeing able and appropriately incentivized for recording actions which have previously been out of scope, bring potentially a whole new world of applications to Cardano and the blockchain space in general. Building the infrastructure for a universal information system which captures the information from more or less any action is a catalyst for unforeseen impact potential on NFT space, reputation systems and artificial intelligence utility.  ", "q0r": 5, "q1": "The roadmap (already under execution) has many different kinds of elements when it studies and adds NFT functionalities to capture the dimensions of real world information. There are some research activities, such as designing the NFT structure, which leaves small spots of uncertainty. There is also a fair amount of straightforward technical implementation work. All things considered, the plan is coherence and consistent. Six month project timeline sounds quite ambitious but the Action NFT development is going to continue beyond this project in any case. \n\nThe budget follows the principles which are common to all LFF proposals. Estimated working hours are detailed with precision. The Action Fund provides financial safety margins for all LFF endeavors. The Action Fund secures primarily the continuous operations so that the Action economy model gets started smoothly. \n\nInformation about the team members committed to work on this proposal is available comprehensively. Implementation of this project successfully requires strong understanding of NFT technicalities and how they may be evolved in the future. Although there may be unforeseen challenges, I believe that LFF is in a good position to turn this proposal into reality. ", "q1r": 5, "q2": "All the work in LFF is open and fully transparent. Open GitHub repositories, Obsidian and Discord enable following the development work and ask questions as well as see the Actions produced. The different aspects of growth and their KPIs are separately reviewed in the proposal. The team provides a monthly update about the metrics which indicate the community growth. The roadmap consists of several clear deliverables which progress is observable from open sources. The team will provide updates on key milestones. Sure, there could be even more accurate measurement of the continuous technological implementation with regular short developer updates.\n\nBecause the Actions are to be NFTs, the number of minted Actions is the core metric to be measured. The proposal also describes things about measuring how Actions are used in the markets and real world. Over time, many types of value estimates of the Action economy might shed light on the value created by the infrastructure enabling that economy.", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10329, "q0": "The proposal \"LFF - Shaping Action\" was put forward by the LFF (Littlefish Foundation) team, a decentralized global organization. The team submitted this proposal to address outstanding issues in the industry. That decentralization it difficult to promote to the community, difficult to coordinate, comments are low visibility, information spreads ineffectively, and actions are not consistent with common goals. a very cool, very original idea that helps to solve the problems facing all digital communities. This proposal aligns with our challenge in Fund 9.\nThe solution for the above proposal is to build a freelance money-making model based on relationships, jobs, and organizations through Blockchain technology while ensuring common goals.\nThis model is Littlefish Vault, where there will be many links with full information for users. In easier words, We will find it easier to find the specifics for each recommendation instead of displaying them on Ideascale, which will be centralized in Littlefish Vault. You can explore the Littlefish Vault and the LFF's F9 recommendations here: https://publish.obsidian.md/littlefish-foundation/B.+Project+Catalyst/Fund+9/Fund+9 + Start + Here\nWith the Littlefish Foundation, the original idea was that cryptocurrency would allow them to redefine existing monetization relationships and build a model of community service. In my opinion, the highlight of this solution is to allow new business models, and partners to link together and build on this decentralized platform. In it, the first participants of the reorganizations will be the first Actions users, along with the LFF who are also the first colonists. See more here: https://publish.obsidian.md/littlefish-foundation/A.+Whitepaper/C.+Organization/The+First+Colony\nI think this model is scalable and flexible, helping to enrich the Cardano ecosystem that no other model can do today. This proposal has very practical implications.\nThe product is an action NFT decentralized platform that is the building block of the Littlefish Foundation. These products record activities through video, images, audio recordings, tweets, and Instagram and publish them as NFTs. These records are stored permanently and hierarchically. See the action's attributes here: https://publish.obsidian.md/littlefish-foundation/A.+Whitepaper/D.+Technology%26Phiosystemhy/The+Attributes+of+Action\nThe proposal is suitable for crypto organizations, digital communities, creators, community builders, investors, collectors, and the entire Catalyst community.\n\nThe product is an action NFT decentralized platform that is the building block of the Littlefish Foundation. These products record activities via video, images, audio recordings, tweets, and Instagram and publish them as NFTs. These records are stored permanently and hierarchically. See the action's attributes here: https://publish.obsidian.md/littlefish-foundation/A.+Whitepaper/D.+Technology%26Phiosystemhy/The+Attributes+of+Action\n\nThe proposal's biggest risk is financial. Much of the current team is based in Turkey, which has experienced hyperinflation over the past year.\nThis is a global fundraising project, if there is no funding, they will still build LFF, the problem is that the time will be harder and slower.\nThis proposal is very unique. I Strongly Agree", "q0r": 5, "q1": "With a specific plan, time, and step-by-step roadmap, the Proponent submits this proposal to apply for funding for 6 months to develop the action.\nWhere phase 1 and phase 2 will implement complete versions. Phase 3 develops more features and is also the most important stage, giving participants and participating communities the opportunity to earn income from buying and selling activities in this model.\nCheck out the action technique here: https://publish.obsidian.md/littlefish-foundation/D.+Colonies/The+Forge/Action+Technical+Specification \"\n\nThe required budget is $98,667\nDivided into 5 Modules with a total amount of $74,000, the Action Fund is $24,667. Of which, the action fund accounts for one-third of the total budget.\nAll LFF proposals follow the same budget structure. These are made up of module budgets and Action Fund allocations.\nThe Module Budget is divided into 2 parts: The budget for personnel and the budget for maintaining the module operation\nThe Action Fund is divided into two parts: the reserve fund and the action incentive fund\nSee the budget explanation for LFF operating funds here: https://publish.obsidian.md/littlefish-foundation/B.+Project+Catalyst/Fund+9/F9+Proposal+Budget\nThis requested budget is reasonable to implement this proposal. \"\"\"\"\n\nTeam - Littlefish Foundation is a decentralized project made up of a growing core team and a community of over 100 individuals. Typical members of this project such as Cem, ChaKhan, James Dunseith, Nori Nishigaya, Mert Akyazi, Sebastian Pereira, Donald Isufi, and Emre Kurt... are people with many years of experience in software development, having many years of experience in software development. Technical expertise in the fields, of system administration, Plutus development, and experience in the fields of business, start-up, and building organizations.\nOn the other hand, this group of personnel is all assigned responsibility for each module of expertise. Personal information is easy to look up.\nWith this team, I have full confidence that they are qualified to be able to successfully implement the proposal.", "q1r": 5, "q2": "Metrics At Littlefish Foundation, all activities are open and transparent.\n+ Publish Obsidian progress updates that share the organization's learning with the wider community.\n+ Organization actions are updated daily on Disco\n+ Track your success on Obsidian using Google Analytics.\nThe proposal would be more transparent if it provided Chung Me with the links to track progress and metrics as mentioned above.\"\n\nThe success of the proposal is all about creating applications that are loved by the community, building a strong community of creators and builders, colonies used by other decentralized communities, and The actions are increasingly expanded to increase the flexibility of the system.\nCurrently, the proposal has been achieved such as: building Ikigai models that create an enjoyable learning experience for everyone involved, the goal is to build similar software into useful applications. Other experiments are also in the works such as Tracking rewards' finances, Actions published on the #action Discord channel, Littlefish Adventures\nIn addition, the number of members also increased by more than 100 people, and the number of collaborators also increased from F8 to now from 2 people to 8 people.\nFrom the facts that show, the Organization is creating a completely new playground, relying on Blockchain technology to link and integrate resources, creating a healthy development community, where they can give money-making opportunities, share common orientations, and clear information, and overcome outstanding problems in the decentralized community. It is a unique, useful playground for participants, enriching the construction and development of the Catalyst community.\nI Strongly Agree!", "q2r": 5, "assessor": "z_assessor_3181", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "A complete platform that enables decentralized communities, starting with specifying, testing, and implementing the basic building block of decentralized work: the Action NFT.", "experience": "A community of 100+ total started in Dec 2021, a core team of 10+ and growing, 20+ years of experience in software development, plutus developers, designers, entrepreneurship and startup experience, and active Catalyst community members."}