{"id": 414953, "author": "nxr", "title": "Daedalus Turbo - 10x Quicker Sync", "url": "https://cardano.ideascale.com/a/dtd/414953-48088", "category": 26595, "amount": 759000, "description": "Daedalus, the decentralized Cardano wallet, is painfully slow, taking a whole day to sync initially and hours to resync when used only occasionally - an unfavorable impression of Cardano for new users", "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 7529, "q0": "The proposal refers to installing wallets in a decentralized way to store their information. Daedalus, a decentralized Cardano wallet, is very slow, taking days to sync initially and hours to re-synchronise, giving Cardano a bad look for newcomers. The solution to the problem is a new download algorithm that makes better use of network bandwidth, a new faster algorithm for rebuilding wallet history it integrates into Daedalus and Cardano Node.", "q0r": 5, "q1": "The proponent also stated that the main risks affecting this proposal are: finding an algorithm capable of completely saturating the customer's network while transferring blockchain data, Finding an algorithm to regenerate the schedule use wallets more efficiently or make better use of the multi-core CPUs of modern laptops and computers, ensuring seamless integration of the algorithms found into the Daedalus and Cardano Node projects. These are the risks that may affect the development of this proposal. The proposal has set detailed, clear and reasonable timelines for doing work with specific goals. They outlined four key timelines for taking on this challenge: phase 1 from January to 4 months, phase 2 from May to 8 months, phase 3 from September to 12 months, and the final phase. from 13 to 24 months. The author also clearly states the things that need to be done in each month of implementation.", "q1r": 5, "q2": "This recommendation makes Daedalus synchronization and re-synchronization times at least 10 times faster. This proposal is intended to significantly improve the user experience for first-time Cardano users who have the experience of setting up a decentralized wallet and occasionally checking balances across transaction executions. The author has nearly 20 years of experience building high-performance distributed computing systems backed by extensive experience with Cardano and Catalyst: one Fund 7 funded proponent, one Plutus Pioneer, and one Atala PRISM Pioneer. The grant application budget of this proposal is $759,000 of a detailed apportioned budget, detailed by the author to do the work to be done, the budget is subdivided and appropriate to meet the objectives. target has been set.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7999, "q0": "Daedalus Wallet is one of the most popular Dapps in the Cardano ecosystem, but this one very slow. It takes a whole day to sync initial and hours to sync again if only used occasionally. This popular product leaves a very unfavorable impression for Cardano and new users. The intent is to make Daedalus much faster. ( x 10 ) The project can have a positive impact on the Cardano ecosystem. Due to the better functioning of the wallet, more people will be attracted to create their Cardano wallet on this Dapp. The submitter first described the problems in detail in the proposed solution. The proposed problems are divided into several parts. (the improvement plan, available hardware resources, technical/algorithmic details) It is very good that several experiments are included in the proposal. These are done to do deeper research into alternative solutions. (fast transfer of blockchain history, reconstruction of wallet history with synchronized blockchain data and extracting Bet Keys from wallet payment addresses)\nSome future challenges are included in the proposal. (finding the algorithm, seamless integration of the algorithm) The submitter has already foreseen a possible solution for these problems.", "q0r": 5, "q1": "The proposal's author has 20 years of experience building high-performance distributed computing systems. The submitter has already been funded in Fund 7. Only the submitter has included his Linkedin in which his relevant experience and skills are described. The submitter indicates that the team members will be determined when this product will be funded. It might be useful to already include some well-known names in the proposal who will cooperate. A breakdown of the budget is included. The submitter has chosen to present primary cost drivers as these will provide the most accurate calculation. The budget is clearly defined and divided into recognizable items. (Research and development, taxes, financial costs and fees,...) The budget seems sufficient to me to achieve the given objectives. No additional funding will be requested. The proposers want to deliver the promised impact with this large budget. (10x faster synchronization) A realistic time frame has been specified to complete the work. (24 months) Clear milestones have also been specified. This timetable includes a clear implementation plan stating what and how everything will be done. The plan sets out the resources needed to implement the proposal. The submitter has clearly presented the technical aspects that are crucial for the implementation. The submitter has extensively discussed the risks of the project. The submitter has always provided a possible solution. (finding algorithm, seamless integration of the algorithm)", "q1r": 5, "q2": "A very comprehensive roadmap is included in the proposal that includes milestones. The project will last 24 months. The project will deliver something approximately every 4 months. The milestones chosen within a chosen time frame are certainly achievable to execute. The submitter has chosen to let the project last 2 years. By taking enough time to deliver parts, the project will have a good chance of success. The KPIs that have been chosen all have to do with reducing the synchronization time of the Daedalus and the main factors that influence it. ( sync time, client network during active sync, client CPU usage during active sync, Daedalus boot time) It's good that periodic progress and KPI updates are published to the project's website and the project's github repository. Monthly progress reports will be provided to the Catalyst team. There is a clear description of the problem that Daedalus (Decentralized Cardano Wallet) is very slow. This gives an unfavorable impression of Cardano for new users. By ensuring that the synchronization period is 10 times faster, this will ensure that Daedalus gives a favorable impression for new users of cardano.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9723, "q0": "When a new user enters the market, processing speed is an issue that many people care about. Daedalus is very slow, taking a whole day to sync initially and hours to re-sync when it becomes usable. The problem is how to significantly reduce processing time, helping users save time, effort, and even money.\nDaedalus Turbo was born to solve this big problem, end-to-end algorithm utilizes better and faster network bandwidth to rebuild wallet history, application downtime, Daedalus and Cardano Node integration. Simultaneous optimization up to 10x. According to the author, in building and optimizing a distributed computing system, the logical goal of software optimization is to make the software work enough, not to let the hardware be a bottleneck. Usually, those hardware bottlenecks are network bandwidth, CPU usage, or storage system bandwidth. The author calculates the speed of the Network, CPU, and Memory in detail. After the calculation, conduct a quick technical test to verify. The author outlines the improvement plan, details the algorithm, and the content of 3 experiments: Fast forward Blockchain history; Rebuild wallet history with synchronized blockchain data and Extract stake key from the wallet billing address. All payment addresses from the same wallet are extracted using the same shared key, which can be used to create a quick search to find blocks containing transactions related to a given wallet.\nThe proposal aims to significantly improve the user experience in the Cardano ecosystem and those who are new to Cardano. Therefore, the proposal will contribute to increasing the number of users, and also the user experience, interacting with the ecosystem. Also, to export the historical sync block chain. Furthermore, the output suggests the best way to use algorithmic compression that can unlock how to create a decentralized mobile wallet.\nThe project has foreseen the risks and also proposed solutions, in my opinion, the team needs to monitor continuously and closely, especially when facing risk problems. Only then can we handle those risks. Get projects done faster.", "q0r": 5, "q1": "The proposal gave a specific, clear and reasonable timeline. The author has given a plan every 4 months for the first year and a plan for the 2nd year.\nThe proposed amount is consistent with the justification, justification, and clearly presented expenditures. The asking price is 759,000 USD, about 9.7% of the total challenge, this is a number that is suitable for the size and development of the project.\nThe author has nearly 20 years of experience in computer technology, in addition to extensive experience in the Cardano and Catalyst ecosystems: One Funded Proposal in Fund 7, one Plutus Pioneer and one Atala PRISM Pioneer. Thus, the author has a lot of experience, and good experience to be able to complete the project. By the time the results of Fund 9 are available, the work of the project in Fund 7 has also been completed, so this project will also remain focused. Author information is also very easy to find on linkedin.", "q1r": 5, "q2": "The project provides quantitative KPIs for measurement only: Time synchronization, Network computer usage during active synchronization… Metrics that measure the integration process, verify the same results of the work. One of the most important numbers to measure user adoption is the number of downloads. The author also provides a due date KPI update that will be published on the project's website and on the project's github repository, so it's easy to check.\nThe success of the project is determined through 3 clear, specific phases.", "q2r": 5, "assessor": "z_assessor_3087", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10330, "q0": "A very unique idea for the proposal \"Daedalus Turbo - 10x Quicker Sync\".The problem of the proposal for the current state of the Decentralized Cardano wallet - Daedalus is very slow, users spend days or days. hours to sync when in use, which makes a bad first impression of Cardano for new users.\n(To my knowledge Daedalus is a wallet platform dedicated to Cardano coins created and directly supported by the Cardano project development team. Daedalus Wallet is an open-source wallet running on the Cardano protocol. Cardano and participate directly in the Cardano network, allowing users to manage ADA balances easily, conveniently, and securely)\nThis centralized proposal offers a method to solve the above problem which is to build a new download algorithm that makes better use of network bandwidth, a new faster algorithm for rebuilding wallet history, and applications. temporary use and integration into Daedalus and Cardano Node.\n\"This recommendation is intended to improve for new users from the first time using Cardano. Like setting up a decentralized wallet, checking balances, and making transactions.\nBy the specific experiments mentioned above, the desired results were achieved: Improve the synchronization and re-synchronization time of Daedalus by at least 10 times for users with modern laptops, and the results good internet connection. The results after improvement are as follows:\n+ Before improvement: Synchronization time from 12 hours to 24 hours\n+ After improvement: Sync time left 30min to 60min\n+ Previous improved sync time after a month of inactivity from 1 hour to 2 hours\n+ After improvement: reduce to 5 minutes to 10 minutes\nIt also improves the overall network stability of the Cardano ecosystem by providing Stake Pool operators\nFinally, research on the best way to use compression algorithms can open the way to creating decentralized mobile wallets.\n\nI think this solution is very helpful for our Cardano community. With Decentralized Cardano wallet improvement solution - Daedalus Turbo - 10x Quicker Sync. This proposal perfectly fits the Dapps, Products & Integrations challenge. It contributes to bringing improved products to better serve, helping users interact better with the Cardano ecosystem.\n\nThe proposal gives many reasons for obstacles, but all risks have specific solutions. Risks such as\n+ Find an algorithm capable of completely saturating the client's network while transferring blockchain data\n+ Find an algorithm to reproduce wallet history more efficiently or make better use of the multi-core CPUs of modern laptops and computers\n+ Ensures seamless integration of algorithms found into Daedalus and Cardano Node projects\nI completely agree with this proposal.", "q0r": 5, "q1": "There is a specific detailed plan, to be implemented within 2 years. With implementation timelines such as Months 1-4, Months 5-8, Months 9-12, Months 13-24. The plan It is a complete plan to implement this proposal. Project progress can be easily tracked, as each milestone can be measured against KPIs. proposed plan.\n\nThe estimated budget of $500,000 represents more than 15% of the total Challenge budget. It is proposed to analyze fair use estimates for costs such as:\nR&D (Research and Development) cost: 40%, Test budget: 10%, Tax 40%, Finance cost 10%. No proposals for funding outside of Catalyst were found. This is a large amount of funding to complete the large amount of work for this proposal, especially given the high technical requirements and investment in research, testing, and platform development, most of the budget for The book will be spent on finding optimal algorithms and software integration points. However, if the proposal is successful, the improvements the proposal contribute to users' convenience, and fast and efficient use of the wallet platform of our Cardano ecosystem.\n\nAuthor Alex Sierkov is a person with more than 20 years of experience building high-performance distributed computing systems. He currently runs a store digitization agency located in Berlin, Germany.\nHe also currently holds several running contracts with freelance professionals (designers, front-end and back-end developers, QA specialists, data scientists, and system administrators). system..)\nSpecific experts will be added later, the Author is still the main person responsible for such aspects as the research and development of algorithms, and delivery of results (project management).\nDuring the implementation of this proposal, at Fund7, the funded proposal has been implemented for more than 6 months, the proposal ensures that when the results are available, Fund 9 has completed the project, so it will not affect the project's results. this.\nAuthor information can be found here: https://www.linkedin.com/in/alexsierkov/", "q1r": 5, "q2": "Measurements are detailed in detail. There is a small point I would like to suggest to see the transparency of the proposal is the link to see or proof of the results achieved. For example, a Table compares time improvement results achieved in terms of sync time in MBytes/sec Link to see downloads?\nMore details can be found here: https://github.com/Emurgo/cardano-serialization-lib\nI support this proposal.\n\nThe success of the project is assessed through the following 3 stages for applications and utilities to be integrated to ensure, fast and convenience for users.\nHere is a new proposal for this Challenge. It is known that At Fund 7 with the proposal received funding from \"Fast funding with ML Voting Agents written by highly regarded, reputable Mr. Alex Sierkov from the Catalyst community. See information here: https://cardano.ideascale.com/c/idea/383355", "q2r": 5, "assessor": "z_assessor_3181", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11500, "q0": "Impact of proposed solution to main Cardano entry point dApp is enormous, as first impression of Daedalus sync speed can cast a long shadow on perception of Cardano speed in general by public. Also, for users occasionally using Deadalus, speeding up sync process is much needed to become usable and preferred solution over others. As wallet becomes usable for more users, it will improve decentralization of ecosystem when users prefer this solution instead of centralized light wallets. Speeding up this process 10 times is massive improvement. Scalability and future sustainability of this project is unset as this is one time solution. With proposal fully aligned with challenge settings and KPIs and provided big impact of successful delivery I rate this 5 of 5.", "q0r": 5, "q1": "Proposal creator provides thorough analysis of speed bottlenecks of current Daedalus implementation, with test results. For every bottleneck a credible solution implementation is described. I like proposal idea to use BitTorrent-like protocols as it is most battle-proofed peer-to-peer app and lot of inspiration can be learned there. As software developer I see that proposal author knows what he is doing by detailed analysis provided and proposal also provides LinkedIn reference to further check his skills, for other roles freelance experts from authors running contract will be properly selected (some reference to contract would improve proposal). Budget is clearly defined for roles needed for 2 years of development with justified timetable of deliverable parts, with 50% of budget allocated to taxes and fees for fluctuation from previous experience, this part could be more described, as F7 was after Cardano peak this logic not aligned with current bear market. Risks are considered with expertise, with consideration of mitigation for slow merge speed for big changes to Daedalus and Cardano Node and proper algorithm selection and implementation. Right programming language selection (C++, C) for speed optimization and technologies selection (Electron, Node.JS) for current tech stack extension and code reuse is described. I see that this proposal is well prepared, and I don’t see any shortcomings except big tax rate in feasibility section, therefore full rating.", "q1r": 5, "q2": "For auditing of process by community for every milestone a public channel (GitHub issues and pull requests) or command line tools and apps are specified, this will make project’s process audit very simple. For final delivery measurement of KPIs will be provided via GitHub. Full enumeration of KPIs/Metrics is extensive with focus on speed metrics (sync time, CPU utilization, startup time), integration process (GitHub pull requests), adaptation (usage of Deadalus Turbo app). KPIs for successful delivery of project are well established and can be tracked, also every Daedalus user will note speed change when project is delivered and merged to current implementation. Overall, this proposal provides effective solution to improve usage of main Cardano dApp, which improves adoption, quality and decentralization of ecosystem and every part of project is completely auditable.", "q2r": 5, "assessor": "z_assessor_3255", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14416, "q0": "\"The proposal is basically about developing an optimized algorithm for the Daedalus wallet using a technique involving a peer-to-peer download network like BitTorrent. As the proponent mentioned, the reason for the necessity of developing this algorithm is the bottleneck of 3 things: network, CPU, and storage. To me, this is a pretty technical proposal. But the proponent did a great job of presenting it in an organized and clear manner along with 2 real experiments to make it easier for the reader to understand. In the last part, the proponent also gave a summary, and it really helps the reader to grasp the main idea more easily. \nWith the aim of optimizing the Daedalus wallet to incentive new users, the proposal is suitable for the Cardano Dapps challenge. The time-consuming issue of using the Daedalus wallet that the proponent pointed out showed the potential of this proposal to enhance the user experience. \nThe risks were clearly explained and the proponent also provided some insights and solutions to these risks. From what has been said about the risk, I can understand that finding a new more efficient algorithm for multi-core CPU usage is a risk that should be of primary concern. And the proponents did a great job of presenting pretty good technical information like this.\nOverall, the proposal align with the challenge, and the proponent provided clear and sufficient information in this part.\"", "q0r": 5, "q1": "\"The project roadmap provides clear timelines and provides the tasks to be performed for each phase. From what I can understand, the tasks in each phase are linked together (do these things together), so I think the proponents could do a little better by giving the title for each stage. For example, in phase 3 (Month 9-12), the main task of this phase is an investigation to provide evidence for the algorithm, so proponents can come up with headlines like \"\"investigate to prove the implementation of the algorithm.\"\" But this is my additional advice, and proponent make good plans, so it's okay if it's not there. The technical notes will be useful to some technical readers who want more details. And I like the way the proponent clearly states the progress of the previous project (it will be completed before the start of this new project) to show that the proponent will be in good condition to do the proposed idea. \nThe budgets provide detailed information on what activities to use and clear amounts in each category. But I think to be better, the proponents can put a specific number for the money next to the percentage. However, the proponent still did a good job of providing clear information. For example, in the test budget, the proponents mentioned clearly that it will need 1000 sever to verify the final code, and it cost $1000 per hour.\nIn the description of the personal information, the proponent fully mentioned his background and experience with the Cardano ecosystem and put his LinkedIn at the bottom for those who need more information or need to contact him. I think with the information provided like 20 years of experience in the computer field, pioneer of Plutus and Atala, he and his team are perfectly qualified for this project.\nOverall, the proponents did well in this part.\"", "q1r": 5, "q2": "\"All metrics provided by the proponent to track project progress are well organized and clear. It has 3 main metric categories: sync time, Github-related numbers, and downloaded users. Each category has an explanation of why these numbers were chosen, and all numbers are given specific details on the conditions for obtaining these numbers. I think he did a good job on this part. \nThe proponent describes the success of the project in 3 phases. From my understanding, I can reduce 3 phases to 3 steps: research, development, and release. I think this all description clearly shows the milestones that the project needs to reach its final destination. \nIn short, the proponent did a good job in providing metrics and sketching a picture of the project's success.\"", "q2r": 5, "assessor": "z_assessor_4045", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14620, "q0": "The project was created to minimize the time-consuming synchronization. This is an algorithm that makes better use of network bandwidth, rebuilds wallet history, and synchronizes applications. Proposer described the problem in great detail today's problems faced by Daedalus and Cardano Node with a hypothetical network, CPU, and storage study, the data is based on real research leading to a specific conclusion.\nIn the improvement plan, the proposer has designed a very detailed technical plan, which proves the seriousness of the proposer for the project is very high. The technical details are presented step by step sequentially. First, the proposer provides self-measured metrics from practice, then conducts error analysis and finds mistakes. Second, the proposer seeks to fix the bug based on the knowledge base and proceeds to develop a fixed plan. Third, build an algorithm that allows to improve the current situation, and test many times to find the most optimal version. And finally, presents the 3 most successful and safest test results in a very clear manner. This presentation helps someone with even a basic level of programming understand how this algorithm works and positively affects the Cardano ecosystem.\nThe key metrics of the project are perfectly reasonable. This proposal directly supports the KPIs of the Dapps, Products, and Integrations challenge. All of the content in the solution description and the proposed resolution of the risk is so perfectly planned and presented that I cannot find a single point of inconsistency, and I do not add anything further in my personal opinion.", "q0r": 5, "q1": "The proposer has provided a 24-month plan with contents on problem research, programming, and system optimization. The categories are arranged in chronological order of what to do first, and what to do later. And the jobs that are done first provide the development foundation for the jobs that are deployed later.\nThe financial allocation plan is divided into 3 parts: 40% for research & development; 50% for taxes, financial expenses & fees, and other expenses such as fluctuating exchange rates in the market. I found the proposer to be very serious about this project, by having a very detailed budget allocation plan. The proposer clearly describes how much money each job needs to be spent, for how long, and even includes taxes and currency slippage rates, the payout rate in the proposal. This is a problem that is often overlooked in other projects.\nThrough the information that the team has provided in the above proposal, I believe that this is a solid team of professional and technical personnel, especially in the fields of programming, technology, and finance. The personnel information is also described very fully with expertise. No ideas are duplicated throughout the proposal.", "q1r": 5, "q2": "The team's project measurement method description is very consistent with the technical information provided above. Expected numbers are stated to the nearest decimal place. At the same time, the proposer project results in 3 phases and has specific KPIs for each stage. Emphasize that the ultimate success of the project is “Turbo Sync is enabled by default in Daedalus and Cardano Node”.\nThrough what is presented in the proposal, I realize that this is a project built on a solid technical foundation, implemented by experienced experts, with a clear roadmap and a reasonable budget plan. To sum up, I couldn't find any problems that didn't make sense in this project.", "q2r": 5, "assessor": "z_assessor_4076", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A new download algorithm better utilizing network bandwidth, a quicker algorithm for wallet-history reconstruction, temporary sync apps, and an integration into Daedalus and Cardano Node.", "experience": "Almost 20 years of experience building high-performance distributed-computing systems supported by broad experiences with Cardano and Catalyst: a funded proposer in Fund 7, a Plutus Pioneer, and an Atala PRISM Pioneer."}