{"id": 415174, "author": "shad7867", "title": "ZeroPool Screener", "url": "https://cardano.ideascale.com/a/dtd/415174-48088", "category": 26595, "amount": 340, "description": "Many zero or low funded pools have little visibility, thus little chance of growing.", "f6_no_assessments": 8, "f6_rating": 1.8749999999999998, "videos": [], "media": [], "f6_assessments": [{"id": 1286, "q0": "The aim of the proposal is to develop an app that will scan through stake pools and every week will display 5-10 stake pools with a very low saturation. This is a great idea, to provide display to those who are not really able to saturate their pools, because it will improve decentralization of the whole blockchain. The question that the proposer will have to tackle is – what will be the threshold? 1% saturation, o 2%? What will actually mean low? And if it will be visible, will it actually cause a shift in these pools? To be honest, even tough the idea is great, I am not really sure that the visibility is the issue, that is causing low saturation, rather than other pools are having a better marketing/provide interesting rewards, so even if this MobileApp will be accessible, will it make difference? Overall the idea is good, but this information is already available on another sites and it is still not making any difference, thus a thesis for this assumption (or some supporting information) would be nice to see. ", "q0r": 3, "q1": "The budget requested is 340 USD, and the roadmap is set to Q2 to Q3 with two big tasks to be done during each quartile. First is regarding to DB Sync and queries offline, and the second quartile is focused on DB Integration to the Mobile app – it makes me wonder, whether this Mobile App development is already done, or it is included within some of these tasks? It is not really clear. Also the budget, even as low as it appears, I am not really sure if it is enough to cover 6 months of work, thus 1. More information should have been provided OR 2. Something is not right. Regarding the team – there is one person – the proposer who will be performing the Job /as it appears. There is a short bio provided but no linked in nor a proof of previous work to support his experience. ", "q1r": 3, "q2": "Regarding auditability, the proposer lists both milestones as items that will track the progress, but it is unclear whether it will be open-sourced, or where these information will be accessible. The proposer considers deploying app and gaining experience in the process and positive community engagement is the success metric, but it does not really corresponds to the goal (solution) of the proposal, which is to display low saturated pools – and I believe – to increase the saturation. So to measure the success, I think it would be nice to measure how was the saturation of pools that were display changed. Also, to track the progress, if the code will not be open sourced, then we will need to weekly/bi-weekly or monthly reports to track the progress, preferably on public channels such as telegram, discord or twitter. ", "q2r": 2, "assessor": "z_assessor_2222", "no_vca": 13, "ne": 3, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 1773, "q0": "The title of this proposal is appealing, and the intent to give visibility to pool with low stakes seems honorable. Unfortunately, this objectif is poorly aligned with the chalenge setting (or the proposal does not show how it aligns, and how impactful it is).\nThe description of the solution does not make a lot of sense : \"Use DB-Sync as back end with queries and benchmarks in code to filter out well-run pools and highlight approx. 5 to 10 each week (rolling) to ensure they get the visibility.\"", "q0r": 1, "q1": "The author of the proposal claims project development experience, and being a stake pool operator (pool name is not cited). Having coded as a hobby does not seem enough to give confidence in the proposal reaching his goal. The development plan is very weak, with two generic and macroscopic milestones not included in a timeline. Even if it is a very low budget proposal, no elements suggest that it is likely to be implemented.", "q1r": 1, "q2": "As explained in feasibility section, the proposal lacks essential details and the community would not be able to monitor a development that has not really been described in the proposal. Adding to that the fact that no schedule has been provided.", "q2r": 1, "assessor": "z_assessor_2264", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2625, "q0": "The proposal does not clearly state the problem to be solved, it is necessary to clarify more specific information such as: State the problem being faced, the common problems of the community or the problem that will be a difficulty in solving the problem. implement solutions on Cardano or related applications\nIn addition, it must be stated that: Does the proposal add value to Cardano, future scalability. A clear and sustainable plan has not been laid out yet", "q0r": 1, "q1": "The proposal does not state-specific information on the ability to perform, the documents, and links attached\nThe actual number of participants, as well as the careful allocation of the budget\nRoadmap and milestones to be achieved also need to be listed in more detail\nThe technical and risk aspects are covered very lightly", "q1r": 1, "q2": "There is not enough information on the evaluation of project progress after being funded in a reasonable and periodic way, at least including Roadmap and milestones, KPIs to determine success, Clear solution, and access information channel to update project progress", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 2990, "q0": "With over +3000 pools it shows that decentralization is a key cornerstone of the Cardano network. However, small well-run pools have seen a decline with some even closing due to not being able to mint blocks. Having an app that shows low-funded pools to new Cardano users is a great way to maintain our decentralization. Spreading the building over two quoters makes this a reasonable timeframe. If funded my suggestion would be to make the UX more visual as this has shown to have a strong effect on educating people who are experiencing new tech. Adding filters that help new stakers find pools that fit their personal preferences.  \n", "q0r": 4, "q1": "The challenges of having created and ran a staking pool add an extra layer of experience needed to understand the difficulties small pools face. Being a Plutus Pioneer Cohort 3 Alum. offers the technical know-how to successfully implement the project. The concern I have with the proposal is it has no Github or Twitter link than can support his ability to execute the project. The budget breakdown shows it would take $360 to complete but he's asking for $340, this doesn't tally with the requested amount. ", "q1r": 3, "q2": "The project has been cast to be a small one that can be done by a single person probably with a little guidance from the community. However, it fails to show clear and detailed steps it will take to build the DB Sync instances and launch the mobile app. That said, the launching of the app is a key KPI that has been chosen that can be used by the community to measure its success. Despite the unclear explanation of the steps. ", "q2r": 4, "assessor": "z_assessor_2381", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 5975, "q0": "The idea of this proposal looks to have benefits for Cardano users as it highlights zero or low funded pools info through a mobile app. I agree that the proposed solution has positive impact on the Cardano community in case the project is delivery successfully and the mobile app is marketed well to be used among Cardano users. \nIt is mentioned that the solutions front end is an App, intention being freely available on app store. however, it is not mentioned which app store it will be used whether it is Apple store or others. It would be good to know if this app will be IOS or android base.  ", "q0r": 4, "q1": "The plan is not detailed enough in my opinion, only quarter-based milestones are mentioned here which little high level. I wish the proposal would indicate more details about the mandate required for the queries development and required database integration. \nRegarding the budget, the proposal only mentioned hardware needs in the budgetary estimates which is in this case two servers to host the Database sync job and the front-end web host. No other details are provided. The budget breakdown doesn't sound very clear as other development efforts are not declared.", "q1r": 2, "q2": "The author does not include direct KPIs that would serve to monitor the project success. The milestones mentioned are somehow high level and it is not clear how the project delivery can be tracked, and success factors can be measured. Even though, it looks like a small project based on the budget required but the key auditability items are missing.", "q2r": 2, "assessor": "z_assessor_2765", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 12493, "q0": "\nThe proposal seems to have raised a problem but this is so vague, that I question whether the solution will really impact the community. Proposal writers should focus on clarifying their proposal's resolution while providing links to their ideas more persuasively.", "q0r": 1, "q1": "The writer of the proposal didn't really give a detailed plan, I can see they wanted to divide it into two phases but it didn't include a timeline or details of the tasks to be completed. The proposal also did not plan for the budget they requested. I am concerned about the performance of the proposal. In addition, the proponent has not provided any real experience relevant to the proposal and is just a preference.", "q1r": 1, "q2": "The proposal did not provide a detailed roadmap with timelines for everyone involved to monitor and evaluate, in addition, the proposal did not set indicators or KPIs to evaluate the progress. project success. This does not represent the transparency of the proposal and makes it impossible to track the progress of the project. Proposal writers need to focus and complete the entire body of the proposal.", "q2r": 1, "assessor": "z_assessor_3425", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12516, "q0": "I find this proposal to be very flawed. First, the proposal does not present the problem to be solved. The solution is also sketchy and unclear. It has not been shown how this proposal adds value to Cardano. Finally, because the problem and the solution are unknown, it is not possible to determine whether this proposal can be scaled up. I think the proposer needs to re-research and give full information. Rating: 1 point.", "q0r": 1, "q1": "The proposal doesn't provide a specific timeline, it's all very general. There are no obvious activities. Next is the budget allocation, without the allocation of specific items how much costs should be used. For those who carry out the project, there is no specific information or proof of the experience or knowledge that the person has. Main risk is also only mentioned in general and has no mitigation plan. In short, I don't see any feasibility in this proposal. Rating: 1 point", "q1r": 1, "q2": "Since there is no specific timeline, of course, the milestones or KPIs of this proposal are not clear. There is no way for the community or even the implementers to track the progress of the proposal. There is no disclosure of expenditures over time. The picture of success is also very general, not clear. Rating: 1 point", "q2r": 1, "assessor": "z_assessor_3426", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 14417, "q0": "As far as I can understand, the idea of the proposal is basically using the DB-Sync service to create a sponsored group filter to ensure it will meet all criteria. In my opinion, this idea is not consistent with the goals of the challenge. At least this expression does not make me see that it has nothing to do with Dapp's challenges. I think to do better this part of the proposal should give more information such as clearly explaining why it is necessary to create filters from this service? What is the benefit it brings to Cardano? Similarly, in the following two parts, presenting solutions and risks need to be more detailed. For example, the time limit will be cleverly implementing the project for two more quarters. But why is the project prolonged?\nIn short, this part is presented too short, lacks information, and has unclear content. I think the proposal should try to write a little more content so that the proposal is approved higher.", "q0r": 2, "q1": "The timeline and tasks are provided in the plan but it is a bit short and seems a bit unclear. The budget is fine because there are only 2 activities running DB-Sync and web hosting. In the information about members in the project, I think it needs to be added with information about related projects that the proponent has done. For example, I saw the proponent wrote that he had a background in an engineering project. I think the proponent could write more on this point. This will make the proposal better.", "q1r": 2, "q2": "The metrics provided are not clear (it's the same as what's written in the plan). Therefore, I think the proponent should edit this section and include more explicit descriptions, or specific KPIs. The successful picture also describes the benefits that the project will bring to the community. But I think in this section the proponent can still do better by providing more specific metrics. In summary, I think this part of the proposal is not doing well, and the proponent should add information to increase his chances of receiving funding.", "q2r": 2, "assessor": "z_assessor_4045", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Use DB-Sync as back end with queries and benchmarks in code to filter out well-run pools and highlight approx. 5 to 10 each week (rolling) to ensure they get the visibility.", "experience": "Created and registered a staking pool. Experience in Project Engineering. Coding as a hobby for many years. Plutus Pioneer Cohort 3 Alum."}