{"id": 415142, "author": "ekivalapp", "title": "P2P Marketmaker Money Transfer", "url": "https://cardano.ideascale.com/a/dtd/415142-48088", "category": 26595, "amount": 65000, "description": "Remittance fees averaging from 8.2% to 15% of the transfer amount is charged for transfers to Sub-Saharan Africa. Crypto adoption is also impacted as on-off ramps to fiat require some money transfer.", "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 15008, "q0": "This project answers the challenge of building Dapps and products in the Cardano pipeline by building a P2P marketmaker money transfer protocol.  This would target and help sub-saharan African countries to gain access to crypto and also to transfer funds at a much reduced price with respect to the remittance fees that are seen with Fiat-based traditional fund transfer methods.  ", "q0r": 5, "q1": "The team is newly formed with a lot of green developers in this space.  They are actively mentored by both Gimbalabs and WADA which is reassuring that they have connections to help with project management and development as they progress through this.  As stated although they have a huge undertaking, the team looks to have a solid roadmap, plan, and connections to help them through the development of this project and to enable a solution that would be largely beneficial to many African countries.", "q1r": 4, "q2": "In probably one of the better showings of auditable markers in Catalyst, they have a nice layout of metrics and KPIs for their project for various themes and look to have the making of a very transparent and trackable project.", "q2r": 5, "assessor": "z_assessor_2219", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15019, "q0": "The proposal will continue building a platform for remittance (sending money as a gift - usually children abroad sending money back home). This is an excellent idea using cardano to lower the fees offered by other remittance providers. This project will definitely help the cardano ecosystem grow and help a lot of people get their money without the huge fees. The proposal offers two times lower fees than the current remittance platforms so I'd say that gives it a fair competitive advantage.\nIt's definitely in the right challenge as it will be a dapp essentially. The proposers have thought about liquidity challenges they might have and have already gathered 50k and estimate 100k to be necessary.\nOverall this will be an impactfull proposal if implemented, and I would support it.\n", "q0r": 5, "q1": "All the members of the team are already known and have the necessary skills to get the job done. I managed to verify their skills mentioned and credentials with the links provided and as a developer I can verify the feasibility of their skills to get the project to it's successfull resolution.\nOne thing that's not ideal is the budget breakdown, because It is not detailed enough compared to many other proposal. For example no specific marketing breakdown is given which brings up the question why is the budget 5k and not 1k or 20k? This comment applies for the other mentioned sums as well. As a developer 10k for the frontend and 8k for the backend seems to low, but if that's the budget they're running with, I deffer to their experties in the DRC. More details is needed on budget spending.\nOther than that I have no more notes on the feasibility of the proposal. The team members are known and verified, there's a really good explanation video with a presentation and I'd recommend for all interested parties to have a look at the short video. I do appreciate showing your face and credentialns and standing 100% behind your proposal.\nAll and all, even with the small caveats mentioned, this is a feasible proposal.\n", "q1r": 4, "q2": "I see no problem with auditability as theres a github repository linked and all updated and features will be available in ekival.com for anyone interested. The metrics and KPIs are good enough to track the project success and optimize it along the way.\nThere's a clear problem statement (too much fees on remittance) and a clear solution - building a platform to alleviate the problem.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15024, "q0": "This proposal perfectly aligns with the challenge settings. The proponents aims to provide a Decentralized p2p transfer service of Ada vis a vis Fiat Currency in Africa and with a use case study in DRC. Centralized Transfer has been a bane of developing countries especially Africa with  high cost of transfer fees amongst cost whilst limiting the use of Capital in these countries for growth and development.bThe success of this proposal is a success, not just for Africa but other developing countries. This is a great idea that will bring Cardano to prominence and increase adoption of the ecosystem. This proposal should be overwhelmingly supported by the community. ", "q0r": 5, "q1": "This is a project has emerged and fine tuned through some Cardano related Startup Incubators. The proponents are more than qualified and experienced to execute this project in addition to relevant collaborations especially with Gimbalabs, a respected developer within the ecosystem. The Budget estimates are vague to determine its reliability however from the articulation of the proposal' operations of how to achieve their goals and the well elaborated Milestones within the specified realistic timeframe and am confident that this proposal is in good hands for a successful implementation.", "q1r": 4, "q2": "The proponents has provided sufficient and relevant information to adequately monitor and verify the progress and performance of the project with quantifiable metrics. The explicit and elaborate Milestones and Timelines are also added advantage to the ease of reviewing the proposal if eventually funded.", "q2r": 5, "assessor": "z_assessor_2292", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15033, "q0": "This proposal is a very interesting idea, the idea that the team came up with is in line with the objective of the challenge. The problem is clearly defined, Ekival provides liquidity providers with a single location. point to more secure cash transfers to ADA . thus the proposal can scale to address future challenges as well as the Cardano ecosystem . talk about a well-defined proposed solution that completely solves the problem of the challenge. The team identified the potentials that could prevent the proposal from succeeding and provided solutions to the risks for the project to develop. I believe the proposal has a great impact to grow strongly in the future, good luck and success with the proposal.", "q0r": 4, "q1": "The proposed team has identified a timeline for completing the work, the timelines are consistent with the proposal to complete the set goals, and the specific and detailed goals have been set, such as establish a social media presence on Twitter ,facebook ,instagram .streamline our brand ,targeting liquidity providers in Congo through mobile money dealers and businesses through which to see the progress of the project has been specifically planned , I appreciate the roadmap part of the project . Talking about the budget with the required amount of $ 65000, this amount is quite suitable for the proposal as well as the time that the team works, the amount has been broken down to know clearly the expenses used. used for each purpose. About the project team has given the relevant information necessary to know the work and related experience and, attached with each person's profile for the community to verify the information, so I trust into the team will succeed in the nearest future . Good luck for the project", "q1r": 4, "q2": "With what measures to track the progress of the project, the team has come up with detailed and specific defined KPIs, which the community can see easily to be checked and tracked. talk about the project's success has the team clearly described the results achieved, relative to the challenge of the campaign. funded projects in Africa manage to exchange Ada for local fiat , expanding P2P remittance to P2P loans and B2B services , thus seeing the project grow very well for the future . I believe this proposal grows stronger . Because this is a new project for the community to consider and evaluate for possible funding. I believe in the project's experienced team. good luck and success", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15235, "q0": "The “P2P Marketmaker money transfer” proposal addresses the Dapps, Product and Integration by “Ekival”. Ekival is a P2P decentralized money transfer service that allow other apps (liquidity providers) to publish liquidity by location. This can be done in the form of either cash or mobile money transfer. With Ekival smart contract, liquidity providers and consumers can send a deposit while the validation relies on mobile money API confirmation. Ekival is now on testnet implementation. The solution will benefit African communities who don’t have means to exchange ADA for Fiat. Ekival will sort out the issue of exorbitant remittance fee (8.2-15%) especially the African continent. As the challenge looks for dapps that can bring impactful use cases to Cardano, Ekival enables Congolese and African citizen to smoothly send and receive the money fits the challenge very well. Ekival circumvents low crypto adoption in DRC by mobile money transfer confirmation and also allows user to opt-in the preferred jurisdiction. Right now their total transacted value maybe only $50,000 but the potential to disrupt the money transfer market is hugh and this can also drive Cardano adoption within Sub-saharan African region and Worldwide. ", "q0r": 5, "q1": "The team has already participated in Entreprenerdy Incubator and Ariob Incubator.  The Catalyst funding is for audited smart contracts and their mobile app. According to their roadmap, they aim for full liquidity provision by end of this year. They will also do airdrop Ekival upon funded on their discord channel. Although the team has not provide the budget breakdown of $65,000 based on hourly pay and number of working hours, their fully functional MVP (minimum viable product) along with strong team members profile give me a strong confidence that they will be able to carry out the tasks successfully.", "q1r": 5, "q2": "The team views project success as they expand their P2P money transfer to P2P loan and B2B services with low remittance fee across Africa and that they could provide the API service for other liquidity blockchain apps. The team has very clear and achievable KPIs (launch timeline, $100,000 liquidity volume within 3 months, number of users onboarding, referrals, revenue target, community engagement and social media growth). As the team has provided the official site and their GitHub link, the team project progress is highly auditable. The team has clear understandable and effective solution (Ekival) that addresses the remittance fee issue within Sub-saharan African with measurable degree of success. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15292, "q0": "There is nothing to criticize regarding the impact, the idea is very good and could generate a high value dApp for our community and our blockchain, driving the adoption of Cardano technologies in Africa. The idea is to create a platform that allows users to carry out monetary transactions without using a traditional method of transfers, and it is called Ekival. The proponent explains how abusive fees are charged in traditional transfers - he points out values around 10% in relation to the amount transferred, which is truly absurd. By designing a P2P decentralized transfer service, the proponent offers a very useful use case for our blockchain while connecting with other on-premises applications.", "q0r": 5, "q1": "The presented script is extremely superficial, it is said in a very summarized way what would happen with the passing of each month. In this way, unfortunately, we do not have much understanding about the process. It would be necessary for the proponent to go into much more detail. The budget division is also done in a very summarized way, and consequently inadequate. As we can see in the examples: “Smart contract expansion: 10,000 + Frontend: 10,000 Backend: 8,000 + Mobile integrators: 5,000”, it says what would cost how much, but not why. The team presentation is, again, too basic. Little is said about each professional involved, we do have resumes present, but I would like it to be longer and more detailed.", "q1r": 2, "q2": "The proposal is certainly easy to monitor, as in addition to providing us with 7 key indicators on what should be achieved little by little, we know what should be ready at the end of each month (“September 2022: Mainnet launch with stablecoins, December 2022: Mobile app using Ekival API”, etc). We also know where all this would go: “Twitter, Facebook and Instagram will be publicly available and growth will be reported regularly once relevant thresholds are reached.” Success, in turn, is also defined well, at various points, as “Network of liquidity providers in cities WADA-Hub + Supermarket chains and other integrated cash-intensive businesses”. The question is where this information would be passed on to our community.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Ekival allows users to access transnational incomes without the need of using a traditional money transfer business. Ekival offers providers of liquidity a venue to transfer cash to more secure Ada.", "experience": "Team members have completed the Plutus Pioneer and Atala Prism Pioneer Programs. Haskell and Plutus trainers in Wada and Guimbalabs Education programs, Smart Contract Developers and entrepreneurs.\nEkival is live on Testnet and we have a combined experience of over 40 years."}