{"id": 415197, "author": "lley154", "title": "The Open Source Cardano Lottery", "url": "https://cardano.ideascale.com/a/dtd/415197-48088", "category": 26595, "amount": 29750, "description": "Cardano Green and Social Good projects need alternative fundraising options and the Cardano ecosystem needs more high quality open source projects.", "f6_no_assessments": 9, "f6_rating": 4.481481481481481, "videos": [], "media": [], "f6_assessments": [{"id": 1636, "q0": "The proposal fits the challenge well because it would bring more developers to Cardano, since projects like GreenFi and SoGood would have an investment in fundraising. Thus, the specific objectives present in the explanation of the challenge would be very well addressed: “Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products. +Increased quality of existing products & integrations through suggested improvements that are supported by customer feedback or increased usage by the community”. I say this because the proposed solutions would already specifically address communities that already exist, but would have their activities improved based on the initiative presented here. This would be done through an open source lottery, where the community would have access to how smart contracts, built on plutus and minted on the Cardano blockchain, would happen. An interesting feature would be that the project is non-custodial, that is, all interactions would be done through smart contracts, without the need for third parties to manage the lottery funds. It is also positive that the administrator would not have access to the treasury, which would prevent fraud and unauthorized access. The objective would then be to provide resources for raising projects, as mentioned above, and the community could interfere in relation to how the project would develop, since it would be open source. Suggestions and comments could be made, making the lottery more secure, reliable and transparent. The proponent is concerned with detailing exactly how the lottery games would play out in practice, detailing each action. This project is interesting in several ways; firstly, for presenting an innovative approach in the field of betting; in a fully decentralized way, and as the author well defines it, “using only blockchain smart contract interactions. This trustless model does not require “trusting” the lottery administrator to run and operate the lottery.” I believe that the project deserves maximum impact in terms of impact, since it is a very organized idea that would benefit the community so much (since the funds raised would be invested in projects of the ecosystem itself, from what I understand); at the same time that developers would be attracted, with the new possibilities of work that would be presented. In general, this would also lead to a great commotion and community engagement with each other, as a new way of placing bets would be launched (and we know how the cryptographic community is fond of this type of game, that is, the possibility of getting maximize profits through tools like this). I thought that, despite being a complex and quite technical idea, the author made it accessible to all readers, since he accurately described how each action would develop, allowing us to have a great understanding of the whole. In this way, there is no doubt that a high-value dApp would be developed, which, at the same time that it would promote the arrival of new members to our community, would also encourage the activities of those who already make up the current members of the Cardano ecosystem.", "q0r": 5, "q1": "Yes, the proposal is viable, but I have some comments to make about improvements that would raise the bar on this topic. The roadmap provided is not adequate in my opinion because the detailed activities are not explained (Sep 9th : Funding Approved / Sep 12th - Oct 21st : Development (1 Developer) / Oct 23th - Oct 28th : Testing (1 Developer) / Oct 31st - Nov 2nd : Documentation (1 Developer). There is no detail behind this. For example, from September 12th to October 21st development would take place. How would this be done, what advances would the developer need to present in about 1 month How would the test be carried out, in 5 days, after the development of the product? How would the documentation be built? We also see that all activities would be performed by only 1 person, which in my view is a little worrying. that the requested funding is corresponding despite the creation of the 0.2.0.0 beta version, would it not be interesting for at least another developer to become the proponent's working partner, in case he had any setbacks, the responsibility could be shared, perhaps decreasing the risk of delays? That is, much more detail would be needed so that we could accurately understand the development process here. What would be done, how, when, who would do it, for what purposes, etc.: all this should be properly informed here. As for funding, approximately US$30,000 is requested. This would correspond to 350 hours of work, with a value of 85 dollars per hour. I believe that this value is very fair, and this part of the proposal is very satisfactory, since we know exactly which small parts together would make up the whole; as we can see, for example, in “Browser wallet integration [Developer] [80 hrs] [$6,800] + Plutus V2 updates and code refactoring [Developer] [60 hrs] [$5,100] + Random number generator using player based entropy [Developer] [100 hrs] [$8,500] + Staking rewards of Ada locked in Lotto contract [Developer] [20 hrs] [$1,700]”. In this regard, there are no criticisms to be made, as I think it's all well laid out and our understanding of how the requested money would be used is pretty accurate. Finally, speaking about the team, it's just the proponent, Lawrence Ley. He is certainly super capable of carrying out this project successfully, a lot of confidence is conveyed through the information that is passed on: more than 20 years in application development, cryptographic enthusiast having done the Plutus Pioneer program, graduated in computer science from University of Toronto, etc. In other words, he is someone who is prepared and has a lot of study, in addition to providing his linkedin profile, so that we can have proof of what he is saying. My comment remains, I believe it would be interesting for him to hire another developer - preferably with the same level of experience - or maybe even an intern, so that they can share some tasks and support each other if necessary. In my view, it is never the best option for a proposal to be developed entirely by one person, no matter how prepared they are for it (as is the case), so my suggestion for this part is in relation to inviting a work partner. In general the feasibility is good, although not perfect - for example, the script in my view could be improved - but still it seems to me a project that would be successfully implemented.", "q1r": 4, "q2": "The auditability of the proposal is the topic that could be more detailed, in my opinion. We know that progress would be monitored by even a monitoring software called JIRA; I did a little research on this technology to understand how it works, and in fact it seems to be something quite suitable to accompany the dApp development process. However, it would be better if the proponent had attached an explanation of this tool to the proposal, since it is something more differentiated and not so common in proposals. That way, we would have a better idea of ​​how the monitoring of the creation of the dApp would be carried out, all readers would be better leveled in this regard. It is super important that weekly reports are made available by Discord, in fact, in the channel that will be created. It would be important for these reports to include explanations regarding both tasks and partial achievements, as I do believe they will. In other words, the focus should not only be on the products generated when each phase was developed, but also on the activities that led to this accomplishment, as this was made possible through the work routines - we must be aware of the processes that would be performed by each professional. One part that I think could have been better explored is the measurement of success. This topic doesn't get very well covered, we know that the funding would match just for one version of Dapp - it would be interesting if we knew how much the project would cost in total, first. The results that are expected at the moment are entirely numerical (3 pilot lottery sponsors identified, 10,000+ Github page views, 1,500+ unique visitors and 1,500+ clones, 300+ unique clones). In my view, it would be necessary for the proponent to do a qualitative analysis as well, that is, has the release of this version already started to bring some kind of return, even if not in the expected proportion? Have the funds for the projects started to be raised? Has this caught the attention of new developers to work with Cardano's technologies? How can we attract this type of audience and calmly respond to what has been exposed in the summary of the challenge, about attracting new developers and a skilled workforce to Cardano? How could this begin to be understood? Did the application generate community engagement, are many people participating in the Discord channel, for example? Because, in addition to attracting new active members to our community, it is important that the project also makes those who are already part of it more engaged, more active. Therefore, questions like these could be raised, so that it could be understood how, in fact, the project would be bringing consequences to our ecosystem. And everything must be properly accessible to the Cardano community: both the monitoring of the phases and the understanding of the final success scenario. That said, I think the suggested auditability is pretty consistent and necessary, but some more detail should have been provided.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 8, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 1774, "q0": "The Open Source Cardano Lottery is a fully decentralized lottery system, smartcontract based, whose purpose is to fund Green and Social Cardano projects. \nA beta release was delivered in may 2022, thus this proposal is made to continue the development. It includes the following features : browser wallet inegration, plutus v2 updates, random number generators using player based entropy (I would have appreciated to read some details about that one !).\nThis proposal has a clear goal, and its purpose meets the challenge criteria (\"Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community.\"). \nThe proposal explains how the project plans to scale after the current phase, with a long term roadmap including items like mobile app integration, multi player winners etc.", "q0r": 5, "q1": "The project developer, publicly identified by his LinkedIn profile, has significant experience in the development of applications and smart contracts. He followed the Plutus Pioneer Program and developed the beta version of Open Source Cardano Lottery.\nThe development plan of the second beta version of the product is made of 5 milestones, from funding approval early september to release in november 2022. The tasks to be completed all along are detailed with corresponding working hour estimation (ex. : \"Random number generator using player based entropy\", I really would like to understand that one ;-) )\nSeveral riks are identified, with a comprehensive mitigation plan. If achievable, I would recommend to include an external audit of the smart contract in front of the vulnerabilities / loss of fund risk not only by community members but also by a certified auhtority/group", "q1r": 5, "q2": "Is is indicated in the proposal that the track of the developments, test phase and bug list will be made available on JIRA platform. The proposer also commits on publishing weekly progress report on the project's Discord channel. \nAs the whole project is open-source, and as code is available on Github, the community will have all needed information to assess its progress.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8676, "q0": "In terms of format, this is a project presented in a very clear and logical manner, fully meeting the requirements for information to be provided when describing the project. In terms of content, I think this idea meets the challenge's goal. Integrating the lottery platform with an unsupervised 3rd party mechanism and purely luck-based results on the Cardano blockchain will bring a novel form of lottery play that can build trust and attract many players when the current form of lottery is gradually losing the trust of players because of doubts surrounding the awarding of fake prizes to stimulate players. The author did a great job of describing the architecture of the platform, the lottery issuance mechanism, the prize structure, and how the winners receive their prizes. The descriptions of how the platform works as a decentralized platform also reinforce the author's commitment that the administration and operation of the lottery will not be interfered with by administrators. The risks of technical, legal issues, and exploiting vulnerabilities for fraud are also presented and reasonable mitigation measures are given. In addition, we can also find predictions success of the project.", "q0r": 5, "q1": "This is a continuation project of the previous work done, the link they provide shows us the functions that have been completed in the beta 0.1.0 version, and they will be planning to release MVP Beta 0.2.0 this year. Their project development plan only stops at the beta release milestone and it seems that the official version will be completed in Fund10 according to the job descriptions in Fund10 that the author mentioned. I love the presentation of budget allocations for their main tasks, they are calculated based on hours worked x respective remuneration, and this is great for professionals to compare this cost level with projects with similar workpieces to conclude its reasonableness. According to the descriptions of the work experience, professional certifications of the core members of the project, plus a reference link to version 0.1.0 of the platform, we can be assured of the ability to their ability to execute this project well.", "q1r": 5, "q2": "JIRA will be the main tool used to notify the project progress to the community, it's a pretty good tool to easily manage tasks. In addition, weekly reports will also be generated and published on a public platform for easy auditing. The proponent has also chosen very carefully to provide specific indicators/KPIs to outline the success of this proposal, since the main goal of the proposal is to complete beta 0.2.0, these estimates are consistent and easy to follow.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8740, "q0": "Your proposal presents enough content so that we can understand the project you are looking to develop. You introduced The Open Source Cardano Lottery, then covered the completed entries and its positive impacts. The \"lottery design\" section is also explained in great detail. Besides, the proposal also meets the objective of Fund9. Some possible risks are mentioned at the end of the proposal (technical, legal and fund). There is nothing to fear when solutions to reduce risk have been provided.", "q0r": 5, "q1": "Firstly, I have a few comments about your roadmap. You provide very specific timeline and milestones, from Sep 9th the fund is approved, going through development, testing, documentation, November 3rd will release Beta 0.2.0.0. However, it would be better to have specific tasks within each milestone. Thus, the project will be more convincing. In terms of detailed budgeting, the breakdown is very well done. The tasks with time, cost, ... are mentioned very clearly. All information is open and transparent. The project was worked by Lawrence Ley, who was the only member introduced in the proposal. His experience and talent are unquestionable. Overall, your proposal is pretty complete, but personally I'd love to have more information in the roadmap section. That's also the reason I can only rate do 4* for this part.", "q1r": 4, "q2": "According to the proposal, project progress will be tracked by JIRA and reported on a weekly basis. However, I don't know what the project will report on, what the metrics to measure will be because the roadmap you provided in the previous section is too general. The plus point of this section is that the success of the project is described very specifically with timelines and goals. Specific numbers are also mentioned.", "q2r": 3, "assessor": "z_assessor_2997", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9317, "q0": "I support this idea of ​​yours. Because Blockchain property can achieve brand new transparency without side effects. Unlike the traditional lottery where everything happens behind the scenes, Blockchain records all transactions and nothing can change any part of the transaction, making it a system. Ideal for preventing manipulation. Ultimately, Blockchain has the potential to solve the most pressing problem of traditional lotteries, which is the possibility of fraud. Blockchain removes any geographical, regulatory or financial restrictions currently associated with lottery tickets. By going global, jackpots can be collected by a worldwide audience, resulting in higher jackpots than traditional lotteries. In addition, by using cryptocurrency payments, users can bypass the often slow, unreliable and expensive hassle of banking transactions. In the proposal I see that you also assess the risks and have solutions to solve them. In general, you have also described the appropriate solution to the existing problem.", "q0r": 5, "q1": "With a member to carry out the project I think it will be very difficult even though you are good and have a lot of experience. I think you should set up a team of several people to work with you. Regarding your plan, I see a specificity. You have a clear date to get the job done. But I find it sketchy for example September 12 - October 21: What is Development (1 Developer)? In general you need to be more specific. Regarding the budget table, you have clearly stated each job with the corresponding hours and amount.", "q1r": 3, "q2": "The proposal mentions that JIRA will be used to track development and testing tasks (and subtasks) and will be used to report project progress. I think you need to give a demo so people can see what it is and what it looks like. Is it ok to use your reporting JIRA? Is it easy to understand? Although the description of your measurement is a bit sketchy, the part of your goal has a specific date, there is a clear amount to be achieved. Presented in easy-to-follow, easy-to-understand ideas. In general, the idea of the project I agree with but you need to try to perfect your proposals and implement them well.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9731, "q0": "A proposal for a new approach to issuing a lottery can be very valuable to a blockchain. Lotteries are currently centralized, which means that you have to trust the administrator and they can be difficult to implement. With a decentralized lottery system based on the blockchain, anyone can participate and it would be much simpler to administer.\nThere are many benefits to using the blockchain for issuing a lottery. First of all, it would be more secure because it would be distributed and there would not be a single point of failure. Secondly, it would be more transparent because all transactions would be recorded on the blockchain. And finally, it would be more accessible because anyone with an internet connection would be able to participate. This proposals novel approach will drive adoption to the cardano ecosystem and get a userbase who before this was not an easy group to onboard. The proposal is all publicly accessible, contributing to one of the main goals for fund9.", "q0r": 5, "q1": "It is important that a team has already made good progress on a project in determining if the chance they will successfully complete the project. Proposal assessment can help identify areas of improvement for a team and whether or not the team is ready to take on a new challenge. Proposal assessment can also help blockchain projects determine if they are feasible and have a high chance of success. By understanding these factors, teams can improve their chances of success and avoid wasting time and resources on projects that are unlikely to succeed. Although the team has not yet received funding from and previous funds, this proposal is requesting funds for a project that has already had a lot of work put into it already. The project is already off to a good start, and with the experienced team behind it along with a clear path for success i believe if funded this team would successfully implement this proposal.  ", "q1r": 5, "q2": "It is important that a proposal includes a clearly defined roadmap with goals for the team to reach and milestones for the community to follow. By doing this, it allows those who are reviewing the proposal to get a better understanding of the project as a whole and its potential. It also provides transparency for the community so they can track the progress of the project.\nIn order for a proposal to be successful in securing funding, it must have a well-defined roadmap that outlines the team's goals and milestones. By having this information readily available, it makes it easier for voters to make their decision on rather or not to weigh in on a particular proposal. Furthermore, it builds trust with the community as they can see that there is a clear plan in place.\nThe proposals team, if funded, will seek funds through future funding rounds. This means they will need to keep the community up to date on their progress or risk not receiving enough votes next round. I believe the team is aware of this and will do what is expected of them. also the project being open source adds the the ability to easily track the progress of the proposal.  ", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11212, "q0": "Finding alternatives for funding Cardano's green and social good projects is an excellent idea. Because we should focus as a community on growing Cardano. And the option of running a lottery without the problems of an admin stealing those funds, since it will be completely decentralized, is very attractive. This model is called trustless because it does not require trusting the lottery administrator. In addition, the project will be open-sourced so that the Cardano community can improve the project. And in this way avoid any security problem, thanks to the cooperation. Everybody will see the code and will be able to give their opinion, comments, suggestions and contribution to make a secure lottery.  ", "q0r": 5, "q1": "The team is one person. Lawrence Ley, B.Sc. But this doesn't mean that he can't take the project forward. Attached is his linkedin showing that the experience he mentions is verifiable. He also has a Computer Science degree from the University of Toronto, which is an important university worldwide. He also has more than 20 years of experience in application development. For all of the above, I believe he would not have any problem to carry out the project.", "q1r": 5, "q2": "He will use JIRA for progress tracking and testing. I know JIRA, because I have used it myself for project tracking. But if you don't know JIRA is a Work Management Software, it is excellent for bug and issue tracking. And it has many uses, and it supports agile software development.\nSo project tracking will be easy. In addition, Lawrence will do a weekly report that will be published on The Open Source Cardano Lottery discord channel.", "q2r": 5, "assessor": "z_assessor_3231", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12715, "q0": "The Proposal directly addresses the Challenge Topic of \"Dapps, Products & Integrations\" with a clearly stated problem of \"more high-quality open source projects are needed\" and proposed solutions to \"build the Open Source Cardano Lottery for fundraising of Green and Social Good Cardano Projects\".\nThe Proposer has successfully provided a lot of useful details such as two explaining videos, a GitHub link, a well-explained solution, and a thorough action plan. The only missing information is financial KPIs such as the number of transactions per day, expected revenue within 1,2,3 months of product launch, etc.\n\nThis Project can be greatly beneficial to Cardano's Eco-system by providing a new product to the Community and by earning from the increased number of transactions conducted on the ecosystem.\nAs the project is implemented online, there are no physical boundaries to the impact of the project. I believe that the project can be easily scaled to many countries, especially Asian countries where the cultures for both software and application developments and betting have been flourishing.\nAs a result, I give this Project a 4/5 score for Impact.", "q0r": 4, "q1": "While it is common knowledge that people are attracted to lotteries for their financial benefits, this Proposal would get more credit if the Proposer had provided some proof from relevant materials and contents from trustworthy sources.\nThe Proposer has put a lot of effort into a very well-prepared Proposal, in which he/she is able to show his expertise and experience to the Cardano Community. The way the solutions and plans are explained in detail with professional knowledge makes the audience believe in his/her ability to carry out this project successfully.\nWhile Budget's items are fully listed, the timeline is too briefly presented. The Proposer should divide the Project into achievable timeframes with specific milestones for better transparency.\nThe Proposed Budget and Timeline are achievable, and he will likely be able to accomplish the proposed goals within the given timeline.\nThe Proposer has identified correctly the biggest potential risks faced by this project, which are \"technical risks\" and \"legal and regulatory risks\". He/she has also provided ways to mitigate these risks, which proved that he/she has put a lot of effort into preparing this Proposal.\nThe Proposer's LinkedIn account and his/her technical knowledge shown in this Proposal are good credentials for the audience to believe in his Proposal.\n\nThe Proposer has studied well the problem and solutions, and with this Proposal, he/she has proved that he/she is capable of successfully solving the problem. Therefore, execution risk is very low. \nFor all of the above reasons, I give this Proposal a 5/5 score for Feasibility.", "q1r": 5, "q2": "I find the Project roadmap specific, with milestones provided in units of days.\nThe Proposer has provided a GitHub link with a lot of useful information on the Project, and a Youtube channel, which shows his commitment and up-to-date progress.\nThe proposed solution, if carried out successfully, can solve the problem of \"lacking high-quality open source projects\" in the Cardano Ecosystem by utilizing the Cardano Community's intelligence via crowdsourcing.\nWith the requested fund substantial at USD 29,750, the Proposer should elaborate more on how the Project can be conveniently followed and regularly reported to the Catalyst Fund.\nAll in all, I give the Proposal 4/5 for Auditability.", "q2r": 4, "assessor": "z_assessor_3470", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14580, "q0": "The solution described in this proposal is closely aligned with the challenge. The idea of the proposal is building out The Open Source Cardano Lottery which is a smart contract lottery built using plutus for the Cardano Blockchain. The problem is illustrated apparently and adequately with completed items and lottery design. I highly appreciate the lottery design. The proposal has explained the process of purchasing lotto tickets in detail. The process ensures that all interactions with the lottery are done directly with the smart contracts and do not require any 3rd party to manage and hold any lottery funds. Equally important is that the lotto administrator only has the ability to run the lottery and does not have access to the jackpot or treasury to prevent any unauthorized access, which will make it a secure and trustworthy blockchain lottery. The Open Source Cardano Lottery also contributes to the Cardano open source community and helps increase developer adoption, which is one of the strategic objectives of Fund 9. The risks that prevent the project from being completed successfully are listed as include Technical Risks, Exceeding Plutus Script size limits, Vulnerabilities / Loss of funds, Legal and Regulatory Risks. To mitigate those problems, the solutions are given briefly and practically like Leverage Plutus V2 and CIP-33 (Reference scripts), Engage with the developer community to review the open source code and obtain feedback from the beta releases, The production launch of a Cardano blockchain lottery will be done by a separate legal entity with a gaming license in an appropriate jurisdiction. ", "q0r": 5, "q1": "The information about the budget breakdown is given with 7 categories. I can understand that all the spending is calculated in hours. The total number of hours is 350 hours with the price of $85, so the money the proposal needs is $29,750. The categories which are listed with task names like Browser wallet integration or Plutus V2 updates and code refactoring seem vague for me to understand deeply. I would like to see more details indicating the amount and kind of work for each step/time required. About details of the people who will work on the project, Lawrence Ley, B.Sc is a talent to make the project successful. The description about his experience is apparent and convincing. He has Over 20+ yrs in application development, open source and crypto enthusiast and enjoys learning and sharing new and exciting technology, be The Open Source Cardano Lottery founder, Computer Science degree from University of Toronto, Plutus Pioneer 2nd Cohort. Those shows that he has strengths in Lottery and technical fields. ", "q1r": 4, "q2": "The team does not establish direct KPIs that would serve to track the project’s progress and monitor project success. It would be crucial to understand the completion of the proposal in each stage. The KPIs need to be listed, number of users, completed part in which time, … I understand that the team uses JIRA to track, but this can only show the tool to track the progress of the proposal. The purpose of the tracking is to help the community to follow and easily assess the effectiveness of the project. So the KPIs I have mentioned above are extremely important. In the writing, the information on whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new one is not included. The team should add the data on whether there are other proposals which are in the same kind of the projects or not. If there are other ones, the team’s proposal would be more reliable and clear about the team’s objectives. ", "q2r": 2, "assessor": "z_assessor_4073", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Continue to build out The Open Source Cardano Lottery for fundraising of Green and Social Good Cardano projects. All code is open source which contributes to the Cardano open source community.", "experience": "20+ yrs in application development, Computer Science degree from University of Toronto and the founder and developer of The Open Source Cardano Lottery."}