{"id": 415153, "author": "megasquallers", "title": "Rythmeet:P2P music network platform", "url": "https://cardano.ideascale.com/a/dtd/415153-48088", "category": 26595, "amount": 73000, "description": "Music is not accessible to all and Cardano lacks attracting people from outside the crypto bubble", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1634, "q0": "The idea is very complete and well aligned with the objectives of the challenge. It's about creating a platform that unites the music-loving audience (which we know is a giant market) with Cardano's technologies. The problem raised is that Cardano only affects those who are part of the crypto bubble, which is information I agree with - it is very difficult for those who have no previous contact with blockchain to get to know Cardano and even understand why the project is different from other blockchains. So the proposed solution is to unite a market valued at 10 billion dollars (according to the proponent) with the peer-to-peer market, so that new users are brought into our ecosystem in a more organic way. I agree that this would be a great solution to foster our community, as people would be attracted to the music issue and not necessarily blockchain. Some of the possibilities that Dapp would work on would be: instrument rental; find music teachers nearby; find specific musicians for the formation of groups, such as guitarists, singers, pianists, etc.; rental of rehearsal spaces; funding of music scholarships for children and so on. From what I understand, how Cardano would relate to all this would be through payments: they could be made in local currencies (eg, dollars for Americans, euros for Europeans, etc.); as in Ada. An incentive would be made for people to transact on Ada - the fees charged by Dapp would be lower in this case; it is also understood that the first purchase made in cryptocurrency would be rewarded. The proponent states that “as our goal is to bring in people who are not aware of or comfortable with cryptocurrencies, we will allow people to pay using their own money or Cardano for people to discover this cryptocurrency and become familiar with it. We don't want to bother you with cryptocurrencies and that's why our strategy is to slowly familiarize you with this part of the platform. Simple tutorials will be created to explain how to buy Cardano for those who don't have it yet”. I thought this idea was quite clever, as it would not be “forcing” the public to adopt a new technology right away, but encouraging them to look for this alternative because of the advantages; and in this way, the adoption of the technologies of our ecosystem would occur in a more organic way. It is also very positive as the proponent raises a series of risks that can be faced with the development of this project, and is already seeking to solve them. In addition to some resistance from users to adopt cryptocurrencies, people could have difficulty creating digital wallets (and to mitigate this problem, a tutorial is suggested that teaches the lay public how to do this); there could also be some distrust in renting materials or spaces, and to solve this problem all data would be minted on the blockchain, through smart contracts; etc. So, in terms of impact, in my view, this project is very well built and achieves the objectives of the challenge very accurately.", "q0r": 5, "q1": "The proposal is highly viable. I say this because the bidder gives us a lot of information about the 3 main topics - script, budget and team. Talking about the script, first of all, it is said that I would happen according to the passing of the weeks. My suggestion for this part to get even better would be to detail each of the activities reported - for example in the first 2 weeks, it is said that the initial structures of the e-commerce platform would be configured. It would be positive if we could better understand how this process would take place, exactly. In the following others, the projection of “the entire platform and developing the processes that allow the rent and trade of physical items” would be made. How would this work be developed? I can see that until the 17th week the work carried out would be mostly of a technical nature, we know that professionals in the technology area would be actively working in these stages. But it would also be interesting if we knew, for example, if any marketing work was being carried out in parallel here, that is, if the project was being publicized as it was being built (it is said that perhaps more money will be asked for marketing in future funds, so it is not very clear if this part would start to be worked on or only when Dapp was already more complete). Talking now about the division of expenses, 73 thousand dollars are requested, which is a very high amount, but it is very well explained. We know that the full amount would be used to pay the salaries of the professionals involved (backend and frontend developers, as well as expert developers on Cardano's blockchain; a project manager, a content retarder, and a designer). We know how many weeks these professionals would work and also the value of their working hours - so it's pretty clear how the requested money would be used. Finally, when we analyze the team, a lot of information is provided about the members involved (especially the proponent, who provides us with a long detail about himself, making it clear what his past was and what projects he has been involved in so far). As mentioned by the proponent in the troubleshooting session, the proposal had been launched before, but it was said that the team had no experience with Cardano, so it was very important that they hired professionals specialized in our blockchain to join the team. That said, in my view, a lot of confidence is passed in the process (in addition to knowing the activities of each week, the development process is also explained in the impact part); the funding requested is very well justified and the team is properly presented, so this topic also deserves top marks.", "q1r": 5, "q2": "Progress auditability is perfect. The proponent states that at the end of each completed stage, the progress will be reported to the Cardano community through various social platforms, such as twitter, github, telegram, etc. From what is said, it will be informed what the partial results will be, as well as the activities that would be behind it. In the part of “we will share our struggles and we believe that being part of the Cardano community is a strong point and we would be happy to receive suggestions about Rythmeet”, it is implied that both the efforts and the successes being achieved will be shared, so I consider this part of the proposal is ideal. Finally, by looking at the auditability of the final success, we know what is expected for 6 after funding (“all technical issues are resolved and the site runs smoothly. We reach 5,000 users and 15% of them use Cardano currency. People start to donate to raise funds for scholarships. We can also start developing the NFT part of the platform in parallel if we receive funds in Fund#10. We develop marketing using the network of youtubers and musicians that we already have”); and also for 12 months (“we reached 20,000 users and 50% of them are using Cardano currency. We could then start hosting ads on our platform and become financially self-sufficient. With the money increasing, we will focus more and more on marketing” , contacting other influencers, music festivals and advertising on platforms like Facebook, Instagram or Twitter for example. We already know people from Shinetech working in marketing and ready to work on this project”). However, regarding this last part of the proposal, it is not so clear through which communication channels the final results would be shared. I think they would be the same ones used for partial results, such as social media and Town Hall participation, but it would be beneficial if this issue was clarified. It would be interesting if the proponents carried out a study of how the users involved in the project would be relating to blockchain, if those 50% of the public using Ada for payments would be somehow getting involved in the community, in other projects, whether in Catalyst itself or using other Dapps, for example. If we had this perception, we would know more firmly if the specific objectives of the challenge had in fact been achieved. Therefore, I believe that this part of the proposal is also quite adequate, just needing a little more clarity in relation to this last mentioned aspect.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2002, "q0": "The proposals consist in creating a music platform which accommodates musicians, music enthusiasts, music stakeholders (places to play, stores, schools, teachers, students etc). Moreover, the aim is to implement smart contracts to help with some functionalities within the platform and using ADA as a payment method, giving taxes discounts.\nTherefore, since music is a worldwide passion, being part of cultural expression in every country, there is a huge potential to the ADA community and to music community. That being said, the proposal aligns with the Dapp challenge, which is an impactful use case and brings adoption.\n \nThe goal of this proposal is quite interesting because it has the potential to bring lots of new ADA users which would not use it at first, or not know about it. The success metrics are quite nice, aiming, in one year, 20K users and 50% of it using ADA in the platform.\n\nThis proposal is ready to be selfsustained, with a objective plan to have a healthy growth before it starts to monetize to the team, which is an important aspect of any project. \n\nI’ve just taken a point here because there is no allocation of money to marketing, which I find a major step in any new application to have wide adoption.\n", "q0r": 4, "q1": "To be able to deliver this proposal they need:\n1 – Team: The team is diverse and has lots of experiences in their field. It was given proof of knowledge and experience of each member. The proposer has lots of experience in managing projects which reflects in the following points;\n2 – Plan: The project was divided in steps and each step was explained in detail. More than that, since this proposal already has the team with experience, was provided a timetable giving the process that should be finished and the expected budget to each phase;\n3 – Budget: The budget was given in two different forms, that helped to understand. The first one used together with the timetable and the second one divided into hours of work of each function, meaning that they have clarity in what they’re doing, when they gonna deliver it and who they need to deliver it.\n\nBesides that, to make the platform sustain itself it was provided a concise revenue model in which explains how the platform will generate money and how they’re going to use it.\n\nThere were presented risks and answers to those risks. However, it was not mentioned a risk that I find to be really important to consider, which is the functionality and usability of the platform. Since there are several newcomers to this platform, it’s mandatory that the platform and interface be friendly and deliver a nice experience. If this is not true, it doesn’t matter if it solves several problems, people will tent to not use it.\n", "q1r": 4, "q2": "To audit this proposal, it was provided several Social Media platforms in which is stated that will be provided all the updated content.\n\nThere was provided some metrics and success expectation which aligns with the challenge. However, there were not explicitly provided the Key Performance Indicators, which might be interesting to consider measure: # artists, # content, transaction volume, # used functionalities (determine which is the most used functionality). These are some indicators that should be added.\n", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8577, "q0": "Execellent idea and well-written proposal. The problem statement and the follow up solution is described clearly in its simplicity. The problem statement has two points: music is not accessible to everyone, and cryptocurrency in general, particularly Cardano, lacks appeal to individuals who are unfamiliar with new technology. The team's goal is to create the most complete music platform, which will serve as a meeting point for these two problems, not only to encourage musicians to connect and develop their music skills and network, but also to invite new from outside the cryptocurrency bubble into this new technology. For that, I completely agree this idea is in perfect harmony with the challenge settings. A dedicated session revealing impact is also very much appreciated since it clarifies the value offer. It also provides a detailed vision of what the community will accomplish, how it will attract new members, what activities will be established there, and, most importantly, how the projects will be implemented. Furthermore, the proposers have already explained the technical aspects and technologies required for implementation, as well as a list of potential risks and how to resolve them if they arise.", "q0r": 5, "q1": "The team has submitted all of the information required to get clarity regarding feasibility. The proposal contains thorough information on the team; the experiences presented and the work already performed suggest that the team is fully capable of developing this project. It is great to have links that give us an insight into the necessary talents and expertise to accomplish this idea; this provides some assurance to Cardano ecosystem members who are reading the proposal. I love the fact that the author took suggestions from the previous fund and then recruited 2 new members with a high level of knowledge in blockchain. The team now is complete and ready to carry out the project as stated. The timeline and strategy are clear, with week-by-week milestones specified. In terms of what will be done, how long it will take, and in what order, we are provided a description of the main tasks that will be completed in each period. Even more intriguing, we have a breakdown of expenses for each milestone! Which means we can clarify how much it costs for a particular task to be done. Providing the time horizon, milestones are likely to be achieved. For that, I have nothing but praise for the team. Furthermore, the proposal includes a detailed financial breakdown, which is reasonable and appropriate for the amount of effort required to make the project a success. We have an insight of which and how many experts are in charge of which role, how many hours they work per week (I figured out the number by a simple calculation) and most importantly, their hourly rate. With some google compared to today's value expertise, I agree the salary is modest. Also the team has a distribution of personnel which I consider reasonable. In addition, the team's personnel allocation is appropriate in my opinion. Furthermore, the team highlighted further funds that may be necessary for the marketing aspect in the future, demonstrating the team's commitment. From an overall perspective, the roadmap, budget, and overall executed plan are all very clearly laid out and make a lot of sense based on the information presented by the team. This proposal has a high chance of succeeding, in my opinion.", "q1r": 5, "q2": "Tracking the successful delivery would not be a problem because the timeline is well defined and linked to certain KPIs. The author includes a part that shows the success after 6 and 12 months, as well as the specific number of users and the percentage of them that adopt Cardano currency. These success metrics are consistent with the key metrics, allowing voters to easily keep track of the project and assess if the stated goals have been reached. The executed plan is comprehensive and thorough; we know exactly what will happen and in what order. Another advantage is that the team has already offered a multitude of connections to their social media in order to stay in touch with the community. It is a very auditable proposal; it is enough that such monitoring is put into practice.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8675, "q0": "This is a very unique and novel idea, developing the Cardano blockchain integrated platform for music-related activities such as buying/selling / renting music instruments, renting a practice place, building music bands, looking for music courses, etc. I think those who love music or intend to learn about music will love this platform, the main activities of the proposed platform solve the big problem for those with music-related needs, it's like a version of the classifieds app where all products revolve around the music theme. And integrating this platform on Cardano has the potential to bring new users and increase engagement on the blockchain. Personally, I love the idea of ​​using a variety of payment methods on this platform and users will be rewarded with using the Cardano wallet for transactions. This not only encourages ADA interaction and adoption but also reduces the risks of legal issues in countries/regions where cryptocurrencies are not yet legalized. While there is no demo describing how the platform works and the main function buttons of the platform yet, the proponent's descriptions are enough to help us easily visualize what's going on on the app. use. In addition, the success metrics (15,000 users per month), revenue model, risk and mitigation measures are also detailed, contributing to the increased reliability of this project.", "q0r": 5, "q1": "The implementation process covered in the Impact section and the app-building plan in this section show the proponent is ready for future work. The plan goes into detail, at each milestone the author lists the main features of the platform to be completed, which is also a basis for which project development progress can be measured. The budget is allocated according to the staff in the group and based on the number of weeks they work, to prove the members' work effort is reasonable given the given budget, Proponents can provide additional estimates of each member's weekly hours worked. While it can be seen a discrepancy between members' working weeks (4-8 weeks) and platform building weeks (17 weeks), proponent has earlier justified the platform frameworks are already available and not all members will be working most of the time building the platform (17 weeks) but working on each stage of product development. Therefore, the calculation of cost is reasonable and consistent with the proposed application development plan. Regarding personnel, the proponent addressed the risk of the lack of blockchain professionals by recruiting 2 new members first. Information about the main members of the project including work experience, educational background, expertise, and projects implemented are clearly described, and attached to CV and Linkedin profiles for verification. With these descriptions found, the proponent's ability to undertake this project cannot be doubted.", "q1r": 5, "q2": "The information needed to track and measure the success of a project is easily found in this section including various tools that allow those who are interested in the project to access and keep up to date. progress reports (social media publications, plans to participate in Town Halls); The project's roadmap for the success of the project is represented by the goals to be achieved and specific KPIs. I think the main metrics given such as the number of users and the percentage of them using the Cardano currency are good indicators of success.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9486, "q0": "I give this section a 4 for clearly defined creative execution and direct connection to Cardano adoption. This section is good and thoroughly descriptive but could benefit from being made more concise. If these proposals are meant to be put in front of an average voter, it’s not unlikely that they’d get turned off from the seemingly excessive length. My biggest concern is cost to impact ratio of the proposal, as $73k is on the higher end but the use of the platform is restricted to France and other neighboring countries (as inferred by the risks portion of the impacts). I do still think the proposal has potential to encourage adoption and awareness of the Cardano ecosystem if it gets substantial usage in these beginning areas, which would make this section an ideal space to provide some information about marketing, existing connections to reputable organizations, and regional awareness of the project at this stage in development. It could be argued that the given payment options in ADA are a weaker mechanism to inspire adoption, I do think these kinds of real-world integrations are how we can push for mass adoption of the ecosystem. ", "q0r": 4, "q1": "I give this section a 5 for clearly outlining the roadmap with costs along the way, perfectly breaking down the budget allocations, and clear demonstrative capability to get the job done. I appreciate the checkpoint budgeting throughout the roadmap but I expect most voters are used to bullet pointed roadmaps (which is just a minor visual criticism). I think a more pressing concern is the lack of descriptive information about marketing, as product awareness and usage is key to achieving the desired impacts. There is some marketing related content in the roadmap but I would like more expansion, since it is such a centrally important factor of this project. I’d like to point out that the budget breakdown is exactly what the best proposals do, in providing through details on hourly rate and timeframe requirements for each category of labor. It’s also worth mentioning that the salaries are very fair and perhaps even a bit below industry standard, which shows efficiency in spending. The experience of the team is plenty capable of producing the proposal goals at this stage of the development of the platform. ", "q1r": 5, "q2": "As the best section of the is proposal with thoroughly defined milestones for success at 6 month and 12 month timeframes, I rank this section a 5. I do wish there were more bullet pointed lists of KPIs and objective success metrics, as voters are used to seeing simply laid out overviews for auditability. Still, the content provided here is up there with some of the better auditability sections that I’ve seen in Catalyst. There’s a lot of content here that I would’ve liked to see in the feasibility section but it’s very clear that the proposers have a very clear target for what they would define as success and they provide public resources to hold them accountable to their targets. They layout how many users they want to see as well as what proportion of them are using $ADA as their chosen form of payment, and I also feel like the goals are ambitious enough to make a legitimate impact on the Cardano ecosystem. I’m onboard.  ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14488, "q0": "The issue is that Cardano is unable to onboard people from outside the crypto bubble, and music is not accessible to all. The proposer wishes to address both of these issues in a single proposal. The concept is intriguing, and it targets a distinct group of people: artists and investors. The proposal seeks to establish an artist platform where musicians may meet new people, locate instruments, obtain scholarships, and learn about Cardano. Instead of merely being a music platform, the idea is attempting to accomplish a variety of things, which will set it distinct from other music platforms. The proposal identifies and attempts to remedy the problem. The proposal identifies and attempts to resolve the Issue. This platform may assist users in learning about cardano and in onboarding new members into the ADA ecosystem, hence contributing value to cardano. Because the aims are aligned with the challenge and this music platform may be extended to meet future difficulties, the solution effectively addressed the issue.", "q0r": 5, "q1": "The team is diverse, and the group appears to have the necessary experience and skills to make this proposal a reality. The proposer has considered all potential risks and challenges that may affect the proposal's execution and has provided a detailed explanation of how to mitigate them. They have evaluated all of the resources that might be required to carry out the project. The comprehensive timeframe provided, each with targets to meet, appears fair for completing the assignment. It's a good thing they've supplied a detailed budget breakdown. The requested funds appear to be justified. Looking at the proposal, it is clear that the proposer has done a lot of research and has addressed all of the issues that will be required to make the plan a reality. Given the above, it is safe to say that the proposal will most likely be implemented successfully.", "q1r": 5, "q2": "The proposal clearly states the key performance metrics that auditors can use to audit and follow the proposal's progress. The action plan also includes weekly goals, which makes it easier to track progress and determine whether or not the proposal is progressing as planned. The proposer has offered a variety of metrics to determine the proposal's performance, with targets to meet in three, six, and twelve months. This will be useful in determining the proposal's success. The offered proposal provides a clear description of the problem, as well as a thorough explanation of the proposed solution. The plan also includes a complete budget breakdown, which will be useful for tracking progress. Based on the observations made above, the information provided in the proposal should be sufficient to track the project's development and success.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Creating the most complete music platform for musicians where they can network, find instruments, receive scholarships, discover Cardano", "experience": "Proposer: 2 PhDs, 8 years in research and international project management\nTeam: More than 40 years cumulated in software development and project management"}