{"id": 415503, "author": "enzo", "title": "Conkis ~ Multiplayer strategy game", "url": "https://cardano.ideascale.com/a/dtd/415503-48088", "category": 26595, "amount": 84000, "description": "Cardano does not have successful video games adapted to the masses. NFTs and crypto are usually terms that make the average gamer think they will get scammed, so they refuse to play.", "f6_no_assessments": 7, "f6_rating": 4.095238095238095, "videos": [], "media": [], "f6_assessments": [{"id": 1638, "q0": "The idea of ​​the game is very interesting, when the proponent claims that most players don't have much confidence in games involving cryptography and NFTs, I believe this is indeed true; At first, the impression that people have is that everything involving cryptocurrencies is deception, pyramid schemes and so on. There is still a strong prejudice rooted in most people, especially in places where blockchain is not widespread (for example, a citizen of California, in the United States, may even know what Cardano is, but for example countries where there are many companies adopting the technology and little is said about blockchain, the level of prejudice and misinformation is still very high). To solve this problem, the proponent launches the idea of ​​a game that is not necessarily about blockchain and NFT, but is a traditional game with the possibility of NFTs being involved in the gameplay. The game consists of battles, armies that are set in the Middle Ages. The match would consist of capturing some flags and destroying towers, so that the rival is defeated. It is a game inspired by chess and also by the Age of Empires saga. In this case, Cardano's technologies would enter through cards, which would be acquired in packs. These posters would represent certain powers, such as “healing, protection, increased/reduced mobility, increased/reduced range, increased/reduced damage” and so on. The posters would be acquired randomly, from what I understood, luck would decide which power players would be acquiring. It gets a little confusing how players would acquire these card packs, would it be for Ada, local currency? The letters would be the CNFTs, in the case in which the user could import or export to his wallet. So, here is my main question: how would users who have no knowledge of blockchain acquire CNFTs? Would there be a tutorial teaching them, first, to create digital wallets? And after they made transactions on the blockchain? The proponent’s argument is that “players not being able to sell their CNFTs or tokens internally at the beginning of Conkis will motivate them to start learning and becoming familiar with the world of cryptocurrencies.” That is, curiosity aligned with the possibility of making a profit would be what would move these players to learn more about Cardano and the cryptographic universe, in general. I agree that this is a good strategy, but the question remains of what this first step of acquiring CNFTs would be like. A positive point is that the proponent is very aware that the issue of tokens cannot be the main point of his project. For example, he uses the case of the game Axie Infinity as a case where the focus was on profit and the project ended up sinking. Overall, I believe the proposal is in line with the goals of the challenge, as it would produce a Dapp that could attract new active members to our community, through the game, but I would like this question of how players would be instructed to do so. taking the first steps in encryption became clearer. However, the impact is still very good. In my view, both topics present in the detailing of the challenge would be well covered: “Creation or improvement of different Dapps, products, and integrations that provide value to the Cardano community and wider ecosystem” and also “Integrations with other existing services, products, and protocols that improve the end-user experience whether that's giving the user more options or making something easier to use that benefits the wider ecosystem”. I say this because at the same time that a new project would be created, situations that already exist and that can be improved would be used as a basis.", "q0r": 5, "q1": "The line of development of the project is not well explained, unfortunately. We know what would happen and at what time of year, for example in, about phase 2: “Q3-Q4 22: Elo ranked games + 10-20 cards + centralized/federated token + Paypal payment integration + Stripe payment integration ”. But we do not know exactly which month of the year these activities are expected to take place, nor is there much detail regarding what would be done. The “Elo ranked games” part. What would that mean, exactly? What would the 10-20 cards mentioned in phase 2 be? From the way the script is presented, it is not clear which professionals would have to work on which actions, according to different goals. I think that in general the development process should be better worked out. I will cite an example of how this could be improved: instead of quarterly divisions, it could be defined what would happen monthly. Would it be important for each part to be better detailed as well, that is, what exactly would happen each month? Turning now to the cost analysis, a total of $84,000 is requested, a very high figure. In general the value is divided into 3 phases, and some small parts are explained (\"phase 2 (Q3-Q4 22') = $22500 + phase 3 (Q1-Q2 23') = $22500 + phase 4 (Q3-Q4 23' ) = $22500). For example, Alejandro's monthly salary, who would work in coding. We know who would do what, which is already a super positive point (many proposals don't give us that kind of understanding). We also know that the working day would be full, which already gives us another very important notion (the value of the working hours of the professionals involved). Some things could be explained better. For example, why would adsense campaigns cost $10,000? How does this type of advertising work, why is its value so high? I think that some parts are even better explained than others, when it comes to financing, but it would be necessary for all of them to have the same degree of depth, so that the asking value, which is not low, would be better justified. And lastly, I believe that more details should have been given about the team members. We know their names, what areas they work in and a small description of what they have done so far, for example “Josema Gonzalez - Code: 18+ years of experience as a programmer | 4+ years of experience developing blockchain projects (Coinfy, Switchain, Monedero)”. But we don't have someone who is an expert in Cardano for example (Josema has experience with other blockchains). It would be important that more information had been passed on each, as well as linkedin profiles attached, so that we could see in a more practical and direct way what was being reported. I think the feasibility is ok, having some points that need real improvement so that it becomes really adequate. It would be great to have a more precise breakdown of the script, more details about each team member and a more thorough explanation of how the requested money would be used.", "q1r": 4, "q2": "Progress would be measured with various KPIs such as: User Acquisition / User Retention / Social Media Impact / Number of CNFT Transactions / etc. It is very detailed what each of these metrics would mean, as we can see from the excerpt I took as an example: “User acquisition. For this we will try to do marketing focused on our niche, although we will also target the general public. For this, we must carry out advertising campaigns on social networks, such as promoting tournaments and broadcasts of streamers that give visibility to Conkis.” What I found very positive here is that the proponent, in addition to citing the KPIs, explains a little about each. For example, we know that to analyze user acquisition, marketing focused on the niche would be done, with advertising campaigns on social networks, broadcasts from streamers, etc. However, two suggestions I would like to make in relation to marketing are 1) in addition to observing these partial results, it would be good if the roadmap were also followed up. In other words, is what was agreed to be done being completed on the scheduled date, being done by the agreed professional, in the right way? Have any challenges and problems been observed along the way (most likely yes, as it is normal), and how were these obstacles overcome? 2) how will all this information reach the Cardano community? The proponents unfortunately do not explain how they intend to maintain a communicative point with the members of our ecosystem. They say that they are going to work with social networks for marketing, so it would be interesting that through these channels they also keep the community updated on advances, partial results and the work routines of the professionals involved. Leaving now for an analysis of the final results, this is seen when the game reaches the 1 million player mark, a category on Twitch with spectators focused on the game, and also when Conkis becomes a reference for table games. I think that all these expectations are geared towards the success of the project itself, forgetting a bit what the challenge proposes. How can we confirm that the game has brought new members to Cardano, that a considerable number of digital wallets have been created, that more CNFTs are being minted and traded? How was Ada involved in all this? Did the project really make a positive impact for Cardano, working on its popularization? I think that last part left something to be desired precisely because all the success scenarios are in relation to the game itself, and not about our blockchain and the goals that are thought for the challenge of Dapps. For these reasons, I think the auditability was doing well in the progress part, even if it wasn't ideal, but when it comes to the success part, the adequacy level drops quite a lot. What is necessary for the proposal to be easily auditable, in my opinion, is that at least the two parts (progress and success) have a satisfactorily minimal level of detail, which is only observed here in the first of these parts.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 8306, "q0": "Right from the beginning, I have to agree with the statements the proposers make about one of the current situations regarding NFT-featured games, which is the players’ unwillingness to try them out since they haven’t had a firm grasp on the subject of cryptocurrency. Therefore, having a fun and engaging game that focuses on gameplay rather than monetization with NFTs could be a viable change of pace, and that’s exactly what the proposers hope to deliver with this project. \nFirst things first, as I was reading through the descriptions of the game, specifically the mention of game genre (which is a strategic turn-based tactical game) game setting (which is the Middle Ages) and how the battle of the factions go down (with the victory of a faction defined by flag capturing and enemies’ main base elimination), I immediately felt the resemblance to one of my all-time favorite game franchises of my childhood, Age of Empires. And I was absolutely not let down at all, as the team confirms that this game is in fact based on Age Of Empires and chess. That factor alone already makes me so hyped up for the bright future of this project, as evidenced by the love and endless hours of playtime of my younger self, the other people born in the late 80s and 90s in my neighborhood, city, country and quite positively, lots of corners of the globe. But I’m getting ahead of myself here.\nBack to the proposal, another feature of the game that I feel absolutely pivotal to the foundation of every game is that it is not a pay-to-win game, thus ensuring a competitive yet unbiased gameplay experience. And the focal point of this project is once again emphasized, which is the delivery of a pure enjoyable time playing the game rather than a means of generating revenue. Aside from the components that I have already mentioned, there is another element that will be developed by Cardano. That will be the cards available to all players, used to enhance offensive or defensive capabilities and advised to be strategically applied to determine the fate of battle. \nHowever, I’m a little concerned over these claims, to quote directly from the proposal, “Cards cannot be purchased individually. Players will buy booster packs, and the luck will decide which cards they get.”, by the team. As a gamer myself for nearly 7 years, the cards being unable to be purchased individually and players having to buy booster packs to get them should cause some controversies within the community, since those who can afford the packs will have a great edge over those who can’t. Additionally, those who do buy booster packs will not be guaranteed a specific set of cards, and I believe they won’t be too happy with that fact either, as luck can frequently be not in favor when we need them to. Therefore, I would suggest that the team enable the cards to be purchased during a special event of the game perhaps, and there should be a somewhat solid chance of getting a desired set of cards when purchasing booster packs.\nThe team also states that there will be the presence of CNFTs within the game, acting as a reward for the victors I believe, which can be transferred to their wallet for trading on markets, as for now, a dedicated marketplace is not yet available, but is on the horizon. The team is hopeful that the current absence of a marketplace would encourage players to start learning about Cardano. Though that is a positive outlook, I believe that things can go both ways, because while some actively immerse themselves in new knowledge, others just join in for the fun and feel like learning is not necessary. Therefore, I would probably recommend that the team make the marketplace a key component in upcoming updates and drop in a few adjustments to make the marketplace (or the game itself) a place to learn more about Cardano and the cryptocurrency world for maximized possibilities of adoption. \nThat being said, the proposal also mentions a possible obstacle to the future success of this Conkis, which is the lack of resources to spread words to people about its existence. And the team plans to tackle this obstacle by making sure they deliver what they set out to do with this project, which is a purely enjoyable and appealing gameplay experience where the CNFTs will only be an additional value to the game. And having witnessed the ups and downs that Axie Infinity, another worldwide hit\n NFT-based game that recently went through a devastating hack, has experienced, the team also promises to carefully plan a suitable direction and approach for this game.\n\nA small flaw in an otherwise great performance so far is the lack of key metrics needed to measure the progress of the project and determine how the future would look like. So that’s another set of details that the team is suggested to supplement.", "q0r": 4, "q1": "I’m quite delighted to find out that the game has already had a functional beta version up and running, along with the dedicated website and some cards, for players to experience the game firsthand and voice their feedback and suggestions for future installments of the game. Supposing the beta version is met with enthusiasm, the proposal has included following phases of development and perfecting the game, with new content and features being gradually added, and I’m especially intrigued to see that there will be a mobile version of the game expected to be released in Phase 4 or during Q3 or 4 of 2023, which I believe should have the potential to attract mobile device-based players as well. \nAs for the requested budget, firstly I would like to say that the mention of the interest in Cardano since day one is appreciated. The budget will be allocated to the execution of the development process, the remaining 3 phases and the marketing campaign afterwards. The team also offers their vision moving forward with the project if the marketing campaign goes well or exceeds their expectation. In my opinion, except for the marketing campaign, I feel like the development process and 3 phases could have used a little bit more details for each segment, specifically, what tasks would go down at each phase and exactly how much each task would cost. \nAs for the individuals involved in this project, they have been categorized into 3 groups, ranking in a descending order of relation to the project, which are the Founders, the Core Team and the hired Freelancers. I’m quite pleased to know that the 3 Founders have been intertwined with the project for 10 years and are now very eager to finish what they started. Every single person is enclosed with their respective position and past experiences, and in case those are not enough for satisfaction, there is also a website at the end of the section for further details.", "q1r": 4, "q2": "In this section, the proposer has managed to list down 4 key metrics that are pivotal to gauge the future success or even failure of this project, and thereby quite relevant to the ones listed in the Challenge Setting. The proposers see them as not only metrics for measurement, but also motivations to push the team towards delivering a high quality final product.\nThe desired vision for success would of course be the public release of a fully functional game that will adopt massive numbers of players and viewers, with tournaments being held periodically as well. Theoretically, joining the game could mean that newcomers would be more aware of Cardano. But whether they would end up migrating to Cardano or at least interested in the blockchain has not been mentioned and reaffirmed by the team, hence I would suggest that the team supplement that specific detail", "q2r": 4, "assessor": "z_assessor_2974", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 13877, "q0": "This proposal for ‘Conkis ~ Multiplayer strategy game’ fits strategically within the Dapps, products and integrations challenge of this funding season. The creation of this game is planned to drive more adoption and growth in the Cardano community through CNFTs or tokens.\nThe Conkis game is already in pre-development with a video walk through example, fairly detailed website and Beta test version that is really fun to play (I just spent 20 minutes on it). The game mechanics, layout and visuals are well developed even within this Beta version. The game has a good balance of entry level accessibility, but includes challenging aspects to gain mastery, this proposal focuses on developing the ‘cards’ that will buy booster packs to improve your chances in the game. Initially the proposers plan to retain custody of the CNFTs, but then users will be able to import and export or trade the cards within markets such as cnft.io. Further on, the roadmap for the project involves creating their own marketplace. So this means, initially there will be minimal direct contact with Cardano, as the proposers state the game will be free to play and the CNFTS or tokens will only be an optional extra to play. It will definitely lessen the impact on the community if they fail to promote these cards, or, if they are not marketed as valuable to winning the game.\nThe proposal details the risk of not getting enough players, however, this genre of gaming, particularly on mobile devices, is very popular right now, as a turn based strategy game. If they do manage to command a large market share, yet only a small percentage of the players integrate with Cardano this should still be a significant number of new users to the Cardano ecosystem. They also have conducted background research and followed the progress of other games, in particular Axie Infinity, in a hope to learn from pitfalls and overcome these in their own project by initially not launching their own token until the game has a solid base.\nOverall, I can see the potential impact of this game and the possible benefits to Cardano. I rate it 4 stars for impact.\n", "q0r": 4, "q1": "The proposal provides sufficient detail in terms of a timeline, budget and supporting details to assess its feasibility effectively. \nAn initial point of interest, perhaps not a concern, is that the game has already been in development for nearly 10 years. On their website they state the idea came to them in 2012, that they have left the project several times, but are now “more motivated than ever to finish what we started.” One would hope they are true to their word and given the funding, no other circumstance would prevent the further development and large scale deployment within the project’s timeline.\nThe timeline provided in the proposal has details listed by half year, two quarters at a time. It would be beneficial to possibly see some of these smaller steps along the way, however, it's clear what the milestone objectives are at the end of each year. The planned deployment of the mobile version is more than a year in advance, this is a little bit worrying to me as this is where possibly their main player base will come from. However, I understand they want to perfect the web version and integrate all the wallet and payment versions before launching into the mobile app market.\nThe proposal lists a solid team who have been working together for years already. Each person’s experience and qualifications are clearly listed, and full names given if you wish to find out more information about them. This is a confidence building mechanism and the team should be congratulated on their transparency of staffing. \nFrom previous seed funding (non Cardano) they’ve scraped together the Beta version. From here on, they’ve listed modest salaries for everyone involved, and a rather generous Adsense campaign budget - which is most likely needed to drive and promote the CNFTs sales. They don’t plan to apply for further funding rounds for this project, rather have the sale of CNFTs to allow the project to self-finance and continue to grow.\nOverall, despite the slow 10-year start, I believe this project is highly feasible in terms of objectives, timeline, staffing and budget. I rate it 5 stars for feasibility.\n", "q1r": 5, "q2": "Once again, the team has provided sufficient information to audit the success of this proposal in relation to the challenge criteria. They list 4 key measures that will report aspects of their success.\nFirstly, user acquisition through the development and deployment of the game. They plan initial niche marketing, however, acknowledge that large scale campaigns will be needed to increase the user body significantly. They have not written in the proposal whether this information will be made public via a platform, or how community members will be able to access these statistics.\nAs with user acquisition and second KPI will be user retention, which is key to building a successful game. They list keeping the interface simple and speeding up decision making within the game, as aspects that will support user retention. Once again, it’s not listed where or how this data will be made public.\nThe third KPI noted is the impact on social networks. Chatter, shares, and direct communications with the company through social media will show the reach and activity level of the community. This aspect is easy for members of the public and the Cardano community to monitor through the social media channels listed on their website.\nLastly, the final KPI list, most critical to Cardano, is the number of CNFTs transactions. As this number increases the popularity and success of the game is evident from players ‘paying’ to buy into the game for the additional bonuses. In turn, new to Cardano members, players adopting wallets and tokens will increase the number of people actively involved in blockchain.\nThe proposers have an ambitious outlook, aiming to have a million players and a Twitch category with thousands of daily views. I’m not sure if these numbers will be achieved in this timeline, but overall for auditability I give this proposal a 4 star rating. \n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 11213, "q0": "Videogames industry is huge, and have an exponential growth, surpassing the movie industry. So developing a videogame to attract users to Cardano is an excellent idea. In addition, the proposed game is a popular genre in the industry. Such as strategy games, like \"Final Fantasy Tactics\" or \"Voxie Tactics\". They mention Age of Empires as a source of inspiration which has released its latest version \"Age of Empires 4\" last year. Showing the genre is still popular.\nThe game is free to play, which allows to attract players without having to make an initial investment to play. This makes it easier for more people to get familiar with Cardano, than if an initial investment would have been required.", "q0r": 5, "q1": "Is his webpage https://conkis.com/about , they have detailed information about the team working on the game. With the role of each of the members of the development team. In the propossal they show the experience of each member of the team. They also have links to their social networks. Which is always positive, to show the experience of the team and that the team is real. The team is from Spain, which is a country that has grown a lot in the videogame industry in the last years. With games like \"Metroid Dread\", which has received very good reviews. Besides this they show a gameplay video that looks very nice and well designed. For all this I think the team is more than capable of carrying out the project.", "q1r": 5, "q2": "They have a very well detailed roadmap, indicating what is going to be done at each step. I like that this year you already can play the game, and a year later they keep adding features to the game. It is also good that the release of the CNFTs will not be immediate. The idea is to develop the project well before the release of the CNFTs. In addition, many of the steps are verifiable at the moment they are implemented.\nThey provide a set of KPIs that are very relevant to the project. Like User acquisition, User Retention, impact on social networks and Number of CNFTs transactions.", "q2r": 5, "assessor": "z_assessor_3231", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14904, "q0": "The approach of the proposal is impressively practical since Ads based on inference data and third party profiling data/cookies have been absurdly increasing. And these Ads have become controversial, due in part to what companies do in order to grow these massive networks. Google, Facebook, Twitter, and others suck up large amounts of data about us in order to promise their advertisers the ability to deliver hyper-targeted ads that are more likely to hit potential buyers than the competition. Tech companies design products to encourage you to make bad privacy decisions and give them more information. This Profila's zero knowledge advertising might solve several concerns about privacy and change the world of advertising. On the other hand, some brief explanation of technologies that are going to be used for this project would be easier to understand. The Profila's DeMar platform described in the proposal seemed promising with their devoted model. They believe that  this proposal does address the challenge. However, what the Cardano community will achieve from this project is still missing. By pointing out the risks that Cardano blockchain expensiveness might affect the model, required solutions are needed due to their promoted expectation outcome. ", "q0r": 5, "q1": "The phases are clearly defined, and they highlight important work. However, in order to track further information that is seriously missing, they need to demonstrate what will be done at what time. In Phase 2 - Q3-Q4 22’, I understand that in the proposal, Elo rank games will be finished, but who will be involved in the progress and specific actions that are going to be conducted is unknown. The same thing happens with other phases. It would be quite difficult for the community to follow as they can’t see the real timeline for these plans. Furthermore, through the settled plan, indicating the achievements that they expect to have in specific timelines are crucial. The salaries are explained in detail enough for the budget. They also have the ability to be dependent on the budget, so that is something positive to take note of. On the other hand, they mentioned 22500$ for each phase., salaries and other payments do not satisfy the curiosity of which equipment and server/domain are chosen. The members working on this project seem to know each other very well, and that is a good sign of a successful project. It would be fantastic if they could provide more evidence of staff experience.", "q1r": 4, "q2": "In this part, they did a great job explaining how they would bring this project to life successfully. They wanted to keep the  players always interested in the game by speeding up decision-making as much as possible, without losing the essence of a strategy game. But how many players will define the success of the project is something missing. They mentioned \"Number of CNFTs transactions\" and clarified that they were doing things, but for the exact number of CNFTs transactions, it does not have to be 100% precise. In order to keep track of the progress, some specific numbers are needed. It is hard to draw a picture of their success since the targeted goat or which part of the project has done well are not pointed out.", "q2r": 3, "assessor": "z_assessor_4109", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14913, "q0": "The problem of lack of successful video games adapted to the masses on the Cardano ecosystem described in Conkis's proposal was well-aligned to the challenge. Moreover, the thorny issue of the wrong mindset of the CNFT game that the proposal addressed prevented the development of that main field. Then, the proposal devised a solution inspired by traditional games/forms (chess and the Age of Empires saga) to deal with that challenge. I believe the strategic turn-based tactical game set in the Middle Ages allows players to capture the flags, destroy the towers, or annihilate rivals as a potential strategy and utilize available resources. However, that solution has not solved the problem statement completely when its root is the fear of being scammed on blockchain platforms. It is a free game, not a play-to-earn one, and not a pay-to-win one that allows gamers to easily access and experience an equitable competitive environment to relax and develop themselves. To balance the game, Cardano comes into play with the introduction of free rotation of cards which offers a wide range of possibilities to boost their army or weaken the enemy. However, although I know Cardano will be the foundation for the CNFTs exchange development through wallets, it would be better if the proposer could explain in detail the role of that ecosystem in these transactions. In addition, the proposal does well in addressing the tokens and wallets. Consequently, I suggest adding their feasibility and alignment to the Cardano ecosystem (ex: whether those tools are already possible in the Cardano ecosystem and suitable for execution now). From there, Conkis can make some necessary suggestions to contribute to Cardano's development. Also, the rules that don't allow cards purchased individually and CNFTs/tokens internally sold at the beginning on Conkis will provide a profound motivation for players to start learning and getting familiar with the crypto world. However, I wonder whether players can get into trouble purchasing booster packs (ex: payment features, price of these packs). Besides, although the potential audience (gamers) has been logically referred to throughout the proposal, I think the proposer should describe and analyze more clearly the characteristics of these target audiences (hobbies, concerns, age group) to hit customer psychology and bring success to Conkis. Another vital issue is that the proposal still doesn't explain in-depth the positive impact Conkis has on consumers. Furthermore, \"integrating Cardano in a way that the average user does not have to know that we are using blockchain technologies\" is still a question of user reaction. Overall, the future goal of the proposal is to create a marketplace. Thus, I would like to see some of the metrics/KPIs (ex: number of players, qualitative feedback on game experience at an exact time like the blueprint) and a description of the benefits to the Cardano ecosystem to show the outlook and synchronicity with challenge settings (gaming destination). One challenge Conkis facing is the lack of resources to get their idea to as many people as possible. From there, they took some practical measures such as differentiating themselves from other NFT games and using the CNFT added value to a fully functional game. I suppose that to increase the persuasiveness of such solutions, Conkis proposal should analyze these ideas and desires more carefully because they will help Conkis manifest a unique potential that goes beyond current popular forms. Moreover, although the team has recognized the risks of tokens, the time \"we are completely sure that it will not affect its philosophy and principles\" is still quite vague and cannot be precisely determined.", "q0r": 3, "q1": "Conkins has been running for years (released in acquired form and a playable beta version) outlining initially the project's prospects and the need for funding to accelerate its progress. The roadmap is separated into five phases ranging from one to two quarters, spanning from 2022 to 2024. It provided goals and important milestones well-aligned blueprint (ex: Mobile version in Q3-Q4 2023, the end goal of Conkis – Marketplace to be completed by the end of PHASE 5 – 2024). In addition, specific numbers such as 100+ new cards or Crypto payments integration images have partly demonstrated the promising successes that Conkis brings. However, I claim the proposal should briefly cover the progress of the product/achievement at each milestone and the importance of the staff's contribution. In addition, the team's long operation time is a strong point that needs highlighting through the semi-finished products/finished products, the running information of the website/beta version, or detailed technical aspects to increase its persuasion. Regarded budget breakdown, a past example mentioned by the proposal, has contributed to enhancing the community's confidence in making the most of funding to contribute to the ecosystem. It is broken down into separate sections and details the personnel and operational costs of the project. I highly appreciate the proposal for creating Conkis advertising campaigns for the community (influencers and streamers; several tournaments and prizes awarded in ADA). Though, I state budget should be analyzed based on a roadmap and milestones to evaluate the feasibility. It would be better if adsense campaigns to promote the pre-sale of CNFTs are planned under a well-prepared budget (ex: number of activities, the method to realize the goal). In addition, the $500/Month in the budget breakdown is still relatively general and should be improved by providing an accurate salary and working time (hours/week or hours/day) for three Graphic design/Illustrations (Freelancers) team members. The proposal provided fully staffing information in detail through the Github/Linkedin platform. Therefore, I firmly believe that the professional team and founders with a lot of experience (+10 years) in the project's multi-field game development (Code, Graphic, Marketing, and blockchain) will blow a new breath into the CNFT game market as well as creating future successes.", "q1r": 4, "q2": "Regarding measurement, the proposal did well in giving detailed figures evaluated based on developer contributions, modules/dApps, CERP contracts/transactions, and quantifiable impacts on the Cardano. However, I suppose the team should supplement an accessible tool to help the Cardano community follow after being funded to increase voters' trust. Then, some promising future images (such as utilizing daily by tens of thousands of governments, businesses, and enterprises; driving further adoption of CERP and the Cardano ecosystem; creating millions of new jobs and opportunities for billions of people) have already been introduced. Though, I believe it would be better if they could define success in more detail and align to the milestones (ex: when the goal of utilizing daily by tens of thousands of governments, roadmap, and enterprises will be achieved/after how many months of operation). Furthermore, a part of the product/project that reveals the target client's reactions and the KPIs showing alignment to the challenge settings has not yet been mentioned to increase its objectivity.", "q2r": 3, "assessor": "z_assessor_4110", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14965, "q0": "Overall, the information given in this section is quite clear, well-aligned and easy to comprehend. The intention of the proposal is to build a collectible card game that applies CNFT as a payment feature. They do not follow the trend of play-to-earn mechanism but stay with the classic method, which is attracting potential users through the gameplay. Nevertheless, I think the idea is still incomplete due to the fact that this type of gameplay has been existing for at least 2 decades, which might cause gamers, to some extent, boredom to try new card games. Accordingly, my suggestion is that the developing team should work out on what features should be added to make the game outstanding compared to the others in order to compete directly with already existing rivals. With that being done, I believe that this idea will attract gamers, create a successful video game adapted to the masses and bring more users to Cardano. The proposer also stated that they had been watching the rise and fall of Axie Infinity. From my point of view, the learning attitude proves their specific dedication and ambition towards the project. However, the challenge they mentioned, which is lack of resources, in my opinion, only shows that they needed Cardano but not the vice versa. The idea of differentiating Conkis from common NFT games is not yet to be clarified. I believe adding more solutions of what and how to actualize it would increase the chance of success. Additionally, I am concerned that the operating mechanism, which is cards are received randomly through boosted packs, results in a problem. Since there would be powerful cards that are highly desired, they would be priced much higher than the others. The lucky owners of these cards would tend to sell their account, or sell the items they have to make real money profit. This problem might lead to the problem of reduced demand of CNFT or the inefficient function of the marketplace. I believe this is a huge risk that the team is facing and there should be a solution.", "q0r": 2, "q1": "Generally, I find that the detailed plan is prepared carefully with a clear roadmap and milestones. Each phase includes steps to be done and a specific timeline for those. Also, the passion and dedication towards the project were also expressed through the fact that they invested their full-time and spent their own savings into it without any salary returned. After visiting the website and trying the BETA version of the game, as a gamer myself, I would like to give my honest congratulations on how they finished the first phase. The budget breakdown is provided with a specific amount of money and time needed for each work. The marketing section is also attached with a Teaser link, which is a helpful example for evaluating the amount of money required. They also explained some campaigns properly (how to get traffic, how to promote Conkis, what will attract players to tournaments,...) if the CNFT pre-sale goes well and some first profits are made, which is a quite promising future. The human resource of the team is introduced with specific professions and short briefs for each member. A trusted attached link is also provided to help us understand more about the team's spirit, which is a strong point to prove that this is feasible.", "q1r": 5, "q2": "The information offered in this section is well-written and convincing. Not only did the writer list reasonable key metrics to follow but also he emphasized how they are going to keep track of those. The users’ experience, complaints and suggestions are especially focused on in order to improve the game efficiently. Personally, I find these measures beneficial for both the developing team and the investors. However, in my opinion, a specific estimation for each criteria is still needed to bring a more objective point of view. Moreover, I think the imagination of success is still too general. There are many other aspects that they should observe such as the number of content creators and streamers playing Conkis on Youtube, forums and groups discussing Conkis on Facebook, Twitter or the number of searches for Conkis on Google. Taking notice of these figures would also bring more visions to the team beside Twitch.", "q2r": 4, "assessor": "z_assessor_4118", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We will integrate Cardano in a way that the average user does not have to know that we are using blockchain technologies. The usage of CNFTs, tokens and wallets must be a feature, not a requirement.", "experience": "We have more than 17 years of experience in fields such as web development, programming, 3D design, teaching or marketing. And more than 4 years of experience in blockchain development.\nMore info: conkis.com"}