{"id": 415697, "author": "vicepool", "title": "Token Maker + GoFunNFT", "url": "https://cardano.ideascale.com/a/dtd/415697-48088", "category": 26595, "amount": 97800, "description": "Using tokens to access content/services or subscriptions requires creating your code to issue/manage/send tokens. Larger projects require UTxOs optimization for the continuous issuance of tokens.", "f6_no_assessments": 6, "f6_rating": 3.944444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 674, "q0": "I strongly agree that the proposal effectively addresses the challenge. The proposal targets a problem area to minimize cost and improve scalability for token issuance/management, especially if large projects/companies want to tokenize their services/products. This currently is not optimized and even though eUtxo supports multiple native assets to be combined in one transaction, for large scale projects we would need further improvements in terms of scalability so that costs are minimized. \n\nThe proposal, as step 1, targets to provide such a tool which will achieve just that and then as step 2 will be used in a marketplace named GoFunNFT, which will allow selling access to digital content. This will allow Cardano to outreach big players (such as big businesses in entertainment/sports industries) and utilize blockchain to serve their fans/customers, thereby helping Cardano to have more adoption and onboard more users. Also, scalability (of utXO transactions) is what this project is targeting and therefore both tool and marketplace perfectly fits in with these challenge settings.\n", "q0r": 5, "q1": "The team for this proposal has already had successful funded proposals in the past and this can be seen from the youtube channel they have provided link to. However, there is no further verifiable links provided e.g. Github/Linkedin for the team/lead developers/project leaders, which is a very important aspect of verifying experience, therefore as a proposal assessor, I see this as a required improvement in the write up of the proposal.\n\nAs a Senior developer myself, I agree that total man hours (3290 hours), rates and total budget ($97500) provided for both TokenMaker tool and GoFunNFT architecture, design and implementation is justifiable.  The risks mentions that token-maker could lead to changes in CLI which can currently be used to create native tokens on Cardano, this could be a breaking change, and therefore the solution of further developing this tool is provided.\n\nThe timeline is split into Sep-Nov 2022 (fulfilling token maker implementation) and followed by its release (Nov-Dec 2022). However, it would have been great if further details were provided on each of these items, such as why 2 months are needed for release and what actually would happen in Sep-Nov 2022 timeframe? The GoFunNFT development is planned for Dec 2022-May 2022 timeframe, however, given the team has significant experience for already funded proposals, I would expect a good detailed architecture/technical documentation, along with features (implementation/design side) that fulfill the milestones given here. Therefore, I see some room for improvement for this proposal writeup and hence can only agree.\n", "q1r": 4, "q2": "At a high level, the success of this project is verifiable, as it results in concrete release of a tool and marketplace. Additionally, improvements and further releases can be tracked via Github. Nevertheless, it would have been much better if further details were provided to include progress tracking for this proposal. \n\nAs a developer myself, I can see that this is an implementation heavy proposal and therefore, must be tracked via measurable action points, for instance: biweekly sprint stories resulting in sprint goals, splitting of milestones into tasks that are posted on either Github progress or some sort of public Kanban board. I feel this proposal description is lacking the progress aspect writeup and hence I can neither disagree or agree, as the information provided is sufficient to measure the success of the proposal but not progress.\n", "q2r": 3, "assessor": "z_assessor_2114", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2792, "q0": "The proposed team commits to handling the traffic congestion of on-chain records, with experience in the open source project cardano-mass payment, and the team provides a tool based on the above solution to Create a GoFunNFT marketplace, which generally supports NFTs.\nthrough the solution arguments of the proposal but has not stated how will handle the traffic jam will be done, or there is no example to support this claim,\n* as far as I know IOHK has successfully announced the test run for the latest upgrade, and in this upgrade protocol there will be support for the \"use input without spending\" feature \" ( CIP31) and this feature will solve the waiting or queuing to write on the thread, is the team planning or learning about that feature,\nIn addition to this proposal developing for a tool to support the community to use for coding their projects, the team commits that the appeal of this tool is that the features that support many different languages ​​are possible. integrated use. but what will the marketing of the proposition look like to get the community to experience those features.\n\n The risks mentioned have been identified and a thorough direction of those risks is also given. With explanations and documentation, additional examples and workarounds are needed, so it is difficult to determine a high score for this impact.", "q0r": 3, "q1": "In the announcement of the roadmap of the proposal, additional explanations should be given for the contents of the work such as: Open source token generator as discussed with the proposal team on impact, and this part has not been approved yet. provide specific examples and how the evidence would be used to create a parallel transaction engine to support ongoing crypto projects, so it is difficult to determine if two months is suitable for implementation. Does this work, the rest of the content of the work I have no opinion,\nExpenses are fully stated with specific explanations for each job, how many dollars / hour will be received, calculated according to the level of work, in accordance with the common ground and job content.\n\n With the content of the proposal, I only identified a core team of 8 people, and assigned to a small group, but other relevant information, of the group has not been provided with relevant experience examples. , identity, and links to each member's individual activity platform. comparing the contents in the documents provided by the group is still lacking a lot, so it is difficult to determine the feasibility of the proposal.", "q1r": 3, "q2": "The proposed team has not yet published details of the measurement indicators for the residential community to monitor the progress of the proposal's work, for example:\n Open Source Token Generator,\nReleased the first version of Token Maker,\n These milestones are needed for the community to verify them once the team claims to have completed this phase, and there are also no statements or footnotes regarding which will assist the community in tracking or reporting. periodically for the grant, the team needs to add these statements i.e. work completed at any stage will be published on some common platform, although the team states all will be displayed on GoFunNFT, but according to the roadmap, it will not start developing until December 2022, so before that, the community will check where the previous stages are,\n\nsuccess indicators are fully defined and provided by the team. Thus, based on the indicators provided by the team, it is still lacking for measuring progress, so verification by the community will be difficult.", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 10, "ne": 2, "ng": 4, "nfo": 4, "vca_o": 1}, {"id": 7405, "q0": "The project presents a plan to create a tool called Token Maker to issue and manage tokens at all levels, making it unnecessary for developers to repeat the operation when building their products, thus projecting The project is completely suitable for Challenge\nWith part one, the token generator, projects can claim faster token issuance, combined with parallel mass payments and reduced fees. Regarding this, all projects can integrate Token Maker or only those associated with GoFunNFT? Do they have any limits? Are token throughput metrics such as quantity, issuance time, lock time, corresponding value, etc., easy to adjust and change? Please exchange specific projects to help the community understand\nFor part two, creating a practical GoFunNFT marketplace, using the Token Maker tool, does this offer a distinct advantage to attract users? Authorization by OAuth2 wallet with Avatarada needs a high-security policy, although it is built with open source code, does the project plan to audit the source code? This helps transparent information, the project builds credibility with users\nThe project lists developers who can integrate Token Maker in many languages such as running on Node.JS, PHP, ASP.NET, Java, and Python. I appreciate this experience and diversity. However, the project does not mention compatibility with Haskell language, a main language in the Cardano blockchain? What are the advantages or disadvantages?\nWith all the above sharing, I rate this part 4 points\n", "q0r": 4, "q1": "The project presents a detailed plan of 6 phases, spanning 9 months. In phase 1, the project should present in more detail the steps of creating open-source tokens. For example, by what method to create, input, access, integration, testing, etc. Since this is one of the important steps, the core of the project, the project needs to be presented in the most detail, help the project stick to the roadmap, and the community can support it when needed. Before the launch of GoFunNFT, in order for everything to be smooth, run properly, and not make major mistakes, I suggest 2 more main steps: test run and check the code. Helps reduce risks for the project itself and users\nA detailed budget section, specific items listed, and clear time estimates, with working hours, in my opinion, are reasonable. The total application fund is $97,800, accounting for 1.2% of the total Challenge, a decent number for developers for 9 months. At the same time, the team cannot specifically list the number of people, including who, and what is the social network. This is a big omission\nIn order to be voted and approved by the community, I think the project should be presented more closely according to the above suggestions. I rate 3 points for this part\n", "q1r": 3, "q2": "Regarding the measurement of project progress, in addition to the content presented by the project, the project should remove the ideas of the section “[Audit] What does the success of this project look like?” At the top, there are 4 important KPIs to evaluate project success. They are very intuitive and easy to quantify. In addition, I would like to add some criteria to help evaluate the working process such as construction architecture, how many tools are designed, the number of interfaces that can be compatible, the number of users... For the project please provide a Github link Specifically, where the project updates the results, making it easy for the community to follow and observe\nThe success of the project gives developers more tools to create products faster, and everything is close to reality, helping the Cardano ecosystem to expand. I rate this part 4 points\n", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9732, "q0": "A proposal to provide a powerful tool for issuing and managing tokens for projects of any scale, simplify tokenization in the form of access to content, services, and subscriptions is a good option for the Cardano blockchain. Proposal success depends on various factors such as its preparation, submission, community feedback, and so on. The quality of a proposal also matters. A well-crafted proposal stands a better chance of getting accepted by the community.  Proposals that are not well researched or thought out are less likely to succeed. The Cardano blockchain is a great platform for issuing and managing tokens. It is also a good option for simplifying tokenization in the form of access to content, services, and subscriptions. Proposal success on the Cardano blockchain will help to increase its adoption and use. Proposal success will also benefit the community by providing them with a valuable tool. Proposal success will also encourage more people to use the Cardano blockchain and participate in its ecosystem.", "q0r": 5, "q1": "A proposal is more likely to be successful if it has a talented and experienced team working on it. Blockchain technology is complex, and a proposal needs to have a team that understands how it works in order to be successful. A team with the right skills and experience will be able to navigate the complexities of the blockchain and make a proposal that stands out from the rest.  Having a real use case is also important for a proposal's success. A proposal that addresses a problem that people are actually experiencing is more likely to be successful than one that does not. Proposals that solve problems that people are facing are more likely to get funding and support from the community. The right team and a real use case are two of the most important factors for a successful proposal. If you have both, your proposal has a much better chance of being successful. With the idea of tapping into the subscription based services and the NFT ecosystem as a whole, I can easily see this proposal not only becoming successful, but also profitable in the future. A project the can generate income will be in a much better position for longevity. ", "q1r": 5, "q2": "The proposer lays out a clear and easily read timeline for the community to follow. the team has extensive experience in implementing proposals for the Cardano ecosystem. They have worked on a number of previous funding rounds, and have successfully created working products that anyone can use today. This sort of experience is an important factor when considering how the team will handle reporting progress to the community. They are very realistic on the timeline of each milestone, and some of these milestones will finish with a platform the community can interact with on the cardano blockchain. They will also release their library on GitHub and PyPi by the end of 2022, keeping in line with cardanos core values of open source which is very important to the community as a whole.  ", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10924, "q0": "Considering the rapid adoption of native tokens by several recognized organizations and countries around the world, the need for standard and quality applications has increased dramatically. This proposal therefore aims to introduce a tool for issuing and managing tokens that is intended for projects of any scale. Two building blocks are proposed in this project: a token maker and a corresponding marketplace. The team has already received multiple projects funded through Catalyst. The weakness of the proposal is that both the problem and the solution are only roughly described. This leaves some questions unanswered at the end and the impact for our ecosystem can only be evaluated to a limited extent.\nI also miss the discussion of possible risks and the comparison with other platforms and projects that address the problem from a similar side. Therefore, there are only 3 stars from me. ", "q0r": 3, "q1": "The proposer presents us with a short action plan that complements this idea he presented. The milestones are defined and the monthly deliverables extend to May 2023. Since they need about $100,000 to achieve their goals, I would appreciate more details regarding the implementation phase. \nUnfortunately, there is no detailed description of the team. \nThis point diminishes credibility and thus it is not clear to say whether the team is up to the task. Also missing are any links or sources to learn more context about the team and the project. Based on the data, I can't give more than 3 stars for this section.", "q1r": 3, "q2": "Regarding auditability, the team unfortunately only notes superficial KPIs and only explains at a high-level what success means. I would definitely still be interested here in how they plan to approach adaptation in the market for the solution.  The team has submitted several proposals in previous rounds and in some cases successfully funded them. This helps the community trust that the team will support the review process. Still, documentation sources are completely lacking, which is a shame. I recommend the team Open Source the results on Github or similar and disclose milestones set at monthly intervals, the sprints during development for the review process. ", "q2r": 3, "assessor": "z_assessor_3206", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11235, "q0": "This project is very essential and useful for the whole Cardano Ecosystem. The team plans to provide a tool for projects or anyone, in general, to use and manage tokens for projects. The project will take over all the work of issuing the token, sending them out, and managing them. With this, the developer can spend more time on the project without worrying about issuing the tokens. There is a lack of such a provider in the ecosystem and this would definitely help many projects later down the line. ", "q0r": 5, "q1": "There are currently a designer, two back-end developers, a project manager, two front-end developers, a sysad, and two additional developers. All the developers are experienced too. Hence based on experience the team is all set. As for the plan, it will begin later this year. The initial phase would be the open-source Token Maker, then a release of the initial version of Token Maker, followed by creating all the necessary tests. Afterward, the team will start the development of GoFunNFT. Then there will be improvements to the Token Maker alongside the GOFunNFT and finally the launch of GoFunNFt. The plan in itself is well throughout and with the team, it is likely that they will be able to implement the proposal successfully. ", "q1r": 5, "q2": "The proposal audits the progress by the following: the release of the initial open-source version of Token Market, and the regular updates/improvements that appear as a side product of the work on GoFunNFT. These are sufficient to assess the progress of the proposal. As for the success of the project, there were several metrics provided. Such as the launch of open-source Token Maker on GitHub, new releases with upgrades on GitHub or PyPi, the usage of the Token Marker tool by other projects in the ecosystem and the public launch of GoFunNFT and the sales generated there. Overall, both the progress and the success of the proposal can be audited by the means that were provided in said proposal. ", "q2r": 5, "assessor": "z_assessor_3233", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "To provide a powerful tool for issuing and managing tokens for projects of any scale. In addition, simplify tokenization in the form of access to content, services, and subscriptions.", "experience": "Winners of several previous Catalyst funds. Developer of CardanoWall, authors of the open-source cardano-mass-payments tool for sending mass payments. Currently developing Avatarada, an OAuth2 authorization with Cardano wallets, and a project to support mission-driven SPOs."}