{"id": 415725, "author": "henokp50", "title": "Crypto banking & Payment Processing", "url": "https://cardano.ideascale.com/a/dtd/415725-48088", "category": 26595, "amount": 40000, "description": "Accepting ADA payment and Cardano-based stable coin is not possible due to the lack of payment integration and processing service.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7530, "q0": "I agree that this project is a very good idea proposal that has a great impact on the Cardano community and has a suitable solution to this problem. The inability to accept payments of ADA and Cardano-based stablecoins due to the lack of payment processing and integration services is an issue that needs to be addressed in this challenge, which is listed by the author. This proposal effectively tackles the challenge and if funded could provide a good impact on the Cardano community. This solution solves the problems of the challenge Ennarea Finance will provide merchant services for businesses to accept and process ADA and Cardano-based stablecoins while allowing users to spend crypto-assets on their goods and services. This proposal raises the most obvious issues related to the challenge. The proposal has been foreseen by the author of the risks that he may take for the proposal and also clearly lists the risks that he may face. They cited the main risks affecting the proposal as the Fait deposit and withdrawal gateway in Eritrea, Somalia, and Djibouti, regulatory approval in Somalia, and Eritrea, about communication difficulties in Some regions that do not speak English. The solution is specifically cited by the author and also clearly states how to deal with that risk.", "q0r": 5, "q1": "The timeline is perfectly reasonable the author has given a clear roadmap with detailed passages and with milestones, and the author has a clear and clear vision toward the stated goal. The very specific goals are explained in detail and over the next few months, they break down the milestones and detail each of their timelines: Test release and demo in September 2021 – July 2022, Marketing Campaign and Production Release in September 2022 – January 2023, Kickoff Board Launch and Crowdfunding Portal Release in February 2023 to June 2023, Release of electronic money banking and payment processing services in July 2023 - January 2024, Expand and penetrate the market in 2024 - 2025. The author collects relevant skills in research to give them confidence in their ability to achieve their proposed goals in the shortest possible time. They also mentioned a long-term goal that clearly outlines what needs to be done towards that goal, by saying that the proposal is an ongoing process that spans years, and they also address the continuum of Cardano-related issues. The success of the project is related to the challenges clearly described by the author over 3 months, 6 months, and 12 months of work. In the months, the author lists in detail the things to do to make it easier for the viewer to visualize and observe. There is a clear road map of how and where the project is going, and also directly related to the challenge summary. These successes are directly related to the challenge's campaign. With the arrangement of the launch programs of the team, I see that success will soon come to them. The author's proposal lists two solutions to this challenge: Owners holding ADA can spend their money on goods and services, and business owners can accept ADA as a form of payment without having to pay in cash. This is a great idea it helps to get more people involved in cryptocurrency and Blockchain makes every transaction easier.", "q1r": 5, "q2": "There are 4 metrics detailed by the author: the number of new users coming to our platform, the number of businesses that register to use our service, and the number of transactions made through the service. our service, the number of daily active users. With the above list of the group, we can see that the author's measurement is very easy to check the progress of the project. Well-defined KPIs that are easy to measure project success. Team Ennarea is a 5-member team of authors who seem to have a wide range of experience and a strong background of members. There are many different areas but things related to Blockchain. The author states their names, what each person has done, talk about their previous experiences, they list their working relationships with Blockchain so we can better understand who they are. There are three high-tech engineers, a project manager, a communications director, and a marketing manager who are available to execute the project within the given time frame. The group includes: Henok Lapiso, Beza Yared, Frehiwot Samuel, Denys Tun, and Daniel Hawkins linked to LinkedIn and Gmail so we can follow their projects very easily. The funding applied for this project is $40000 less than 20% of the budget for the whole challenge. The budget is divided into 4 stages by the author: setting up and decorating the office, attracting talent and team member costs, hosting and developing the data center, Marketing campaigns, and organizing events. events, administration, and other costs. With the amounts listed by the author for each item, the roadmap and budget are sufficient to audit the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8490, "q0": "This proposal has stated a problem that definitely existed for a long period of time. The team has successfully delivered a very ambitious but viable solution. Ennarea, in my opinion, will contribute to solving the lack of a payment process in Africa by opening the door for ADA holders to spend their holding online for goods and services and having businesses accept ADA as a payment. The target of this project is clear, and the idea and its impact are well presented. In their proposal, the team has shown that they have thorough research regarding the crypto payment service in Africa with such a long list of problems such as the Lack of cryptocurrency exchanges that support trading in native fiat currencies, Lack of beginner-friendly investment and trading UI/UX, Lack of crowdfunding Portal, and so on. With that being said, the team has articulated very well how they will solve it with Ennarea – a digital asset exchange and management platform. It’s important that the team mentioned this platform is ideal for beginner-level traders and has a simplified and easily understandable UI/UX design since its aim is to solve a problem in a market that’s still very new to crypto digital payment methods. But it doesn’t just stop right there since they also provide a platform version for pro traders at the same time. In my opinion, it’ll certainly keep the platform developing with balance. The team also points out the risk when it comes to regulation in certain African areas like Somali or Eritrea as well as the language barrier between different areas. And I can see how they have their idea to solve those problems. Overall, I think this proposal addresses the challenge very well and the team has done a good job introducing the idea.  ", "q0r": 5, "q1": "\"\nThe roadmap is delivered with great details such as activities and milestones and is greatly aligned with the project’s target. The team has a complete vision of how the work will be done and what they have to achieve to reach the final line. However, I want to suggest to the team to give us a specific timeline for some major activities since the time period of each phase lasts for a year or more. It’s a huge time gap and it’s better to show how you’re arranging your task around that time budget. For instance, from Sep 2021 – Jul 2022, the team plans to work on processing business registration and license. Then they can also provide more detail on how long it will take to get that done. That way, it’s easier for the community to follow the work progression (especially when the project is going on for a few years) and also more helpful for the team to keep track of their own work. On the bright side, the budget breakdown is presented with such great detail and we can see how it follows closely with the project and its milestone so we can all justify the requested fund easily. And last but not least, with team member introduction, I want to suggest to team introduce more of their members’ skills and working background so that we can see more potential of this project in terms of feasibility. \n\"", "q1r": 4, "q2": "For auditability, the proposer has done a great job with building a set of key metrics. They also set very specific time-related KPIs. And I personally believe that the community will have minimum problems auditing this project in the future. I don’t have anything to comment on this part, however, since it’s a very ambitious and promising idea that’ll be going for years, I somehow expect to see more of some long-term KPIs and see how the team vision in many years to come. ", "q2r": 4, "assessor": "z_assessor_2989", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8579, "q0": "Concerning the problem statement, this proposal addresses the lack of payment integration and processing services, which makes accepting ADA payments and Cardano-based stable coins in most African nations impossible. To address this, the proposers propose Ennarea, which offers a merchant service for companies to accept and process ADA and Cardano-based stablecoins and will let users spend their crypto assets for products and services. The proposal clearly includes certain statistics proofs based on the numbers provided by the proposer in the problem identification. Furthermore, the overall plan is intelligible, the solution appears to be accurate and in accordance with the problem statement, and the proposal's key metrics correspond with the defined challenge settings. It's also beneficial that the team explained how the proposed solution will address the problem, as well as a vision of how the Ennarea will function. Additionally, the team anticipates some problems on the way to delivering the project and provides solutions to mitigate them, which I believe is very important overall. The fact that the team will hire an experienced lawyer to fulfill several African nations' service compliance has given me confidence that they know exactly what they are doing with their plan. In conclusion, the idea is significant for the Cardano ecosystem and has the potential to scale if successful.", "q0r": 5, "q1": "The proposal's core team is fairly transparent, and their public profile is shown below. I always like it when proposers put links to their profiles since it gives me piece of mind and adds legitimacy to the entire project. They have a good sense of the team they need to build they have already done, and they have a decent understanding of how long it will take to complete all of the tasks outlined in the roadmap. Furthermore, the criteria are reasonable, and the long-term goals provided demonstrate that the team has a clear picture of what success would look like for them. The project comes with a strong, well-defined plan that is broken down into periods. Given the timing and goals, the proposal's plan and implementation seem plausible. The proposal could have done a better job of presenting the technical elements, but this isn't a significant concern. Milestones are achievable, and the tasks accomplished at each stage are well-defined. I have no difficulty deciding the project's feasibility. There is a very clear image describing the project's implementation. This is very welcomed. The budget allocation of finances is well specified, with five identifiable components. It could, however, be a little more informative. For example, in terms of talent acquisition and team member expenses, there is mention of how many individuals are needed for each role and how much each role would cost in one year, but no indication of which professor will perform the role. Given the long time period and large amount of money required, specific details about team resources should be provided (how many hours will the team work for instance) Furthermore, a social media campaign will cost $5,300, which is not a small sum of money, but there is no way to ensure its fairness.", "q1r": 4, "q2": "Metrics are compatible with the proposal's success. KPIs are also mentioned, and they have received a lot of attention. This is one of the few projects that has measurements and KPIs, in my opinion. A legitimate success definition also includes a plan with milestones for three, six, and twelve months. The plan and milestones are clear and reasonable for implementation over a reasonable time horizon. The problem is obvious, and the solution is both obvious and readable. If a method was mentioned in order for the team to update the project's process to the community, I would give the auditability a score of 4!", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8679, "q0": "The main purpose of this proposal is to build an integrated platform that allows users to use ADA to conduct payments for expenditures and a manual deposit and withdrawal process for cryptocurrencies and fiat. The project will be implemented mainly in the African region, the author also explains why they chose this region as the main development market for their products/services, the lack of services provided Blockchain solutions while the market demand is high in Africa will be an opportunity for them to open up a potential new market with few competitors. Basically, this idea is in line with Challenge's key metric, entering untapped or low-exploit market niches could bring in a large number of potential users for Cardano if the project is successful. The two biggest risks that may affect the development of this project are language problems and legal issues as many countries in Africa may not accept and legalize spending cryptocurrencies. In the short term, the solutions offered are to hire local interpreters, the application supports multiple language choices, and deploy the service in areas not bound by regulations under the advice of a lawyer. These are very reasonable solutions and also represent the long-term development vision and expansion of the project of the proponent.", "q0r": 4, "q1": "I greatly appreciate the valuable information in the project development plan that the proponent provides, which not only clarifies the main work to be completed at the milestones but also clearly describes the main functional and architectural structure of the major platforms used for their services. Although this is a project that will last for many years, the proponent's ability to execute the project can be fully verified through their long-term development strategy, in which they clearly shape and organize year-by-year performance projections and make predictions about possible outcomes. This is not only a project development plan, but also a base that the community can rely on to track its progress. $350,000 is the total cost required for development and project management for the first year, and will be broken down to call for three different proposals. However, I have a question, if the author does not receive funding for all 3 proposals, will the lack of costs affect the works, since developing 3 projects seems to use the same material facilities and resources that were established at a total cost of $350,000. In terms of personnel, the proponent has proven their team is an expert in the field they pursue through summaries of the qualifications, working skills of key members, and descriptions of the actual people. They have also attached a Linkedin profile to increase the credibility of what they describe.", "q1r": 4, "q2": "The two essential pieces of information found in this section are tools for the community to stay up to date with information surrounding the project and a well-designed roadmap of milestones/indicators so progress can be measured for project development and success. I appreciate the relevance of the KPIs given and I believe that successful assessment and audit will be made easy thanks to them.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15361, "q0": "This proposal is a very good idea, the author raised the very current issue which is the inability to accept ADA payments and Cardano-based stable coins due to lack of payment integration and processing services. So the solution is that Ennarea Finance will provide a merchant service for businesses to accept and process stablecoins based on ADA and Cardano, and allow users to spend their crypto assets on goods. goods and services. There is clarity in the description of the problem and the solution presented and proposed by the challenge. If this proposal is successful, it will solve some of the problems of crypto payments in Africa. Ennarea Finance will be available in all African countries and will allow users to invest and trade digital assets using their native fiat currencies. The goal of this project is clear, and its impact has also been identified\nProposed three major risks in the project implementation and they also have appropriate methods to overcome them", "q0r": 5, "q1": "This proposal provides a roadmap associated with important activities and milestones, it can be seen that the project will last from September 2021 to January 2025. It can be seen that the team has a long-term vision for this project. Currently, the team has completed the beta and demo release phase. However, I would like to suggest providing specific month-by-month timelines associated with key activities (within the scope of this proposal) so it will be easier for the community to track the progress of the work.\nThe budget requested for this project is $40,000 allocated for tasks such as Office setup and decoration, talent acquisition and team member costs, data center hosting and development, marketing campaigns and events, and other expenses...In each task the proponent carefully broke down the costs into smaller categories, so we understood the numbers very well. What is the money used for?\nFinally, the project team is Team Ennarea which is a group of five passionate tech talents with diverse backgrounds. The team has proven its experience and project implementation capabilities, with an active crypto exchange being tested. In addition, the group also states their roles along with email and LinkedIn links to each member, so it is easy for the community to verify their competence in this project.", "q1r": 4, "q2": "The auditability of the proposal is scrutinized very closely. We can fully track the progress of the project because the proponent will notify the community on social media platforms as well as on blog posts on their website. There are several KPIs provided to measure the progress of a project:\n-Number of new users coming to the platform\n-Number of businesses registered to use the service\n-Amount of transactions made through the service\n-Number of daily active users\nThe success of the project is also well defined, the author has provided success levels for 3,6,12 months. I agree that the suggested success criteria and metrics are precisely set to measure progress in tackling the challenge.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Ennarea finance will provide a merchant service for businesses to accept and process ADA and Cardano-based stablecoins and will enable users to spend their crypto assets for goods and services.", "experience": "We are a team of 5 talented Engineers. 2 senior blockchain developers, 1 cloud solution architect, 1 marketing manager, and 1 business advisor. Our team experience is proven with a production-ready cryptocurrency exchange."}