{"id": 415895, "author": "michiel", "title": "Zero Knowledge Ads by Profila (1/4)", "url": "https://cardano.ideascale.com/a/dtd/415895-48088", "category": 26595, "amount": 174000, "description": "Today, companies serve Ads based on inference data and third party profiling data/cookies which are collected by tracking you. This tracking model is becoming illegal and sacrifices users' privacy.", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"id": 1639, "q0": "The proposal is very interesting and is well aligned with the objectives of the challenge. The problem here is the fact that companies serve ads in which users are obliged to provide their information (cookies) to third parties, even if they do not want to, so that they have access to some type of content. According to the proponents, this practice would be becoming illegal, but even so, it is something quite common nowadays. With this, we observe that the proposed idea is precisely to solve this problem through a Dapp, from what I understand, called Profila. The idea would be what they called “zero-knowledge advertising”, a solution that preserves users' privacy. This would be done through specific ads that would not place the data that is normally requested. The platform would be decentralized, using Cardano's blockchain for such information to circulate (at least I understood that; it would be beneficial if more explanation had been given regarding how this platform would use Cardano's technologies in practice). I believe that the platform would be very useful mainly for end consumers, as they would use several advantages, such as “decide when to see an ad (if any), which company can send such content (paid), if the company has any information about you (or if it is done in complete anonymity)” and so on. Not enough, other advantages would be presented to the user, for example, they would receive an amount paid per ad they would watch (I found this idea very innovative. Would the amount be paid in Ada, would it be that to use Profila users would have to create digital wallets ?) The platform would also present advantages for companies, as mentioned by the proponents, such as: “obtaining anonymous but accurate and perennial customer data directly from the customer connected to your brand, sending personalized offers/advertisements to the customer without data leakage, improving targeting, reducing ad fraud and adhering to regulations as the customer remains completely anonymous” and so on. Overall, the idea is fantastic and sorely needed to break the cycle of bad publicity that has been going on lately. However, I really think it should have been clearer how our blockchain technologies would be used. Proponents claim that the proposal addresses the challenge since the ads would be linked to the blockchain for audit reasons such as fraud. Like this? Overall, the proposal meets the objectives of the challenge well, as is clear in the excerpt “The challenge is this: \"What dapps, products and integrations can be implemented to bring impactful use cases to the Cardano ecosystem that help drive more adoption \"? Profila's DeMar platform will provide businesses (small to large) around the world with a new privacy-preserving alternative to communicate and advertise to their customers.\" Due to this lack of clarity regarding the technologies of our ecosystem, I will give it 4 stars, if more explanations had been provided about this relationship, the note would be maximum.", "q0r": 4, "q1": "The established roadmap is moderately satisfactory. Mainly in terms of understanding how long each activity would last, the past level of accuracy is good. One suggestion I can make regarding temporality would be to establish when the activities would start. In what period of the year would the first week of work be established, and the second? Another comment regarding this part of the proposal is: the activities could have been better explained, in more detail. For example, we would have 4 weeks (from week 2 to 6) that would be devoted to design research. This is very relevant for the development of the project as a whole, so it would be important to better understand how such a process would take place. Another example: week 10 to 36 would be development, integration and testing. We have 36 weeks here, many months, and few words describing what would happen. Again, it would be important to have more information. I believe that the way the script was presented to us, I have an ok knowledge of what would happen, but not such a detailed and solid understanding of how the process of developing this proposal would take place, in practice. So my suggestion is that each activity was better unraveled and also that we were sure about which period of the year (from 2022 and 2023, probably) this would all happen. In terms of financing, in my view, this part is very adequate, because we have detailed information on how the money would be spent. 174 thousand dollars are requested, a very high value. Well, speaking of the amount requested, it is divided into 4 parts that are also quite expensive, namely: Research and PRD development - USD 25,000 + Business analysis and UX/UI design work - USD 14,000 + 3. Project management and reporting overall - USD 15,000 + 4. Development and testing to delivery - USD 120,000. We also have some details about them, for example about the project management (30 days of project management and reporting @ 500 USD per day (2 weekly coordinator calls, monthly reporting, AMAs, townhall videos, closeout reports, medium articles, updates in weekly newsletters etc); the developers' work part is also very well scored. From the way this monetary information is passed, we can judge whether the value is fair or not, as we have information so that we have a solid understanding of how that money would be divided and spent. Finally, speaking as a team, from what I've observed the information is passed differently according to the team member. In some cases I fear an extensive and very detailed curriculum about the person; for others, we only know what role he is delegated in. Ideally, we would have the same level of detail for everyone. However, some team members have very rich detail about themselves, such as example in “MICHIEL VAN ROEY, (Co-founder, Crypto-legal and decentralization expert and Chief Legal Officer); Belgian, 10 years XP as EU-qualified business lawyer in international law firms, an international organization (CERN), and a multinational company (Cisco), etc etc”. With this we managed to have a good degree of trust in those involved. Overall the topic is good but we still have things to improve.", "q1r": 4, "q2": "Speaking of progress monitoring, we have good information on that. Proponents are concerned with outlining various KPIs, as well as clarifying how this information would reach the Cardano community. There are really many different ways we could track the progress of the project. For example, the technical parts could be directly followed through updates to the Github repository. The general aspect, that is, details about the daily life of the professionals involved, would probably be presented during the participation in a call with the Catalyst coordinator; not being restricted to it, however, since newsletters would also be prepared fortnightly. In general, in relation to the audit of partial results, I believe that there are no observations to be made and what is said is enough for us to carry out a good follow-up of the phases - both in relation to the partial results and the tasks that will be developed, so that these can be achieved. Finally, in relation to the final success, this is defined with the creation of a “viable prototype for replacing third-party cookies”, as well defined by the proponents; this is further detailed in the excerpt “POC success is a targeted ad served from the Profila Ad Server, through a peer-to-peer mobile network to an anonymous person in the Profila app, with the ad server/brand and people Anonymous Ad engagement (impression and click) connected to blockchain for auditing (reducing chances of ad fraud). It is noticed that the proponents think about the final goals totally focused on the realization of the Dapp, or at least for the launch of its prototype (\"TRAFFICKING STRATEGY - Mid-to-high market contextually relevant open exchange inventory with reasonable balance between reach and quality + AUDIENCE STRATEGY - Start with contextual targeting and then retarget those that have given permission with run-of-exchanges, etc etc). However, it would be essential that they also look at how to perceive everyone in advances in relation to our blockchain. How would this project contribute to the popularization of Cardano? It would be important that some data such as: 1) if new digital wallets were created, linked to Profila users 2) if they would be receiving rewards in Ada 3) if these people somehow became more interested in the blockchain universe and started to explore other projects and aspects of our ecosystem… In short, if the objectives of the challenge would, in the end, be met. So I think auditability is pretty good in terms of progress, but fundamental issues aren't thought through for the final scenario analysis.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 8, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1457, "q0": "Very few projects have the potential to disrupt a a trillion dollar industry. Profila attempts to do this while simultaneously empowering individuals to own and monetize their own data. If successful, this bold project could result in a perfect marriage of Self Sovereign Identity and personal control of advertising exposure. Brilliantly constructed to adapt to the necessary regulatory threats to data mining, Profila seeks to subvert the dominant paradigm by engineering a mutually beneficial alternative. Participants of this program can choose between payments in fiat, Ada and Zeke (ZKA Token) as a reward for allowing advertisers to share only the content the end user agrees to. This could very well become one of the most creative and impactful uses of Atala Prism, and could also lead to mass adoption of the Cardano blockchain. Their revolutionary concept of Zero Knowledge Advertising (ZKA) shields individual identity from advertisers that individuals choose to receive ads from. Profila’s proposal extends beyond alignment with this challenge and the mission of Cardano, it is deeply intertwined and virtually inseparable. Indeed, the future of both entities may become magnificently interdependent.", "q0r": 5, "q1": "Profila’s stellar team is perhaps the most experienced team I have encountered, and recent changes have only bolstered that reputation. Having achieved a remarkable 75% funding success rate in Fund 9, it is obvious that the community has a lot of faith in this project as well. Any time you attempt to slay a behemoth, success in not assured, but for the task at hand, this team certainly has the qualifications. After successful completion of their first project, some of the deliverables were temporarily stalled, and the leadership of Profila stepped in to clear the obstacles. No other project I have reviewed has captivated my attention as has Profila, so after a very deep dive and extensive communication with multiple team members, it was made evident to me that the organization had the dexterity to pivot, and all the pieces were in place to assure success. The core team has demonstrated a strong commitment to progress as they have not been afraid to upgrade their team when necessary, despite having a very strong team to start with. IOG support at an institutional level combined with long term research partnerships with the Universities of Luzern and Madrid instill even greater confidence in this assessor that failure to execute will not be tolerated.", "q1r": 5, "q2": "Having a perfect monthly reporting record with Project Catalyst never hurts, but attention to detail mandates that a quality assessor must leave no stone unturned. After a rigorous audit of Profila’s KPIs, a few areas of concern were noted and the Profila team was contacted. Core leadership personally responded very quickly and provided a clear, comprehensive and transparent rationale that adequately addressed all concerns presented. For example, the promised deliverable of the newsletter was difficult for the assessor to locate and after an inquiry, all of this years newsletters were delivered directly via email. This current project specifically funds marketing, reporting and community engagement in the form of project management. Every effort is made to establish and maintain a high standard of KPI’s, and in the event of any concerns, the project leadership is willing to go the extra mile to provide whatever information is requested. With this level of cooperation, verification is all but assured.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6664, "q0": "The online advertising industry utilizes extensively the dreaded cookies in order to deliver the ads to the users, and this is a business model that comes under increased pressure both from users as well as from regulators, especially given the concern regarding data privacy rights. \n\nProfila comes yet again with an innovative solution of zero knowledge advertising, a solution that preserves the privacy of user information while at the same time enabling personalized ads, with less interference from third parties. There seems to be a blend with the best of both worlds here. \n\nIf such a solution can be technically feasible, practical and cost effective given the network’s transaction costs and the way the proof of advertising will be stored on-chain, we have in front of us a concrete real life use case that can definitely increase the adoption of Cardano among businesses and end users, with great scalability potential (once proof of concept will be validated the solution might be as ubiquitous as an off the shelf feature) and thus five stars for its potential impact and connection with the challenge. ", "q0r": 5, "q1": "Profila is a marketing platform with extensive privacy features that allows its users to interact with companies while controlling their own data. The platform is live and the project has already received  funding from as far back as Fund6. A strength of the proposal is the fact that Profila has teamed up with a research team from the university of Madrid and with the Santander Big Data Institute. Having academic partners next to you when implementing a business solution can sometimes be a very smart idea, especially when the feasibility and I think even the mathematics behind the solution are not one hundred percent complete. \n\nFrom a technical standpoint, the proposal is complemented by a research paper and general presentation, and there are sufficient details for anyone to understand how the business model is designed to work and what kind of activities are necessary to finalize the project. The timeline is extensive and stretches over 54 weeks, out of which the first 10 would be preparatory / research focused, and week 36 would see a first mvp ready for testing.  The development part would be performed by Mlabs, while Steppechange, a Silicon Valley company, would assist with the zero knowledge solution. \n\nThe budget is reasonable given the complexity of the solution, but I would have liked to see at least some exploratory figures regarding the long term financial sustainability of the product. Will the team be able to roll it out successfully, what kind of pricing can such a solution entail, and how long until financial sustainability? \n\nIn any case, one aspect that I really appreciate is that Profila recognizes that this will be a long term effort and the following financing rounds will see additional requests from their side. This is a very good attitude, especially since they haven’t, like other enterprises, crowded this funding round with several proposals which can only be implemented in succession, and not in parallel. \n\nProfila is already a known name within the community, and here we have again a very feasible proposal from their part, with a good team, great partnerships and a budget that makes sense. Five stars. ", "q1r": 5, "q2": "The auditability part is very good as well. Profila pledges to offer the community periodical progress reports,monthly github updates, monthly progress reports as necessary and monthly swarm attendance for Q and A sessions. \n\nAnd since Profila is part of the advertising industry, they bring forth a few very specific indicators highly relevant for their sector of activity: impressions, clickthroughs, contextual performance data, etc. They are well connected with existing projects funded under Catalyst as far back as Fund 6, with many of the projects being also dependent - so they are already familiar with the standard operating procedures and all the processes set-up by IOG / the community to ensure consistent reporting. I therefore see low risks of the community not being able to properly monitor this proposal. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7531, "q0": "Recommend to meet challenge settings. By providing experience-based companies serve Ads based on inference data and third-party profile/cookie data collected by tracking you. This is the problem that needs to be addressed and it is related to this challenge. Profile's Zero-Knowledge Ads 1 privacy protection adtech solution it personalizes directly and does not leak any data to third parties and is under supervision. The author has measured the potential risks. project capabilities. The speed and cost of the Cardano blockchain may not affect the success of the project. The peer-to-peer ad serving model has privacy pros and cons, which need to be evaluated in the project, ads have no real knowledge or step in the right direction. Integration into the adtech ecosystem and the ad server requires high speed which may limit the scalability of the solution on Cardano.", "q0r": 5, "q1": "Success clearly describes the results to be achieved, long-term success is a viable prototype alternative to third-party cookies. This success is directly related to the challenge's campaigns if the project is successful the ad/brand server and anonymous people who interact with the ads can log into the blockchain for audits upon login will reduce the risk of advertising fraud. This proposal solves the challenge as it provides an application(d) for companies where ad delivery transactions are linked to the blockchain. I think the project will be successful and will produce the products as promised, benefit the farms and consumers, and help develop DAPPS on the Cardano platform. Profila's DeMar platform will provide businesses worldwide with a new privacy-preserving alternative to communicate and advertise with their customers.", "q1r": 5, "q2": "The team has been very transparent including a large list of partners and supporters, some of which include the likes of IOG, MLABS, and Microsoft. The team is made up of many authors who seem to have a wide range of experience and have a strong background, all of whom are from different fields but related to Blockchain. The team includes the following members:\n1 AdTech Guru & CTO -  Profila\n2 Business Process Analyst Profila - Mitchell Goodie\n3 Designer Profila\n4 Decentralized Director of Profila - Michiel Van Roey\n5 Profile - Team of engineers/testers.\nAnd a versatile team with experience in blockchain projects has the ability and commitment to tackle this challenge.\nConsists of MICHIEL VAN ROEY members with 10 years XP as a business lawyer, SHAWN BOONE JENSEN, with more than 20 years XP in senior management roles in ISP, SI and Telco organizations worldwide bridge, LUKE BRAGG with 20 years XP designing innovative digital solutions for complex organizations, LUKE BRAGG with 20 years XP designing innovative digital solutions for complex organizations, REMY MERCKX with 23 years XP in Travel & Hospitality, - most recently Senior Vice President of Global Digital & Marketing, CLARA-ANN GORDON legal advisor to Profila, ELIE AUVRAY co-founder of logion (public blockchain network), blockchain advisor to Profila, MIKKO KOTILA ad technology & software development specialist, PHILIP LAMS serial entrepreneur & Profila board member, sales & business advisor. All the main ingredients are given, this team is highly qualified and the team has also been funded from previous projects I just briefly listed the experience they have currently. The funding application budget is 174,000 USD, divided by the author into 4 development stages: research and development PRD - 25,000 USD, business analysis and UX / UI design - 14,000 USD, management Project and master report - $15,000, development and testing to delivery - $120,000. The author's budget is broken down into reasonable expenses.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8117, "q0": "I find that this project meets the challenge's large impact scale. Because it creates an application (DeMar) on top of the Cardano ecosystem, which aims to provide businesses (small to large) worldwide a new privacy-preserving alternative for communication and advertising with their customers. Currently, the ad tech market is growing, so with the application's features, if successful, the number of transactions on Cardano will be huge, considering the number of ads displayed daily. This will attract many new users and promote the growth of the Cardano ecosystem.\nThe \"zero-knowledge advertising\" solution is a privacy-preserving adtech solution that enables personalized advertising online, does not leak any user's data to third parties, and is monitored. By cutting out the middlemen and creating a data-sharing system that protects the privacy and distributes ads anonymously. The author has described the solution in great detail and argued well. I find that this solution is beneficial for consumers and brands. The author has also provided two explainer videos, \"Profila for consumers\" and \"Profila for brands\". Building this Dapp on Cardano will help the ecosystem to attract more users, and expand and grow.\nThe proponent stated three challenges and three risks when implementing this project. They also have solutions and reasonable explanations to minimize these risks.", "q0r": 5, "q1": "The Zero-Knowledge Advertising project is built in 4 phases (introduction - appearance - role-playing - evolution). This is the first phase of the project. The author has provided a detailed plan with specific timelines and goals. The roadmap is implemented in 54 weeks, divided into seven important milestones.\nThe project's budget is $174,000 (only 2.22% of the challenge's total budget). This budget matches the requirements of the challenge. The proponent has provided detailed funding. The budget is divided into 4 sections: R&D PRD ($25,000); Business Analysis and UX/UI Design ($14,000); Project management and overall reporting ($15,000); Development and testing to delivery ($120,000). Each expense is detailed and calculated in detail. The author has given the explanation and basis of calculation (average cost per day).\nThe members of Profilela are all experienced and qualified to meet the proposal's objectives. They have had a lot of projects funded by Catalyst before. I follow the team and know that in addition to this proposal, six other proposals are also submitted in Fund 9. If all are funded, the amount of work is quite large. I am concerned about the team's time management and work arrangement and whether the team can meet the schedule and ensure the work for each project. But there is no denying the creativity and hard work of the team. You guys have contributed great ideas to the Cardano ecosystem.", "q1r": 4, "q2": "This is a brand new project that has not previously received funding in Catalyst. But I found that the transparency of the project is shown quite well through the fact that the team will provide the community with detailed periodic progress in ways such as Updated the Github repository (1 time per month, after Initial scrum sessions to generate PRD, product requirements document; Bi-weekly update for other Cardano proponents via Catalyst coordinator call; Bi-weekly update in \"The team's Cardano project\" (register via their website); Monthly project process and KPI reports sent to Catalyst team and public for verification; Monthly Swarm session at office hours (at the bottom) town) for a Q&A session on team sponsored projects; Periodic AMA by Profila founders to talk about project progress. However, it would have been better for the proponent to provide more metrics that the community needs to care about so that it can be easily measured and checked each time the project's updated information is viewed on those communication channels.\nSuccess in the long term is a viable prototyped replacement of third-party cookies. POC Success is a Targeted Ad served from the Profila Ad Server, through a mobile peer-to-peer network, to an anonymous person in the Profila App, with the Ad Server/brand and other anonymous people Interacting with ads (impressions and Click-throughs) are logged into the blockchain for auditing (reducing the risk of ad fraud).", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 14726, "q0": "\"With the emergence of the Internet and blockchain, privacy is an important term nowadays. We are all annoyed by being data tracked by the apps we use, or problems regarding to third-party cookies for marketing and selling purposes. Profila, thanks to it Decentralized Marketing platform, customers can control over their data (what to share with what companies) – customers can remain anonymous if they want, and the ads they see. Moreover, customers can directly connect with brands, removing the roles of intermediaries. One interesting feature is that consumers get paid to see an ad as Profila shares 50% of ad revenue. The proposers clearly explain how the system works, and how the platform could be beneficial for both customers and brands. \nIn terms of the risks, I do agree with the proposers that there may exist the bottleneck between huge customer data and the scalability & speed of Cardano blockchain. Also, the anonymity features may be the disadvantage of this platform from the companies’ side. The proposers did not address the solution in accordance with each risk. \nIf the project is successful, there will be a significant boost of customers as well as companies into the Cardano ecosystem; thus, from this point of view the solution is aligned with the challenge.\"", "q0r": 4, "q1": "\"The proposers listed out the tasks needed in the determined time by weeks. To make the proposal clearer, it could be better if the proposers broke down the sub-tasks needed for phase and specified the exact date for each task. For example, in Week 2-6, the system design may be divided into several sub-tasks such as conceptualizing, researching, team meeting, etc. \nThe budget was provided by three categories: Research and PRD development, Business analysis and UX/UI design work, Development and testing to delivery. This financial report could be improved by giving detail explanation about the budget calculation, for example the how does the Research and PRD development cost $45,000? Moreover, by dividing these categories into smaller categories, and then allocating the money conforming with the tasks provided, the proposal is more clarified. The more clarifying the proposal, the higher the feasibility that the readers can perceive. \nIn my opinion, this team members consisted of highly experienced individuals with strong backgrounds in AdTech and blockchain, and their work experiences fit with the demand of the tasks, so I have no comments about the human resources. \"", "q1r": 3, "q2": "\"As a sign of the project's integrity, the team will occasionally update the community (including GitHub, the Catalyst team, etc.) on its development. \nTo make the project clearer and simpler to audit, I would want to advise the proposers to state what KPIs/metrics the team uses and what numbers they hope to attain in a given time. Without exact KPIs/metrics, it is difficult for the community to audit the project. For example, after one month of project launching, there are 1000 members ranging from companies and customers.\"", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14947, "q0": "I really don't like how tracking centric platforms like Facebook and Google collect users' data. So I was impressed by the idea of this project. After going through this proposal, I'm waiting for it to be born. The proposal overall meets the challenge, I think. The way the proposer gave the number of 455 billion USD makes it stronger and clearer, and proves that it does have a big impact on community, especially on Cardano community. The proposal also gave the link of the scientific research paper that their project based on, showing that they're quite well-prepare and put a lot of effort into it. Besides, the team members also did 2 videos to demonstrate the project for both consumers and brands. However, this makes me quite confused about the main objective of the project. From the project, I understand that their main objective is both consumers and brands instead of just one of them. I think the proposer should make it clearer a little here. What the proposal need to add more here I think is the solutions for main risks and challenges that the proposer listed.", "q0r": 4, "q1": "The plan and timeline is quite detailed, howerver, the budget breakdown part is too meager and not clear. It hards for the community to consider if the cost is suitable or not. I think it should be more detailed and breaked down into smaller part follow the timeline or some periods of time, or the working hours of team members or the activities. This is a proposal for calling for funding, so the money part must be transparent.", "q1r": 2, "q2": "In this auditability session, the proposal seems not to be really clear. I think the proposer should tell which tool they will use to track the project's progress and manage the project. However, they did demonstrate how they help the community follow their project through Github, newsletters and so on. Besides, the proposal should also set some numbers as a goal for the success criteria instead of just explain it and gives a profit expected range to help voters consider it easier. I see that in the impact session, the proposer said that the project expect to reach USD 982.82 billion by 2025, so this should be include in this auditability session.", "q2r": 3, "assessor": "z_assessor_4114", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Profila proposes “zero knowledge advertising” (aka the \"cookie-killer\"), a privacy-preserving adtech solution enabling personalized ads online, w/o surveillance or leaking user’s data with 3d parties.", "experience": "Privacy/Tech lawyer + AdTech expert + team of (20+) industry experts with marketing & privacy expertise from multinationals. AdTech research partnership with Uni. of Madrid (big data institute) w. first publication on ZKA (see attachment). Product bèta-ready, pilot ongoing."}