{"id": 415976, "author": "joey.marchand", "title": "Indico: Knowledge Brokering", "url": "https://cardano.ideascale.com/a/dtd/415976-48088", "category": 26595, "amount": 94000, "description": "Cardano's community has a great deal of knowledge that remains unshared. There is no clear, safe, and easy way to share this knowledge, resulting in a lack of efficient collaboration.", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 1640, "q0": "Yes, definitely the proposal is extremely relevant for Cardano. Due to lack of adequate knowledge sharing (proponents claim there is a problem where people are commonly encouraged to gather information from public/general documentation, but are not encouraged to contribute to this mass of knowledge accessible to all. So to solve this, a dApp would be created, fully focused on collaboration between parties, being “a decentralized search and resolution network for Cardano. A seeker-solver network is a collaborative system where problems are presented and solutions are exchanged in exchange That is, the participants would determine the value of the knowledge they exchange, providing solutions to problems, the platform would then be focused on sharing knowledge, receiving rewards and promoting solutions to pre-existing problems. This network has a name : “a seeker-solver network is a collaborative system where problems are presented and solutions are exchanged in value exchange”. As our community is growing more and more, many proposals are funded and knowledge that could be valuable for mutual success among them is not shared, so this solution would increase the rate of innovation and accessibility for participants in the Cardano ecosystem, as the proposers claim. , accelerating the adoption of our technologies due to user integration. In my view, the topics that would be directly addressed in the challenge would be: “Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or usage increased by the community”. Despite the dApp being a new technology, like it or not, we would be dealing with things that already exist (knowledge that would already be generated, but not shared). It's positive how well the proponents put us on their experience (they say they've already been contacted by IOG to solve an internal documentation problem, and that's where a company was born). They have experience in knowing that this is not an entirely unique problem for IOG, and that a blockchain-enabled ecosystem would prevent problems that are already happening from happening again, as explained in the excerpt “In traditional ecosystems, the tragedy of the commons is frequent. The tragedy of the commons refers to an economic phenomenon where individuals are encouraged to extract value from shared resources, as an index of knowledge, but are not encouraged to contribute to the shared resource”. For these reasons, I think that the proposal deserves maximum marks in terms of impact, in addition to all the possible risks are well thought out and previously mitigated.", "q0r": 5, "q1": "The script is a little confusing, we have a few milestones, but we don't really know how long each one would last (we only know that the first one would last 9 months). Several achievements are cited such as: “Secure funding, Contract with development team for blockchain infrastructure, Complete UI concept/design, Proof of concept completed, Coded backend, Launch demo to Cardano community, Web development /software/app (probably web)” and so on. But it is not so clear what the activities behind these partial results would be - in addition to knowing what would be generated, we would need to understand how it would be generated. So I suggest that there is a reformulation here, that we know what would happen in each of the months (building a more solid timeline is important), and that these achievements are related to activities, with work routines that make them possible. Moving on to the next topic of analysis, which is the use of funding, the $94,000 is split into a few parts, such as the Full Strack developer salary ($24,000 - what would be the hourly rate? Also contract audit intelligent, it is not explained why this would cost 20 thousand dollars; I think it is very positive how the proponents attach the average salary of the professionals involved, for example in the excerpts “Marketing Leader - Dylan Benedetto = $8,333.33 (35.75% of typical US marketing leader annual salary of $93,251) + startup CEO - Teagan Pennock = $8,333.33 (16.27% of typical startup CEO annual salary of $204,898).” This gives us a sense of fairness about the prices charged. I think it would be important for us to know the value of their working hours and also the explanation of more specific expenses such as the audit issue, but in general our understanding of the budget use is solid. And finally about the team, this pa rte is very good, we know in great detail who are the professionals involved (for example about Matt Skrlac: “Matt is a Senior at UW seeking a dual specialization in Economics and Finance with a specialization in Blockchain. He spent 4 years as a US Army Combat Leader before starting his college education. He helped lead the formation of a Veteran Non-Profit. His experience includes: Team Leadership, Resource Allocation, Logistics, etc etc). We also have people here who are experts in Cardano's blockchain technologies, for these reasons I think the team presentation part is the best part of this topic. The proposal is viable, only the script could be more adequate.", "q1r": 4, "q2": "The auditability of the project is good. We know that progress would be measured based on milestones, consultants work deadlines, MVP (Minimum Viable Product) release, etc. It is also said that user feedback will be the main metric of success, and that “we will conduct user feedback surveys at regular intervals during testing and after implementation to ensure the best user experience for the majority of the community. We plan to publicly publish the survey results on a quarterly basis.” In addition to the results of these surveys, which in my view correspond to the monitoring of partial results, it would be appropriate if the work routines could be better monitored, for this it would be necessary for us to know more about the activities behind the successes mentioned in the script. It is necessary that the proponents go further in this regard, in providing us with means of auditing what the professionals would be doing in their daily work in relation to the project - it is necessary to establish some communicative bridge with the Cardano community, in order to understand these achievements , these advances, even if sensitive (I think it would be more appropriate for such information to be released at the end of each month, and not quarterly). Proponents go on to explain how they would track partial results: “We also plan to track unique user interactions with the Indico system. We will gather information about the number of unique user wallets and relevant interaction data to determine a number. This will be a useful number for evaluating system integration and usage statistics to determine new features”; therefore, our focus of improvement here would really be in terms of activities/work routines. Success can be measured based on a few deliverables: “Successful deployment of smart contracts on Cardano Mainnet + Launch of a fully functional web application (dApp) + Successful audit of all smart contracts in the system + Successful deployment secure API + Full functionality in the user experience, from the web 2 interface to the basic contracts, without failures in the transactions” and etc. We are very knowledgeable of what a successful project would look like, the overview explained is detailed, broad and deep - nothing superficial and abstract. With that, the only thing that really remains pending is: through which communication channel will all this information be passed on? I would like to suggest that the proponents carry out a general study, including all this data, and provide it for our knowledge through discord, or telegram, youtube, townhall presentation, onine tools like notion, miroboard, google docs and etc. It is necessary that all this is easily palpable by the Cardano community. With that, the topic is adequate, needing some improvements here and there.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Thank you for taking the time to give us this excellent feedback. The impact and alignment comments match perfectly with our intent. We see the lack of proper knowledge sharing as a detriment to many organizations. Unlocking the full knowledge of the many great people building out this ecosystem is critical to its success in our opinion. \r\n\r\nThe team understands the concern around more specifically defining the feasibility and breaking down the timeline more thoroughly. We’ll release more in-depth milestones with specific dates as we determine our capacity to build. Our work routines and progress posting for the public will also become available in the coming months. Thank you for your specific feedback in this section. We will be utilizing the suggested structuring and reformulation with month by month breakdowns in each of the categories you listed (timeline, milestones, activities related to the milestones, and work routines which align with each activity). \r\n\r\nAuditability is key to building trust with the community and having a clear communication method outlined is a needed addition to this proposal. I appreciate you pointing out this need. We have a youtube channel we will utilize for product specific updates. We are in the process of setting up a public google drive for our research we’ve conducted. In addition, we’ll be setting up a discord and telegram to push out announcements and progress updates. All of these information sources will be publicly available throughout the process and as proponents of blockchain we strongly believe in the need for transparency. "}, {"id": 8118, "q0": "The phrase \"knowledge brokerage\" helped me come to with this proposal. The name partly helped me visualize the idea of ​​​​the proposal. \"Brokerage\" is no longer a strange thing in the traditional economy, it is considered an act of mediating between parties to meet, contact, and negotiate to establish specific relationships and benefits. However, it is completely centralized and controlled by an intermediary (called a broker or brokerage center). In this proposal, brokerage activities are carried out through a decentralized Dapp built on the Cardano ecosystem. The broker object here is \"knowledge.\" Knowledge of Cardano and blockchain technology is very broad and numerous. Sharing knowledge with those who really need it is extremely important, both parties benefit and increase effective collaboration. From those things, I see that this is a great proposal, meeting the requirements of the challenge, large scale of impact and very important for the Cardano ecosystem in particular and Blockchain technology in general. The success of the project will help attract more programmers, engineers, academics, etc. to monetize their experiences and abstract ideas. Attract more developers to the Cardano ecosystem because what they need is available. This effective collaboration will create a good effect on the sustainable development of Cardano.\nBesides, the team has also anticipated the risks that may be encountered during the project implementation. These are the risks of initial cost, critical community acceptance, user data & IP security, and other unforeseen risks. They also have the right solution to mitigate these risks. I appreciate the impact presentation of the team.", "q0r": 5, "q1": "The project roadmap is clearly presented. The plan is very detailed. There are 3 important milestones that will complete at the end of Fund 9, fund 10 and fund 11. Mainnet launch within the next 9 months.\nThe proposed budget represents only 1.2% of the total Challenge budget. The author has provided a copy of the budget with very specific calculations and detailed. The budget is broken down into small amounts with an explanation and basis for that calculation. I find this budget allocation reasonable.\nThe information about the project team impressed me. They are students (first year, final year, college graduate) of the University of Wyoming but very active, with great will and vision. Information about group members has also been presented relatively fully (experience, capacity). They have a close relationship with the Blockchain & Digital Innovation Center, director Steve Lupien and have a current relationship with IOG. The project's advisors are all qualified and experienced people in the blockchain field. I found that the team perfectly suited the goals of the proposal. But it would be better if the author added the link to the members' personal profiles (Linkedin, Github, Twitter...) to make it easier for the community to verify their identities.", "q1r": 4, "q2": "This is a brand new project that has not received any funding in Catalyst before. Therefore, this system will only be useful when community members interact with it. \nIn my opinion, the way to measure the progress of the project is transparent and effective. They gave measurement indicators. Those indicators are: meet the timelines and ensure project feasibility. The minimum viable product will be measured against specific predefined features. They care a lot about the amount of user feedback and the number of community contributions to improve the system. They care a lot about user feedback and community contributions to improve the system. Publishing the results of the quarterly user survey increases the transparency of the project and increases interaction with the community. The author has also provided the project's communication channels for the community to follow such as websites, twitter, youtube.\nThe success of the project is described in great detail. This includes the completion of a viable product and a continuously growing user base on the Cardano network. It will then develop further, adding new features. The project gives the KPI of the assigned product, stability and user commitment. It was detailed in the proposal.", "q2r": 5, "assessor": "z_assessor_2956", "no_vca": 7, "ne": 4, "ng": 2, "nfo": 1, "vca_o": 2, "reply": "Thank you for taking the time to give us this excellent feedback. This project will most definitely bring in new users to the community and I appreciate you pointing this out. The links to our linkedIn profiles are now available in the comment section of our post. This was an oversight on our part and we appreciate you pointing this out as transparency is vital in this process. \r\n\r\nTo help even further with the auditability of this project we plan to release the feedback data on a monthly basis as opposed to quarterly. This increased engagement and transparency is all about building for the community and with the community. Your assessment provided us some great feedback and we hope to improve based on this."}, {"id": 9928, "q0": "Exchange of valuable information has traditionally been facilitated by some hierarchical structure like companies or IPR systems. The rise of decentralized infrastructure is providing new kinds of scalable and widely applicable tools for free markets to take over many of these tasks. \n\nThis proposal aims to take advantage of that and build a system where several types of knowledge workers are incentivized to participate and benefit. Immutability of the contributions creates an option kind of situation where, any new information about the impact of this action, changes the value for the contributor too. In addition, when new tools to utilize the information about the created value become available, the contributors benefit even more. With the right incentives there is always a supply of solutions wherever the progress can be made. \n\nI think that the most powerful implications of this project is that it does not only improve the knowledge sharing and collaboration within companies but enables dynamic communities to self organize problem solving freely without having to incorporate the process. It means that more people can participate, more different types of endeavors, apps and services can be started and more activity on these decentralized platforms. The proposal is extremely well aligned with the Challenge.\n", "q0r": 5, "q1": "The roadmap provides details for the basic deliverables with the main tasks and time estimates. When I mirror the budget information against that, it looks reasonable but this proposal covers the estimated costs only partially. Even though the proposers are confident about the availability of other funding sources, I am just wondering what is the risk regarding this. \n\nThe information about the proposing team is verifiably documented. They have capabilities needed to work on this project and to find the right people and help when needed. Currently there is not exact verifiable information about the implementers of the technical blockchain components. \n\nThe adoption of a platform of this type is highly dependent on the final user experience. A lot of testing and feedback would be important already in the development phase to keep the progress in the right direction. Since the project has started from the real problem and a need for a solution, engagement and feedback should be available. \n", "q1r": 4, "q2": "The roadmap describes clear milestones which can be used as target steps on the progress. Some specific source for regular development updates would be a great benefit. The user statistics is, naturally, going to be used to measure the adoption and to assist in the design decisions. The regular user surveys carry a lot of value if there is enough involvement. \n\nNumerous quantitative and qualitative KPIs for different subjects are listed to measure the project success over time. As the role of these kinds of collaboration and knowledge platforms are likely to increase in the future, it could be interesting to observe the market as a whole and perhaps estimate this project's impact on that larger ecosystem.\n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to give us this excellent feedback. We appreciate your comments on the alignment of our project with the challenge and your appreciation for the impact this dApp would have on our community. The risk surrounding funding is valid and we hope to mitigate this risk with clear communication of our financing status throughout the project. This will allow the community a clear picture of where our team is at and our needs to allow us to meet deadlines within the time frame we’ve set. Our skills and our relationship with IOG, the University of Wyoming, and the great community here in Laramie, gives us the resources we believe we’ll need to meet the expectations of the Project Catalyst community and to see this project through successfully. "}, {"id": 15187, "q0": "I'm rating this as 5 because I think it is good idea. They intend to develop a dApp that will be more like a store for invaluable knowledge that will be relevant to project development and innovations in the ecosystem. As asserted by the proposers and I agree, though a number of ideas have been funded (or even if not funded, they ideas that have been brought to bear in the community), innovators and project developers either go away with the knowledge or for lack of proper documentation the community loses the tones of knowledge to come in everyday. A knowledge \"store house\" as presented is a perfect solution. The fact that developers, proposers and other community members can monetize their knowledge will encourage many to want to share valuable knowledge for collaboration in the community.", "q0r": 5, "q1": "The proposers have presented a 9 month plan that includes key milestones and timelines attached. The requested fund is 94,000 which is about 1.2% of the total challenge fund. In my opinion it is a reasonable amount. The budget is clearly outlined, listing all activities and resources necessary for completing this project. The proposal presents a great team with sufficient experience and skills relevant to the implementation of this proposal but there are no links to individual bios. Nonetheless Twitter, LinkedIn and website links for the company have been provided. Main risks have been identified and steps to solve them are fine in my opinion. \nI think if this proposal is funded it will be implemented successfully ", "q1r": 5, "q2": "The key performance indicators are clear and will aid auditing. The success metrics have also been outlined and they are measurable in my opinion. Their budget breakdown is clear enough and will enhance accountability to the community. They indicate that surveys will be done to receive feedbacks on user experience. I give 5 for auditability.", "q2r": 5, "assessor": "z_assessor_2679", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15253, "q0": "According to the proponent, Cardano's community has a lot of knowledge, but there is no safe and easy way to share this knowledge, resulting in a lack of effective collaboration. The solution is to build a system that encourages people to record knowledge and promote cooperation in the sharing market. A dApp will be created, entirely focused on collaboration between parties, as the \"decentralized search and settlement network for Cardano. Indico is a blockchain-powered ecosystem that allows an individual or company to monetize a process or knowledge and provide ongoing royalties as used by other members of the community. Encouraging documentation of knowledge and successful processes will create a collaborative marketplace and strengthen the entire Cardano ecosystem. A clear and understandable solution was provided in the proposal to clearly describe the targeted problem, the proposal perfectly aligns with the objective of the challenge.", "q0r": 5, "q1": "In the roadmap, the author mentions 8 milestones and spans from Fund9 to Fund11. This means that after fund9 is funded, the team will come back with the next 2 funds. The author also gives us the to-dos for 9 months. However, the tasks listed are very clear, but we don't know how long the milestones will last. If so, it will be difficult for us to determine how the project will proceed and whether it is feasible or not.\nThe $94,000 required budget is very well analyzed. We know the budget will be used on tasks such as development contracts, Smart contract testing, and paying project members within 3 months. In my opinion, the required budget is reasonable.\nThe final project team in question was a group of business students and graduates from the University of Wyoming blockchain program. Through what they offer I believe they have the necessary experience and knowledge to carry out this project", "q1r": 4, "q2": "The community can track the progress of this project based on the milestones the proposal has provided. The proposal also takes user feedback as a measure of success by conducting surveys throughout the testing process. The publication of the results of the quarterly user survey helps to increase the transparency of the project and increase the interaction with the community. However, in my opinion, providing a quarterly report is too long, the proponent needs to shorten this period to months so that the community can more easily monitor this project. And on the success of the project, the proposal also outlines the key KPIs of the dApp product and the stability of the application, and the number of committed users. I look forward to seeing this idea come to fruition.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We are solving Cardano's lack of collaboration by building a system that incentivizes everyone to document knowledge and drive cooperation in a shared marketplace.", "experience": "IOG had a problem with finding their own knowledge and working together across departments. As six students in the blockchain program at the University of Wyoming, IOG approached us to create a solution. Our project, Indico, is the result of months of work to solve the problem."}