{"id": 416231, "author": "cryptoloops", "title": "Flooftopia: NFT Interoperability", "url": "https://cardano.ideascale.com/a/dtd/416231-48088", "category": 26595, "amount": 15000, "description": "Cardano is a 3rd generation crypto that with a core value of interoperability, and only recently have a few projects embraced this quality. This core value needs to be expanded upon.", "f6_no_assessments": 5, "f6_rating": 3.4666666666666663, "videos": [], "media": [], "f6_assessments": [{"id": 1642, "q0": "The proposal idea is very good, but more detailed explanations about what should be done here are lacking. The idea is to achieve interoperability between various NFT projects, the center of which is the Flooftopia game. Proponents argue well the importance of the project when they claim that Cardano is a third generation blockchain and that it lacks interoperability, that is, our blockchain has technologies that can be very well used if different NFT projects relate to each other and even drawing a bridge. with other blockchains, as is the objective of the Cross-Croos Chain challenge, submitted in this same fund. The problem with this proposal is precisely that we do not have further explanations about what will be done. For example in the snippet “flooftopia will produce interoperability between multiple NFT projects. The first of these is AdaQuest, and it will provide value/interoperability to other NFT projects through the Flooftopia ecosystem.” How would this bridge between the AdaQuest and Flooftopia project be made? How can games with such different natures be related in a beneficial way, producing a mutual growth, a greater popularization of both? I believe that theoretically the idea fits the challenge because it could work on top of the following specific objectives, present in the scope of the challenge: “games - Number of players, generated player income (if you play to win), qualitative feedback on the game experience , etc + increase the number of dapps and products available for community use that help enrich the ecosystem with new use cases + increase the number of integrations that unite existing solutions for a more integrated and connected experience across different products” (mostly the last objective). So I think the idea is great and necessary so that Cardano can expand, so that more people know our blockchain and become active members of our community (for example, those who play AdaQuest and will know Flooftopia will use even more technologies from Cardano, as the last game is very focused on minting NFTs on our network). However, it would be necessary for us to understand better how this relationship would be built, not only with AdaQuest, but with the other 6 projects that the proponents claim would be interoperable (in the part of the roadmap, the total number of projects involved would be 7). How would each of the NFT projects be bridged, how would everyone benefit and would the challenge objectives actually be achieved? Talking a little more about Flooftopia, the project is very interesting, but it would be necessary for the proponents to explain better how the game is, so that the evaluators and voters who do not know the project can understand everything in the best possible way. I have already evaluated other proposals relevant to the game, so I understand that it is a game aimed at building NPCs (which would be CNFTs), which is a game of world exploration, character evolution and etc, like an RPG on the blockchain. But it would be necessary for this information to be clear to everyone. For these reasons, the proposal has a good idea but it is not well explained and therefore needs improvement.\n", "q0r": 3, "q1": "In my view, 2 feasibility topics are not adequate, as little information is given in relation to what would be done, in order to greatly compromise our understanding of the project practice. Starting with script analysis, the timeline is broken down into very large time intervals (initially Q2 and Q3 of 2022, then what would happen between Q3 and Q4). The activities assigned to each are explained in a superficial way, for example in the third quarter of this year, contact would be established with other NFT projects, in relation to the interoperability that would be developed. It would be necessary for us to understand how this contact would be established, what projects we are talking about, how the Flooftopia team would convince the other teams of the benefits and importance of establishing this bridge (to understand this we would need more details about what would be done in each case). It is also said that interoperability with AdaQuest would be completed, so we are led to think that this project has already started and is already quite advanced, so it would be interesting to also know what has been done so far, what achievements can already be observed. Likewise, the other time intervals should have their activities more unraveled: what would need to be done for interoperability to be completed with more than 3 projects, how would contact with projects not belonging to the Cardano ecosystem be sought? In this case, it would be very important for us to understand what advantages would be offered and which blockchains we are thinking of establishing this bridge. Regarding costs, a total of 15 thousand dollars is requested, which would be divided into two parts: encoding and commercialization. In order to understand these divisions well, it would be necessary to better understand the details of each - about coding, who would be the professionals delegated here? What would your work routines be like? About marketing, what exactly would that be? Maybe the marketing part, the link between that part of the overall game design and the rest? Expenses are not so well understood. The team presentation is in my opinion the most appropriate part of the feasibility topic, because we have a lot of people here and they are well presented. We know their names, linkedin profiles and a brief description of their areas of expertise. However, two comments are in order here: it is very important that we have someone involved who already has experience with Cardano, and this is not noticed here, which raises some concern. Apart from that, it would also be positive if they included in the presentation of their CVs more examples of projects they have developed so far, and not just what their areas of expertise and projects have affinity/areas of interest. Because of these aspects, I believe that we have basic information about the script and the use of funding, but it does not provide us with such an adequate understanding and some details could have been added in the team presentation.\n", "q1r": 3, "q2": "Proponents claim that “we will be able to measure the development progress of our project by how closely we are able to maintain our timeline”. But I wonder a little how this would be possible if we don't have a detailed roadmap, a timeline that allows us to understand exactly what would be done, how, when, by whom and so on. Therefore, to solve this first situation, it would be necessary for the proponents to invest in more detail in relation to what would be done, the ideal would be that the activities were divided in relation to the months (what would be done in each of them), and not in quarters . Afterwards, the actions for each month should be presented in more detail, so that we have a more solid understanding of the process as a whole. And so the ideal would be that at the end of each month the team leader would make a summary of the activities that were performed, because the plans cannot always be followed to the letter. So it would be positive to know what actually happened each month and how possible situations that might arise would be mitigated. Talking about the partial results they suggest analyzing (number of Cardano NFT Projects that have interoperability between them and Flooftopia + number of non-Cardano NFT Projects that have interoperability between them and Flooftopia), the proponents claim that this information would be available to the community, but do not clarify exactly how. Thus, it would be necessary that this information was also better explained - would they post updates on a youtube channel, or on Discord, telegram channels popular among the community? Finally, speaking of the final success scenario, the proponents declare that it would be achieved through “meeting the deadlines and partnership goals listed above. Specifically, success would be for Flooftopia to become a hub for other projects looking for interoperability with NFTs and Flooftopia games, and have 7+ projects that Flooftopia shares interoperability with.” But this information is also not so well explained. How could we observe in practice, through verifiable data, that Flooftopia has become an active hub of interoperability between Cardano projects and also between those coming from other blockchains? In my view, what should be done here would be, precisely, for the team to get in touch with the other projects and collect information about what the achievements and advantages would be after the establishment of these relationships, in addition to how they would be happening. It would be important to have these testimonials from other projects, AdaQuest and others, and I think especially from those that do not belong to Cardano. It would be necessary for us to understand if these interoperabilities were beneficial to our community and actually achieved the goals of the challenge; such information needed to be collected and exposed directly to the community (a youtube video on the Flooftopia channel would be great, in my opinion). Therefore, I think that we have a possible auditability here, but it is not fully supported.\n", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 6, "ng": 4, "nfo": 1, "vca_o": 2, "reply": "I understand that the timelines are covering quarters (as this has been the standard for some time), but we stick with quarters to ensure that these are metrics are being met. Similar to when Cardano states that they are working on a hardfork, they don't go into detail on how each worker will be building what on each day. There is a certain level of information that is useful, and there is too much information that makes it nearly impossible for the average reader to get through the proposal."}, {"id": 8386, "q0": "Developed from the well-known LearnerShape SkillsGraph v1, this product is the next improvement step in creating and managing open sources for web3. This version has many enhancements and great opportunity to reach outside Cardano community with detailed proofs for its widespread market application. Having the same goals as Dapps, Products and Integrations challenge, the app has foreseen advantages such as seamless integration with blockchain, available open source software and W3C standards-based which all helps it to become a leading one in public protocol for skill management. It is highly evaluated that besides the risks are mentioned and explained clearly, the author also recommends approriate methods to overcome these obstacles, they can therefore increase success ratio and build trust for community as well.", "q0r": 5, "q1": "The detailed plan and specific tasks are represented obviously by each month so based on this, the process can be measured easily and the author also supports to separate the contents into five categories for us to monitor: technical design, UX/UI, integrations, coding and documentation. The breakdown cost however misses the required amount for each phase of the project so it is important for them now to add it. It is the same situation with the member list, they leave many spaces for the attending people so it is a little bit hard to understand why they do not prepare all information first and then submit to us later. Probably they are doing it in a very rush time leading to the missing information but even it is not going well, the prosal is still highly potential because they are quite serious about it with initial success from previous rounds and it is important to give them more time to finish it.", "q1r": 4, "q2": "In this part, the author should give us the expected time to complete each phase besides the indicators of Cardano and non-Cardano NFT projects having interoperability with Flooftopia. It is good to know that the project is monitored by many channels such as Flooftopia and Cardano community increasing its transparency and auditability. It is agreed that meeting the deadline to accomplish tasks should be one index for the project, more importantly they should deep-dive how Flooftopia can become the hub (requirements about the number of users, how many NFT and non-NFT projects needed..). One more confusing point is that I would like to know the reason the team marks seven projects as the milestone for a successful plan because for an outsider like me, it is low and seems not much interesing to invest.", "q2r": 4, "assessor": "z_assessor_2979", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8395, "q0": "Your proposal did provide some information about your solution for this challenge but I think it’s not detailed enough. It would be better if you can say more about how the project will work, its main function and your products. For example, when saying “Flooftopia is proposing to build interoperability between our NFT project (and the MMORPG game) and other Cardano NFT projects.”, you should describe how the interoperability will be produced from your project. Although you mention your target audience in an indirect way, I advise you to say it directly so that your proposal will be clearer. As well as, detailing the values and benefits your potential subjects will receive is really necessary since the voters will base on them to assess your proposal, and the users will know how valuable your project is. Secondly, your key metrics align with those of the challenge but it should be more informative, too. Let the voters know more about the results of your project as well as application outputs and your reliability will be leveled up. In terms of your risks, I can’t see any mentions of them. You told that you had been mitigating some shortcomings of the process, but the important thing is what they are! Tell me and also tell the voters the solutions you are using to fix them. That’s the best method to convince people to vote for you! Please provide more information for this part!", "q0r": 2, "q1": "My first compliment in this Feasibility section is for your detailed member list! You did great in this! Every member of your team is mentioned with enough essential information like working years, highlight strengths, their current duties/positions, and their LinkedIn profiles. However, you let me down due to your limited information about plan and budget breakdown. Do you know what “a detailed plan” means? It can only be called detailed if you are able to write down every timeline for each milestone for delivering the project. Unfortunately, your proposal only includes the general timeframe like: Q3 of 2022, Q2 of 2022,... If you want to convince the voters, provide more detail about them. For example, in which month you will Begin reaching out to other NFT projects about mutual interoperability potential, in which month you will finish interoperability with AdaQuest, and do the same to other goals. If you can do this, I swear your proposal will be much more convincing. Similarly, the budget allocation needs more data instead of simply putting some numbers in two fields, coding and marketing. My advice is to list highlight activities in these two sectors, like what you will proceed in marketing, and how much it will cost in every activity. This would be much more explicit.", "q1r": 3, "q2": "Your measurement method is okay when you could specify which factors you will measure mainly. Nevertheless, you had better show the voters the way your team will use it to broadcast your information to users in both the partnered project and Flooftopia, in the Cardano community. For instance, what (social networking) sites it will be broadcasted on. Likewise, where are you going to post the measured index of the number of Cardano and non-Cardano NFT Projects? Supplement more information about them! Besides, your definition of success for this project is kinda persuasive and clearly expressed. Having greater than 7 projects with which Flooftopia shares interoperability with is, in my opinion, not difficult to achieve and I hope that your game project will be successful!", "q2r": 4, "assessor": "z_assessor_2980", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "It's difficult to list  how the interoperability will occur as each project that we could build interoperability with is different. It could be cosmetics (as we listed) showing up in the Flooftopia game. It could be the Floofs providing functionality within the NFT projects that have interoperability with Flooftopia. To ask for hard specifics when the projects could differ to extremes is an impossible ask."}, {"id": 10536, "q0": "This proposal seeks to grow cardano in east asia by making a platform where artists can apply to get a grant to draw NFTs for the cardano platform. Currently, I don't think the art community has a very good image of the NFT community. It is not uncommon that artists get their artwork stolen from them to get minted by fraudulous individuals. With a grant program, where an artist is fairly compensated and credited for their work, the art community will look at NFTs in a better light, and perhaps even join in and contribute to both NFTs and the cardano ecosystem. East asian artists are quite underrepresented in the art world as well, and many very talented artists go by unnoticed, so this could be great opportunity for them to get their work out there. I think this proposal answers the challenge well, bringing inclusivity to an area that is currently underrepresented. The proposer offers a decentralized approach to the grant,which would give all artistsa fair chance and get unknown but talented artists known.", "q0r": 5, "q1": "\"The team is very skilled, and the presentation of the members is very detailed. They will have no issue delivering this project on the technical front. The team indicated that they have \"\"mitigated the potental risks\"\" that could arise, but they do not elaborate on exactly what solutions and what problems they have planned ahead for. The success of this project also heavily relies on if other NFT projects want to collaborate. The team does not elaborate on what incentives and what marketing strategies they will employ to attract other NFT projects. For the lack of details on these important aspects, I cannot give this project a very high feasibility rating. \"", "q1r": 3, "q2": "The proposer offers the following metrics for auditability: number of Cardano NFT projects and number of non-Cardano NFT projects that can interoperate with flooftopia. These would be broadcasted on their different social media platforms. This would be enough to audit their success. For progress, it would be nicer to have somewhere the team can post coding updates, any isses they run into and how they implemented a solution. Otherwise, it is very hard for the cardano community to track progress. Overall, success is auditble, progress is not, so i will rate this just an average score on auditability. ", "q2r": 3, "assessor": "z_assessor_3189", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "It is hard to provide additional information on \"The team does not elaborate on what incentives and what marketing strategies they will employ to attract other NFT projects.\" The interoperability that brings additional value to their projects, thus the, \"NFT Interoperability\" is what will draw NFT projects in. The value of, in this case, an NFT with no true value being able to be used to have a cosmetic within Flooftopia, that is a great show of value that will bring projects in."}, {"id": 15343, "q0": "This proposal aims to create interoperability between MMORPG game called Flooftopia and other Cardano NFT projects, namely AdaQuest (MRPG game). What I fail to understand from this proposal is how would that interoperability function. There is little information besides mentioning that this interoperability would be done through Flooftopia ecosystem, but again there is a lack of information how would it be done and what does exactly interoperability cover. Especially AdaQuest could have been used as an example of how would that interoperability function as proposer mentions that they are collaborating together. Are we talking about some ingame skins/cosmetics or about something more? Proposer mentions that they would be the targeting 7 projects and more with which Flooftopia would share interoperability with. This a good indication that there is potential in this proposal, as they apparently know how and with whom potentially they could be partnering. \n\nWhat is also lacking is any link to the Flooftopia developed or in general link to any information that would help voters to know more about the game. I know from previous Funds that it is an interesting project but that information is not available to someone who is looking at this project for the first time. \nAs a conclusion, there is definitely potential here, but it lacks explanation how it would be implemented. I have a felling as proposer thinks that voters know about Flooftopia, but that could not be the case and each proposal needs to be clarified as individual, or at least make links available to the 'main' project. ", "q0r": 3, "q1": "The best part of feasibility is definitely presentation of the team. There is a big, experienced team behind Flooftopia and for each member of the team there is a short bio and link to their LinkedIn page where you can get to know them better. Looking at the team there is big confidence that they can make this project work.\nBut on the other hand, there is a lack of information about other things. Proposer states: 'Many of the possible risks, shortcomings, or challenges are already being mitigated', but it would be nice to see what risks/challenges are we talking about and how are they being dealt with. It would give more confidence to voters to get behind the project. Additionally plan is only few sentences short, divided in quartals. One of the points mentioned is to finish interoperability with AdaQuest, as mentioned before it would benefit voters to see what does this cover, how it would impact the end user, how would it be implemented, who will work on it and how many hours would it take, etc. I know for other projects it would be difficult to make some measurements because it depends on what that other game would look like and it would not be the same in terms of man hours like AdaQuest. But at least that could be used as some starting point, so that voter could understand better time needed and project itself. \nIn terms of budget, it is quite simple. Man hours needed for coding and marketing. Again, more details would be nice to see, why is this amount of man-hours considered (120h total).\nTo summarize, great team behind the project but there are some important points missing. ", "q1r": 3, "q2": "For audibility proposer states that it would be measured by number of Cardano and non-Cardano NFT projects that have interoperability between them and Flooftopia, which is not a lot of information but nevertheless a right indication of success of the proposal. There is also mention that in second quarter they target to have 3 interoperability projects and in Q3-Q4 total of 7. Why is there a difference as in one quarter (Q2) target is 3 projects and in two quarters (Q3&Q4) is 'only' 4. Also , why 7 projects? As one project could have one NFT interoperable and other could have much more. Maybe NFTs could be measuring unit, not projects?\n \nIt is good to see that all information about the project would be broadcasted to users, but there is no mention how that would be broadcasted, by social media, GitHub, etc? And how often would this information be shared. \nAgain, have big faith in the team behind the project but it lacks more clearer auditability information. ", "q2r": 3, "assessor": "z_assessor_2752", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Flooftopia will produce interoperability between multiple NFT projects. The first of which is AdaQuest, and will provide value/interoperability to other NFT Projects, through Flooftopia’s ecosystem.", "experience": "Coding: Dirk\nGame Programmer: Simon\nArt: Christian\nStory: Chris\nMarketing: Conward\nGame Design: Alex\n2D-3D Artist/Animator: Oleg\nLighting Artist: Lena\nStrategic Advisor: Marcin\n(Additional Team Detail Below)"}