{"id": 416435, "author": "danielvancast", "title": "5-6 lang Short Explainer Animations", "url": "https://cardano.ideascale.com/a/dtd/416435-48088", "category": 26595, "amount": 19000, "description": "The world is crowded with junk content, we need quality content to stand out, and spark the conversation.", "f6_no_assessments": 7, "f6_rating": 4.047619047619048, "videos": [], "media": [], "f6_assessments": [{"id": 1648, "q0": "In theory, the proposal is very interesting and meets the challenge, specifically in the topics that deal with “social media - Total number of users, number of significant interactions” and also “increase the number of dapps and products available for use by the community that help to enrich the ecosystem with new use cases” (both available in the challenge summary). The idea is to produce a series of animated videos that teach the general public, in a fun and educational way, as defined by the proponents, about the Cardano ecosystem. The problem raised here is that there is already a lot of “junk” content on these subjects, and higher quality content is needed. With this statement, it would be very interesting for proponents to argue what would be the difference between the contents they were going to create compared to those that already exist: why would they be so superior? What strategies would be adopted to ensure that the target audience understands the content being passed on, why would these videos be more accessible than the others, which are already available on youtube? They would be created in five 2-minute videos, so we would need to know exactly what would be covered in each video. The proponents suggest some themes, namely: what is a Catalyst? + how does the Catalyst Swarm Fund work? (what would that be? I evaluate Catalyst proposals from the bottom 5 but I'm not sure about this concept…); + easy quick guides for PAs or VPAs + fund guidelines (how could they talk about the challenges, as I understand it, since they change over the funds? Maybe they would comment on the fixed challenges, like for example dApps and developers?). It is also said that the videos would be dubbed into 6 languages, but not informed which ones, it would be necessary for us to also know this information so that we could better understand the different audiences targeted here. In my view, the smartest thing is that the videos are made available in the languages ​​most spoken by the Cardano community. It is also said in the part of the budget explanation that there would be subtitles in another 5 languages, so in total the videos would be available in 10 languages, from what I understand. It would be very important for us to know what they would be and why they were selected. Although we are not so clear about the topics covered in each video, we have a good range of examples of what the group has produced so far, available from the website where they have attached it, so there is a lot of confidence in the statement that “use of characters animations enhances a site's ability to inform above the usual domains of text and images […] We've been making animated explainer films for years and we have a well-defined process for developing the design and script for each animated video”. Although I think the idea is very good, I would like to make two suggestions that would raise the level of impact: the first would be to define exactly what topics would be covered in each video. What we have here are some options, but it would be more appropriate if we were given concrete information. I also think the team could focus more on Cardano than Catalyst, covering some basic topics like what is blokchain, what are cryptocurrencies, how to create a digital wallet, how to withdraw Ada and turn it into your local currency, etc. The other suggestion would be to put more emphasis on the issue of dissemination, as the proponents suggest that community members themselves present the videos at meetings, events, etc. in addition to posting on youtube and vimeo.\n", "q0r": 4, "q1": "Talking about the script, we can understand how the project development process would be through a link that is provided, where there is a graphic that divides the creation of each video into parts: script, storyboard, transcriptions, locution, layout, animation and edition. Some of these tasks would be done by the team and others by the defined artists and animators (eg artist 1, animator 1 and so on). We also know what the schedule is for these activities to start and end (for example the script of video 1 would start on September 12th and end on September 15th, by what is planned). This table is very good when it comes to understanding what the divisions of tasks would be for each video to be created, giving us a good understanding of the audiovisual issue of the proposal. However, some information is not included, for example: who would be the professional who would do each activity (it would be better if this was already defined); we also don't know about topics that do not involve audiovisual creation, such as the definition of the topics covered in each video; we also don't have information about the disclosure process, both to the Cardano community and to outsiders, which I believe is our main target audience. However, this is the topic that is best established in terms of feasibility, as the degree of specificity in the next ones has unfortunately declined. When it comes to funding, for example, we have a basic explanation of how the $19,000 would be used. However each part could have been explained better: what would the layout be, exactly, and why would it cost $2500? Regarding the voices, how would the professionals who would work here be hired, what would be the price of their working hours? It's asking $6000 for that, and it's 6 languages, so $1000 per language, the video would be 2 minutes, so $1000 is charged for 2 minutes of dubbing? In my view, this value is a little high, not very compatible with the payments requested in the other proposals. The same question is raised for subtitling: would it be 1000 dollars for 2 minutes of subtitling in each language? They provide a table, but it contains the same information as the proposal breakdown. And finally, speaking of the team, unfortunately we don't have information about the members involved, we know that the team is experienced in producing animated videos (we see several videos on the attached website, as I mentioned in impact), but we are not sure how they will go. transmit the blockchain information as we do not know who the Cardano consultant would be. It would be necessary for him to be properly presented, his name, how he works in the community, projects he has been involved in previously and etc - so that his experience with our blockchain would be clearer. In reality, the ideal would be for all members to have information attached, CVs that would allow us to better understand their professional backgrounds. Although we have some basic information, the proposal still needs several improvements on the feasibility part.\n", "q1r": 3, "q2": "The way proponents suggest that we do auditability of progress is valid, but in my view it doesn't cover all the information we should audit. Through the link provided, we were able to understand what activity would have to be done, when to start and when to end, but we could not have any more qualitative understanding of the process, that is, how would these activities be being developed? It would be necessary for us to know more exact information about the daily work of the professionals involved, whether they would be in addition to carrying out the activities on time, if this was being done in the right way too. It would be very positive if we had access to the partial results as well, for example, the script, the voiceovers, the first drafts of the animations... In short, if in addition to knowing what would be done and when, we could have access to how these things were being done and which small successes were being obtained. So, in my opinion, for the auditability of this part of the proposal to be truly adequate, a combo should be made available to the Cardano community: in addition to the available link, the team should have meetings at the end of each month (we know that the project would develop in September to November), and from these meetings reports could be prepared that would include more information on how the month's activities were performed and some finished products could also be included. These reports must be sent to our community, either through discord, telegram or any other means of communication chosen by the team. Talking about the success scenario, finally, this is well defined through several concepts, in addition to the creation of the videos, an increase in the \"conversion rate is expected to increase the number of people who understand and start new projects\", the videos must be easy to distribute, reaching the maximum number of views possible and also the content created must be easily understood by all consumers. Okay, we know what success looks like, but how can we verify that all these expectations were achieved? In my opinion, it would be necessary for the team to do a very detailed study on how people would be absorbing the videos, if where they were distributed a higher rate of adhesion of Cardano technologies was observed, if more people would be participating in Catalyst projects , or they would have become proposal evaluators… If more people would have been buying and delegating Ada, using dApps… In short, if the challenges of the challenge would have been achieved. For these reasons, I think that 1) the auditability of the process is not very complete, as suggested by the proponents, as it lacks a more qualitative analysis of the phases; 2) it is necessary that the information gathered about the final success be proven, and that this information comes to the knowledge of the members in our community. So some changes are needed on this topic as well.\n", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 3450, "q0": "The idea of having short videos in different languages to explain Cardano topics is really good and can certainly help to attract more people to the ecosystem. Regarding challenge fit, although this is not a Dapp, it can fit in the definition of \"product\" and aligns well with metric of \"Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community.\". \nRegarding the proposal itself, the proposer explains well the value proposition, considers the variety of languages to expand Cardano outreach and presents already some topics that will be in the videos. As suggestions, an advertising/communication strategy to make the video reach new people could be added to better assess how they'll impact the potential ecosystem. It could mention, for examples, what countries will be targeted, what type of audience, etc. The 6 different languages could also be mentioned to better understand this.\n", "q0r": 4, "q1": "There's a very nice gantt chart provided in the link showing the project schedule. It's basically broken down by the acitvities in each video and considers a pre-stage for research, with the duration of 7 days.\nA sensible budget breakdown is done, based mainly on the acitvities required for each video, which matches the ones in the schedule. Its possible to get the amount of days/hours from it. A spreadsheet with more details on cost breakdown is also provided.\nThe team considers 27 seven people in 10 different roles. However, its not clear whether the team is already formed/committed (or if propsoer would have to hire all these people) nor the capabilities/experiences of each individual, as it is a good practise to do so.  In the comments section, proposer says he'll be thep roject manager and post its linkedin link, which is a good start, but considering the size of the team, more information should be provided. A website for the Criteria Animation company is also given but there's no information on their employees.  My rate is then 4, one star lost mainly because of the team part, that could be better ellaborated.", "q1r": 4, "q2": "It's possible to track project progress thourugh the gantt chart in the link provided, as suggested by proposer, which is indeed a very good way to audit it, specially considering anyone can access this schedule. In the definition of success, some kpis are suggested as conversion rate (which could be better explained how it will be measured) and # of views. However, none of them have any targets, which makes it hard to evaluate success. Moreover, other kpis could be included as number of comments. shared, mentions, positive feedbacks, number of walltes open because of it and so on. These metrics combined could help to effectiveness of this way of communicating as a whole.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8207, "q0": "\"The solution proposed is well linked with the key metrics of the challenge. The goal of the project is to familiarize the “Cardano concept” with the community, thus effectively acquiring new users. Some of the main features of the project have been described (e.g. animated films, available in 6 languages, educational videos,...), enabling the community to have an overview of the project. \nThe main risks during the operation process have been carefully predicted and mitigated. However, as I know, the quality of the videos is also a big obstacle in this project. How can the team ensure the quality of the products/the translations - since they are in 6 different languages (based on what standards) and how to approach the target audience or how to promote the films/videos?\n\"", "q0r": 4, "q1": "\"The team has provided the Gantt chart to illustrate their delivery plan, which assures transparency and effectiveness. Viewing the chart, the community can see the workload distribution, P.I.C, task status, and specific deadlines. I think they did well in preparing the action plan, which significantly increases the feasibility of the project. \nAccording to the timeline and key deliverables, the costs have been carefully allocated. I believe this budget breakdown is reasonable as it is well aligned with the tasks and expected outputs of the project. \nMaybe the team can provide more information on the team members. The number of personnel is not enough to assess the capability of the team. The additional details can be about the working experiences, past projects, or demo products, which can successfully support the verification process. \n\"", "q1r": 4, "q2": "\"Since the project’s deliverables have been fully portrayed in the Gantt chart, the auditing process will be easier and clearer. They also claim to ensure the progress updating and accessibility to the chart, so I believe the community will easily keep track of the project’s development. \nThe goals are good and well in sync with the project plan. Yet, to better visualize the project’s success, the team can set some specific KPIs to measure the engagement of the community (e.g. the numbers of views, links, shares, or the desired conversion rate)\n\"", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9005, "q0": "This project is capable of being incredibly successful at increasing the impact of Cardano. However, this proposal does not really fit into the challenge well. The goals are not aligned well and that is why I can only give this a 3. Unfortunately, there is not a good challenge in this fund that would fit this proposal well. I hope that this proposal comes back for Fund 10, as I think there should be an outreach challenge in that fund. The proposal, though, is thoughtful, and capable of creating a big impact in communicating what Cardano is, how to make it profitable, and how to participate in governance. The creative team has demonstrated a capacity for creating helpful, short, and interesting animations describing complex topics. They have a proven ability to work for large clients, and complete projects on time and on budget. The animations are creative and informative. Having six animations like these about Cardano would be incredibly effective and growing our outreach.", "q0r": 3, "q1": "This proposal is clear and detailed about how it would be feasible. There is a gantt chart containing a detailed schedule for completing all five animations in three months. There is a detailed budget for how to accomplish the tasks involved. The studio has completed similar projects in the past. There is a team lead listed on the proposal who will be available for follow-up, and the team has already hired staff to accomplish projects in the past. This proposal will be very feasible for a studio that has accomplished similar work in the past. They know the budget, and timeframes required and will be able to complete these for Cardano.  \n", "q1r": 5, "q2": "This project will be simply auditable through whether or not the animations were completed and uploaded according to the schedule set in the gantt chart on the proposal. This proposal is clear, the team is capable, and the budget is set right. There is a team lead available to reach out for questions and they will be submitting monthly reports on their work. Due to the clarity of their schedule and the output of their work, this project will be clearly auditable. \n", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9324, "q0": "I think your ideas are quite good. Because knowledge about Blockchain is a difficult knowledge, easy to cause discouragement, boredom to learn. And in the future, everyone needs to catch up with the trend of learning about Blockchain. So I found the idea of making a two-minute animated video in six different languages explaining topics related to Cardano, from what it is to how to make a profit, very cool and helpful. I support you to develop this project, I see that you have a very nice video demonstration. I believe you will develop the project well.", "q0r": 5, "q1": "The link to access the work plan table and the budget table I can access. You guys are very detailed. However, you can do it directly so that people can score faster instead of copying the link and searching to see. The members of the group are very large, so I see that you do not specify. I think you should give clear information rather than generalization (1 director, 1 producer, 1 scriptwriter, 1 Cardano Consultant, 5 translators, 2 illustrators, 2 activities). model, 1 editor, 12 male and female locating teachers (6 languages),1 Project Manager).", "q1r": 4, "q2": "The team's proposal is quite practical and detailed. A concrete, actionable plan. In addition, there are video illustrations, links and information of the members of the full translation project, who are all trustworthy. I believe that with the detailed plan and budget of the team, the project will be able to work well in practice. With this project, I think the goal and success of the project you should add numbers like, for example, the number of views, the number of positive feedback on the video, the number of comments to modify... What I like In the project, the video is not too long and you can translate many languages (6 languages). This is very convenient.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14729, "q0": "\"The information technology age has allowed us to immense into huge information. However, most of the information is junk and unclear. Blockchain in general, or specifically Cardano is not an easy-to-grasp topic for majority of people. The difficulty of blockchain concept is the main challenges of those who want to learn about crypto, or Cardano. Thus, I agree with the idea that by using animated videos to simplify Cardano-related concepts for educational purposes. Animated videos also create joy, fun, and excitement when watching them, boosting the motivation for learners who try to understand Cardano. \nThe idea was clear. The team managed the risks quite well. I would like to add one more risk, in my opinion, the most challenging thing is that how to make the videos viral, accessible, understandable to the general public, and what if that scenario does not occur. \nIf this video project is successful, the Cardano ecosystem will be significantly boosted by a great number of new users. The solution provided here is well aligned with challenge.\"", "q0r": 5, "q1": "\"The project roadmap is illustrated by using Gantt chart, which was clear and sufficient. The budget given was in detail and clear, too. It would be more fulfilled if the proposers divided the funds among the tasks listed in the Gantt chart above. \nThe proposers just listed out the job positions. If these positions have already been recruited, I do recommend the proposers to attach the names, the CV, and the LinkedIn profile (if available), that would make the proposal more convincing in terms of accomplishing the project on time.\n\"", "q1r": 3, "q2": "The project progress is updated based on the Gantt chart provided above, thus it is easy for community to keep track of the project. However, to increase the auditability from the community even more, I recommend that the proposers should specify some of the metrics/KPIs such as number of viewers (on different channels), viewers’ feedbacks about their understanding of these videos as these feedbacks play a major role in determining if the viewers were interested in the topic or not (the end-goal of the project is to attract and incentivize the viewers to join the community). ", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14927, "q0": "\"I think this proposal is closely aligned with the challenge and has potential to add value. \nThe aim is to create a series of five animated two-minute videos in six different languages that explain Cardano-related topics ranging from what it is to how to profit.\nAs far as I understand from the problem statement, this proposal is designed to provide Cardano knowledge through a series of educational narrative movies which I think is significant. \nIf the proposal is funded, there will be a production of a series of five animated two-minute videos in six different languages that explain Cardano-related topics ranging from what it is to how to profit.\nFrom what I understand, it is implied that if the goal is accomplished, it would attract a number of new members to the Cardano community.\nI agree with the idea that animated videos are a great tool to convey the most complicated topics, such as ones in the blockchain industry, in a fun and educational manner. I also agree with other benefits of animated explainer films that the team has outlined. \nBasically, the team has outlined the risks that prevent the project’s goal from being fulfilled, followed by a description of ways to mitigate the risks. \"", "q0r": 5, "q1": "\"A timeline is provided via a link to another app and the details of the timeline are well visualized on the Grant Chart with clear categories divided into milestones, tasks, assignees, and tentative time schedules. I can easily understand what will be happening over the 3-month period given. This would definitely make this proposal feasible.\nI have a few suggestions with regard to the team. The number of members in total is defined and I can find out about all the portfolios on the website they are operating. This is a testament to the team's ability. Despite this, I would prefer reference links to each member’ online profiles so there will be more descriptions and evidence about their years of experience, expertise and knowledge. Also, it would be nice if the role of each person, whether in administrative, technical, translation or other teams, could be indicated on the Grant Chart mentioned above or in this proposal.\nThe budget breakdown is provided in the form of a table where all details can be seen clearly. For instance, it is clear how much is spent on a list of items. The budget is broken down into six different categories with necessary items. For the better, I think the table should include the average number of working hours required for each team member and pay rates. \"", "q1r": 4, "q2": "\"Since the entire project can be visualized on the Grant Chart which is assessible via a link, so it would be easy for the community to monitor the progress and get immediate updates on when the deliverables are delivered. This is also true for adding transparency regarding fund allocation.\nWith regard to success metrics, they have been defined clearly what they will measure to indicate the success of the video series like the number of views. I would expect them to describe the KPIs of the metrics, which would make it easier to recognize the relevant impacts this proposal promises. For instance, make it apparent the number of new projects they expect to increase and how long it will take, so I could better understand how this proposal will contribute to the growth of Cardano community. Also, more descriptions should be provided to clarify when they expect to measure the metrics/KPIs.\"", "q2r": 4, "assessor": "z_assessor_4113", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A series of five animated two-minute videos in six different languages that explain Cardano-related topics ranging from what it is to how to profit.", "experience": "We are an experienced, award-winning boutique storytelling studio, which focuses on quality over quantity. We produce Animated Explainer videos, films and documentaries, that simplify complex ideas, while they supercharge the audience quality perception about our clients."}