{"id": 416467, "author": "joxnow", "title": "Get incentivised for contributing", "url": "https://cardano.ideascale.com/a/dtd/416467-48088", "category": 26595, "amount": 39000, "description": "Developers who contribute either in open source/private projects want to get incentivized in either financial (ADA) or career advancement (Skills NFT).", "f6_no_assessments": 6, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 1649, "q0": "The problem posed by the proponents is that developers contributing to open source projects should be encouraged in Ada or NFTs, so that they are more motivated and more involved in these activities, so that Cardano's technologies can be built more consistent and the entire ecosystem benefits. I agree with this statement, as much as some professionals or students are interested in building the blockchain, I believe that people will always opt for paid options, after all it is not fair that they use their lifetime without gaining some benefit in return. With this in mind, the proponents suggest launching a platform, called PRToken, where developers, regardless of their location and background, can get open rewards, participate in repositories and contribute to solving coordination problems, according to the proponents. The rewards would include “access to exclusive hackathons, invite-only repositories or projects, online courses, private discord channels, or special rates for different tools and events running NFTs.” The proposal very well meets the objectives of the challenge by building a sustainable financial model supported by the community itself, so the objectives of the challenge will certainly be met, because once open source projects are increasingly encouraged, I believe that the projects will generally benefit. With new projects in full swing, the specific objectives of the challenge will be met, such as increasing the number of active community members (new projects will attract a new audience, different people connecting with Cardano through different initiatives); these new people would certainly create digital wallets, acquire Ada, delegate, and so on. The platform would reward developers with both Ada and Skills NFT, which would increase the circulation of our cryptocurrency and the amount of active tokens being minted on our blockchain. In other words, Cardano would benefit in several ways. My only suggestion so that the impact of the proposal could be further ensured would be for the proponents to better explain the excerpt “Access to exclusive hackathons, invite-only repositories or projects, online courses, private discord channels or special rates for different tools and events performing NFTs”. What would these hackathons be? Would they be initiatives of this project itself, or maybe hackathons that are already being carried out and that open source contributors can have exclusive access to? It would be interesting to know the origin of these online courses, private channels, etc., it is not clear whether these initiatives are also part of the development of this proposal or would be made from some kind of partnership. Other than that, I believe the idea is very relevant and aligned with the scope of the challenge.", "q0r": 5, "q1": "The proposal's script is not very adequate, we only know what would happen, but not when or how. The proposed activities (\"we want to add a smart contract to each issue when a reward has been assigned / improve yoroi wallet integration, such as showing NFTs of user obtained skills / partnership with 20 companies or projects distributing ADA for them to test\") are said very superficially. How would you add a smart contract for each problem, how will the rewards be distributed? Who would work on this part of the project, and what would their work routine be like? How would integration with Yoroi be improved? How would partner companies be selected and how would this contact be established, how could we convince companies of the importance of the project and make them willing to engage in this initiative? I notice that the proponents did not include the marketing part in the script, which they even mention in the detail of the proposal, which is very important, but it is not very clear who would do this and how. Apart from the lack of detail of each activity, we also do not have a well-established temporal notion. We don't know how long each activity would last, and also at what time of year they would be done; for example, in which month would the partnership with the 20 companies take place? How many weeks would be set aside to work on it? I think it would be more appropriate if the script had been built in the following way: firstly, that a time division was better established, that is, that it was detailed what would happen in each month. And, also, that a detailed explanation was provided about each activity to be developed. Regarding the budget, 39 thousand dollars are requested, the value is quite fair for the proportion and complexity of the project, but I believe it could have been better detailed. For example, we know that the salary of the developers and the designer would be 3000 thousand dollars per month, but it is not said if they would work full time on the project (I believe so, but it would be good to be sure); therefore, we have no idea of ​​the hourly price of these professionals. Regarding the distribution of prizes, from what I understand each developer would receive 100 Ada for contributions of work, the multiplications are done for 20 and 10 units, so it is understood that it would be a total of 3000 Adas distributed as rewards. When this amount runs out, will the other rewards be given in the form of access to courses and hackathons, for example? Finally, speaking of the team, this part certainly deserved more detail. All that is given to us are the linkedin profiles of the team members, it would be necessary that in the proposal itself we had a better detail about who they are (their names, a curriculum that would allow us to understand how they relate to Cardano, etc. ). Of course, we can have access to such information through linkedin, but it would be more appropriate for a (detailed) preview to be provided within the scope of the proposal. Thus, I think that the topic is not bad, but the information is given in a very basic way, requiring more detail.", "q1r": 3, "q2": "As with the previous topic, auditability is reported very superficially. We do not know precisely how progress would be monitored or how success would be measured. Regarding the progress, it is said that the main metrics would be the user count and activities on the platform. I believe that these are in fact the main means for us to understand whether the proposal would be generating the desired partial results. However, this does not allow us to follow the tasks that would have to be developed through the phases, with the completion of each activity. In order for this to be done properly, we would need to have a more detailed roadmap - after all, we don't have a solid notion of what would need to happen and when, in a detailed way. The proponent could make an overview at the end of each month, pointing out the activities that have been carried out, if everything went as planned, if there were problems and how they were solved. It would be necessary for us to understand both what was generated (the products) and what happened behind it (the actions, activities). In this way, the auditability of the process would be better guaranteed. Finally, regarding the success scenario, this is defined as “we are looking at user activities as key metrics, we want to bring 1,000 new users (established or new developers) in these 3 months, if we get the funding / we want to make sure that we have at least 20 companies using the system with at least 2 transactions”. Again, this gives us the possibility to understand if the specific project was succeeding, but not the broader consequences of it all. Somehow, the proponent would need to carry out a study pointing out how this project benefited Cardano. I believe that our main goal here is to work on the collective construction of our blockchain technologies, so it would be very interesting if the proponent, in addition to surveying which projects were carried out through open coding, analyzed how such projects reached Cardano. For example, project X attracted such a number of active users, who would be acting in the community in such a way. Finally, it would be necessary for a more careful research to be carried out some time after the launch of the platform, so that we could understand in a qualitative and quantitative way how the project impacted our blockchain and how the objectives of the challenge were supported. That said, I think auditability needs some improvement, more careful attention to both monitoring progress and understanding concrete end results. With more detail, we would have a better understanding of both parties; the information provided is quite basic.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 5475, "q0": "The key distinction between the Cardano ecosystem and other blockchains has always been their open-source nature. Many times developers fork these projects and do their own unique implementations over them and utilize them, but never feel the need to commit the features back to the repository. As a result, numerous completed projects become stagnant because no new contributions are made to them. The main cause might be that it involves extra work for no reward. The author of this proposal has an understanding of this issue and offers us a solution by suggesting incentives like remuneration in ADA and talent NFTs to encourage developers to contribute value back to the ecosystem. Many people jump at the chance to make use of the NFTs because they may be used to exhibit their work and also serve as tickets to exclusive discord discussions, hackathons, and other events. This will encourage developers to work on open-source projects and add to their value. Others will have greater chances as a result, and adoption will rise overall.", "q0r": 5, "q1": "The team has expressed a strong desire to be extremely cautious when it comes to the aims of their proposal, and it appears that they have thoroughly outlined their strategy in support of this. The team has identified a few of the goals they want to accomplish, but no specific timeframe has been given for any of them. The budget breakdown reveals that almost all of the funds raised were given to the developers, and all of the figures appear encouraging and justifiable. However, because the team members have not yet been employed, it is difficult to determine the level of competence they will bring with them. The team lays up a solid basis going into this funding round by providing the community with all the references to their prior ventures and how well they have developed. Although I would hesitate to award the team a perfect score due to the vagueness of the goals and the fact that they still need to fill a lot of development positions to get things moving, I am confident in the abilities of the team members already in place.", "q1r": 4, "q2": "Additionally, the proposer loses the opportunity to make an impact on the readers of the auditability section. The proposer promises to produce some incredible analytics once more so that the community can monitor their work as they advance. But readers have nothing to report on because there are no preliminary metrics. The team's success measures, however, are quantitative and appear to be quite promising. The community essentially has no way of knowing whether the idea complies with the specifications and expectations of the challenge. While it can be assumed that moving forward, if funded, the team would support the audit process as they have already gone through the process once and are very familiar with it, the team should have made a suitable effort to provide such KPIs rather than just relying on the reputation they have built, having submitted proposals in several previous rounds. I can't agree or disagree with the auditability metrics because of the uncertainty that has been presented, though, as a reader.", "q2r": 3, "assessor": "z_assessor_2704", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7895, "q0": "I have developed a couple of web apps for CNFT and token projects that the Cardano community still uses. To get rewarded for building such “community apps” the best one can do is to add something like a “donation” or a “buy me a coffee” button. Even though my sites have traffic, donations rarely get made by users. After that one can add that app to one’s resume or profile. The sad reality is most people don't want to pay for things. This project aims to reward developers for their contributions towards projects. The reward can be in the form of ADA or career achievement. This project aims to provide incentives for work done which is good thing as people will act in their own self-interest. \n\nMore developers will also be attracted to the Cardano ecosystem for the opportunity to be rewarded in ADA or getting access to exclusive events. This also has the potential to scale as there are developers all over the world. Another benefit is that getting paid in ADA or any Cardano native token is easier and faster than being paid in fiat as transactions between different countries can take between a day and 5 days to clear depending on where you are sending money to and from. ", "q0r": 5, "q1": "The team has was funded in Fund5 but just fell short in Fund8 due to the lack of funding. This is a continuation of that proposal. The team has provided their reference links of their profile and the url to their MVP. Their website is sleek and looks professional. \n\nOne of the risks identified was that they do not have a Haskell developer on their team but they stated that this can be mitigated by financial support i.e if they get funded. \n\nThe budget includes a fee for the Haskell developer which is good since none of the team members are one. The rest of the budget is clearly laid out how much will be spent for the budgeted time period.", "q1r": 5, "q2": "According to the proposer the project will take three months to complete but no roadmap is given. There is an itemized list of things the team needs to do but no timelines were given. \n\nThe proposer did not say how this project can be audited by the community. The team has a github repo so they can publish the results there, but they did not mention it in the proposal. An extra page on their current website can also be reserved to display the key metrics such as numbers of users, companies and others in a dashboard format.  ", "q2r": 2, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9126, "q0": "This proposal raises an interesting problem since he basic idea behind the proposal is quite good. The proposal is well-structured and planned, with such a clear objective and has a potential to add great value to the Carnado ecosystem which aligns with the problem statement. However, this proposal still does not meet a few key metrics as well as the synchronization and consistency of some metrics that have not been clearly presented. To overcome this, I suggest how the solution addressed with the challenge part is shown more clearly and in detail, sticking to the key metrics. I would only ask if I can see some specific number in the Key metrics section although I know it may be very difficult to do so. Nonetheless, I see a lot of room for improvement here.", "q0r": 4, "q1": "I like the idea that they have added Yoroi wallet integration where developers can transact ADA and bundle with NFT through their platform, which is really convenient. The proposer has a LinkedIn account that speaks volumes. So the credentials check out with flying colors. This, in my opinion, is an excellent example of how to present the practical portion of a proposal, because I frequently notice that authors are more concerned with revealing the phases that make up the entire project, rather than outlining them and explaining what would happen in each. In terms of the financial amount, we know how much money will be allocated to each phase of the project, which is critical and the steps are open to anyone who is interested in following them. However, it seems that the team is quite small. I could only ask if they could recruit more members to ensure the progress of the project and avoid unnecessary risks due to insufficient human resources.", "q1r": 5, "q2": "Finally, it was unable to locate the data necessary to assess auditability. The author should consider the following ideas for future Catalyst cycles: Create a road map showing the steps that must be taken in order for this strategy to be effective. A timeline should be given at least every three months. Furthermore, success criteria that are preferably related to dates, such as XX conferences will be arranged within XX months; XX new members will join the community as a result of their engagement in the hub's activities, and so on, are crucial. This information is essential for the community to understand the project's status and to compare actual and projected data.", "q2r": 4, "assessor": "z_assessor_3022", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14581, "q0": "In my opinion, this proposal has an impact on the Cardano ecosystem. First of all, the use of the PRToken platform contributes in terms of key repositories and other pressing coordination issues, access to exclusive hackathons, invite-only repositories or projects, online courses, private discord channels or special rates for various instruments and events by holding NFT. From the successful proposal of the team from F5, they want to build a sustainable financial model supported by the community through web3 technologies (including blockchain, DAO, etc.), creating a virtuous for builders build. However, I have not seen them give the results when creating it and do not know if it is suitable and in sync with the KPI/Key metrics of the challenge. I hope the team can elaborate on this issue. They also present challenges and risks, but ways of mitigating them in the future have not been identified by the team. they should add detailed, clear and effective measures to convince donors.", "q0r": 3, "q1": "In terms of feasibility, first of all, they came up with a plan, including what they've done and what they want to do next, but they're missing the milestones to come up with this proposal. The team should supplement the roadmap with timelines so that it is easy for everyone to visualize and know if the team is completing on schedule or not. Next, the team details the expenses they will budget for, including salaries for personnel and assets. What strikes me, however, is that none of them get paid. Meaning, their team has a huge passion and dream in making this project a success. I appreciate it. Their team is a small group with 3 members, but in my opinion, the group should show what roles the team members take on in the team to show the importance of these people.", "q1r": 3, "q2": "Regarding auditability, in this proposal, the team provides clear quantitative indicators that are the number of users and activities (transactions) taking place in their platform. However, they need to explain more clearly how they will measure these indicators and if there are other indicators to monitor the progress of the project. As for the criteria to define if the team is accomplishing the goal of this proposal, they give the metrics as 1000 new users (founded or new developers) within this 3 months if they sponsored by. They will also make sure there are at least 20 companies using the system with at least 2 transactions. In addition, the team also provided other proposals belonging to the same project that were funded by the fund to convince the sponsors that this proposal was feasible.", "q2r": 4, "assessor": "z_assessor_4073", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14968, "q0": "This section is well-written, easy to comprehend and well-aligned with the challenge. Generally, the intention of the proposer is to build a platform where Pull Requests can easily find partners to complete the remainder of the programs. The spirit of the project is to develop a community-supported model, where contributors are rewarded worthily. I believe that not only does this project support programmers financially and experimentally, but it would also make the Cardano ecosystem widespread through the use of ADA as bounties. With an already successful proposal in F5, I believe that the team has gained some particular experiences and this proposal in F9 would be very promising. However, there are also some omission points that I would like to mention. Firstly, the rewards promised to be given are not clarified yet. The writer did not mention the scale of hackathons, online courses or private discord channels that contributors would be able to join. Moreover, in order to have a clearer view about the platform, they should consider answering regular questions such as: how many companies are willing to incorporate PRToken, what are the majorities that these companies are operating in, would the contributors be able to meet some popular coders through these hackathons, private discord channels and events,... Finally, I believe that the risk statement in this section is not obvious enough. In my opinion, lack of resources and financial support are some obstacles that the team needs to work out the solution and overcome. Instead, the project developers should prepare for bad possibilities that would prevent them from delivering it successfully.", "q0r": 3, "q1": "A related website of PRToken is given for further understanding about the platform. However, the plan offered in this section, from my point of view, is not sufficient. I agree that these are the achievements that the team has already reached as well as the next steps that they want to actualize, yet these are not presented in a logical way. Some missing information, which would improve the clarity, are the estimated timeline for the plan, the amount of time needed for each milestone, the methods that they would use to perform some specific tasks,... Besides, the budget breakdown provided the number of employees needed to perform particular jobs as well as detailed salaries required. In addition, each co-founder of the project is attached with a LinkedIn address which provides quite sufficient background information about Education, Work Experience, Previous Projects, etc. Nevertheless, I believe that a brief introduction about themselves in this section would be very helpful in drawing a better picture of the feasibility.", "q1r": 3, "q2": "In my opinion, the information offered in this section is quite humble, the KPIs given are not clarified and the sustainable development goals are missing. I agree that users count and activities happening in the platform are important key metrics, yet it is not enough. In order to measure success efficiently, I suggest that the key metrics should be defined differently between 2 phrases: Short-term and Long-term. Particularly, there should be specific estimations in the short-term about some criterias such as: the number of users acquired, the amount of ADA circulating within the system, the quality of rewards, the quality of contributors,... The similar should also be applied in the long-term. Moreover, I think that some management tools such as JIRA should be used to help not only the team but also the investors keep track of the progress if this project is funded.", "q2r": 2, "assessor": "z_assessor_4118", "no_vca": 15, "ne": 2, "ng": 12, "nfo": 1, "vca_o": 1}], "solution": "A platform where developers get incentivized for contributing to open source projects, earn ADA and Skills NFT for every approved pull request, access to exclusive events, hackathons with your NFTs", "experience": "We are small group passionate experience Developer, PM, Marketer\nCo-founder (Dev): https://www.linkedin.com/in/maxlibin/\nCo-founder (Community): https://www.linkedin.com/in/harithbakri/\nCo-founder: https://www.linkedin.com/in/ongweiyee/"}