{"id": 416545, "author": "samchristensen", "title": "\"Munchy Go\" Delivery Food dApp DAO", "url": "https://cardano.ideascale.com/a/dtd/416545-48088", "category": 26595, "amount": 117800, "description": "We Munchy Go Delivery Food dApp, want to cut costs for restaurants, increase couriers pay and save user pockets, on average restaurants pay to delivery food apps 20% to 30% fees.", "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 6670, "q0": "I am not convinced by the value proposition here. Starting with the problem statement, we find out that delivery apps take a 20 to 30 percent cut from food deliveries, which is definitely the case not only for food delivery platform, but as well for ride sharing and short term rentals - this is the way the business model works since the initial creation of the platform takes significant resources to build and afterwards network effects kick in in case of a successful implementation. \n\nMunchy Go intends to use smart contracts in order to increase efficiency and automate and simplify delivery services, but it is not very clear what the benefits of using a blockchain application really are. The success of similar applications (and there are plenty around the globe) rests more in the way it is implemented and in the fine balance between usability, network effects, keeping costs down and end customers happy. It is also a market prone to dumping prices by new entrants, and we frequently see races to the bottom in individual applications for countries or cities in particular niches. \n\nThe proposers also claim that one of their goals in building a decentralized delivery solution is to cut the middlemen, but I not sure this is possible or even desirable on this market - since there are a multitude of players on each side of the isle: restaurants, delivery services, consumers, and an incredible number of regional specificities that have to be catered for. Given the ferocious and diverse competition existing in this niche, I am not convinced that a blockchain solution would bring real benefits to end users or end up being more cost efficient. Also, the team does not mention at all transaction costs and network utilization. Since it will be a blockchain solution that means a myriad of mini transactions have to be recorded perhaps: food orders, pick-ups, payments, cancellations, etc, all of them in real time and with minimal interference for the end users, with seamless integration. Despite this challenge there is nowhere in the proposal any meaningful discussion on necessary throughput, transaction costs and the adequacy of the Cardano ecosystem for this. \n\nMy honest advice is for the team to go back to the drawing board, analyze the business model of existing players in great detail and find a way to offer a blockchain based solution that can integrate into an existing platform instead of starting something from scratch: for instance payments, or a zero knowledge solution for end users to have less access to personal information. \n\nGiven all of the above I remain neutral towards the impact that this proposal might have and I am only offering three stars.", "q0r": 3, "q1": "Munchy Go seems to have a marketing and business development team behind it, which is very good news since it seems to be the type of project can can be made or broken depending on the team’s capacity of building solid business solutions and partnerships with other stakeholders. The actual build will most likely be outsourced to Mlabs, but it is not very clear - since they are listed as partners and the budget mentions hourly pay, but without being very specific on the details of who actually will develop the application. \n\nThe budget lists around 1k hours for the development, at an hourly rate of 80 USD, and 25k USD for marketing, but without going into the details of what kind of marketing efforts will be undertaken. \n\nHaving Mlabs as partners and a solid business development team, it is likely that they will come up with a workable MVP at the end of the build, so one can’t really fault their capacity to deliver on their promises or to question the feasibility of the project. Five stars. ", "q1r": 5, "q2": "The team promises monthly reports for tracking the project's development.Interestingly, they provide three levels of success in terms of adoption. Level 1 would be an MVP, thus a functioning product. Level 2 mentions a more efficient, cheaper and safer application, but without offering additional adoption measures (number of restaurants, end users, cities covered, etc.). Level 3 would be a flourishing ecosystem rivaling existing delivery applications. From my point of view this is an interesting approach but not at all operationalized wisely. None of the three levels of success bring any tangible numbers to the table and it will be very difficult to judge it in time, especially Level 2. Level 3 on the other hand seems overly optimistic and it is very unlikely for such a solution to be available to the big players on the market within a meaningful timeframe.  \n\nI think four stars are almost appropriate, indulgently since the proposal needs better success metrics. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 8308, "q0": "Before I dive into anything, first I have to give a round of applause to the team for delivering an overall well-composed proposal. It’s also well-organized, the intention is straightforward and methodology is efficient, and I believe that it is a smart decision by the proposers to target the food and beverage world as the industry has not been receiving the attention it deserves. \nOverall, the proposal wishes to cut down the expenses for restaurants, increase courier pay and at the same time save up an amount for users, thus improving the general productivity of businesses and quicken the process of food ordering and delivery. \nUsing Smart Contracts, the project shall remove the conventional presence of a middleman-like platform and connect directly to the target stakeholders (and also the benefitians above), which are the Restaurants, Couriers and Customers who want to migrate to the app. The Smart Contracts are said to speed up the process of ordering and delivery via app efficiency and automation, applied from the moment you look through the menu of a restaurant or vendor to the second your food is delivered at your doorstep. \nWith this project, the proposers aim to tackle the existing issues with fee-charging within two existing models, B2B (business-to-business) and B2C (business-to-customer), specifically to reduce expenses as mentioned above. Currently, traditional food delivery platforms charge on average between 20% to 30% for each order made in-app, and an additional 1.5% to 3% fee is charged for each transaction if you use payment gateways, such as credit or debit cards. With Smart Contracts, all stages are scaled down into one single page and a much lower fee rate of only 2.5% to 5%, thus enabling customers to save some money, which should be extremely welcoming since the world economy has been receiving a major strike from the COVID-19 pandemic and gas prices have been skyrocketing ever since the war between Russia and Ukraine broke out.  On the B2C level, the Smart Contracts tackle the concern of security and customer satisfaction due to the fact that, as mentioned above, Smart Contracts remove the involvement of third parties payment platforms and integrate every step of the process into one united front, the customers will now pay directly from their linked wallet or payment method and their money will come straight to their vendors or delivery parties. This project also aims to benefit Cardano by concentrating on delivering a fully functional and seamless app that will hopefully soon pave the way towards a Decentralized Autonomous Organization (DAO), which should fit inside the scope that this Dapps, Products and Integrations requires from each proposal. \nHowever, there is one small flaw I would like to point out. That is the lack of key metrics used to measure the different standards of success and profits they expect to gain with this project.\nThe proposal has also listed down a major risk for the project, which relates to the ability to create enough wallets that interact smoothly with the Smart Contracts via API, and a slight concern regarding the Marketing process. The team has yet to have a plausible resolution to mitigate or eliminate the risk, for now they hope to be able to tackle it in the coming months with extra efforts amongst the involved parties, but the Marketing concern has already been underway with the handling, with multiple social media channels being utilized and partnership with Youtube KOLs and community leaders to help promote the project.", "q0r": 4, "q1": "From the provided timeline and assigned tasks at each segment, I have high hopes that the team will be able to finish this project with all features and functions available and achieve what they set out initially. Nevertheless, the team has not mentioned the beginning date of execution yet, thus no expected final day either, and the milestones for each phase as well.\nOne highlight of this section is the analysis of the requested budget, where the team has carefully dissected and described in detail what would take place at each activity and how much they will cost respectively. Therefore, I can safely say that the applied funding is justifiable. \nThe list of team members involved in this project is another job well-done. All 4 of them come with the descriptions of their positions, duties and responsibilities, along with the relevant experience to the project. And the team has also enlisted the support of Mlabs, a blockchain consultancy company well-known in the cryptocurrency world. The only things I would hope to be additionally included are perhaps the LinkedIn profiles that demonstrate further the capabilities of the hands on deck for further verification and assurement.", "q1r": 4, "q2": "In terms of auditability, I strongly believe that the team has obtained a positive-looking level of it, as illustrated via the team meetings and monthly reports. To be specific, the team meetings will be dedicated to assigning work and report progress and updates of the project, both actions made on productivity-targeted platforms of Slack and Asana. And every detail of the meetings will be publicly available later on. The same thing applies to the monthly reports as well, where news, changes and updates to the project will be published, along with the numerous milestone-based key metrics and adjustments to the MVP.\nFor the team’s vision of success, they have presented 3 variations ranking from initial short-term to medium and long-term. All of them depict the gradual growth and desirable outcome of the project, and has not failed to include Cardano into the mix, with the ultimate success seeing Munchy Go become the industry leading food delivery app and massive adoption of users to both the app and Cardano, all of which aligns comfortably well with the objectives of this Dapps, Products and Integrations challenge. I would have loved to see some estimated figures to further solidify a great performance, but this is just as sufficiently well-rounded as it is.", "q2r": 5, "assessor": "z_assessor_2974", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 3671, "q0": "This project wants to create a decentralized food delivery app. This would give greater ownership and a voice to stakeholders like restaurant owners and delivery drivers. By creating more competition in this space, restaurant owners and delivery drivers can hopefully keep more of their earning for themselves and avoid the rent seeking behaviour of centralized web2 platforms like Uber Eats and DoorDash. The platform could also be expanded in the future to include other forms of delivery such as for postal services and last mile ecommerce delivery. If successful, the project could also mobilize their huge network of delivery drivers to do ride hailing too. However, some of the team’s claims should be moderated such as it being “a new product category” as this already exists. Most consumers do not care if food is being delivered in a web2 or web3 way, they care about cost, timeliness, choice and quality. \nThis project wants to create a decentralized food delivery app. This would give greater ownership and a voice to stakeholders like restaurant owners and delivery drivers. By creating more competition in this space, restaurant owners and delivery drivers can hopefully keep more of their earning for themselves and avoid the rent seeking behaviour of centralized web2 platforms like Uber Eats and DoorDash. The platform could also be expanded in the future to include other forms of delivery such as for postal services and last mile ecommerce delivery. If successful, the project could also mobilize their huge network of delivery drivers to do ride hailing too. However, some of the team’s claims should be moderated such as it being “a new product category” as this already exists. Most consumers do not care if food is being delivered in a web2 or web3 way, they care about cost, timeliness, choice and quality. \nIt should also be pointed out that this team made 2 proposals across different fund challenges, one for building out the DAO side and this one for building the dApp itself. It is up to the voters to decide if $117,800 is worth spending on an area which is extremely competitive and margins are low even though centralized food delivery apps impose seemingly high and extractive fees.", "q0r": 3, "q1": "The team has many years of experience across different aspects of software engineering in general and more specifically Haskell and Plutus, plus their partnerships with Clear Contracts and Mlabs should help them with most obstacles that they might encounter. 7 months is ample time to implement the project given that it is not a new product category.\n\nWhat isn’t clear however, is whether the team needs to clear regulatory hurdles to handle food deliveries. Since the team did not mention where they would launch, some countries also might not recognize cryptocurrency as a valid form of payment and many restaurants might be hesitant to accept payment in cryptocurrency. If the team finds that they need to build a crypto to fiat bridge for restaurants if they do not want to receive crypto, the project could take longer than expected and hence I stress again, that is why proposers should always include a buffer to their timelines as there would be something that will almost always delay their ‘perfect’ plans. \n\nThere is also the issue of starting network effects which is vital for a business like this. If there are not enough consumers using the dApp, restaurants are less likely to come onboard. When there are fewer restaurants onboard, consumers are less likely to use it compared to the web2 alternatives, a classic chicken and egg problem. But this could be mitigated if the team deployed their tokens effectively to jump start their network. In conclusion, the main feasibility issue is not technical but business and legal.\n", "q1r": 3, "q2": "The team will publish their meeting minutes and release monthly reports detailing things from the dApp’s usage statistics to code. While all this is good, it will be even better if the team could open source their project and link a github with their proposal which should only take 2 minutes to create. The team can also consider building a dashboard like those seen on Dune Analytics both for themselves to monitor key business metrics and accountability for the community. ", "q2r": 4, "assessor": "z_assessor_2468", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5985, "q0": "As a marketplace for food delivery, the proposal meets the challenge goals. Munchy Go wants to enter an existing market and has to compete with several other rivals (for example, Uber eats). Munch Go intends to compete by being more cost-effective through the Cardano Blockchain and, secondly, enhance the user experience by implementing a smart contract, so the user is only charged when the smart contract is fulfilled. If both featuers are met, I think they can compete in this market. The proponent stated in the proposal that they only need funding for a Minimal Viable Product(MVP) by declaring this is a \"one off event\". Munchy Go aims to be self-sufficient after this funding. ", "q0r": 4, "q1": "The team is large enough for this part of the goal of this funding, Minimal Viable Product(MVP). They also aspire to work with a Blockchain consultancy company, Mlabs, which is a good thing because there is no mention of any prior Dapps developed by any team members in the proposal. The team members' descriptions are well written, but I would advise adding links to the team members Linkedin for extra clarity. I'm missing in the proposal some examples of how the interaction will work for the restaurant, consumer and delivery driver. \n\nThe budget breakdown is simple, and I would advise the proponent to budget the marketing campaign in more detail. ", "q1r": 3, "q2": "They will make the minutes (notes that are recorded during a meeting) of the biweekly meetings publicly available and, on top of that, will publicise monthly reports. These reports will inform the community about some KPIs directly linked to the MVP and some good KPIs about the progress of the platform as a whole, like onboard and returning customers. The stated criteria for success are well written out but hard to quantify. I would advise the proponent to add goals like X users adopted. ", "q2r": 4, "assessor": "z_assessor_2767", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8580, "q0": "The problem raised by this proposal is straightforward and relevant to the challenge's objectives, as is the solution proposed to tackle it. According to the proposers, they want to cut costs for restaurants, increase courier pay and save user pockets by using smart contracts to decrease layers of inefficiency, improve business performance, integrate orders, cut costs, automate and simplify food on demand services. The proposal's key metrics and goals correspond with the defined challenge settings, and the author did a good job of presenting the impact such a project may have on the Cardano ecosystems in a brief but thorough manner. The team thinks that by leveraging Cardano smart contract security and verifiability in daily use cases, they will drive business to Cardano and significantly increase Cardano widespread adoption. As a result, I feel this idea is of great value and fits the requirements of the challenge.", "q0r": 5, "q1": "In terms of the proposed team and team members' expertise, I am certain that they have what it takes to deliver the expected results. It is evident that they have the necessary expertise and experience to carry out this project. However, no links or sources were offered to validate this information. It would be beneficial to add at least their Linkedin profiles or social media accounts in the proposal so that the community can get to know the team behind this idea better. Also, the team named MLabs as their partnering company, which gives voters trust because MLabs obviously has extensive expertise in the ecosystem, having worked on some of the most important Cardano projects. I would recommend including a link to the company website rather than simply stating it so that readers can learn further about the team, their previous work, and their skills. The implementation plan outlines each task, as well as the milestones and the time frame within which they are expected to be completed. The budget proposal is $117,800, which is appropriate considering the workload necessary to finish the project and should provide enough resources for the 27 weeks projected coverage. The team divided the budget into three major components, each with a short statement indicating what activities were included. I consider the hourly rate the team estimated to be reasonable, it is positive that they tried to make everything realistic as much as possible by researching market prices per hour for Plutus/Haskell developers/engineers. The allocation of $25,000 for Marketing and communication might appear vague at first, the community will need to know how the team makes use of the $25,000 they requested in a specific manner. But as it is considered an essential engine of the risk section, I can find details dedicating how their Munchy Go community of early users will be built in order to do justice to the finance division presented. At last, I wholeheartedly believe this proposal is likely to be successfully implemented.", "q1r": 5, "q2": "The detail in the action plan and the possible difficulties that the team may confront is fascinating and in line with the suggested idea. They did an excellent job of presenting the milestones within two weeks, twelve weeks, and fifteen weeks, each with a brief discussion of what would happen and in what order. Furthermore, the team outlines in detail what success metrics they anticipate to have, which I believe are significant, allowing the community to keep track of the development. The success definition is thorough, including levels of successful adoption, so we can know for sure how this Dapp would scale up particularly, but I would recommend the team to clarify the timeline for each level they presented. For example, the proposers expect how long the first level of success will be reached and so on. This will help the community to fully comprehend how the project is developing and where it is heading. Aside from that, it's really encouraging how the team will keep the community in touch with the monthly report and a list of what will be included within it, which I think will be very useful to have a picture of the implementation as over the months data was shown and the exact current status of the project explained. It is also incredibly beneficial because a team meeting will be held every two weeks to overview input updates, and afterwards meeting minutes will be made public. This way, they can ensure that everything is completed as promised and within the timelines. If not, identify the faults and work together to find solutions. I am confident that this area of analysis is being well handled.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9374, "q0": "The proposal intends to create DAO Munchyfood delivery dapps using Cardano technology with Token as a payment attributes. Food delivery app has gaining popularity even more than before since pandemic, this is a kind of everyday uses implementation of Cardano technology that could drive adoption of Cardano. It will be beneficial for the food business to save the cost and also valuable for customers to provide a secure and safe payment system. I like that they have shown the comparison cost for business owners between the traditional food delivery app. The proposal meets the challenge and goals settings.\n", "q0r": 5, "q1": "As whole, the proposal is equipped with a clear planned main deliverables and outputs of the project. However, the reference links on Linkedin or Github to publicly identify relevant professional skills and works of each member is not provided. \nIf I understood well, the proposer divided the project into 2 proposals, which is a good idea considering the size of the project. It could be more rational if they break down the first proposal budgeting to the research of UI/UX, MVP constructions and the second proposal budgeting for the 7 weeks MVP launching testing and the marketing cost. The proposer gives out a marketing budget but it will be better if it has a marketing plan with details about the customer acquisition plans (like what kind of medias, channels) which is important for a successful adoption. It would be better they also laid out the plans to monetize the platform in numbers.\n\n\n\n", "q1r": 3, "q2": "If they could provide a Github repo for the development,I think it's helpful for community to track how the proposal is progressing. The proposal gave a clear 3 phases roadmap but it could be helpful if the proposer detailed out a reasonable timeline with each deliverable. For example: the first level of adoption is in the first 3 months since funded, or how many users targeted in the first level of adoption. \nOverall, The proposal is quite complete and consistent with the ideas presented during the feasibility plan which is generally an MVP with some complete functions.\n\n\n", "q2r": 4, "assessor": "z_assessor_3048", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14730, "q0": "\"The potential applying smart contracts was tremendous, and of in the food supply chain, Munchy Go worked as a food delivery Dapp between restaurants, couriers, and consumers. I agree with the proposers that the current food supply chain heavily depends on the delivery food apps working as middlemen (20-30% fee charge). Thanks to this app, the cost for food could be significantly reduced. \nThe proposers clearly explained how the platform works. This was a win-win deal for both restaurants (cutting off operational costs) and consumers (bringing trustworthy and secure payment method). Moreover, the couriers may increase their incomes. \nBeside the risks stated by the proposers, there are also the risks come from the adaptability ability of restaurants and consumers. They may be familiar with the traditional food delivery app, and on the other hand, the blockchain-based food application is quite complicated to use for the general public. \nThe success of this project could gain great attraction from the restaurants and consumers; thus, the Cardano ecosystem can gain great benefits. The solution in this case is well aligned with the challenge setting. \"", "q0r": 5, "q1": "\"The roadmap with approximate time needed to be done were provided. However, I think the proposers should divide the roadmap into several sub-tasks, state exactly the given date for each task process, and if possible, provide the methods for task execution. For example, the task “user interface” includes conceptualization, designing, coding, etc. \nThe budget was well break-down and the good point was that the budget was in accordance with the roadmap. However, I did not see the marking costs included. The human resources comprise of experienced experts having strong backgrounds related to blockchain and business, indicating that the human resources are enough for project implementation.\"", "q1r": 4, "q2": "It was good that the meeting information and monthly reports were announced the community. This will increase the credibility as well as auditability of this project. I thought there were enough KPIs and metrics provided. However, the proposers should include the specific number of KPIs/metrics they plan to reach in a certain length of time, as well as the methodology by which they would be evaluated, in my opinion, since I don't think simply stating the KPIs was sufficient. For example, there will be 10000 users onboard and 100 restaurants partnerships one month after the project is launched. ", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14970, "q0": "Generally, the main idea of this proposal is to integrate smart contracts into “Munchy Go” - a food delivery application. By doing this, the proposer would be able to reduce operational costs, increase customers’ satisfaction and generate more efficiency towards restaurants. The advantage of this project, compared to other existing traditional food delivery services, is that it applies Blockchain technology to automate every step included in a transaction. This allows the application to optimizely reduce its partners’ transaction fees into 2.5%-5%, different from traditional platforms with 20-30% charges for each delivery. Moreover, developing a service focusing on customers’ feedback and attitude is also a great point, which might create loyal customers, attract more potential customers and ensure a long-term development of the business. However, there is one omission point that I would like to offer. As the author mentioned that the payments would be done after the customers are well-served, I believe that there would be some cases that someone tries to abuse the business by ghosting orders or giving negative feedback intentionally. These are the problems that might happen and cause business partners’ dissatisfaction when all the priorities are towards customers. I suggest the writer describe more about the solution to these troubles, as they are existing risks that prevent a successful project from being delivered. Overall, the information given in this section is well-written and logically ordered. The proposer has successfully brought up an application that utilizes the features of Blockchain technology, as well as aligns well with the challenge setting. Not only does this project create a good competitive advantage and a huge impact in the delivery industry, but also it widens the Cardano ecosystem and brings more potential users to it.", "q0r": 4, "q1": "In this section, an estimated amount of time needed to actualize the plan was given, which includes approximately 27 weeks, divided into 3 phases for different objectives. However, the timeline and the milestones were not clarified enough. My suggestion is that the developer add more details about steps to be done, the methods to get them done, the amount of time required for each task and a specific date to make the first moves. By doing this, the Catalyst would be able to have a more objective view about the feasibility of the project. Besides, the budget breakdown is quite specific with the amount of hours per week, price for work per hour, the total amount of work hours throughout 27 weeks and the total amount of money required given. I believe that this is a huge number that needs a thorough consideration from the Catalyst. In my opinion, the developing team should offer more information such as how the design of this application would look like, what marketing strategy would they use, what social media platforms would they approach, how many designers/programmers would be responsible for the developing tasks and whether they would be capable of doing those,... Answering these questions would draw a more complete imagination about the project. Nevertheless, the team member introduction was quite clear with a brief CV about roles, work experience and education. One additional point that I would like to make is that they should add an affiliate link for further background checks and verifications.", "q1r": 3, "q2": "About 2-3 meeting appointments per week were scheduled by the team. Also, monthly reports were promised to be given, which concludes the progress of the project and key points related to milestones. Furthermore, the key metrics were settled obviously and sufficiently. Success measures are defined through 3 different levels with particular ambitions. In my opinion, these are important points that prove the dedication as well as the thoughtfulness of the team. Yet, I would highly recommend that they settle some more specific KPIs to be achieved as well as detailed sustainable development goals to ensure a long-term growth of the project.", "q2r": 4, "assessor": "z_assessor_4118", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "We will use smart contracts to decrease layers of inefficiency, improve business performance, integrating orders, cut costs, automate and simplify food on demand services.", "experience": "Samuel Christensen Co-Founder, 2 years as Blockchain investor, Cardano Developer with focus on smart contracts and how to apply them and build real use cases.\nRicardo Parro Co-founder, 10 years as CTO, 2 successful exits, one of the exits in the restaurant industry"}