{"id": 416638, "author": "adamg", "title": "Online tools for generative artists", "url": "https://cardano.ideascale.com/a/dtd/416638-48088", "category": 26595, "amount": 96050, "description": "The challenge of building a generative art collection on Cardano is significant.\nLearning blockchain technology acts as a barrier to entry for existing artists and the current tools are inadequate.", "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": [], "media": [], "f6_assessments": [{"id": 1655, "q0": "The problem to be solved is quite clear: there are no adequate and simple tools for artists to build generative art on the Cardano blockchain. To mitigate this situation, “a web application code editor and viewer will be built together with a compact art engine, specifically designed for on-chain art creation directly integrated with a coining service and virtual gallery”. The solution will make Cardano a standout platform for creative coders, according to the proponents. This exactly meets the objectives of the challenge, as here we are looking to create Dapps that add value to Cardano through new functionalities; and we know how NFT art is a hot topic today, but that most tokens are minted on other blockchains, for a number of reasons, but I believe that mainly because Cardano is a third generation blockchain that still doesn't have so many running projects in this regard. It is said that the site will be created with a focus on artists, which is quite relevant, as most of the interfaces I find in projects here are designed for an audience that is already more familiar with blockchain and the technologies that involve the cryptographic world. I believe that this proposal will bring in a good number of artists, if executed properly, and with that the goal of increasing the number of active members in our community will be contemplated. Other minor objectives that will be met: probably the number of CNFTs in circulation will increase; Cardano's digital wallet number as well, since these artists will have to store their tokens and also receive revenue from sales (which would likely be made in Ada, which would already be serving another objective of the challenge). It is very positive as the authors include a very detailed detail on how the activities and functionality of the platform would happen, for example: “Online code editor and viewer, allowing artists to write and refine their code and see the results in real time with just one click / the ability to save and work on multiple projects within your personal workspace / a custom framework for parameterizing creations and creating complete collections based on the distribution of values ​​within those parameters / etc.” My only observation, therefore, would be the following: I would like it to be conceptualized in the proposal itself what would be a generative art, it is not such a usual concept and seen in other proposals. Other than that, I believe that the impact of the proposal will be quite high and certainly the situations brought up in the proposal presentation: \" The challenge of building a generative art collection on Cardano is significant + Learning blockchain technology acts as a barrier to entry for existing artists and the current tools are inadequate” would be resolved well.", "q0r": 5, "q1": "Feasibility is good, but the first topic is inappropriate. When we talk about script, the explanations are very superficial, as we can see in the examples: ”August: Complete framework design + Onboard additional resources. September: Generative art Platform and website/online gallery build. October: Platform ready for internal testing (end October)”. Few details are given about what would happen as months passed. For example, in August, activities would be in relation to the delivery of the complete structure project + additional resources on board. What kind of resources are we talking about? How would the development of the structure project be done, which professionals would work on this part? The same detail could have been provided for the other months. For example, in September, it is said that the website and the online gallery would be built: certain designers and programmers would be responsible for these parts, but we don't know exactly how their work routines would be. The way the script is laid out, we only have a notion on top of what would be done, our degree of understanding is not solid. Therefore, for this part to be better, more detail could have been given about each activity. The other parts are much more satisfying. The amount requested is quite high, but it is simple for us to understand how the requested amount would be used because, basically, it is detailed into which parts it would be divided and how much the work hour of the professionals involved would cost, for example in “Blockchain Developer: $50 per hour, 20 hours/pw - $50 20 17 = $17,000”. What was a little confusing in my view was the numerical sequence “50 20 17”, but other than that, we were able to understand how many hours this professional would work and also what would be the price assigned for his hour of work. My only suggestions on the budget would be to understand some parts even more in detail. Under “Application Hosting and Subscription Services”, what would these services be and why would they cost $1000 of the total amount? In relation to marketing, what would be the dissemination strategies adopted by the team? After all, the publicity part is essential for the platform's success, as the goal is for new artists to join Cardano through the interface developed here. Finally, the team is presented perfectly, in my opinion, because we know a lot of information about each participant. We know their names, what professional area they work in, detailed CVs, linkedin profiles - which serve as a portal for us to verify all the information said - and it is also clear how some of the team members have experience with Cardano, greatly raising the level of trust of which is a team prepared to deal with this project. That said, I believe the part that would need to be more in-depth would basically be the script - the others are fine.", "q1r": 4, "q2": "The topic is fine, better in some parts than others, but in general the proposal is auditable. The auditability of progress, specifically, is perfect. The team already defines how the monitoring of progress would be done: the manager will make a schedule and monitor the use of resources, performing a general management, as the proponents claim. It would be nice if additional features were defined as well. Speaking of management tools, we know exactly which ones will be used and how (“trello will be used to manage tasks, assignments and progress + git will be used for code review control to ensure a robust project and release process”). In addition to this internal organization, the team makes it clear that the Cardano community will be updated on advances once a month. It would be positive if the proponents defined better what would be monitored, exactly, if it would be the process of developing the stages + partial results or only the partial results. However, in general, the monitoring of the project development is very adequate, several ways in which the project will be audited are informed; I could comment that the superficial script makes it difficult for us to carry out such monitoring, but from what is understood, a more detailed schedule would be drawn up, to be followed. When talking about the final results and the success scenario, however, the level of specificity drops a lot. It is said that the goal would be “the platform being fully functional, tested and producing artist collections. A success in the first 12 months would see a minimum of 4-6 artists per month using the platform, with over 50% publishing live collections.” How could we measure the consequences of using this platform for the Cardano community? It would be very positive if a more in-depth research were carried out, so that some data could be explained, such as: a) how these new artists would be integrating our community, would they be getting involved in other Catalyst projects, for example ? b) was there a migration of artists minting their active tokens on other blockchains to Cardano, because of this interface? c) would these artists be creating new digital wallets and trading their CNFTs in Ada? That is, a more detailed analysis of how this all affected our blockchain and if, truly, the objectives of the challenge would have been achieved. How can we make sure the challenge-specific KPIs would be met, for example: “increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases and increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products”? I think the proposal is indeed auditable, but a more careful study could be done in relation to the final results.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 8581, "q0": "The solution statement makes sense in light of the problem statement, and both are expressed clearly. Given that the challenge of building a generative art collection on Cardano is significant and learning blockchain technology acts as a barrier to entry for existing artists and the current tools are inadequate, with the goal of overcoming this issue, the proposer build a webapp code editor & visualiser in conjunction with a compact art engine, specifically designed for on-chain art creation directly integrated with a minting service and virtual gallery, which I consider to be fitting with what the challenge objectives are. Nevertheless, I see a lot of room for improvement here, particularly in providing additional information about how this dapp would operate. The author of this presents potential dangers to the project's implementation. They are aware that this is a competitive business and that the project should be completed as soon as possible; however, more information on how they will deal with the restricted funds to bring in additional resources as mentioned if they do not acquire enough of the requested money or how they would encourage users to use this webapp would be preferred. The part that the team's target includes artists not yet familiar with blockchain and NFT’s and attracting them with marketing & outreach expertise is quite subjective. A brief paragraph detailing the potential solutions will greatly improve the idea. Furthermore, the proposal's objective and metrics are in line with those specified by the challenge, but I recommend that the team include more explicit details so that all people could comprehend them better. In terms of some opportunities for improvement, I am unsure whether implementing the proposal will have an influence on the community.", "q0r": 3, "q1": "The budge is divided into six components, making it clear where the money goes and what it is used for. I must mention that $50 for the development field is reasonable, and they have previously stated how many working hours each week. However, I feel that more information is needed to guarantee the community's trust. For example, while marketing is vital in the project, the author might mention how they are advertising, given that the $2400 total for marketing is not as clear as I expected. The proposers have supplied references in their profiles, and they have a wide range of talents and abilities, so I am confident in their capacity to meet future problems. Although there is a set number of knowledgeable and motivated team members, there is opportunity to advance and scale. For instance, I see two team members with no verifiable referrals to confirm. Although I can find theirs with little googling, it would be nice if the team provided appropriate links such as LinkEd or Github since listing the general description of experience is fine, but it doesn't add any credibility to the proposal because there is no verification of the claims. A thorough roadmap, including a timeframe and important milestones for delivering the proposal, is another piece to address in order to assess the project's feasibility. It appears that the proposers have a reasonable plan for project execution and a decent sense of what has to be done and in what order, which is very good. There is a realistic timeframe for completing all of the listed necessary work. The project specifies how it will be carried out and what implementation will be utilized; we are informed what will be done from August to December. Nonetheless, I feel that more information about these activities, such as which weeks of the month each would be conducted, who would be the professionals participating in each step, and so on, might be presented. In this sense, our picture of the process would be more concrete. Without specific detail, unfortunately I don’t think the idea is feasible.", "q1r": 2, "q2": "Although I do not rate the feasibility high, I do admire the team's efforts in terms of auditability. There is a clear connection between the problem statement and the solution, allowing the proposer to flesh out a convincing proposal. The road map has enough milestones to make monitoring this proposal auditable. Measurable KPIs are mentioned, which are both achievable and understandable. The proposers propose a monthly community report that will contain progress metrics and insights into the challenges and successes for that period, but no indication of which channel or platform will be used. However, I think that the information provided is sufficient to audit the proposal's development and success, thus I rank it with a score of 4.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "The feasibility assessment seems very critical especially when talking about a more detailed breakdown of the roadmap. \nAt this stage of the project we have defined a high level set of milestones that would be achievable, but until funding is allocated it would not be prudent to try to break the milestones down into specific subtasks, this comes later in the lifecycle of a project when specific resource can be funded and brought together to create a detailed project plan.\n\nWe also challenge the final statement in this section \"I don’t think the idea is feasible\", we have identified the exact skills and resources required to build this project, the team have the necessary relevant experience in these areas and we have no doubt that building this project is achievable."}, {"id": 8683, "q0": "This is a proposed project to provide a method to reduce the barrier to entry to Cardano for NFT artists by building a platform that supports faster NFT creation and issuance, thereby creating the creative impetus for NFT artists and attracting a large number of other NFT artists outside to join the Cardano community. In my opinion, this project fits the Challenge key metric perfectly. If the project is successful, in addition to providing an environment and motivation for NFT artists to create, the potential of the project also contributes to creating diversity for the NFT market and NFT trading on Cardano, promoting more interaction on the blockchain. Through the description of the author's proposal, we can also understand how it works and what features will be updated so that it can reduce the effort and time for artists to create NFT. In addition to promoting interaction on the blockchain, the platform will also educate artists and art collectors about Cardano and NFT knowledge, which is a great idea. The authors also built for themselves solutions to minimize the risks they may encounter in the future.", "q0r": 5, "q1": "The project development roadmap is designed in the short term to be able to limit the division of users into other competing blockchains, so the presentation is quite brief but to the point, the information about the test run date or The platform's official release is also clearly estimated. The detailed budget breakdown presented in the proposal is sufficient for comparison and audit. The formula for working hours x corresponding remuneration is always recommended by me for other proponents and luckily I found it in this proposal. Information on key members of the project is described as detailed, summaries of work experience and previous work that can prove the feasibility of this project, many of whom have great knowledge, and actively participate in the Cardano blockchain.", "q1r": 5, "q2": "There will be no major obstacles in auditing and measuring the progress of this project. The work will be controlled by Trello and Git tools, which are great management tools so that proponents can understand the status of their tasks. Monthly project progress updates will be how those interested in this project can receive notifications about it. The roadmap is clearly built and the KPIs given are the most appropriate to measure.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13971, "q0": "The proposal looks to reduce to the barrier for entry for those looking to create generative art collections on Cardano. This could serve to bring in new users unfamiliar with blockchain technology. The proposal does well to define the problem and identify why their platform could act as a solution. The proposal suggests it will bring in new use cases by providing a platform in which the nft is generated and can be sold reducing the workload and knowledge required by the artist. Proposers should detail fully how this does bring in new users and leads to greater adoption of Cardano as a whole. Considerations of how successful projects launched through the platform could benefit the ecosystem as whole should also be considered. The proposal clearly articulates how the proposal will be beneficial for bringing in code artists (a niche group) and in turn increase use cases of Cardano as a platform. In future proposers would benefit from explaining how the art these artists generate would enrich the wider Cardano community. When considering the risks, the proposal refers to losing potential users to competing blockchains. An explanation of why this could occur and how the proposers would combat this by providing value to the community would serve beneficial to proposers If the project provides greater value, proposers should be confident it can be a leader regardless of competitors. Proposers should look to explain how they will scale to meet this challenge-providing unique features or benefits. The proposal refers to getting the work done in a shorter time frame to combat competitors, but this doesn’t appear to suggest sustainability or long-term growth. Suggesting how the project will scale to avoid being outcompeted would serve proposers better and create confidence in the sustainability of the project after initial investment. The team clearly identifies that marketing will be key to ensure the proposal has the intended impact. The issue of marketing will be well mitigated by bringing in external experts in terms of marketing but how this is done is not detailed, referencing the type of marketing (social media for example) would once again  better serve proposers when looking to provide verifiable mitigations.", "q0r": 3, "q1": "\nThe proposal does provide a timeframe for the work to be completed and some targets for work to be done. Within 6 months the project is expected to be up and running. In regard to the plan provided although tasks are mentioned no task specific timeframe is provided, neither who is responsible for each task. In future the hours or weeks allocated to each task aligning with who is responsible and how they are being paid regarding this would be more appropriate. At this moment the pay structure assumes that nearly all members of the project will be working the same number of weeks aligning this with the time frame for each task will provide clarity and improve the my confidence as a PA in the feasibility. Having such a small team, proposers should look to clearly outline the tasks of each individual, ensuring it is a manageable and realistic workload. In the budget break down there is reference to marketing and hosting services and app subscriptions. Both are appropriate budget allocations but further clarity on what application subscriptions and hosting sites would serve beneficial. In regards to marketing, reference to whether this will be specialised for example on social media -running of fb ads/Instagram ads would serve proposers well. Considering that ‘marketing’ will be result paying an external agent the details of this person and credentials they hold also would serve beneficial. This would ensure that funds are well allocated. When reviewing the credentials of the team I was impressed. The team display a good knowledge of the space all having prior experience with Cardano nfts as well as bringing in ‘real world’ experience. All have previously worked on Cardano projects and hence the enhances my confidence in their ability to deliver. Although a small team previous experience will provide an edge that could make up for numbers. The team note they have no plans to request funding in future but fail to explain why. If the site aims to be self-sufficient, how this will be achieved is key if proposers wish to display a sustainable future for the project. Without this the long-term feasibility is brought into question. Despite the issues found the knowledge the team does present means  I do believe the project is feasible(no one on the team is working on other projects)  but if funded the proposers should really consider the projects direction after initial release .\n", "q1r": 3, "q2": "The proposal refers to internal progress trackers. It clearly identifies who will be responsible for tracking this progress (project manager) and how said member of staff will do so (provision of additional resources/scheduling. The team plan to use an online tool (Trello) to manage tasks, assignments and progress- use of automation could serve beneficial by taking out human error. Further use of automation is seen with use of git to revise over code. The team claim they will provide a community update to show metrics and insight into challenges faced. What metrics /insights the community will be provided is key in determining in whether viable information to be audited will be provided in these updates. Where these community update reside is also key information, proposers should detail whether they will post these updates on social media platforms and the reach these platforms will have. Some kpis are provided with in the first year a minimum of 4-6 artists per month using the platform deemed a success indicator. The proposers should consider more quantitative indicators like the number of nfts generated and even the volume of the projects that have used the platform. New user numbers/website hits and referring to the greater adoption of Cardano would help proposers provide kpis that allow for auditability as the current ones don’t provide enough for the community to gauge the success of the project.\n", "q2r": 2, "assessor": "z_assessor_3865", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 15355, "q0": "“Online tools for generative artist” proposal addresses Dapps, Products and Integration by creating a webapp code editor & visualizer. Their V1 of Blockgeneration.art will be redesigned and integrate with minting engine so that the artists can create NFT collections at ease. According to Wikipedia, \"Generative art refers to art that in whole or in part has been created with the use of an autonomous system.\" This includes not only code artists e.g. dtwitter.net but also many more (AI generated NFT).  I would like to give full score in impact as this project is such a unique proposition that will support artists for this type of art in NFT space. However, I would suggest the proposer to make stronger case by mentioning about the Generative art NFT market size (volume traded on these generative arts) and how do proposer scour for these types of arts to be listed (the artists list their NFT collection at free will or via team connection or else).The impact of this solution to the Cardano ecosystem would be much clearer as so far the platform dedicated to generative art is not much heard about and the proposal surely fills this gap. It would give me more conviction if this initiative is worth pursuing if presented with information on total market size, market share of Cardano for this generative art. The team has already done a god job on their V1 webapp and the new features would increase utility and Cardano adoption. “The proposer has cited the risk of delivering the platform as envisioned but in a short time frame and the successful marketing\". However, these 2 risks are satisfactorily mitigated. Once the platform is revamped and launched, I would expect some new flagship collections listed also.  ", "q0r": 5, "q1": "The project has concise plan covering period from Aug-Dec 2022 (17 weeks). Numerically, the budget breakdown is very on point covering hourly rate, number of weeks and number of hours per week. More descriptive technical detail on the plan in each month would make it easier to determine the feasibility of this project and also know when the resources (developers, technical lead, project management and marketing, etc.) are deployed. The task lists are generic and need more milestones detail of what to be achieved in each month. As part of assessor duty, it would be great if I could ensure that the project not only put forth the sensible requested amount but also check the startup/project runway.  The team possesses strong technical capability so surely this wouldn’t pose a problem to highlight the tasks and shares the scope of each role in task lists as we learnt about them roughly in the budget breakdown. ", "q1r": 4, "q2": "The fully functional and tested platform with artist collections would be what the team aspires for. Within first 12 months, the team would like to see 4-6 artists per month using the platform (over 50% publish live collection). The project progress can be tracked via Trello with Git (code design) and monthly community update (with challenges and successes faced by the team. The team has good visibility when it comes to auditing but I would like to see some other metrics that  measure platform progress and traction along these 17 weeks while the project is still in progress. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We will build a webapp code editor & visualiser in conjunction with a compact art engine, specifically designed for on-chain art creation directly integrated with a minting service and virtual gallery", "experience": "Team Experience:\n\nProject management\n50+ years combined Dev / QA experience\nFull stack ERP dev\nGame design, 3d modeling, special effects, VR and generative art\n4 NFT projects on Cardano\n3d art gallery & virtual environment creation\nGenerative art creation & minting/sales solution\n"}