{"id": 416653, "author": "kaizencrypto", "title": "Cardano NFT Gaming - Lovelace Saga!", "url": "https://cardano.ideascale.com/a/dtd/416653-48088", "category": 26595, "amount": 250000, "description": "Traditional gaming doesn't allow users to own their in-game assets. Users can spend thousands of hours playing and don't have any control over their playable items.", "f6_no_assessments": 7, "f6_rating": 4.0476190476190474, "videos": [], "media": [], "f6_assessments": [{"id": 374, "q0": "Lovelace Saga is an NFT driven blockchain game that allows gamers to own their in-game assets. The proposal outlines that it will be a web based game where players earn the assets by playing the game in the form of NFTs. The proposal does not provide any sufficient depth on exactly what the game is about and how it works. It appears to be an action game and based on the information provided. The proposers should have added details on what exactly players do in this game and what is novel and what is similar to existing games of the same genre. A game is only impactful to the ecosystem if it is fun to play and there are people who want to play that game. If it is a multiplayer game then it needs to sustain a number of players to be viable. From the information provided I don't have any confidence that this game is appealing to play because a lack of information was provided. The proposer has covered how it applies to gaming and the Cardano ecosystem and how it uses the technology to a sufficient depth. In terms of the risks they mention improper communication and clarification of results, market volatility, missing timeline goals and complexity for end user. These risks are fairly high level and apply to many proposals however also still make sense. A risk to this game that I would have liked to have seen is the risk the game is not fun to play or the game is not sustainable in terms of the play to earn model. Both of these risks are very relevant to this game, if a game is not fun it makes no difference if its easy to use or is delivered on time. How is the team interacting with the end user to ensure the game mechanics are fun to the user? Is the play to earn aspect with NFTs the main innovation or are there other novel game mechanics that will also help attract gamers who like the same ?genre? Overall more clarity is needed on exactly what the game does on a functional level and why that will be enjoyable to play for the end user, the proposers have articulated well why it relates to the Cardano ecosystem but not what they are intending to deliver and why it will create impact to potential gamers. ", "q0r": 3, "q1": "In terms of feasibility the team break down an itemised list of the development steps required to complete the game. They have indicated that around half of these steps are already completed. A roadmap is provided with a bi-monthly breakdown with the tasks involved. Some of the items here are very high level such as 'Continue development in Unity' which is repeated in most the items. This doesn't add much depth to understanding exact deliverables. Potentially these dates could have been added to the itemised list above? Some more details were added regarding the long term vision of the project. For the budget for this proposal the team mention an average of $60 for most development efforts. The bulk of the budget will pay for four full time developers for a year of salary at $60,000 each developer. The remainder of costs go into one time expenses such as hosting or online services. In regards to the team Kaizen's details are provided who has been active in the Cardano community for a long period of time. A game development team is also detailed with their website and the developers involved including artists and managers. Overall it is hard to give complete confidence in what will be delivered from the execution of this proposal due to the lack of specifics given on the functionality and development steps provided. The roadmap, budget and team details are sufficiently broken down so it appears this proposal should be feasible given the backgrounds of the team provided. In future proposals I would ask the proposers to be more explicit on the specifics of what are being made in the game so it is easier for the assessor to have a more effective educated evaluation on whether it does indeed seem feasible to execute the deliverables given the budget and plan provided.", "q1r": 4, "q2": "In terms of tracking progress of the proposal they mention the growth of the platform and overall engagement of the game. They state they will track whether the user is matching their target audience but this opens up the question is their target audience just Cardano users? or gamers of a certain genre or something else? And then how will they track personal information to track this? They also mention tracking community growth looking at statistics such as for Discord or Twitter. It would have been good to have any mention of how they will do updates with the community and share development progress. They could have mentioned if anything from this project would be made open source for others in the community to benefit from in developing their own games or applications with a Github repository link. Success for the project is shared as bringing 100 new users to the ecosystem each week that are enjoying and engaging in the platform being created. Success also would mean benefiting the Kaizen crypto NFT holders that would receive other opportunities due to the growth of the ecosystem. If this game is successful this outcome would make sense, it would be interesting to know what the proposers think is achievable in terms of sustainable metrics for these play-to-earn values as that helps to give more confidence on what they are defining as a success story in terms of changing peoples lives. These incentives and mechanics are vital to understand to know whether this game will be a viable business model. Overall there is moderate clarity in the proposal, a better explanation of exact game mechanics and functioning of the game could have led to making it easier for the community to audit exactly what is being delivered so it is clear on what they will receive if they vote for this proposal and it succeeds. In future proposals if the team can share how they can help the wider ecosystem with open source contributions this would also be appreciated by the community.", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 1837, "q0": "This proposal is building a play-to-earn game which addresses the challenge of building products on the Cardano ecosystem. It encourages more builders in the Cardano ecosystem. The risks and solutions provided is sensible. But there are other risks I could see such as 1) need teamwork and keeping each other accountable to develop the game as all are working at different time zones 2) someone unable to deliver or continue the project and need to find new person, which could affect the project delivery dates and team dynamic (Both can be solved with more team building). This game can be scaled globally with the right marketing and constant engagement with Cardano community. ", "q0r": 4, "q1": "The team have already been building on this game and they have the sufficient experience to build on this play-to-earn game. It will be more transparent if the proposal has all of team members’ LinkedIn profiles with their experience and expertise. The hourly rate in the proposal is on the high side (after checking from Google the average hourly rate for Unity game developers), but it is justified with 1) the team have decided to build on Unity which have high quality for a game 2) proposer outsourced to get the team from DevTeam.Space 3) experienced team with more than 20 years combined 4) the game already in progress being built 5) it is a 12-month timeframe to complete building the game. Only concern is that the proposal has stated the team are working on different projects and different time zones, which take up their time and energy, thus affecting quality of the game and have delays to complete building the game. The proposal has broken down the timeline to complete the game development and it is reasonable to complete it within 12 months as they have already completed some milestones. It is not stated in the proposal whether the team know how to write Plutus/Marlowe or Haskell. There have been many hacks happening Ethereum and Solana in these past few years. If the game is going to use Smart Contracts, security of assets and knowledge in those languages is very important.", "q1r": 3, "q2": "The proposal provides the auditing AFTER the game is complete. This is not enough. The community would like to monitor the PROGRESS i.e. DURING building phase of the game. A consistent update by the proposer regarding the progress of the game will help the community to audit in some way. Suggestion on how this can be done: 1) the proposer can provide short videos about the development of the game in a bi-weekly or monthly update 2) having open-source documents for the community to monitor & check such as game-codes in github, roadmap, and google sheets publicly available for hitting milestones or not 3) having Twitter space or Discord AMAs about the progress of the game development 4) providing more information/utility about the NFTs that was purchased from minting or secondary market. If the proposer is more transparent and keep engaging with the community with the progress of the game development, the success rate will be higher with on boarding and bringing new players once the game is finished developing. ", "q2r": 2, "assessor": "z_assessor_2274", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8120, "q0": "The Game industry is one of the largest entertainment industries in the world. In recent years it has grown strongly both in terms of users and technology. The NFT game is no stranger to many people, especially in the crypto world in general and the Cardano ecosystem in particular.\nLovelace Saga will be an NFT-based blockchain game built on Cardano. With the addition of this game to the Cardano ecosystem, a large number of potential users can be introduced to Cardano and blockchain technology. This is a play-to-earn game, so I will also be interested in the \"earn\" part and what is the minimum amount of capital expected to be able to start playing the game. I hope the team will provide more information on this.\nThe proponent has outlined some risks that the team may face when implementing the project and has a solution to reduce that risk. Those risks are: the risk of improper communication and clarification of the desired outcome from all team members; market volatility and ADA price volatility; timeline goals not being met; Users lack understanding of how to use the platform. However, I find that the risk of competition is also important because there are many play-to-earn game projects in the game market today. So the team can highlight different highlights from other projects to attract new players as well as professional gamers. In another aspect, a number of scam game projects emerged in the trend only to scam, suck investors' money and then die. This has lost the confidence of players and investors, making them more careful in choosing the next game project. So, for the better, the team can add a solution or commitment to this problem.", "q0r": 5, "q1": "The proposer outlined 13 work steps to implement this project. Some work steps have been completed by the team before. The roadmap of this proposal starts from August 2022, with specific timelines and goals. This plan is relatively detailed. Also, I see the \"token policy\" mentioned on the project home page but I don't have the information I need. In the roadmap part of this proposal, I have not seen the team provide token release information. For projects that issue tokens, I am very interested in tokenomics, token distribution tables and listing time. So the team can provide more information on this issue or whitepaper.\nThe budget section is presented quite detailed and clear. The proposed budget is only 3.2% of the total Challenge budget. This amount is divided into 3 parts: Group salary expenses; one-time costs and costs for Education & Marketing. Each section is detailed with each expense. The average hourly cost is $60/hour (the author provides pictures of the weekly invoice for proof).\nThe project team was given quite enough information. They have over 20 years of experience integrating emerging technologies with existing systems from FinTech, E-Commerce, Marketing, Nonprofits and Legal. Experienced developers with web-dev and blockchain technology. In addition to this proposal, they have a few other proposals also submitted in Fund 9. I found that their experience and competence were completely in line with the objective of the proposal. The author has also provided a LinkedIn profile to verify their identity.", "q1r": 4, "q2": "I agree with the author's way of measuring and tracking project progress. Those indicators are: the number of active players in the game for a given period of time; the number of communities participating in their Twitter, and Disco; the number of people participating in community events such as tournaments. Each metric has a purpose to track the progress and development of the project.\nThis is a brand new project that has not received any funding in Catalyst before. The success of the project is also clearly defined in attracting new users with more than 100 new users coming to the ecosystem every week. The Cardano community has a fun and engaging platform that attracts new participants from the traditional gaming community...", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11215, "q0": "Video games are a huge industry, growing exponentially. So every video game has a potentially huge impact in attracting more people to the Cardano network. But that doesn't mean that any video game made on the network is a project worth funding. It will depend on the quality of the game and the fact that it is free to play is a big plus. This game is not free to play because you have to buy a character to play. And about the quality of it I can't speak, because I have tried to test it on their website https://lovelacesaga.com and the game doesn't find opponent. There is no gameplay video either.\nSo I don't have enough information to know if it is a good or bad project.\nI would recommend incorporating a video with gameplay as well as a game mode against bots, even if its A.I. basic, in order to test the game to potential players.", "q0r": 3, "q1": "Only one of the team members has a linkedin link, to check if the experience they accredit is real. So I recommend you to add the links to the social networks of the rest of the members, if they don't linkedin it can be instagram, facebook or twitter. That gives more support to the experience they claim to have. \nOn the other hand they attach a screenshot of the team workflow, if that is the workflow they have, I think it will be difficult to carry out the project. June 23 was Thursday, only 1 message that day. The next day, June 24th, Friday, 3 messages in 6 hours. \nIf you really have a good work pace, it is not what this screenshot shows. I recommend you upload a screenshot that better shows the workflow you have.", "q1r": 3, "q2": "The roadmap is somewhat repetitive, and with little explanation of what they are going to develop. Continuing development in Unity, is repeated at each point in the roadmap, a total of 5 times, except for the final point which is when they release the game. When they release the MVP version, they should detail what this version includes. It is also quite strange to go from an MVP version to the final version without going through an alpha or beta. In the \"Steps we will take to implement the development of Lovelace Saga\", there is no mention of gameplay except in point 13.\nWhat kind of game is Lovelace Saga? There is no information in all the Proposal about what the genre of the game is.\nOn metrics, they mention the number of engaged players reaching the target audience. But there is no mention of what that target is. 100? 1.000? 50.000?", "q2r": 3, "assessor": "z_assessor_3231", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12607, "q0": "The proposal meets the challenge requirement. I think the team put a lot of work into developing a Play-to-Earn game that will be this high quality. In Cardano it's not about quantity, but quality is important, so I welcome the project.\nAll information about gameplay, game features have been presented in quite detail through the attached video. To be able to integrate blockchain education into the game, you should find a way to categorize the gaming audience, some come to the game just to make money, some of them also have a lot of knowledge. So I'd like to know how to identify new users and methods of prioritizing education fully and effectively.", "q0r": 5, "q1": "Thank you for helping me clearly visualize the amount of work the team undertakes, and with the information provided by the team's resume, I think the team's experience will cover the entire job.\nThe proposed scenario is sufficient and reasonable. While not the most detailed scenario, it is enough for me to safely understand its development. I have no further comment on this part of the proposal, as I think the information provided is satisfactory. Regarding the grant, the scope and vision of the project is quite broad so the funds requested are legitimate, and it is quite simple to understand how it will be used.\nThe team is pretty confident in thinking that the project will have enough funding to grow the MVP after this funding round, which is good, you can come up with ways you can manage your funding or any other method to increase funding budget increases such as the commercialization of in-game assets or the issuance of tokens?", "q1r": 5, "q2": "The project focuses on community development, so metrics to measure project success are reasonable when it comes to examining growth and engagement on social media or platforms. . I love this, it will have a very positive impact on attracting communities to Cardano. The proponent also provides links that allow the community to track progress as the project progresses, this is the audit I want, I hope you'll update the full project progress as the project progresses. I'm not asking for anything more in this section.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 13460, "q0": "The idea of ​​this proposal is very interesting that traditional games previously did not allow users to use their in-game content. That's why the author created a new game that can allow users to spend thousands of hours playing and not have any control over their playable items. This problem fits the current challenge, it is possible to extend this model to solve future challenges. The author has clearly identified the problem that they are going to build Lovelace Saga, an NFT play-for-money game built on Cardano. Incorporating Blockchain into games allows users to own their in-game assets and gives users more control. The author has also listed a lot of risks that affect their progress:\n1. Improper communication and clarification of the desired outcome from all team members.\n2. Market volatility and ADA price volatility.\n3. Timeline goal not met.\n4. Users lack understanding of how to use the platform.\nHowever, for these risks, the author adds specific methods to address those risks. The author is also open to suggestions from the community for any additional risks and any mitigation strategies we should consider to increase the success of this project.", "q0r": 5, "q1": "The author has given 13 steps to implement the development of Lovelace Saga they have also completed most of the steps listed. The timeline is listed by the author, and the roadmap is divided into 6 important milestones:\n1. August - September 2022\nContinue development in Unity\nDo QC checks for code and UX\nCollect feedback from the focus group of users\n2. October - November 2022\nCardano Wallet connection integration\nContinue development in Unity\nCollect feedback from the focus group of users\n3. December 2022\nThe first version of MVP is released\nContinue development in Unity\n4. January - February 2023\nContinue development in Unity\n5. March - July 2023\nContinue development in Unity\nDebug code for the final version\nCollect feedback from the focus group of users\n6. August 2023\nThe above timelines are completely reasonable to complete the proposed work. The success of the project is to create an interesting playground for the community to attract new participants and participants from the old community to help the Cardano community grow more and more. The success of this project means that the Cardano community has an interesting and engaging platform that attracts new participants from the traditional gaming community. Platform users will experience an exciting game that allows them to earn rewards and grow in the community. The game will be a means of attracting new users with more than 100 new users coming to the ecosystem every week. The success of this project also means that the holders of Kaizen NFT will have additional economic opportunities with the increase of new users coming to the community. The solution to this challenge is that the author will provide the gaming community with an avenue to familiarize themselves with the benefits of incorporating blockchain technology.", "q1r": 5, "q2": "The metrics detailed by the author help us see if the platform is reaching our target audience and whether they have a good experience playing the game. no, whether the game is gaining momentum with the Cardano ecosystem and broader gaming community The team is a diverse team of entrepreneurs with over 20 years of experience integrating emerging technologies with existing systems from FinTech, E-Commerce, Marketing, Nonprofits and Legal The developers of the proposal have experience with web-dev and blockchain technology Team members are: Pritesh is a longtime member of the Cardano community, Game Development Team - DevTeam.Space is a moderated community of expert development teams, Alex Sk - Account Manager, Gleb Zadorozhnyy - Project Manager, Valeria Bogdanova - Game Designer / Illustrator, Sergey Golubev - 3D Artist / Animator, Denys Popov - Developer Backend/Blockchain Development, Yulya Krivson - Frontend Developer. This is a powerful team and very passionate about their current job. The funding required for this proposal is $250.000.\nThe budget is broken down by the author into reasonable amounts that are suitable for the challenge set out.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 13561, "q0": "The challenge addresses the problem in the game industry that users do not actually own playable items, skins or in-game currencies. Players do not have the ability to control, sell, or trade their items in a limited and very difficult way. The blockchain solution is intended to put an end to this. The user gets more control by connecting a wallet, by creating NFTs for the items or skins which are assigned to the wallet of the player. This simplifies the interaction of in-game items between players In this case, it is a play-to-earn web browser game. Video games are played all over the world after Corona more than ever. Good play-to-earn games that are well received by the audience could attract an enormous number of new users, increase awareness and grow the community. In this case, the proposal would provide a kind of product that the user would consume and be rewarded for. Furthermore, through well-designed play-to-earn games, there is the possibility to draw the attention of large game producers and studios to the advantages of blockchains and thus provide a kind of entrance door for larger projects and games. That's why I see this niche as a great opportunity to grow the ecosystem. The team has given some thought to possible risks and is trying to find solutions to them accordingly. Of course, there are X-factors that could occur or risks that they may have overlooked. For this, the team is open to addressing possible risks and finding solutions that the community identifies. Several communication paths have been established to be in contact with the community and to receive feedback.", "q0r": 4, "q1": "The play-to-earn game Lovelace Saga is currently in development even before the proposal was sent to Cardano-Catalyst and seems to be at about 40% progress according to the description. This testifies to a reliable team which is committed to and convinced of the idea. Given the experience and background of the proposer and the dev-team specialized in blockchains, I think the feasibility of this project is quite achievable and realistic.\nThe proposer presents a structured plan regarding the development. A roadmap was created with self-set goals, which is helpful not only for the team itself to see if they are on schedule but also for the community. The team has already thought about how they will keep the game alive to ensure long-term success, described in Long-Term-Vision.\nThe budget is clearly structured, described and divided. The remuneration of the developers with 240000 $ per year is significantly above the average salary of a game developer which is around 42000$ per year. As mentioned above, little is known about past projects that the individual team members have worked on and what successes they bring. For this reason, I have a hard time estimating the salary. Experience does not equal success.\n", "q1r": 4, "q2": "There is clarity in the description of the problem, the solution, and how the proposal aligns with it. A roadmap and progress in development have been clearly established and can be easily reviewed and shared with the community. Other than that, some thought has already been given that goes beyond the development of the game.\nThe KPI's and metrics were very well chosen by the team to evaluate the project, give an overview of the current development and possible information for the future. After all, the most important indicator for a game are the players. Also, monitoring and evaluating the activity of social media is not a bad idea in itself and can give clear information and especially feedback.\n", "q2r": 5, "assessor": "z_assessor_3691", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Incorporating blockchain into playable games allows users to own their in-game assets and give more control to the user. We will build Lovelace Saga, a play-to-earn NFT game built on Cardano.", "experience": "We are a diverse team of entrepreneurs with over 20 years of combined experience integrating emerging technologies with existing systems from FinTech, E-Commerce, Marketing, Non-Profit, and Legal. Our developers have experience with web-dev and blockchain technology."}