{"id": 416681, "author": "mr.goose", "title": "Handle Personalization | ADA Handle", "url": "https://cardano.ideascale.com/a/dtd/416681-48088", "category": 26595, "amount": 155600, "description": "Handle owners have expressed the need to include personalized data onto their Handles in order to create a customized user experience when interacting with Cardano DApps, projects and wallets.", "f6_no_assessments": 9, "f6_rating": 4.9259259259259265, "videos": [], "media": [], "f6_assessments": [{"id": 61, "q0": "The Ada Handle team has provided a concise description of the issue in their problem statement - currently Handles are static and Handle owners have expressed the need to include personalized data to their Handle - which could lead to a much better dApp and wallet experience.\n\nIt extends the set of features of Ada Handles, which is the most adopted project within Cardano and on the path to becoming the naming standard across the network. This proposal has the potential to have a huge positive impact on the Cardano ecosystem as a whole by allowing any dApp and projects to read the data of each Handle and use it to deliver a personnalized the experience - every handle user could benefit from organisations to simple users. The data is owned by the handle owner and can point to a smart contract. From there, possibilities are infinite. The proposal clearly articulates how it will add value to the handles, how it will scale. The solution is designed to be flexible and future-proof.\n\nThis update will bring value to the project, and allow it to compete on the crypto scene with the more known competitors by delivering a unique and very well thought-off set of features. This proposal addresses the challenge effectively, thus I'll rate this proposal a 5/5.", "q0r": 5, "q1": "The team at Ada Handle has given a good and clear account of what experience/skill sets will be necessary to deliver on the proposal, as well as a complete description of who the team members are (PapaGoose, Conrad, Goose and BigIrishLion), including their roles and some past work.\n\nThe budget is outlined clearly and is broken down into identifiable items (hardware, dev time, project management, marketing and other ressources) and the amount requested seems reasonable to achieve the set goals. I would argue the marketing budget could be increased as adoption for this project is key to its success, and the marketing budget only accounts for 5% of the total budget - especially as the main risk identified is the adoption curve for the Personalization Standard. \n\nThe roadmap is otherwise very detailled and clear, broken down in 4 stages that make sense - from private testnet to public launch. They provided the details of the tasks, the order of execution, the timetable for completing the project is realistic and the resources necessary are listed. The Ada Handle team has indicated some the risks they identified with the solution they want to build and has given some indication of how they will mitigate them (how to combat users adding profane or obscene images, look-alike phishing attacks). Given the experience and plan presented by Ada Handle team, it is very likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The team has provided a clear and detailled roadmap with milestones and a time horizon for achievement. The metrics that define success are presented and make sense - but some targets would have been useful. How many expected users/dapps/projects will use the personalization feature, how many handles will be personnalised after 1 month/6months, what proportion of handles do they expect will be personnalised.\n\nThe team has explained how they will track the progress of the development of their project - using an internal ERP software, daily meetups, monthly and weekly reports and an external third-party audit. The information provided is sufficient to audit the progress and the success of the proposal, and this is why I give auditability a 4 out of 5 rating.", "q2r": 5, "assessor": "z_assessor_2040", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 376, "q0": "ADA Handle present a proposal to introduce handle personalisation to the handle standard. As part of that personalisation holders of a handle would be able to prove ownership of the NFT to a smart contract that then can be updated to include personalisation data such as a profile image, social media info or other data values. DApps and services could then read, parse and use this data to give a custom experience to the user based on that data. One idea that the team shares is that one idea that could be applied to this standard is the encryption of data to be used by another party by giving them a key to decrypt the information. The example provided was it could be information about how to use the transaction data for tax purposes yet the handle personalisation would never have personally identifiable information attached to the standard. A notable and important risk that is identified is the importance of adoption amongst the applications that integrate the handle standard. Without use cases adoption could be slower so having use cases that applications want to integrate are important to get a sufficient amount of users utilising these new capabilities. The proposal is very well thought out and highlights a number of ways the personalisation data could be used and all the implications of who would be involved in the usage of this improvement to the handle standard.", "q0r": 5, "q1": "The team have broken down the roadmap for this proposal into four phases. They focus on the different development stages and environments they will use to get from idea through to main net deployment. The phases are well explained and articulate on what is involved. The budget is broken down with infrastructure costs and audit and then manual labour costs with the hours and hourly rate. The hourly rate is fair considering the location and salary average in the US and time scale also seems achievable. In regards to the team break down details are provided on each individual and their background. Some more evidence of their backgrounds would have been good to see such as LinkedIn profiles just to more effectively verify who is involved. The team has a strong track record of delivering a widely used standard in the community. When combined with the well articulated plan and team members involved it appears highly likely that this proposal is feasible.", "q1r": 5, "q2": "The team outlines a number of ways in which the progress of the proposal will be tracked. Many of these are internal to the team but the ones more relevant to the community are the weekly project reports, monthly status reports and the external audit on the software created. The audit will be vital for ensuring peoples handles and funds are safe when using these smart contracts - having public audits will help in providing confidence to the community that the outcome of the proposal has been delivered and professionally verified. The team also details a list of success outcomes they want to achieve with the personalisation standard. It would have been good to see more specific outcomes in usage they may track, however they have already articulated a number of use cases in the proposal that could see adoption. There is a public Github repository that showcases work that is open source for the community - https://github.com/koralabs. A final piece of feedback would be it would be good to publicly disclose what will be open source from this proposals work as the efforts made in this proposal may benefit the wider ecosystem.", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 410, "q0": "The adoption of new technology typically begins, on the fringe, often hampered by a barrier of entry for the less technically inclined. The challenge, for developers, is to reduce or eliminate that obstacle by creating an easy and intuitive user experience. \n\nAda Handle has already demonstrated its utility by simplifying transacting on Cardano through the adoption of human readable addresses and the introduction of rudimentary blockchain personas in the form of personal monikers or “handles”. Enhanced customization and further development of these handles is a straightforward step along the path from select usage to mass adoption. \n\nProviding a more immersive and personalized Cardano experience, from recognizable addresses to customized exchange and website interfaces to unique gaming personas and seamless sidechain interoperability—the possibilities are virtually endless—greater customization encourages greater usage and participation both from those familiar with blockchain technology and others less so.", "q0r": 5, "q1": "The solution to store a user profile within a smart contract associated with a given handle and allow respective applications to reference the profile and implement applicable user preferences, is well explained and feasible.\n\nHaving already established itself as a premier product designed by an expert team with decades of collective experience, there is little doubt regarding the implementation of the proposal. The Handle Standard is currently the standard for human readable addresses on Cardano. The website and Github are provided as evidence of competence. The budget is itemized and seems commensurate to the scope of the project.", "q1r": 5, "q2": "Both the challenge and the resolution have been thoroughly articulated. The timeline has been divided into four distinct phases with which to gauge progress—private testnet, public testnet, marketing and mainnet launch—delineated over the course of four to six months upon which completion of the project is expected.", "q2r": 4, "assessor": "z_assessor_2076", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 1512, "q0": "From a well known project in Cardano ecosystem, ADA Handle takes a further step with their products. Handle personalization will enable ADA Handle to include personalized datasets that will consists of profile pictures, social-media accounts, and more. They’ve also create this personalization tools for gaming platforms in Cardano to use, so they can be interoperable with each other within the ecosystem. This feature will further improve the utility and adoption of Cardano to the masses. ", "q0r": 5, "q1": "This prominent project -ADA Handle- have an experienced team, and this proposal able to give evidence of their relevant experience (15+ years), mainly from their Twitter profile (in which, I often see them popped up in my timeline too). The budget is sufficiently broken down into detail and identifiable manner, which includes the total hours and salary rate of each category. Although I understand that it is hard to make a very detailed budget allocation, it’d be great to include further information on each of this category. I.e “infrastructure upgrade”, briefly explain what is needed to be upgraded. Since it’s already explained in detail about this project roadmap and plans, pin-pointing which plan goes to which budget category will further improve project clarity. Other than that, this proposal managed to explain all the details that is needed for this project to be executed successfully, from roadmap, technical plan, to security audit and managed risk. As a Backend Engineer myself, their development roadmap is very well thought out (personalization tool with JSON based data, integrating with IPFS infrastructure, including stress test in TestNet, documentation, and more). All in all, a very good project with experienced team and proven track record of ADA Handle, I will give it a 5.", "q1r": 5, "q2": "This project have all the transparency the community needs; from their website, twitter profile from each team that are really active, and their GitHub repository. The included weekly and monthly with KPIs progress report will also ease the auditors and the community. Overall, a transparent project and it will be straightforward and easy to audit the progress.", "q2r": 5, "assessor": "z_assessor_2255", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4915, "q0": "ADA Handle is one of the most well-known NFT projects with real-use cases in terms of facilitating payment transactions with simplified address payment directions, and the most representative of this kind in the Cardano space. As such, the work they have done and continue to do is of the utmost importance for the product and integrations space of Cardano as a whole, and adding the possibility for personalized information on the Handles according to the users desire will continue to incentivize user onboarding and complement the multiple use cases in Dapps across the ecosystem.", "q0r": 5, "q1": "As it constitutes a continuation of the remarkable work already displayed by the team, much of it having been done without previous funding and, even if this proposal is not funded, will continue to do so regardless, this proposal is very likely to be implemented successfully. The support that Catalyst may give to this signature Cardano initiative will consolidate Catalyst as the go-to decentralized VC alternative for native Cardano projects in need of funding when other sources dry up (as has occurred recently due to rising interest rates and lower ADA prices which negatively impact financial projections, even with sustainable projects such as this one). They have already developed and made public the base timeline and corresponding budget for the parts this project entails, namely the infrastructure upgrade, development, security audit, website UI and UX upgrade, marketing & graphic design, and project management. ", "q1r": 5, "q2": "As an already existing project, with widespread adoption in the Cardano ecosystem and public communication channels including Telegram, Discord and Twitter, the progress and success of the personalization project within the Handle Standard will undoubtedly be common knowledge for community members. That being said, the proposers specify that gaining community support from day 1 would confirm demand for this new feature, attaining support from the Cardano developer community would also attest the need for the personalization feature, and that delivering a successful cross-chain integration of The Handle Personalization Standard onto Mamba and Milkomeda with ongoing feedback and feature requests from the community would indicate success of the project, thereby demonstrating interest in the Personalization Standard, as would the community utilization of the cross-chain solution when sending payments and Native Assets. Furthermore, success would be evident in obtaining a pass and high-assurance score on the external security audit and delivering an uneventful launch on MainNet allowing for smooth utilization of the Personalization portal, with the ultimate goal of setting the Personalization Standard on the Cardano blockchain. For future iterations, it would be interesting to perhaps include numerical aspirations if user base projected to utilize the personalization standard within the existing Handle owners, as well as alternative specific engagement metrics (percentage of payments made within Cardano using the Handle Standard, amount of developers working on improving the Standard, among others).", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7184, "q0": "The proposal is attempting to solve an underlying problem between the AdaHandle Standard and it's Personalization options for their holders, in order to express one's unique assets such as NFTs owned or simply allow other members of the community to easily identify one another by connecting these to social media profiles revered by the community i.e. Twitter. The solution to the problem would be solved by enabling each Handle with an associated Smart Contract which will contain datasets of pointer records, that can be personalized to be used through Cardano Dapps, wallets and gaming platforms to express one's individuality. The AdaHandle Standard has a massive community that's adopted over 120,000 NFT handles. This still growing sub community within Cardano have been wanting the option to define themselves beyond characters, such as displaying an NFT, or maybe a new project launching on Cardano, the opportunity to brand one's handle would be like a personal billboard of advertisement or just a simple fun way to interact with others. This could have a huge impact on the Cardano ecosystem by allowing for more engagement among members and bring more worth to future investors on the blockchain. The risks with any form of self advertising can invite bad actors to exploit personalization by imitation or the use of profane or obscene imagery. The proposer understands that future challenges exist and has solutions to those possible issues, but I personally don't believe adoption will be one of them. Impact score for this proposal is a 5.", "q0r": 5, "q1": "The proposer and their team at AdaHandle have presented a solid plan to utilizing Smart Contracts which can be successfully implemented to solving the problem. All members of the team's social media profiles can be found on their website but brief descriptions of their career & educational experience can be seen in this proposal under the section \"Personalization - The Team\". The team has been working with countless partners within the Cardano community and integrating on chain technology to build an easy payment option for users to feel more confident in using, rather than copy and pasting traditionally long and complicated wallet addresses. This has created a massive need not only for the individual but for companies looking to take advantage of what Cardano and it's vast ecosystem has to offer. The proposal does also have a sister proposal which would help in the aid to creating an additional solution to this problem, offering sub-Handles to groups in need of multiple addresses for use cases within their business or branding strategy. Link to that proposal here: (https://cardano.ideascale.com/c/idea/416678). Furthermore, the budget proposed in order to execute the solution is reasonable in regards to developer costs and project testing which is estimated to take 4-5 months time. The feasibility of the proposal is given a 5 as the team in place is more than capable of delivering a working solution.", "q1r": 5, "q2": "The only issue with the auditability within the proposal is the lack of clear indications of where the progress of the roadmap and it's milestones will be viewable to the Project Catalyst community. It is stated by the proposer that the budget will be broken down into Phases (4 in total) which will be completed in order to move onto the next. Phases include Private Tesnet, Public testnet, Marketing and Mainnet launch. These phases will be shared through weekly and monthly reports by the team as well as providing an external audit on all software. This information will most likely be found via the Github link provided here: (https://github.com/koralabs) but it is not definitively specified. Most but not all of the partnerships that will take part in some aspect of the project are listed below the proposal. Challenges and risks have been considered by the proposer, and the team does not foresee any debilitating issue that may delay the completion of tasks to ensure successful implementation of the solution. Defined success would be seen within the community demand, as well as the deliverance of a cross-chain integration of AdaHandle Personalization Standard onto Mamba and Milkomeda. After reviewing all relevant information, the auditability of the proposal is a 5.", "q2r": 5, "assessor": "z_assessor_2883", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7465, "q0": "I am a loyal customer of ADA handle since the release of your first mint. Seeing what you guys put together in this proposal is EXACTLY what I want to see when a project is looking for funding! Not only will this bring huge use cases to ADA Handle in general, but it will help the worldwide adoption of the handle standard and Cardano as a result. Your proposal is well written, concise, and contains every piece of information that I look for in a proposal to feel comfortable voting it 5 stars across the board. Expanding on the already revolutionary idea of ADA handle into fully customizing profiles associated with your handle will be a huge step to preventing phishing and fraud. I couldn't think of a better project more deserving, especially since you had secured funding through your original NFT sales and the only reason you are lacking funds is a result of the market drawdown. I can't begin to describe how excited I am to see this come to light and I am blown away yet again by how crafty you guys are as a team! I look forward to this proposal being funded, this ecosystem needs this!", "q0r": 5, "q1": "The experience of your team is something that Cardano should be proud to have as a part of our ecosystem. 52 years of combined experience, along with an already exceptional track record of delivering what you say you will makes me feel completely confident that this proposal will be worth funding. You have incorporated all the normal metrics that I would judge a project's success by, and even included some that most overlook. Social media engagement is a very important part of getting the word out and most projects completely overlook this aspect. Your team took a lot of time and effort getting all the facts and stats put together into a proposal that is straight to the point, but full of information to go off of. I love the way that every section is broken down into subsections to help answer any questions that I would normally have for a project like this. Ada handle is a project that all other projects should take notes from as far as the way to build a platform. This proposal expands on an idea that is already perfectly executed, and I am excited to see what will come from continued funding. Your team is doing all they can to secure funding on their own. Even though the market dropping has an impact on the funds your company needs to continue to operate, I know that you only come to catalyst as a way to help offset the market crash. I think this is exactly what catalyst is about. Funding the projects that have a proven track record and helping them take their technology to the next level. Thank you to your entire team for all your hard work!", "q1r": 5, "q2": "This is one of the very few proposals I feel confident enough to rate 5 stars all the way down. Not only do you plan on reporting your progress and stats monthly, but you are also giving us weekly updates on what you are working on. You are pulling resources from outside the ecosystem in the way of external security audits to maintain the high standard you have all the way up to this point. The community is kept informed every step of the way, and to me that is something very important when funding is asked for here at Catalyst. I believe the money will be well managed simply by the way the proposal is broken down and compartmentalized. Projects like Ada handle are the projects that will take Cardano completely mainstream and help mass adoption, along with preventing scams and other vectors of attack at the community's weakest point, which is the user themselves. I normally try to put in a note or two of ways to improve the proposal, but I literally cannot think of anything that would make this more detailed or more to the point of what you are trying to accomplish. I look forward to seeing you guys growing the handle standard and the implications that it has on Cardano as a whole. Best of luck to the team!", "q2r": 5, "assessor": "z_assessor_2895", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10379, "q0": "Handle now supports most of Cardano's wallets and the project is still expanding. The project \"Handle Personalization\" is an extension of Handle. This project helps users of Handle creates personalized data sets such as profile pictures, social media accounts, and a lot more. The Handle project has been very successful and brings a lot of convenience to the users of the wallet address. The plans relating to Handle are very potential and likely to develop more in the future.", "q0r": 5, "q1": "There is no doubt about the members of the project. Obviously people with experience with blockchain in general and Cardano in particular. We can fully learn about their information and experiences through their Twitter as well as the Handle project they have built. However, they should include more about their profile, the community is easy to find. They have a detailed plant for the \"Handle Personalization\" project. They divided the road map into 4 phases. In Phase 1, the team will conduct Private Testnet for all developments in this phase. In Phase 2, the team will perform Public Testnet. Phase 3 is time for marketing. And finally, Mainnet will be conducted in phase 4. To make this road map, they need a budget $155,600.", "q1r": 5, "q2": "They have very transparent key metrics to evaluate the project. Each key metric is easy to understand and easy to track. Every week and every month, they have a report on the progress of the work. As a user owning and using Handle, I give compliments for regularly updating the work progress of Handle team. The \"Handle Personalization\" project is completely possible and even more extensible.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11641, "q0": "The proposer has done a marvelous job by glancing into the problem and placing it in its right challenge and providing solution which summarize the problem such as Handle personalization standard with integrate Handle to unique smart contacts in order to create personalized datasets that will include profile picture, social media accounts and alot more if they are funded to execute their project.\n         In view of these, the Proposer also effectively addresses the precise challenge and it's potential of bringing values to the Cardano ecosystem and to communities by creating Ada handle launched which they believe that as more Dapps,games and platform launch on the Cardano block chain,there will be an opportunity to augment the Handle standard to enable Handle owner to choose personalization features from an array of options, The platform can than directly parse from the Handle personalization standard,they also believe Handle personalization standard will allow Handle owners to associate personalization data into their handle. Which I strongly believe they will do a great job should they be funded to execute their project.\n          Furthermore, the Proposer capture some important key metrics measure under the compaign brief on how it will bring values to the communities and to Cardano ecosystem by creating of Dapps, wallets, gaming platforms, Cardano cube and blockchain etc should they be funded to execute their project and I strongly believe they will do a marvelous job if they are approved funds to execute their project.\n   ", "q0r": 5, "q1": "      The proposer is able to provide a detailed plan including timeline of 5-6 months that comprise 4 major phase and key milestones such as upgrade infrastructure Deploy cluster and private testnet,set up wallets and policy ID, code parting to public Testnet, external testing, feedback and continuous improvement, API documentation, Roadmap updates , Adoption effort,final security audit etc which will be adopted in 4 phase with the handing of 1 private testnet,2. Public Testnet and continue improvement, makerting compaign and maintenance should they be granted funds to execute their project.\n         The proposer also able to provide details budget breakdown funds on how it will be used should they be funded and I think is COMMENDABLE for them to get funds to execute their project.\n          Moreover, the proposer is able to outline some risk challenge that could prevent them from executing their project and able to navigate solution to overcome them should they be approved funds to execute their project which I think they will do a wonderful job if they are funded.\n          Furthermore, the proposer provide relevant links and details of team members who will help in the execution of the project and I strongly believe per their reference and experience, they have the Desired skills and experience to carry out the project should they be funded to execute their project.", "q1r": 5, "q2": "The proposer is able to describe measure to track their project progress by looking out for some key metrics such as weekly project reports showing how each task is progressing, monthly status report showing phase and proposal progress, External audit on software development, internals ERP next project management too etc should they be funded to execute their project.\n           Furthermore, the proposer outline how success for their project will look like by , Gaining communities support from day 1 would confirm demand for it new feature, Attaining support from the Cardano developer Community, Delivering a successful crosschian integration of the handle personalization standard, Community utilization of the cross chain solution etc should they be funded to execute their project and I strongly believe per the key metrics, KPIs and key milestones presented, they will do a marvelous job if they are funded to execute their project.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "The Handle Personalization Standard will integrate Handles to unique Smart Contracts in order to create personalized datasets, that will include profile pictures, social-media accounts and a lot more.", "experience": "@PapaGoose\nCo-Founder & Senior Engineer at ADA Handle.\n25+ years TradFi experience.\n@BigIrishLion\nCo-Founder & Senior Engineer at ADA Handle.\n20+ years building systems.\n@Conrad\nCo-Founder at ADA Handle and BLADE Pool operator.\n@Goose\nCo-Founder at ADA Handle."}