{"id": 416743, "author": "rarety", "title": "Rarety.io : No-Code NFT Launchpad", "url": "https://cardano.ideascale.com/a/dtd/416743-48088", "category": 26595, "amount": 25000, "description": "NFT artists and projects facing multiple technical barriers to deploying and managing their projects on Cardano. They have to rely on a third-party API service or a costly developer.", "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 377, "q0": "The Rarety.io : No-Code NFT Launchpad proposal is looking to extend on from existing work of having a multi-signature NFT minting service to now create a no code all in on platform to support NFT creators. Some of the features they intend to include in this application are payment gateway (crypto, card payments), NFT paywall, taking snapshots, airdropping and whitelist sales. In the solution description the team then outline the steps a user would take with images provided and what features they could use when minting NFTs and using this as a subscription based service. This provides good clarity on the intentions of the proposal. What could be made more clear is exactly which features they intend to deliver as in some instances the mention 'many more'. The proposal reads as if they are mentioning all the features they intend to deliver but I have less confidence that they are making the commitment to the features they are listing for this specific proposal due to the large amount of items listed. It could have been useful to know the exact first set of features being produced so this was more obvious. In terms of risks they mention bugs and being customizable for the end user. It would have been good to make comparisons with competitors that are emerging in the space and how they intend to be different than existing NFT minting platforms that may be moving into this area as this is a risk to the sustainability of this project. Overall the this proposal could create a positive impact for the ecosystem, in future proposals the proposal team could be very exact on what they intend to deliver or atleast be very exact on the first set of features to be expected and separately define the other areas to avoid any doubt on deliverables.", "q0r": 4, "q1": "In terms of progress the site is already live with some initial content and functionality. The connect wallet section on the top right stayed in an infinite looping state which may need fixing - this made it hard to play around with the site. The team break down the proposal into months and provide an itemised list of what will be completed which is reasonable. The budget break down mentions three full time developers, software and hardware costs and then marketing outreach costs. The budget appears to be fairly light given the features mentioned in the solution description and highlights again why it is important to be very specific on scope as this is how confidence can be achieved in whether this proposal is feasible given the exacts from the budget and scope. A github link and mention of a previously executed proposal provides some evidence that the team can execute this proposal. The team did not provide any professional profile links which made it more difficult to fully asses whether the team has the background as stated in the proposal so this can be verified. Further evidence of existing Plutus development would have also been beneficial to increase confidence on feasibility. ", "q1r": 4, "q2": "In terms of auditability the team provide a set of progress items to expect such as Completion of development milestones number of projects on boarded, transactions facilitated, buyer wallets attached and total volume of ADA processed. These are metrics on the outcomes of the project, preference here would be to list how they are going to track the proposal execution progress such as with Github, Trello etc and how the community will be able to audit that. Success for the project was a high level objective to spread adoption and efficient minting and launching of NFT projects. This section would have benefited from more specific objectives for the key deliverables of the proposal. For instance if a subscription model was being made having some examples of the type of volume to expect and comparisons to alternative applications to provide evidence towards a sensible potential success outcome for achieving an objective on hitting a certain number of users paying for this subscription. This is just an example however it would have proven with more confidence that the proposal team fully understand what deliverables are important, what to expect based on their market understanding and how that may be tracked and audited. The team provided a link to their previous proposal they had which they have already completed and a Github repo helps to showcase this. A link to the completion report would have been beneficial here for simplicity and clarity. Overall there is evidence the teams previous work could be audited by the community and was available, improvements could be made towards the clarity of exact deliverables of the proposal and which features are nice to haves and then with this more specific objectives on what they are trying to achieve with the initially implemented feature sets.", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 790, "q0": "There is a large number of NFT makers in Cardano ecosystem. No code NFT minting as a service which mints NFTs on the go is also available. There is a large number of open-source scripts and sites which have been built in Catalyst funding is also available. The proposal is for a “platform that enables multi-signature minting process by leveraging Cardano's eUTXO capabilities for NFT projects to launch their collections easily with a smooth, hassle-free minting experience for buyers and sellers both”. This is similar in functionality to available sites and services. Multi-signature NFTs minting service may not be available. Therefore funding one more system from catalyst may not be adding the required value addition for the community in general. The project will be sustained on a subscription-based model and is likely to generate substantial revenue. Therefore is possible for the proposers to fund the startup to have more skin in the game and to make this proposal a success. ", "q0r": 3, "q1": "The proposers had successfully executed Catalyst projects three times before and had delivered the products before the node security software cardsec at https://github.com/SkryptLabs/Cardsec is one such example and the proposer have also hosted a sample site for the current proposal. These point to the fact that they have the technical capability to execute the proposal. The referenced git-hub repository is not been updated for the last six months but I guess it was not in the scope of the earlier proposal.  The proposal demands full-stack development capability and also experience in smart contract development in Cardano. The proposers have undergone the Plutus pioneer course and it can be assumed that they have good knowledge of the same. With this information, it can be said that the prospers will be able to deliver the project in a reliable manner. ", "q1r": 5, "q2": "The proposal is requesting 25K USD of catalyst fund to build an NFT minting site. The justification for this amount is 15K for three full-time developers 8K USD for hosting and 2K for community outreach. The site is already online and a discord server with about 4 members is currently in operation. The scope of the proposal and the exact functionality will define the work involved. There is some lack of information with respect to the detailed features to be included in the tool. Moreover, the requirement of three developers is also arbitrary.  However, the proposed output has a clear end state and the performance of the project can be easily measured. ", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3115, "q0": "Without a doubt, the impact of this proposal would definitely increase adoption for Cardano Blockchain. The proposal plans to develop a system to simplify the minting process that is almost hassle free. The impact this platform makes is immense. Any artist would be able to easily mint and sell their NFT while focusing on what they do best which is create the art. With this, I strongly agree that this proposal effectively addressed the challenge.", "q0r": 5, "q1": "With a working product albeit still new (rarety.io). The team shows that they have the skill & knowledge to execute this proposal. The team has previously worked on a Mini/Low-Budget Dapps & Integrations during Fund 7, and with their passion to further improve the product gives me the confident that they are a solid team. I would however, prefer to have clearer breakdown of the cost, where the current information is a little brief. The timeline and roadmap given is clear and precise, which the project will be develop till October. With the given information, the proposal seems reasonable and achievable. Risks are stated and plans to mitigate them are mentioned in this proposal. Thus, all in all the proposal is highly likely be implemented successfully.", "q1r": 4, "q2": "With a clear roadmap and timeline, along with the experience on previous projects & challenge, this proposal is rock solid. The proposal has mentioned 6 key indicators/metric to quantify to track the progress of the proposal. I would however love to see more metric regarding the success of the project (i.e x number of creator using the platform, x number of active creator per month) to measure the success of the project in the long term. All in all, I have nothing else to add but strongly agree that with the given information is sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2403", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4179, "q0": "The Rarety.io: No-Code NFT launchpad proposal address the Dapps, Products & Integration by building an easy-to-use dashboard for all NFT-related need of a project. They are 3 times funded proposers group of 5 people. Rarety.io proposal targets the problem of Cardano NFT which is lack of a one-stop solution for all things NFT. After logging on, they can create and manage their project with a single click. The project aims to onboard non-tech, cross-chain artists, content creators and projects having NFT utilities. The team foresees the risk is to make the platform customizable and bug free and they have found ways to tackle those issues. The proposal fits the challenge very well as it will onboard NFT creators & collectors to Cardano. Although it seems they already have the structure (launchpad) in place, Rarety would need to build the project efficiently and differentiate their NFT buy/sell platform from competitors (outside Cardano) & even well known NFT dashboards within Cardano ie. CNFT.io (they already have their launchpad and project owner can add their drop for free)  and ensure that users enjoy the experience of using their platform. The name \"Rarety\" is quite similar to Rarity.tools (NFT rarity rankings) and the team might consider their project name to be unique and stand out to the users. ", "q0r": 4, "q1": "The timeline of 3 months for this project with 3 full time developers looks brief but achievable. The total budget of $25000 will mostly go towards developers but there is no payrate or number of working hours indicated in this proposal. The team mentions that they are three times catalyst winner and F7 funded proposer who completed the project. Their completed project in F7 had pivoted from smart contract based NFT drop to multi-sig minting. They also plan to return for more funding for more features. The team could add more information on how they derive the budget figure for this project. Also it would increase voters confidence if the proposer will show the reason why and how they made the switch in the implementation of their project in F7 along with the outcome from that change. Their score in feasibility section will improve if they provided more rationale to support their budget and this transition of project in F7.", "q1r": 4, "q2": "The team has provided a set of measures to track project progress ie. number of projected onboarded, number of transactions facilitated and number of buyer wallets and Total volume of ADA processed, visitors & members on discord. It would be great if they could add the target figure for each KPI so that the community know if the project is on track. The team should also confirm the channel they prefer for project progress update ie. Discord, bi-weekly report or else. This will make it easier for project's auditability. The team understood clearly the need of having the NFT dashboard platform for nontech people and on its quest to onboard next wave of artist, content creators and projects that have NFT utilities to Cardano. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5883, "q0": "This is a very useful suggestion. It creates a simple dashboard platform that enables non-tech artists and content creators to launch their NFT projects with just a single click. Besides, it will also enable to use more use-cases like payment gateway (crypto, card payments), NFT paywall, taking snapshots, airdropping, whitelist sales, etc along with interactive statistics of their project on the same platform. In other words, this project makes the integration, launch, and code management of NFT projects more seamless. From there, anyone without the required technical expertise or knowledge can launch their project. Get them involved in building the Cardano ecosystem. It is for the above reasons that I believe this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Information about the team has been provided, your team has 5 members, they have achieved certain successes (Three time Catalyst winners and developers of Deqree,...). However, information about them is quite meager. I think you should add information about the team, for example: interests, skills, experience, forte, profile of each member. Adding more information about the team will help the project become more transparent. As you know, a strong and transparent team will make the project easy. Please add information about the team !\nI am very impressed with the detailed roadmap you have provided. You've identified the to-dos and distributed them into appropriate timelines. There are many benefits to having a detailed roadmap, making it easier for people to visualize what you are going to do. Besides, it also helps the project develop in accordance with the original goals and orientation. For the budget part, the budget allocation has been provided. However, it is not really specific. You can make it more clear by specifying the number of hours worked, hourly wage,... . A specific and transparent budget calculation will help people gain more confidence in this project. Criteria for assessing project progress and success were also provided. But it would be great to have some specific numbers, that will make it easier for PAs to evaluate and track the project. Here I have a few suggestions that may help you: there will be 30 projects launched per month,...", "q1r": 3, "q2": "In addition to the problems that I mentioned in the previous section. A plus point of this project is that you have provided a very specific and detailed \"workflow\" along with an illustrated interface. That's great, it helps me and everyone easily visualize the project. Although the information provided is not really complete, I still believe that this project will be implemented. Because I see your enthusiasm in this project. This is a very nice and useful idea. If implemented successfully, it will certainly bring tremendous value to the Cardano ecosystem. Make it possible for anyone to launch a project without technical knowledge and expertise. From there, attract them to participate in building NFT projects, building blockchain, promoting the development of Cardano. Thank you for this proposal!", "q2r": 4, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We are building an easy-to-use dashboard for all NFT-related needs of a project. No technical expertise or knowledge is required. We are bringing the whole process of launching down to a single click.", "experience": "We are a team of five including three times funded proposers, Plutus Pioneers, WebApp Developers and Marketers. We are the developers of Rarety.io (Multi-sig based NFT launchpad), cardsec (github.com/SkryptLabs/cardsec) & Deqree (Certificate Validation system)"}