{"id": 416730, "author": "b.ramesh", "title": "Decentralized Next-Gen Edge AI", "url": "https://cardano.ideascale.com/a/dtd/416730-48088", "category": 26595, "amount": 50000, "description": "AI has proven its adeptness in real-world scenarios but is exploitatively dangerous at the hands of big tech giants. Centralization is a big threat to user-centric, privacy-preserving next-gen edge AI", "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1658, "q0": "This proposal is extremely rich and necessary for Cardano, and also to promote the evolution of artificial intelligence technology; and meets very well what we are looking for in the challenge. The problem situation to be solved is the way artificial intelligence is currently being built by large technology companies (eg Google). According to the authors, “AI has proven its prowess in real-world scenarios, but it is dangerously exploratory in the hands of big tech giants. Centralization is a major threat to cutting-edge, user-centric, privacy-preserving AI.” An observation: it would be positive if they demonstrated this situation through some example, so that we could understand even better the dangers of this technology being developed in the wrong hands. This is due to the fact that in order for machines to learn artificial intelligence, an extensive number of data and algorithms are gathered by which the AI ​​is trained; this situation is best exposed by the excerpt “these large-scale AI systems must be built and evaluated to perform a task on a public distributed ledger platform (…) however, following in the footsteps of big tech research, the benchmarks and algorithms of AI rely on centralized datasets and algorithms. Next-generation AI systems, such as computer vision algorithms, rely heavily on deep learning algorithms trained on large datasets.” The problem is that this very aggressive and disorderly exploration of data generates unprecedented human decision-making and influences, according to the authors themselves, as is also made clearer in the excerpt “these cutting-edge data-driven systems require large data sets. unprecedented amount of data and will likely not scale with increasing task complexity.” In other words, what ends up being generated is that those surveyed train their machines with bigger and bigger data sets, and the disadvantages start to appear, as it is exposed here, in addition to the increase in data traffic, the confidentiality, privacy and security of user data is compromised. So to solve this, the proponents suggest that a research they started by doing the Ethereum blockchain migrate to Cardano (because of the advantages of our blockchain, such as cheaper transaction fees and faster). From what is understood, a decentralized structure makes the use of data safer and more secure; more reliable than a centralized system; the multi-chain structure will be useful for edge devices to solve everyday problems. This is due to the fact, from what I can understand, that smart contracts would perform a different job with the data: “the blockchain smart contract allows the evolution and storage of the model via IPFS, which is normally handled by a server center on federated learning. Without a central entity, blockchain-based federated learning is cryptographically secure, preserving the privacy of each node’s data.” In my view, our degree of understanding of what would be done is good, but I wish the proponents, in addition to providing a youtube video and an explanation of Github's operating modes, had provided more detailed explanations about their future work. The images provided help a lot in understanding, but even so less technical evaluators may not understand so well what will be done (I am not in the technology area, but I am in the community Cardano has been studying blockchain for over 1 year, so I understood from general what would be done - I would still like more details). However, in terms of impact, the proposal certainly meets the objectives of this challenge, as it will build a solution that works with integrations that already exist but will be improved, and there will also be a migration of technology from the Ethereum network to Cardano (initially by middle of the Milkomeda cross-chain, but later the project will be developed entirely in Plutus). That is, the goals of the Ethereum migration challenge are also addressed.", "q0r": 5, "q1": "The proposal is indeed very viable, only a few suggestions will be made. Regarding the script, I believe that the proponents explain to us in great detail what will be done, even though the activities are technical, they describe it with a good amount of information. We know what would happen in the first month and in the second, I didn't understand if the whole project would be developed in just 2 months, but I don't think so; then this proposal should cover, financially, a part of the processes. We also need to take into account that they already have this research started and minted on Ethereum, so they will carry out the migration and development process based on Cardano's own technologies. It's super positive as they present us with some deliverables, the roadmap is basically composed of two parts - the milestones, which would be the activities themselves, and the deliverables, which are the partial results achieved based on these actions. Therefore, regarding the development of the project itself, I believe that the information is passed on quite adequately. As for expenses, 50 thousand dollars are requested to finance the project - if we consider that this will last 2 months, the amount is quite high. It is explained based on some parts, some of which are better detailed than others. For example, about web development, we know, in addition to the total amount requested for this, how many hours per week would be dedicated to this work the hourly rate; the same information is also arranged for the development of smart contracts. Other parts are not so well explained, for example: \"Federated Learning Servers - $14K + Segregated Data Storage - $2K + Training Script Hosting Servers - $5K\". Why would learning servers cost 14K, what would that be, exactly? It would need to be better explained why each of these parts needs the requested investment amount. On the part of user incentives, we don't know if this would be an amount paid for some customers to test the beta version of the project, I would like this also to be clearer. However, in general, we were able to understand how the total order would be divided, although the degree of specificity could be a little higher. And finally, thinking in terms of the team, we have two professionals here: Dr. Bharath and Sam. The way in which one of them is presented is more appropriate than the other. About Dr. Bharath, unfortunately it would be necessary for us to know more about what he has been doing, which projects he has been involved in, in addition to which research areas he is interested in. For example, in the case of Sam, we know that he is a co-founder of Fetachain IO, he has already done the Plutus Pioneer program and so on. It would be important for us to know about Dr. Bharath too - he that we can see his research on academic google, but the ideal would be that some examples had been arranged here, in the proposal itself. Overall, we know that they are “a Singapore and India-based AI-Blockchain solution provider company primarily based in Cardano, with stakeholders at the National University of Singapore, defense partners and biomedical companies that require confidential machine learning” ; which conveys a lot of confidence, since they are already aware of what they are going to develop and also about our blockchain.", "q1r": 5, "q2": "Finally, when we analyze the auditability of the proposal, once again the topic is very good. We know how progress monitoring will be developed, which will mainly be by measuring the design of nodes and overall performance of the learning model - some KPIs are provided (feedback from pilot users + number of publicly available AI models generated by the framework for various AI tasks + onboarding new team members + IOG DApp verification and smart contract auditing that realize AI model privacy). And it is clear how this will become known to the Cardando community: the code development part can be followed by Github easily, since the repository will be open source. And the part of the other actions will be done through a blog of the company of the proponents (it was here to post the link of this blog). The only thing that remained pending, in my understanding, would be a more focused monitoring of the work routine of the professionals involved, knowing what they did each month, if the milestones present in the script were being properly obeyed, etc. So my suggestion is that, on the blog, they also reserve a space so that we can carry out this audit of the activities and processes, together with the monitoring of partial results - products that would be sporadically generated. And about the ultimate success, this one is well defined through “the deployment of the decentralized federated learning framework using the Cardano blockchain. A large-scale AIDA system will be able to integrate real-world users with a specific model learning objective in a distributed manner, while preserving data confidentiality and privacy.” It is super positive that the proponents already provide information on how all this will be put into practice - they cite the example of the health area at the National University of Singapore. So, once again, I have just one suggestion to make. It would be very important if, after being funded for some time, they prepared a presentation (together with the technology's pilot customers) to present to our community how this new solution was being used, which products it would have generated in practice, which were the gains for the Cardano ecosystem (for example, if at the University they cited people would have been more interested in our blockchain and would have sought to understand and engage more with our technologies/our community. Would they have become active members? The number of projects at Cardano was increased based on this initiative as well?). Due to these issues, I think the auditability is very good, just a few more points would be needed for it to be perfect, as I mentioned.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 9712, "q0": "The problem is clearly identified in this proposal and is closely aligned with the challenge. Integrating a proof-of-concept decentralized framework to train and deploy AI models onto the Cardano blockchain will add value to the ecosystem by helping drive growth and further innovation. The team have an array of experience and has already implemented their proof-of-concept decentralized framework on the Ethereum blockchain. They are looking to integrate onto the Cardano blockchain as transactions are faster, cheaper and more secure. The projects aim to integrate their AI system to build trust for the end-users and encourage innovation toward real-world use cases defining the project's unique challenge setting. This proposal has already shown its ability to scale to address challenges such as high gas fees on the Ethereum blockchain by integrating it into the Cardano blockchain to help remedy the issue. The proposer has also mentioned future risks and challenges when they integrate into Cardano and have provided sufficient understanding of how they plan to mitigate those issues. The proposal clearly articulates a plan for future sustainability, the propers listed several goals that help track the future success of the project. For example, one goal was to build resilient infrastructure. This goal makes sense for the project's future sustainability as its framework being proposed aims to withstand, adapt and be a tool for innovations made to help real-world use cases like in the medical sector for biomedical image processing.", "q0r": 5, "q1": "The information about the team presented in the proposal is detailed, and the experiences described and the work already performed on the Ethereum blockchain indicate that the team is capable of completing the integration onto the Cardano blockchain. They have also supported their competency through informative youtube videos and images of their AI architecture. The previous research conducted before receiving funding from Catalyst indicates a reliable and productive team. This is evident through the link provided that shows a list of all their publications. The team also understands, in an identifiable manner, the type and amount of team members required to implement the proposal by mentioning that they will be aiming to build a team of researchers and engineers for specialized work. The budget provided is outlined relatively clearly and broken down into identifiable items. It would have given me more confidence in their financial stability if they expanded on particular items. For example, the budget item ‘Federated learning servers – 14K’, seemed a little vague. It would have been beneficial to explain what this entailed, does it include expenditures for designing client systems, setting up training processes or addressing security? The plan for executing this project to users is promising as they have budgeted for ‘user incentives’. This gives confidence that they have accounted for driving the utility of their project. Overall, the budget does seem reasonable to achieve set goals. The proposal offers a realistic timetable to complete the work. The roadmap is detailed and very well prepared, providing clarity on the project’s timeline and milestones. The plan provided describes all the resources necessary to execute the proposal successfully and clearly explains the technical aspects that are crucial for implementation. The team has considered challenges and risks relevant to successful implementation and has addressed their mitigation plan. They are aware that model inversion attacks can happen to help prevent this they will propose homomorphic encryption to be incorporated in the smart contract. Another challenge the team considered is handling multiple UTXOs for different edge nodes while updating the federated model via smart contract – fully exploiting the E-UTXO model. This issue will be mitigated by onboarding specialized researchers, engineers and Plutus developers to their company and through their experience in previous success handling similar issues.", "q1r": 4, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. The roadmap is very well designed. There are milestones and deliverables with a clear time horizon for achievement. The metrics and KPIs were well chosen and I believe are good indicators for evaluating success, as the chosen outputs would indicate the performance of their AI framework and its integration onto the Cardano blockchain. The auditability is excellent, the team describes in great detail what success would look like, we know what the team’s ambitions are and have a clear understandable description of the targeted problem that can be measured against the proposed outcome. Through publishing documentation on their website blog, they provide an accessible channel for delivering updates to the community for auditing progress.", "q2r": 5, "assessor": "z_assessor_3086", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 9931, "q0": "Big data based machine learning is currently one of the most powerful technologies which direct people' lives and shape their behavior. It is never too early to start utilizing the available decentralized infrastructure for including these powerful technologies in decentralized services. \n\nWhen there is no data sovereignty, much of the most important data never go into these learning models. Oftentimes it is not even produced because of the lack of incentives. Thus, in many areas, the real preferences of the crowds never get built in the technologies that people use every day. My view is that, beyond the pilots, this kind of project demonstrates its greatest impact over the medium to long term. Evolution of the blockchain infrastructure and adoption of services accelerate the perceived utility of swarm learning and decentralized AI over time. As such, the proposal is well aligned with the funding Challenge. \n\n", "q0r": 5, "q1": "The system is, in principle, already deployed on Ethereum. The roadmap has very clear scheduled milestones and entities to be delivered. The budget feels realistic, although for me to understand the structure better, more detailed content would have helped. \n\nThe proposer has a solid academic as well as industrial background from the topic. The team members to implement the system have not been detailed yet but the proposers have experience in successfully delivering Cardano projects funded by Catalyst. \n\nThis is cutting edge technology with relatively few people to really understand possible challenges on the way. To me it looks a bit risky, especially regarding timelines, but all things considered the proposers are well equipped to complete the project according to the plan.", "q1r": 5, "q2": "The team is going to measure whether the system evolves as expected. The development work itself is available as open source in Github but some short regular updates would be appreciated. Deliverables in the roadmap is a good base schedule.\n\nKPIs after launch take many dimensions into account. The most obvious metric is the number of available AI models on the platform. There are very interesting pilots planned in the healthcare sector which provide first real use data in the form of surveys. The project is very transparent which is especially great considering how the things are usually done in centralized circles of the industry. ", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14606, "q0": "Today, artificial intelligence (AI) is considered one of the most important technologies, helping people solve many problems in life. The benefits of AI are indisputable. Because of the vast popularity of artificial intelligence, the issue of information security on the internet and modern technology is also deeply concerned. The potential audience for this project is the community and people who use shared learning methods.                                        \nThis is a potential project because their product functionality and features represent a global project: training a new AI model integrated with Cardano, solving the challenge posed by a centralized learning method. out.                                        \nThe technical part is clearly explained through the given architectural model. However, more case studies are needed to demonstrate the project's performance.                                        \nThe result of the challenge KPI align project - enriches the Cardano ecosystem and increases the number of new use cases. (The new use case here will be members of the federated learning process. )                                        \nThe choice to build a project on the Cardano platform is completely reasonable because, as the proponent said, the Cardano ecosystem is an ideal environment for increased security and predictability, and more powerful parallelization for the learning process linked by the blockchain. the right tools, libraries, and SDKs to make the idea possible. Another reason for choosing the Cardano ecosystem is cheaper and faster throughput, thereby saving capital and project implementation time.                                        \nThe proponents outlined the challenge they faced- and the solution to it. Ensuring security when migrating to Cardano is also mentioned in the same way as “modular migration”. This helps the proponent to maintain code reusability and avoid system-wide crashes due to unforeseen errors because of the modular architecture that allows the problem (or requirement) to be broken down into smaller pieces. software into parts that do not overlap and thus support parallel work on modules. Besides that, there is another challenge to preventing reverse-model attacks, and the proponent also offers a solution by including co-configuration encryption in this smart contract.                                        \nHowever, I wonder if there is enough strong evidence to prove that this project can expand in the future and increase the number of people entering the Cardano network, increasing the number of ADA users?", "q0r": 5, "q1": "Congratulations to the team for preparing a well-written description of the members' skills and experience. They are all people with high expertise in the field of software. Publications presented in google scholar, certificates, awards, and diplomas have strengthened the candidate's confidence in a well-prepared and potential project. There is a timeline detailing the actions to be taken that I find reasonable. There is also a high level of detail in the descriptions of the budget items, addressing all aspects of the budget. However, there is one small thing that I am wondering is how long the training process for the rest of the team members on the edge will take place? Does anyone on the team have Cardano blockchain expertise?And the definition of \"\"User incentives\"\" also makes me feel a bit confusing.", "q1r": 4, "q2": "While I commend your project for being global, it lacks information regarding the auditability aspects of this proposal. In particular, due to the fact that it's under budget, cycle parts training usually lasts from 3 months I think it would be better if you provide clear quantitative metrics reporting timelines showing whether privacy learning is beneficial for each node? The definition of the project's success is described carefully, the criteria for evaluating the success of the project are also detailed, and not only that, the proponent shows the ability to increase the use of the community of the project by demonstrating the usefulness of the AI ​​model after integrating with hospital equipment. If the project is successful, it will greatly benefit the fields of not only health, and information, but also economics, and even education. We are really looking forward to seeing the AI ​​demo!", "q2r": 3, "assessor": "z_assessor_4075", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A decentralized framework is key to build next-gen edge AI that enables model efficacy while making it safer and secure - both user data and model parameters are only accessible to the end-user.", "experience": "Our team based in Singapore and India has more than 10 years of experience in developing & building interactive AI systems. We specialize in integrating AI and IoT systems with blockchains - esp Cardano. We were successfully funded in Catalyst FUND 6 and FUND 7 (both completed)."}