{"id": 416997, "author": "otaviolima", "title": "Keyword Coin Price Widget for Sites", "url": "https://cardano.ideascale.com/a/dtd/416997-48088", "category": 26595, "amount": 47800, "description": "Know the real-time price of a coin or token in a news keyword, without having to go to external sites like Coinmarketcap or Coingecko, making reading fluid & without reading interruptions/distractions", "f6_no_assessments": 10, "f6_rating": 3.9666666666666663, "videos": [], "media": [], "f6_assessments": [{"id": 1664, "q0": "Unfortunately, I don't think this is a proposal that will have a high impact for Cardano, and I also don't see it being well aligned with the goals of the challenge. The idea is to create a tool that would make keywords like Cardano, for example, have their information displayed on screen when the user drags the mouse over it. This would be done with the aim of making it more practical to consult the values ​​of cryptocurrencies, for example, without people having to consult external websites such as Coinmarketcap or Coingecko, as the proponent claims. In my view, this project is not so valuable for Cardano because the focus is not just to benefit our blockchain, the proponent claims that the main cryptocurrencies would be included in the widget's functioning, as well as other terms from the cryptographic world (it would be interesting to understand which ones), the which makes me think that maybe it would be a much more interesting project for users in general than Cardano in particular. In this challenge, we are looking to finance projects that help our blockchain in its expansion and broad growth process; projects that can create interesting new products and integrations, or that improve existing ones; that increase the number of active members in our community, outstanding Ada, CNFTs and etc. The project in question, in my opinion, would not attract new members to our community, in fact it would improve the experience of all those who read news related to the cryptographic world, but it would not in any way demonstrate Cardano's differentials in relation to other blockchains. For the proposal to be more interesting, it would be necessary that this initiative, somehow, collaborate with the benefit of our ecosystem, if somehow, through these facilities, news readers were interested in learning more about Cardano and Catalyst, if get more involved with any of the various technologies available in our ecosystem and so on. Maybe if the asking price for the project were a little more affordable, it would be something worth funding to improve the navigability experience of our community members' websites (if it was created by the community and for the community), however, it's asking for 47 thousand dollars for the development of the tool, so I believe that this amount can perhaps be invested more accurately in projects that are more focused on Cardano, as I mentioned earlier. The idea is not bad, by any means, but it is also not something that meets what the challenge seeks, with specificity.", "q0r": 2, "q1": "Regarding the script, the activities described by the proponent raised some doubts. What interface would be created (month 1)? Since it would be a tool that from what I understand would be a kind of extension, used in the internet browser, what platform would they talk about? Would the tool have some web application, a kind of website? We even managed to understand what would be done and when, as the detailing of the months is adequate, the problem I really identified here was in relation to understanding what was suggested in the impact and what would be being developed in the activities schedule. Some confusion has been generated. In the same way that these doubts were raised for the script, the part of the division of expenses is also a little confusing because we do not know how the work routines of the professionals involved would be, we do not know how many hours the front and back developers work. end just as the designer would dedicate to the project, so it is not possible for us to calculate the value of the hour of work and understand if what is being charged would in fact be fair. I would like to know more details about the marketing services - how this campaign would be done - and also what would be the mentioned maintenance services. I notice that the expenses requested here are similar to the two other proposals of the same bidder in this challenge, and in the 3 cases my comments were similar, as I believe that the information that was passed is more of a basic nature and needs a little more depth. Finally speaking about the team, this is the best part of the feasibility, they are described in great detail who are the members involved. The proponent already has experience with Cardano (he is the founder of the Cardano Feed website), and also says he is a blockchain enthusiast and already has experience with several very relevant technologies for the development of projects surrounding Catalyst, such as “e-commerce B2B and B2C, marketplace, digital marketing, UX/user experience, navigation tests, interface, information architecture, big data, data-driven, data science, webmetrics, BI (Business Intelligence), open innovation, crowdsourcing” and so on. The other team members also make very good presentations about themselves, Felipe from the software engineering area and Lucas working in the marketing side. I was in doubt about the role that Gino would play in the project, maybe he will help in the dissemination, preparing the texts to be released. What was missing was to present who would be the designer, as he is a fundamental professional for the project and is not included in this team. Therefore, I believe that we have positive points here, but also a lot of aspects to be improved.", "q1r": 3, "q2": "We don't have many means to audit the proposal development process based on the information that is passed, unfortunately. To measure progress, the proponent only suggests looking at the numbers of script impressions and also listed coins; how could we monitor the tasks to be developed behind these partial results? As I suggested for Otávio's other proposals, I think it would be important that they take the content provided in the roadmap and make it accessible to our community members as these activities are being developed in practice. For this to be even more adequate, it would be interesting for them to carry out a more in-depth detailing of each of the parts, so that we would know very precisely what would happen and how (and when). For example, in the first month, let's say the developers work part-time on this project - that way it would be more accurate for us to control whether what was agreed was being promised, for example. Ideally, the team leader would hold a monthly meeting with the rest of the professionals involved and collect the information, which could be passed on in the form of newsletters to the Cardano community. Regarding the success scenario, the auditability of the final results, as in the other proposals, the focus here is enough for the success of the tool itself (Number of triggers and visualization of the overlay widget / Number of integrated content / CTR: Widget impression to click ratio). It would be important for us to understand what was thought for the technology would have been achieved - in general, if the navigability and the level of user satisfaction would have improved from this initiative. But it is also essential for us to understand whether the project would have had a positive impact on Cardano, whether the objectives of the challenge were met, directly or indirectly. This could be done if users, after installing the tool in their web browsers, show some kind of interest in Cardano and its technologies, somehow this tool aroused curiosity so that they know better about our ecosystem and get involved in our activities, whether with Catalyst projects, using Dapps, buying and delegating Ada…? How could this research be understood and passed on to the Cardano community? Therefore, I conclude that, based on what has been said, I do not believe that such an adequate monitoring of the project would be carried out, and that several adjustments and deepenings are necessary for this to be carried out in a satisfactory manner.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "The assessor shows that he did not fully understand the proposal presented, informing browser extension and the like. At various times, I put very personal aspects and impressions in the analysis of the proposal. We request a reassessment."}, {"id": 2801, "q0": "This proposal is committed to providing a solution to support the visibility and information related to any native token of any Blockchain platform.\n by inserting transaction-related information and updating prices in real time, just by placing the mouse on the name or characters related to that token, users can instantly update the information on without logging into other sites, in another window,\nHowever, I have a question for the team that hasn't mentioned is this application universal for all social networking platforms or another article or blog or can only be used for web-based integration. .\nThe most important issue that would hinder the development of this proposal was provided by the team and provided a solution,\nso based on the arguments and visual documentation provided by the proposal team, it is very likely that this proposal will be successful, but it is necessary to confirm the popularity of this integration.", "q0r": 4, "q1": "Five months will be the time when the publishing team will finalize this proposal, and the implementation plan is broken down by month as an important milestone, all of which are fully provided and in line with the committed time.\n however in the budget spending section there seems to be an overlap when there are already two marketing spends: \"Marketing assistant = $600 x 4 months = $2,400, and Social Media = $800 x 4 months = $3,200\" , but there is still this spending related to marketing \"Marketing Budget = $800\", I don't understand this yet thanks for the suggestion team to explain, thanks.\nThe information about the team is provided very well as well as the relevant experience of each member to this proposal, identifying a group of 4 people and having a specific assignment for each position of each job. .\n Thus, the team only needs to recalculate whether there is a mistake or other estimate in the budget mentioned above, but that will not have a big impact on the success of this proposal.", "q1r": 4, "q2": "There are 4 indicators provided by the team to serve the community to monitor and verify, in addition, the team is committed to providing monthly reports to the community on the Cardano Feed website platform, of the proposal, and the team also committed to aggregating all such completed workloads and making available to Catalyst funds.\n There will be 3 suggested success metrics providing examples: Overlay widget visualization and trigger count, display and widget relationship authenticity, and more. Special team will take user feedback and improve development as perfect as possible in the future.\nso all have been provided by the proposal team with adequate assurance for tracking the work done and easily determining the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5884, "q0": "This proposal is very interesting, it solves the challenge posed, gives users a better experience, makes reading uninterrupted. For example, if someone is reading a news that talks about Cardano, that term will be emphasis and hovering over it will open an overlay with real-time currency price information, volume, % up or % down, etc. As a result, user will not need to leave the page to consult the currency price on external sites such as CoinmarketCap or Coingecko, bringing great speed and improving the user experience within the news sites.", "q0r": 5, "q1": "Your team consists of developers, SEO, UX/UI, marketing,... Based on the information provided, they have all the knowledge, experience, and skills to carry out this project. Their linkedin profile is also listed, which makes the team information transparent. Besides, the team has achieved great success in implementing Cardanofeed.com (with over 1 million monthly visits). Having a strong team will be a big advantage, which will increase the project's ability to be implemented.\nDetailed roadmap (5 months) has been provided. You've identified what needs to be done and allotted it to specific timelines. This will give the project a clear direction. Thanks to having a detailed roadmap, allocating a budget becomes a lot easier. You have calculated a budget based on the number of months and the amount for each month. However, it would be great if you could provide a more specific budget allocation. Here, I have a few suggestions for you: specify the number of hours worked, the number of people who will be involved in each job, the hourly wage, . . . The specific and transparent budget allocation will help increase people's confidence in this project. In addition, there are metrics to evaluate the progress and success of the project.", "q1r": 4, "q2": "I have read all the information you provided (including suggestions, videos, attached images,...). The information provided is complete, people can rely on it to evaluate the success of this project.\nBesides, I also want to give you a compliment for identifying the difficulty, the challenge and how to reduce it. Although the add-on was initially only installed on the CardanoFeed.com website, in the future, I hope to see it appear on all other technology sites.\nThis project has great significance, it will help users have a better experience, save time, and avoid distraction. Another plus point of this project is the ability to be self-sufficient and economically self-sufficient after being funded. This is an important factor in deciding whether to invest in this project or not.\nI myself am a regular person reading the news, every time I come across a coin, I often spend a lot of time manually searching for its price and information. If this project is successfully implemented, it will definitely bring everyone, especially me personally, a better experience. In the end, I fully believe in the success of the project. this. Thank you for a great suggestion!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7538, "q0": "To know the price of a coin or token in a news keyword without having to visit Coinmarketcap or Coingecko but still make reading smooth and without distraction is a problem that needs to be solved. tackle this challenge. It is directly related to this proposal of the author. The solution clearly identifies keywords in the news content of cryptocurrency websites, displays prices and real-time information about coins or tokens these help to solve the problem of challenge. The main challenge for this project will be the integration of the widget script with the content portals covering the crypto world. Participants will install on the CardanoFeed.com website, which has more than 1,000,000 monthly visits and gives great visibility to the projects and also acts as a great case for deployment on other websites. This is the first step to the success of the project. With the above challenges, I believe the project will be successful if funded.", "q0r": 5, "q1": "The author has provided a complete blueprint with clear timelines. Timeline is divided into 5 months by the author. Specific goals are clearly listed by the author in each month. The progress of the project is also easily trackable through the web links that the author has listed. The success is clearly described by the author as the results achieved are: number of overlay widgets triggers and visualizations, CTR: relationship between Widget impressions and clicks, response validation and platform improvements. This success is directly related to the challenge of the campaigns.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous.\nThe author will provide the community with some kind of progress report as we go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of the project proposal.\nThe author will also provide a table to be popularized in Cardano Script Impressions: 100,000\nNumber of coins listed: 50\nNumber of built-in content pages: 10\nIntegrate with roadmap content sites\nWith the above indicators is enough audit for this proposal.\nOur team consists of developers, UX/UI, Marketing, SEO, Marketing, Business. The team consists of 4 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed, Felipe Barcelos is a Software Engineer and full stack, Gino Matos is a Crypto Journalist and content editor, Lucas Fernandes is a marketing assistant. The author also outlines what each member of the team has done, they talk about their experiences. their previous experience. They also link attached network links so we can easily follow their projects easily. The funding applied for this proposal is $47,800 less than 20% of the entire challenge budget. The budget is broken down into reasonable expenditures. The budgets and timelines presented are fully auditable for this project to be reasonable.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9488, "q0": "I rank this section a 3 for a lack of articulated impacts that would prove worth for the above average cost of this proposal. I can assume that there will be added convenience for people that are researching cryptocurrency and a marginally greater user experience by having price information more easily accessible. The question I find myself wrestling with is if the potential benefits of this proposal is worth the asked $48k, which is what this impacts section is supposed to be for. I think this section of the proposal would greatly benefit from some hypothetical examples that paints the picture for how this would benefit the Cardano ecosystem in a way that is worth more than what other proposals have to offer. If there is any research about price information translating to asset purchasing, this would be the perfect time to input that information. While there’s plenty of information here to tell me what this team plans on doing, there isn’t enough substance to tell me what the positive impact would be. I very much appreciate the quantification of potential impacts, with the given data about 1 million monthly visits to the CardanoFeed.com site, voters just aren’t given any indication of what those impacts could be (with an articulation of why this will effectively accomplish those impacts). ", "q0r": 3, "q1": "For a well rounded team of talent, a clearly outlined roadmap (with very fast delivery), and an easily understandable budget, I rank this section a 4. I’m very enthusiastic about the comprehensive stack of experience on this team in technical development, writing, marketing, and entrepreneurship. This team is a very self-sufficient unit that has everything they need to do what CardanoFeed intends to do. The roadmap is a clear symptom of that, as it lays out a very expedient delivery with clear step-by-step actionable points. Where this section loses some points from me is the shortage of key evaluative detail in the budget section. This is important for a proposal requesting funds that is above the average cost of Catalyst fund requests. While the budget does provide allocations towards various categories needed to accomplish the building of this widget, it omits information about hourly rates and hours allocated to each position/task. Without this information, voters have no way of measuring efficiency in spending to evaluate if Catalyst funds are spent well here OR if they could be better spent (with potentially greater impacts) in other proposals. If you assume full-time hours, the labor for this budget is extremely cheap. However, all of these core team members are actively working on a pre-established company that has its own separate daily responsibilities and tasks. So full-time hours is not a safe assumption and voters do not have any reference point to understand this budget. The addition of this information would most definitely earn a secure 5. ", "q1r": 4, "q2": "While there’s not a lot of content in this section, there is enough substance to show a clear measurement of performance for me to rank this section a 4. The targeted quantification of different KPIs for this widget helps me (and voters) to see the link to potential impacts. If there were more articulated impacts in this proposal, this section would give me a clearer view of the magnitude of those impacts and how effectively those benefits can be reaped. I might suggest that the given metrics are a little underwhelming for 100,000/1,000,000 monthly views, it seems like the platform does not intend on expecting platform growth after a 5 month timeframe. I would suggest establishing milestones across different timeframes of the future of this project, so that voters can see a clear progression from point A to point B. This provides voters with a perception that the proposers have an acute sense of expected performance AND it shows a more sustained impact scenario. I rank positively because the KPIs are appropriate and the quantification helps a lot, but I do think there are some little improvements that could be made to leave voters with a more positive reaction. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12612, "q0": "The project effectively addresses the challenge. The goal of the project is quite understandable, it solves the inconvenience when users have to visit websites about the price of cryptocurrencies.\nThis feature is really cool, but instead of opening an overlay with real-time currency price information, volume, cap,... you can completely assign these numbers directly to the text lines on the web. Since users don't always need to know all these metrics, For example they only need to know about the price of a coin, they just need to read a line on the website like \" Currently Bitcoin price is |...| \" and prices will be updated continuously in |...|. You've probably thought of this already, as for the project, it's pretty straightforward and completely doable, I don't ask for anything more.", "q0r": 5, "q1": "Thank you for detailing evidence of the individual skills and experiences of the team member involved. And the members are all experienced people in the fields related to the project and they also achieved certain successes. Therefore, I am quite confident that they will meet the workload given. The Roadmap of the project is quite detailed, I hope you will add which experts will be involved in each process. I have no opinion on this part of the proposal, I think the information provided is satisfactory. As for the budget, I think it fits the scope of the project and it's not difficult to understand how it will be used. Based on the information presented in the proposal, the project has a high probability of being successful as promised.", "q1r": 5, "q2": "The information provided is not overwhelming, but it is enough and that's what I needed. The proposer explicitly mentioned how the community can track the project's progress in the form of a monthly news release on the Cardano Feed. This is easy to reach. The KPIs and vision presented by the proposer are reasonable and I think it fits perfectly with the scope of this project.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14459, "q0": "The proposal is made to improve cryptocurrency users’ experience by allowing them to check real-time coin prices without having to go into specific pages to check. This is done by embedding keywords on articles with related words (“Cardano” for instance) for it to be emphasized and directing readers to an overlay with real-time coin prices within a click. The proposal is able to demonstrate the convenience and how this will improve users’ experience. The technical workings of this is clearly explained (how it is inserted through Google Tag Manager). The proposer also puts an emphasis on speed and response time for this integration to be a truly helpful service. However, the proposer has not emphasized how this will have an effect on the Cardano community and their publicity. How will the Cardano and Catalyst project benefit from this proposal? (ex: people know of Cardano through their funding for this widget,..). Furthermore, the proposer could also elaborate how this proposal will make Cardano native coins gain more recognition in the cryptocurrency. The main risk is the application of this to crypto-related content portals/websites. However, the phrase is a bit vague. Does this mean the risk is that other websites won’t allow this integration or writing widget script on these content portals may have some difficulties in functioning or the concern that other portals won’t have enough users to recognize the use of this widget? The solution for the risk that the proposer identified is mostly related to the concern for lack of visibility and thus mitigated by applying the widget on their own website (with over 1 million monthly visits), therefore an effective mitigation. However, the proposer should also consider the above mentioned risks.", "q0r": 3, "q1": "The plan will be conducted in 5 months. In each month, the set of activities taking place is clearly listed, giving transparency and understanding of what will be done to set up this project. The proposer could also give specific dates/months/period of time to pinpoint the occurrence of these activities (ex: 8/2022, Q2/2023,...). The budget breakdown is also clearly presented with information about how much is paid for human resources (developers/marketers/assistants/designers). However, the proposer should specify the amount of budget ($3,200) for “Social Media”. Does “social media” mean advertisement posts on Facebook/Instagram/… or community building or admins? The phrase “social media” itself is a bit vague for assessment so the proposer should make it clear what will be spent on social media. Similarly, the budget for marketing should also include a breakdown of what approaches will be used for marketing and how much for each (if possible) (billboards/campaigns/flyers/…). The team members are given clear profiles and descriptions of their experiences, expertise, and interest. It can be seen that many team members of this project are long-term enthusiasts of cryptocurrency and blockchain and others are specialized in development, computing, marketing, content writing,... They are all relevant skills needed to work on this project, reflecting the good feasibility coming from human resources. The proposer is confident that this proposal won’t need further funding in a later round.", "q1r": 4, "q2": "The auditability is acceptable with quantifiable key metrics (the number of …). However the number of key metrics can be increased for better assessment from more perspectives. The proposer should explain a bit about how these measurements could help reflect the progress (ex: what does the number of coins listed reflect). The vision of success is suitable with the objective of the proposal.", "q2r": 3, "assessor": "z_assessor_4055", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14491, "q0": "The purpose of the project is to create a widget that can be added directly into the keywords in the news content of cryptocurrency websites, displaying real-time coin price and information. This feature eliminates the need for users to leave the page to check the currency price on external sites, resulting in increased performance and a better user experience on news sites. This proposal aligns with the Challenge and smoothly integrating with existing products and creating a positive user experience. The proposal outline is also detailed. This project's successful implementation is definitely achievable. The proposer has provided us with detailed information on how the feature works technically, as well as risks and mitigations.", "q0r": 5, "q1": "The proposal includes a very clear and detailed implementation plan, showing that the developers have put thought into this. The budget is properly broken out and explains how the funds would be allocated. The budget requested appears to be reasonable for the project. The project team possesses the necessary experience and technical skills to properly implement the proposal. They've also included social media links, such as LinkedIn accounts, to validate the credentials and expertise mentioned in the proposal. Given the team's skill set, if funded, they should be able to successfully implement the entirety of this proposal.", "q1r": 5, "q2": "The proposal includes enough metrics, KPIs, and clearly defined milestones to ensure that it is funded. However, the project should have included time framed KPIs and targets to help evaluate progress as it develops and have a reference if success was met or not. The roadmap's milestones will also assist in tracking project progress. Again, in the definitions of success portion of the proposal, a set of metrics is provided, which will not enough to define how success for this project will look like. As a result, more information is required to assess the proposal's progress and success.", "q2r": 3, "assessor": "z_assessor_4060", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14660, "q0": "In my opinion, this is really an promising idea. This aims to create a widget that could provide real-time price and information about coin or token. It is really convenient for users. When surfing the sites and wanting to know more about a coin, they can get it right on that sites with this widget instead of having to go to external sites like Coinmarketcap or Coingecko. The infomation displayed is quite specific with real-time currency price information, volume, % up or % down, etc. My advice here is that the proposer should have presented about the target audiences, the action to attract them and the impact on the Cardano  system. That would help strengthen the idea. This proposal mentioned about how this widget would be inserted, but it would be better if it included more details about the result after being completed and funded. There is one main challenge for the project which is the integration of the widget script. I wished there were any solutions to mitigate this. ", "q0r": 3, "q1": "This proposal has a five-month roadmap. The team divided quite clearly and each period has specific task. On the financial breakdown, there are five parts included. However, I think there is one thing the proposer should make it more clear. In the detailed plan, I do not see much information about social media and marketing. The author should have showed details about those two, so that I can have a clear understanding about how the money will be spent. The team members were well-described in this. I can see not just their names, roles, backgounds and other experiences but also their Linkedin profiles, so we can check out and figure out more about them. According to those, the team seems to have the capability to carry out the project. ", "q1r": 4, "q2": "The team used 3 criterias as a guides to evaluate the project's process, which I found quite reasonable. However, the success picture did not impress me. The team defined their success through 3 KIPs without any specific numbers. My suggestion is that the team should discuss and set a clear KIPs for each point. With metrics it would be much easier for them to know what is going on with the project, to keep track and also for the investor to assess the project success. ", "q2r": 2, "assessor": "z_assessor_4079", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14732, "q0": "\"The idea of this project is to enhance the user experience when surfing crypto news by adding the real-time price and relevant information (such as total volume, percent up/down, etc.) of coins. This widget is inserted into keywords (the keywords are emphasized) related to coins of cryptocurrency websites. This saves time for users; then they will not need to check the coin information on other websites.\nFrom my perspective, the proposers provided sufficient information for a non-tech background person (like me) to understand the project. I agree with the stated risk that is the integration with the content portals. The proposals will test this widget on CardanoFeed.com, and let’s see how this widget works.\nIn my opinion, the idea even though simple but this is an important feature that the news websites should have. This user experience enhancing may contribute to the increase of users into the Cardano system. This widget/solution is well aligned with the challenge setting.\"", "q0r": 5, "q1": "\"The detailed plan by months was provided. To make the proposal clearer for readers and increase the feasibility, it would be better if the proposers provided the exact started date and implementation methods for each task. For example, what is the starting date of front-end programming, and what is the coding language used? \nThe budget was provided in detail, in my opinion. Some costs needed to be more in-detail, for example how do the proposers come up with the Marketing Budget of $800? To improve the proposal, the proposers should allocate the funding into the roadmap. The human resources are provided, with in-detail information about work experiences and backgrounds of team members. This team consists of experienced individuals with strong backgrounds in business & engineering, and the team members are familiar with Cardano project. This will boost the feasibility of this project.\"", "q1r": 4, "q2": "Since the project idea was not so complicated thus the number of KPIs/metrics provided were sufficient to me. However, I think just listing out the KPIs was not enough; I would like to recommend the proposers to state exactly how long they want to achieve these KPIs/metrics. Moreover, some KPIs/metrics should be clearer, for example the “number of coins” criteria, since the number of coins on the market is huge. Therefore, I wonder what coins that the proposers were aiming to implement in this project, and (if possible), please explain why do the proposers choose these coins?", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Powerful widget inserted into keywords in news content of cryptocurrency websites, displaying real-time price & info about coin or token. All in modal with the relevant information about the currency.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}