{"id": 416991, "author": "otaviolima", "title": "All-in-One Link for Web3 Projects", "url": "https://cardano.ideascale.com/a/dtd/416991-48088", "category": 26595, "amount": 48300, "description": "An \"all in one\" link platform designed to meet the needs of Web3, NFT and Tokens projects. That interacts with the functionality, scalability, security and power of the Cardano blockchain.", "f6_no_assessments": 7, "f6_rating": 4.476190476190476, "videos": [], "media": [], "f6_assessments": [{"id": 3456, "q0": "The idea of this proposal is to develop a platform where one can keep track on all link, NFT, wallters and web3 matters in one place.\nThis indeed may help people to get better organized and possibly increase the use/adoption of Cardano and blockchains. It is also aligned with challenge as it creates a product (platform) to faciliate Cardano integration amongst its part (challenge kpi \"Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products.\").\n\nHowever, proposer could better ellaborate on the problem statement, to make it clearer what is being solved and what value it has. The problem statement of this proposal is actually the solution already.\nThe platform communiation and marketing strategy could also be better explained. This is imporant to increase the number of users fast. \nLast, as more of a suggestion for future proposals, a screenshot of what the portal would look like (even if just a concept/idea) could be provided to make it easier to undestand how it will work.\n\n", "q0r": 4, "q1": "Starting with the plan, it has a good level of details with deliverables and the activities necessary to develop them. It is time-framed and divided by month. Its nice to see that the platform will be validated tiwh key users as it is being created. an agile life-cycle can help a lot on this.\nBudget breakdown is sensible and encompasses the whole plan. It also contains a good level of details.\nThe team seems to be composed of 4 people with a lof of experience in Cardano, marketing and software engineering. A good level of description is given just as linkedin links. However, it would be nice to understand the role of each person in the project and how it related to the roles in the budget. For example, budget breakdown says that there'll be one back end developer and one front end. it would be nice to see in the team who will perform each. This is speacially imporant because the budget seems to have more people in it than the team here stated. In the 'managing workload' part, it says that they'll have 7 collaborators working with them, but no information is provided about these collaborators so its hard to evaluate their competences.", "q1r": 4, "q2": "Proposer provides plenty of good kpis for auditing project and they all have targets, which is really good for assessing whether platform have met the desired goals. Reports will also be available in their site (Cardanos feed) and feedback for improvement is considered. My only suggestion would be to include also the product backlog in the reports in case an agile framework is adopted\nAll in all, I strongly agree that the elements provided are sufficient to track progress and measure success.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3673, "q0": "From the team’s description of the project, it seems like they are trying to build a sort of Linktree for web3 projects. For those unfamiliar, LInktree is one type of those “link in bio” startups where creators on Instagram for example put a link in their bio. Clicking on that link will bring you to the creator’s main link page which contains more links to the creator’s other works which could be their tiktok page, linkedin, onlyfans, websites and anything with a link really.\n\nBut there are multiple implementations of this “all-in-one” link and the team did not show any examples, so some visual mockups would be good. Some web2 implementations literally only have links some have pictures acting as links, so it would good if the team could show what they want to build in more concrete terms.\n\nIn terms of impact, this could be big. Linktree became a unicorn just a few months ago and it is easy to see how a web3 version could benefit web3 creators too. It would be easy to see and follow a creator’s projects across different blockchains and platforms, across both web2 and web3 which might span their NFTs, tiktok, Instagram, websites, DAOs etc. Reducing friction for creators and their fans would onboard more people into web3 and cardano. It could also evolve to include use cases we have not dreamt of yet.\n\nOne downside is that web2 versions would out compete a web3 version in the short to medium term as most eyeballs are still in web2 platforms like tiktok and IG. Whereas web3 social media is quite undeveloped in comparison and may not get a lot of users and thus less usage for web3 all in one links. The team also did not articulate how much added benefit a web3 version of LInktree could bring over a web2 version since it only contains links which web2 can handle as well. Also would creators really value the decentralization enough to switch over given that these link in bio startups have pretty good uptime too and they are free to use while the team here wants to charge a fee. Nonetheless, web3 is growing quickly and novel use cases might evolve hence it's still getting 4 stars.\n", "q0r": 4, "q1": "The timeline for the project is well laid out, though like in most proposals this should be taken more as the best case scenario and not enough proposers factor in allowance for unforeseen delays.\n\nThe amount of funds requested seems to be reasonable at first glance and most of it comes down to salaries with 2/3 for 2 software engineers, but given that this type of project is likely to be profit seeking instead of an open source implementation or public good, are these salaries justifiable? Voters have to decide.\n\nAlso, on the aspect of self-sustainability, the team indicated that no further funding from Catalyst would be needed as they could charge a fee for using their all in one link. But it seems doubtful at best as web2 versions like Linktree are free to use and the team did not articulate why creators would want to pay for this.\nOtherwise, it seems like the team has enough experience over a broad range of categories from software engineering to marketing to journalism and content editing and have experience running Cardano Feed which seems to be a yahoo like interface for all things Cardano. They also indicated that they have more people they know who can help and this might be needed given that the team is also working on previous projects from previous catalyst rounds so they might be a bit stretched.\n", "q1r": 4, "q2": "The team has committed to publish a monthly report on their website Cardano Feed. While there are clear and good metrics to measure their success and impact, it should be noted that unless the data is on chain, voters would have to trust the team to report the metrics honestly. On this issue of verifiability, the team also did not give more details on how the data would be gathered and reported so auditability ranks lower. ", "q2r": 3, "assessor": "z_assessor_2468", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6060, "q0": "The proposal aims to develop an \"All in One\" link platform designed to meet the needs of Web3, NFT, and Tokens projects on the Cardano platform. Usability, information architecture, user experience, and user interface are all integrated into this federated platform. Indexing techniques to improve SEO for user profiles will be applied using \"All-in-One\" links, thus bringing more organic traffic and better indexing than in internet search engines. I completely agree that this challenge is crucial to achieving Cardano's mission", "q0r": 5, "q1": "The members behind the proposal have the appropriate qualifications and experience to implement this proposal. Their public profile on LinkedIn has been included in the description. The workflow takes place over six months and is divided into five key milestones. A $48,300 budget split across categories: developer Front-end, developer Back-end, product owner, marketing assistant, social media, designer UX/UI, marketing, and Amazon AWS Services maintenance (1 year). I rate the work plan and budget analysis very well and am confident in the feasibility of this proposal.", "q1r": 5, "q2": "To limit the difficulty in building this \"All-in-One\" affiliate platform, the author team already has many website link templates3 that have been inserted into the platform, thus facilitating the proposal implementation's progress. They have also explicitly quantified metrics to track project progress, such as: Number of hits to the website: 50,000; Number of registered users: 3000; Number of user subscriptions: 100; Number of connected Web3 wallets: 3,000. Some progress reports in the form of monthly newsletters on the Cardano Feed are also a tool to measure the project's progress. To sum up, I fully believe in the transparency of this proposal.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6104, "q0": "The proponent proposed an \"all-in-one\" federation platform designed to meet the needs of Web3, NFT and Tokens projects. That interacts with the functionality, scalability, security, and power of the Cardano blockchain. The proposal is suitable for the challenge posed. Here, the author is working towards developing an \"All-in-One\" Links platform that brings together all the links, NFTs and User Wallets, dedicated to solving the needs of Web3, NFT and Wallet projects. Tokens. By using decentralization and the power of the Cardano blockchain. Using \"All-In-One\" Links will include indexing techniques to improve SEO of user's profile resulting in more organic traffic and better indexing in tools search on the internet. Besides, the author has also recognized the risks in the project and has solutions to facilitate the application, facilitate the understanding and introduction of the projects faster.", "q0r": 5, "q1": "The author gives us the information to evaluate this section. The first is about the route. The project plan will be carried out in 6 months. At the same time, the work to be done in the project is also listed in detail. We know what work needs to be done, in what time frame to make the project successful. Next is the budget. Proposal asking for $48,300. In my opinion, this is a reasonably required budget for the work and time of the project. At the same time, the author has provided a breakdown of the budget broken down and allocated for each specific job. We know exactly what and how the funding will be used. Finally, the members join the group. We know about the identities and roles of project members. The members are all people with appropriate skills and experience to do the work in the project. At the same time, the author also provides presentations about each member, and attaches links to let us know more about the history and work of the members that the proposal has presented. In general, the proposed plan is very feasible, the budget is transparent. Detailed roadmap and qualified experts will spend a lot of time to well perform the work in the project according to the set schedule.", "q1r": 5, "q2": "The team provided us with good data to evaluate this section. Start with the fact that in this topic the jobs are divided into the respective months. in this way we can monitor whether the activities are carried out on schedule as described. In addition, all data provided and presented as a process check involves numbers. Specifically: Number of visits to the website: 50,000; Number of subscribers: 3,000; Number of Web3 wallets connected: 3,000... This helps us understand how big the project is becoming. Also to measure progress, the team will provide the community with some kind of report in the form of a monthly news release on the Cardano Feed. The team provided the necessary information, we have a more certain view of what to expect. The information is sufficient for us to audit accurately and transparently.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6417, "q0": "Creating tools on the Cardano blockchain is very beneficial to the ecosystem right now. There are currently so many projects that would love and All-in-one link for their web3 projects. The team plans to create an All-in-one link platform that aggregates all links, NFTs and Wallets of a user. This has potential to benefit many users in the Cardano community. Something that can be included in this proposal is how the team plans to address the challenge by creating demand for their project. Describe solutions to how growing a community will directly address the challenge and how there will be a sufficient amount of people that will go to Cardano-feed to be their main \"All-in-one link. I think that there is a lot of potential behind a project like this. Especially because tooling in the ecosystem is really important right now. However, some of these things can be more specific and understandable for all readers. For these reasons, I give this section 4 out of 5 stars. However, I still feel that this project can bring a lot of utility to specific members on Cardano. The team just needs to find this group that would be interested in their product.", "q0r": 4, "q1": "Looking into the experience of the team members of this proposal was very good. I was impressed with the amount of information that was provided for each team member and also the fact that the LinkeIn profiles were included. This is a great sign to me because it shows that the team is willing to be held accountable for this project. This also shows that they are confident in their abilities to implement their proposed idea successfully. They have a specific roadmap that is split up into 6 months. There is a clear description for each month that shows what the team plans on accomplishing throughout that specific month. Once again. Having specific information is extremely important because it will allow for the community behind this proposal to hold the team accountable for each month. The budget breakdown includes a good of information that allows the reader to see where the requested funds will be allocated. Something that the team can include in this section is give details on how the requested amount for each section will be necessary to accomplish their project to create their all-in-one links for web3 projects. For these reasons, I give this section 4 out of 5 stars. ", "q1r": 4, "q2": "I was happy to see that this proposal includes a lot of specific information. Specifically, the information on the team members. It is usually a good sign when the team is confident enough to include their personal details. It helps suggest that the team is going to carry-out their proposal and helps audit the potential success of the proposal. The roadmap section is written very well. There is specific information and details are included in each month for 6 months. The budget breakdown can include more specifics but still includes sufficient information. Given the scenario that this proposal is funded. I would suggest the team considers these thoughts of mine. The team should think about how they plan to promote their project. Or in other words, how is the team going to grow a community behind their project. Creating an all-in-one link for web3 projects is clearly a project that people may find valuable. The team needs to find a way to have a devoted community. This is mentioned because it is one of the most important ways to determine the potential success of a proposal. For these reasons, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7537, "q0": "The idea is so good it fits the goal of the challenge. It's an \"all-in-one\" link designed to meet the needs of Web3, NFT and Tokens projects. This proposal is clearly defined it has the interoperability, scalability, security and power of the Cardano blockchain. This is a good proposal and relevant to the present. The solution is clearly defined developing a powerful \"All-in-One\" Affiliate platform that brings together all the user's links, NFTs and Wallets. This 3-in-1 connection helps to solve the problem of the challenge. The main challenge of the project will be to get the first NFT or Token projects to develop Web3 digital strategies with a platform to expand the marketing strategy with \"All in One\" Affiliates. The author is confident that this project will be risk-free from crypto users, as many already understand the workings of Web3 wallets and the use of NFTs.", "q0r": 5, "q1": "The author has provided a complete blueprint with clear timelines. Timeline is divided by the author into 6 months. The action plan is clearly explained in detail month by month. The author has also provided a clear roadmap with detailed paragraphs and milestones, a clear vision towards the stated goal. . The progress of the project is also easily trackable through the web links that the author has listed. The success is clearly described by the author as the results achieved are: information generated in real time for website users, amount of shares on social networks, number of websites and project stores with applications , shares on specialized media sites, feedback validation, and platform improvements. This success is directly related to the challenge of the campaigns.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous.\nThe author will provide the community with some kind of progress report as we go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of the project proposal.\nInformation generated in real time for website users\nThe amount of shares on social networks\nNumber of websites and project stores with apps\nNumber of shares on specialized media sites\nValidate feedback and improve the platform\nWith the above indicators is enough audit for this proposal. Our team consists of developers, UX/UI, Marketing, SEO, Marketing, Business. The team consists of 4 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed, Felipe Barcelos is a Software Engineer and full stack, Gino Matos is a Crypto Journalist and content editor, Lucas Fernandes is a marketing assistant. The author also outlines what each member of the team has done, they talk about their experiences. their previous experience. They also link attached network links so we can easily follow their projects easily. The funding applied for this proposal is $48,300 less than 20% of the entire challenge budget. A reasonable budget is divided into different sections and details how the budget will be used, details for each item to be spent. The actual estimated budget to develop the platform shows that this is a potential project.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12611, "q0": "Proposal fit the challenge. A platform that allows to provide all the information or links of proof of wallet, NFT, ... related to the project, this is convenient and fast. Users will no longer have difficulty in researching projects, if this information is highly accurate and targeted at user needs, this can help investors make the best decisions. So I welcome this project.\nThe only problem is that the amount of information this proposal provides is adequate, but not satisfactory. You should specify some of the features that represent the platform, such as the integration of wallets or assets such as users' NFTs into the project, how to both ensure user privacy, can provide enough information to satisfy the audience. And are there other special features?, I hope you clarify this part.", "q0r": 4, "q1": "Thank you for providing details about who the project team members are and their qualifications and experience. The evidence of experience leads me to believe that they can most effectively handle the workload presented by the project. The project's roadmap is quite complete and easy to understand, the timelines and assigned tasks are reasonable, I hope you will add which experts will be involved in each work in stages. I couldn't ask for more, as I think I already have the amount of information I need, on budget, it fits the scope of the project and is fairly straightforward to understand in use.", "q1r": 5, "q2": "Proposer clearly demonstrate how the community can track project progress through Cardano Feed posts. The given KPIs are consistent with the scope of the project. The project aims to improve user convenience, so i think you should reduce doing surveying and focus on available metrics. You should also provide your vision for this project instead of just giving KPIs, I know it makes sense but I think I'm a bit vague on what goals you are aiming for in the short term or long term, eg Your wishes about the future popularity of the platform, the impact it brings, ...", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Develop a powerful \"All-in-One\" Link platform that aggregates all links, NFTs and Wallets of a user, specialized in solving the needs of Web3, NFT and Token projects, using the Cardano blockchain.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}