{"id": 417002, "author": "JEndler", "title": "Datapods - Reclaim Your Data.", "url": "https://cardano.ideascale.com/a/dtd/417002-48088", "category": 26595, "amount": 98200, "description": "Big tech has too much control about personal data.\nMore transparency, participation and control for you is needed.", "f6_no_assessments": 8, "f6_rating": 4.083333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1665, "q0": "The proposal is excellent and addresses a very current problem: the use and protection of personal data. We know that in the era in which we live, our data is collected in a forced way (the famous Cookies of the website, we need to provide our information to continue browsing the pages, for example). And for this situation to be resolved, the proponents intend to create “a blockchain-based platform to allow people to store their data and also selectively allow companies to access selected parts of their personal data in exchange for compensation.” The ultimate goal is precisely to achieve greater transparency, participation and control over our personal data. The development of this dApp is directly related to the following specific objectives, present in the challenge summary: “increase the number of integrations that unite existing solutions for a more integrated and connected experience between different products + higher quality of existing products and integrations through of suggested improvements that are supported by customer feedback or increased usage by the community”. In this case, we would not be working on a new problem, but rather we would be improving the user experience when browsing the internet and providing (or not providing) their data, that is, it would be the improvement of existing solutions, which would increase the quality of these solutions. through customer feedback. This project is very interesting because it could attract an audience from outside the crypto bubble, since the subject discussed here is not about blockchain itself, but uses Cardano technologies for a purpose that is of general interest. Proponents are very successful in explaining what exactly the situations would be to solve: in addition to the control of big tech companies over our personal data, there is a situation that for the improvement of machine learning and artificial intelligence applications it is necessary that more data are provided. So they propose the creation of a “Datapod”, which would be a storage place where people would control various information (such as “visited websites, credit card purchases, exercise routines, streamed music” and so on). A point that I think could be better explained would be from the following excerpt: “Our blockchain platform allows everyone with a Datapod to selectively share parts of their data with stakeholders.\n", "q0r": 5, "q1": "The feasibility of the proposal is good, more specifically the roadmap is excellent, but the team's presentation and the budget explanation could be more detailed. Regarding the script, first of all, this is without a doubt the best part of the proposal, as we know in great detail what would happen at each stage of the project. Ideally the timeline should be divided into months (as is done with the first, second and sixth month), but months 3, 4 and 5 are commented together, I would like to know exactly what would happen in each of them about the development of the platform and about marketing. Some very technical actions, such as the activities proposed in the first two months, do not require further details, as we are told what would be done in a specific way, allowing us to have a very solid view of these parts of the project. However, some less technical parts could be better explained. For example: “work to get full legal green light for the platform + start writing about the problem and our solution, increase customer awareness + look for early enterprise customers as test testers”. How would the legal “green light” be sought? How could this be defined more precisely? How would a first contact be established with the first business customers, how to present this project so that they understand well the benefits proposed here? During the explanation of the impact it is said that customer trust would be worked on (“we will publish detailed blog posts about the data ecosystem, leading to a greater understanding of the customer about the problem and our solution” etc); so it would be important for us to know the content of these posts, how the marketing would be executed. Some parts of the budget are well explained (for example the salaries of the professionals involved, there are 4 professionals who charge 30 dollars per hour), the amount requested here is very fair. However, some other expenses could be better explained: would the 1200 dollars monthly for the office cover expenses such as rent, electricity, water bills, etc? Why would the marketing campaign cost $7,000? What licenses would be needed to run the project within all compliances? Talking about the team, in turn, unfortunately this part is not adequate as the group members are presented very succinctly, all we know about each are their names, roles in the project and linkedin profiles. It would be necessary for us to know better about their curricula, projects they have developed to date and especially how they relate to the Cardano ecosystem. For these reasons I think that although we have basic information about the feasibility of the project, some improvements are still needed.\n", "q1r": 4, "q2": "Proponents state that \"updates on programming, community and other progress will be provided regularly.\" But how? In addition to the accountability metrics provided by them (e.g. completion of the development roadmap and whitepaper, number of users in the beta version, amount of data in Datapods, etc.), do they intend to keep the community updated on the work routines of the professionals? In my view, it is necessary that both the partial results (which are exemplified here) and the activities that would be developed each month and would result in such successes should be reported to all members of our ecosystem. The first thing to do would be to define which communication channel would be adopted between team members and the Cardano community (maybe they use some already established channel and with many people like our Telegram groups, or participate in breakout rooms after Townhall , create a youtube channel, post updates on twitter….). Anyway, many ways can be used to build this bridge; after that, it would be necessary for the team to better define what content would be informed and how often this update would be made. As much as they already demonstrate the intention to do what is necessary for the auditability to be solid, more detail would have to be given to understand how this would be done, in terms of progress. Talking about the end results now, success can be defined by creating an “envisioned platform that would change the way the current data ecosystem works, from the current model without transparency and participation, to an individual-centric consent-based model where everyone receive their fair share of compensation for their data.” But how could we deepen our understanding of this scenario? Two things are necessary: ​​1) We understand how users would have benefited, what rewards they would be receiving, how their navigability experiences have improved, they feel more sovereign in relation to their data, etc. In my opinion, the most logical way to understand all this is to keep in direct contact with users, carrying out a survey to collect their feedback regarding the use of the dApp. It would also be necessary to understand how they got used to Cardano's technologies, how they learned to do simple things on the blockchain. 2) More specifically about our ecosystem, we need to be sure that the objectives of the challenge were achieved, that more people became active members of the community, if somehow they would be participating in other Cardano projects outside this dApp, if they would be participating Catalyst (they heard about it because of the teachings about our ecosystem) and so on. Both aspects must be taken into account, so that we can have the most complete auditability possible. Therefore, the topic is also good, but like the previous one, some improvements could be made.\n", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Honestly, i really like this assessment, and agree with most, if not all of the points raised. Especially the criticisms in the \"Feasibility\" and \"Auditability\" are well thought out and give good input on how to continue to improve the proposal. This was honestly a really useful resource :)"}, {"id": 4181, "q0": "The \"Datapods-Reclaim your data\" proposal addresses the Dapps, Products & Integration challenge by creating a blockchain-based platform to allow people to store data (Datapod) and allow companies to select part of their personal data in exchange for compensation. The transaction is facilitated with smart contract (payment arrived in wallet, then temporary access to the data). The user will be identified using Atala Prism. Users can choose to self host their Datapod or use any cloud providers they choose. The proposal also mentions the possibilties of using stablecoins and oracles for payment and smart contracts accordingly. There might be some distinctive difference in detail but the concept of 'you control your data' and 'you can sell it too' does exist for some time already with a few startups applying the blockchain solution to entice the users. However, other than the risk that they team specify in term of technical challenge, consumer trust and regulatory compliance. There are risk inherent in data valuation (different data types and different data ownership dictate data value). It is an ambitious project and surely one that the community should keep an eye on for development. Right now, it is in early stage and limited in term of future scaling, the impact that this DApp will bring impactful use case and increase Cardano adoption as per the challenge goal is there but it will take some time to realize its full potential. ", "q0r": 4, "q1": "The team will take around 6 months in total for its MVP which will allow user to sign up, automate data request, automate data deployment of the datapods. After which they will look for more funding. Most funding will go towards product development and office space. The team is also comprised of data engineer and should be very adept in data handling. The team will needs to generate enough interest both business users and individual users to use their platform. One way would be to ensure that users are rewarded well enough as people might not bother to use the platform if that is not the case. While the tech giant enjoys economies of scale of data volume, this might not be the same for companies and it is likely that the users will be rewarded minimally from their data. Also considering the possibility that the team would need to secure legal opinion regarding GDPR and other data protection law, it is likely that the project might take longer than 6 months to complete their MVP. ", "q1r": 4, "q2": "The team will update the community on the programming, community and other progress regularly. The project will be an open-source and align with Cardano strategic goal. There are many key metrics to observe for accountability such as user acquisition, customer acquisition, data on platform.  It is quite rare to find the project that want to reveal active users in their platform so their KPIs give confidence to the community on their transparency. The team should consider the channel they want to use for informing the community on project progress like social media (discord, twitter), report or bi-weekly meetings etc. The team has a very clear understanding of the issue in lack of control on personal data. They attempt to apply blockchain technology and build a platform for people to regain their control on their own data. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "This assessment is great. I agree with the criticisms raised in the first to parts. Especially the legal opinion is a valid risk factor.\nKudos to the Assessor, thanks for the valuable feedback :)"}, {"id": 14971, "q0": "The information provided in this section is well-written, comprehensive and sufficient. The problem statement is also very clear and honestly reflects reality. In general, the proposal’s intention is to build Datapod, an application that assists individuals to keep their own personal data as well as to manage them properly. Technically, this platform is based on Blockchain technology, which ensures transparency since even the application’s developers can not access or take any information from the users. Moreover, a smart contract mechanism is also applied into this platform, which means that every data-related transaction will be automatically performed without any threat of scam. In addition, one uniqueness of the project is that it helps users take all the personal data back from giant Tech-companies to control on their own. The proposal also offers a part that answers some FAQs such as: where the data and metadata is stored, what other partners that they are incorporating with, how users are identified and how data access is granted. In my opinion, this is an innovative idea since data is one of the most valuable assets in modern society nowadays, where technology has been on its fastest growth and the playground for Tech-companies has expanded larger than ever. However, I believe they should add some explanation on how they are going to make profit from this project, such as: whether they would charge any service or commission fees, whether they would approve advertising activities, whether they would provide premium accounts or cloud storages,... These questions if answered properly would help the Catalyst understand more about the platform’s potential. To conclude, I think the proposer has successfully brought about a very convincing solution to solve the problem mentioned, which is also well-aligned with the challenge settings. I agree that this application, if developed correctly, would widen the Cardano ecosystem, satisfy the exact needs of the community and eventually, bring more users toward the system. Finally, every risk was stated sufficiently, along with very reasonable mitigations and solutions. I believe this is a well-prepared section that offers the information needed.", "q0r": 4, "q1": "In this section, a clear roadmap as well as observable milestones were given. Generally, it takes around 6 months to eventually conduct the MVP version of the platform. Every step included in each phase is offered particularly and explained carefully. Yet, in my opinion, the author should also add an estimated date to start actualizing the first steps, so that the community would have a more objective point of view about the project. Besides, a budget breakdown was provided sufficiently. Yet, since $98,200 is not a small figure, I suggest that the team should describe more about how they would spend that amount of money efficiently, such as: what targets they are aiming for through the marketing and promoting activities, what the final website and application design would look like (general imagination),... Finally, a brief introduction about the team was provided, together with a specific role and an affiliate link for further background checks (education, work experience, achievements,...). From my perspective, the team has a huge potential and proper professions to reach some particular achievements on this project.", "q1r": 4, "q2": "The team promises to make the developing process transparent by open-source codes, as well as ensures regular updates would be provided. This is a strength that proves the auditability of the project, though, they should describe more about what tools they would use to manage the process, as well as how and where they would post regular reports for the community’s and the Catalyst’s observations. Besides, clear metrics to measure the progress is also given obviously. Reasonable goals are also settled to define future success. However, they are still missing some specific KPIs and SDGs. I would highly recommend they mention exactly what figures they are aiming for after this project is funded (number of users, total capacity of datas, users’ feedback, total capacity of datas circulating daily,...). Moreover, they should also describe their own long-term visions to ensure the sustainable growth of the application.", "q2r": 3, "assessor": "z_assessor_4118", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2, "reply": "Good, in-depth assessment, the arguments here all make sense and are well thought out. Thanks for the valuable feedback :)"}, {"id": 8744, "q0": "Your idea impressed me very much. Personal data is a difficult matter, indeed. Issues related to personal data are provided in detail in this section. You have come up with the solution that is Datapod - personal online data stores. The information about operation, goals, and technical issues are all clearly addressed in the proposal. The proposal also mentions that the project will encourage the development of Cardano. This is also what we expect. Furthermore, the proposal provided risks that the project may face, including Technical Challenges, Customer Trust, and Regulatory Compliance. Every risk had solutions to deal with. In summary, your suggestion is very well done. The presentation is logical and clear, the information is fully provided. The diagrams also help to animate the proposal and illustrate the information. I feel this project has a lot of potential.", "q0r": 5, "q1": "Your FEASIBILITY section is pretty well done. Roadmaps, budget breakdowns, and information on team members are provided. Regarding the roadmap, it is expected to be implemented in 6 months. Each stage has a very specific timeline and tasks. The 6th month of the project is expected to deploy the MVP version of the platform. The amount to be spent on the core team, external experts, and management costs are all disclosed in the detailed budget breakdown. Your team is introduced consisting of 4 core members. The profile of each member is shown through the link. In addition, the project will also involve external experts to assist in blockchain development and provide expertise in data protection law. Through this presentation, I really appreciate the feasibility of this project. There is no doubt that this section is rated 5*.", "q1r": 5, "q2": "You have provided progress metrics in this proposal. How to measure is also presented with those metrics. The project also makes sure to publicize what the developers are working on and update the report regularly. In addition, the success of the project is described through the goals of increasing data sovereignty and creating value. With the metrics and goals that you provided, the project is auditable. If possible, you should provide more specific KPIs and numbers to make the project easier to measure and increase the persuasiveness of the project.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Valuable feedback and nice to read. Many thanks to the CA for this one :)"}, {"id": 9617, "q0": "We are products of the social media platforms we are using. Social platforms like Youtube, Facebook, Twitter are using users' data to make money while their users don't even know it. To give back control of data to everyone, this proposal offer a solution where people can store their own data and give only part of their personal data to the organizations they want in exchange for compensation. Users will reclaim their personal data by asking social media platform send their data back to them, then the user will register their data to the Datapods app (users can choose to save their data on the Datapods serveror on their local machine). When companies/organizations want to access user data, they have to pay a fee to the respective user's wallet address. Users have the right to choose what pieces of data they want to make available to the organization or choose which organizations they want to share the data with. Organizations will have data for their business while still complying with privacy policies, data-owners will have a new income stream based on the data they generate daily such as online purchases, websites visited, music streamed, video viewed, workout routines etc. The project effectively solves the outlined challenge setting, and I believe that if the project is successful, it will bring a lot of users to the Cardano ecosystem. I therefore rate 5 stars for the impact of this proposal.", "q0r": 5, "q1": "The project was carried out by 4 people, information of each team member such as name, role and LinkedIn was provided. While each team member's experience isn't specified in the proposal, voters can dig deeper through their LinkedIn profile.\n\nThe budget of the proposal has been broken down into identifiable items. I think this budget is reasonable to accomplish the set goal.\n\nThe project is implemented in 6 months and the implementation plan is divided into 4 main phases. The project phases have been described in detail what needs to be done and milestones to be achieved. I rate the timetable they give as practical to get this job done.\n\nRegarding the risks that can affect the success of the project, the proposal has raised 3 main risks: technical challenges, customer trust and regulatory compliance. In addition to the risks mentioned, the proposal also provides plans for mitigating those risks.\n\nIn my opinion, with what is described in this proposal, the team is capable enough to successfully carry out the project. Therefore, I rate 5 stars for the feasibility of this project.", "q1r": 5, "q2": "Most of the source base will be open so the community can track the progress of the team's project. The project also provides a clear and detailed roadmap with milestones to be achieved within a specific timeframe. The criteria used to evaluate the success of the project have been carefully considered. Those criteria include roadmap completion, user acquisition, customer acquisition, amount of data on platform. Proposal has said that it will provide updates on project progress regularly, but has not specified where the community will see those updates. Proposal should specify which public channel they will use for delivering regular updates to make the proposal more complete.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Fair criticism on the \"Auditability\" part. The Channel via which we will update the community has indeed not been specified, we'll put that on the TODO-List immediately. Great Assesment :)"}, {"id": 14733, "q0": "\"With the advent of the Internet and blockchain technology, privacy has become an increasingly important concept. We're all upset when our data is monitored by the applications we use, or when third-party cookies are used for commercializing purposes. Datapods platform gives users choice over their data (what to share with which firms) - customers may stay anonymous if they like. Furthermore, customers may receive compensation (for example ADA), if they allow to share their data to companies. \nThe proposers clearly described how the platform works and how the platform may benefit for the customers. Regarding to risk management, the proposers have addressed quite well and have plans to deal with the risks. However, I personally think that if many consumers stay anonymous and refuse to share data for companies, the companies may consider this disadvantage and thus do not join this platform. \nNevertheless, if the project is successful, there will be a considerable increase in the number of users and businesses in the Cardano ecosystem; consequently, the solution is matched with the challenge setting.\n\"", "q0r": 5, "q1": "The roadmap was quite clear and broken into several smaller tasks processes. It could be clearer if the proposers attached the exact due date to each sub-task processes and provide the detail execution protocol for them. The budget was given; however, I think the proposers should break down the budget in accordance with the given task process, and also give a detailed explanations of the funding needed. For example, how the proposers came up with the Marketing cost of $7000? The human resources are sufficient in my opinion since the core team comprises of several experts with strong backgrounds in blockchain and business, which is essential when implementing this Cardano project.", "q1r": 4, "q2": "Regular updates in terms of project progress will be announced to the community and the source code will be mainly open source, indicating high integrity of the project. However, because I do not think that just suggesting the KPIs is sufficient, the proposers should probably contemplate including the specific number of KPIs or metrics that they hope to achieve in a given length of time, as well as the ways by which they would be measured to increase the auditability. For example, after one month, the number of beta users reach 3000 users.", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Honestly, the points raised here are all fair, good assessment from my point of view :)"}, {"id": 14856, "q0": "The idea of making dividual take control over their personal data and use them at their will is interesting and really a game-changer in the data market if implemented well although it does not increase the number of new Cardano users right away. They are serious about this project. This is shown in the way the team provides current problems with the data system and how they come up with the solution. The risks of this project are well-addressed and all have relevant solutions. However, the fact that this project needs a long time to build its userbase before it shows any measurable benefit is something we need to think about.", "q0r": 5, "q1": "Their plan is detailed to the amount of work on a scale of months. Convincing users and promoting this solution is critical but the team mentions no plan for this. The blockchain engineer in my opinion is considered a crucial role in this project but this is a missing spot in the team. Talking about the budget, I think that there are expenses they can cut down such as the office space expenses because this project can be done mostly through computers, the team can host meetings online. Plus, the cost of marketing and promotion is included but there is no one on the team who is implied to be in charge of this part. Also, some information of the external experts will help us understand their capability better. The rest of the team are students or fresh graduates. Although they all have impressive profiles and educational backgrounds, I can’t help but think they haven’t had the experience needed to run a project with such a big fund ($98200 to be more specific). ", "q1r": 3, "q2": "The team should give clearer goals for the project with metrics. It can be the number of users, the recognition of the app shown in its website’s traffic or the quality of data they collect, the data transacted. Please give specific numbers to achieve and for the community to know that this project is successful. Additionally, they should provide a platform for the community to keep track of the project. ", "q2r": 3, "assessor": "z_assessor_4106", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "The criticism here is honestly fair.\nThe Issue about the experience level of the team has been raised a couple of times, also by other assessors, and i agree that building this project successfully will be a big challenge for me and the team. Nevertheless i am confident that its very well worth a try."}, {"id": 14929, "q0": "\"As a whole, this project is aligned with the challenge.\nI find this project's intention very clear. The team intends to develop an app Datapod where everyone receives a share of compensation for their data to be temporarily accessed through smart contracts. By using smart contracts, the app will provide transparency for every party involved. \nThe investment would be allocated for three separate areas, including the development of the website, the analysis of data protection laws, and marketing to attract customers.\nThe team did manage to describe how they would deal with different potential risks that were presented. \nHe described the solution in a straightforward way. Therefore, I understand why Cardano Blockchain plays a crucial role in the success of this project. According to the author, the project relies on different technologies, it would encourage the development of the Cardano ecosystem in these areas, namely stablecoins (for payment) and oracles (to facilitate smart contracts). \nSince the description of the problem is quite brief, it is a bit difficult to understand the context behind it. Maybe a discussion about why it is necessary to solve this problem should be longer. \nIn terms of the market, it would be nice if I could understand the size of potential users. This would make this project seem to be promising in the emerging Data-Crypto market segment\nWith regard to success metrics and KPIs, they do not seem to indicate an impact on the Cardano ecosystem. My suggestion would be adding relevant metrics that serve to evaluate direct impacts. I am not sure whether it is possible that this project adds value to the Cardano ecosystem. \"", "q0r": 3, "q1": "\"Four core team members with a diverse discipline and their roles were presented.  \nIt was interesting to read a description of each member on LinkedIn profiles where I could find out more evidence about their abilities like a link to a personal website etc.  It would be crucial to provide such details about external experts who will assist the team in blockchain development and in data protection laws.\nThe roadmap for the 6-month timeline has been shown, indicating 4 phases of progress and specific milestones. \nSome areas in the roadmap do not seem to be clear. In months 3 - 5, the milestones include the development of initial parts of the platform and marketing. In this phase, I would expect to see how they would utilize the marketing budget, specifically who in the team would be in charge of writing for blog posts to increase customer awareness and what activities they would do to look for trial users. \nThe budget breakdown was split into three categories in which average salary, weekly working hours, and key activities were presented. I think some parts of the budget breakdown need to be more detailed. In terms of legal opinion regarding GDPR and various other data protection laws, the allocation fund would be $6600, but I don't know how much it would be spent monthly. The same goes for the total amount of $2000 allocated for server-hosting, website DNS, and licenses. This also would be an area that needs to be more transparent to demonstrate whether the budget is reasonable. \nIn general, I agree that this project is somewhat feasible. \n\"", "q1r": 4, "q2": "\"As far as I know, updates on programming, community, and other progress will be given regularly. Instead of saying regularly, I would expect a weekly or monthly time schedule to see whether they are actually going to effectively report the progress to the community. \nTo make this project more auditable, it would be better to indicate whether they only use open-source software where the community can check the app development. This is because I think monthly calls or reports would also be preferred to make other aspects of a project like community development a little bit more transparent. \nMetrics and KPIs have been identified. What I am in doubt about is that since the currency for transactions is not ADA, or there is no clear indication, whether the users will have little or no awareness of the utility of Cardano Blockchain. Therefore, it would be nice if the team provides more relevant metrics that allows evaluation of the impact the success of this project may have on the Cardano ecosystem.\nHowever, from the description of success presented, I imagine that they could possibly create an individual-centric consent-based model, thereby possibly attracting more companies to this data ecosystem sector and invest in Cardano's technologies to develop products. \n\"", "q2r": 2, "assessor": "z_assessor_4113", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "I'm a little conflicted on this one, on the one hand the assessor raises some valid criticism about the Impact and Feasibility of the proposal.\nBut the Auditability part seems a little lackluster, one main argument of this part is that \"it would be better to indicate whether they only use open-source software\" eventhough we clearly outlined that we plan to both use open-source code and will open-source our code once completed. "}], "solution": "Create a blockchain-based platform to allow people to store their data, and also selectively allow companies to access select parts of their personal data in exchange for compensation.", "experience": "We are a multidisciplinary team of developers, legal and business experts.\nOur background is from several top universities in the respective fields.\nWe are a young and driven startup team with a passion for crypto looking to enable people to reclaim their digital sovereignty."}