{"id": 417121, "author": "bakemonio", "title": "IoT/M2M Oracle Platform Development", "url": "https://cardano.ideascale.com/a/dtd/417121-48088", "category": 26595, "amount": 70000, "description": "Smart contract oracles are essential for more innovative systems.\nHowever, the environment is not yet well-developed, increasing the burden on developers and hindering new entrants.", "f6_no_assessments": 6, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 210, "q0": "The proposal is clear that it is to build an Oracle platform that will incorporate, link, and utilize CARDANO and external data, and it is also an attempt to communicate the proposal in an easy-to-understand manner by presenting examples and conceptual diagrams of data utilization for solar power generation.\n\nHowever, I am aware that CARDANO has already partnered with Chainlink last year, and that it is in an environment where a wide variety of data can be utilized. This proposal does not specifically mention ChainlinkOracle, but is this something that will be built upon that technology? \nOr, if it is to be developed as a new platform, why is this \"IoT/M2M Oracle Platform\" needed instead of Chainlink? \nThese are some of the questions we have.\n\nWe believe that the proposal would be more persuasive if it touched on the problems with existing technologies, as well as the differences and advantages of the technologies to be used in this project. \nI feel that the use cases listed in the proposal could be made more familiar and imaginable if the proposal also emphasizes the fact that this proposal will make it possible to realize these use cases.", "q0r": 3, "q1": "As far as we can read from the description in the proposal, we must say that its track record is as opaque as that of other proposals by the same proposer. \nAlso, as for the development company, which is essential for product development, although there is an explanation that \"a partnership with a globally active electronics company will be entered into,\" no details are given, giving the impression that the project is essentially starting from scratch.\n\nThe schedule is expected to last until December 2023, but even at that stage, the goal is to create \"an environment where developers can easily try out the product,\" and there is no prospect for the final launch. \nThe budget for the project is relatively excessive, and yet the development team is not yet ready to start work.\n\nIf the proposal is based on a situation in which the prospects of the development team and product specifications have been established to some extent, it is necessary to explain the details of the proposal in as much detail as possible.\n\nIn any case, there are many uncertainties in the current situation, and I strongly feel concern about the risk of the proposal not progressing as envisioned in the proposal.", "q1r": 1, "q2": "The proposal anticipates a long-term development period of more than one year until product launch, but the schedule is straightforward and does not include indicators for evaluating progress at each stage. \nBecause this is a proposal that is expected to be developed over a long period of time, we feel that it is necessary to set targets for progress at certain stages and to undergo self-evaluation and third-party audits.\n\nThe content of the current proposal is a plan in the form of a plan that delimits a certain span of time as a stage up to \"the creation of the foundation of the Oracle Platform and the creation of a mechanism to connect sensors that already exist in the market,\" which in itself seems reasonable. \nHowever, if this is the case, it would be clearer to show both the overall plan until completion and the subplan in the form of a period in the current proposal.\n\nAlso, although this overlaps with my impression of another proposal by the same proposer, I cannot help but feel that the specifications that can be clearly stated are currently insufficient because the development team is currently undecided, and the basis for estimating the required budget amount is also unclear. \n\nIf the current situation is that it is difficult to indicate the direction of the project because it is still in the blueprint stage and the development team has not yet been formed, it would be desirable to start the proposal as a study phase and limit the budget request to the areas of research and study and the search for collaboration with partner companies. \nWe feel that it would be desirable to start the proposal as a study phase.", "q2r": 1, "assessor": "z_assessor_2061", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1102, "q0": "I believe the proposal properly addresses the challenge simplifying Oracles integrations in Dapps. Multi measured information gives the reliability of the input, trustworthy, which leads to a more facts robust thriving ecosystem. In a market where trusted facts will become more important, impulsing an easy implementation is a key aspect to gain more adoption.\n\nThe proposal solution is for a Platform that facilitate the development of Dapps through an API for smart contracts, and a mechanism for developers to connect their own sensor to the platform. For current and futures developers that join the ecosystem, this will help to speedup the process of implementing smart contracts with Oracles as an MVP and continue product development. \n\nBy combining multiple sectors in the output to obtain new intelligence, the customer experience will improve dramatically propelling the mass adoption by retail or corporate. I found this proposal to help in that path.", "q0r": 5, "q1": "The plan presented, with the time lines seems to be reasonable. What I feel needs more explanation is in the information about the team, their experience, knowledge, etc. \n\nAlso for the budget it seems to be for part time development as the teams also confirms that they are working in other proposal in current Fund 9 and previous Funds. I assume as they are working in previous Funds that the team has the necessary experience and knowledge to accomplish this proposal in a time manner, but would have be good to present the information here too as can't know what the previous proposal are. Also the link goes to a Chinese or Japanese (can't tell) web page without a translation, can not tell if the info is there.", "q1r": 4, "q2": "The plan detailed it is enough at high level, and it will give the possibility to follow up the progress of the development.\n\nI found not clear where the progress will be posted, if it is in the web page I suggest a translation to English will be very useful.\n\nFor a better granularity of the steeps and progress I suggest a more regular update as some proposed periods could be 6 month long, in those cases breaking down the progress could be a good idea. ", "q2r": 3, "assessor": "z_assessor_2197", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 2805, "q0": "The proposed team claims to provide an Oracle platform that works on Cardano, the documents and examples the team claims the API of the team provides will be responsible for communicating the smart contract as a condition for automatic execution. smart contract agreements.\nhowever, according to the operating model of the Oracle platform that the team announced, there are a few points that need to be added to make this proposal more perfect,\n- Firstly, the group needs to state and give more specific examples of the cases that will use this Oracle platform of the proposal, because the Oracle array is generally responsible for getting information outside of real life, verifying that information. and provide the party who needs to use the information, so why is it necessary to identify the use cases of this platform, to identify the target customers.\n- secondly the team also knows that all attacks to cryptocurrencies originate from smart contract vulnerabilities, and are largely due to the information provider and its validation. If the team has a plan for the credential validator under multiple authentication layers or how, the team needs to specify the Oracle platform credential validator operations that the team will provide, examples will multi-factor authentication, like Chainlink.\nThe team stated will verify the operation of the Oracle platform with multiple ISAs. but not specific, need more specific explanations and examples on this issue.\nbased on the documents provided by the team, unfortunately, there is not enough evidence to prove that this platform will effectively solve the problem.", "q0r": 3, "q1": "The plan to develop this idea is announced in detail by the team, but there is no experience, so it is not possible to determine whether the time period that the team claims to complete is appropriate, because the information about the team The team development team has not provided the experience, about each member related to Oracle and cannot verify the identity and depth of the team about Oracle, so it is difficult to determine the success of the team. Does the public come up with this proposal?\nparallel to that, the time from the start of the project implementation is from September 2022, and will be announced to complete in December 2023, but the required salary for Software Engineer = 2 people and Engineer hardware = 1 person, the group asked for 1 year, so where will the budget come from September 2023 to pay for engineers or what other options will the team have, please provide more explanation at this part.\n Thus, there are still many shortcomings in the calculation and the relevant experience has not been determined, so it is impossible to determine whether this proposal is feasible or not.", "q1r": 3, "q2": "This group recommended! In my opinion, the group needs to provide more measurement indicators to serve as a basis for the community to monitor, for example, the content of work that will be completed in each stage, or the amount of work completed, so that the community can based on that verifying the work is completed on time as committed by the group or not, so that we can gain the trust of the community and give you sponsored votes.\n success indicators as well the team needs to identify who will benefit from the platform the team provides and how they will benefit, such determinations are needed so that the community can see the success of word suggestions saw an increase in the number of users.\nAs a result, the team has not been able to provide indicators to measure the progress of the proposal as well as identify the signs of success of this proposal, so it will be difficult for the community to track and verify.", "q2r": 2, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 4635, "q0": "A good idea that has a strong impact on the development and expansion of the Cardano ecosystem through the establishment of Oracles that convert real data from many fields into blockchain data, making it easy to apply blockchain technology easily in many aspects of real life. Also, APIs can refer to Oracle from the smart contract execution environment. And thanks to the mechanism of connecting sensors from developers to this diverse Oracle platform, developers can deploy many different systems.\nThis idea, if successful, will have a great impact and solve the requirements of the Challenge.", "q0r": 5, "q1": "Because the information about the plan, budget, and team is not specific, it is impossible to determine the feasibility of the project. Specifically,\n\nThe implementation plan is clearly written and has a specific timeline. However, if the proposer clearly writes down the work items by month, by week, it will be easier to manage and Catalyst, the community can track and check more easily. At the same time, detailed planning will show the ability to plan and fully visualize the steps to turn ideas into reality.\nRegarding the budget, the cost items are listed but not specific, not corresponding to each work item performed. The proposer should be more specific about the cost items and how they are composed. Personnel costs should be recorded by month or unit price per hour. The cost of buying hardware and software should clearly state what to buy. Catalyst and the community will easily check the source of funds and intended use if the budget is specified and clear.\nRegarding the development team, the implementation person is stated in general, it is not clear how many people are needed. The proposer should clearly state the names of the members with primary responsibility for project implementation and management, their names, experience and affiliations, and proof of relevant experience.", "q1r": 3, "q2": "It will be difficult for Catalyst to assess the transparency of this project, because:\nThe project has no quantitative KPIs to measure success. The proposal has the goal of perfecting the Oracle platform APIs that allow developers to build systems. The specific goal is easy to understand but lacks goal parameters.\nRegarding where to track project progress, the proposal states that the project's progress will be posted on the official website, but there is no link or website name for the community to search. If possible, the proposer should include a link or website domain name. This not only makes it easier for Catalyst and the community to track actual progress, but it also increases marketing effectiveness for the project.\n", "q2r": 3, "assessor": "z_assessor_2578", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6016, "q0": "The proposal is to build an oracle protocol for the Cardano ecosystem to execute smart contracts. Oracle will take data outside the real world (as the proposal describes) including temperature, degree of humidity, fingerprint, heart rate, etc through measuring sensors. These sensors will send data to Oracle and from Oracle will transfer the data for smart contract execution. Overall, the impact of this project brings to the Cardano ecosystem is huge if it can be successfully implemented. Through the project many problems of communication with the real world will be solved, helping to bring blockchain use cases to real life. Expand the number of users as well as the number of transactions on the chain.", "q0r": 5, "q1": "I disagree with the feasibility of the project. There is not a lot of information to show that the project will be successful. Because when it comes to the technology aspect of the project, the key factor to evaluate the ability to turn the idea into reality is not, I did not find any information about technology solutions at all. In my experience with technology solutions for blockchain, Oracle is the hardest thing to do. An Oracle must first be considered through aspects such as security, data retrieval mechanism, data encryption and decryption, degree of decentralization of nodes. Where Oracle's security must be at the forefront. What protection mechanisms will Oracle's protocol have in case the collected data is manipulated or the data is tampered with in the event of any node is attacked? It is dangerous in case the manipulated node slips through the protection mechanism and is passed to the input to deploy the smart contract. Where will the collected data be processed, on-chain or off-chain? Unfortunately, all of the above issues have not yet been provided to us by the proposed team. Therefore, I recommend that this information needs to be supplemented so that we have more bases to properly evaluate the project's technology solution.\nSecond, I think the proposal for a $70,000 budget is unreasonable. I am asking myself what does the cost of buying hardware and software include that costs $10,000? I think a more detailed explanation of this implementation cost is needed.\nThird, I think the implementation route is unreasonable. It took us up to 6 months for the \"confirm operation of oracle API with Plutus Application Framework\" work, but it is not clear during this time what the proposed team will do. And if simply confirming the operation of the Oracle API, in my experience when researching through similar projects on Oracle, it only takes 1 month to do it. Therefore, more detailed plans are needed in the implementation roadmap of this proposal.", "q1r": 1, "q2": "The project claims that its members are all experienced in developing blockchain as well as embedded systems, but the information provided shows the opposite. There is absolutely no evidence of any personal records like LinkedIn or Github. All progress measurement information is claimed to be updated on the project website but unfortunately, I don't see a website listed here either. In that case, KPI targets are also not mentioned.\nMy advice and suggestions for the project are to add the above-mentioned information about each member, metrics as well as KPI. I take for example the KPI for the project which will be 30 smart contracts executed after 6 months of project completion.", "q2r": 1, "assessor": "z_assessor_2771", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6210, "q0": "This proposal seeks funding for the development of an Oracle Platform available from the Cardano’s environment. The oracles that the proposer wants to create are with IoT sensors source.\nThe problem statement is somewhat clear, smart contract oracles are important, but they are not sufficiently developed and bring burden on the developers and create friction for new developers.\nThis proposal could be for this challenge or for the developer ecosystem, it is not very clear where is the best place.\nThere are plenty of use cases for such technology, so its development will find many uses in the future.\nNeutral. I neither agree nor disagree that this proposal effectively addresses the challenge.\n", "q0r": 3, "q1": "The proposer foresees the risk of Oracle data security and provides mitigation strategy to reduce this risk.\nThe project span is from September 2022 to December 2023 The plan is presented in a very brief five rows for the whole span of the project. The detail looks insufficient. \nThe budget is for remuneration for 4 devs(60K) and 10K for hardware and software however the project is lasting 16 months, but the proposer does not address that. This looks like a big omission.\nThe proposer does not present the team members. There are no CVs or linkedin profiles attached.\nThere is a possibility of the proposer returning to Catalyst for funding of additional features.\nThe proposer has a funded proposal in fund 6 that is still ongoing and all project reports have been submitted on time. Also the proposer has two proposals for this fund for a total of $150K.\nOver the entire proposal lacks detail.\nDear proposer, please read the PAs Guide in order to understand how to better develop your proposal.\nI strongly disagree that the project plans and budget supplied is feasible to deliver.\n", "q1r": 1, "q2": "For the auditability section of the proposal the proposer just states that they will post progress reports of the project on the official website. However there is no mention of KPIs , milestones with timeline or anything concrete against which the auditor could measure the progress.\nSuccess metrics are that The Oracle Platform APIs allow developers to build systems.\nI strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 1, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will increase the feasibility of blockchain-enabled systems by developing an Oracle Platform. This Platform will be designed to be available from Cardano's environment.", "experience": "Our team consists of blockchain and embedded systems developers, specializing in software and hardware perspectives.\nWe also have partnerships with various global electronics companies."}