{"id": 417197, "author": "dimitri777", "title": "5 Loaves 2 Fish Feed The Hungry App", "url": "https://cardano.ideascale.com/a/dtd/417197-48088", "category": 26595, "amount": 70300, "description": "Good food goes in garbage. It adds to landfills, and CO2. Hungry people who could eat the food have no access. There's no way to track it.", "f6_no_assessments": 10, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 5602, "q0": "This challenge setting is offering a broad range of DApp and blockchain integration approaches as possible directions, and complementing real world impact solutions with cNFT provenance is a possible one. This proposal does not fall under any category that has been provided by the challenge setting, but this is okay as other use cases are allowed as long as they can drive user growth and adoption of Cardano. \n\nFeeding the hungry is a noble goal and a grassroots initiative backed by financing via Catalyst funding and donors and backed by NFT tracking / provenance but may have been better suited for the Cardashift Natives or Grow East Asia challenges, where the scope and grassroots character would have been easier to understand for their alignment with challenge goals.", "q0r": 4, "q1": "This proposal is a re-submission of a proposal of the same name in \"Nation Building DApps\" of Fund-8. Its budget has been increased from 46800 to 70300, but the proposal still has the same team and roadmap and is very long with over 5000 words of detail. This proposal was the lowest voted of all proposals in its category last fund, with 4.7M ada more No votes than Yes votes, makes it ineligible for consideration under the funding rules.\nIn its very essence, this proposal is about the proposers picking up food waste from restaurants, and the issuance of NFTs around it appears rather unrelated, which could be behind the overwhelming voter rejection this proposal has previously received.\nI do not think that enough has been done to alleviate the concerns voters in Fund-8 had, and the proposal has been resubmitted more or less unchanged, apart from the wage inflation which is above the global average.\nGiven the poor reception this proposal has previously received, and the lack of change it has undergone, the successful implementation of the proposal is not any more likely than it was before, and about average all factors considered.", "q1r": 3, "q2": "The auditability of this proposal should have been aligned with the mission of impact, and shown better alignment with the declared goal to have an impact and fight hunger. The role of NFT market place and remuneration of the proposers seem too much at the forefront, instead of the NFT tracking mechanisms and accountability of the donations. This might make it very difficult for auditors and the challenge team to assess effectively how successful the proposal has been in its core mission. \nInstead of listing a lot of possible metrics without attaching targets, some quantification (targets over time) could have been provided to give a clearer picture of how far it has reached its own targets.\nThe proposers provide a Facebook page of the project, but do not showcase the planned use of NFTs with Github or any similar resource to showcase the tracking of the project or the way these might be used effectively.", "q2r": 3, "assessor": "z_assessor_2720", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1, "reply": "Please filter this out.  PA has brought out some points which are not valid.\n\n\nFeasiblity\n. Its budget has been increased from 46800 to 70300, but the proposal still has the same team and roadmap and is very long with over 5000 words of detail. \nOur fuel prices have gone up by 6 times. Hence our price increase.\n\nEverything has gone up as well.  So even how much we allocate to pay people woul dhave to increase if we are an ethical organization.\n"}, {"id": 5885, "q0": "This proposal makes a lot of sense. It has a positive impact in many ways. Leftover food from restaurants and bars will be delivered to people in difficult circumstances, the elderly, orphans,... . This contributes to improving the meals of people in difficult circumstances, reducing waste, contributing to environmental protection, and combating climate change. In addition, it also has a huge impact on blockchain, especially Cardano. By paying salaries via blockchain to employees and participants based on their workload and working time, this project can increase the value of the Cardano community, attracting more members to participate. join the community. It is for the above reasons that this project has completely solved the challenge. This proposal focuses on building Canopy, equipping vehicles, and paying employees", "q0r": 5, "q1": "Information about the team including profile, experience, skills, knowledge has been provided. Based on that, I think your team is fully qualified to carry out this project. More specifically, they are people who have joined the Cardano community very early, have a lot of experience in social fields. Having a strong team will be an advantage, it plays an important role in the success of a project. You have a great team!\nDetailed route has been provided. This is a general roadmap, it is quite similar to the route of other proposals you have submitted at fund9. In addition, having a detailed roadmap will help increase people's confidence in the project, making budget calculations a lot easier. Indeed, the budget has been specifically calculated. You have allocated a budget very clearly and in detail by determining the number of people involved in the work, the amount paid per day, the amount paid per month,... . However, I have a small question, you mentioned \"Creation of a video documentary of the entire process 8000 USD\", so how long will this documentary video be, when will it be released? In addition, having specific metrics to evaluate the progress and success of the project is also a necessity. I have a few suggestions that might help you: get 100 new volunteers joining every month,...", "q1r": 4, "q2": "The information provided is complete, people can rely on it to judge the success of this project. In addition to the problems that I mentioned in the previous section. I commend you for figuring out the risks and challenges you face, and ways to mitigate them. I think in addition to fluctuating ADA prices, fluctuating fuel (gasoline, oil) prices are also one of the unforeseen risks. The idea of this proposal is very interesting and useful. If successfully implemented, this project will certainly bring great value to those in difficult circumstances, promoting the development of the Cardano ecosystem. Thank you for the great suggestion!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 6106, "q0": "The author poses the problem here is what food is not enjoyed, it goes to landfills. Besides, hungry people can eat food without access. Here the proposal is towards getting food from restaurants and delivering it to beneficiaries. Proposals are consistent with the objective of the challenge and are detailed and richly described. The food that is thrown into the garbage causes pollution and subsequently CO2 emissions and air pollution. The solution is to create a system whereby restaurants, corporate divisions... deliver those foods to the beneficiaries. Create an AI-powered, blockchain-based application that can optimize multiple donor locations, can establish transparency, traceability, and auditability using Blockchain . A new NFT marketplace whereby social actors can launch NFTs to generate coins through the sale of unique NFTs or through NFT minting and selling. The proposal relates well to the Cardano blockchain. Cardano not only aims to drive the technological leap forward, but also establish positive impacts in several areas with the planet, such as climate, social security, and the environment. Here, the proposal also clarifies an issue of misconceptions about Blockchain that have a negative impact on the environment, but this has not happened for the ecosystem. This project also contributes to clarifying the issue. At the same time this will create a large amount of goodwill for the Community and will motivate that the CSR project has a lot of value and social meaning, leading to an increase in community value as well as an increase in the number of community members. copper. In addition, the proponent recognized the risks in the project. This proves that they have enough experience to recognize the difficulties and disadvantages of the field they are looking to develop. along with those challenges the author has outlined positive solutions, showing a lot of preparation and planning. This will definitely increase the chances of the proposal being successful.", "q0r": 5, "q1": "The overall plan of the proposal shows that the proposal is highly feasible. The first is about the route. The author has planned to develop the infrastructure, equipment and staff professionally and fully. Housing positions, beneficiary positions will be confirmed and exchanged with BlockCarbon… Besides, the author has set up a detailed roadmap of each work for the project (3 months) very clearly. and elaborately explained. A positive thing is that the author has set KPIs, showing the author's professional capacity, knowing the goals he needs to achieve, what needs to be done and how to achieve the goal and to success. of project. Detailed roadmap to ensure the work is completed on schedule. Next is the budget. The proposal requires a budget of $70,300. In my opinion, the requested funding is perfectly reasonable and well explained. The budget is broken down and allocated for each specific work to be performed in the project. In my opinion, there are no more questions here. Clear and transparent expenditures increase the credibility and sustainability of the project. Finally, the team members join the group. The author has introduced documents about each member and associated links, so that we can learn about each member and increase our confidence in their ability and experience suitable for the job. work on the project. We know each person's identity, skills, occupation. Specifically: DImitri Fernando: Active Member of Catalyst Community - General ADA Holder in Catalyst Circle V3, Community Advisor in Organizations 6 and 7… Rishantha Welikadage: Entrepreneur and Hardware Technician; Uditha Bandara: is an expert on Microsoft, AI and Blockchain Technology...; The members all have their own strengths and they combine to form a professional team. Members have achieved specific successes and held important positions. The team is an important factor in determining the success of the project. The above information shows that the ability of each member is the strength that makes the project successful.", "q1r": 5, "q2": "The testability of the project is very good. Starting from the fact that, in this chapter, the author presented the project plan in great detail. Work needs to be done within specific established timelines. This way we can easily check that the tasks to be achieved have been done on schedule as described. At the same time, detailed budgets are analyzed over 3 timelines (in 3 months) to support easy and transparent audits. Besides, the team is members with enough professional skills, will be able to complete the project on schedule. The author provides a series of metrics by which we can measure project progress. Specifically: Number of restaurants introduced; Total number of NFTs distributed; The amount of NFTs generated on receipt and on sale; The number of NFTs sold on the CNFT market... That means we can check in many ways. Because we are provided with a lot of information, making it easy for us to audit. In my opinion, the necessary and important information is satisfactory and established. All information provided is sufficient for serious and continuous monitoring. And the end product is the success of the project, bringing food to the beneficiaries, reducing pollution and subsequently CO2 emissions and air pollution. Launching NFTs to generate coins through the sale of unique NFTs or through NFT minting and selling... benefits the community, society and the growth of the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 8745, "q0": "I am especially impressed with your idea. Indeed, this will be a very practical and meaningful project. In the proposal, the way you explain the problem and solution is extremely easy to understand and coherent. Besides, you are very careful to explain more about the problem and solution, list some issues with some beneficiary locations. Your proposal fully addresses the requirements of the challenge and will add value to the Cardano ecosystem. Benefits for stakeholders (Restauranteur, Corporate/ Charitable Foundation, Blockchain community, Stake Pool Operator,...)  are also mentioned in the proposal. The challenges and coping strategies are presented in great detail. This shows that you have prepared very carefully for this project. For me, the presentation is nothing to criticize.", "q0r": 5, "q1": "I can see you creating a 3-month roadmap for your project. Besides, the jobs for each aspect are also mentioned. At the same time, you also mention KPIs for feasibility and auditability. However, you need to consider how the information is organized because some information is duplicated (eg Month 1) and some information should be in the later section (e.g. member details). The logical arrangement will make it easy for the reader to grasp your roadmap, and the feasibility of the project will be appreciated. In addition, it also shows your thorough preparation. Regarding your detailed budget, the expenses are provided fully and clearly from staff costs, vehicle operating costs to social media costs. All information is transparent. About your team, the members are all people with many years of experience in many fields, their achievements are also outstanding. I am sure that the project will have good results with such a team.", "q1r": 4, "q2": "All necessary information is presented in this section. This helps the project to ensure auditability. You've provided metrics to measure project progress. Especially, the project will let anyone come to directly observe all activities. Furthermore, the success of the project was also described at the end. It would be nice if you could describe more about the positive effects of the project on Cardano.", "q2r": 5, "assessor": "z_assessor_2997", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 8789, "q0": "This is a humane project; your \"Five Loaves Two Fish\" network has a lot of value and social meaning. This project also can expand nationwide because you take full advantage of it. Using young tourists on their vacation can spend some time volunteering for this project; it's a great idea. I can't help but appreciate this project as it can convert crypto to USD instead of local currency to ensure that USD will be easily convertible and not subject to significant fluctuations in local currency. You have put in place a system whereby multiple stakeholders benefit, such as reducing environmental pollution, disadvantaged people, and food donors.", "q0r": 5, "q1": "The project has an experienced team like DImitri Fernando, Rishantha Welikadage, Uditha Bandara, Vv. They work in different industries so that it will be a strong team. The highlight of this project is when you have a DeFi application developed in which the profit from the application will translate into operating costs and further expansion. You also use AI to track food receipts from each restaurant, which is a bright spot for overcoming operational issues. However, as part of the cost, you guys spend on Building the Canopy and the costs associated with the vehicle are pretty high, I'm only concerned about whether it's cost per car or how many vehicles. If only one would be fine as more and more restaurants join, possibly from many different cities. Think about integrating with another transportation application such as Grab to make food delivery quick and convenient.", "q1r": 5, "q2": "You guys gave a concrete roadmap for the project every month; especially, you implemented the project very quickly. It didn't take too much time to prepare when you completed the solutions and went into testing only in 2 months. It is also very appropriate for you to give quantitative indicators. However, it would be better if you offer specific KPIs for each hand every month and update the project progress on your channel to that add copper can be tracked.", "q2r": 4, "assessor": "z_assessor_3004", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 9588, "q0": "\"Good food gets dumped in the trash and goes to the landfill. At the same time, many people do not have enough food to eat. This problem solves environmental problems while helping to increase ecological awareness and the application of Cardano. Benefit the environment by reducing food waste, landfills, land, and air pollution by reducing CO2 emissions.\nProposal to benefit restaurants, donors, and Grants for the poor and hungry, orphans, elderly, disabled, low-income home dwellers, vagrants, stray animals\nThe scale of the proposal is in Colombo city of Sri Lanka.\"", "q0r": 5, "q1": "\"The proposed solution is to create a platform where healthy food from restaurants is distributed to those who need it but cannot afford or access it. The platform applies blockchain technology and AI to track, allocate and arrange human resources and help raise charity funds through the sale of NFTs in the form of food packages received at the input and images of people. Or food packages are given away at the output.\nThe team consists of 6 people. Team information is provided in detail, and there is a link to each person's page. The team has extensive experience in marketing, business, AI and blockchain technology, and film production. Prominent in the group is Dimitri Fernando, who has been active in catalyst with many roles such as PA, vPA, and Founder of South Asian Town Hall. It is better if the team has a specific division of work for each person by their experience and knowledge.\nThe project has been active since 2018 but has not been held regularly.\nThe plan outlines work items such as building infrastructure, linking restaurants, and finding beneficiaries. Items are provided explicitly for specific workloads. Each job has a detailed execution volume. I appreciate the plan.\nThe risks that have been identified are: first in terms of fast NFT generation from the food receiving point and the food giving point. The second risk is the outbreak of covid. The third is to make more people known and support the project. The first and second risks are solutions. And the third risk has not been provided with a solution.\nThe budget source for the project to continue to operate is revenue from selling NFTs and receiving funding from benefactors.\nThis is the best presentation proposal I have ever read. They provide complete and detailed content. I appreciate their investment and effort. The score I consider is 5.\"", "q1r": 5, "q2": "\"The budget is quite detailed. The presentation is a bit confusing, but I can understand the whole thing with a little effort. Expenses are given for operating for three months—reasonable and clear spending levels.\nIt is proposed to provide the project's own Facebook page. Accordingly, the team will update the project's activities on the project's Facebook page. However, the proposal does not mention this and has no other way of verifying it.\nThe given indicators measure the success of the project. Based on indicators such as the number of restaurants providing food, the number of food packages collected, the number of sponsors, the number of NFTs created, and transactions. All metrics are easily measurable.\"", "q2r": 5, "assessor": "z_assessor_3067", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 9665, "q0": "The proposer does a great job of raising awareness and leading to the proposal by telling stories about how much food waste may be distributed to persons in need. What is most needed is a low-cost tracking system. This problem will be solved with the help of integrated Blockchain-based components, which I believe is a fantastic idea because it benefits not only stakeholders but also the Cardano ecosystem. More users are drawn in by the possibility to exchange crypto currency into US dollars. The risks are clearly displayed in each point, and the solutions provided are equally risk-related, with reasonable and contingency plans.In such times of high gas prices, I believe that using electric vehicles for delivery is a great idea. And Ba.5 omicron have appeared, with the potential for virus spread via people and food, I feel the proposer should be concerned about this in addition to the staff shortage problem. The proposer had previously worked with several stakeholders and authorities to obtain curfew passes on multiple occasions, which I believe would also help with this plan. Altogether, I believe that this proposal will add significant value to the Cardano community while also raising brand recognition through charitable activities and supporting those in need.", "q0r": 5, "q1": "The roadmap is quite detailed and includes all of the work, down to the tiniest detail. The proposer provided the number of employees that will be assigned to each job. Restaurants and beneficiary locations have been determined; months 2 and 3 will be used for testing. Although the roadmap is carefully defined, I believe the three months are primarily for testing purposes. I feel it would be a fantastic idea if the proposer included a brieft vision after three months and what will do if the trial was successful. Not only the roadmap is specific in any component, the budget breakdown was also reasonable. The budget allocation is in line with the plan. Furthermore, the proposer included links to the team members' profiles, which allows for a more in-depth look into the team's abilities.", "q1r": 4, "q2": "All of the kpis are valid for evaluating the proposal's progress and success. However, it would be good if the plan included some kpis numbers that could be used to monitor and consider performance in the metrics. Then it's on to expanding the business and spreading the word about the NFTs blockchain's benefits. Because of its humanity, this project deserved attention and needed to be scale in the future. Its success would benefit everyone and can bring more reputation to stakeholders. ", "q2r": 4, "assessor": "z_assessor_3080", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 10570, "q0": "“5 Loaves 2 Fish Feed The Hungry App” I found that this is a good and very humane idea that meets the challenge of “Dapps, Products & Integrations”. Here, the proponent has raised a very important and common problem today: \"Good food goes in the garbage. It adds to landfills, and CO2. Hungry people who could eat the food have no access. There's no way to track it.\"  As the proponent pointed out, there are now more and more leftovers in restaurants, they are all sent to landfills, while there are still a lot of children, the elderly, the poor and the elderly. The world's homeless are having nothing to eat. Putting those foods in landfills not only wastes them but also affects and pollutes the environment. The solution proposed by the proponent I found to have identified most of the problems of the challenge. They give evidence of the current situation to show the impact of the problem. By offering specific and detailed solutions such as creating a system where restaurants can donate their excess food which the proponent team will collect and distribute to beneficiary locations or is to create a blockchain-based AI-powered application that can optimize multiple donor locations, find the best place to distribute food, etc. According to what is presented in the proposal, it represents the vision, ability, and enthusiasm of the proponents. As can be seen, this proposal is described in a very detailed and clear solution, and the topics that need to be presented are relatively complete. To successfully implement the project, the proponent has outlined the difficulties and risks that the team needs to face, which are the appearance of another Covid variant that ordered a court order, the ADA's volatility leading to the cannot meet budget costs, takes a long time to convert ADA to local currency when the final currency is converted there is a risk that prices of goods and services may differ from what is expected the proposed group has made a budget. Although the risk is relatively high, the proposed team has also proactively come up with solutions to overcome that risk, with this careful preparation I find that this proposal is quite complete.\n", "q0r": 4, "q1": "Regarding “Feasibility” the proponent presented enough items such as project implementation timeline, budget, and project participants. This proposal has been divided into 3 months, each month is associated with goals and plans to be achieved by specific data. I think this is good and logical to make it easier for people to monitor and control. As for the budget, the proponent has shown a fairly detailed way of budgeting, clearly separating different purposes such as vehicle operating costs, crew costs or loading and unloading costs, transportation costs, etc administrators and marketers. This shows that the proposed team has considered and planned very carefully and carefully prepared before implementing this project. However, I think that if possible, the group should deduct a small part of the budget to establish a reward fund for individuals/groups who work actively and effectively to encourage work; or use that money to reserve for unexpected situations that need urgent capital. This helps the group to be more proactive in dealing with possible difficulties. Regarding the project participants, the proponent identified 5 members of this project. In it, their information is also presented in quite a detail, the proponent has provided a link for people to easily follow and check the information. Each person has their expertise and experience, which helps the project to develop in many aspects, and the reliability of the success of the project is relatively large.\n", "q1r": 4, "q2": "For the community to be able to measure the success of the project, the proposer has indicated the criteria that need to be achieved to evaluate the success, however, in my opinion, the proposer should provide KPIs that are: specific data, associated with items such as how many beneficiary locations increase, how many donor bases increase, etc., so that the community can easily grasp and control the project. This is a new project, it is linked with several other projects in Fund 8, I think that the advantages of experience as well as resources that have been built before, will contribute to increasing the certainty and reliability of this project. This is a humane and meaningful project. ", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 12615, "q0": "I highly recommend this project because there are very few proposals in the funding round that are as humanitarian as this one. I think that should be more concerned, it will help Cardano receive positive views from the community.\nThe problem of wasting food while poor children are still struggling with hunger is an age-old problem with no solution. The solution of molding feed portions into NFTs to ensure transit to the beneficiary's location is not a bad idea. Not only that, people who want to charity make it easy to buy back NFTs of food and send it where they want to donate, which can grow the project budget, but I have a question that the When the NFT goes to the beneficiary, it will transfer ownership to the beneficiary right?, the food can be consumed but the NFT is not, how will you handle them?\nThe proponent presents a lot of his solutions, information and insights on social planning, which shows that you have a lot of experience related to this field. The amount of information I think is satisfactory and I have no idea. I don't know if the project plans to issue tokens in the future, because I think this is a very good solution to increase the budget in addition to the food NFT charity and sponsorship funds. In the end, I see this as a potential project and it meets the requirements of the challenge.", "q0r": 5, "q1": "I can see the rich experience of the proponent through handling the jobs. You calculate special work cases such as human resource problems, etc., then come up with very reasonable solutions and requirements. The team has completed a number of important things to prepare for the project implementation.\nThank you for providing details about who is leading the project and their qualifications and experience. The proposed project roadmap does not seem to balance the information of the jobs between the timelines. I recommend that you detail the process of building an AI application and building the platform of the market, how will this task be accomplished? What exactly will happen, What experts will be involved here?. This if presented clearly will gives me confidence in the Cardano Blockchain application that the project is developing.", "q1r": 4, "q2": "The project has attached a link to the facebook page so that the community can follow the project progress. But I suggest the project can do the following additional things, YouTube video updates, website with product demos and code snippets, Github Commits, Catalyst Project weekly presentation,... Because on the facebook platform in my opinion is quite difficult because of its interactivity.\nWe look forward to seeing what data proponents will collect, what goals they intend to achieve, to communicate that progress back to the Cardano community. Anyway, I am confident that I can feel the real impact of the project on Cardano's blockchain because the project metrics are reasonable. Therefore, my opinion is that the auditability of the process is excellent.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n\n"}, {"id": 14810, "q0": "This proposal would take food which is usually thrown away and provide it to people who need it. This would be helpful for many homes that cannot afford to eat; restaurants that want to reduce waste without throwing away good food; individual families and the community at large. In addition, reducing food waste has a positive environmental impact by saving natural resources. \n\nThere are many potential problems with this idea which is why it's good to think things through before making decisions. However, without solutions to some of these issues, the whole idea is at risk. For example, fuel price increases, or people taking on shifts to earn the money. There is a gap in this proposal as it doesn’t propose how to deal with or prevent unwanted shifts, although it does suggest that people take on shifts in their free time as much as they want to when they are working. It’s possible that there is an assumption of a shift worker quota as well.", "q0r": 3, "q1": "The proposal is quite lengthy and has a lot to offer in terms of content. The first part of the proposal, detailing their strategy for development, is extremely well organized and provides an overview of what the project will be. They'll start by onboarding 1-3 restaurants in 3 months. Previously, the proposer mentioned they have contact with the Colombo City Restaurants Collective which has 57 restaurants. Then when they see traction happening they gradually increase to onboard more and more restaurants per month. If they show how they use the testing phase to expand the project it would make much sense. In this way, readers are also able to picture the future of the project.\n\nRegarding the budget, the project is closely tied to NFTs yet I don't see the budget for developers or administrators of the site. The team should be able to find funds from other sources or adjust the budget. Team members are described in details what they can do, their experience as well as links to their profiles. However, I still see some positions available if the project expands. They could add information on how they plan to recruit those roles in the future.", "q1r": 3, "q2": "Every part of this project may be linked to an NFT, allowing them to track the number of restaurants onboarded, the amount of food packs, and the number of NFTs created during pickup and sale. I would love it if the proposer could include some specific numbers, such as 1000 or 2000 NFTs after 2 or 3 months. That way, we could see in advance how big or how fast the project might get. \n\nMy main concern is how the project's success is perceived by the proposers. They claim they hope to expand from one night per week to seven evenings per week, and to be able to expand their beneficiary areas, donor base, decrease time spent, and grow reputation. Even though this is the beginning phase, if they truly want to go after these big goals, they could present a drafted sketch of how they intend to do this.", "q2r": 3, "assessor": "z_assessor_4103", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We pickup food from restaurants, and deliver to beneficiaries, orphanages. elders homes, homeless, street people, slums, low income housing.", "experience": "I have been involved in social service projects for over 36 years, On planning committees and packing teams for distributing dry rations during recent lockdowns. I also obtained a special pass to distribute of food rations from restaurants right through the curfew and lockdown"}