{"id": 417139, "author": "adaminnow", "title": "ADAO- NFT Fractionalization Dapp", "url": "https://cardano.ideascale.com/a/dtd/417139-48088", "category": 26595, "amount": 33750, "description": "There is no open and accessible interface where non-developers can interact with and leverage the Fracada v2 Smart Contracts.", "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 379, "q0": "ADAO is proposing a NFT fractionalization DApp that will make it easier for people to acccess the Fracada v2 smart contracts through a visual interface. Based on ADAO's existing experience working with the Fracada smart contracts they will create a web interface for the simple use of the contracts and charge a fee to the end user that will be send to the treasury for ADAO to sustain their open source development. The value of this application is that it will make the fractionalising of NFTs accessible to the average user in Cardano and give them more options on how to hold or sell their existing NFTs using this service. The team mention the risks of smart contracts for this proposal. The proposers could have added more details on some example use cases for this application apart from a more obvious example of splitting up a high value NFT to share ownership. A few examples would have given more confidence in how this may be used by different groups of users and then also the risk of adoption could also be mentioned on whether these use cases have much demand. Overall there is definitely value making these smart contracts and functionality more accessible to the wider community to see how it gets used.", "q0r": 4, "q1": "In terms of the roadmap for this project there are already a number of items already completed. The team is now completing off-chain development work that leverages Lucid before then doing a test-net and main-net release planned for August completion. The progress list is sufficient however could have added more depth on what is involved in these steps. The budget breakdown gives hourly time estimates for each of tasks involved which then is used to create the final total cost. The values seem to be fair. No mention of UI/UX and design work is mentioned which would have been good to see as this is focussed for the average end user. Three team members are listed on the proposal that are involved with ADAO, no professional links were provided which would have been useful. The website and Github repository have been linked which showcase ADAO's work in the community that is open source. Due to the evidence on previous execution and the plan provided and current execution towards this proposal already it looks very likely that this proposal is feasible.", "q1r": 5, "q2": "In terms of tracking progress the code commits in Github are mentioned and then in terms of metrics the number of NFTs fractionalised and number of fungible fractions minted. Being explicit that this proposal is open source with the Github repository provided makes it easy to know this proposal will be easy for the community to audit the progress and benefit from the codebase. Success for this proposal is defined as the effective implementation with sustained use in the community. The proposers mention other community members who have been interested in this application. It would have been good to mention these in some more detail in the impact section to cover their use cases as mentioned before - this would have added clarity to the assessor and voter. Overall due to the evidence of historic delivery of open source code it looks likely that this will be sufficiently easy to audit the progress, completion and usage of this proposal for the community.", "q2r": 5, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1409, "q0": "The proponent wants to create a dApp to fork NFTs and distribute these NFTs using Smart Contract Fracada V2 which is completed, audited and open source.\ndApp of this proposal can make it easy for users to use with its simple features in the browser without any censorship. This will make the dApp able to interact with many decentralized financial applications, helping NFTs increase liquidity significantly\n", "q0r": 4, "q1": "This dApp can make it easy to interact with many decentralized financial applications and help increase liquidity in the NFT sector, making the Cardano platform more and more valuable to the community.\nThe proposal team are well experienced in DAO and Haskell programming for smart contract development. However I would like to know more about their profile which need to be public and available to help identify their experience and possible implementation.\nBudget is 75 usd/hour, being allocated according to specific jobs.\nOne thing must be considered as this proposal has been partially implemented, including the implementation of smart contracts Fracada and Fracada v2, ... and is expected to launch in September 2022. \nProject milestones are mentioned with clear results\n", "q1r": 4, "q2": "The roadmap is clearly stated with the work completion. Number of NFTS is published on daily, weekly and monthly basic, etc.,. The implementation results are updated on github and the public dApp.\nInformation about the project is very detailed and clear. However, I’d like to suggest the proposer to update their workflow /timeline with KPIs clearly on social networking platforms such as Twitter, Github, Telegram, etc.. This is to increase the transparency and auditability.\n", "q2r": 4, "assessor": "z_assessor_2237", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5337, "q0": "ADAO-NFT Fractionalization Dapp proposal is deploying a NFT fractionalization dapp that anyone can use to fractionalize NFTs and distribute the underlying tokens using the Fracada V2. Smart contracts. The example of projects that use this feature is Disco Solaris. The ADAO Fracada DApp fits the challenge of DApps, Products & Integration challenge very well as it enhance liquidity of NFT by fractionalization and allow tokens to interact with DeFi application. The team mentions the Fracada V2. smart contract as the risk but haven't mentioned ways to mitigate this risk. They might want to come up with solution in case of any hiccup from smart contract codes. Also the team might want to clarify the revenue model of ADAO in charging this NFT fractionalization feature. ", "q0r": 5, "q1": "The test and deployment of Fracada V2 Smart contract code is completed along with written technical spec around web application leveraging Lucid Cardano Tx library. The later part of the project dealing with Lucid Cardano is on track with the possibility of dApp launch in August 2022. The team hasn't mentioned jf the audit is done by external third party. The pay rate per hour across the project is $75 per hour. There is no link given of team member of ADAO (only name and experience and DZCodes are identity name) and the team might want to consider putting that in their proposal for full accreditation to this project. $33750 is the total budget applying $75/ hour across the task list to get dApp up and running. After which, they will charge a small fee (undisclosed amount) at initial fractionalization to maintain the application. The team will benefit for disclosing team member name and get into detail with its budget breakdown. ", "q1r": 4, "q2": "The success for this proposal would be the adoption of this dApp by the community. The project will open another paradigm linking NFTs and DeFi protocols and expand the usage of NFTs. The team should consider the revenue model carefully as 5ADA although not a significant amount but surely it is more than some NFT minting fee or ISPO token distribution fee. The community can track the progress/commits of open source code in GitHub, number of NFT fractionalized and fungible fraction minted using this DApp. conveniently. The project auditability itself is very good and with the ADAO community GitHub along with the fracada forked from DCSpark.", "q2r": 5, "assessor": "z_assessor_2695", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8075, "q0": "Fraction (segmentation) has become a new trend in the NFT as it helps those who cannot afford the entire NFT to still own a part of it. Fracada supports this but it is not easy to do for non-software developers. Providing an interface that most users can use is up to the challenge. And will really trust because it is used again with Fracada, the software is trusted at Dcspark with open source and audited. However, the failure to specify the amount of fees to be collected and how to collecte is a minus point of the proposal", "q0r": 5, "q1": "With the release of Github information and some milestones were completed prior to the proposal this highlights the feasibility of the project. \nThe proposal outlined the main milestones and its timeline (although not detailed enough). \nThe proposal also states the time to complete the main items so that the total cost of the project can be calculated. \nThe project team has members with experience in related fields, which is also an advantage of the author team.\nHowever, I am confused with the fact that the author team does not continue to return in the following FUNDs but only takes the fee proceeds to maintain the project, because what will happen to the project if the fee collected is not enough to the team to maintain or upgrade the product according to the new requirements of the market?", "q1r": 4, "q2": "The author team provides Github information that will make it easy for the community to track the progress of the project.\nBesides, the community will also measure based on parameters like \"\"Number of NFTS fractionalized using the DApp daily, weekly, monthly growth.\"\" or \"\"Number of Fungible fractions minted using the DApp.\"\". However, these parameters sometimes do not accurately reflect the quality of the product, such as when the downtrend market then the number of users is less, etc. The author team should increase other interaction channels for the community to easily interact to increase the auditability of the proposal.", "q2r": 4, "assessor": "z_assessor_2945", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8397, "q0": "I only have one word for your team in this part: Perfect! It’s almost flawless from the first section to the third one. The manner you describe your proposed project is explicit with enough information, including what products your dApps will launch, their main characteristics/functions, target audience and what benefits they will gain. Students are exactly a wise choice! Moreover, this proposal deserves to be commended because of its clarity in key metrics. Your given key metrics are completely “synchronized” with the challenge. Your description of how the project will address the Challenge is very convincing. More reliably, the risks accompanied with methods to mitigate are presented clearly and appropriately. I don’t find any errors in this section. That’s my point of view!", "q0r": 5, "q1": "Overall, this part is provided with adequate crucial information pertaining to work plan, fund allocation and member list. In terms of your plan, I wanna praise you for having completed almost half of the progress. The timeline you give for the three remaining goals are relatively explicit since you can anticipate which month every target will be achieved. But if you were able to give more data related to each of those three milestones, such as supplementing specific activities and time to complete them, it would be perfect! Your budget breakdown, which is based on development hours, is considered reasonably explicit. Especially, you surprised me by describing your staff in very detail. This is the best section in this Feasibility part for its sufficiency. These three people who work on your project appear to have seasoned experience in their field which is relevant to your project, and I believe these members are capable of pushing the project’s progress easily thanks to their good talents. If you want this part to be the most flawless, add their LinkedIn into the proposal so that the voters can know more about your members.", "q1r": 4, "q2": "Generally speaking, your description of the measurement method is straightforward. The software you use, GitHub, is trustworthy. The contents that will be posted are specific (number of NFTs and Fungible fractions minted). Nonetheless, adding more detail of this part is my advice so that voters can know more about your progress. For instance, you could base on your work plan, your milestone to develop this part. Finally, what the success of your project will look like is comprehensible and promising. Admittedly, a low cost browser app (under 5ADA) which is open source and easily accessible is never a bad idea since everyone loves this. However, a low price is not convincing enough if its quality doesn’t satisfy the standard. You should mention the quality level of your Dapp will be if the project’s successful.", "q2r": 4, "assessor": "z_assessor_2980", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14419, "q0": "As I understand, the proponent wants to develop an NFT fractionalization Dapp base on the Fracada v2 Smart contract that anyone can use it easily. To me, this ideal suits the Dapp challenge. The solution is understandable. It shows clearly the purpose is building a simple web interface for anyone who wants to use Fracada Dapp. But the risk was not specifically pointed out. If it has too many types, the proponent can give a few examples to show for the reader to visualize it more easily. I think if the proponent can do better on the risk explanation, this part will also be better.", "q0r": 4, "q1": "The progress for the plan was well provided. And I love how they show the completed task to make it easier to follow the plan. But the budget is quite unclear. They give the number of hours required for each activity but don't show how to calculate it to issue 33750. I think they should give a specific amount for each activity for more clarity. The information about the group members is short. But It still shows some relevant experience of the team member to the proposed project. However, I would still suggest that they put a Linkedin (or anything) to give more information if needed and provide the ability to contact team members. Overall, everything looks good but if the budget is presented, this part will be much better.", "q1r": 4, "q2": "The number they give to measure the project's fit for the project. And they also clearly show the time period for the NFTS number. But it still doesn't have any concrete numbers to measure the project. This can be a bit confusing for the reader. So I suggest they give some numbers in this section. The picture of success they describe is good. It highlights the price and transmission information benefits for the Cardano community. Overall, I think I will be fine if the proponent give a specific number to track the progress.", "q2r": 4, "assessor": "z_assessor_4045", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Deploy a NFT fractionalization dapp that anyone can use to fractionalize NFTs and distribute the underlying tokens using the Fracada v2 Smart contracts that were developed and open sourced by Dcspark.", "experience": "The proposal team consists of 3 working group leaders and ADAO core contributors with extended resources and advisement from the greater ADAO Community Known for their open source contributions and collaborations with other well known development teams in the Cardano ecosystem. "}