{"id": 417299, "author": "dimitri777", "title": "Delivery Tracking via NFTs", "url": "https://cardano.ideascale.com/a/dtd/417299-48088", "category": 26595, "amount": 35650, "description": "Good food goes in garbage. It adds to landfills, and CO2. Hungry people who could eat the food have no access. There's no way to track it.", "f6_no_assessments": 5, "f6_rating": 4.2666666666666675, "videos": [], "media": [], "f6_assessments": [{"id": 3676, "q0": "The project has the social and environmental goal of reducing food waste and feeding the hungry by collecting unsold food from restaurants and delivering it to those who in need. It is a good example of the social and environmental good that blockchain can be used for. However, this proposal needs more finetuning, given that the team is already delivering unsold food from restaurants to those in need, how much added benefit would using the blockchain bring? The use of NFTs for tracking deliveries of food seem a little forced and I’m not so sure that selling NFTs of people in need will be well received globally or that there’s even a demand for it. Some suggestions are to simply record the delivery of the food on the blockchain and have recipients themselves confirm the delivery and in turn they will be eligible to receive more food next time if they have internet access. Otherwise, this ‘decentralized’ solution relies a lot on trusting the ones doing the deliveries to report honestly, which is really just another variant of the oracle problem. \nBeing self-sustaining is important so I can see the need to sell NFTs, but since the proposal included some points about reducing carbon footprint from lower food wastage, how about partnering with a carbon credits platform to issue carbon credits for each package of food delivered to raise funds instead of people’s pictures?(Edit: proposal included a brief touch on carbon credits but in the feasibility section instead.) Maybe bonus credits could be awarded for using vehicles that rely on renewable energy too.\n", "q0r": 3, "q1": "It is reassuring to see that the team is already doing this food delivery from restaurants to those in need but just without the blockchain aspect yet. Building on the current process already in place with blockchain enabled software would make this easier than starting everything from scratch. The team also has much needed experience in the technical aspects and has been active in the Cardano community. Feasibility isn’t as much a concern as whether a blockchain solution makes sense for this use case.", "q1r": 4, "q2": "The team proposes to track key usage metrics such as number of food packs delivered and since this would be powered by the blockchain anyone can verify these metrics. It would be an added bonus to include some sort of visual analytics dashboard that the team can use to track key metrics and for the community to follow their progress more easily. More kudos if the team can open source their development to help the wider community implement this in other parts of the world as well. ", "q2r": 4, "assessor": "z_assessor_2468", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "We are planning to open source the code."}, {"id": 5888, "q0": "This project has great significance, it brings positive impacts to many stakeholders. Orphans, old people wandering, slum residents, people with difficult economic conditions can have free meals, help them overcome hunger, improve their lives. These meals are sourced from restaurants and eateries. Instead of throwing it in the trash at the end of the day, restaurants will be able to use it for charity or donations. People who have donated to track their donations via pickup NFT and drop off NFT. They will be motivated to further contribute to the ecosystem. This helps to reduce waste, reduce landfills, reduce CO2, contribute to environmental protection and fight climate change. Based on the above reasons, I believe this project will effectively solve the challenge posed.", "q0r": 5, "q1": "Information about the team has been provided in full. Based on the information provided, your team consists of seasoned members with all the skills and knowledge to carry out the project. One of them joined Cardano very early, holding many important positions, having certain successes: Founder of South Asian Town Hall, founder/CEO of Blue Chip Asia,... These things increase people's confidence in the team's capabilities. Links to their Linkedin profile are also provided, which will help to make the above information more transparent. As you know, the team is a decisive factor in the success or failure of a project, you've got a great team!\nRoute provided. It's very specific, you've done a great job of identifying the to-dos and delivering them into the appropriate timelines. Having a detailed roadmap will make it easy for everyone to track and evaluate, helping the project develop in accordance with the goals and orientation set initially. The budget has been calculated, however I think it needs to be clarified further. Break down the budget by determining the number of people involved in each task, the number of hours worked, the pay per hour, and so on. That makes the budget a lot more transparent. As for the project progress and success indicators (KPIs), I think there should be specific metrics such as: the total number of NFTs distributed per day is 200, more than 30 houses per month. new sponsorship,... . Having specific metrics will make it easier for PAs to track project progress, making evaluation a lot easier.", "q1r": 4, "q2": "All information provided is quite complete, based on that, people can evaluate the success of this project. In addition to the issues I mentioned in the previous section (clarifying budgets, adding KPIs, etc.), I also want to give you a compliment for identifying the risks and challenges and how to reduce it. Especially during the period of the Covid epidemic raging, the price of ADA has many fluctuations. Knowing how to reduce risks will help the project avoid factors that harm its long-term development.\nThis project not only benefits the poor, helps protect the environment, but also brings great value to the Cardano community. If implemented successfully, it will help improve meals for the disadvantaged, prevent climate change, promote the participation of many developers. Because of its humanistic meanings, I completely agree, completely believe in the success of this project. I myself am a person who regularly participates in charity activities, I am very interested in this project, if given the opportunity, I will definitely participate in the project. Thank you for a great suggestion!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide."}, {"id": 6625, "q0": "The objective of this proposal is to get restaurants to contribute their surplus food to childrens' homes and orphanages, the disabled, and other institutions.\nThis would be done by having a platform where restaurants can request a pickup from an app. The app will then assign to a driver who will then go and pick up the food and deliver it to the beneficiary. The solution will track each pickup and deliver to ensure transparency, accountability and trackability.\nThe value proposition is that it will reduce CO2 Emissions by reducing the amount of food going into landfills and also feed children, physically and mentally disabled, addicts, elders, refugees, homeless, slum dwellers, street dwellers and other needy people. This project is to bring a system for food pickup and delivery to beneficiaries, with real time auditing, tracking and transparency. I think it aligns well with the objectives of this challenge in that it will have a very positive impact on the Cardano ecosystem, and will not only feed the hungry but also bring goodwill to Cardano.", "q0r": 4, "q1": "The project has a solid team with skills and experience in different fields that are required to make this project a success. The project is already operational and has been distributing food regularly to the hungry in Colombo, Sri Lanka after seeing the need during the COVID-19 lockdown. The proposers are now seeking funding to expand the project and help more people. Given the plan presented and experience of the proposers, it is highly likely that this proposal would be implemented successfully.", "q1r": 5, "q2": "There are several KPIs being proposed by the team. One can use NFTs to track the number of donors, the number of restaurants onboarded and the number of food packs distributed per day. One can also use NFTs to track any private or corporate donors. It would be important for the team to periodically prepare reports that have this information, and present them to the rest of the community. Another point would be to monitor the development of the NFT solution itself, not just the results. I think the authors did give us some good KPIs for determining the success of the completed project, but not enough for strong auditability of the development process.", "q2r": 3, "assessor": "z_assessor_2823", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide."}, {"id": 8585, "q0": "I'd like to applaud the author on this proposal. In addition to being a very good fit with the challenge's goal, it is really well written, with the information presented in the manner it should be: straight, brief, and clear. Due to the impossibility of tracking the good food thrown away in order to give them to hungry people, the proposal wanted to address the issue by picking up food from restaurants, and delivering to beneficiaries, orphanages. Each food packet received from a restaurant is tagged with NFT and can be tracked via NFTs for Transparency, Trackability and Auditability. Those NFT can be sold on the NFT marketplace like CNFT. The idea is very interesting and noble. It is very positive how the author describes for us how they will generate NFTs for each package of food, what the main activities would be in action and how the blockchain contributes, providing us with a solid knowledge of what this idea is about and how it would work in practice. The team is also concerned with making it obvious what the benefits are for each segment of the public: the Blockchain community, Stakeholders, Stake Pool Operators, and so on. There is also a comprehensive session detailing the expected impacts, which are in line with the challenge's goals, as well as metrics impact, which contribute to the capacity to make an accurate evaluation. So, I feel that if this proposal is carried out by generating NFT and registering them on the Cardano blockchain, it will significantly benefit our community.", "q0r": 5, "q1": "The team has an active website that provides proof of previous work and would greatly increase the viability of this project. They appear to be highly competent; each member's name, linked and Facebook profiles are supplied. The team is extremely likely to be well prepared to lead this project to success. However, it appears that the team is in need of four employees to manage food pickup and delivery, one marketing person to onboard new restaurants and identify beneficiary locations, one admin and accounting person, and one social media and content creation person. It would be nice to know if you need to hire more people. Have they been identified by the team? Or how will the team identify them? I also recommend that the team define which professionals will take on which specific roles, particularly those involving marketing, which are critical to the project's success because it should be widely publicized.The roadmap is quite well explained; it was designed for three months, and there will be detailed explanations of what will happen in each month. Milestones are achievable and it seems realistic to what is being proposed.They mentioned the budget is enough to run the project for 3 months, but they don't give sufficient information. It's difficult to evaluate this for someone who doesn't deal with it directly, so additional information would have been helpful. For example, the team could try to clarify the total sum of “Social Media Campaign to promote this to other organizations and NGOs” and “Administration and Management for first three months” as $4000 and $5150 relatively for each element seems subjective.", "q1r": 4, "q2": "In terms of traceability and auditability, I think the proposal does a great job of outlining its goals, KPIs, and ideas. Rarely do I see a proposal with precise KPIs and success metrics that are entirely consistent with the scope of the proposal and the challenge. The team has provided great explanations of the sections that are relevant to determining the proposal's auditability. It provides the information required to comprehend the immediate activities that follow the distribution of funds. I really love the “Visual Real time auditability” the team provides, they leave no vagueness in how to do food runs, where they go, how they deliver as anyone can join them anytime on holiday. Furthermore, the proposing team provides a thorough and extensive analysis of the proposal's risks and problems, as well as viable mitigation options, the majority of which make sense. Based on the facts provided, I consider this proposal is highly auditable.", "q2r": 4, "assessor": "z_assessor_2992", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide."}, {"id": 15294, "q0": "This idea I found very cool and interesting and very suitable for the goal of the challenge. Getting rid of leftovers for the sake of palatability when many hungry people can't find food is a problem most restaurants face. They have no way to dispose of leftovers, they also know that throwing away leftovers will affect the environment, increase waste and affect the current climate. This is a big problem and a way to tackle this challenge is needed. The solution to this problem is clearly defined by the author as they will take leftovers from restaurants and give them to orphanages. Instead of throwing it in the trash at the end of the day, restaurants will be able to use it for charity or donations. People who have donated track their donations through NFT receive and pay NFT. This solution, if implemented well, will solve two problems that society is concerned about: 1. Reducing food waste, reducing landfills, and reducing soil and air pollution by reducing CO2 emissions. 2. Subsidies for the poor, orphans, the elderly, the disabled, the low-income, the homeless, and wild animals. This project will add value to the Cardano Ecosystem by providing benefits to the environment and stakeholders such as restaurants, food sponsors, and beneficiaries. It also helps social organizations achieve transparency, traceability, and auditability more easily In this proposal, the author also outlines a lot of risks that they may face when doing this, but there are also ways to deal with those risks. They come up with individual plans to deal with each risk. This proposal is an innovative idea that can scale to solve future challenges, which adds value to Cardano and Catalyst and will help more people know about Cardano.", "q0r": 5, "q1": "The plan of the proposal is very detailed, they have shown how they implement this project. Within this proposal, the author provides a 3-month roadmap and describes the activities to be carried out each month. So we can easily monitor and evaluate whether the proposal is going as planned or not.\nNext is the budget, the proposal asks for $35,650 to be used for tasks such as NFT Creation, Social Media Campaigns, Administration and Management for the first three months, and contingencies. However, I think the budget needs to be explained a bit in terms of costs like social media, and administrative costs. Those activities should be described in more detail as to what sub-activities they include and how much each activity costs\nFinally, analyzing the group's presentation, I found it to be quite adequate in general, as most professionals provide a good level of detail about their profession, exemplifying previous experiences and providing their affiliated profile, on how we can get to know them more directly and proven way.", "q1r": 4, "q2": "The auditability to check progress is great. The proposal already provides several completely measurable KPIs:\n-Number of restaurants recommended\n-Number of food packages collected per restaurant per day\n-Number of food packages distributed per day\n-Number of NFTs generated upon receipt\n-Number of NFTs generated on the sale\n-Number of NFTs sold on the CNFT market\nThe community can fully track these indicators through the application provided by the proposed team, besides, for additional funds, they will also be very transparent by live-streaming the actual distribution products using a head-mounted GoPro or other methods such as Live Streaming from a mobile phone to Youtube or Facebook. I think this will attract more organizations and individuals interested in these activities and create more opportunities for introducing Cardano to more people.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We pickup food from restaurants, and deliver to beneficiaries, orphanages. Track via NFTs for Transparency, Trackability and Auditability.", "experience": "I have been involved in social service projects for over 36 years, On planning committees and packing teams for  distributing dry rations during recent lockdowns. I also obtained a special pass to distribute of food rations from restaurants right through the curfew and lockdown"}