{"id": 417249, "author": "alfred.pham", "title": "NOW! NFT GAME NO MORE BORED!!!", "url": "https://cardano.ideascale.com/a/dtd/417249-48088", "category": 26595, "amount": 57073, "description": "Apparently, all the current NFT games failed to attract gamers in the mainstream gaming industry due to the lack of entertainment and terrible gameplay. ", "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 2811, "q0": "After realizing that the problem of NFT games in the Blockchain platform does not satisfy the traditional gaming believers, and is not attractive to them, and through the statistics, it is proposed to summarize and have evidence with those figures, and realize the great potential, because if the combination of blockchain and traditional games succeed, there will be billions of dollars in revenue to be brought into the traditional game market on this Blockchain. Therefore, the proposed team has come up with a solution to combine the Blockchain platform with traditional games,\n In addition to the issues that need to be solved above, the team proposes to bring the traditional game platform to the blockchain with traditional sample content, giving players a 5p-15p experience, high quality graphics Products and effects in the game are diverse but will not be suitable for financial believers.\nIn parallel with the above contents, the proposed group also gives reasonable examples and explanations, the possible risks and the group has taken optimal measures, especially the risk of the group's budget has been proactive. start the development work without waiting for funding, and the team has stated that if it is not funded in this round, the team will still operate normally but cannot guarantee the diverse features in the game , generally the quality will be worse.\nThus, through plans and documents related to the gaming industry, this proposal will effectively address this challenge.", "q0r": 5, "q1": "The plan to implement the idea was announced by the team very clearly and clearly, dividing the milestones by quarter of the year. The work content is very well planned for example: Miverse's community and social media channels (Twitter, Facebook, Reddit, Discord, Telegram, Medium...) (In progress), with notes and explanations for each job content. as necessary activities are being carried out, the scheduled time is suitable to complete the stated work contents,\nThe team provides a link to a detailed spreadsheet of the spending budget, and all have explanations from the unit price for each expense, information about the team to develop the proposal is provided very comprehensively for each item. members, through the clickup platform. and explain to members who are recruiting,\nThrough the publication of the excellent summary, as well as the industry-relevant experience the team has to offer, the proposal is easy to succeed.", "q1r": 5, "q2": "There are 5 metrics that the team has provided to support the audit community, and the team is committed to providing reporting of all activities and completed workloads on the clickup platform, in addition to The community can verify those metrics on the proposed team's website.\nThe determined success of this proposal is the incorporation of the Blockchain platform into the traditional game, and the curious interest of the traditional gaming community with the diverse features in the game, in addition will attract many developers. Game developers participate in development on this platform.\nsuch that all indicators and supporting statements for the audit community ensure the transparency of the proposal, the success of the proposal can be easily seen and the work path of the proposal team can be tracked.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 6062, "q0": "This proposal is exciting because it will usher in the next generation of NFT games with a multiverse metaverse that can provide gamers with thousands of diverse and different games. A new kind of game but familiar to players because it shares similarities with MOBA games will be developed on the Cardano platform. The Cardano platform is highly adaptable for the future evolution of gaming environments. Therefore, the platform also positively affects the game development-related metrics such as the number of new players in the Cardano ecosystem, the number of new ideas developed, the number of CNFTs, the number of developers interested in game makers, etc. I like this idea and believe if it is successfully funded and implemented, it can bring new members to the Cardano ecosystem and blockchain technology. This exciting proposition has a high chance of yielding positive results.", "q0r": 5, "q1": "The authors provide an overview of their entire project and a detailed roadmap for the scope of this proposal - October 1 to December 31, 2022. The information provided gives us a solid understanding of the activities to be developed, and in particular, six main activities highlight the scope of this proposal. And finally, the team proposed to put together a very detailed financial list. Specific activities in when and how much they cost are listed clearly.", "q1r": 5, "q2": "The audibility of this proposal is fantastic. The authors identified three tools to check and track the progress of the entire project and within the scope of this proposal. Easy-to-understand KPIs such as the number of people playing demo games, the number of people in the game community, and the number of media followers make it easy to track in detail what stages are in progress. The proposal team is very confident in saying that the only risk in implementing the proposal is not being funded, and they also have their funding to prepare in this case. The team is very enthusiastic about this project and believes that the proposal will be made better if successfully funded.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12617, "q0": "Proposal fit the challenge. The problem you pose most of the Gamefis are only made for the purpose of making a profit for players and game owners. That's right, the Play-to-Earn games are produced in a hurry so as not to miss the Play-to-Earn craze, so it doesn't care much about the plot, they just focus on it. Token mechanism is distributed and Gameplay, and sometimes Gameplay is not invested at all, so it only emerges with the boom of Gamefi and then becomes \"junk\" when the trend ends. That brought a lot of damage to investors and a lot of notoriety for the Gamefi industry.\nYour game is evolving with gamers playing the game for fun rather than for money. But if you go in the right direction, your game will be able to both meet the need to enjoy, and can meet the need to make money. The first thing would be to remove Pay-to-win, or reduce it as little as possible, as most games fail mainly because of this feature.\nThe problem here is how to make their players forget that they are playing a Play-to-earn game and they may lose money. The only way is to make them think that they are paying to enjoy the game, which in order to do that the Game must be invested in quality so that they think \"I make money, this is good!\" and \"I lost, I'm going to lose money but that's okay, let's just say I'm spending money to enjoy this game's great graphics, story and gameplay\".\nI am quite satisfied with your point of view and vision, a game that is carefully invested in both gameplay, graphics and plot will develop slowly but safely, it will be a fertile land to attract. investors, and only the \"long-term\" can grow and survive. If successful, the game will attract a large number of gamers and more importantly, be able to keep gamers around longer. As for the proposal, I think the amount of information you provided is satisfactory and I couldn't ask for more.", "q0r": 5, "q1": "One of the key issues with projects like this is the budget, and a clear and detailed presentation of the roadmap and funds is required. And you're doing a great job of this. Thank you for providing complete resumes of team members and proof of their qualifications and experience. The project's roadmap details the timelines and assigned tasks, and the workload is consistent with the team's human resources. I have no opinion on this part of the proposal, as I think the information provided is satisfactory, regarding the requested budget as appropriate for the scope of the project.", "q1r": 5, "q2": "This is the audit I always expect in proposals. The proposer arrived here and showed progress in his audit process. All methods and tools to help the community keep track of updates on project progress are clearly presented. This shows that the team is confidently willing to publicize the work information so that the community can easily check the progress. This helps the team work closely with the community and easily receive support. The KPIs given are complete, Thank you for helping me understand your perspective on the success of the project will help me more confident in the potential of this project. I rate this part very highly.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 15205, "q0": "The proposer is identifying the problem that currently many NFT games that are being developed or are on the market are designed poorly, focus on speculative investors rather than on the real gamers. The solution is to develop multi-verse NFT game with the aim to focus on high-quality design and playstyle, that would fit the gamers. The proposer wants to develop a MOBA game with spaceships with the belief that it would attract new gamers. The proposer also provides statistics how many new gamers joined Steam platform, with the evident increase in numbers. To narrow down the numbers, I would say, that Steam is attracting new players not by quality of games in general, but rather on the quantity, thus, the correct assumption from my perspective is that you need to have a lot of games, lot of genres, and then you can attract a lot of people. With one game it is always a question of traction, and every concept of a game – is just a concept. I completely agree that multi-verse NFT game is aligned to the challenge setting, but the impact is something that is not supported anywhere in the proposal, thus, it remains uncertain. ", "q0r": 4, "q1": "The roadmap is set to three months (but proposers put whole roadmap outside of the scope of the funding for the overview), with the highlighted tasks such as – finishing whitepaper, in game asset design, UX/UI design, game development, demo and fixing bugs. These activities should be completed from October – December 2022, but there are also more activities planned during this period and it would be nice to pair them with the document that was provided. Revising the provided document, I find it hard to link some activities e.g. UX/UI design is mentioned even in quartile that is not asking for funding, then it is mentioned again in bold (request for funding), but this separation is not visible in the provided document, thus, it is lacking clarity. Nevertheless, the provided document is very detailed, contains (I believe) all key activities, broken down in detail, with estimations and it results in calculation of budget. Unfortunately, as I mentioned above, we can not make clear distinction between some tasks, and it also involves budget. The total budget is 57 073 USD, which according to proposer is based on the provided document, but I was unable to perform the calculation by myself. Some legend could have been helpful, what sheets to revise, what “effort” means, what is “price/unit”, (yes, even this obvious labels should have been explained) – because there is too many sheets, too many numbers, and it is hard to navigate without any prior knowledge. Regarding the team, the proposer mentioned assigned people such as devs, CEO, art development and one not-so hired game design member. Also, some pictures of the team can be found on the provided link, and also, proposer assigned some of the pictures to the tasks, for a better view. I find the team somewhat complete and their skill aligned to what they plan to do. (also, linked in profiles are hidden in different proposal, but, found them!) The webpage provided works, but I had it slightly deformed - panel on the left hide some parts of the text, so it somehow questions the capability of the team. Can be only minor bug, with some offset settings...but well, happens. ", "q1r": 4, "q2": "The proposer states the metrics they plan to measure are players of demo, growing number of community members, followers on the social media, and the progress of the in-game content. These are definitely easy to be measured, but as success metrics. As for now, we can not really follow the progress in a detail - because the milestones are not set. To fix it, it would be suggested to have e.g. stated only planned tasks, assign expected finish time for each task, and state deliverables of each of these tasks. Regarding the success metric, some other could have been added, even such as: all tasks completed, demo finished, and to align it with the problem statement – the traction of the community leading to the influx of new people should be monitored. Another suggestion - to provide more clarity of the proposal overall - tailor the proposal only for tasks, budget etc. that you plan to ask funding for, and if you still want to provide all information, put it below. I spent two hours of reading, and I am still not sure if I have seen everything. But point down because the progress is hard, or even unable to track, due to missing milestones of each task. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15234, "q0": "The problem to be solved is the lack of attractiveness that the current games of the NFT system offer to the average player, on Web2. This would be solved by the creation of a metaverse called Miverse, which will offer players, according to the proponents, several game options that are outside the commons of NFT projects (such as card games). Proponents promise big things, as you can see in the excerpt “Miverse will become a potential platform that can help these on-chained Cardano players. As a result, it can create powerful communities not only for gamers, but also for game creators (...)”. But it is not so clear how all this would be achieved, from what I understood from reading the proposal, only 1 game is already well defined and being thought for the launch of the metaverse. Overall I thought the idea was good, in line with the challenge, but I would still like more arguments about how the project would achieve the promised feats.", "q0r": 4, "q1": "The script could be organized in a more specific way. We know what activities would happen in some quarters, they are explained in good detail, but it would be better for our visualization if the schedule was based on months. I am very concerned that the money requested is only for a phase of the project, and not for the whole project, the amount of 57 thousand dollars is high and from what I understand it would only be enough for the Q IV of 2022. The amount is detailed from relatively basic way, more explanation would be needed. The team part is the best, we know a good amount of information from those involved, we see that they are part of a group called Estúdio Unicórnio, which already has some works in progress, which conveys confidence.", "q1r": 4, "q2": "It is said that some tools will be created to audit and develop the future of the proposal. What would these tools be? It is a good thing that bidders have a website where we can see the tasks that have already been done and those that are under development. In addition, we also have attached here a series of KPIs, such as the number of people who follow our social media channels - it's audience on our channels and the number of assets produced in the game. When it comes to the auditability of success, however, the quality level drops. I say this because besides the superficial definition of what is expected, we don't have much other information. How to understand if the funding was used correctly, if everything that was promised in the script was delivered and so on?", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Miverse will open up the next generation of NFT games with a multiverse metaverse which can provide gamers with thousands of different and diverse games. Check out our one-page in f9 here", "experience": "\nIn the scope of this proposal, we will use 1 game designer, 2 senior game developers, and 2 artist.\nFor making the project succeed, we're working hard with 4 teams of game development, blockchain development, comic production, and marketing with 50+ people\n"}