{"id": 417289, "author": "dimitri777", "title": "Coaching Transforms your Life App", "url": "https://cardano.ideascale.com/a/dtd/417289-48088", "category": 26595, "amount": 19000, "description": "There are no coaching resources on Catalyst community and no way to track them", "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 2072, "q0": "which is to build an app to record training hours in the Catalyst community. As Catalyst currently does not have an application that can be used by all consulting service providers such as coaches, advisors, doctors, etc. This proposal includes building tools to record and identify get the number of training hours for each client, whereby each hour spent on training the client will be recorded and calculated on the blockchain. This tool will solve both coach and client problems by recording all the details about the time and topic of the coaching session. It will not record the content of the session but is always confidential.\nAfter realizing the benefits of their sponsored coaching hours, most clients will choose to continue coaching to keep working and achieve their coaching goals. The problem statement and solution presented are reasonable and within the scope of the challenge. This proposal, if successfully implemented, will add tremendous value to the Cardano Ecosystem, it fulfills the goals of the challenge such as: Preparing a group of people willing and able to contribute to the ecosystem, Transformation. Cardano into an open-source project and attract more developers...", "q0r": 5, "q1": "The roadmap of the proposal is not very good, I understand that the plan is for 3 months, there are several activities listed, and we can envision some of the work the team will do, but How long will each of these activities take and who will perform them? The budget requires $19,000, we know what costs will be used for what purposes, however, there are still a few costs that could be better explained, such as the cost of Social Media Marketing $5000:  What are your marketing strategies, how long does the process take and who will execute them? In addition, the $2000 reserve will be used for what (expected). And finally the team, this part is probably the best in terms of feasibility. The team consists of 3 members: Dimitri Fernando, Rishantha Welikadage, and Uditha Bandara who have the necessary skills and experience to implement the proposal. The community can also easily dig into members based on the LinkedIn link the recommendation provides. It would be great if the proposal provides more roles for these members in the project.", "q1r": 4, "q2": "Auditing is an essential part of evaluating project success. With this proposal, the proponent provided indicators and KPIs that are easy to measure and test. The proposal's KPIs are defined, easy to understand, and easy to measure. Easy to measure and track within 3 months of funding:\n-Number of new customers\n-Number of customers using the extension\n-Total number of hours lasted\n-Number of extended hours per customer\n-Number of referrals by existing customers to new potential customers\n-Number of records on the app\nHowever, I don't think this part of the proposal is perfect, the proponents need to provide an extra means by which the community can easily track their workflow, and these KPIs can be controlled and constantly checked by the Cardano community. For example, these updates will be posted on the website or a social media page of this project for example\nThe success of the project was also well defined so that we understood the outcome to be expected, giving us a vision of the project: Help Catalyst members see the value of coaching while increasing efficiency and productivity in both business and personal life through coaching. The ability to have a world-class easy-to-use tool for all service providers and consultants to use to record their appointments and counseling sessions.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 13758, "q0": "The proposal by Dimitri is to create a coaching app in the ecosystem. Relationship, life, marriage etc. It aims to contribute to the ecosystem by supporting the Catalyst community with personal development by expert teams. The proposal seems good and appropriate to improve people's emotional communication/connection with Cardano and bring them to Cardano. One of the most important points of professional coaching and at the same time the secret of successful coaching is reliability. This issue, which may pose a risk in project impacts, has not been addressed. If the necessary credibility is not gained by the customers, the success of the project is at risk. The effects only mention 'preparing a group of people who are willing and able to contribute to the ecosystem'. But are talent and desire enough to measure reliability? What are the skill and desire criteria mentioned when creating this group? Is it the criterion of having a lot of experience or the feedback they have received from their previous coaching? There is incomplete information about them. Because customers need to have efficient and reliable coaching in order to continue coaching and thus contribute to the project's contribution to Cardano. Establishing a coaching group of 150 people is a risk, and when the suitability of people applying for coaching is taken as an evaluation criterion, this number of people turns into a more serious risk. A better source of motivation and solution should be developed on this issue.", "q0r": 4, "q1": "In order to first announce the new coaching system in Cardano, it is necessary to advertise, observe the demand rate and evaluate the observation results. For example; 5 marriage counselors, 16 relationship coaches? How will this team distribution be determined? Perhaps only 1% of clients seek relationship coaching and 55% seek marriage counselling. In this case, an equal distribution of space in coaching may not be necessary for the project. For these questions, perhaps the first step in project implementation should be an ecosystem survey. I suggest that these issues be elaborated as well. ", "q1r": 4, "q2": "In order to create a coaching culture in the Catalyst community, getting references from clients who receive free consultation and presenting them to potential clients is very beneficial for the viability of the project. The transparency of the references received will also contribute to the development of the project. It will also support the submission of project follow-up with the coaching diary.", "q2r": 5, "assessor": "z_assessor_3781", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 14462, "q0": "The proposal provides a tool to track and validate coaching hours to boost engagement and productivity among users. This service allows clients to assess results of their training, which helps alleviate self-hindering causes and reap further benefits from it by persisting with the training. As coaches are usually ones who monitor these results, the fee for coaching is usually high. The proposal intends to offer coaching at a lower fee with the first three hours funded. The utilization of blockchain in this project is that the data recorded every hour will be stored on a blockchain. The proposer should further elaborate the advantages of this recording tool compared to others such as spreadsheets (for ex: the decentralized nature of blockchain technology will allow more transparency among users rather than depending on the provider). The proposer manages to highlight how this adds to the open source of the ecosystem of the Catalyst community, but with attention to confidentiality of the coaching content as a respect for clients’ privacy. This encourages clients to use coaching services run by blockchain technology without the fear of publicity. Overall, the proposal is aligned with the problem. However, it would be more impactful if the proposer could identify a target audience that will be a driving force for the growth of this project as each demographic may require different approaches. The main risks identified are whether the project receives sufficient support from voters and users. The mitigation provided are ATH rooms and shared coaching resources. However, the reasoning for these mitigation measures is not adequate as there lacks tangible proof that shows how people will see value in the coaching and wish for extension. The proposer should do research or provide figure-based findings about clients’ attitudes to ascertain the impact.", "q0r": 3, "q1": "The roadmap is fairly straightforward about what needs to be done. However, it would be more organized if each activity is limited to a more detailed period of time stamps. For example, building the tool and enabling people to book should be broken down into weeks rather than be generalized in the span of Month 1 to 3. This will increase feasibility and credibility in that the proposer has a clear plan of the activities and organized deadlines. Similarly, the budget breakdown could be more detailed in several aspects. Firstly, the expenses for the social media marketing tool should be more clearly explained: what platforms will be used (Facebook, Instagram, Tiktok? Why?) and who will be hired to carry out marketing campaigns (moderators/admins/marketers/content creators) and how is this price divided among human resources and advertisements? The contingency fund costs 2000 USD, which should be analyzed in smaller items. In what situation will this fund be needed and how will it solve the problems that arise (in what way, procedures, what are in this fund). Information about team members is relevant and abundant with linkedin profiles for closer reference. What specific role will the given names take charge of? Answering this will increase feasibility and transparency in terms of operation and technical credentials. The reason for funding in later rounds is reasonable.", "q1r": 3, "q2": "The key metrics provided are clear and valid as the figures will demonstrate the utilization rate of this service, thus determining its growth. The proposer may mention about the tools/apps/engines that are used to keep records of these key metrics for later audit. Success for this project is dependent on clients’ testimonials which is good evidence for auditability. This will be recorded as video which is a straightforward way to keep track of approval rate. However, it is not straightforward in how the tool could be defined as “world-class easy-to-use”. Other metrics such as figures/visual demonstration/client feedback may be needed for this remark to be ascertained.", "q2r": 4, "assessor": "z_assessor_4055", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\n"}, {"id": 15243, "q0": "The idea is good, but it is not very clear how Cardano's technologies would be used here. The proponent says some rather generic phrases like “Build real-world solutions based on the Cardano blockchain”, but doesn't explain how the blockchain would be used here, exactly. It is a dApp to record training hours, provide consulting services for training, validate hours for clients, achieve goals... in short, a series of questions about coaching. The benefits for users are clear: “This proposal will allow many people who want professional coaching to improve the effectiveness and productivity of their teams and their teams”. The benefits for Cardano are not so palpable. For this reason, unfortunately, I'm not so sure that the proposal has a high impact on our ecosystem.", "q0r": 2, "q1": "It is not specified what would happen each month; likewise, we also don't have enough details about each activity so that we can have a clearer understanding of how the project would be built in practice. How would the interface with all its features be created? How would blockchain developers insert decentralized technologies here? The use of funding is also explained in a very basic way. We know how the money would be shared out, but there is no argument for the need for such amounts to be requested from these parties. The professionals involved are presented correctly, that is, in detail. It's super positive how some are very involved with Cardano. For example: DImitri Fernando: ADA General Incumbent on Catalyst Circle V3, Community Advisor on Fund 6 and 7, Veteran Community Advisor on Fund 7, etc etc.", "q1r": 3, "q2": "Some numerical KPIs are suggested: “Number of new customers + Number of customers looking for extensions + Number of hours extended in total + Number of hours extended per customer”, etc. It would be necessary that we also have qualitative data that allow the understanding of the gradual construction of the project. Although the success scenario is well defined (creating a coaching culture within our community, helping its members to experience efficiency and productivity advances through coaching, etc.); it is unclear how this successful scenario will be presented to our community members. It would be necessary that, in a survey, this scenario was unraveled directly for all of us.\n", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15257, "q0": "The proposal would be within the challenge goal, and I think that this proposal probably will increase utility & adoption of Cardano DID.\nThe mission is clear: Build an app to record coaching hours indisputably\nAt the same time the statement of how problem (What applications will provide the most value for end users in 2022?) is to be solved is poorly explained and in my opinion it doesn’t clear how attract people to use DID, for what services? For what benefit?  I don’t understand clearly how this proposal can create  incentive for DID people.\nI think it's important to improve details about the proposal solution scenario for the challenge (eg. Typical services use case for coachers and coached, example benefit for service creator, …).", "q0r": 3, "q1": "The team is well described and the proposer Dimitri Fernando is an active member of Catalyst Community.\nThe scope of the solution is explained (e.g. how the funds will be spent, what features will be implemented, and so on…). There is a too simple cost worksheet, that doesn’t contain all costs (eg. Infrastructure, cloud license, etc.)\nThe plan for implementation could have been a bit more specific, but I think there are other kind of expertise for the project to reach the result, like marketing, communication, sponsorship, community engagement…", "q1r": 4, "q2": "The proposer doesn’t provides a detailed step-by-step plan for the production development with clear milestones and a defined time horizon, so what is the plan forward and roadmap? In my opinion it’s not clear and well detailed what exactly is the problem statement and value of the solution to scale-up the selling and adoption of this device. The proposal  offers a very basic timetable to complete the work. The proposer has not considered challenges and risks relevant to a successful adoption.\nOnly website access in my opinion don’t allow users to identify the proposal success, because I think most important metric is adoption, so not the number of the workshop but the number of users that use the services..", "q2r": 3, "assessor": "z_assessor_2245", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15284, "q0": "This is a proposal by Dimitri Fernando, a Catalyst member with many proposals in every fund including this one, requesting funds to build an app that would be used to track coaching hours. I want to begin this assessment by stating that first of all, the problem statement is flat out incorrect: “There are no coaching resources on Catalyst community and no way to track them”. We have the Catalyst school which hosts almost weekly coaching sessions on various subjects, including how to be a PA and vPA. Second, I need to mention that this proposal is almost identical to another one that Dimitri made, where he asked for 36000 USD to basically become a coach in the community (but without providing any credentials or information to prove that he has competency in any particular domain): https://cardano.ideascale.com/c/idea/417282. Furthermore, even though the solution summary in the current proposal states that the intent is to use the funds to build an app, the detailed solution below contains the following: “I will provide 300 hours of coaching for 100 people at the rate of 3 hour each. Since the first three hours is funded, the clients wont have to pay. They can opt to continue coaching at the same rate or an agreed rate.”. This is copied from the other proposal I mentioned and makes no sense to be present here, if the claim is that these funds will be used to create an app.\nThe risks section is completely identical to the other proposal and makes no sense. None of the risks listed are related to the creation of an app, nor are ways to mitigate them provided.\nDue to the incoherence of the plan and its lack of information, I completely disagree that this proposal effectively addresses the challenge. Score: 1.", "q0r": 1, "q1": "The detailed plan is completely identical to the one in the previous proposal as well, which means that it does not speak at all about creating an app, but rather about how Dimitri intends to get people to join coaching sessions he would organize (which I analyzed in my assessment for the other proposal). The requested budget of 19000 USD is broken down very poorly, with an estimation of 150 dev hours being needed for this app, at a rate of 80 USD. I have worked for 8 years building and delivering software and no one in the industry is building a fully fledged app in 150 hours. These projects take months, with whole teams of people, whereas Dimitri only provided information for 3: himself (he has no programming experience), a person called Uditha Bandara (https://www.linkedin.com/in/udithabandara) who their LinkedIn profile shows to be a consultant and another person called Risantha Welikadage (https://www.linkedin.com/mwlite/in/daforce). Dimitri claims this person worked in the logistics industry, as a hardware technician for the Minnesota USA state government, as an entrepreneur and more. They do seem to have held a position there as a lab aide who also helped with IT support, but I fail to see how that experience fits with building a mobile app from scratch. The other items in the budget breakdown is 5000 USD for marketing and 2000 USD as contingency. No more details provided who will take care of marketing and what the strategy will be.\nAs I mentioned above, this plan does not actually describe how to build a mobile app, so I completely disagree that the proposal can be implemented successfully. Score: 1.", "q1r": 1, "q2": "The auditability section as well is copied from Dimitri’s other proposal completely, the only difference being this line was added as well: “Number of records on the app”. That is the only line pertaining to the creation of the app that he mentioned. All the other metrics, both for success and for progress, aside from not actually being useful (I will not repeat the reasons why, I already detailed that in the other assessment - the essence of it is that they do not set clear targets and hence cannot properly be used to indicate progress / success), are geared towards Dimitri becoming a coach.\nFor all of these reasons, I completely disagree that the information provided here is sufficient to audit the progress and success of this proposal. Score: 1.\nDimitri, if you are reading this I would like to kindly ask you to be more serious with your proposals. It is disrespectful to other proposers to take up PA, vPA and voter time by copy pasting the entire content of a proposal into another in this manner. Good luck in the future.", "q2r": 1, "assessor": "z_assessor_2335", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Build an app to record coaching hours indisputably. This can be used for all consulting service providers like coaches, mentors, doctors", "experience": "Coaching for 30 years informally. Coaching formally with ICF training for last 6 months. Some categories - Life , Business, Executive, Leadership, Strengths, Parenting, Relationship. Any coaching received will increase the productivity of the client , add value to Catalyst"}