{"id": 417305, "author": "dimitri777", "title": "Impact Creating NFTs for Causes", "url": "https://cardano.ideascale.com/a/dtd/417305-48088", "category": 26595, "amount": 48700, "description": "There is no NFT marketplace dedicated to NFTs with Social and Environmental Impacts. Socially, Conscious creators have no dedicated market", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1120, "q0": "This proposal is a wonderful concept - create a NFT marketplace dedicated to help charitable, environmental and social causes while promoting artists willing to share a percentage of their creations in this manner. Currently no such NFT marketplace exists. Artist will be able select which causes they wish to support with their art and buyers can invest in NFTs (art, music, poetry, etc...) knowing that with each purchase they are also contributing to a charitable cause.\n\nSocial, environmental and charitable organizations will receive a designated revenue on every transaction. They can also feature their favorite content creators on their own sites to encourage donations to their cause through NFT purchases and even launch their own NFT collections. Because of blockchain technology, the NFT marketplace offers a way to establish transparency and trackability to donations towards any social service project.\n\nThe proposal lists the benefits to the artists/content creators, the buyers and charitable organizations. It is in line with this particular challenge by bringing more adoption in a creative way to the Cardano ecosystem. It will provide incentive and added sentiment to NFT purchasers, create cooperation between artists and charitable organizations, and onboard these organizations who may not have heard or seen a need for blockchain technology before.\n\nThe proposers will also partner with Block Carbon (previously funded proposer) to calculate carbon offsets for each project and sell the resulting Carbon Credits.", "q0r": 5, "q1": "The presenter has laid down a detail plan to implement the project in three phases of 3 months each. The first phase is the creation and testing of the NFT marketplace. The second phase is marketing, and the third phase is dedicated to administration and client services. \n\nA comprehensive budget is given and broken down for the different phases and work needed for the completion of the project. It seems reasonable but I do have a question regarding the $8,000 dedicated to creating a video documentary on how the entire process was done. Although it would be informative to have a video progress report, I do not however think it is necessary for the project's success. It is almost like a separate project in itself, and uses a large chunk of the budget, this is why I am giving 4 stars for feasibility. I would also suggest the team consider talking with existing Cardano NFT marketplaces and see if any of them are willing to create a whitelabeled marketplace.\n \nThe team consist of experienced members that can undoubtedly see this project through with backgrounds in Cardano, AI, blockchain, software development, logistics, team leadership, business, marketing, content creation, project management, social service, philanthropy, volunteering, amongst much more.", "q1r": 4, "q2": "Once the NFT marketplace has been created, then the KPIs can easily be audited and measured by the number of causes, content creators and clients onboarded. Statistics like number of NFTs created per month and number of NFTs per cause will also be available.\nHowever I am giving 4 stars for the auditability of this project as there is nothing in place to follow the progress of the project before it becomes active. Perhaps the presenters could create a page that will provide updates on the progression of the project during the first phase and the marketing phase (for example, where and when it was advertised).\n\nAs an artist myself, and having volunteered my time for many charitable projects,I would love to see this proposal manifest. It has a lot of potential to help artists and altruistic organizations alike. Good luck!", "q2r": 4, "assessor": "z_assessor_2207", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n\nThanks for the wishes"}, {"id": 2816, "q0": "The idea of ​​the proposal wants to diversify the art of NFT, by creating a market for NFT transactions with images or videos related to social work contents such as charity, environmental protection. In this way, the proposed team wants to gradually bring in socially valuable NFT assets, rather than the current artistic NFT assets.\n by creating a market with target customers including: companies, NGOs interested in social work related matters. identified groups for 4 community groups that will benefit from this idea include ;\n- content creators,\n- buyers of NFT assets, used for their advertising communication activities,\n- the group of people who will benefit from the activity of the content creator group,\n- community in Blockchain platform,\nalong with that examples and target customers for the output of this product are well defined. along with that the arguments about the solution of the group are reasonable and easy to understand, with explanations and examples attached.\nIn addition, the team raised a lot of problems when implementing the project, but all are planned and have solutions to optimize them.\nThus, based on the content and examples, the proposal will effectively solve the challenge.", "q0r": 5, "q1": "The implementation plan of this proposal announced by the team will be completed in 3 months, the timelines are established for each month, and the implementation contents for each of the defined milestones are published in great detail.\n however, the group budget can be analyzed more specifically for the expenditure; $24,200, for NFT market development content, for example the group should if clear the \"NFT-based system to tag each NFT with a specific cause.\" how many technical hours will it take to complete and how many dollars per hour, the same goes for smart contract creation. needed if it is clear will ensure more financial transparency, and easier to audit for the community.\nHowever, the proposed team information is very detailed and meticulous for each member, and specifically assigns work in accordance with each member's experience.\nBased on that, this proposal with certain plans is most likely to succeed, but it still needs a little more detail in the budget part to be more perfect.", "q1r": 4, "q2": "The proposed team has provided a lot of indicators to track the workload during the project implementation, even though it is possible to track the work contents based on the NFTs, this is still not enough to satisfy the requirements. satisfactory for the community audit, so the team should make statements that support the community by aggregating the number of NFTs that have been made available to the market and periodically reporting on any platform. which are the most popular, to satisfy the community that can easily track and verify them.\nThe success of the proposal has been determined and the group of people who will benefit from the proposal, I stated in transparency.\nso apart from the need to supplement the completed proposal workload reports to the community, it's all easy to track and verify the success of this proposal.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide."}, {"id": 4747, "q0": "The team came up with a very good idea, this project fits the goal of the challenge. Create a system for creators to designate their favorite social and environmental causes to receive a certain amount of revenue per transaction, the problem of the proposal has been clearly identified. so the proposal can scale to solve future challenges as well as grow the Cardano ecosystem. Talking about the proposed solution has been explained the problem situations as well. create a system through which creators can designate their favorite social , environmental or charitable activities so that they receive a specified amount of revenue per transaction . create a system that can establish traceability and auditability transparency using blockchain. describes how the solution would solve the challenge , this proposal would allow many people who want to support NFT creators by purchasing their work and helping to find new clients . . Talking about risks that can prevent successful implementation, the team outlined potential problems encountered during development, and also offered mitigation options for the project to overcome challenges. The proposal talks about the impact very well. I believe what the team stated above. thank you", "q0r": 5, "q1": "The proposed roadmap has given a timeline, the milestones are reasonable to complete the proposed work, the goals have been specific for each part, the team tells us what will happen next. occurred during the month , progress was easily checked by the community , knew what projects were done first and what problems were solved , found that the roadmap was laid out very well and in detail for each part . Talking about the required budget in the amount of $48,700, this amount is quite suitable for the value of the project as well as the work schedule of the senior experts, the amount has been broken down into each part of the work. What is the money used for? how much does it cost  ? What's even more amazing is that the project owner has provided a budget backup that is rarely seen in other proposals, I like the presentation of the team's budget. Talking about the project team, the individual people working on the project have been mentioned, information related to the work, work experience attached, there is a linkedin link to the personal page, to verify the information. authentic information, thereby knowing the information described so that the community trusts the team more to complete the project. Personally, I find the feasibility of this proposal good. I believe the project is successful . good luck for the proposal", "q1r": 5, "q2": "Proposal has been reasonably controlled for the process and very much for the outcome , defined indicators such as , the number of built-in Cause can be tracked by the NFT having a unique identifier for the Cause , the number of referred clients , the number of NFTs generated per month , and so on . thereby seeing the team let the community know how to track the progress of this project. talk about the success of the project described the results clearly , the success is related to campaign challenges such as the NFT transparency check and tracking system and the reputation system for the Cause , People creativity and customers. many new NFT categories are created. create an open source tool where the team can offer software as a service to other NGOs that want to track transparency . Because this is a new project the community considers the evaluation to the perfect project and possible funding. I personally see this project's potential and trust the team of this project. thanks and good luck", "q2r": 5, "assessor": "z_assessor_2615", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide."}, {"id": 8326, "q0": "This project suggested a new system related to social, and environmental impacts. It creates a marketplace for creators who want to share their creations with the ones who need and help their social, environmental, and charitable causes. Therefore, it could be seen that in terms of the field of this project, this project is totally aligned with the types of proposals that this challenge is looking for. That are solutions that help to solve environmental issues. It listed the problem now is that NFTs are mainly based on artwork and there is a whole lot of creativity that is still not fully exploited to bring into NFT space. And this solution suggested a solution that can improve that point. The proposal clearly mentioned how the system works. One good point about this proposal is that it explained the benefit that all related parties will receive and especially how it will benefit the blockchain community as well. Because this project is related to the environment, people will be encouraged to possess meaningful NFTs and ultimately increase the number of people joining the blockchain ecosystem. Especially, it explained how this project will have a certain impact specifically on the whole development of the Cardano ecosystem as well. Thanks to the huge publicity for the Cardano blockchain on social media, more people will know about the Cardano ecosystem and raise awareness of how beneficial this ecosystem is. From that, more people may get involved. It also listed the criteria to measure the impact of this project, but it should add specific figures so that it could be clearer and more measureable. It listed two main challenges when it comes to executing this project. The first one is related to Covid making it impossible for content creators to go to their studios and do the content creation. The second one is related to the volatility of ADA may lead to a shortage of budget due to the rapid decrease of ADA value and also the time to convert ADA into local currencies is long leading to the late implementation of the project. For each problem. the proposal did suggest some solutions to overcome so it could be trusted that the project may proceed without fail.", "q0r": 5, "q1": "In terms of the plan, it was given quite well. The plan was divided into three months and a description of what to do in each month was given. However, it would be better if more detail on how things should be done each month, then it would be clearer to visualize and understand. Having said that, this plan was supported by some requirements needed and some requirements that are not compulsory to have in terms of functions of the system when executing this plan. This is a good point to see just like the result for the plan that it should achieve. Another good point is here that it also included a marketing plan for this project. This will create a better trust for people to believe in the feasibility of this project as people can see how everything will be operated including how this project will be advertised to reach a wider audience choosing to use this system.About the cost, it was given in great detail. How each amount of funding would be used and how these cost breakdowns were calculated were mentioned clearly. Everything seems to be quite transparent for people to track and trace the finance of this project. Regarding human resources, the description of some core members was given with a lot of information related to their background and relevant experience which is beneficial for executing this project successfully.", "q1r": 4, "q2": "With regard to how to audit this project, it clearly showed how to track the number of clients using this system per cause, per month, onboarded, and the number of NFTs sold. Therefore, it could be auditable for this project. However, it should include the KPI number for each criterion when tracking the progress. For example, it should determined the number of NFTs sold in each month so that people could really evaluate in this period, the project is in a good progress or not. About how this project is considered to be successful, the proposal did list the general description of the success of this project and then give a specific number to achieve for some criteria such as the number of creators joining, the number of clients onboarded.", "q2r": 4, "assessor": "z_assessor_2975", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide."}, {"id": 8747, "q0": "Your suggestion is very well done. Problems are explained in great detail. The solution described is extremely specific. How you create a system is described in the proposal. The market platforms are diverse (artwork, music, poetry NFTs, sport,...). The proposal also mentions the benefits and values ​​of this project. According to the information you shared, the proposal completely meets the goal of the challenge. It will add value to the Cardano Ecosystem. Stakeholders such as content creators or purchasers and the Blockchain community all benefit. Of course, along with the positive effects, there will be risks. Some risks of the project have been mentioned. At the same time, mitigation measures have also been given. I can see your thorough preparation through this proposal. This presentation deserves 5*.", "q0r": 5, "q1": "Your presentation is full of information. Firstly, you showed us a pretty complete roadmap. The project is expected to be implemented in 3 months. The activities for each month are listed in detail. Besides that, you also mentioned functional and non-functional requirements. A massive marketing plan was also designed. Regarding the budget, all information is declared transparently. The 5 key members introduced in the proposal have excellent profiles. I believe they will lead the project to success. At the same time, I also believe in the feasibility of this project. This will be a potential project.", "q1r": 5, "q2": "In this section, you've provided project progress metrics and how to measure them. Next, I see you mentioned the challenges and risks relevant to a successful implementation and how the proposer plans to deal with these difficulties. This is also a very important item, however, it would be better if it was in the IMPACT section. You should arrange the position of the information more logically. The proposal also does not specify where and how you will report and publicize the progress of the project. At the end of the proposal, the success of the project was described. Specific numbers are also provided. This makes the project much more convincing. Overall, your audit is done quite well, there is only one minus point as I said above.", "q2r": 4, "assessor": "z_assessor_2997", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide."}], "solution": "Create a system for creators to designate their favorite social, enviro causes to receive an amount of their revenue on a transaction.", "experience": "I have been involved in social service projects of all sorts for over 36 years, Have been on planning committees and packing teams for distributing dry rations, clothing, medicines, for natural disasters ,in the tsunami as well as lockdowns. Also painting of hospitals regularly"}