{"id": 417309, "author": "dimitri777", "title": "Find your Way Route Optimizer App", "url": "https://cardano.ideascale.com/a/dtd/417309-48088", "category": 26595, "amount": 44900, "description": "Complex route planning , optimization to minimize costs of vehicles picking up from multiple locations and delivering to beneficiaries.", "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"id": 1288, "q0": "The proposal is identifying a problem within Sri-Lanka, that much food is being thrown away, and instead it can be donated to those who can not afford it, or need it. The solution is to develop an application where restaurants, beneficiaries or drivers would meet and at the same time, the app would have AI that would decide the best route, storage of food etc. The impact on Cardano is seen that every restaurant that will join this app, will also join a facebook page “Five Loaves Two Fish” and basically because IOHK/Cardano funded this app, the proposer expect the rise of the community numbers. So to sum it up, the idea is to develop app -> say it was funded by cardano -> delegation/blockchain users will rise. To be honest, even tough it is a noble idea, there is no supporting information to confirm this statement, also, why would the delegation rise since the goal is to help the poor? The proposer states many benefits for the environment, the poor, restarurants or stakeholders, but neither of these is having a direct impact on the challenge goal – to drive Cardano adoption. There is one mention about NFTs in the impact section which is decreasing the overall clarity of the proposal, and regarding NFTs – there is no information why would these be interesting for buyers/sellers, and since it appears that these will be minted by the proposer, it would be nice to state where the proceedings from sales would go. ", "q0r": 1, "q1": "The roadmap is set to three months, whilist the first month is devoted to construct the vehicle for transport, during second month to finish NFT and AI app, and during the month 3 – testing and data analysis. The requested budget is 44900, whereas 27900 is for app development – 2 devs, FTE, 70 usd/hour, another UI/UX dev and quality assurance dev. These rates and detail is sufficient for app development. Other items on the budget – social media campaign for 4k and administration and management for 9k – I am missing the same level of detail e.g. What is the time donation? What will be their activities + hourly rate?  The team is currently consisting from 5 people, and another approx. 10 people to be hired. The current team members seems to have relevant skills, and linked in profiles are also provided, and even tough that there are still many people to be hired, the plan seems logical and reasonable. ", "q1r": 5, "q2": "The proposal states that the progress of the proposal can be tracked via APP, and number of NFTs generated. I am not sure whether it is not success metrics, because for tracking the progress I would imagine something like – weekly/bi-weekly posts, blogs whereas hiring was successful, or development of app is proceeding from one stage to another, alpha, beta version of the app, testing and such. The stated progress metrics are already jumping from no-app to tracking-app phase, so the progress is not possible to track with the stated progress KPIs. For the success, the numbers that display adoption are useful – users, food deliveries, and growth in numbers by time. The stated success metrics such as “ability to xxx” is not a reliable trackable metric. I am keeping the score full, because even that the proposal is not containing logical progress/success KPIs, I believe that these can be easily implemented based on suggestions. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 1539, "q0": "This is overall a good proposal and it can be seen that a lot of effort has been put into it. Food waste is definetely a problem and trying to devise strategies to solve the problem is something that is definetely impactful and for a good cause. It can also be seen that the proposers have put some efforts in pointing out how to adress Cardanos mission with their proposal. One thing still bothers me: In my opinion the use of resources (namely money, development time and calculation power) is a bit inefficient here. I've been voluntarily working for a anti-foodwaste-organisation called foodsharing for several years now (you can check out the homepage foodsharing.de unfortunately it's in german though) where the collection and distribution of food is managed by thousands of volunteers on an easy-to-use basis and everything works out just fine in a scalable manner (minus the route optimisation, but you could manage a task like this far easier with linear programming/lexicographic optimisation methods/sorting algorithms without the need for programming an entire AI).", "q0r": 4, "q1": "The overall implementation plan is mostly fine expect for the actual development task which could be a lot more fine-grained, otherwise the idea that you only have an idea rather than a concept of how the app should be devised. Apart from that, the team is transparent about themselves and have a lot of information about themselves and their initiative shared that seems credible. The risk-mitigation section is very detailed, which is good. Another grain of salt however is that the budget is not very fine-grained, putting a lot of money in a task that can be done on a fraction of that amount and also, for a welfare-oriented project that depends on funds the rates for the programmers etc. are excessively high while the proposers don't plan to pay any money for the volunteers.", "q1r": 3, "q2": "Yes, the proposal is indeed auditable. The deliverable has been described in detail, a roadmap encompasses a lot of auditable items (expect for the actual coding process which is not defined that well unfortunately) and the success metrics/KPIs are appropriate and can be used to audit the success of the project. How about, however, providing some platform link like your github to enable voters and PAs to see a proof of your past work and to also track the progress of your ongoing project?", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 4037, "q0": "This is a creative solution with real social value. The idea is to connect those with excess food (about to be thrown away) to those who lack it and are suffering from hunger. If implemented and appropriately marketed this will create a positive impact for the community and to the Cardano image overall. With the development of the dApp it will be easier to choose the best routes and save time and resources in delivering those foods. Also, the solution will collect a bunch of information such as location and recipients’ characteristics such as age to feed to the AI. In turn it will be able to decide the best way to store the food, when it should be consumed and when it should be delivered for best results. The goals align with the challenge settings and the project has the potential to add value to the Cardano ecosystem.", "q0r": 5, "q1": "The team is composed by Dimitri, Uditha, Rishantha, Chamarie and Saman among others that will be needed to implement the proposal. All of these listed have relevant experiences and are backed by LinkedIn or Facebook links where we can find more information about them. When describing who is participating, they have demonstrated they know in an identifiable manner how many and each type of member that will be needed. For instance, besides those previously mentioned they also state they will need four people to handle food pickup and delivery. The budget is clear and broken down into identifiable items. The development part which accounts for USD 27,900 of the total is further broken down and its estimation is clearly explained. Also, the timetable provided is realistic and the project should last around three months. Finally, the proposer has discussed a lot of potential risks such as covid lockdowns, increasing fuel prices and ADA price volatility. Nevertheless, they have also proposed mitigating solutions such as a contingency funds to prevent problems from prices volatility.", "q1r": 5, "q2": "The roadmap provided is detailed and has clear milestones. The team not only states what they will done but also how they will do it. For instance, to put operations in place in the beginning they will hire two to four staff and get in touch with the beneficiary locations as soon as possible. The metrics defined are precise and well-thought. Some of them are number of food packs distributed per day, number of private, household and corporate donors per month, number of NFTs generated upon pickup and number of NFTs generated on sale. All in all, this is a great effective solution to the problem of hunger and it is very rewarding to see this is made easier with the help of Cardano. This creates goodwill that can be leveraged by the community to attract even more users to the network. Sadly, they have not mentioned how they will update the community regarding the plan's progress which is a downside for auditability.", "q2r": 4, "assessor": "z_assessor_2513", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 5889, "q0": "This proposal has very high humanistic significance. It Creates a real time route optimization system by which any food pickup and drop off at beneficiary location is done with minimal cost and time. As a result, food can be delivered to the most disadvantaged people in the fastest and most economical way. In addition, this project also helps to reduce waste, reduce CO2, mitigate climate change, contributing to building a real-world solution based on the Cardano blockchain. With the above reasons, I firmly believe that this project will effectively solve the challenges posed.", "q0r": 5, "q1": "Based on the team information, I see that you have a strong team. They have full knowledge, skills and experience in many fields such as: social, business, application development, operating, ... . Each person has their own forte, their own strengths, they combine to form a perfect, strong team. In addition, their Linkedin profile links are also provided. This adds transparency to the above information. As you know, the team is an indispensable factor in determining the success of a project. In this section, you did a great job, you have a capable team.\nA detailed roadmap has been provided, you have identified the tasks to be done and distributed them to specific milestones. Since this proposal is linked to a few other proposals in fun9, their roadmap is quite similar. This is understandable. The budget part has been calculated specifically. However, there are still some ambiguities, I think I should add a Budget Breakdown section: how many people will do the social media work, how many hours will work, how much money per hour? In addition, I would like to give you a compliment for identifying the criteria to evaluate success and how to minimize the risks and challenges that will be encountered. This is essential, it helps the project develop in the long run, makes it easy for PAs to monitor and evaluate.", "q1r": 4, "q2": "This project means a lot. It benefits many stakeholders. I myself am a person who regularly participates in charity activities, I am very interested in this project. It not only improves the lives of disadvantaged people, but has a great impact on the environment. Besides, it creates a real-world solution based on cardano blockchain, boosting the number of people participating in cardano, making the ecosystem grow more and more. In addition to the issues that I mentioned earlier, the information provided is relatively complete, people can rely on it to evaluate. Personally, I fully believe in the success of this project. Thank you for the great suggestion!", "q2r": 4, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 9337, "q0": "Oh I really like your project idea. It is actually very useful and helps reduce the amount of waste in landfills reducing CO2 emissions. This is a project to avoid a food waste. I really want to say thank you for your project because if it is done, it will help children in children's homes, orphans, people without a mother in the house, the elderly in the family, the mentally and physically disabled people living in homes and similar facilities, addicts in rehab facilities, slum dwellers, street dwellers, homeless people, beggars get food to eat while it still tastes good and doesn't go to waste in the trash.\n", "q0r": 5, "q1": "\"From my point of view, I see that the group already has members above who have certain experience in their field. Furthermore, I find that the project has a moderate goal of bringing 1-3 houses. With that kind of care, more restaurants can join the network to start receiving daily food once Canopy is complete, and then if more restaurants join, further testing can be carried out to create more load on the system. , I appreciate the success of the proposal.\nWith the great values ​​that the project brings, I hope the project will continue to develop on a larger scale in the future, be able to attract more resources from the community and individuals, find more investors. cooperative stores as well as event places, convenience stores, supermarkets cooperate with you to create good value.\"", "q1r": 5, "q2": "In the proposal I see you have given specific criteria listed and yet no specific numbers. In addition, track your progress by streaming directly from your mobile phone to Youtube or Facebook (with additional funding). I see in the proposal mentioned so. There is generally a need for a clear measure to provide a high level of transparency for ongoing development. Scheduled weekly team meetings provide additional assurance in project execution on target.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}, {"id": 13466, "q0": "Complex route planning, optimized to minimize the cost of pick-ups from multiple locations and deliver to beneficiaries is the issue to be tackled in this challenge, and it is directly related to the current challenge. The author has proposed a solution to this problem by creating a system for employees to collect food and distribute it to beneficiaries, minimizing the cost and time of the process, using an optimized application. route. Here's how the author tackles the problem above it in line with the current challenge. The author also outlined the risks they might take in taking on this challenge as: the risk of identifying the various undefined variables at the time of proposal and including them in the AI ​​to give Allowing it to make decisions, Covid-related lockdown risks will limit food distribution, fuel price risks. These are the risks that the author anticipated, but they also have a way to deal with these risks. This proposal can scale to solve future challenges it helps more people to know Cardano.", "q0r": 5, "q1": "The timeline listed by the author is clearly suitable for carrying out this project. The goals are specifically listed by the author. The progress of the project is easy to track through the indicators listed by the author: in terms of the number of restaurants referred, the number of food packages collected for each restaurant per day, the number of food packages distributed distribution per day, the number of unexpected pick-ups and drop-offs, the number of businesses that donate food from the participating functions, the number of individuals who donate food from the participating functions. These are the indicators that the author has listed. Through these indicators, the author is very enthusiastic about this project. The solution of this problem will enable rapid, systematic, lowest cost capability by optimizing route planning and minimizing time and costs such as staff and fuel consumption for food collection, and discern what goes to beneficiaries and distributes each day and night. It can also be replicated in any situation involving the provision of goods or services. The success of the project is also clearly listed by the author as to what will be achieved. The success indicators are clearly listed by the author in the challenge and it fits the issue perfectly.", "q1r": 5, "q2": "Well defined KPI determines the success of the proposal through the number of views, some followers, shares... the author gives great ideas that it effectively tackles the challenge. This is a powerful team with many members joining the team who have many years of experience in many different fields suitable for this job. Dating are: DImitri Fernando, Uditha Bandara, Rishantha Welikadage, Chamarie Ranasinghe, DM Saman Chandana... and some of the supporting staff on this project. The group is also listed by the author with personal links so that good followers know who they are and what they do. This proposal's funding budget is $44,900 less than 20% of the entire challenge's budget. The budget is detailed by the author that needs to be spent in accordance with this challenge.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "\nThis is a good and fair assessment. You have studied the proposal and gone into detail as required by the PA Guide.\n"}], "solution": "Create a system so staff collects food and distribute to beneficiaries, minimize costs/time of the process, using a route optimization app", "experience": "I've managed social projects over 36 years, Have been on planning committees and packing teams for distributing dry rations for various natural disasters and in the 2004 tsunami as well as recent lockdowns. I got a pass to carry out distribution of food during lockdown"}