{"id": 417652, "author": "cerpofficial", "title": "Cardano ERP - Main Project", "url": "https://cardano.ideascale.com/a/dtd/417652-48088", "category": 26595, "amount": 491400, "description": "There is no intelligent, open-source, Cardano-native ERP system to provide for seamless integration of, and optimized standard user experience for, business, enterprise, and government focused dApps.", "f6_no_assessments": 6, "f6_rating": 3.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 14919, "q0": "This proposal of the team has hit the nail on the head of the current problems for the whole Cardano community and those who embrace the growth of this ecosystem. The purpose of this proposal is to create and implement the Cardano ERP, as they referred an intelligent, robust, open-source, multi-national, enterprise and government-appropriate Tier 3 system that will seamlessly integrate all business and government-related transactions and reporting between modular dApps. With such an advance in the development in this Tier 3 system, there is no doubt that mass adoption by businesses and government would be inescapable. However, other ecosystems have also implemented or commenced similar technologies such as NEO 3.0 (you can look up NEO’s ecosystem and develop teams for more information). In my opinion, a product needs more than just rationally function as an antidote for the market’s need urgent to accomplish the state as the team mentioned “Mass adoption”. In the question of what are the team’s hindrances, poaching of core team members is a status-quo in this domain and I can see that the scheme on which the team will base to take action is considerably efficient. But I have to remind the team, that those have talented sometimes solely see wages as just a nagging, working environment, and attitude towards them will play a vital part in keeping them in place. Last but not least, we all know for a system to be treated as renowned and well-function needs lots of time and money, these are the obstacles every team has to encounter in this field but you guys can’t last until then without an organized and clear scheme of time and money it will consume. Therefore, the team might want to provide investors with a glimpse of a profound plan about what the team will do with the money being funded. The impact of this supposition as my concern is tremendous but there remains some lack of clarifications to get 5 points in impact, as that being said, my score given to the team is 4.", "q0r": 4, "q1": "Unfortunately, the proposal fails to present not only the description of the team's skills and experience but also the reference to verify them. As part of the budget, they propose to hire people with relevant skills, but I would recommend to the team that at least one core team member should have a technical background. Budget-wise, practically the entire amount requested is intended for payment of professional hours, and in comparison, with other proposals within this challenge, the costs per hour are considered reasonable. Except for the expenses for legal and accounting, the team should be spending more expenses on that if they want the best services for the foundation. Therefore, I would also recommend that the proposer present the criteria used for cost allocation. the author of this proposal states that they would utilize an innovation stake-to-subscribe revenue model, and the team has to requestion for allowance to implement so to avoid further troubles. For future catalyst cycles, I recommend the team to take into consideration to provide a clear statement that these concerns were considered.", "q1r": 3, "q2": "With the metrics and outcomes proposed by the writer, we can see a considerable increase in the newcomers into the network. But, there are no KPIs that the proposal provides to understand how effective this project, in particular, has played a part in it. Also, they have a misconception about the audibility of the Impact category, this term state how success can be measured in the monetary system, not anything else assuming it will be a remarkable idea. There are no well-laid-out milestones for the auditors to track the progress and also unrealistic thresholds to measure the timely utilization of funds and their return on investment. A moderate amount of effort into laying down some plausible figures the auditors could use will make the proposal more practical and understandable. The team also makes no mention of its constituent members for the community to predict the outcomes of this project based on prior contributions to the ecosystem. And I may make some personal statements about the SDG, but those goals should be considered regularities, not something to be layout as pellicular or KPIs. Therefore, the score for this proposal’s Auditability is 2.", "q2r": 2, "assessor": "z_assessor_4112", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 6678, "q0": "The value proposition behind this proposal is to develop an open source Cardano-native accounting system, that allows for an efficient tracking, reporting and auditing funded projects. I believe there is a poor fit between the proposal and the existing challenge, and I shall bring forth two main arguments. Here they are. \n\nFirst, for me it is not clear what advantages such a system would bring, compared to classical accounting systems. My background includes accounting / financial matters, and I can’t really be accused of not being knowledgeable with the subject. I am however at a loss when trying to imagine the features and benefits of a Cardano - native, or rather any blockchain - native accounting system. What would such an accounting system have on top of a regular one, will it be on-chain, will it provide cryptographic proofs of entries performed, or generally how will it differentiate itself from any other accounting system? The proposal does not shed any light on these topics, it only states that “we will scope the needs of stakeholders, then architect and deliver an MVP which meets scoped needs”. This is a clear case when the proposers’ level of understanding of stakeholders’s needs is still incipient, and a much better understanding of the needs has to be gained before proposing such an undertaking.\n\nSecond, accounting systems are by definition country / regime specific. Each institution has to obey a certain framework when doing its books, be it US GAAP / IFRS standards for large institutions, or simply the country-specific accounting / tax rules from the place it resides, in case of small and medium enterprises. How would a Cardano native system account for all of this, will it have country-specific modules, will it be fully customisable? Will you be able to change accounting practices, tax brackets, VAT systems, amortization schedules? Again, the proposal stays silent and there is no meaningful information regarding these aspects. \n\nConsidering all of the above, and taking into account the many questions unanswered with regards to the value proposition, I have to maintain a slightly negative stance towards this proposa’s impact. ", "q0r": 2, "q1": "I see a rather poor feasibility for this project. First, there are major red flags with regards to the team’s description. The proposer states that the team members are experienced, and we are being asked to go through the resumes posted on their website in order to have more details. When doing this, I was very surprised, and not in a good way, to see that although there are quite a few resumes posted there (five), their quality is simply very very poor. All the names are anonymised with black markers (so you can’t really know the names of team members!) and the information within all of them is again unclear, ineligible, the formats are all different, they look like they have been scanned with very old equipment, and the information within is likewise. Very bizarre names of companies, awkward backgrounds and universities and little information that you can actually verify. Of course we are not being provided with any linkedin links or other references. I hate to be judgemental, but this is a major red flag for me, that in an open, decentralized system, a team chooses this anonymization path. \n\nIn a similar fashion, we are not offered any kind of information with regards to the timeline or the budget. For the budget we are only informed that the project would require 1.000 hours to complete, at an hourly rate of 50 USD/hour, with a very vague split between tasks. There are other captions in the budget, but somehow it all seems very artificially built and i don’t consider it as a trusted source to assess the project’s viability, since you can hardly make any connections between the budget and the timeline. \n\nTimewise, the project would take five months to be complete, but given the poor level of detail the deadlines should be taken with a heavy grain of salt. For an excellent proposal I would have expected to see: \n\n- full names for the team and appropriate resumes\n- a better level of detail with regards to the product. How can the product be planned, designed and built in only one month? What will be the split of hours between the phases of the project, and how will quality be measured?\n- a pre-existing github library with past projects would be very useful.", "q1r": 2, "q2": "A fairly decent, but not perfect, level of detail is present within all the auditability sections, with a few sets of performance indicators to follow: number of developers using the tool, complexity of the transactions processed. For an excellent proposal I would have expected to see: \n\n- full transparency of the team behind the proposal\n- already opened communication channels: Discord, Telegram, Twitter\n- a commitment to open-source development\n- a commitment to have at least monthly development reports and regular AMA sessions \n- a pledge to participate in weekly town halls and organize break-out rooms\n\nLacking any of these items, I can only be neutral towards the auditability prospects of this proposal. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8127, "q0": "Blockchain is gradually being applied to Enterprise, Industry, and Government. ERP is considered the most successful business and government solution in the world today. The integration of blockchain technology with the ERP system will be very promising. The author raises an important issue: \"There is no smart, open-source Cardano native ERP system to provide for seamless integration and optimized user experience as standard for centralized dApps. focus on business and government\". I find that the proposal meets the challenge requirement because it creates a Dapp on top of the Cardano ecosystem that solves all of those problems. In addition, the project will attract more open source ERP developer communities to Cardano to build, integrate and develop their products. That will attract more users and accelerate the growth of Cardano.\nAt the same time, I think the project's impact scale is relatively large. Enterprise systems software is a multi-billion dollar industry that produces components supporting various business functions. Occupying a crucial role for large, medium, and small enterprises. While in the world today, the number of large, medium and small enterprises is vast. So I see the development potential of the project.\nThe main risks when implementing the project proposed by the author are the poaching of core team members or not having enough funding. The team has also foreseen the risks and has appropriate solutions to minimize these risks.", "q0r": 5, "q1": "The proponent provided a project roadmap with specific timelines and clear goals. The plan will be implemented in 5 months. They have also offered a whitepaper on the project's website for the community to find information easily.\nThe project's budget accounts for 6.26% of the total Challenge budget. I think this budget has been detailed and well calculated. This budget is allocated into small amounts corresponding to the expenses. These expenses are averaged monthly and calculated for 5 months according to the project's roadmap.\nIn this proposal, the author described the information of the two core members, the founder, and the project director. They all have decades of extensive experience in consulting and general development for ERP systems. I found that their expertise and competence matched the goal of the challenge. The author provides the members' CVs on the project's website. In this Fund 9, the team has four topics for Catalyst. I would like to commend the team for contributing many new ideas to Cardano. However, this is also a challenge in terms of work management and time management. If all projects are funded, which one will the team prioritize, or do they have a plan for this?", "q1r": 4, "q2": "The author provides many metrics to track the progress of the project. These metrics are all easy to measure and check. However, this is an entirely new project, so my opinion is that the team should have a plan to update information and progress of the project on communication channels (Github, Youtube, Twitter....) or website official project to both increase transparency and increase interaction with the community. In addition, the community will have positive feedback and contributions to the project. \nThe project's success is easily determined when they achieve the set KPI goals. In addition, the development and use of CERP and its modular dApps ecosystem will create millions of new jobs and opportunities for billions of people worldwide, especially in developing countries.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 13468, "q0": "To optimize standard user experiences for government and enterprise-focused Dapps, the author has created an intelligent ERP system that is open source and native to Cardano. This issue has been highlighted by the author and it is related to the current challenge. This solution has been clearly defined by the author as Cardano ERP will provide for seamless integration and optimized user experience for enterprise-focused dApps. The risk that the author may face is that the poaching of core team members affects the development of the author's project, and the risk of insufficient funding is also a big problem in this experiment. this challenge. To minimize these risks the author has carefully selected from a group of known developers to work with the team.", "q0r": 5, "q1": "The author has clearly listed the important milestones clearly and specifically.\nJanuary: Get funding, and establish administrative and legal orders (recruitment). Core CERP team to enroll in Emurgo Academy courses.\nFebruary: Core CERP team completes Emurgo Academy courses.\nMarch: Plan, architect and develop MVP (general ledger and basic financial statements)\nApril: Testing and Distribution of MVP\nMay: Draft and deliver any identified CIPs needed for the final product\nAdoption of this timeline shows that the above timelines are necessary for progress on this proposal to be audited. If this project is funded, Cardano ERP will be formed as a non-profit organization for the purpose of signing contracts and working for the benefit of the Cardano community. Metrics that clearly define success can all be related to the challenge of the campaign. The existing solution to this challenge is the integration, development, and improvement of not only the Cardano ERP product but the entire Cardano ecosystem and community.", "q1r": 5, "q2": "The article's KPIs and metrics are clearly listed by the author and are suitable for the challenge. About the team, there are 2 main members: Project Founder, R “Jay” Jackson, and Project Director, Gopakumar T. Nair. The proponent has 30 years of industry experience as an ERP and CPA consultant. Their core team has decades of extensive experience in the development and general development of ERP systems. The funding required is $491.400. The budget is allotted in a very detailed way that is divided into stages such as Emurgo training courses, developers, community engagement managers, webmasters/developers, legal & accountants accounting, outside consulting - research, outside consulting - engineering\ntravel and meetings, administration, and other expenses.... a reasonable and clear budget allocation increase the credibility of the proposal.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14350, "q0": "Unfortunately, when I look at the proposal from a technical perspective, it doesn't quite measure up. The team wants to build a Blockchain-based-ERP system and claims that it is the “obvious solution to efficiently unify otherwise disparate software“. Furthermore, it is said that the software „provides seamless integration of businesses“  and „optimal user experience“.\nAlso, the steep thesis is put forward: „Mass adoption of Cardano by enterprises will likely not happen without there being an ERP system in place”. These are very ambitious claims, but they are not supported by facts.\nIt is assumed that just because ledger technology is used in accounting, it logically belongs on the blockchain. I think this is a fallacy.\nThe reason that there is no ERP system based on blockchain yet is attributed to the fact that there have been scaling problems, transaction costs are too high and performance has been too low. This is all correctly analyzed! The only thing is that it is claimed that Cardano has now solved all these problems. This is not correct. From a practical perspective, it does not make sense to store all database transactions of an ERP application on the blockchain, neither today nor in 5 years. Among the reasons mentioned before, there are also privacy issues.\nFrom a technical perspective, there are misunderstandings on the part of the proposers as to what a blockchain can and cannot do. I would be less critical of the topic if the proposers mentioned this themselves - but they do not. Why not a hybrid solution where only very select transactions end up on the blockchain?\nBeyond that, there is outsized optimism about what the team can accomplish within a relatively short time.\n", "q0r": 3, "q1": "The core team consists of two professionals from the ERP world with extensive experience. However, when looking at the resumes (website -> Teams CVs), all the names on the credentials are blacked out? Why? Transparency is somewhat different. \nThe proposed team has no impactful experience with Plutus/Haskell. Nor with any other blockchain technology (e.g., Ethereum). Accordingly, the team wants to attend Emurgo Academy courses. Only to then demonstrate an MVP of the product within 1-2 more months. This is highly unrealistic without specific prior experience. Furthermore, there are dozens of questions that are not answered: Where is the application hosted? What FE/BE technology will be used?\nThe budget breakdown of the estimated costs, on the other hand, is fair, but only cover the costs for 5 months. Thereafter, further proposals should be submitted until the project is finished.\nDue to the low transparency concerning the team, a tight schedule and these very full promises, I can't rate the project as realistic in this form.\nI recommend the team to get some information first and build a prototype if necessary, or request a lower budget for a prototype.\n", "q1r": 2, "q2": "Monitoring primarily uses metrics that cannot realistically be determined within the first 5 months. I would suggest more openness here. GitHub commits? A blog? Regular status reports to the community? My fear with this project is that it starts out very ambitious and then they are confronted with the reality that it is impossible to achieve the goals in 5 months without prior technical knowledge. ", "q2r": 2, "assessor": "z_assessor_3996", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14649, "q0": "Overall, the project has the goal of creating an intelligent ERP system to open the development of the Cardano environment and attract more users. The project has outlined features, functions, and audiences are businesses and governments, but it is still not clear and detailed. The project developer mentioned that this system will have a big impact on the Cardano community but needs to be more specific about how it will affect the audience of the project. The project is still not really detailed, has not been explained in depth about the technical area, and has not specified the function of this ERP system, the proposer should provide a few case studies so that investors and the community can better visualize the functions of ERP Cardano.\n\nThe key metrics of this system match the challenge's criteria of attracting more users, improving the community and its products, and improving the integration of existing measures. The proposal gives an example of an accounting module that is great for investors to understand the project better. But the proposer did not mention which functions or activities of the project will affect their key metrics and did not specify which aspects of the project will specifically affect the Cardano community. In addition, the proposal states that growth and adoption will be exponential but there is no concrete evidence to back that up. Proposer said that there would be a standardized interface but did not elaborate on how it will be made or how it will be better than the old interface and how.\n\nThe proposal has raised the risks and methods but it is not clear, the proposer does not say how to implement the solution to approach investors, what other solutions are proposed by the proposer?", "q0r": 3, "q1": "I think that the proposal should have a trial product or a software demo to make the proposal more accessible to investors. As for the timeline, the team should clearly state what the performance results of each project milestone will be. As for the project's human resources, the team's capacity is generally quite good (2 masters and 3 bachelors, computer engineers) and has many years of experience, able to run the project well. However, having members running multiple projects at the same time can cause problems. The budget part is not detailed yet, so it has not given confidence to investors. In addition, the team needs to provide technical and technological aspects that team will do to propose more quality.", "q1r": 2, "q2": "In general, the criteria for accomplishing the goals proposed by the proposers match the objectives of the challenge. However, as mentioned above, the project is not clear, specifically, there are no accurate measurement numbers to prove that the project has a high success rate.", "q2r": 3, "assessor": "z_assessor_4078", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Cardano ERP will provide for seamless integration of, and optimized user experience for, business, enterprise, and government focused dApps via an open-source, standardized modular solution.", "experience": "The proposer has 30 years' experience as a master ERP consultant and CPA (inactive). The Cardano ERP core team has many decades of broad and deep experience in general development and developing for ERP systems.\nPlease see core team CVs at our linked website."}