{"id": 417693, "author": "v2target", "title": "V2target-Dual target for ADA holder", "url": "https://cardano.ideascale.com/a/dtd/417693-48088", "category": 26595, "amount": 67375, "description": "Many people staking ADA for passive income but still want to increase their assets when the market fluctuates. However, withdrawing from the wallet to the exchange, from the exchange....", "f6_no_assessments": 8, "f6_rating": 4.958333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 5946, "q0": "The proposal is very innovative for the ADA holder within the market drastically fluctuated and unexpected conditions; for example, ADA felt more than 80% since its all-time high of 3.1$. Until the existence of Djed stablecoin, this will be a large hedge, optimize profits for the ADA holders, and keep a sufficient ADA amount for long-term staking. Within the biggest challenge of fund 9 in  Dapps, Products & Integrations, this problem is well-defined and synced with the Dapps and Integrations with centralized exchanges. \nThe risks are defined as two main risks: #1 the cost of developing such a complex and long-term Dapps (the team already mapped out the second phase of the V2target-DUAL 2.0 for the upcoming funds, and #2 the reliable and significant SPO to corporate for this. However, there are some builds for the proposal team to take into account the delayed and slippage of ADA price during the market volatility in a short period (for example Binance exchange requires 15mins for deposit and withdrawal, within this 15 minutes, the price of ADA in the market can fluctuate drastically. Another risk that needs to be mentioned is the taxable law of trading in each country is very varied. For some countries, the taxable amount when selling the asset is superbly high. Thus, this will create the reluctance of the ADA delegators. Finally, there is more a clarifying question of whether all of the selling and buying behaviors come from the delegators or the Stake Pool Operators if these behaviors belong to the delegators. Then the next step would be marketing and ensuring the adoption from the delegators community as per first: let them know the benefits outweigh the risk of slippage, payment, and each country's tax law, and the safety in terms of their assets' ownership as the some of the authorized for auto integration buying and selling needs to involved in the Dapps. This is a very proactive solution while the stablecoins are not ready yet. Hence, the proposal advisors give some builds/risks to help the project team, and this proposal received a five score for its encouraging effort.", "q0r": 5, "q1": "The team shows very rich experience in blockchain and developers, ranging from experienced SPO, Financial experts, and Professional developer teams. The links are trustworthy with proven projects, especially their GitHub and past funded projects. It would be a suggestion for the team to show the team information on the websites https://Vknight.io and https://vcoincheck.io. However, I can find the relevant source of the details of the people working on the proposaposal in their separate provided Telegram link profile and the Telegram & Facebook community with thousands of members. After the research as a PA, it is considered that the team is well-capable and trustworthy in delivering the proposed solutions.\nThe milestones are detailedly mapped out in the 12 months with a clear target and clear roles amongst stakeholders: research team (Ideate), dev team (code), operating team (logistics), and even involved the community (testers) in testing out the initial roll-out. As this idea stemmed from a video concept of dual targets and then having the demo clips, the team also carefully saved the first month from finalizing the details, thus making this a more peer-reviewed approach to the Cardano philosophy. The process made the feasibility highly appreciated throughout the 12-month proposal timing.\nRegarding the budget, the proposal's total budget is contributing to 8.5% of the entire F9- Dapps, Products & Integrations, which is reasonable as compared to the complexity of the solution and the timing of the project delivery in 12 months, in which the monthly funded from Catalyst will help the team deliver the idea in fruition. The budget was carefully broken into two significant phases with the milestones mentioned above and split between the human resources cost and the relevant software and features price. The first phase in the first four months is already finished. It would be a suggestion for the team to present the budget from month 9 to month 12 to complete the 12-month milestones of the laid-out timeline. The team also committed to being back in fund 10 for the Implementation of V2target 2.0, yet the budget will be proposed later, and I think the timing is also longer for the next phase of the project may be a total of 18 months.", "q1r": 5, "q2": "The Measurement KPI is mainly in the 2nd phase, whereas the team has already completed the first phase. The team has KPI from month 5 to month 8, in which the team will involve top 500 ADA holders and top 30 SPO to try the V2target V2. There are other measurable KPIs in terms of publishment articles to update about the projects. The success was also well-considered and properly defined as per the number achieved KPI 30%-40% out of the whole sample implementations; for example, 120/500 ADA holders, 10/30 SPO, and the number of articles and views respectively. Moreover, as it is an application app, it would be more convincing if the team can share more quantitative factors as per the ROI of holders and SPO. This project is brand new and does not relate to any Sustainable Development Goals of Catalyst in this Fund 9. However, the team was an experienced team in Catalyst where they got funded from fund 6 to fund 8 with a variety of projects and it shows they are capable of delivery and proven tracking records. It would be potential for the team to consider the other revenue stream from the users: both delegators and SPO when they experience and see the idea as profitable for themselves.", "q2r": 5, "assessor": "z_assessor_2759", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 196, "q0": "This is a software that helps ADA holders to have additional income beside passive income from staking (average staking reward 5% per year, according to the official announcement). By using an automatic system to trade ADA when the market fluctuates, users will have a second source of income from trading. They just got more either ADA or cash while maintaining a fixed yearly passive income from staking.\n\nTechnically, the V2target software will connect to the Deadalus or Yoroi wallet and Binance account (via API) to execute transactions within gap time between two snapshots. Using this software, players must declare all security information to be able to withdraw ADA from the wallet to Binance and transfer ADA from Binance back to the wallet for next snapshot. \n\nBased on the ADA price fluctuation in the market, I also had a desire to have the dual benefits of holding ADA. However, I later gave up because I had spent too much time as buying and selling done manually (you always have to watch the market and execute these trades). Therefore, using an auto-trading system is a very nice solution for ADA holders.\n\nV2target software give solution to earn through ADA trading, while maintaining that amount of ADA for annual staking. It helps ADA holders to increase asset value every time ADA price fluctuates. By setting targets for automatic trading, ADA holders will avoid psychological traps like fomo or fud. They are safe to hold ADA for the long term. This is so great. It can create a large community of long-term investors because they have dual benefit of holding ADA.", "q0r": 5, "q1": "This is a highly applicable software for the ADA holder community. Its next versions will provide more features for ease of use, connectivity to more exchanges and more security.\nInformation about the technical team is clearly presented with their huge profiles on linkedin, github and the website. This team has many years of experience in the field of finance, banking, making it easy for them to successfully implement this proposal. Functions of the software described in detail, many automatic tasks are performed such as calculating the snapshot time, the number of ADA needed, the hops, etc., which requires the proposed team to work a lot, carefully peer to peer test when put into practice.\nThe budget is reasonable. The average cost of $75/man-day is suitable for personnel in this area. The costs listed with detailed jobs are clear and transparent. Operating and marketing costs for community development are also clarified.\nThe proposer mentioned specific and perfect execution plan. Tasks and KPIs are listed by week and month  with milestones showing clear progress. \nThe marketing plans will be run on social media and their website as well as their available huge community. They also provide technical support on their Telegram channel.", "q1r": 5, "q2": "First of all, it must be considered that the software is nearly completed. The proposer team has taken each step in a very clear roadmap. All information being publicized clearly on github and their Youtube channel. This shows their determination to carry out this project and the next steps are also very clear.\nThe results are listed by month with specific KPIs. The community can easily check the progress through public channels like social networks, website, gifhub and youtube. This demonstrates the transparency and commitment of this project to completion.", "q2r": 5, "assessor": "z_assessor_2055", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1208, "q0": "This is an idea proposal to create an application that allows ada holders to both stake and trade. The application is very practical, financial-oriented, will certainly receive the support of the community. Regarding the technical solution, they through the API to connect with both Binance and the cardano network to perform ada deposit and withdrawal. And this app can automatically calculate the cardano network snapshort time to ensure stake profit and only trade between these time periods. In terms of thinking it is possible. If the project is to be implemented, it needs to be secure. And if it can ensure security, then surely a lot of people need this application; not only holders but also traders. Of course, each person should only use a reasonable amount for this trade and stake fund. I really appreciate this idea.", "q0r": 5, "q1": "This team has a very detailed 12-month plan for developing their application, and promoting this product to the community. They made part of the product in the first version, showing the seriousness of the project. In 3 stages of implementation, the first phase they do deep research on product security and complete technical designs, infrastructure to run automated bots, connect APIs.\nIn the next two stages, they focus on communicating to the community through product introduction videos promoted to the cardano community on facebook, and contacting large crypto groups.\nThe cost of applying for a license is item by item mainly paid for coder and product communication.\nMember information (15 people) is public, experienced, has a link to facebook/github. Therefore, I highly appreciate the feasibility of the project.", "q1r": 5, "q2": "They choose to report work progress through github and summarize the results achieved through their website. These are the two most popular channels, due to the convenience and transparency of information, easy to follow, and easy to verify.\nThey have detailed KPIs in numbers: the number of people participating in the product testing, the number of users of the product, the number of partners who combine product distribution... Therefore, we can evaluate the project on progress. and the success of this project.\nI looked at the KPIs they set, it fits their plan, and the communication part they have the advantage of having a cardano community with over 40k followers (an encouraging thing).\nThe information is public, so I appreciate this piece of content.", "q2r": 5, "assessor": "z_assessor_2217", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4858, "q0": "I think this is a spectacular idea. As we know, ADA investors could earn passive income for staking to a specific Pool, but still want to withdraw to exchange when the market strongly fluctuates to maximize their assets. In fact, there might be some financial tools to help investors automatically trade, but most of them have many potential risks such as bot trading and Yeild farming... Therefore, the proposer would like to create a financial application, namely V2target, aims at ADA holders, to safely and automatically optimize the number of ADA without spending much time on monitoring market price fluctuations. In my opinion, this project is a great idea which is reseached from a team of Cardano savvy people with aim to provide a service with trust and security. I am appreciated the proposer's effort for explaining their technical and financial solution in a very detailed way. In reality, their solution has been known around for a long time in Cardano communities which community could test it with a demo version of the project, but now they are still constantly researching more about financial solutions to apply to V2target. Moreover, this idea is consistent with the challenge as: it contributes to the increasing number of Dapps developed in the future; increase Cardano transaction volume in the ecosystem while ensuring the safety of users; might help attract new investors, increase Cardano reputation as V2target solution is only suitalbe and most effective for ADA and Cardano staking mechanism. In addition, there are some major risks in delivering this project successfully: this app will need a lot of time and money for research and completion; community might not trust this finance-related apps like V2target. Therefore, some solutions was suggested for dealing with these risks by the proposer which I think very good at this stage of the proposal. I would like to give them full score for this part because of the detail of the project. ", "q0r": 5, "q1": "The feasibility part of this proposal is great. First, for the roadmap, the proposer provides a very detailed 12-month implemention plan, devided into 3 Phrase (4 month each). In each phrase, I know exactly their main focus, the detail of each task, target for each month, which team will be in charge of carrying out the tasks, in which these activities will be carried out on a weekly basis. In short, I think, this is a very big and passionate project from the team. Next, for budget's expense, within the scope of this proposal, they propose to raise fund for Phrase 1 and 2 of the project in which Phrase 1 has been completed by the team. It means the proposer is willing to spend their initial cost to complete Phrase 1 for community to see first then ask for support later, unlike many projects that haven't done anything yet and just only stop at the idea which is hard for community to evaluate the feasibility of the project. I see proof of work for Phrase 1, community could check it on Github as it is publicly uploaded all the software's code there with link provided. For the detail of the cost, I think, the proposer calculate each item every clear: I know total required budget of $67375, fixed salary is paid for the team, some other jobs based on manday of 8 working hours at rate $75/manday which I think is reasonable for professional works and non-technical works. Finally, in regards to the team, they absolutely gain community trust, for several reasons. Starting with the fact that this is already ongoing project, it doesn't start from the beginning, it means the team have already had experienced which shows team's ability, confidence, enthusiasm in this new stage. Moreover, the proposer provides a lot of information about each member: who they are, what their education background, previous experience, expertise with active participation in Cardano ecosystem. In short, I think, the quality level of this part is high.  ", "q1r": 5, "q2": "Finally, we will analyze the auditability of this proposal.  In my opinion, it is possible to keep track of the project development. The proposer clearly explain which sources they will use to monitor the progress: via Vcoincheck and Vknight website, and product code on Github link provided. Therefore, via above sources, community could check updates on how the monthly activities were performed and what objectives were attained at that period of time: the release of support chat channel, clips on Youtube channel for intruducing V2target solution, new published articles on social media channels and websites on a daily basis, lists of ADA holders, SPO holders and contributors, the number of views and reaction returns,...I think, it is clear enough for community audit. In term of success scenario, it is quite detailed about what they are trying to achieve: product will be distributed to 120 ADA big holders, 10 high reputation SPO, 6 high reputation funded proposers, 40 articles about V2target, and its solution for ADA holder will reach 15,000-30,000 views. Finally, yes, it is possible for us to audit this proposal as the proposer provides very clear which activities should be monitored and how. ", "q2r": 5, "assessor": "z_assessor_2622", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6022, "q0": "I quite like the idea of ​​the proposed team, a creative idea in managing each person's personal finances. Basically, the idea here is to build an application that helps ADA investors, especially long-term investors, have an additional tool to increase their assets through cash through \"double target\". The application will replace us to calculate the balance from staking. When the price goes up, the application will sell a small part of ADA to earn the desired profit of each month, and when the price goes down, it will buy back exactly the amount of ADA sold before. In general, I understand the overall idea of ​​the project because my main job is also a trader in the market (stock, forex). However, it will be quite vague for those who have access to this trading system for the first time, so I think that if we can add here an excel calculation that simulates the arbitrage process, it will be more intuitive for the user. In addition, the idea is quite good, helping to optimize investors' ADA holdings. Helping investors stick with ADA and the Cardano ecosystem for a long time. Attract more users to the app and to Cardano.", "q0r": 5, "q1": "I strongly agree on the feasibility of the project considering the following aspects:\n- Implementation time: the proposer shows us which activities will take how much time to implement and develop. In addition, the marketing phase also spells out how the projects will be communicated to the community. Therefore, the description of the implementation route in my opinion is reasonable.\n- Budget breakdown: the total budget for the proposal is 67375 USD, and it can be seen that the proposer spends most of the cost on building and developing the application (accounting for 60%/total). And these costs are also listed very clearly in each product development work category. Although I have a little doubt about the basic salary in Vietnam for this application design job, in general, it is at the common level compared to other countries.\n- Relevant experience: I am quite confident in the experience of the programming team as well as the marketing team of the project. Vknight.io is not only a famous unit in the Vietnam region but also participates in many construction projects in Cambodia, Laos, and Burma (as far as I know). In addition, the community-building experience is extremely impressive as the team proposes to own a Cardano community with over 46,800+ members in Vietnam. So more users will know the product of the recommended group.", "q1r": 5, "q2": "The proposed team has provided milestone data to fully measure the successful progress of the project. This information is completely verifiable through community group posts. The number of users will be tracked through the platform's application. The information of each member of the proposed team is also clearly listed through links to each person's profile page. The community can check who these people are, and interact with them to understand their worldview. In general, the information is transparent and open to the community.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10258, "q0": "This proposal is a great solution that helps long-term ADA holders to both increase the number of ADA in their accounts and receive a steady monthly passive cash flow. The application will place buy/sell orders automatically on crypto exchanges based on a dual-target algorithm (which is designed by proposers), therefore users don't have to spend any time to update price movements continuously and eliminate the affect of unstable trading psychology as well. If successfully built, the application has great opportunities to be widely used in the Cardano community. In addition, it will certainly encourage investors to hold ADA permanently and attract new users to the Cardano platform thanks to the benefits it provides. For all these positive impacts of the proposal, it is well-aligned with this Challenge and I have a high hope for this proposal to be funded and become successful. In terms of risk management, the proposers have pointed out 2 main hurdles which could hamper the project and proposed corresponding solutions for each issue. In my opinion, the biggest hurdle is how to gain trust from global Cardano communities for a financial management application. Consequently, in addition to the solutions prepared by the team, I recommend 4 other measures to solve this issue: (1) The dual-target algorithm (as described in the proposal) looks simple, but in order to be academically proven (and it should be), the project team may need to write a research paper, then send it to some academic platforms such as Google Scholar, Research Gate, etc. as well as conduct peer-review activities at some high-ranking universities; (2) The proposers should prepare a video for visualized explanation of the algorithm; (3) The proposers should consider hiring a professional and reputable organazation for code security audit and/or add a bug bounty program in the proposal; (4) The proposers should explain more clearly about where the user's trading accounts, wallet keys are stored and how they are protected from hackers.", "q0r": 5, "q1": "The development team is formed with people who are rich of knowledge and experiences in the most necessary areas (finance, technology, marketing, SPO, management) of the project. The personal information of all team members is posted publicly and in detail, a long with available links to their personal social network pages. In particular, according to my research, the project advisor is a KOL with big reputation in the Vietnamese Cardano community and has a deep knowledge of the Cardano platform. In terms of budget, I found the total budget of the project appropriate because of the amount of hard work they have contributed in Phase 1 (which has been completed) and plan to do in Phase 2 and Phase 3. Regardless, I still have 2 suggestions for the team that might make the budget even more effective, including: (1) The proposers should attach additional fund in Phase 2 for code audit service and/or a bug bounty program; (2) The funds should focus on Phase 2 as the marketing and building trust activities are really important, so I think the fund ratio of Phase 2 should be greater than Phase 1 (which has already been completed before Fund 9). About the roadmap, a very detailed one is carefully designed, consisting of specific milestones and detailed jobs which need to be done. As the result, I believe team members would collaborate smoothly together and achieve the highest efficiency. Overall, I believe this is a viable project and should be funded by Catalyst.", "q1r": 5, "q2": "The KPIs for every part of the project have been illustrated very specifically in the proposal which make it easy for the community to check the project's achievement. All reports and application code will be published on the Internet and the community may have big contribution on identifying bugs and risks of the application (if any existed) . Therefore, in my view, this proposal is highly auditable.", "q2r": 5, "assessor": "z_assessor_3168", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11453, "q0": "I think, this is an advanced financial solution. The idea is about V2target, an financial app which will help ADA investors to maximize their assets in a safe, automatic and simple manner. This idea fits well with the challenge because it will bring more profits for ADA investors, help increase the volume of ADA transaction, might attract more investors, at the same time, ensure the safety of users in Cardano ecosystem. After all, this is a practical idea for Cardano community. ", "q0r": 5, "q1": "I'm more persuaded by the implementation of this project. This project has a very good team: leading team, Dev team, research and operation team with rich experience in both technical and non-technical jobs. The proposer made a very detailed profile of each member and give their contact if need. Moreover, this team proves their ability when they have already finished Phrase 1 before submitting their proposal and asking for fund. It means community could have more visualization of the project that help them in the assessment of the proposal. For the plan, I think it is very clear. they made the detail of one-year implementation of the project, when each work will be carried out weekly and clear target for each month, leaving nothing to comment about this part. Finally, speaking of budget, the proposer clearly explains for each item, how it will be calculated, it is based on manday, fixed amount of salary for full time workers and a total cost is requested for Phrase 1 and 2 together, so I'm very appreciated. ", "q1r": 5, "q2": "For the checking of this project, I think they do a good job. \nThere are 2 main source of tracking: the websites Vcoincheck and Vknight, and product code on Github, we could see how the team is doing, what is the project going, and how good it is. Or by checking their KPIs for each month, we could have an overview of what achievements could the team attain, based on the quality and quantitative analysis of each items. After all, I think this auditability is good, but it is more perfect if the proposer could explain a little bit about how the community could engage with the team on their social media channels.", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14015, "q0": "Literally, for those people who are not good at managing their private financial assets, this proposal would provide a helpful tool to solve the problem. The proposal is to create an app that functions to calculate the cash flows, and how much money is left from staking. It would be an alternative approach for us to make a decision whether the portfolio should be sold a little bit of ADA for the profit and will guarantee the expected return monthly. This is quite creative but ambiguous for those who are beginners, and some argument might occur due to the practical feature of the proposal. In order to minimize the conflicting effect, a suggestion here is that the proposer should provide an excel sheet to show which formulates are involved to come up with the decision so that would enhance the persuasive feature of its decisions. The excel can also simulate the buying and selling progress which shows the price deviation to give the user a visualization about the active mechanism of the app. Therefore, it would raise the reliability of the app and assists an optimal number of ADA for investments. I think this proposal would attract an array of users and contribute to the development of the Cardano community.", "q0r": 5, "q1": "There are some aspects that are considered to evaluate the feasibility of the proposal. I saw the total budget is $67,375 and this number made me surprised and took time to analyze in depth other factors first before concluding this is a reasonable number. To begin with, the proposer provided in detail the profile of each member and most of them used to study about the blockchain and make investments as ADA holders. Mr. Neo Nguyen and Mr. Tony Nguyen both have a diversified experience in marketing and web developing segment, building the app would not be an obstacle for this team, I think. On the other hand, the target users of the app is flexibility since there is Ms. Uyen, who is an expert in Japanese and has a long-term working for Japanese companies. Therefore, the app would be developed not only in Viet Nam but also in Japanese and all over the world in the near future. I am wondering how much wage will be paid for each of the talented members in this team. By the way, the proposer is quite clever when he can combine the route of work with specific budget explanation. The description provides us a lot of important information about the project progress, total duration in progressing and estimating how successful they are able to reach. From the description, it is obvious to see that the constructing and developing the app accounts for 60% in total. I am quite impressed by this very careful investment of the proposer when making a decision to join the Fund9. ", "q1r": 5, "q2": "Overall, the proposer guarantees about the transparency and public of the information attached here. The proposal’s measurement of success is provided fully with relevant data. For example, each member in the team is mentioned in the description with the attached profile via Telegram link or Linkedin so that people in the Cardano community can easily verify their identification and the level of reliability. The total posts in the community group of the proposal will be the base for evaluation. Moreover, there would be a platform to record the number of users that are new registering on the app.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "V2target is an application that helps Cardano users to process transactions on the crypto market in two directions. They can both increase their profits and also increase the amount of ADA they own...", "experience": "Our team are funded proposers of 6 proposal (Vcoincheck.io and Fimi fund7,8), big SPO, admin of huge Facebook and telegram community, Financial professional, Professional dev team – Vknight.io team."}