{"id": 417836, "author": "nmelon", "title": "NFT Portfolio & Tax reporting tool", "url": "https://cardano.ideascale.com/a/dtd/417836-48088", "category": 26595, "amount": 80000, "description": "NFT Tracking and Tax Reporting can be very complex & time-consuming ", "f6_no_assessments": 6, "f6_rating": 2.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 13972, "q0": "The proposal clearly outlines the pre-existing service (nft portfolio trackers) and sets out to improve it displaying an understanding of the challenge objectives. Identifying that a majority of nft portfolio trackers have a single data point they look to enrich the community by providing data not only on portfolio performance but trend future estimation. The proposal also looks to provide users with the ability to make nft wallets tax compliant. All factors which potentially could bring in new users to the ecosystem. I say potentially because proposers have not fully explained the benefit this could have in regard to new use cases. Proposers would benefit from explaining how the new features within their tool will help the existing Cardano ecosystem as well as bring in users from other platforms. As a nft collector being tax compliant is quite confusing and many collectors simply disregard it (to their detriment), having taxes automated could draw interest to more Cardano nfts as they will have less burdens with this tool. Consideration of how community could be built around the tool and the high-level data it provides would better serve proposers when trying to demonstrate the impact it could have. Proposers should revise the challenge objectives and ensure they describe the relationship between features and the effect on the Cardano community. When analysing risk, proposers have put little effort. Although wallet queries are a valid issue other issues like low demand and security issues could be considered, even if easily mitigated consideration of the risk is better than ignorance to it. If the project is not well marketed those in the community cannot benefit from the features, it provides. In essence proposers should look to detail how the tool benefits the ecosystem and consider how its integration could improve existing products (A good nft tool could potentially lead to higher demand for top cnft project’s). Further explanation of the tool looks to scale (paid or free service) should also be considered.", "q0r": 3, "q1": "\nThe timeline is provided on a weekly basis with a task allocated per week. Without specialist knowledge it’s hard to discern whether tasks can be completed within that timeframe. Without an hourly breakdown per week or even daily the feasibility of the plan must be questioned. Proposers should consider writing a hourly breakdown alongside the member of staff responsible for each task. Detailing the work/process each task requires makes the report more feasible as the task can now be understood in full. This links directly into the budget breakdown as without the knowing the hours the engineers will be working deciding whether it’s acceptable pay scale is impossible. Proposers should record the hourly rate for each engineer and the hours they will work each week. In regards to the team no information is provided, I must assume they wish to stay anonymous. This is commonplace in the web 3 world but when requesting for funding one’s real-life credentials and background are key assessment points. To enhance feasibility proposers should consider revealing the members who will be working on the project and even consider hiring more than just engineers. If looking for widespread success an expert in marketing or community feedback may serve useful. They do display proficiency developing other nft tools in the past. Without credentials this is hard to verify as their work using only the proposal. They don’t plan to return for funding, which suggests they expect to be self-sustaining- if so, proposers should detail how they will achieve this- whether through ads or paid subscriptions. If proposers could verify the success of the previous tools and possibly the funding and resources, they required to create them I wouldn’t the dispute the feasibility. Based on the information provided in this report it doesn’t appear to be at this moment.\n", "q1r": 2, "q2": "\nRegarding auditability the team can track progress by completes pages/components, they however fail to mention whether a senior team leader will be directing this progress or if weekly/monthly targets will be made. The proposers should consider independently recording progress so it can be reviewed even after the work is done. There is no mention of posts to public channels, the team should consider posting progress of development so the community can audit whether they are following through on the proposal. This can be achieved through twitter posts, joining catalyst town halls or other social media platforms. Without this the progress /success of the proposal cannot be audited. When discussing what success looks like proposers describe the aim of the proposal but don’t provide any success indicators. This means the success of the project cannot be objectively measured. In future metrics like extension downloads, nfts tracked and connected wallets would serve as auditable figures that would demonstrate project success. Quantifiable target numbers for the future would also demonstrate a sustainable outlook. An example of this would be projected downloads or number of new monthly users/subscriptions. At this moment the project is not auditable with no clear kpis.\n", "q2r": 2, "assessor": "z_assessor_3865", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4187, "q0": "The \"NFT portfolio & tax reporting tool\" proposal address the challenge \"Dapps, Products & Integration by allowing NFT investors to track key data about their NFTs across various source and give the guidance about tax. The NFT history information will be revealed to NFT investors in the CNFT jungle portfolio tracker. The tracker doesn't only show past performance but also provide the future estimate based on trend. Within the platform, the tax reporting tool will allow investors to be tax compliant with the NFT tax rules and that they can download their tax reports in minutes. The chrome webstore link they provide in the proposal shows this tool as  a very useful utility extension for Cardano NFTs and will promote more trading activities, holding NFTs in the portfolio and increase exposure of CNFTs to the NFT community and also Cardano adoption. The main risks for this proposal is heavy wallet queries and would need optimization. The proposal fits the challenge very well as NFT is a very new asset class. Trading activity will yield P&L that needs to report tax and the team has managed to include both features within their solution, it will surely promote NFT as an asset in the portfolio and I could see its potential for future scaling and portfolio diversification.", "q0r": 5, "q1": "The project spans across 10 weeks with the main activity of infrastructure in week 1 - 5 with week 6-9 on wallet queries and UI. Then go on to tackle the tax reporting side in week 9-10. The timeline and key milestones are reasonable for the CNFT jungle team. Each week they will require $8000 for 3 engineers and that brings the total budget to $80,000 There are a few tools that this CNFT jungle team has built in the past like CNFT jungle platform and CNFT predator. This will add to the feasibility of the project. They won't return for further funding for this project and they expect to charge for their features to make this project sustainable. The proposal will improve in the feasibility score if they could provide the team member profile along with their URL link and responsibilities. ", "q1r": 4, "q2": "The success of this project is a full working portfolio with historical data and easy to use P&L tax reporting tool. The project progress can be monitored by components based on milestone information in each week. The team should supply the channel they want to report back to the community for project progress. This could be in GitHub, bi-weekly meetings or reports or even social media like twitter. This will add to the transparency of this project and make it easier for the community to audit this project. The team has a clear understanding of issue on NFT portfolio tracking and tax reporting and has come up with the dApp that could be very useful to the NFT communities in Cardano.", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6024, "q0": "The content of this proposal is to build a product to track NFT data such as NFT name, collection size, NFT price, minting history (mint), NFT profit/loss. At the same time, the product also integrates for users to report taxes for NFT investments. However, I think the impact of this project on the Cardano ecosystem is not enough to attract more users because:\nFirst: NFT details can be easily checked on-chain, aggregated information is nothing new enough to attract more users\nSecond: tax reporting only occurs in a few countries that have separate laws for digital assets, there are still many countries that do not have measures to apply the law to file NFT tax returns. As a result, this tax preparation tool is less and less used.", "q0r": 3, "q1": "The feasibility of the project in my opinion is only low because the bottom line is that the cost to implement is extremely unreasonable. The proposal is asking for a budget of $80,000 to build a tool that simply aggregates information and displays it in an interface. As far as I know, UX UI construction jobs only cost about $4000 for 1 engineer to be able to complete all requirements well. And I think it takes about $2000 more to be able to test all the defects of the product. However, the proposal requires a budget of $80,000 for 3 engineers. So that means 1 engineer will receive $26,600 respectively for more than 2 months of work? An extremely unreasonable cost. Therefore, I suggest that the proposer should calculate more carefully the cost per engineer because we don't need to spend too much money to build a tool like this.", "q1r": 2, "q2": "I strongly disagree with the auditability of the proposal. We do not have any milestones to measure the progress of the project nor the KPIs that show that the project is successfully implemented. I take an example, for example, after 3 months of product launch, we attract the first 100 users. Or the frequency of accessing the application daily is 50 times. In addition, I tried to open each link but still can't find any information about the team members, so the transparency of the recommendation is not guaranteed. Therefore, I think that the proposed team should add more information that I just mentioned to further improve the ideas as well as evaluate whether the project is successful or not.", "q2r": 1, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7185, "q0": "This proposer addresses the problem of Non fungible tokens not being easily organized, but suggests a solution using metadata by developing a tool to help assess NFT portfolios, come time to pay one's taxes on capital gains and or loss of revenue for investors in the NFT space. This is an increasingly difficult issue for many who invest heavily into (C)NFT's and could make many users within the Cardano ecosystem much less stressed about finding and reviewing every blockchain transaction they've made. CNFT Jungle wishes to build a \"Tracker\" that will streamline this process for investors so no data will be lost or overlooked. In theory, this is a great idea but the proposer does not give much information on their ability to scale future challenges that will surely need to be addressed. Cardano wallet integration, just as an example, with the newly evolved and ever changing NFT market, will be a major hurdle among other challenges such as Auhtenticity of assets, to keep up with a standard most consumers (buyers/sellers of NFTs) will be confident with. Rationale score of a 3, because it would be a highly useful tool if implemented correctly and securely.", "q0r": 3, "q1": "The feasability in reference to experience of the proposer and their team is not clearly defined specifically. This proposal lacks some key elements in which voters may want to see who and what this 'team' has accomplished and if they're capable of performing such a task in implementing the Tax Tracker Tool proposed. As far as CNFT Jungle goes, it is a widely used site many investors and projects utilize while creating, buying & selling NFTs on Cardano. The plan to execute such solution to the problem is not well established within this proposal. Questions of concern: What type of tax software will be developed and for whom? (Different countries will have different requirements and federal legislation on Non Fungible Tokens which are still in an infancy stage and rather vague in legality). Is there anyone within the CNFT team that's academically qualified as a Tax Professional or would this aspect of the challenge be outsourced? The budget breakdown as well as the roadmap do not display information of where funds will be allocated to. This too would help voters to decide if such goals can be delivered within the allotted time frame. The rationale for this section is a 2 because of these key components missing from the proposal.", "q1r": 2, "q2": "For auditability this proposer hasn't clearly shared the considerable challenges and risks of this proposal. Having key milestones for completion in a transparent form, such as using Gitbook for updating the community on progress of milestones is not mentioned above. It is crucial for Project Catalyst members and the Cardano community to see these goals on a weekly/monthly basis and making sure they're completed on time. Within this proposal the success of this solution to the problem, mainly focused on the tax tool to be implemented on the existing website cnftungle.io for NFTs, is lacking merit in terms of how the community will remain confident the problem will be solved with the funds received. The rationale for auditability is a 2.", "q2r": 2, "assessor": "z_assessor_2883", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9501, "q0": "This impact section earns a 1 from me because doesn’t thoroughly explain a problem, or the complexity that it identifies in the problem statement, and it doesn’t provide any information on what this proposal does to make a legitimate impact. In the impact section, voters will need to be convinced that there is an issue (or there will be an issue in the future) in the area of NFTs and tax reporting. What issues are NFT holders faced with? What statistics support that there is an issue? What consequences could be faced without such a service? What makes this service unique? For an $80,000 price tag, voters will need to be convinced that there is a serious reason to approve funding for this proposal in particular. Furthermore, tax reporting is complex and subjective from country to country with varying levels maturity in the area of crypto and NFT regulations. There’s no such thing as one objective set of NFT tax rules to be compliant with, so the proposal needs to demonstrate how it will capture tax compliance in a variety of jurisdictions. Even if a problem statement isn’t thoroughly explained, the specific details of the planned solution and the uniqueness of this particular proposal is a necessary element of any Catalyst proposal and there needs to be more details as to what this platform will be providing as an end result for users. ", "q0r": 1, "q1": "Due to lack of development team information, lack of detail in budget, and only the minimum information provided for a roadmap, I end up scoring this section a 1. Since there’s no referenced or accessible information on the development team and their previous experience, voters will not have any indication that there is a tax expert behind this project. I can assume that they have various levels of software development, blockchain engineering, and UI/UX capable developers on their team with the reference to CNFT Jungle and CNFT Predator but assumptions are not enough to provide confidence to voter approval as perceived capability is different than demonstrated capability. This is especially of concern when it is realized that the budgeted $8000 per week (split between 3 engineers) equates to approximately $138k per year per person if they’re working full-time hours (this might not be the case if they’re working on other proposals this round), which is on the MUCH higher end of average salaries for software developers. Ultimately, it is up to voters if Catalyst funding should be competing with salaries of the major corporate companies in the world but this does need to be informed by disclosed experience. Since it’s relatively clear that the entire budget is going towards team salaries (though it is advisable to reallocate some to marketing), the budget and roadmap doesn’t require a substantial level of detail. In this proposals case, it could put voters minds at ease by breakding down the hours allocated to each task and the budget allocation for each developer. This section could see some substantial improvements with a few easy fixes in the area of team resumes, budget detail, and roadmap breakdown. ", "q1r": 1, "q2": "Since there is no substance for voters to respond to, I feel obligated to give this section a rank 1. The only measurement that this sections seems to use for a definition of success is completion of the tax reporting tool. Voters are more likely to vote favorably if they can see preplanned targeting for usage of the tool, as a completed product with no usage makes no impact at a $80k cost. In this section, I expect to see usage metrics as well as timeframe completion metrics. I think there’s a lot of room here to measure target goals for users engaging with the tool, wallets connected to the tool, traffic driven to the site, number of tax reports created, and other usage based KPIs. Voter favor can be substantially improved if there is a clear definition of success in this section. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9713, "q0": "The proposal meets very well what the challenge seeks. As an NFT investor, I understand the complexities of tracking and reporting NFTs. The proposal clearly articulates their solution to implement tools to track key data of NFTs from across various sources and provide a means for investors to help manage their portfolios. This will not only attract more users to their already functioning platform but add value to the Cardano ecosystem overall by driving growth and pulling in more adoption. The key metrics and goals of the proposal align well with the outlined challenge settings – The team's idea to implement a tax reporting tool to help users become fully compliant with tax rules and to be able to do it promptly will make it a more seamless experience for users. Also, the team aims to fully leverage the spectrum of NFT data with their portfolio tracker integration, which will help increase the quality of their platform and usage by the community. The information provided on their main risks that could prevent the project from successful implementation was confusing as it was unclear what the proposer meant by ‘wallet queries are heavy’ and provided insufficient information explaining how they would mitigate the risk through optimization. It was also vague about what ‘a lot of optimization’ entailed. The proposal also didn’t provide a clearly articulated plan for the project's future sustainability. ", "q0r": 4, "q1": "The proposer provides evidence of the relevant skills and experience through links to their already functioning web platform – this indicates that the team is productive and has the competency to implement the proposal. Although this is the case, insufficient information has been provided on the individual team members. We are made to guess the individual experience and skills of the core team members involved in the project and only can preassume that they can successfully implement the new features by proof of what they have done before. The proposal doesn’t provide information on the type and number of team members required to implement the proposal. Information presented in the proposal's budget is poorly thought-out and vague. Firstly, the budget wasn’t outlined clearly – there is no clarity on how the total requested amount is allocated. It would have been easier to understand if the proposal broke down the amounts for each item in their budget. Secondly, the proposer didn’t explain how they were working out their pay rates. It appears that the requested amount will be divided evenly between the 3 engineers. With the lacking information that was presented, it was difficult to distinguish if the budget was reasonable to achieve set goals. The plan provided was ineffectively designed. Although there were timeframes for the project deliverables, it wasn’t clear if these were running after each other or co-dependently. The proposal didn’t provide a sensible and conductible plan for implementation and who was accountable. We are made to conjecture that the 3 engineers, that were mentioned in the budget, will be sharing the responsibility of the tasks outlined. The plan also presented no information on the resources needed and the technical aspects that are crucial for implementation. The proposal provided unclear information on the challenges and risks relevant to a successful implementation and how they would mitigate them. It would have been beneficial for the proposer to present the team's capabilities to problem solve and handle risk.", "q1r": 2, "q2": "The proposal lacks a lot of information to recognize its impact and effectiveness. The proposal doesn't include the time horizon by which it plans to attain the proposed objective and doesn’t provide information on the milestones for the community to track its progress. The proposal only mentions the need for funds for the team to start work on implementing added features to their platform but there is no detailed game plan nor an explicit breakup on how the funds will be used. Insufficient information was provided on defining the success of the proposal – There are no metrics or KPIs to measure the progress of the project, usage of the platform or community satisfaction. It also appears that the team believes there will be minimal challenges and risks they will face in the process. Unfortunately, there is very little information to assess the auditability of this proposal. ", "q2r": 1, "assessor": "z_assessor_3086", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "CNFT Jungle Portfolio Tracker and Tax Reporting Tool will allow NFT investors to track key data about their NFTs from across various sources and provide guidance on tax reporting, all in one place. ", "experience": "The team behind CNFT Jungle & CNFT Predator, an advanced real time NFT analytics platform and NFT sniping tool."}