{"id": 417800, "author": "gamayos", "title": "Environmental Oracle", "url": "https://cardano.ideascale.com/a/dtd/417800-48088", "category": 26595, "amount": 138000, "description": "Monitoring and verification of carbon capture, regenerative agriculture and ecological restoration projects is difficult, unreliable and expensive", "f6_no_assessments": 5, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 14147, "q0": "The project clearly identifies a major problem in environmental monitoring and its metrics and goals align well with the challenge settings. However, I have a few questions on how the project will scale: What is the expected coverage at the end of project i.e. how many km2 do the authors envision they can cover? How do the authors plan to take the project to scale? And what approximate percentage of earth can actually be monitored at scale? This proposal could be improved by addressing these questions. A notable strength is that this project is widely applicable to many other projects, both in the Catalyst Fund and in scientific and commercial applications so a successful product could be very widely used. \n\nThe technological risk the authors mention is serious, but a good solution is provided in that they have planned for system robustness mechanisms that will mitigate outages of the system. The authors appear to have several partnerships and interested parties lined up, each with relevant skills to offer ranging from technical software development to NGOs working in environmental issues. ", "q0r": 4, "q1": "The authors provide a clear and detailed plan to develop their project. The first 3 steps are already largely complete – the authors area clearly already invested in the project and already have a good idea of its prospects. A detailed timeline with specific endpoints is provided. A strength is that time is also allocated to testing and quality assurance. \n\nThe estimated time specific parts of project is given as well as pay rates of the team members. Other costs are also included and the budget is very clear and detailed.\nTeam members have relevant technical experience in very similar projects such as other environmental monitoring and technology applications as well as experience in similar business and environmental issues that this project is trying to address. \n\nTeam members are involved in other projects, some currently in F9 and others that have been funded therefore they appear highly motivated, organised, and creative. Given the potential of this project to be useful for a myriad of uses by a huge variety of interested parties, from small-scale farmers to scientific institutions, it seems to be a high priority for them. ", "q1r": 5, "q2": "Multiple ways of quality assurance are provided including web platforms and publishing in scientific journals which will include a peer review process and will encourage the uptake of this technology by scientific institutions – this encourages community accountability so that the Cardano community can verify progress via these web platforms and scientific publications.  \n\nThe project progress can be measured by several quantifiable measures such as Google analytics of the web portal as well as more qualitative measures such as reporting on the deliverables at each stage and a public blog for the project. No link for the public blog was provided (and if it was, it was not clearly labelled as such) and it would be useful to have one as it would be beneficial to see how the first stages of the project went and to be able to keep track of the subsequent stages. The proposer could improve by adding and clearly labelling this link, and updating it with the project's current progress.\n\nThe final result of this project will not be at scale – it will be a proof of concept. However, the proof of concept will be available for pilot users and will be focused on data collected in an area in Ghana so the project could produce a useful product at the end of 6 months.", "q2r": 4, "assessor": "z_assessor_3925", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 6111, "q0": "The proposed team consists of people with a wide range of skills, techniques and more than 20 years of experience in the fields of environment, geography, ecology, remote sensing and mass development. With skills and experience, the team recognizes an urgent need for sustainable solutions with rapid adoption of intelligent environmental monitoring and diagnostic technologies. Many applications in many fields need to achieve a level of credibility and reliability. However, there are many major technology bottlenecks that continue to get in the way. The group also conducted a survey with many organizations to promote regenerative afforestation and soil carbon recovery... The team found that much of the work of monitoring and validating such projects is very expensive. expensive, time consuming, laborious and unreliable. The group has applied remote sensing technology, but this method is still limited by many factors. The team proposes to develop and deploy the Oracle environment. There are plenty of funded projects proposed by Oracle Environment and there are enough detailed links for us to be able to. The team describes each issue in detail and specifically with rates, immediate, short-term, long-term access, providing images and a lot of necessary and important information for the project's plan. The Oracle environment is also recommended in conjunction with many other work packages. In other words, I fully believe in the potential of this proposal. I think they are all described in great detail and richness. I understand what is the purpose of the content creation of this proposal. What activities will be performed to achieve the end goal of the project. In addition, the team recognized a number of risks and had all the solutions for the possible risks when the proposal was implemented. In my opinion, good proposal, impact the challenge.", "q0r": 5, "q1": "Regarding the roadmap, the proposal team provided us with multiple goals to be achieved in WP1, WP2 and WP3, detailing each work to be done by milestones broken down into months. In addition, the team emphasizes the focus of the proposal through WP4, WP5, WP6 and WP7 during January-August with the main tasks divided into several sub-tasks in different sections. We've noticed that the concept team is almost on the way to work, hitting many milestones. This conveys a lot of information and confidence in the viability and sustainability of the proposal. In my opinion, in theory this is a very good idea that is to apply Oracle Environment to deploy the project, in terms of a very detailed and specific roadmap to form a very workable plan. The requested budget is $138,000. I believe it is a fair value given the complexity of the work the proposal needs to do. The proposal provides a very detailed budget table allotted to each task to be performed, hourly, in each milestone. We clearly understand what each money will be used for, at what time. Finally about the core team members. The team has a total of 4 members who have a lot of important knowledge, necessary skills and practical experience to do the job well. Tech Lead Yosef Akhtman: has all the necessary skills and joins Lead on technology feasibility and system architecture. Magnus Edvard Nielsen: has many years of experience in many fields and has joined as Product Manager and Product Development. Very active is Scott Poynton: 30 years of experience with a wide range of skills, knowledge and experience in many fields, Scott has joined the Cardano community and was a key part of the proposal at the 7 fund.. Yoram Ben Zvi: 20 years of experience in many fields, is a CA, is a member of the AIM team, has done a related project in Indonesia ... they have united into a very strong team both in terms of resources and expertise to develop the project in a very feasible manner. The group gave a very complete presentation of each member, and attached the link profile of each member, very positive. so that we can clearly understand the context and ability of each member. The above information is very clear evidence, I believe the team has a very viable ability to complete the project.", "q1r": 5, "q2": "The proposal is completely new, but the overall plan of the proposal shows that the team's ability is very good. They have the expertise, capacity and experience to carry out the entire project process. A clear roadmap for every detail of work in each milestone is very feasible. Budgets are split and transparent. The team has provided a lot of details and specific links to easily verify what they have presented in the plan sheet. We were given a lot of insight into how to measure the progress of the project: Github, deliverables at each milestone, Google Analytics of the portal...In general, all these What the team has to offer is good. We can know what needs to be done how, in what time frame to reach the end goal. If the project is successful it will form a functional Professor of Oracle Environment concepts. The application will lead to transparency and traceability of land use, effectively demonstrating Blockchain and Cardano technology. Supports operations and applications using the Oracle API environment. If funded, the group will develop further in future funds. Application Development and Blockchain, Cardano.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6339, "q0": "This proposal is about developing Environment Oracle that will offer a source of environmental data (by utilizing space-borne Earth Observation and climate data). This oracle is required for implementing low-cost, scalable monitoring and validation solutions for carbon capture, ecological restoration projects, and DApps. It is aligned with the challenge statement as it aims to provide solutions for environmental issues. \n \nIt will significantly impact and add value to the Cardano ecosystem as it constitutes a platform and an integration layer for specific DApps who wish to utilize monitoring and validation solutions. As stated by the proposer, the example use cases of this platform are these proposals (submitted in the last fund) a) 21st century Agri Supply Chain, b) Indigenous Land Rematriation, c) Open Ledger for Agricultural Land, d) Protecting wildlife, etc. Furthermore, the proposer will collaborate with the Charli3 Oracle solution project to maximize the impact.\n \nThe proposer is attentive to the risks posed against the proposal and seems ready with the mitigation strategies if those risks rise. As mentioned, the risks are technological risk and economic viability. He suggests that proper planning and suitable maintenance mechanisms will take care of the technical risk. To overcome the second risk of economic viability, the proposer needs to bring in a minimum number of users to reach breakeven quickly. Otherwise, the long-term sustainability of the platform will suffer.", "q0r": 5, "q1": "All team members' details are provided, including their role in the proposal and their qualification and experience. The LinkedIn profile is also shared for all members; if anybody wants to dig deeper, they can do that. As reflected in the details, the teams' experience ranges from remote sensing, environmental monitoring, sustainable development, and business development. For the project's technical implementation, another team will be hired, as stated with links in the proposal. Hence it seems the team is experienced and qualified to execute the proposal.\n \nThe detailed plan is stated with the specific tasks. The project is already a work in progress, and many of the tasks are partly completed. The plan is segregated into four milestones. Each milestone is assigned with the tasks to be achieved. The duration of each milestone is stated by mentioning from which month it will start and when it will end. In total, it will be eight months which is realistic given the mentioned tasks.  \n \nThe proposer asked for a fund of $185,000. It is divided based on the eight types of tasks of the proposal. Most of them are calculated by multiplying estimated hours with a $50/hour rate. It seems reasonable as this is a kind of project which will have a significant impact and position Cardano as a leader for sustainability and environmental DApps.", "q1r": 5, "q2": "The proposal's progress can be tracked/audited from the GitHub commits, which the proposer will update every two weeks. Additionally, the milestones are used to track the progress of the proposal. Hence the auditability of this proposal is clear and will be smooth. \n \nAs mentioned above, the plan is stated and segregated into four milestones and spread out into eight months. Each milestone is assigned with tasks to be completed under that stage and as reflected in the proposal. The tasks under different milestones will be executed by the team simultaneously. I think the timeframe of eight months is realistic. Therefore the delivery dates are mentioned in months.\n \nAs stated by the proposer, the success of this proposal will be the functional proof of concept Environment Oracle that will provide data to one or more pilot user projects. They already have one target pilot; the Agriculture supply chain project in Ghana. The success metrics are the number of projects using the Environment Oracle and the number of users benefitting from those projects via this oracle.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8130, "q0": "The proposer has raised an important issue related to the environment, the scale of impact is large. The problem is that \"Monitoring and verifying carbon capture, regenerative agriculture and ecological restoration projects is difficult, unreliable and expensive.\"\nThe proposed solution is to create an \"Environmental Oracle\" platform on top of the Cardano ecosystem as a unified source of regularized multi-modal multi-scale environment data for scalable monitoring and verification. and reliable at low cost for sustainable DApps. This solution has identified most of the problems of the challenge. The author has used specific examples and actual images to describe his solution in detail and logically. Environmental Oracle will help solve a major technology bottleneck related to the challenge of sourcing, accessing, and processing relevant environmental data required for monitoring, auditing, and validation of seizure projects. carbon and ecological restoration. It will enable the development and deployment of a high-impact layer of DApps on the Cardano blockchain, positioning Cardano as a leader in environmental monitoring applications.\nThe two main risks raised by the team are technology and economic viability. The author has detailed descriptions and raised the effects of those risks during project implementation. From there, they offer specific solutions to minimize these risks.", "q0r": 5, "q1": "This proposal has a clear roadmap. The team provided a detailed plan, timeline, and concrete goals. From WP1 to WP3, the team has been perfecting. A significant portion of the scientific and technical development for the proposed project has been undertaken and self-funded. The focus of this proposal will be from WP4 to WP7. The grant budget is $138,000 (only 1.76% of the total Challenge budget) and is allocated to each specific WP. The author has explained and calculated the expenses very clearly and reasonably.\nThe team implementing this project includes experts with extensive experience in environment, blockchain development, Remote Sensing, ML, and AI. In the proposal, the author has provided information of 4 core members very detailed and complete. Some projects of team members have also been funded in previous Funds. I found that their competencies were well suited to the proposal's goals. The identity is easy to verify through the Linkedin profile provided by the proposer. In addition to this proposal, some team members have many other proposals submitted in Fund 9. This is great because the members actively contribute their ideas to Cardano. But it will also potentially affect the time management and responsiveness of the team when those projects are all funded in Fund 9.", "q1r": 4, "q2": "Project progress is transparently measured. Github commits for each sprint (2 weeks); Products delivered at each milestone (WP2-WP7); Google Analytics of the Portal (online ones). Additionally, the input collected will be published on the project's public blog.\nThe project's success is to create an Oracle environment that will provide environmental data for one or more test user projects. Product ecological data will be generated and made available on-chain for select areas of interest to assist pilot users.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "We appreciate the PA time and review but for Auditability the PA should have mentioned my 4 stars  all seems very positive. "}, {"id": 9342, "q0": "I think your ideas make sense. I like this idea because Oracle Environment it provides, accesses and processes related environmental data needed for monitoring, auditing and validating carbon capture and ecological restoration projects. Tracking the carbon footprint of each product is a way of applying blockchain to protect the environment. However, I find that in the current ecosystem, the environmental impact of each product is difficult to determine. Tracking the carbon footprint of each product can be done easily and securely through blockchain. Blockchain can also be used to create an immutable reputation system. This can be used to score companies' reputations based on how they are trying to reduce their carbon footprint. Above are my suggestions, comments on the proposal.", "q0r": 5, "q1": "Your FEASIBILITY part really convinced me. Part WP1, WP2, WP3 you have done almost done. I see that you guys work really seriously and passionately. You divide specific time and clearly state each task. The budget table is also detailed. I am impressed with Scott Poynton (Sustainability Team Leader) as he has been a true social and environmental leader for the past 30 years. I strongly support him with his mission of mitigating climate change. I believe in your project this time. Because you have very good members with experience in many fields, such as Yoram Ben Zvi with leading business models and connection to the Cardano ecosystem and more than 20 years of experience in the field. work with technology companies. There's no doubt about what you're showing. Very good.", "q1r": 5, "q2": "With the proposal that a dedicated web platform will be created for the purpose of demonstrating the results achieved, I think you should design it first and leave the link there for everyone to access. Although I have no doubts about whether this project can be successful because I am more confident that your project with good and experienced members will develop well. However, you should set a clearer goal than the goal of developing a world-class sustainable Oracle that will lead to transparency and traceability of land use around the world. Because I think that's the long-term goal. Therefore, you need to have short-term goals so that everyone can see the benefits of the project.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Environmental Oracle as a consolidated source of regularised multi-modal multi-scale environmental data for low-cost scalable and dependable monitoring and verification for sustainability DApps", "experience": "Extensive 20 years experience in \n\nRemote sensing, ML and AI\nEnvironmental monitoring\nSustainable development and ecological restoration projects\nBlockchain development\nGeographic Information Systems\n"}