{"id": 417936, "author": "alicesand", "title": "Cardalonia, A Metaverse On Cardano", "url": "https://cardano.ideascale.com/a/dtd/417936-48088", "category": 26595, "amount": 270000, "description": "The Metaverse Ecosystem On Cardano is still untapped", "f6_no_assessments": 8, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"id": 2627, "q0": "Propose a Metaverse on Cardano where multiple experiences can be combined, including NFT, and Avatar, with its own Token\nAt the same time can make a profit by it to attract users through many different modes\nWith a proposal like this, there are many parties with similar ideas and constructions, if this is successful on Cardano, it will attract a very large number of users.\nHowever, the new proposal stops at the idea, has not presented a clear and detailed plan, the reader does not know what to do and what the content will be, and lacks suggestions for future expansion and how to attract users from real life as well as from other blockchain platforms", "q0r": 1, "q1": "The proposal lacks detailed description documents and links it is necessary to provide more documents in terms of content, , techniques, and indicators for readers to grasp in more detail what the team has prepared\nThe new Core team only has a Twitter link, but it is not specific, there are no images or related information to compare and contrast. Need more information about LinkedIn, youtube channels, Experience was done, blockchain experience, and experience with the field that is asking for funding,...\nThe project is conducted in 3 phases, but phase 1 is to clearly state the items to be done, the following phases do not have more specific milestones, according to which the amount of money needs to be allocated down to the items, the number of employees detailed implementation\nIt is necessary to state what has been and is being prepared and will be implemented in the near future, technical aspects and risks have not been mentioned here.", "q1r": 2, "q2": "Auditing and monitoring the project is an indispensable thing, this factor is very important for the project to raise capital and will be monitored by the community.\nThe new proposal only outlines the necessary indicators, but it is necessary to add KPIs associated with each Phase and the milestones to be achieved in it.\nFor example, Q3-2022: How many people will the Release Demo attract, and how much money will the community marketing plan spend at that time?\nAccompanying that is the roadmap, the milestones to be achieved in each stage need to be more clearly stated\nIn addition, there should be another public channel for information on progress, personnel, and disbursement to help the project be transparent and the community can monitor and support it in the long term.", "q2r": 1, "assessor": "z_assessor_2325", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5306, "q0": "Although at least five other Metaverse projects on Cardano are already building an MVP (see CardanoCube or Google search) and have started selling land, there is always room for another one if a large enough audience can be convinced that the project provides them with a worthwhile experience. This could be escapism, a fun gaming experience, attractive incentives to trade items and play to earn, or a chance to interact with friends in a revolutionary new way. This makes Cardalonia a worthy contestant and effective match for the challenge setting.\nNone of the features seem to be exclusive to Cardalonia: a medieval theme, staking, land sales, customizable avatars and a token are all features of existing Cardano metaverses currently being built.", "q0r": 4, "q1": "The main proposer provides a Github profile that states \"I exist only in the metaverse\" and the rest of the team provide Twitter profiles which did not allow me to identify the individuals behind this project or their relevant work experience and existing portfolio of work. The only profile is for the Liaison manager who does not seem to be a core member of the team. As this proposal is for creating an immersive, fun-to-play and fully blockchain-integrated Metaverse with GameFi elements, a high quality delivery and trust in the financial ecosystem underpinning the virtual economy are of paramount importance for the long-term success of the project and the smooth delivery of the MVP. Without being able to assess the skillset and quality of work from the main UX and game designers, programmers and DeFi experts of the team, this makes it less likely or less verifiable that the implementation of the project will be successful. Mockups of the metaverse look relatively low key and unlikely to provide an experience that could rival Pavia or Cardano Island, or produce some unique experience and new feature that would draw in sufficient funding to make the land sale and token financially viable, which are the key metrics of the project's success.\nThe team are apparently very good at SEO, as they currently appear on top of web searches for Cardano Metaverse - on top of even Cardano Island by Virtua who have partnered with IOHK for the Cardano Summit and seem to be building with a much larger budget - so kudos to them for this. It will be a useful skill to have when selling land NFTs.", "q1r": 3, "q2": "The success criteria and auditability information entirely centers on the financial aspect of the Metaverse. Apart from the commits on Github, all other metrics are related to token sales, staking, vault, active players and land sales, with no metrics provided to judge the pre-launch performance such as metrics describing the completion of the virtual landscape, graphics performance/rendering, wallet integration, social media interaction or any other possible metrics in that direction (just suggesting a few here). This is fine and appropriate if you see this project as foremost Play-to-Earn and immersive/fun to play second, but is in my humble opinion somewhat risky as the financial environment has deteriorated a lot for GameFi and play-to-earn since the beginning of the year. It is not immediately obvious whether the summer of 2022 will be a good time to market the financial side of the game alone - there needs to be a USP for players to flock to the community and storytelling, regardless of market conditions, so for $270k the metrics seem speculative at least and might be very difficult to audit for partial success if the play-to-earn aspects do not find a favorable enough environment. Most of the team's contacts are on Twitter, and some of the proposers only exist in the Metaverse, so it could also prove difficult for the challenge team and auditors to follow up with people who do not share their real world contact information and identity as transparently as other proposals asking for funding in this category.", "q2r": 4, "assessor": "z_assessor_2688", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6341, "q0": "This proposal wants to develop Cardalonia, a Metaverse game, which will have multiple civilizations represented as NFTs on Cardano Blockchain. Players can also create custom experiences, buy land, and customize their Avatars while staking their NFT assets to earn rewards. Several Metaverse projects are currently building on Cardano, such as Cornucopias, Cardania, Cardano Village, Mocossi, etc. This project will become part of this list post-launch. It will contribute positively to the Cardano NFTs and Metaverse ecosystem. Therefore it will add value to the Cardano ecosystem by bringing many new users in the form of game players and NFT & Metaverse landholders. Furthermore, in terms of impact, it will have a global impact as it will have users from all over the world.\n\nThe proposer mentioned a lack of funding as a potential risk. But I think the main risk will be the lack of interest from the people as the Metaverse gaming projects are increasing on Cardano, and the competition will be high, and it seems some projects will gain more traction than others, and some may die. But it looks like the proposer has started community building for the game as it's verified Twitter handle already has more than 15k followers; this will help the project's success post-launch.", "q0r": 5, "q1": "The proposer provided his team details who is responsible for this proposal execution and their Twitter, GitHub & LinkedIn profiles. Anybody interested can check further by using these links. It seems that the team is capable of executing this proposal.\n\nThe plan is described with various milestones without any technical details. Moreover, it is divided into three phases, each phase to be completed in six months. Thus it would take 18 months to execute the entire proposal. But it would have been better if the proposer could elaborate on the plan more and divide the six months based on those details.\n\nThe requested budget of $270,000 is relatively high but seems justifiable based on the proposal. On the other hand, the Cardalonia team is conducting a $Lonia token pre-sale and has already raised more than 400k ADA at the time of this assessment. So I wondered why the team had come to Catalyst if they already had another funding source. Also, they are expected to make more game NFTs & land sales which will provide more funds. Anyhow, the budget brake-up presented is based on the type of expenses and not on identifiable technical plan tasks.\n\nConsidering the above points, I still think the proposer will likely implement the proposal, but more details and specifications should be provided.", "q1r": 4, "q2": "The proposer said they would track the proposal's progress with the number of commits on GitHub, the number of users who staked their $Lonia tokens, and the number of users on the vault. The first metric is useful to track the progress while under execution. The remaining other two are helpful to measure success after the game launch.\n\nStill, it would have been much better if the proposer had provided more technical developmental details about the project. It would have helped in tracking the progress. Also, if the proper brake-up of the budget had been provided, that would help auditing easier from the budget's perspective.\n\nAs stated above, the provided timeframe of 18 months (6 months for each phase) is not specific. Therefore, I suggest the proposer give a detailed plan with individual tasks and assign a period to those tasks for better clarity.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8131, "q0": "Metaverse is one of the most talked-about terms in recent times. Metaverse is said to be a decisive step forward in technology. In the context that the metaverse on the Cardano ecosystem has not been exploited much, this proposal will create something new and promote the development of the system. The proposer described solutions in quite detail; through the link to the project website provided by the proponent, there is all the information that the reader needs. Cardalonia is an entirely decentralized virtual world where users can create custom experiences, build, buy land, and accumulate assets to earn Rewards on Cardano Blockchain. This proposal meets the challenge of creating an application on Cardano and helping attract new players and accelerating the system's growth.\nThe only risk of the project raised by the proponent is the lack of funds to develop the project, as they have been developing the Cardalonia Ecosystem since Q1/2022. I think that the risk of competition is currently on the market there are many projects about metaverse, so does the team's project have any difference to compete with other projects.", "q0r": 5, "q1": "The proponent presented a complete roadmap with a detailed plan and clear goals. The team has started implementing the project from Q1/2022, and the implementation progress has been explicitly updated, following the given schedule. In addition, the project has token issuance (LONIA), tokenomics, and token allocation, which are transparently presented on the project website.\nThe project's proposed budget is $270,000. However, when I add up the costs in the budget analysis provided by the author, the result is $267,150. It is possible that there was an error in the calculation process. The budget is broken down, but there is no detailed explanation. For the better, the author should add an exact calculation, maybe break down the costs and add a description for the analysis.\nThe project website has complete information about members, job duties, and personal profile links. They are both experienced and competent in the online gaming and cryptocurrency industry. I found that they met the goal of the proposal.", "q1r": 3, "q2": "The proponent has come up with easy-to-measure, easy-to-check KPIs. There are three indicators to pay attention to The number of commits on Github; the number of users who have staked their $LONIA tokens on their Vault; the number of custom Ada handles on the Vault Leaderboard. I believe that new updates and implementation progress should be transmitted on the project's youtube channel so that the community can easily follow back to save time, increase transparency, and increase interaction with the community. \nThe project's success is easily determined through the specific numbers set by the team. It was selling off NFT land, getting more than 50% of Lonia tokens placed by early adopters on their Vault and more than 100,000 active players on Cardalonia when it was launched. In addition, I believe that the project's success is the achievement of the goals according to the project's roadmap.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 9502, "q0": "I end up ranking this section as a 1 for shortage of substantial impact and addressing of the problem statement for an extraordinarily high asking price. Since Catalyst voters are all members of the Cardano community, all voters will be acutely aware of the highly saturated market that is Cardano metaverses (and this needs to be addressed in the impact risks section). This being the case, any metaverse project (especially with such a high asking price) is going to need to really stand out from the competition by clearly highlighting unique features that no other metaverse project is providing. It needs to be remembered that the mission statement of Cardano is to generate the highest levels of innovation, so voters are looking for things that are new and innovative. I might also suggest reframing the problem statement to point out whatever might be lacking in the industry that Cardalonia provides.  I also think the risks section needs to display some honest effort because there are most definitely more risks than just lack of funds. Without thorough thought in this section, it tells voters that the proposal is unprepared for legitimate risks as they didn’t demonstrate the foresight to prepare for it. ", "q0r": 1, "q1": "I end up ranking this section a 3 because there is enough information to show me what is being done but not enough information to prove to me that it can be done. The pillar holding up this section is the roadmap as it contains plenty of information on what is planned to be done, what has been completed, and it’s organized in a neat timeframe based roadmap. If I had to give feedback on that, I’d mention that the best proposals I’ve seen give little subpoints that gives brief descriptions of the task. Where this section falls short is the experience details of the team and the details about the budget. We have virtually no information on the core team members, which is not uncommon for tech developers because it can sometimes compromise other roles/jobs that they might be involved in. Still, in a professional grant proposal we need to see at least a brief description of the job title and professional experience of each core team member. This is important for voters to be able to evaluate capability and justification for compensation (if applicable). In this case, the entire budget is going towards developer compensation, so it’s especially important to know if Catalyst funding would be spent efficiently. Beyond appropriate payment rates, this budget does not provide details of what timeframe these amounts are paid over and for what number of hours of labor. Some cleaning up would add major value to this section of the proposal. ", "q1r": 3, "q2": "I score this section a 2 because there is some measurable content but not enough to provide any substantial measure of success in the eyes of voters. Voters will likely not be impressed by the amount of content provided in this section but there is some solid starting points. I think that Github interaction, users staking in vaults, and how many adahandles on the leaderboard are good metrics to measure with but I do want to know what targets your aiming for. The best proposals I’ve seen layout milestone based metrics with specific number targets for each timeframe. I want to know what the proposal considers success and when might be a time to make adjustments along the way. I would like to see more metrics revolving around the project for things even as little as social media engagement. This proposal also doesn’t list any deliverables the demonstrate to the voters that on schedule production based goals are also kept in mind as a measurement of success. I think this section needs a lot of work to demonstrate to voters that the proposers are holding themselves to some kind of standard. SIDE NOTE: I would suggest reworking the SDGs to align with standard SDG ratings. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10574, "q0": "“Cardalonia, A Metaverse On Cardano” is a good idea and meets the challenge of “Dapps, Products & Integrations”. The proposal raised an important issue, which is: “The Metaverse Ecosystem On Cardano is still untapped”. I find that the exploitation and development of the Metaverse ecosystem are correct because as the Metaverse develops, it will open up a more multi-dimensional user interaction online space than current technologies. Instead of just viewing digital content, users in Metaverse can experience the space of a virtual digital world. \"With Metaverse, you'll be able to realize everything you can imagine from meeting with friends and family, working, learning, playing, shopping, creating - as well as complete experiences brand new doesn't fit the way we think about computers or phones these days... In this future, you'll be able to teleport in the form of a hologram to be at the office without no need to go to work, at a concert with friends, or in your parent's living room to catch up,\" Zuckerberg wrote in \"Founder's Letter, 2021\" released on October 28 proves that exploiting and developing Metaverse is a right idea and choice of the proponent. I see that Blockchain and Cardano technology is a potential ecosystem, expanding its influence and having many practical applications in life, so mining Metaverse on Cardano will help Cardano become more complete and meet people's needs helping to attract more people to research and join the community. In this proposal, the proponent presented, Cardalonia will introduce a community-focused web3 ecosystem on Cardano where people can customize experiences, buy land, and stake their assets to earn As a bonus, they will create a 100% community-centric Metaverse managed by $LONIA utility token holders. I find this solution very closely related to Metaverse. The solution proposed by the proponent identified most of the problems of the challenge. They raised the situation to emphasize the impact of the problem. To successfully implement the project, the proponent has foreseen the risk, which is a lack of capital to continue developing, but this part, in my opinion, if possible, the proponent should have solutions to solve the problem overcoming this difficulty such as setting up a reserve fund, applying for additional funding, etc. The preparation of risk reduction measures in advance will help the group solve difficulties and challenges quickly and flexibly and more actively.", "q0r": 4, "q1": "The proponent has provided a clear timeline for implementation, including three phases. Each of these stages is expected to last for 6 months and identify specific tasks and tasks that need to be performed. Then, they also present the quarterly progress of 2022, what has been completed and what is underway very clearly and transparently, making it very easy for everyone to follow and understand the progress and project results. Regarding the project budget, the proponent has outlined how to allocate and use each part of the budget. Such expenses are detailed and reasonable. However, in this section, I only see the costs of paying for personnel, there is no budget for machinery, equipment, and supporting tools. Here, according to the sections of the budget to be paid, the total amount to be used is $267,150 but the proposed budget is at $270,000, maybe there is a bit of confusion here. In addition, in my personal opinion, when starting to exploit and develop a project, risks and challenges are inevitable, so if possible, the proponent should deduct a small part of the budget to set up a risk reserve fund. Regarding the team involved in the project, the proponent provided the information of 5 members, the information given included their names and positions, and also added social media links. It is quite complete and clear. However, where possible the proponent can provide summaries of information regarding their work experience, qualifications, and suitability for the project. That will make it easy for everyone to track and capture basic information about participating members.", "q1r": 3, "q2": "To measure the progress of the project, the proponent presented how they track progress, which is based on the number of commits on Github, the number of users who staked their $LONIA tokens on their Vault, how many custom ADA handles are on the Vault Leaderboard. I see these criteria quite clearly, but in my personal opinion, if I add more specific figures for the community to easily monitor and evaluate the completion rate of the project, it will the more wonderful. The success of the project is also clearly defined through detailed numbers such as more than 100,000 active players on Cardalonia at launch, sold-out NFT land, received more than 50% of Lonia tokens staked by acceptors get early on their Vault. Providing this specific information I think it will help increase the auditability of the project. This is a new project, but I can see the methodical preparation, investment of the proponent, and the impact and positive impact of the proposal on the community. The proposed team also intends to develop a self-sustaining Metaverse ecosystem on Cardano.", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10668, "q0": "This Cardalonia idea is also to create a Metaverse space built on the Cardano blockchain, a 3D gaming ecosystem.\n\nBased on the ideas and products made I respect the author, however, with experience researching many projects on Metaverse space I have some more practical advice.\n\nIn terms of ideas, this may be a good idea, but it lacks the sustainable development elements of a project selected in the direction of Metaverse space development.\n\nThe Cardalonia Metaverse will be made up of multiple civilizations represented as NFTs on the Cardano Blockchain, each of which will have underlying NFTs that can be farmed by the Player. I haven't seen the attraction here yet.\n\nThe fact that an ecosystem only has functions like p2e, creating character avatars, exchanges, transactions, buying land, and buying NFT,... all these activities are not enough to make a game attractive. virtual space. I share with the proponent that there are thousands of Metaverse gamefi projects running like this, and they are not successful in reaching gamers, instead making game projects more and more popular. down.\n\nI have spent time reading the information on the website, and the documentation of Cardalonia (https://docs.cardalonia.io/cardalonia-gameplay) so I almost understand the whole idea of ​​this Cardanlonia game. With gameplay lacking in player attraction, this idea will not be feasible, and yet, being a space game about Metaverse but without a game story, this is a big shortcoming.\n\nCurrently, almost 98% of gamers in the market are bored with gamefi project NFTs, because in essence, they are still dependent on the project team, no matter which NFT is built on any blockchain. , but the project does not develop the player, the NFT of that game also becomes worthless in the market (even though the gamer has spent money to buy NFT in the market).\n\nWe will easily see this on the NFT Opensea marketplace. So how will the team solve this problem, now I see the team's development activities are similar to the projects in the market (and they have failed).\n\nAn in-depth look at the project's tokenomics and business model (https://www.canva.com/design/DAE9YQf2fPA/jKY2zq4_vqbeRa41T6yr_g/view?utm_content=DAE9YQf2fPA&utm_campaign=celebratory_firstatory_publish&utm_medium=link&creation) A private token requires a clear tokenomics problem.\n\n100,000,000 LONIA will be minted to be the governance token in the game, but 50% will go to Public Sale rounds, which will lead to a failed behavior where most users/or investors will take advantage of the price. and sell-off, leading to token devaluation and gradual loss of value.\n\nThis problem is the status quo of 99% of the gamefi projects on the market today, it's the players (gamers) who help maintain the game platform, because they're the long-term players, and then sold to investors in a public sale, seed round or private round, they are not the ones who help maintain the game platform. Therefore, it is recommended to consider this source of documentation.", "q0r": 1, "q1": "Based on the documents the team proposed to provide about this P2E Metaverse Cardalonia game, I comment that the feasibility for the game to be successful is not high.\n\nA successful Metaverse gamefi will have many different elements, but the key elements to make a solid foundation are not found in this project.\n\nFirstly, the gameplay element must attract and stimulate gamers. If you only stop at feature activities such as the presentation team, the ability to attract is not high.\n\nSecond, related to NFT, the sale of land, characters, and items in the game, if there is the only one-way benefit, it will fail. That is, gamers now, their faith in the NFTs in the game is gradually disappearing, because most of the NFTs are related to the developer, if the game fails, it does not attract the gaming community. That means that gamers who bought NFT early on will be the ones bearing the loss, and there will be no trading activity on the exchange. There is a lot of supply, but no demand.\n\nThird, regarding tokens, creating a separate token for the game is also a good thing for the project's ecosystem, but 50% of the supply is only for the sale of public sale rounds, which will lead to sell-off, tokens are no longer valid, investors and gamers gradually leave.\n\nFourth, the source of revenue, if the business model only generates revenue from transaction fees from the purchase and sale of land and services on the market, the whole project will fail in a short time.\n\nThe data I analyzed above is located on Cardalonia's website. As for the plan they come up with here, it's in the game development stage.\n\nAbout the information of the founding team, I find it not very transparent, because almost all of them have the same avatar as NFT, and almost 4 out of 5 members have rather sketchy profiles and unreliable information. . Even the advisors, I don't know their experience when they only post 1-2 tweets on social networks.\n\nI rate the feasibility as 1 star.", "q1r": 1, "q2": "A game product cannot be measured as sketchy as the team mentioned. I recommend measuring progress across multiple stages and multiple milestones. For example, this stage is the product development stage (through code or gameplay demos), the stage of token sales rounds, how many % of the target are sold, the number of media interactions connected with KOLs, gamer community - game guild,...\n\nI rate the proponent here describing their success based on feelings and not on salary measurement or analysis of actual numbers, the project proponent will receive more than 50% of the Lonia tokens staked by Vault early adopters, Over 100,000 active cardalonia players at launch, NFT land sold out.\n\nI have analyzed this proposal quite carefully, hopefully, the proponent has more perspective to change this planning.", "q2r": 1, "assessor": "z_assessor_3191", "no_vca": 7, "ne": 2, "ng": 2, "nfo": 3, "vca_o": 1}, {"id": 11508, "q0": "Proposal wants to create metaverse product where users can buy land, customize avatars and stake & earn rewards. I would consider this idea a great if there wasn’t already and product named Pavia which is functioning and solves problem described by proposal. By creating a similar product I don’t see any additional value to Cardano ecosystem as there is need for more diverse products to cover lots of different needs of users. This metaverse game/dApp is also already being developed without need of funding. With provided assessment I evaluate this proposal as not impactful.", "q0r": 1, "q1": "Proposer provided links for twitter accounts and one GitHub account with forks of different projects, not containing work done by team on this project. Provided references are weak and it is hard to evaluate if successful implementation of project will be done. Budget is split for roles on project without further explanation, a detailed information would improve proposal. Timetable is provided and set on 3 phases with 6-month duration, this is reasonable and realistic. Technical aspects are not mentioned and conductible plan to assign roles to work done is missing. Main risk which is not mentioned is inability to attract people due to already existing and successful dApp Pavia, which would turn into low to none incomes. With general information for feasibility provided but without proper details and missing risks and mitigations I rate this 2 of 5.", "q1r": 2, "q2": "Proposal provides GitHub repo where project development progress could be tracked but no project for this proposal is created, as this project has already started in Q1 2022 and proposal doesn’t state that this project will be open source, it is not auditable and public channel for regular updates is missing. KPIs are set to number of commits on GitHub but link is not provided, and to count users and stakeholders. Also, for this KPIs an additional information where data will be published and can be audited is missing. With provided information proposal audit will be hard, as lots of incomplete information is provided. I believe 3-star rating is valid, as there is some information and KPIs for audit.", "q2r": 3, "assessor": "z_assessor_3255", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Cardalonia will introduce a community centric Web3 Ecosystem on Cardano where you can create custom experiences, Buy land, Customize your Avatar while also staking your assets to earn Rewards.", "experience": "We are made up of a team of entrepreneurs, developers, content writers and designers with more than 10 years of experience in the crypto and online gaming industry with many Indian clients."}