{"id": 417971, "author": "foreignchemical", "title": "Defipronto: Cardano IDO Launchpad", "url": "https://cardano.ideascale.com/a/dtd/417971-48088", "category": 26595, "amount": 54000, "description": "Cardano's fast growing ecosystem has given rise to new tokens being minted and most being sold to the cardano community. Most project founders don't have a trusted IDO platform to launch their ideas.", "f6_no_assessments": 5, "f6_rating": 2.4, "videos": [], "media": [], "f6_assessments": [{"id": 382, "q0": "Defipronto is a Cardano IDO launchpad that has started development in recent months and is looking for funding to continue its development. They start with a statement that 'We will also develop an NFT launchpad for creators, artists who want to mint their Non Fungible tokens on Cardano'. It is not clear of the exact necessity behind the NFT creation tools and how they will differ from established players in the market such as NMKR. This makes it difficult to know whether this tool would have much impact in the ecosystem. In another statement about the solution they state 'To Protect Our Investors from Fraudulent Projects Or Developers who abandon projects, Each project that launches through our platform will allocate a certain amount of any raised funds to our insurance treasury, this will provide participants a sense of against potential project failure.'. This statement does not make much sense in terms of it being effective at preventing bad actors - they would simply be holding a portion of the funds whilst the project could still be a malicious actor and take any remaining funds. Some other statements in this section are also just marketing jargon such as 'Defipronto will significantly contribute to the mass adoption and luquidity generation on the Cardano blockchain.'. It is unclear exactly what impact this IDO could create based on the information provided.", "q0r": 2, "q1": "The proposal adds two break downs of the MVP development budget. Budgets are used in two sections of feasibility and have different numbers used for the calculations. Two names are provided with Twitter links for who is involved with the ecosystem. The profiles do not indicate who the team are and their professional backgrounds. This makes it difficult to know whether they can feasibly execute this proposal. The proposal team should look to include more information to verify who they are and what their background is so it can be determined whether it will be feasible for them to execute this proposal. A break down of the timeline and roadmap should also be added in sufficient depth to showcase the proposers understand what is involved in executing the proposal.", "q1r": 1, "q2": "The proposal team provide a Github repository that would host the work for the proposal. The proposal team do not indicate what would be open source from their development efforts. The team could have added more specific success outcomes for this project and how it differs from other existing IDOs in the ecosystem. More clarity is needed in this proposal on the exact intentions for delivery, the budget, roadmap and more specific success outcomes they want to achieve.", "q2r": 2, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2075, "q0": "This proposal is very good and fits perfectly with the goal of the challenge. The problem is that the project founders do not have a reliable IDO platform to launch their ideas. So the solution was to develop a community-focused IDO launcher (DefiP Toronto: https://defironto.com/ ) where community token holders can propose, vote, and finance any approved projects. Defi-Pronto will play an active role in strengthening the industry by connecting viable projects with investors and at the same time connecting investors with viable projects that provide alternative solutions. Better best practices and enabling better user experience, will grow and increase adoption of the Cardano ecosystem.", "q0r": 5, "q1": "The feasibility of the project is not convincing in terms of roadmap, budget, and team because many details have not been satisfactorily explained. The roadmap and budget in this proposal are presented quite confusingly. It can be said that they are presented 2 times, I don't understand if the first explanation is more detailed and the second is more general, but anyway, let's evaluate it by section. In the first explanation of the route, we get to know what missions will happen, how many hours the missions will take, and how much each mission will cost. The total budget for this portion of the roadmap is $54,000 in line with the budget required by the proposal. In the second budget explanation, several tasks are also presented (different from those on the roadmap) and tied to a monthly timeline along with the required amount of each of those tasks. In this section, the total budget required is $165,000. So it's confusing for the community because we don't know in this proposal, what work do you guys want to do and exactly how much money needs to be done on this project? And finally, about the project team, this part is also very superficial, we only know the names of the 2 project co-founders along with their Twitter, I think the information provided is not enough to assess the capacity to carry out their projects. We need to disclose their full names, as well as their professional background, including previous jobs (so we can see what experience they have), as well as how these people are related to our blockchain. In addition, team members need to provide more information about themselves, their full name, affiliation profile (if any), their detailed role in this project, etc. This way, there is more confidence in the team's ability to successfully carry out the project. In short, in my opinion, the feasibility of the project requires a complete rewrite.", "q1r": 2, "q2": "The success of the project is well-defined, which is the original goal of the proposal: Have a fully functioning MVP that is an IDO Launchpad on the Cardano mainnet. However, about the ability to track the progress of the project, I think it is not convincing. The proponent states that the Cardano community can easily follow and check the progress of Defip Toronto as they will update the developments weekly on their media blog and also through their social channels until when the MVP is released. However, as mentioned in the feasibility section, the project's roadmap is not convincing, besides there are no KPIs given, nor any small goals set, so I cannot determine whether we will audit. How is this project in terms of the development process? My recommendation is that the proponent builds a roadmap with well-defined activities, including very precise periods so that we can figure out what is being done and measure whether Is it being done at the promised time?", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2566, "q0": "The proposal identifies the problem of missing trusted IDO launchpads to launch new Cardano tokens. However, this statement focuses only to project founders and I think that the problem definition should also include the investors that will use the launchpad to participate in IDOs. The proposal provides some links to the website that will host the launchpad and this is a good evidence of how the solution will look like. This is a good starting point although the core functionality requires development.\nThe proposal touches upon the protection of the community backers but it somehow fails to explain how the launchpad will be trustful and the investments will be secured by fraudulent projects. Also, the lack of funding if the proposal is not voted is not an actual risk for this project. I would expect some risks identified for the delivered product instead, like low adoption of the launchpad, low number of project launches, approving fraudulent projects etc.\nIn any case, the proposed solution of creating another launchpad that will support IDO for new Cardano  tokens or NFTs will drive the adoption of the Cardano ecosystem and it will have a positive impact for it.", "q0r": 3, "q1": "Unfortunately the proposal does not provide any details for the project team that will develop the solution, other than two nicknames and their corresponding twitter accounts. Thus, the experience and the skills of the developers cannot determine a successful implementation.\nThe project plan and the budget are mixed together without providing a clear timeline and cost breakdown. Another negative point is that the sum of the development costs does not match with the development budget mentioned in the plan ($165k vs $54k). The working tasks are not analyzed and it is not clear how the estimated costs are derived.\nIt would be also valuable if the proposer included a white paper or at least describe briefly the technical aspects of the software architecture and the technology used to implement the solution.", "q1r": 1, "q2": "The proposal lacks a roadmap, project milestones and a time horizon to deliver the solution, It is unknown how the project will be executed and there is no information on how its progress can be tracked. Without specifying any key metrics it is not possible to measure the success of the project so I believe that the proposal has failed for its clarity and it cannot be auditable by the community.", "q2r": 1, "assessor": "z_assessor_2322", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3679, "q0": "The team wants to build an IDO launchpad where they will vet projects that enter the launchpad and have projects commit funds to an insurance treasury in case of a rug pull. There are already other launchpads out there and this proposal doesn’t seem to address how they will be better than others, if there is a lack of a clear benefit that other launchpads can’t provide, starting so many launchpads will only lead to fragmentation and more confusion for projects starting out and looking for funding and an audience. The amounts asked for are also on the high side given that more experienced teams building more complex products don’t ask for amounts that equal a full time job at a cushy big tech firm. ", "q0r": 3, "q1": "It seems the team wants to stay anonymous which is ok, but care needs to be taken and funds should only be released after completion of each milestone. But milestones aren’t detailed so this makes it hard to verify the completion of a milestone in order to release funds. It also seems like the Twitter profiles linked are kind of new with not many followers which seems shady.", "q1r": 2, "q2": "They have linked their GitHub repository and are sharing updates with the community regularly via Medium and other social channels, so there is a base level of auditability. But metrics could be added that can help quantify success such as number of projects seeking to join the launchpad, how many have successfully launched, total amount raised etc. ", "q2r": 3, "assessor": "z_assessor_2468", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9503, "q0": "For thoroughly addressing the problem statement and providing clear rationale for their intended mechanics of operation, I rank this section a 4. To be entirely fair, the problem statement is only technically correct as there are other IDOs that are developing but there is not one that is yet functioning (at least not one that has maintained community trust). It may win favor with voters to address this in the “risks” section, to demonstrate that the proposers have considered a wider variety of risks and are prepared for different circumstances. I do think this IDO attempts to provide a certain level of uniqueness by taking a community driven approach and establishing a insurance treasury to protect against project failure. This proposal also takes some extra steps to quantify impacts by citing how much money was stolen by crypto criminals in 2021, which provides a tangible backdrop that justifies the cost-impact analysis. I do think these impacts could be further defined by citing information specific to Cardano like current volume stats, growth of the platform, upcoming launches, and other things of this nature. I vote pretty confidently positive but I do think there are a few areas that can be buffed up to secure a 5. ", "q0r": 4, "q1": "For lack of detail in development team, inefficient spending and minimal  roadmap planning, I rank this section a 2. If voters are evaluating a proposal’s feasibility through the lens of the capability of the core development team, voters are not given enough information to provably evaluate capability and experience. This proposal only provides team member pseudonyms without cited experience descriptions or LinkedIn profiles (Twitter links do not provide any additional information in this area). As far as the budgeting goes, it’s not the MOST inefficient proposal I’ve seen but it is pretty confidently in that category. The Backend Developer earning $75/hr translates to $146k/yr (which is about $20k above industry standards) and the smart contract developer earning $70/hr is about $$136k (on the higher end of industry standard). The roadmap only identifies a few broad categories for actionable steps and doesn’t provide any timeline for completion, so voters will need a lot more substance there to react positively. ", "q1r": 2, "q2": "Since the only standard for success of this proposal is completion, I rank this section a 2. With only a few sentences of content in this section, there is not enough substance here for voters to thoroughly evaluate an appropriate success-impact link. Since a completed project on its own makes no impact to the Cardano ecosystem or anyone adjacent, voters are less likely to react positively to completion alone. I think there’s a lot of room here to identify KPIs like platform latency/stability, number of functional tests, number of beta testers, success percentages, and more measurable beyond the MVP stage. The proposal can secure more voter confidence with objective target metrics (bonus points for multiple target milestones across a wider timeframe). I think there’s potential here, demonstrated in the mechanics, but voters need to be more assured that the team has a specific vision for performance to react positively. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Defipronto will be a Cardano focused IDO Launchpad for Cardano Native Tokens & NFTs.\nDevelopers building on the Cardano Network can get funding and early support from a community of backers.", "experience": "Foreign Chemical: Founder & CEO Of Defipronto\nMili Sac: Co-Founder"}