{"id": 417955, "author": "lidonation", "title": "Catalyst Research & Voter Tool", "url": "https://cardano.ideascale.com/a/dtd/417955-48088", "category": 26595, "amount": 34560, "description": "Catalyst generates massive data siloed in zoom chats, discord, spreadsheets, & on Ideascale SAAS product, limiting the community's ability to learn from the talent and wisdom within Catalyst.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 6424, "q0": "This proposal suggests implementing a Catalyst Research and Voter Tool to keep information that is usually set aside and forgotten. There is a lot of work that goes into Catalyst research and with this proposal, they plan to help store this information so that it can be looked back on in the future. This poses a challenge to the community because those brilliant ideas and considerate amount of research is archived and lost. This could be extremely important to the Cardano ecosystem because it will keep record of the important ideas that have come from the dedicated community members and workers. For these reasons, I believe this is an important proposal and it can help benefit the future of Cardano by recording events and records. For these reasons, I give this section of the proposal 5 stars.", "q0r": 5, "q1": "It is a good sign to see that the proposal includes the identity of some of the team members. Including these linkedin helps verify that the project is okay with their names being used. This adds the element of accountability because their identity is known. This typically is a good sign that the proposal will likely be implemented successfully. Let's look at some more factors though. Another thing that is a good sign is there is a very descriptive roadmap. This highlights all of the things the team plans on accomplishing with this proposal. The roadmap gives specific details and dates. It suggests that it will be around a 6 month project and it highlights what will be worked on each month. There is also a detailed budget breakdown that is very clear on the amount of funds requested and where the funds would be allocated if funded. This leads me to believe that this proposal has a high likelihood of being implemented successfully and it is creating something that will be beneficial to the Cardano community. By creating their research and voter tool, I believe that a lot more ideas that would have been archived and lost, can lead to new innovation and utility on the blockchain. For these reasons, I give this section of the proposal 5 stars.", "q1r": 5, "q2": "When it comes to auditing the potential success and progress of a proposal. There are a couple of things that are very important. The first important concept is transparency from the team. The community wants to see a team that is willing to be completely open and transparent with them. This helps build trust and will allow the community members to become loyal. With a specific proposal, it will allow those members to become invested into the idea of the proposal and will lead them to want to support it in any way that they can. This leads to the second principle which is accountability. Holding the team accountable for their proposal is extremely important. The proposal is written very well and has specific dates and times of completion. This allows the community to hold the team accountable to something specific. Without having a S.M.A.R.T. goal, there is no use. An easy way to grow a large community is to share your ideas with the community. If it is something that will benefit them, they will be excited. In this case, the idea of a Catalyst Research and Voter Tool can be very valuable if marketed correctly. For these reasons, I give this section 5 stars as I believe that this proposal is likely to be successful.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7186, "q0": "The proposer is attempting to solve the problem of not having enough tools available to Project Catalyst members and users to explore the information being presented on lidonation.com. The solution is to implement more development and useful tools that would ensure voters and participants can easily navigate better than what's currently provided. Members from Catalyst are coming from Idealscale and other platforms to cast their votes for the projects they're interested seeing succeed, yet beyond the proposal and the assessments available, the lack of follow up information in regards to further advancement of the ideas and implementation are not easily found. One must take it upon themselves to do an enormous amount of research in order to track down the available information if they wish to learn fully about the individuals, teams, groups and companies participating in Project Catalyst and on the progress that's being made on a weekly and monthly basis. The proposer has devised a plan to implement additional search features on site to enable a way for users to view and stay up to date, learn more insight into the projects and individuals behind them, resulting in a more connected Cardano ecosystem. Being that we're in Fund 9 of Catalyst, it would be beneficial for the entire community to have the ability to search keywords, titles or tags from all relevant proposals and funds to make a more educated decision when voting, as well as finding ideas which have potential to add incredible value to the Cardano blockchain members may have missed or have not found due to the current limitations. The impact of the proposal rationale is given a 5 based on the solution to the problem which will benefit all Project Catalyst and Lidonation members, allowing for more information to flow through the community as a whole, creating a more well diversely educated and stronger Cardano for years to come.", "q0r": 5, "q1": "Given the success of what the proposer, Darlington (Linkedin profile shared: https://www.linkedin.com/in/profd2004), and his team has accomplished thus far with Lidonation.com, it is very likely the solution to the problem will be successfully implemented if funded. The proposer has over a decade of experience and is the co-founder of Lido-nation as the senior developer behind it's catalyst research tool, voter tool, & visualizations. With the help of team member and co-founder of Lido-nation, Stephanie (link to profile here: https://www.linkedin.com/in/phuffyking), the proposer sees no major issues with their ability to solve the problem. A sensible and achievable plan with such a considerable small budget (35,000usd) is a testament of their dedication to deliver a cheap yet effective working product in a reasonable amount of time. The timeframe given by the proposer is estimated to have full integration completed within 6 months, and some features being implemented within 3-4 months such as new filters and updated infrastructure. Any additional assistance may come from other Lido-nation members and their profiles can be found here (https://www.linkedin.com/company/lido-nation). The rationale for Feasibility is a 5 based on the amount requested and the team's involvement and continued presence within Project Catalyst's community.", "q1r": 5, "q2": "The auditability for the proposal is somewhat reliant on the success of the features being implemented and the engagement from Catalyst and other member's within the Cardano community to gauge and provide feedback. This is somewhat of a vague definition of success, though once these tools are available, only time will tell if community involvement on Lido-nation will increase. The proposer plans to have a full audit of the data and it's accuracy be completed by the end of 6 months. The proposal's roadmap and the milestones would be better suited to be documented in a coherent and transparent fashion on a weekly or monthly basis, though in doing so may take time away from overall development, which is the main solution to the problem. Having Lido-nation's team and the integrated updates being shared via the platform itself should be an efficient way to track the progress in real time, while receiving user feedback. The only risk to the proposal is possible lack of engagement from the Catalyst community, though this is highly unlikely as most if not all will be using Lido-nation for current & future funding rounds. The rationale for Auditability is a 4 based on the information provided.", "q2r": 4, "assessor": "z_assessor_2883", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10867, "q0": "The team is proposing a Research and Voter tool for Project Catalyst. Lidonation has already built an important source of information and data around Catalyst in the past with their platform. Such community-driven initiatives are very valuable for a decentralized system like Catalyst. That's why I fully support this project. I am happy to see that the proposal is of high quality.  It accurately describes how it will impact the campaign's goal of scaling Cardano. ", "q0r": 5, "q1": "The proposers seem to be able to accomplish what is described in the proposal. The plan described sounds doable. I like that the team has extensive experience. Both in Catalyst and for technical development. The plan described is very detailed and the budget is very easy to follow. Overall, I have full confidence in the team to implement the proposal as the team has been working on the project for a long time and we can already see and use many things that the team has created. ", "q1r": 5, "q2": "The information in the proposal is completely sufficient for review. Specific and measurable goals are provided. In addition, the team provides several ways to measure the progress and success of the proposal. The roadmap appears comprehensive, with detailed milestones and reasonable KPIs. I also believe that these milestones fit well within the defined scope of this proposal. The main reason for my good rating is: we can already see and measure the success of past proposals. Therefore, I assume that this proposal will also be successfully implemented. ", "q2r": 5, "assessor": "z_assessor_3204", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11833, "q0": "The team has put together a clear problem statement and solution which also fit the challenge well. Catalyst is maybe the most important factor in the future of cardano. I agree with the experience i had with ideascale so far that it's not the most convenient and rich tool to use. Also having the information hidden behind a mandatory account prevents engagement to a certain degree. Every chance to increase catalyst user participation promotes a vibrant community and ultimately enriches the ecosystem.", "q0r": 5, "q1": "The proposal builds on a solid foundation with the lidonation tool already being live and available for everyone to use. The funding request is reasonable and the team clearly states for what purpose the funds will be used. A roadmap with deliverables has been provided and summarizes the desired improvements well. The team also has put thoughts into operational costs and included them in the funding request which suggests high professionalism. Apart from that comprehensive information about team members and even a linked inpage for their company has been provided, all of which backs their blockchain background and competence in the area. Risks are stated as well, one having to factor in some degree of manual work for data import. This could be a problem going forward with Cardano funds getting bigger and bigger. They have to find a way to automate most of the data import otherwise it will be tricky to reach sustainability. Factoring in all the information given i agree that the community can expect for the application enhancements to be delivered.", "q1r": 4, "q2": "\nAs mentioned above the team has setup a fairly comprehensive list of deliverables with a rough timeframe. Considering the app already being live should ensure that the community will be pretty much able to live track their progress (depending on how frequently they deploy). They also setup a list of easy to track KPIs (via web analytics tools). I agree to a very high level of auditability.", "q2r": 5, "assessor": "z_assessor_3289", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 15324, "q0": "This is my fifth fund participating in Catalyst, and I have been able to experience this personally, it is increasingly difficult to keep updated with everything that happens in Catalyst, this makes that, on many occasions I do not hear of a call that I would have been interested in participating or the opportunity to contribute in various discussions. Not to mention when preparing to vote. lidonation.com has been a site that for several years now has taken on the task of organizing and concentrating all the information, reducing the barrier to entry for many users. The team's argument is a good one, but when I apply the settings of the challenge strictly, I do not find a direct alignment with what is sought. On the other hand, I agree that the proposal adds value to the Catalyst community, and therefore Cardano. Lastly, considering that this is a product that has already been available to the community for several funds, I would have expected more information regarding the impact data that can be extracted from the website, unfortunately it is only mentioned that with the implementation of this proposal they expect to double the weekly engagement from 6k to 12k. \n", "q0r": 4, "q1": "It is possible to understand in sufficient detail what is intended to be built after reviewing the detailed list of new features to be added along with the implementation plan, and to conclude that the timeline of 6 months is reasonable. lidonation.com has been one of the reference sites for many members of the community. I think it adds confidence in the project. However, this is done by including a brief description of the skills and experience of the members, as well as providing the necessary links. Finally, the budget requested for this project consists mostly of 400 hours of development at a cost of $75/hour which seems appropriate to me. The rest will be used for translations and costs associated with the server and hosting. ", "q1r": 5, "q2": "There is a detailed description of the features to be added in case this proposal is approved, for this case, taking them as milestones could be reasonable; the description of success includes some aspects that ultimately should be monitored, such as engagement. However, considering the product in question, many more metrics should have been included in order to provide information to the community about how much this tool is being used, otherwise, we would be allocating funds to a tool with good features, but nobody uses it. Here are some examples; performance metrics such as, page speed, time to interact, bounce rate. We could also include engagement metrics such as page views, average time on page, average season duration, among others. Strangely, the proposals do not present communication channels with the community to follow the development, I could see that the team keeps their social networks active, so I don't think this could be a major problem.\n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Dedicate more time to the LIDO Catalyst Research tool to bring in more data, help proposer owners tell richer stories, & help the entire community make sense of Catalyst Data & the humans behind them.", "experience": "Darlington is a co-dreamer at Lido Nation & the developer behind lido's catalyst research tool, voter tool, & visualizations.\nDarlington has 14+ years of software and cloud system engineering experience.\nStephanie is a trained teacher, experienced blockchain writer & educator. "}