{"id": 418015, "author": "nielskijf", "title": "Launch Social Design Academy [SDA]", "url": "https://cardano.ideascale.com/a/dtd/418015-48088", "category": 26595, "amount": 48400, "description": "DAOs & Brands continue to focus on functional product & service delivery, it's important, but 61% of customers [1] are seeking more personal and collective benefits to enhance their wellbeing.", "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 12819, "q0": "This proposal focuses on a important aspect of the blockchain ecosystem. Many people may have some reservations implementing these new technologies in their systems. But this proposal aims to make this process easier for all the users. When web 3.0 becomes more accessible and many more people starts to implement this to their systems they will want some guides that will make this transition easier. Many of these people will not be trusting the blockchain due to misinformation about crypto currencies but technologies like this proposal plans to create will also help with this. This proposal mentions ‘unlearning and relearning’ about web 3.0 and I think this represents the web 3.0 perfectly for every user.\n\nThis proposal gave me a different perspective about governance. When people mention digital governance they generally mean voting. This proposal takes this voting one step further and uses these voters as creators. Proposal also lays out team’s plan to document all of their findings in one space mainly to create ‘one source of truth for the members’. With this they will be able to attract more people to their systems and thanks to how their system is structured these people will also attract more people. Also this attraction will help people to come to Cardano community and therefore increase is as well. \n\nThe team also mentions that they plan to create education as service license. It also coincides with their general vision. I personally think connecting this project to education is a great idea. As they mention almost everyone who want to work with this technology will have to learn this, and this proposal plans it perfectly with creating experience over time and build a foundation for the educating people.\n\nThis proposal is in almost perfect alignment with the requirements of this challenge. It is trying to find a solution that might be problem in the future; designing the web 3.0 websites. Moreover, it is doing this here in the Catalyst, which can make everyone in this community an early adapter.", "q0r": 5, "q1": "The road map is defined clearly and every step is categorized logically. With that being said I have some problems. In stage D, it is explained that live classes and workshops will be held. I think that this kind of events take some planning and platforms should be defined beforehand. Also I do believe that since they are planning to create all the information in one place they may also plan to record these events and make it available to public. These workshops should also be explained with more detail, i.e. what they will have people to do, how they will help each other. \n\nApart from these, all of the steps and their sub-steps are helpful to create a community, which is the main point of these proposals. The owner of this proposal is very knowledgeable and knows what he is doing. Apart from himself he managed to get together a competent team. If you check the team’s portfolios or pages it can be clearly seen that they all have more than adequate expertise for UI/UX designs. I did enjoy seeing people from Cardano ecosystem in the project.\n\nWith a professional team and their good planning the proposal is feasible, but they might need to work some details and make some tweaks along the way.\n\nBudgetary information is broken down into proper parts and these parts all have a certain planning behind them. My only concern would be I wanted to see a chart or some planning showing a budget burndown process. Hours may differ due to attendees and some plans might have to be altered in the long run. These possible alterations can also have effect on the budget and planning should align with this.", "q1r": 5, "q2": "I believe that following the process and auditing the stages will be easy since they are broken down to understandable steps. They have identified their milestones and progress tracks very clearly. Since they will be using platforms such as Discord, GitHub, Miro, etc. community can see the current situation of the project can give feedbacks they deem to be necessary. \n\nI loved reading their definition of success for the project. They believe they are as strong as they are together. Which is the main idea behind the Project Catalyst, importance of the community and teamwork. The team will unlearn and relearn; they want us to do the same and they think that is definition of success.", "q2r": 5, "assessor": "z_assessor_3477", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14586, "q0": "This proposal is described in detail and I believe it has an impact on the Cardano ecosystem. The team starts from how to see problems and why people approach them to bring out the potential audiences that the group is targeting. This project consists of six main activities and the results of the team's work as they help the Community & Brands define their personal and collective development goals, help them better understand their Social Impact, and help them engage people into their communities. Ultimately this project benefits Catalyst, Cardano, and other related software development communities. The Academy of Social Design addresses the Dapps, Products & Integrations Challenge because the team sees a strong connection to the Social Design Academy and Cardano's mission. It can be seen that the results that the team can bring are quite consistent and synchronized with the KPI/ Key metrics of the challenge. There were three risks to the project, including SDA Instructor training, new ways to approach user interaction, and lack of live class study/participants, yet the team delivered mitigation measures that are quite reasonable with the situation of the project.", "q0r": 5, "q1": "On the basis of UX 3.0, the team wanted to design distributed software from a unique user experience point of view. The team wants to point out that the live classes during the Social Design Academy Kick-off (September-February 22) are for training new materials, but are also used to adapt materials instructions or copies. Their roadmap has six key timelines, with each stage the team provides work items and a process for implementing them. Regarding the budget, the team gives an overview of the costs for each phase and the total budget is $48400, however, the team should give people more details about the costs to cover the number of employees. necessary resources and assets as specified in the plan. About team members include five main members, in addition to community members and partner networks. It can be seen that the group that allocates responsibilities to each member of this project is very scientific and reasonable.", "q1r": 4, "q2": "In terms of auditability, for each phase, the team provides a full range of quantitative indicators to track all weekly and monthly totals since the start of the project. This makes it possible for everyone reading this project to visualize what stage the team is at and evaluate the product they create. Regarding the success of the project, the team identifies the working philosophy as Unite, divide and die, and their ultimate goal is to develop software designers into change makers. Besides, the team also provides another proposal under the same project, Introduction in the wallet for ADA holders, which increases the confidence of the project's success. Overall, from the impact, feasibility and auditability, it shows that the team invested time and effort to research and plan the implementation of the project.", "q2r": 5, "assessor": "z_assessor_4073", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14860, "q0": "The production team has a significant ambition of innovating the Digital community in general, and the Cardano community in particular. And this shows extremely transparently through this proposal. The information is exhaustive and well categorized, with comprehensive examples that support the reading experience of the readers and help them understand the concept better. The team also provides relevant pictures and links to show their efforts and that they are fully dedicated to their project. Although there are some small sentences, such as quotes and mottos, that are not really needed and can be removed to enhance the attention of the readers and make it more like a proposal than an advertisement, the production team has made a successful job on intriguing the targets in their subject.", "q0r": 5, "q1": "The team has given a fully and neatly explained roadmap. It is evenly divided into smaller stages with detailed timeframes, practical milestones and specific numbers of budget hours, showing the determination of the team to their own child and how careful the steps they are making. The budget breakdown is simple, but tells all of the basic budget distribution and is apparently effective. The member breakdown has given relevant information that is needed to know about almost all individuals who participate in this project. Overall, the team has done a commendable job on the execution of the part.", "q1r": 5, "q2": "The writer of this proposal has had a great list of progress tracking that is delicately varied depending on the production stages, and it is noteworthy that the team has thoroughly planned all the way from start to finish. The success indicator part is good, which shows the basic definition of how the team sees their project as successful. On the other hand, that part also has somewhat redundant mottos and campaign quotes which do not support the main point. If the team removes these and focus more on the main point of how the success of the project looks like, the part will be an even better one. But generally, this is a well-executed part.", "q2r": 4, "assessor": "z_assessor_4106", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14936, "q0": "I agree that this proposal meets the challenge’s objectives. With this investment, Social Design Academy will launch a new UX3.0 program that will drive adoption of the Catalyst & Cardano community and software designers community. They will drive adoption through education (workshop, live lesson etc.) This new UX3.0 program will deliver personal and collective development goals using Story-based Chat Assistants. The team has talked daily via Discord with Communities & Brand about developing the new social app to engage with their audiences. They have also partnered with LITTLEFISH, ADAO, HANDSHAKE, and KONMA for the creation of the Cardano UI Toolkit as a deliverable of this project. I understand what would be potential risks and which steps they plan to take to levitate or eliminate those risks.  With regard to success metrics, the team has described clearly, making it easier to understand their goals towards the challenge. I believe they will be able to bring social impacts on Communities & Brand thanks to the Cardano Blockchain’s utility. ", "q0r": 5, "q1": "\"The roadmap is very well-prepared. It is divided into 7 stages Each of which includes all necessary details, including work category, deliverables, stakeholder, period, and the average number of required hours. Besides, workflow and key milestones have been outlined. This incredibly detailed roadmap is absolutely beneficial to keep track of the progress and makes it easier to understand the budget utilization.\nSimilarly, the budget breakdown explains the budget of 7 stages in detail. Estimates for the number of hours required to complete the stages and hourly pay rates have been given to justify the request. I would even better understand the justification of the request if I knew how many members would work on each stage.\nThere is a lot of clarity in the background and relevant experience of members. Each has provided a brief description and relevant links to social media or portfolios which serve to verify the skills and experience. Core team members all have experience in UX design and/or in creating educational products. The team also has been assigned the project roles. Additionally, some partners have been listed and their roles could be found at different stages in the roadmap.\n\"", "q1r": 5, "q2": "Regarding success metrics, there are some types from stage 1 to 8. Most of them are  Proof of Production, and some others are Proof of Partnerships & Investment, Proof of Socal Design Cultures & Development Goals, Proof of Live class Attendance, and so on. The type of metrics depends on some deliverables of each stage. Link to Gitbook to track progress has been provided. Another means of communication with the Catalyst community about the progress I assume would be their Discord channel since it is said that they have already engaged the Catalyst and Cardano community daily using this channel. I would expect a brief discussion on how they will report to the community on a regular basis. The detailed delivery schedule for these metrics/milestones have been established in the roadmap given, including the launch time expected to be in March 2023. Furthemore, they have described their success in detail. It is clear that the relevant impacts the Social Design Academy will have on the Cardano ecosystem are mentioned. ", "q2r": 5, "assessor": "z_assessor_4113", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We co-design UX 3.0 with Communities & Brands. We are evolving software designers into change makers by building Digital Story-based Chat Assistants for personal and collective development goals.", "experience": "Founder Social Design Academy [Website] 24 yr. UX/UI [Li], Instructional Designer & Digital Governance Innovator. Funded F6: In-wallet Onboarding for ADAholders; Combining utility, education, and hospitality in a chat-like interface, making Cardano ready for family and friends"}