{"id": 418085, "author": "uptodatedevelopers", "title": "NFT for DRC Fauna and Flora", "url": "https://cardano.ideascale.com/a/dtd/418085-48088", "category": 26595, "amount": 52000, "description": "Some endangered animals should be protected by all of us because the stability of our ecosystem depends on them.\nSeriously endangered species such as: Giraffe, Elephant, Bonobos, PANGOLINS, etc.", "f6_no_assessments": 7, "f6_rating": 3.952380952380952, "videos": [], "media": [], "f6_assessments": [{"id": 384, "q0": "Uptodate Developers are proposing a web platform for the sale or auction of NFTs to support rare animal species from the Republic of Congo. This includes creating a digital identity of rare species into the form of NFTs, creating certificates authenticated by the ICCN that gives the holder exclusive rights to the images of the animals and then the sale of these NFTs to generate revenue for protecting these species. The platform will present the the species in categories and the sale of NFTs will be renewable. In terms of risk the team mention that not having a working platform and the Congolese government where they must have agreement with them for this to function. It is clear this could have a large impact to find novel ways to raise funds for endangered species. NFTs are a great potential solution to give holders who purchase them special access to the images that are recorded for that animal over a period of time. NFTs could be issued once every 3 or 6 months and the content recorded on the animal during this period of care could be owned by the NFT holders. This approach gives the holders valuable souvenirs for their contributions as well as a way to verify that they have supported good causes. If executed well this model could have a large impact in raising funds for endangered animals that brings those contributing closer the impact of their contribution by rewarding them with exclusive content or potentially other perks in the future. My advice to the team would be to seek support in the community from designers through to developers focussed on NFTs as I believe they will see the value in what you are trying to achieve here and the impact could be substantial for charitable causes if this was executed well.", "q0r": 5, "q1": "In terms of the roadmap the team provide details of the web platform functionality with the different pages involved and those relevant to the administration operators of the application. A timeline is provided of development during september to november and then testing and refinement during november to december. The timeline could have provided more depth as to how this will be executed as there are only a few lines provided. The budget breakdown provides the total cost and then the list of tasks involved for the functionality. The break down could have been improved by attaching some hour estimates or cost estimates to each section to help highlight more precisely how funding would be used. The team details gives information on the different members involved in the UpToDate team. Professional links are provided to verify the backgrounds of the individuals involved. Overall it looks likely the team should be able to feasibly execute this proposal, in future submissions the team could improve their proposals by being more explicit on the budget break down and also add more details on the timeline for delivery.", "q1r": 4, "q2": "Tracking progress for this proposal has the statement that continuous integration will be used meaning a deployment will be attempted every two weeks, the team intend to publish the reports they are using for the progress reports and also will establish a schedule for each feature. The team could have given an indication of this schedule for each feature beforehand as the items that are being developed are known already, this would have given the assessors and voters more confidence in the teams plans to execute this proposal effectively and provide more clarity in how the community can audit this progress if the proposal is funded. The success of the proposal mentions the deployment of the platform and the first sales of the NFTs. These are high level goals which could have been more specific such as mentioning if there are some initial animals that would be targeted as the first sales for this platform - such as a number of giraffes or elephants that need more support. The team have provided a public Github repository that helps to provide a way in which the community can follow the progress of development. It could have been made more clear on what will be made open source as this would have benefited the community for other charities that may look to replicate this model. Overall the clarity is fairly good for this proposal and ways in which the community can audit the proposal have been presented. In future proposals the team could be more specific on objectives. ", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4257, "q0": "The proposal aligns nicely with the challenge objectives as it will bring in additional users conscious about endangered animals and plants to the Cardano Ecosystem. Those users might otherwise never have come across the Cardano community.\n\nMoreover, it presents the added benefits of not being driven only by profits & income, but targets sustainability of the Fauna & Flaura in the Democratic Republic of the Congo. This shows a strong overlap with the overall Cardano values, which focus on sustainability, environment friendliness, as well as the empowerment of the African continent.\n\nThe proposal provides a way for people to publicly display their support of endangered animals via NFTs in exchange for a donation to the ICCN.\n\nFinally, the platform already offers a significant improvements to classic donations to non-profit organization, but I believe additional incentives given to NFT holders, would help drive in even more donations to the partnering organizations.", "q0r": 5, "q1": "A large team of experienced developers and managers is presented to work on the project. \nThey mostly consist of full-time employees of the established Uptodate Developers company, which has a solid track record in web and blockchain developments (and particularly so with the Cardano blockchain).\n\nThe team members cover all the required skills necessary to carry out the project successfully: from web and blockchain developers, through UI/UX experts, to managers and coordinators.\n\nAs such, the team seems perfectly suited to execute the project plan.\n\nUnfortunately, the detailed project plan and budget breakdown lacks a proper detailed timeline, and task breakdown.\nThe project plan and budget breakdown merely consist of a list of requirements for the platform, rather than a proper engineering task breakdown with time and cost estimates.\nAdding detailed time and cost estimates per task, as well as intermediary milestones to the proposal would drastically help the community judge the feasibility of the project.", "q1r": 3, "q2": "Similarly to the plan and budget breakdown, the presented auditability of the project is too high level for an accurate assessment.\n\nMissing intermediary milestones (in between the two main quarterly milestones) prevent us from tracking development progress and delays on a finer granularity.\nThe team does plan on creating a more detailed schedule on a per-feature basis to tackle this problem. However, this is currently not covered in the proposal.\n\nFinally, the proposal lacks detailed and specific Key Performance Indicators to objectively determine of the proposal.\nPotentially, I would suggest to define KPIs covering the number of on-boarded users, the amount raised by the NFT sales and impact on the endangered species to help measure the project's success.", "q2r": 2, "assessor": "z_assessor_2534", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Feasibility\n1. Milestone :\n\nPhase 0 Ideation \nIn this phase 0, we will focus on the research of information, infrastructure, data, api, important resources, manpower, architecture, smart contract, and, this phase will prepare us for the development of the application, in this phase we will also prepare the different interactions (Design thinking).  \n\nphase 1 Development\nIn this phase 1, we will start the actual development, set up, buy the servers, incorporate the mobile money telecom aggregators, develop our smart contract, send the information to the blockchain, work on the front-end of the application to create an MVP (Minimun Viable Production) which, at the end of this part, will be considered as the version for alpha testers.\n\nphase 2: media engagement \nThis phase works in conjunction with phase 1. While we are developing the application, our community manager will not only prepare the community for the various features of the application, but also prepare the testers and the cardano community to be informed about the progress of the project. During this period we will use our social networks that already have more than 2000 followers and at the same time we will prepare the social networks of the application.\n\nphase 3 Testnet (test) Alph tester\nOnce the MVP is now available, we will open the application to the cardono community for testing but only with the testnet, also during this time we will correct the quick feedback before going into a live beta version of the application, this part is essential to minimize as much as possible the bugs of the application.\n\nphase 4 Mainnet (Beta) tester\nThe beta testers, it's really useful in mase but the users are informed that this is not a stable version, in this very part we will have a rating system followed by comments to allow us to constitute a first stable version ADA exchange APP v1.0.0.\n\nphase 5 FeedBack and LIVE V1.0.0 (Mini progress platform)\nThis phase is not the last but rather the beginning of a live monitoring of the application, and the appreciation of the application by the users. \n\n2 Budget: \n$28,000 Development/Integration of a full marketplace on Ada.\nin the amount of \nfront-end: $8,800\nback-end: $12,000\nBlockchain and smart contract integration: $7,200\n\n$ 7,000 Development of a monitoring platform (publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users) for the commauty for transparency.\n\n$7,000 community engagement (webinars, meetups, contests). \n\n5,000 for pre-launch product testing and quality assurance from Alpha to Beta.\n\n5,000 support for Ada Mainnet launch (cloud hosting, network security, third-party tools and support).\n\nAuditability:\nWe'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community.\n"}, {"id": 4468, "q0": "Impact NFTs are an effective and novel way for blockchain communities to raise funds for charity, so I see this proposal as a nice direction for Dapps, Products and Integrations. To identify great proposals that can have real impact, we need to ensure that the quality and provenance of the cNFTs are high, that marketing and social media buzz are sufficient to raise enough funds for charity to make the project worthwhile, and also that the mission of the proposal is shared by the Catalyst community, so that we can give them a \"leg up\" and provide initial uptake and adoption from within our own.\nThis project ticks all these boxes:\nBy collaborating with the governmental Institut Congolais pour la Conservation de la Nature in Congo who have already agreed to work with the proposers, a meaningful link to the wildlife rangers and government agencies is created and the project has the required legitimacy to assure NFT buyers.\nBy collaborating with WADA, the community link is created and the overlap of values ensured.\nBy working with / as part of local tech startup Uptodate Developers, a smooth product launch and professional execution should be ensured.\nBecause of all these reasons, this project is highly likely to have impact and fulfil the challenge brief of being a great addition the the ecosystem with likely user and adoption growth as a result.\n", "q0r": 5, "q1": "The voter is presented with a detailed business and implementation plan including the profiles of the startup and previously funded community members including WADA working on this proposal. \nIt would have been really nice to see a detailed budget breakdown to justify the funding requested, currently the payroll at over 90% of the requested budget does not have high enough granularity to understand the allocation of resources and whether the cost estimate is realistic and justified. Regardless of this, the strength of the team and timeline, milestones and roadmap assure me enough to agree that successful delivery is highly likely.", "q1r": 4, "q2": "Auditability and Clarity questions of the proposal form are answered with short sentences without performance metrics or possible quantitative yardstick. The provided answers are reassuring and show a good grasp of important assessment criteria, for example: \"We will establish a schedule for each feature that will be made and its deadline, it is on the basis of this that we will be able to measure the progress of the project.\" \nFor the auditor or community member / challenge team of Project Catalyst trying to assess how much the project is on track during its implementation and how much of a success after completion is a bit difficult though without aiming for NFT value, amount for charities raised, ranking on NFT collections lists, or any other such possible metrics. I would highly encourage the proposers to provide this to Catalyst once the project is underway, to ensure a smooth feedback to the community.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5892, "q0": "This proposal has great significance, helping to improve the environment and protect endangered animals, so it has effectively solved the challenge. It created a web platform in partnership with the ICCN for the sale or auction of endangered animals from the fauna and flora of the Democratic Republic of the Congo in NFT format. The creation of a web platform that presents the NFTs of rare animal species in the DRC, will allow anyone from anywhere in the world to contribute to the conservation of nature in the DRC.", "q0r": 5, "q1": "Your team consists of many members, some of them include: software engineer, technology entrepreneur, UX/UI designer,... Each person has their own forte, their own strengths, they gather together. form a complete, powerful team. Based on the information about the team, I find that they have all the knowledge, experience and skills to carry out this project. Their linkedin path is also listed specifically, which makes it possible for everyone to verify the above information, helping the team become more transparent. In addition, they also achieved great success: holding many important positions of large organizations and companies,... . All of the above information has made me completely believe in the ability of this team.\nRoute provided. However, it seems to be flawed. You need to be more specific about what to do and the corresponding timelines. For example: when do you plan to work with the DRC government? When will you build the front-end back-end of the web?... Having a detailed roadmap will help the project follow the set goals and orientations. As for the budget, it's very vague, I still don't know how the $45000 will be spent. In this section, I will give you some suggestions. You should clearly define what needs to be done, how many people will be involved in each job, the number of hours worked, and the amount paid per hour. From there, split the budget, recalculate the budget, that will make the budget more transparent, helping people to have more confidence in the project. For example: need 3 designers to build UX/UI within 3 months, work 8 hours a day, 30 dollars per hour,...", "q1r": 3, "q2": "I have read all the information you provided. In addition to the issues I mentioned in the previous section (clarifying the budget, providing a specific roadmap,...). I think it is also necessary to have more metrics to gauge the progress and success of the project. For example: There are 500 monthly visits,...\nThe issue of human lips and wildlife protection is always a topic that attracts a lot of attention from people all over the world. This is a proposal of great significance, if successfully implemented, the value it brings will not be small. In the future, I hope you will add and clarify any missing information (as I mentioned). This is a very good idea, don't give up, let's work together, hope to see you in the next fund. Thank !", "q2r": 3, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7303, "q0": "The proposed group is trying to solve the problem of conservation of animals and plants, which are critically endangered in the Democratic Republic of the Congo, under human and environmental induced impacts. By creating a web platform in partnership with the Congo ICCN nature conservancy to sell or auction animals and plants in NFT format created on the Cardano block chain in order to raise demons to help preserve the species. this. The solution to the problem could add massive value to Cardano's NFT volume. Using the Cardano Blockchain to host the NFT-related demonization system could meet the sustainability goal for the proposal. Through NFT products is a story of one species, so it is possible to educate the public about the serious problem that our world is facing, there are many species of plants and animals in danger of extinction, we need to be more conscious of their protection. I think in order to have a strong impact and have a greater impact on the community, the project should have cooperation with many organizations such as parks, zoos, botanical gardens, communities and local authorities, to create more diversity, and uniqueness for NFT products, increase revenue volume from selling NFT. I think in the future the proposal can develop strongly when more and more people and organizations are interested in the conservation of flora and fauna, so the planning for expanding the scope to other areas in Africa, and the world in the future is necessary, it will be in line with the trend and development of the platform, so careful preparation is required in advance.", "q0r": 4, "q1": "The team's blueprint proposes a detailed description listing each work item with specific timelines, making it easy to track the progress of creating an application web page. However, in my opinion, the success of an application is indispensable for marketing to bring the product to customers, so I recommend that the team add a marketing plan for their application. The proponents seem to have the experience and skills to successfully implement this proposal, easily known through the Linkedin provided by the team. For example, there are members with many years of experience working in the Catalyst development organizations and the Cardano ecosystem is quite famous like Wada. The team cooperates with an Uptodate development company, which is currently quite active in expanding the Cardano Blockchain ecosystem, adding credibility to the voting community. The budget given by the team is quite contradictory, when the team gives the required amount of 52,000 USD, but in the detailed analysis it is only 45000 USD, and 7000 USD is used for what the team does not show. The listed expenditure budgets are not attached to the corresponding amounts, so it is not possible to determine whether the given budget is reasonable or not. In the future I would encourage the proposed team to present additional spending on marketing and promotions, as I think that is also a relatively large sum of money. The Proposal Team has also outlined the challenges and risks that the team may face during the implementation of the proposal and also proposed a treatment plan to reduce the risks to the lowest possible level.", "q1r": 3, "q2": "The roadmap of the proposal with important milestones attached with specific milestones can be easily identified, but as I said, the team should add a marketing route to the customer, The solutions offered, to solve the work purposes are presented clearly and understandable, KIP Indicators will be continuously integrated and posted online at least 2 times a week, publishing visual link Therefore, the community can easily track the development of the project, but the indicators of the presentation team are still lacking, I think it is necessary to add some indicators such as: the number of NFTs sold, the amount of money collected. yes, the number of people using the application, the number of units cooperating to develop together, to help the community easily assess the success of the project. The budget given has not been determined, so it is difficult to accurately audit the project implementation process.", "q2r": 2, "assessor": "z_assessor_2886", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Budget: \n$28,000 Development/Integration of a full marketplace on Ada.\nin the amount of \nfront-end: $8,800\nback-end: $12,000\nBlockchain and smart contract integration: $7,200\n\n$ 7,000 Development of a monitoring platform (publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users) for the commauty for transparency.\n\n$7,000 community engagement (webinars, meetups, contests). \n\n5,000 for pre-launch product testing and quality assurance from Alpha to Beta.\n\n5,000 support for Ada Mainnet launch (cloud hosting, network security, third-party tools and support).\n\nAuditability:\nWe'll start by answering the question about github and monitoring the evolution of the project, We will provide a workspace trello or assana that will be public the major tasks and subtasks to allow a clear evolution of the project for no coders.\nAs far as testers are concerned, we will have two phases, alpha testers and beta testers, for alpha testers, it's really a closed circle of developers, but the beta tester phase is really open to everyone from the cardano community but also to the target population, But we will collect different feedbacks in a mini web platform called Atm_money Forum that we will create right after, in this part we will have to publish statistics on transaction numbers, track a transaction, filter by transaction region, new users, active members of our community, total users and many other important states for the transparency dedicated to the community."}, {"id": 11240, "q0": "The proposal focuses on a web platform that will be utilized to buy NFTs that present rare animal species in the DRC. The objective of this platform is to assure that there is a constant stream of revenue that would be utilized to protect those endangered species. To assures the revenue is stable, the team is planning to make those NFTs renewable. They are bought for a certain time and will have to be renewed the purchase every once in a while. It would be more like renting than buying. Reports will be published on a monthly basis on how the NFTs' purchase has aided those animals. Overall this project does address the challenge as they plan to build a web platform for NFTs that is linked with protecting animals in need. This might also bring in users from other blockchains, which is a plus. ", "q0r": 4, "q1": "The team currently has 11 individuals and plans to hire more team members later down the road. Their current team has a vast array of experiences ranging from Blockchain Developers, Plutus Pioneer, Atala Prism Prism Pioneer, Software engineers, Blockchain Entrepreneur, Cardano Blockchain Developer, Senior Blockchain Developer, UIUX Designer, Haskell and Plutus trainer, and Microsoft ambassador, Blockchain content creator and Mobile and web developer. Based on this experience aspect alone the team shows confidence in executing the proposal. As for the plan, the team plans to focus on the User interfaces and administration interfaces. The team plans to work on the beta version of the platform from this September to November this year and move on to test, correct, and deployment of the initial version of the product from November to December this year. The information given in the plan is detailed enough to understand which aspects of the user interface and administration interfaces will the team be working on and the timeline helps illustrates the motion of the plan.   ", "q1r": 5, "q2": "The means provided to audit the progress in the proposal is very sufficient. Such as, updates are posted online every 2 weeks, the first report will be updated with visualizations link thus making it a lot easier for one to follow and finally, each features will have a schedule in regards to its estimatied time of delivery. As for the success of the plan, the proposal states the following means to assess it. The success of the initial version of the platform's deployment and the demand of the NFTs that are provided on said platform. These are sufficient means to measure the success of the proposal. Thus, in regards to auditing, the means provided by the team are very much sufficient. ", "q2r": 5, "assessor": "z_assessor_3233", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12216, "q0": "This is incredible project that seek to protect endangered animals from extinction and stabilize world ecosystem. The premise of this project is to develop web platform for sale and auction of endangered animals from flora and fauna of DRC (Democratic Republic of the Congo) in NFT format. The proposer will partnership with ICCN to develop web platform in NFT format, so that people can purchase and own the animals thus, it protects the species from wild hunter, extinction by nature and help the DRC government to protect the species. the benefit using NFT to develop web platform are the species will have digital identity that could mark to those belonging. Furthermore, the buyers have right digital ownership of the animals that they purchase, meanwhile, the proposer and the ICCN earn the income as financial support to protect the species. everyone including Cadano community could see who is the owner of the animals and how they treat or look after (protect) the animal by accessing the web platform. this I think good project need to be implement for the sake to protect our planet ecosystem. However, one thing need to into account that the proposer should ensure country regulation to implement this project and discuss this matter with the authority in order to avoid dispute. Overall, this proposal is good and address the challenge.", "q0r": 5, "q1": "The team of this project is partnering with ICCN seems have been based quite sometimes, however, they have developed a long-term vision to protect the endangered animals from extinction that led to maintain world ecosystem. About the understanding and order of the activities themselves, I believe that everything is quite adequate. However, something that I think would be better was if they had included the time each of these project activities would take. Many proposals establish phases, this is because we understand well what would happen but not when it would happen, that is, when each thing would start and end, which is essential for a full understanding of the activities including developing web platform. In relation to budget, I see the level of detail is not adequate. Perhaps, the proposer would breakdown the budget for example, there are user interface, administration interface and maintenance in the application budget, thus, each part of that supposed to stated their own cost. Furthermore, there is supposed to be cost for developer fees, but it seems like these costs has been included to one of the items in the application. perhaps the proposer split this cost with the application budget. About the team: they seem qualified for the project, because they have professionals from different areas and also have experience with developing web platform in the NFT format. So far, the information is there, they just need to improvise few things that I have mentioned. Overall, I believe proposal will be implemented successfully", "q1r": 4, "q2": "I believe the authors even intended to propose an auditability, but this was done in a very superficial way. They do not establish success matric and the information too short which does not allow for a deep understanding of what is planned for results. I think it would be more appropriate for there to be continuous monitoring of this project as they promise to put online progress in the link for every two weeks. Some members of the community should closely monitor the progress based on the proposer plan. Through this follow-up, they could provide feedback to the Cardano community, in order to clarify whether what was promised is actually happening. By monitoring from the community, therefore, it creates dialogue between team project with the community therefore, many information would be disclosed.", "q2r": 4, "assessor": "z_assessor_3367", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "The creation of a web platform in partnership with the ICCN for the sale or auction of endangered animals from the fauna and flora of the Democratic Republic of the Congo in NFT format.", "experience": "Startup working in the development of Web, Mobile, and Desktop applications; with more than 18 developers, with a community of more than 100 developers (telegram channel)."}