{"id": 418092, "author": "innocentnor", "title": "DAPP FOR TECH REPAIR (REPAIR ME)", "url": "https://cardano.ideascale.com/a/dtd/418092-48088", "category": 26595, "amount": 45500, "description": "In Ghana, there is the lack of access to tech repair specialist in part of the country. Therefore, how do we make tech repairers accessible to individuals for easy repair of damaged devices.", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 1333, "q0": "The problem stament chosen by team indicates the lack of a decentralized solution for repair service providers to connect with people who are in need of repair services for their tech repairs for their damaged devices. The proposed solution is to create a Dapp that can provide a platorm that makes the tech repair service members accessible to device owners directly from accross the country to avail their services. The repaimen can provide their unique identification via AtalaPRISM and also their qualification/information can be verified from the national identification cards enbling the platform to assign an efficiency rating tag to each of the registered repairmen, hence intending to provide proper services to the end users.Considering the nature of the solution this proposed solution definitely addresses the  challenge effectively.", "q0r": 5, "q1": "The team that has proposed the solution is a well experienced  with around 20 years of combined experience in software development, business development and research including community advisors from fund 7 and 8(One of the reason why the proposal is so well written Kudos) having one of their team member's proposal funded in previous round (not sure If I did not find the details of the status of the project would have been great if added). Their team comprises people from Development/ marketing and business development fronts. They have also described their proposal phases \"DApp registry and smart contract\",\"Partnership and educational Outreach\" and Marketing with details regarding plan of action under 3 different phases including post developmet outreach and marketing. Provided these details and expertise it is highly likely that the proposed solutoin will be effectively implemented.", "q1r": 5, "q2": "As mentined above the proposal is very well layed out because of experienced community advisors in the team hence has all the required details to understand the proposed solution well and also understand the process of the solution implementation. They have included details regardign different phases of solution implemntation being \"Company (website) registration and Legal experts\", \"Research, Dapp Design\",\" Software Development, Plutus \", \"Host stakeholder engagement\" and \"marketing strategy\" being some of the main parts of it along with timeline defined for each of theses phases respectively. They have also provided a very detailed fund breakdown  for each of the phases of the solution implementation based on what resources they will be engaging for the same. They have also recognized the risk involved and how they will be mitigating it. they have also layed out details regarding their KPI Metrics such as \"number of users onboarded\",\"volumes of transactions on the platform\",\"feedback\" etc which can be used to measure the progress and success of the project. Additionally they have mentioned the milestones to show the successfull implementation of the solution (numbers could have been more from my poit of you but not sure of the ground level problems so nnot much comment on it). However these milestones and progress metrics can definitely be sufficient to audit the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_2228", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6064, "q0": "Access to tech repair specialists in Ghana is lacking in low-income rural and urban areas. The proposal team will create a Dapp on the Cardano platform to directly provide repair services between customers and technical repair experts without intermediary services. This Dapp will give users more options or make repair services easier . This initiative is viable considering smartphone usage in Ghana and improved internet connectivity. This Dapp provides a unique digital identifier for the repairman. Customers easily identify repairers and connect with them through this identifier. Smart contracts are also integrated into this Dapp. The success of this proposal will help create a way to search and connect directly with technical repair experts quickly and open a convenient application on the Cardano platform to the Ghana market.", "q0r": 5, "q1": "The members behind the project as a developer, a finance & marketing manager, and a business developer, have all revealed their expertise and experience in the description (LinkedIn profile attached). The work route goes through three main phases: phase 1 is completed for 1-3 months, phase 2 is completed in 5-7 months, and phase 3 is completed in 8-12 months. The respective activities in each stage is listed in detail. The requested budget is distributed as follows: Company registration and Legal fees ($2.500), Research and Dapp Design ($3000),  Software Development & Plutus ($13.500), AtalaPRISM Development ($13.000), Marketing ($5.000), Stakeholder Engagement and Onboarding of Repairmen ($3.000), Project Management ($3.000), Stakeholder Engagement ($1,500) and administrative cost ($2,000). Based on the information on the performance of the proposal team, the work plan, and the financial analysis, I am confident in the performance of this proposal.", "q1r": 5, "q2": "After the completion of the proposal, what metrics will measure the success of the proposal? The authors specified the following four metrics:\n- Number of users;\n- Number of repairers;\n- The volume of transactions on the platform;\n- Number of user & repairer responses.\nThese metrics are all precisely quantified to increase recommendation control. One difficulty identified in this proposal is enrolling repair professionals in the Dapp. To incentivize the participation of repairers, a small amount of ADA will be sent to these repairmen as a bonus when they sign up succesfully. This way, the Cardano platform will be introduced to the technical repairman community in Ghana. I see this as a good proposal.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9505, "q0": "For a well articulated solution to the problem statement and a clearly outlined rationale for order of process, I rank this section a 4. There’s a few missed opportunities in this section that could secure a more confident positive reaction from voters. The problem statement doesn’t give a tangible sense of how big the problem actually is, which can be solved with more research and data on the matter. Just based on my shallow research on the matter, Ghana is home to the largest ewaste dump in the world. Apparently, this phenomenon leads to common respiratory problems, nausea, headaches, infected wounds and a variety of health problems that impact the lives of 31+ million lives in Ghana. Additional quantificaition presented in this proposal would very much help give voters a sense of urgency for this proposal as an additional mechanism to fight this issue. If possible, it might be prudent to quantify the lack of this service in Ghana to get a sense of the competitive outlook of the market that this service would be entering. Also, I think the link to necessity of the use of the Cardano ecosystem could be better articulated. The use of Atala Prism is mentioned for identity/service quality tracking but I’m not convinced that this is a strong enough link to appeal to adoption. This proposal doesn’t mention anything about payment methods on this platform but I think the link to Cardano adoption would be more effective if payments were facilitated with ADA (or at least with ADA as a payment option and maybe a discount for choosing that option). I react positively to this section because I think it hits a lot of areas that many other proposals don’t (like marketing, direct impact appeals, and some platform mechanics) but I do think there’s a lot of room for some extra substance that can secure voter confidence. ", "q0r": 4, "q1": "I think this team demonstrates clear capability with verifiable experience and provides a clear roadmap with details about actionable steps, so I rank this section a 4. I think there’s a well rounded team here to see both completion of the Dapp and the strength in business experience to spread awareness and maintain strong internal business mechanics. The development team seems solid, so I have no concerns there. The roadmap is impressively detailed with descriptions in each actionable step and inclusion of different aspects of the proposals operation (development, legal, marketing). The given timeframe of 8-12 months appears perfectly reasonable to produce a high quality product, that also gives some time for Atala Prism to see further development as well. The budget is where I have the most difficulty evaluating feasibility because there is not enough information to thoroughly evaluate efficiency in spending. While I’m very happy about the organization and formatting of this budget, I do need to see more breakdown into allocated hours of labor and hourly rates fore each of the given categories. Without this information, it’s impossible to evaluate if the funds are being spent well because the voters can’t see a through enough breakdow. I think this section clearly proves that it can be done, there’s just a little bit of missing detail that could enable a more comprehensive analysis. ", "q1r": 4, "q2": "For well-identified KPIs, comittment to target metrics, and appeal to specific impact outcomes, I rank this section a 5. This section of the proposal is impressively comprehensive and lists all of the right KPIs that voters will expect to be seeing. Additionally, they establish specific targetted metrics that provide voters with a sense that this team has a specific vision of success. I sometimes like to see projected milestone metrics that extends to a longer term timeframe but that’s really just personal preference. This proposal takes it a step further and give direct links from these KPIs to what those metrics result in for potential impacts. This rounds out the proposal very well because it leaves voters with a sense of what would be done as a result of this proposal and to what magnitude (as quantified by the target metric) it will have this impact. Very well done. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10383, "q0": "In Ghana, most people with low income often buy used phones, laptops, and tablets for work and life. Unfortunately,  these old products are easily broken or damaged, but it's very difficult to find repairers in many parts of Ghana. This proposal wants to create a DApp platform that connects tech repairers and device owners. This will make it easier and more affordable to repair devices. Although this platform will be developed for areas in Ghana, it is a potential project. If it is successfully deployed, it can completely expand globally, especially in low-income countries. Because the platform is built on the Cardano blockchain, it will help to flourish the Cardano ecosystem.", "q0r": 5, "q1": "The team consists of 3 members. Kingsley Mensah is the only member having experience in software development and programming so he has a lot of work to do. He should hire more staff members to reduce the work pressure. There are 3 phases in the roadmap. It takes a year to finish these phases so the required cost is $45500 to complete all the work in the roadmap. The proposers have explained in detail how this Dapp works so I think that this project is an essential project to implement in Ghana.", "q1r": 4, "q2": "After the first 3 months, they will have an assessment to adjust their targets. A SWOT analysis will be used in this assessment. SWOT analysis is a tool used to analyze the following four criteria of a project: strengths, weaknesses, opportunities, and threats. SWOT is widely used and very reliable in evaluating a project. In addition, the team will base on the following KPIs: number of users, number of repairmen, volumes of transactions, and number of feedback to measure the project.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13912, "q0": "This proposal effectively addresses one of the challenge settings and also because  the problem thus “lack of access to technology specialists in Ghana” is clearly stated with a clearly defined solution “will be addressed by creating Dapp platform that links tech repairers to device owners directly “.  The problem and solution are very well stated, clear and easy to comprehend. People’s devices mostly get damaged because of how difficult it is to get these repairers otherwise known as engineers to work on them. Most at times due to difficulty getting a device repairer, appliances get thoroughly spoilt and can never be repaired, so if situations like these can be curbed through the creation of Dapp to link people to repairers, it will be great. \nI therefore believe that with the enthusiasm shown in the plan and a little bit more of technical consultations, this proposal will very well help people living in Ghana. This proposal also  clearly states the key metrics and goals and also clearly articulates a plan for the project’s future sustainability even though they stated that they will come for more funding in the long run. ", "q0r": 5, "q1": "Both experience and plan presented are highly likely to make this proposal successful since they have experience in software development, risk and compliance, business development, risk and compliance, business development research and marketing. These experiences are capable of creating and running of the Dapp platform effectively with no difficulty . In terms of the budget, an amount of $45,500 is  required realistically plus has a detailed breakdown of how the money should be spent which includes business registration and others stated. The timetable to complete work is very elaborated in its simple form which a layman can easily understand.  They also stated that the project will last for a year with 3 well elaborated phases. There is a clear description of all necessary resources needed to implement the proposal  and also the considered risk involved and how it would be overcome. I therefore believe that this project  is very well understood by its operators and would succeed if funded.", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and success of this proposal because the key performance to show the progress of the project is clearly stated which includes number of users on the platform, number of repairmen on board on the platform, number of transactions on the platform and number of feedback. They went further to give metrics of this performance which includes 20 new users on the platform, 50 repair specialists, 10 transactions and 10 or more feedback . This proposal has the 5 key requirements thus specific(what clearly it intends doing), measurable(metrics put in place for measuring progress), achievable( has necessary skills when it comes to implementing the project), realistic( in terms of budget and timelines stated, project’s goal can be attained) and time bound(duration for undertaking the project) and therefore is a SMART project. The roadmaps and milestones are clearly elaborated with 3 phases of the timelines in a quarterly division of what exactly should be done. There is also a clear understandable description of the targeted problem to measure against outcomes which makes project  an attainable one.", "q2r": 5, "assessor": "z_assessor_3847", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Create a DApp platform that links tech repairers to device owners directly, so as to enable the repair of their damaged devices. This will host repairmen across the country for easy access to service.", "experience": "Combined 20 years’ experience in Software Development, Risk and Compliance, Business Development, Research and Marketing.\nFund 7 and fund 8 Community Advisors, a proposer with one funded catalyst project and an active participant in WADA events in Ghana."}