{"id": 418215, "author": "rmorrison", "title": "Cardax DEX Plutarch Code Audit", "url": "https://cardano.ideascale.com/a/dtd/418215-48088", "category": 26595, "amount": 96000, "description": "There is currently no DEX written in Plutarch with a full on-chain audit done an experienced external auditor.", "f6_no_assessments": 8, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 9507, "q0": "I rank this section a 2 purely based on the information provided in this proposal that does not leave voters with a strong reason to vote positively. The biggest issue is the lack of urgency in the problem statement. There’s a lot of good data and research that can be presented about the importance of security by showing how much in crypto assets has been stolen through DEX exploits, the amount of assets that are traded on DEXs regularly, or any other piece of objective information that quantifies the magnitude of the problem/need. However, these stats are not likely to be unique to this particular project, so this proposal also has to make the voters understand why it matters that this DEX is written in “Plutarch.” This uniqueness is going to give voters the perspective to see why this proposal would be worth $96k, which is well above your average Catalyst proposal’s requested funds. If these elements are provided, it better enables this sections ability to know what’s actually going to happen as a result of this proposals approval. A security audit is not really aligned with Catalysts mission to pursue the highest levels of community innovation, but if the project itself is demonstrably innovative and unique then there might be a better reason for voters to protect it with a security audit. DEXs on Cardano are wildly competitive right now, with only a handful that are live right now and STILL there are many that are falling dangerously far behind. There is a risk that ought to be addressed that voters will approve $96k to pay for a platform that will not see substantial usage, therefore less than substantial impacts. I can’t vote positively because I do not feel like I am shown that the benefits are worth the rather higher cost. ", "q0r": 2, "q1": "I rank this section a 2 because the given information is not enough for me to confidently see an objective plan and the efficiency in spending is unclear. I get the feeling that this team expects that voters will know who they are, which is a rather risky assumption when requesting funds higher than most. I would suggest putting a little more work into listing every relevant member of the core team (especially those that will be handling the tasks of the proposal). The information provided on the website appears to be out of date, as one of the two cited software engineers behind this team is no longer with Cardax (according to their LinkedIn page). There is an additional software engineer but the website does not provide a LinkedIn page or any professional experience, so I have nothing to evaluate. I suspect there could be sufficient experience on this core team, I’m just not given enough information to vote with confidence on it. It’s a similar story with the roadmap. The only actionable step on the roadmap is “a full external audit” but it doesn’t really layout what the process of the audit would be. I can understand not wanting to confuse voters with overly technical process outlining but I think it’s worth the effort to take the audit plan and simplify it into some actionable steps that voters can understand. As far as the budget goes, I’m not left with a great impression in seeing that the audit will start March 28th, 2022. This tells me that either this project is looking to get reimbursed for an audit that was already done or the proposer is submitted information from an older proposal and didn’t care enough to fix the details. Giving the benefit of the doubt, I’m going to assume the former. In this scenario, I’m not so optimistic about the need for this proposals approval because it’s already been done. If it hasn’t yet been done, the given budget does not show efficiency in spending and it doesn’t add up accurately. A security audit should cost $100k if you’re a large corporation that has a wide variety of needs to attend to. Every bit of information I can find on the cost of a professional outsourced security audit says that it should cost $60k at most but can often be closer to $25k. At $3200/day for two people, the hourly rate is coming out to $200/hr. At face value, this seems wildly inefficient/exorbitant spending to any average voter. It could be conceivable that the needs of this type of security audit requires highly specialized knowledge or additional work that isn’t in your average security audit, so those special circumstances need to be justified for voters if they are to react positively. ", "q1r": 2, "q2": "With the 3-4 sentences given in this section, I do not feel like I have enough substance to properly evaluate this team’s perception of what good performance/success would look like. This section is the opportunity for the proposer to show the voters why the approved funds were worth it. If a proposer asks for a large amount of funds, but doesn’t expect to see a lot of usage or impact on the world, then voters can’t confidently vote positively for that. I think Catalyst funding was a lot less competitive in funds 4 and 6, so it may take more work in crafting a quality proposal to see approval in the future of Catalyst. The only given perception of success in this proposal is completion of a security audit. However, there’s no information about what is intended to come out of the security audit. I think there’s a lot of room here to present something about reactivity to the security audit, ability to make adjustments, the number of successful fixes, and perhaps some kind of objective security score goal. This section needs to link the expectation of outcome to the potential impacts that could come out of it. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 817, "q0": "Cardax is requesting funds to pay for a completed external audit by Tweag. The proposal is misleading as it talks of a future audit, but it has already been completed and many critical issues were highlighted.", "q0r": 2, "q1": "The development of Cardax has been mismanaged from the beginning. About 9 million dollars were raised in two ICOs and two successful Catalyst proposals, however, none of the funds were converted to stable coins and now only $110,000 are left, and they have just announced a delay of their testnet. Development was outsourced to two companies that couldn't deliver a project ready for testnet. Their code is currently being reviewed by Well-Typed to see how far development has progressed. Unfortunately, I have little confidence that Cardax will launch a working project due to mismanagement and lack of funds. Cardax has recently launched an ISPO to try to raise funds to complete their development. It's too early to tell if this will be successful as they haven't produced any blocks yet.", "q1r": 1, "q2": "The proposal is to pay for a completed audit, so we can see that the scope of this proposal was / will be successful, however, as their code is not complete and not even ready for a testnet, I wonder how much utility this audit provided. As the audit was completed in early June, surely they can give now give more accurate information about the costs of the audit. The proposal clearly hasn't been updated since the unsuccessful proposal from fund 8.", "q2r": 2, "assessor": "z_assessor_2133", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 2831, "q0": "the team proposes to launch a Plutarch language, and declares Cardax DEXlaf the first language to develop a DEX on top of it,\n  In parallel with these statements, the group has not yet given the outstanding features of this language, in my opinion the group should give an example of the number of people in the community who are proficient in this language on the Github repository. along with that, the team has a goal to develop a DEX (decentralized exchange) based on the team member's audit,\n * Here are some suggestions to make this proposal more perfect,\n- as this is a technical aspect, specific explanations are needed such as statements such as: \"The goal of the project is to allow anyone to trade Cardano and ADA native tokens in a non-custodial manner. .\" it would be better to have proof for this claim,\n- the goal of the team wanting to make this audit tool available to such an available decentralized exchange requires specific explanations for the audit function the team will commit to providing.\n In addition, the team has stated a possible risk for the audit team's lag, but commits that there will be no second occurrence.\nBecause the documents provided in the presentation are sketchy, not yet fully functional and explained with evidence about them, I do not agree with this impact.", "q0r": 3, "q1": "the proposal's commitment to publish the audit on the group's Cardax website, at the end of this review period,\nannounced development spending of the proposal offered $3,200/day, based on 2 full-time auditors, and a flat fee of $16,000 but did not specify what this flat fee would be used for. whatever, there should be a footnote for this portion of the fixed cost.\n my friend's team I identified on the web your Cardax has 6 members, is it all going to grow or is there just 2 auditors involved, this needs to be clarified. Based on the literature related to this proposal it will be difficult to determine if it will be feasible, the proposal team needs to be more dedicated to presenting the parameters or providing detailed information about your solution. new can easily find the holes and omissions to give suggestions and suggestions.", "q1r": 3, "q2": "the team has committed to provide the final report of the code testing, on the website to the audit community, but in my opinion during the 5 weeks of the 2 auditor's audit, the team should have a weekly report for the results get better week by week,\nThe proposal's success index is determined upon the final online code audit report produced by Tweag. Thus, the provided group measurement index information is also relatively complete. However, there is still a need to supplement for the verification of community activities in the ongoing phase, which is still lacking. Therefore, it is difficult to give a maximum score for transparency.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6775, "q0": "Cardax is developing an open-source decentralized exchange on Cardano. This proposal is to raise funding from Catalyst to conduct a full on-chain audit conducted publicly by an experienced external auditor for a full review of their Plutarch code and security check of their smart contracts. The proposal has a very clear solution to improve the security of the developing project and if the audit is successful, it will contribute to increasing the reputation and value of the Cardano ecosystem. Although, the main risk is that the audit team may take longer than expected as mentioned in the proposal, to have a secure foundation, a 2-week delay like the proposed commitment is not a big problem. I strongly agree.", "q0r": 5, "q1": "Since the proposed project is an independent audit, the proposal does not provide a specific roadmap, but only provides an estimate of the technical time to complete the audit to find potential problems or vulnerabilities hidden such as Unclear or erroneous specifications that may allow sideline behavior; The vulnerability can be exploited by an attacker; General code quality comments and minor issues are not exploitable. 5 weeks is a perfectly feasible amount of time to do this workload, especially when the audit team selected - Tweag - is one of the leading software audit/engineering firms today.\nThe $96,000 budget is presented detailed; This entire budget is paid to the audit firm. It would be more complete if the proposal outlines Tweag's audit implementation progress and mitigation strategies if the audit exceeds the expected timeline or budget.\nWith Tweag's reputation and experience, I believe this project will be done successfully.", "q1r": 4, "q2": "The proposal mentions that the final on-chain code audit report conducted by Tweag will be publicly available on their website. The ultimate goal of the proposal is to have an audit result publicly available, so instead of providing details on how to measure progress, the proposal provides the central tasks of the audit; This makes it easy for the community to monitor and evaluate the success of the project when reviewing the final audit report that is publicly available. With the proposed information provided, I completely agree with the auditability of the project.", "q2r": 5, "assessor": "z_assessor_2829", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7305, "q0": "The proposal is aimed at performing a comprehensive and complete review of the Plutarch code and security testing of smart contracts for the Cardax DEX. Cardax DEX is an open source decentralized exchange on Cardano and currently the only DEX written on Plutarch. I think Defi is the most practical application of Blockchain, it takes advantage of the advantages of blockchain such as: Decentralization, decentralization and transparency, this use helps Defi eliminate 3rd parties. Cefi intermediaries. Instead, there are Blockchain Smart Contracts with the role of 3rd parties in DeFi. It is proposed to provide a 3rd party Plutarch code check on the Cardax DEX chain to find potential problems or vulnerabilities, which can lead to new improvements in the future for the application or there are timely remedy, avoid being attacked by hackers, in order to protect users, increase the prestige of the exchange, attract more new users, help the exchange as well as the Cardano ecosystem to develop sustainably in the present. and future. Therefore I think this proposal can effectively solve the challenge.", "q0r": 5, "q1": "The proposed team, providing a detailed 3rd party Web site, with a large, experienced and skilled team, clearly assigned specific tasks, Guillaume Genestier and Mathieu Montin will perform the audit. with the supervision of Victor Miraldo. Cardax DEX's team consists of experienced Haskell developers and professional security auditors, plus Cardax is a pre-funded project of Cartalyst in funds 4 and 6, currently in development. , is expected to launch Cardax DEX in the third quarter of 2022. Information is easily found on the project's Web site. Thus increasing confidence with the review community. The plan details the key tasks to be done and how to do them. The estimated implementation time is 5 weeks, but the start time seems to be confusing, when the team proposed it was March 28, 2022. It is already July 2022, I suggest group of corrections and additions for the community to easily monitor and evaluate. The detailed budget is calculated on a daily basis so it is easy to determine, I think it is quite reasonable, because of the participation of a large team and most of them are experienced and skilled people. will also be paid a commensurate remuneration. As for fixed costs, I would like the group to list in more detail what expenses are included, so that the community can more easily identify and evaluate. The proposed team also considered the risks that may be encountered when implementing the project, and proposed measures to minimize that risk.", "q1r": 4, "q2": "The implementation process is quite simple because the content of the work is just an evaluation of an application, so it is easy to follow, The proposal describes the implementation solution, details are clear, easy to understand. The project has its own Web site. The KPIs will be measured by taking the final report of the code test. Then publish it on the project website so that it is easy for the community to evaluate and monitor. The project has also described the success of the project, for the community to easily grasp and evaluate.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9589, "q0": "\"No DEX written in Plutarch on Cardano has been audited by any professional external auditors.\nThe proposal belongs to the issues of the request challenge. The proposal addresses the DEX's security and safety residing within the Cardano ecosystem.\nThe project's product is the Cardax DEX, which has been built and successfully implemented Private testnet. Auditing is an essential step before public testnet and mainnet. Audit results will be published on their website. I very much hope the audit is successful and the project runs mainnet. Because Cardax is essential for the Cardano ecosystem, there is no good mainstream dex that anyone can trade on.\nThe first proposal will benefit Cardax. In addition, other projects can refer to the post-tested project to build their products better.\nThe recommendation meets the challenge, so I give it 5 points.\"", "q0r": 5, "q1": "\"Perform a full review of the Plutarch code and the security of Cardax smart contracts because cardax is the first DEX written in Plutarch on Cardano. The audit keeps cardax safe, giving the Dex platform on Cardano more credibility. Help other projects written in Plutarch later have a reliable reference to build their projects.\n A team of 7 people has public information on Twitter and Linkedin. The team has extensive experience in Haskell programming, Plutus, and technology. The team's experience and knowledge are sufficient to complete the Project. However, there is no clear division of tasks between members to implement the Project.\n The risk proposed by the team is that the Project mentioned that the audit period might take longer than expected but not more than 2 weeks. This is not too big a hindrance to the success of the Project. It's just that success may come later than planned.\nThe proposal does not have any revenue from the audit. But it increases the security of Cardax, which can increase the number of users for the platform and gain more from transaction fees.\"", "q1r": 5, "q2": "\"Proposal to ask for $96,000 for 5 weeks of the audit. There are two costs presented, salary and fixed fees. Wages are clearly explained in terms of the number of people being paid and the hours worked. However, Fixed costs are not clearly explained and described in detail.\n  It is proposed to carry out the verification of the source code of the Cardax project, so there are not many metrics to measure progress. All audited parameters on vulnerabilities and unclear specifications will be published after closing. The results will be published on the cardax website.\nThe ambiguity in the budget table, which is very important in transparency, so I from 2 points.\"", "q2r": 3, "assessor": "z_assessor_3067", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 10575, "q0": "“Cardax DEX Plutarch Code Audit” is a good idea and meets the challenge of “Dapps, Products & Integrations”. This proposal raised an important issue: \"There is currently no DEX written in Plutarch with a full on-chain audit done by an experienced external auditor\". This challenge setup I find perfectly suitable for large projects like Cardax. I know, Cardax Dex is already a well-known DEX in the community and will be coming to Cardano soon. The ultimate goal of the project is to allow anyone to trade Cardano and ADA native tokens in a non-custodial manner. The solution proposed by the proponent I found that it identified most of the problems of the challenge. They made the Defi app secure by providing 3rd party checks against the chain code. To successfully implement the project, they have anticipated the risks. The main risk is that the audit team may take longer than expected because this is their first audit of the Plutarch code. Here I think that, although the proposed group has raised the difficulties faced, they have not given specific measures to overcome them. The proponent should have a plan to develop an alternative in case the original plan is delayed too long or does not work as expected. That way, the proponent will be in a more proactive and available position, increasing the likelihood of project success.", "q0r": 4, "q1": "The proponent has not presented a specific roadmap. Here the proponent is focusing on the heart of the audit that will find potential problems or vulnerabilities such as unclear or wrong specifications, vulnerabilities that can be exploited by attackers, or comments on general code quality and minor unexploitable issues. However, in my opinion, the team should make a more detailed plan of the implementation roadmap, create weekly and monthly milestones and assign specific tasks to be completed at each stage and define the person in charge of implementing each milestone. Regarding the budget, the proponent presented how the budget allocation is based on 2 full-time audit engineers. The budget is clearly outlined and details are provided on how to reach the $96,000 number. A total of 5 weeks of technical time is required and the results will be made public to the Cardano community. However, I think this budget should be deducted a small part into the risk provision in case of unexpected situations. Regarding the participating team, the group has provided information based on the link to learn about the members' profiles. In my opinion, this section, in addition to providing a link for people to access and learn on their own, the group should briefly present basic information such as full name, position, work experience as well as professional qualifications, and experience in projects adaptation. That will make it easier for everyone to grasp information, increasing the credibility of the project.", "q1r": 4, "q2": "To measure the progress and success of the project, the proponent presented how to measure it by getting the final report of the code audit and publishing it on the website for everyone in the Cardano community to view and the success of the project is demonstrated through their publication of the final on-chain code audit report performed by Tweag. However, I find that these indicators and criteria are not clear, in my opinion, the proponent should present more specifically the layout and content of the reports, and what criteria should be used as a standard to evaluate the report. The report has quality assurance as well as set requirements. This is a proposal to follow up on previously funded projects in Catalyst, namely Cardax which was funded for on-chain code development in Funds 4 and 6. With the premise already in place in the phase In the past, I think the team will take advantage of the available resources and advantages, the accumulated experience will help this proposal be more complete for being approved and funded soon.", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 14496, "q0": "The problem is stated clearly, and the proposed solution matches the challenge environment perfectly. The challenging settings are ideal for significant projects like Cardax. In the community, the Cardax Dex is already well-known, and it would benefit the Cardano environment. Millions of dollars have been lost in DeFi breaches, and even after a security audit, this might still happen. The entire code base that will operate on the main net must undergo a series of audits, as we already know, to ensure that it is provably secure. Clearly, this is in the huge interest of both Cardano investors and future users of this Dex. This proposal's objective is for Cardax to make the audit results public within the allotted 5-week time frame. This suggestion successfully addresses the issue.", "q0r": 5, "q1": "It may be claimed that the team specifics are available, and we have already seen that they have done all of the hard work with the Dex implementation. The budget is clearly laid out, and the details on how the $96,000 figure was arrived at are provided. A total of 5 weeks of engineering time is requested, with the results made public to the Cardano community. As a result, this budget is entirely justifiable. The risk section explicitly states that because this is the team's first audit of Plutarch code, it may take longer than expected. However, the delay would not continue more than two weeks. This proposal is highly likely to be implemented effectively based on the experience and plan provided.", "q1r": 5, "q2": "The proposal's success and progress can be easily reviewed because they will provide the final report of the code audit and will also publish it on their website for everyone in the Cardano Community to see. Because of the catalytic funding, this is crucial not just for the community, but also for investors and future users of their dex. The defined timeline of 5 weeks has also been beneficial in measuring development. As a result, with the information provided, the community may readily track the progress and success of this project.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "We want to perform a full review of our Plutarch code and a security audit of our smart contracts. Cardax DEX is currently the only DEX written on Plutarch (not PlutusTx).", "experience": "The audit od our on-chain cade will be done by Tweag. This is a highly experienced team who has done several audits of Plutus code. This will be done their first audit of Plutarch code."}