{"id": 418218, "author": "dzhuliana", "title": "Social network for deep connections", "url": "https://cardano.ideascale.com/a/dtd/418218-48088", "category": 26595, "amount": 36500, "description": "Mentorship is well known as a way to fast-track progress, but not enough people have mentors. How can we give more people access to the rich learning experience of mentorship on an ongoing basis?", "f6_no_assessments": 6, "f6_rating": 4.055555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 1467, "q0": "OneUpOneDown is an innovative platform that is developing a valuable social network creating deep connections. Using alternative methodologies that focus on quality instead of quantity, the goal is to produce a decentralized social network that supports mentor/mentee relationships. Future plans include integrations with Atala Prism and Singularity Net to leverage the tools of Self Sovereign Identity and Artificial Intelligence to create a very powerful social network of highly engaged users. AI allows for optimal pairing between mentors and mentees. Impact alignment with strategic goals and challenge objectives is similarly optimized.", "q0r": 5, "q1": "Relevant experience and lots of it, may be the best way to describe this impressive team. Collectively, this group has extensive experience in Project Catalyst and many related side projects. From the Catalyst Leadership Academy to the Cardano Ambassadors, Challenge Team Leaders, Plutus Pioneers, entrepreneur mentorship, software development, and much, much more, this team has all the tools and experience to see the project to success. Having been previously awarded funding in round 8 for two related projects, the vector for successful completion and implementation is very favorable.", "q1r": 5, "q2": "A highly detailed and comprehensive timeline provide the backbone of a KPI framework that offer many incremental indicators in which to measure progress. The metrics included in the proposal span the period of four funding rounds (8 thru 11), and provide ample opportunity to conduct a detailed audit. Additional KPIs appear in the auditability section and include a redesign of the front end application to increase utility towards mentorship goals and the development of an in app revenue generation mechanism in the form of an industry pool. Atala Prism integration is slated for the next funding round, this coincides with the current estimates for when the DiD program can begin to roll out. AI integration is slated for round 11. Verification of every metric to assess progress is possible in this very well designed proposal.", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2298, "q0": "This proposal is a request for added funds for proposal funded in fund 8 https://cardano.ideascale.com/c/idea/404785 to add a new feature to a funded project they are yet to deliver.\nFirst of i do not see any reason for this team to request for funds when you just got funded in fund 8 and yet to deliver.\nHow can you make updates to a service you are yet sure it can work.\nSecondly, the idea that a social network that links individuals deeply is not well suited for crypto and defeats the purpose of anonymity, so this is a terrible feature\nrequest to a yet to deliver proposal.It is even sad that the proposal did not provide test credential that PA's can use to test this website https://oneuponedown.org/\nas i will not put my personal details in an untrusted platform which brings us back to its utility.\nI will be giving 1 star for impact according to PA guidelines because i do not see how this will impact Cardano when the prerequisite proposal isn't done.\nThe team should focus on their already funded proposal and when done, we can return to this conversation.\n\n**dear VPA, this proposing team will likely want to complain about this review.Please review with honesty.No one should ask for extra money for update of an unfinished work.\n", "q0r": 1, "q1": "The proposal provided a detailed roadmap with associated timelines of scheduled events.\nThe provided budget breakdown is provided to justify the request but lacks any detail as to how some funds request were arrived at, for example \n\"Senior ML/Back-end developer - USD 3500\" - How did you arrive at $3500 ? How many Hours of work will be put ? (I am not sold) and why are you requesting for funds for developers\nwhen the fund 8 proposal is also requesting for same? isn't the team trying to double dip the innocent voters and catalyst?\nThe provided information of the team was provided with verifiable links to bio.\nI will say it up front , the fact that this team are back in fund 9 requesting for more funds while not delivering their fund 8 request gives me no confidence in this team.\nI will be giving 2 stars for feasibility.", "q1r": 2, "q2": "The proposal claims it will provide a gitBook for the community to follow the progress of this proposal but is unable to provide the gitbook of the previously funded proposal.\nSecondly , lost of the KPIs provided here are dependent on the success of the fund 8 proposal which invalidates these KPIs to me .\nI do not agree that sufficient information is provided to audit this proposal and i will be giving 1 star for audit-ability.\nThe team should focus of delivering their already funded proposal and when done , can apply for whatever update with looking suspicious.", "q2r": 1, "assessor": "z_assessor_2301", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 9508, "q0": "For a well rationalized description of the proposal purpose, mechanics, and direct connection to blockchain technology (without clearly quantified impacts), I rank this section a 4. The details here are very helpful in understanding the basis of the platform and it gives voters a thorough understand of what the final product might look like. The missing piece would be the sense of magnitude that this section provides with quantified impacts that appeal to adoption/retention of the Cardano ecosystem (ideally) or advancement of blockchain for humanitarian aims. To its credit, their website looks very polished and this proposal does mention that testing has been done under a web 2.0 model, so it’s safe to assume that there is some foundation (in terms of adoption) that can be brought into the Cardano ecosystem. I think it would give voters greater tangibility to have numbers provided to them about how many people use this platform now, how many people find mentors through things like LinkedIn (problem statement can be quantified too), or other relevant data/research points about the status quo. Other than that, I think this proposal demonstrates real potential. ", "q0r": 4, "q1": "For an impressively consolidated team with all the relevant experience points and a very transparent roadmap plan, I rank this section a 5. Many Cardano community members will be plenty excited to acknowledge that there is a healthy balance of female leadership on this team and (most importantly) an extraordinary roster of talent that is well equipped to take on this endeavor. My favorite part of this section is the roadmap that identifies different stages of the project with the various Catalyst funds (past, present & future) plugged in to the greater roadmap for this project. I expect voters to respond well to this disclosure, as there’s no guessing about intentions to submit for additional Catalyst funding at different timeframes AND it provides some information about interactions with reputable partnerships. While it’s clearly worked out for them thus far (and I expect the same results for this proposal), I would like to see a little more rationale on the budget. While the labor comes out to be surprisingly low (if we’re assuming full-time hours), the budget doesn’t thoroughly offer voters the ability to evaluate efficiency in spending by breaking down the hours allocated to each role. This is a very minor criticism but still may help future proposals secure greater voter confidence. ", "q1r": 5, "q2": "For only citing completion/redesign as a target for success, I rank this section a 4. I extend a little generosity on this section because the auditability for this project (as its fragmented across various proposals) is rather complex with different auditibility standards for each proposal. My usual criteria for putting central weight on platform usage isn’t exactly fair for this proposal, since it handles a portion of the project that has nothing to do with usage. Plus, other cited Catalyst proposals include KPIs that target those metrics. In this case, I think the success metrics are perfectly appropriate for what this proposal aims to accomplish and the transparency helps me to see that there are no issues on this point of evaluation. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10091, "q0": "I like the idea! The proposal fits with the challenge under the social media category. The goal is to build a mentorship social network with a distinctive advantage of deep connections. Users build up a network of trusted relationships with other users as mentors and/or mentees. It also aims to become a social network DApp built on Cardano blockchain by driving interaction within the ecosystem. \n\nOneUpOneDown is the continuation of the previous Fund8 project. The existing product works by offering a matching feature of mentors and mentees. It’s specified that it uses its own AI matching algorithm (funded prev) when a user's profile is set on the website. \n\nIt would make more sense in terms of building trust and deep connections when the project shifts from Web2 to Web3 as considering the reputation of individuals will be at stake. ", "q0r": 5, "q1": "The project has existed for 2 years and already has an infrastructure on Web2 which prepares the base and know-how to the web3 shift. As they stated they already have experience and understanding of user needs and behaviors. Work plan in the current plan of work consists from Concept design, CI/CD & Infrastructure, Monetization & Tokenomics. However, the detailed plan of the aforementioned works lacks. People who work on the project work on other proposals too. The team requested $36500 (11500 per month x 3; OCT-DEC) but they started implementing in June and till delivering they have enough time which doesn't make me question if they can deliver on time. The team seems to have all needed skills to run the project who are also Catalyst members and Cardano Ambassadors. ", "q1r": 4, "q2": "Expected outcomes and products are clear, although no metrics were provided to measure the progress. More detailed definitions are needed to explain the work they will do; such as redesign the front-end application to improve the matching experience and to achieve social network goal, develop pool functionality in the application, develop decentralized architecture for social web application. ", "q2r": 4, "assessor": "z_assessor_3147", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10102, "q0": "The current problem is the weak relationship between mentors/mentees, lack of continuous interaction to access high-quality community content within self-selected areas of interest, lack of quality Mentors to evaluate as well as fast track the progress of projects/proposals.\nIt is proposed to satisfy the challenge in Fund 9 about Dapps, Products & Integrations with the success index of creating a social network that connects mentors/mentees and can attract more potential mentors/mentees through interaction.\nThe application is also created based on the available resource established in Fund 8 as AI mentor matching software and producing a white paper modeling a Mentorship Incentivization DAO that will make the current proposal likely to succeed.\nIf the sponsored, proposal will have a positive impact and increase the value of Cardano/Catalyst while being able to attract more qualified and potential mentors as well as increase engagement that increases insights, Mentor's knowledge leads to better quality reviews and tighter recommendation tracking.\nThe KPIs satisfy the requirements of the given challenge, the proposal is also capable of solving future challenges when there is a team of mentors who are ready and able to evaluate the proposals in the next funds.", "q0r": 5, "q1": "The proponent has very clearly informed the project members including 3 key people, Mr. Natalie, Dzhuliana and Dimitar with extensive experience in the fields of business, marketing, finance, UX design / UI & Product Development, Software Engineer...with very clear contact information and experience. In addition, there is an additional team of experienced designers, developers and advisory groups. I believe that with the cooperation of the above members, it is enough to bring the project to success.\nThe proposed budget of USD 36,500 is allocated into 6 main categories and multiplied by 3 months of implementation. I find the presentation of the budget still unconvincing when the proponent only gives a general number for the items and has no basis for appraisal. What is the reason for multiplying by 3 months? do all 6 of these categories last for 3 months? In addition, tracking the progress, I find it not suitable for this 3-month figure when the proponent started work from June 2022 and lasted until October 2022. Proponents should consider establishing a budget based on a table, detailing the items, multiplying workers by the required hours of work, and the expected time of completion.\nThe proposal also provided a very specific project completion schedule, with a roadmap lasting from June to October 2022 and outlined the next roadmap in FUnd 10 and FUnd 11 showing that the proposal has been finalized.\nResources to implement the proposal in addition to the amount of 36,500 USD proposed in Fund9, the team will use the tools AI mentor matching software and to produce a white paper modeling a Mentorship Incentivization DA set up from the previous Fund to complete.\nThe risks of the proposal have also been clearly mentioned, Risk of not delivering and Risk of not reaching the desired outcome, these are the risks that are most likely to happen and they also provided reasonable risk reduction options.", "q1r": 4, "q2": "Proposal provided a specific and achievable Roadmap. However, KPIs and definition of the success of the proposal just stop at focusing on developing the application, what I want is to see the end result. The proponent should include one more KPI which is how many users are expected using this App. If there are many users the project will bring a huge impact to the Cardano Ecosystem and Catalyst and vice versa.\nIn addition, I have not seen the project provide a frequency of meetings as well as a channel to report the progress of the work so that the community can track and understand if the project is being monitored closely. Proponents should be aware of this issue.", "q2r": 4, "assessor": "z_assessor_3153", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13913, "q0": "This proposal effectively addresses the challenge since it will create a network that uses near peer mentor matching as a tool for the effective formation of deep quality centered connections and mutual growth which intend solves the problem of mentorship in a realistic way. The fact that they have already started a phase of it is great because they would be able to analyze the worth of the project being undertaken whether or not it’s worth investing. This proposal effectively addresses the challenge settings . The key metrics and goals which are 3 in number as well as the KPIs which are further set from the previous funding received and well detailed to understand where they would develop to in the coming years. This is a well stated proposal that addresses future challenges which is a plus to making sure a business does not encounter something you least expect. ", "q0r": 5, "q1": "To begin with, a total amount of $36500 which is a realistic amount has been requested for with a breakdown of budget into details which is very realistic. Now to the experiences thus sales, marketing, finance and startup programme design business development are good experiences to build a mentorship app as well as running it adequately. \nThe timelines that can be used to measure the implementation of this project are well assigned in a quarterly manner starting from June and are well detailed with thorough understanding of the work to be done. The plan also describes all resources needed including technologies, software developers, mentors for match making, which are necessary to implement the proposal to it’s final unit. The considered risks involved and the solutions are also very well elaborated and so therefore will make implementation of this project easy to carry out since this project has already started with it’s implementation. ", "q1r": 5, "q2": "The information provided here is sufficient to audit the progress since it’s been stated that the strategy for measurement  are goals and KPIs. With respect to how they see the success of this project which are in two folds thus delivering core functionality and presenting decentralized logic and tokenomics market. The roadmap and milestones are clearly stated with durations of implementation attached which will end in 2030. Their key performance indicators thus proportion of youth and adults information, extent to which global citizenship education and education for sustainable development are measured, proportion of seat held by woman and lastly proportion of individual who own a mobile phone. These are however well explained and easy to comprehend thereby making the progress and success of the proposal very evident.\nLastly, this project touches on two Sustainable development goals thus goal 4 and goal 5 which is great and should be given grants to see to it’s successful implementation and running since it has into details exactly what is needed to run the project.", "q2r": 5, "assessor": "z_assessor_3847", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "A social network that uses near-peer mentor matching as a tool for the effective formation of deep quality-centered connections, and mutual growth within a large network. ", "experience": "OneUpOneDown is a software company that has developed an operational automated AI-powered mentor-matchmaking platform with engaged users. The team is highly experienced and committed Catalyst members and Cardano Ambassadors."}