{"id": 418254, "author": "seedstars", "title": "Tokenizing Income Share - PoC", "url": "https://cardano.ideascale.com/a/dtd/418254-48088", "category": 26595, "amount": 268814, "description": "Access to tertiary education responding to labor market need is limited and lacks appropriate financing mechanisms. ", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 541, "q0": "The problem statement (lack of appropriate financing mechanisms) and problem solution (income share agreements on emerging markets) of this proposal are directly aligned with the challenge question (bring impactful use cases to Cardano ecosystem that help drive more adoption). This proposal is part of an ambitious plan that has potential to have a truly transformative impact on Cardano use and adoption, as well as having a positive impact on millions of people in emerging markets. This proposal is for a proof of concept only, however we must consider the final product when considering the potential impact of funding this early stage proof of concept. By creating income share agreements and tokenizing them on the cardano blockchain, this could potentially impact millions to billions of people. The teams involved with this proposal, seedstars, proofspace, cardashift, chancen all have significantly large reach, with large teams of experienced professionals working on real world solutions for emerging markets. This is the type of project that is required for Cardano to reach mainstream awareness and exponential growth. The KPIs are directly related to the challenge question, for example # of new cardano wallets created for ISA, # of Atala DID credentials created, # of users interacting with Cardano through this platform, etc. This project is also an excellent opportunity for Cardano to be a leader in the space with respect to decentralized identity, and self regulation. Emerging markets present many challenges and opportunities to build new financial models that can better address the needs of the people. By experimenting in various countries with different regulations, on chain ISA agreements can be created as an example for the rest of the world to follow. https://www.forbes.com/advisor/student-loans/what-is-an-income-share-agreement/", "q0r": 5, "q1": "I have rated this 5 stars for feasibility because of the professional teams involved, and their detailed plans provided. I do not doubt the teams ability to deliver, however; I would caution voters to be aware of the potential risks of such a large, ambitious and complex project. Funding will be required from multiple catalyst proposals, as well as potentially launching a successful ICO for the project. The team has clearly discussed several risks associated with this proposal and provided mitigation strategies. While there is risk of failure, this is exactly the type of use case Cardano was designed for, and this is the type of project catalyst was designed to be able to fund. It is worth the risk to provide this professional team these treasury funds to deliver on their vision for Income Share Agreements and use of Decentralized Identity in emerging markets. The team has provided a detailed plan with actionable tasks and a realistic timeframe. The budget is reasonable given the scope of this project and the work required to be completed. The proposal has outlined that this proposals budget is just one part of a larger plan that will require additional funding, some of which will com from a second fund 9 Catalyst proposal,  ( https://cardano.ideascale.com/c/idea/418255 ) and a future ICO. ", "q1r": 5, "q2": "The team has clearly explained the KPI's and metrics that will be tracked for this proposal. There is a workplan with a timeline linked in the proposal (https://docs.google.com/spreadsheets/d/1uNajq4UyT0c-_tBXbBh0tb3psx3kZMOyB-nE-yUfK-Q/edit#gid=851358364) and a miro board (https://miro.com/app/board/uXjVOppf37M=/) The team has committed to monthly progress reports and have provided an extensive list of KPIs. I have given 4 stars instead of 5, because I find the linked timelines to be a little confusing to determine exactly what will be delivered from this proposal only, and on what date. I believe this could be improved by including a clear timeline directly in the ideascale proposal with target dates for key deliverables from this funded proposal (and clearly explain what this proposal alone will fund and deliver, as opposed to the entire projects vision) ", "q2r": 4, "assessor": "z_assessor_2108", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4531, "q0": "[My comment here has overlapped content with my comments for the other proposal in Fund9 from the same proposer since those proposals share a  portion of content] I strongly agree that this project has a great impact. The proposer provides information with a high level of clarity that the project meets the goals of the challenge (i.e., tokenization of real-world assets and building a marketplace for such tokenized assets and auxiliary Defi services that will attract a large new set of Cardano users, create other infrastructure that further increases the adoption for Cardano such as new technical standards for education-linked tokens). It also meets Fund9's strategic goals (i.e., prepare a group of people able to make contributions to the ecosystems, and build real-world solutions based on the Cardano blockchain). The proposer presents a metric that only 8% of the youth population in Africa could assess high-quality private education system, thus this project (with this proposal being the initial part) has a large impact by increasing the percentage of the population who can access better tertiary education. The proposer includes in their plan the consideration to scale this solution to other emerging markets. This proposal is the next stage after their other proposal (preliminary use-case testing) they will leverage the other one's findings to design a Proof of Concept of the tokenized income share agreements and prepare to scale it through an ICO. This step is essential to realize the impact of the project.\n", "q0r": 5, "q1": "[My comment here has overlapped content with my comments for the other proposal in Fund9 from the same proposer since those proposals share a  portion of content] I strongly agree with the feasibility aspect of this proposal. The team (including lead submitters and co-submitters) consists of groups that have demonstrated their experience in relevant fields (education, training, startup incubation, digital identity, blockchain research) as well as their activeness in the Cardano ecosystem: Seedstars, ProofSpace, Smart Chain, Chance International.  The lead submitter - Seedstart itself, has a long track record of being able to scale its operations across countries (enabled entrepreneurs across 75 emerging markets, supported 37k+ entrepreneurs, delivered training for 2k+, and invested in 75 companies). The specific key deliverables of this proposal are (1) preparation for ICO; (2) Onboarding ISA providers, education providers, and ISA recipients; (3) creation of workflows, and management dashboards; (4) system integrations; and (5) tokenization of 15 ISAs. The team has done preparation work that includes the initial workflow and a detailed work plan. The work plan comprises planned activities to be carried out, their deliverables, their methodologies and tools, the team in charge, the hours required, the planned start time, and the duration of such activity. It is one of the best, most comprehensive work plans I have seen so far on Catalyst. Similar to the other proposal about preliminary use-case testing, I see some coordination and project management risks here, as there are four different organizations involved in this project and this stage requires even more collaboration and interdependencies than the first stage. Hopefully, the detailed work plan should mitigate that risk. In terms of budget, the team states an hourly rate of $200 per hour for all the roles.  $200/hour is a high rate. To put things in perspective, the fee to hire freelance consultants in the U.S. ranges from $50 to $150 per hour, with the upper price band corresponding to consultants with more than 20 years of experience. I would hope to see more details regarding the experience level and other requirements (location, degree, how difficult it is to hire such a position) of each role in order to have more information to assess the hourly rate. The roadmap for this proposal is a bit unclear, as the workflows are mixed with what they plan to ask for in Fund 10, and some workflows last until 2027.\n", "q1r": 4, "q2": "[My comment here has overlapped content with my comments for the other proposal in Fund9 from the same proposer since those proposals share a  portion of content] I strongly agree that this project is auditable, thanks to the clarity provided by a comprehensive work plan and the set of KPIs provided. The key KPIs for this proposal are (1) a successful ICO, (2) deployment of 15 tokenized ISAs, and (3) a scale-up plan for the POC. All three of these key KPIs are clear and easy to verify. In addition, the community may track the project by granular deliverables from the workplace, implementation of the five strategy pillars (novelty, viable application, new users, adoption increase, interconnectivity of existing solutions), and quantifiable metrics for each of those five pillars (e.g., the proportion of ISA repayments on track or at risk, # of new Cardano wallets). Please note that the specific metrics of the five pillars for this proposal are different from the metrics for the same five pillars under their preliminary use-case testing proposal. The team also makes clear its communication method for the projects such as via websites of contributors, social media platforms, Cardano Community Townhalls, and videos. The proposer has provided great clarity with their problem statement, solution statement, and the vision for the project, as well as the granularity of deliverables from their process.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Hi, \n\nThanks a lot for the thorough review of the proposal! Much appreciated. \nBelow are the clarficiations to some of the flags raised: \n\nPRICING\nIndeed, the rates are on the higher end. This is mosly driven by the fact that projects staffed on rolling-out the proposal are all senior staff and most of them C-suite and founders of the organization themselves (e.g. Pierre Alain Masson, Michael Weber, Adrien Hubert, Nick Mason, Vincent Katchavenda, Batya Blankers). \n\nOther team members with very in depth expertise, especially tech. For example: \n- Viktor Radshenko has a 20+ years of R&D experience and full-stack, \n- Ruslan Shevshenko has 30yrs full stack experience additionally to being  the founder of several successful ventures (NBI, GradSoft, largest UA Scala Group) and having 10 publications in peer-reviewed journals. Also authored “Methods of Algebraic Programming” \n- Alexey Hodkof has 17 years of experience in Web backend and frontend solution architect and developer \n- Slava Sheblokov has 20 years experience in wide variety of IT areas, including with PlayTech and GlobalLogic.\n\nMoreover, Smart Chain and Cardashift are Paris (France) based, Seedstars is Geneva (Swtizerland) based and thesr are locations where human capital is relatively expensive. \n\nTo access the qualifications and previous experience of the team members, kindly click on the LinkedIn hyperlinks in the proposal directly. \n\nROADMAP \n- We are happy to calrify any particular question on the roadmap ( https://docs.google.com/spreadsheets/d/1uNajq4UyT0c-_tBXbBh0tb3psx3kZMOyB-nE-yUfK-Q/edit#gid=851358364)\n- The reaon the timelines run for so long is that education timelines are long as the education only of a talent lasts for two years (so 2023-2025) then comes the support to market entry of the talent (2025-2026, help in finding a job, going thorugh interviews, etc). \n- Moreover, as we believe in iterative learning and want to scale the impact we can have thorugh this project, we don't want to stop applying our learnigns after one batch of talents but instead we will keep learning from iterations of our education financing mechanism over a few batches of talents (if we do that for three batches of talents, so students starting their educational journey in 2023, 2024 and 2025, it already gives us a timeline running until 2027) \n- We have indeed included our application to Fund 10 in the timeline to give the community full transparency on what our plan is to scale the project and its impact and integration on the Cardano Blockchain. \n\nWe remain at your disposal to answer any further questions / concerns with regards to the proposal and thank you again for the time commitment of having provided such an in-depth assessment. \n\nKind regrads, \n\nThe Seedstars, Proof Space, Cardashift and Chancen International Teams "}, {"id": 6686, "q0": "Seedstars are seeking funding during this funding round with three complementary proposals, this being the second one. All offer exceptional value propositions and are perhaps amongst the top 1% in terms of quality in this round. Let’s dive in. \n\nBeginning with the problem statement, we find out that the tertiary education systems in emerging markets do not provide adequate access to jobs and only cater to those with the existing financial means to finance the lengthy process - only 8% of the youth population in Africa. The value proposition is to unlock access to higher education through income sharing agreements in which students agree to finance it through pre-determined payments after graduation, based on a percentage of their income. The link with the Cardano ecosystem is that Seedstars intends to build these agreements on-chain and to tokenize them. \n\nA prerequisite of launching this proposal, Seedstars will have to finalize their first logical proposal in order to research into the use cases and identify the best possible implementation solutions. Once that part is done, they can proceed to implementing this proposal: to launch a proof of concept and to prepare for scaling it up in order to fast track the adoption of the income sharing agreements within their target emerging countries. \n\nThere is a unique blend of circumstances that makes this proposal (and the one before it) absolutely extraordinary in terms of impact: \n\n- a partnership between five strong and mature organizations, including Cardano native ones, is bound to offer excellent visibility to the project and access to additional sources of funding, competence, networking effects and the change of onboarding the best possible team\n- the use case is exceptional as well, since it is a blend of acting within the emerging markets, the youth population and it’s a real life use case\n- there seems to be a slow and steady philosophy behind the project and the team, very much in sync with Cardano’s ethos and its way of doing business, research and anything in between. \n\nOf course, five stars for potential impact. ", "q0r": 5, "q1": "Let’s find out more about this joint venture. Seedstars is an organization with more than 80 members focused on influencing people's lives in emerging markets through technology and entrepreneurship. They are the lead proposers, and they have partnered with four other organizations for this project. ProofSpace is an identity network focused on issuing and verifying decentralized identity credentials with no-code tools. Cardashift is a (Cardano native) launchpad that raises funds for startups that are solving social and environmental issues. Smart Chain implements distributed ledger solutions. Last but not least, Chancen International provides financing for young people in Africa to access tertiary education. Of course, all of the teams have an excellent presentation of their core teams and as a second step you have their websites on which you can spend hours and hours while reading about their ongoing projects and past successes. \n\nTheir work plan is one of the most extensive from this financing round - it’s only normal, otherwise it would be impossible to coordinate between five medium sized organizations. \n\nAs far as I could tell the activities for this proposal would extend until at least 2023, and it has very concise actions and responsible partners for each of them. There are good indications that all partners have devoted time and resources into writing this proposal, and they will continue to do so in the future, having already accounted for the necessary time / human resources needed for it. The main activities will involve the ICO and its preparation, vetting and onboarding the providers of the sharing agreement and the education partners, possibly the creation of charitable stakepools, developer work to support the reporting for each student (or talent as they call it) and finally tokenizing and deploying 15 agreements. \n\nThe proposers are doing an excellent job at recognizing and planning for certain risks, and the entire exercise showcases that we are dealing with mature organizations that have extensive experience in running similar projects, so it’s unlikely to encounter significant unforeseen conditions down the road.\n\nThe budget is presented in a separate sheet, and is very easy to understand. Around 100k USD would be allocated to Seedstars, and another 100k USD would go to Proofspace. The rest of the budget is split between sundry items and a little bit more (30k) for reporting between partners. The hourly rate charged is 200 USD, perhaps slightly on the high end considering the project will most likely include some junior or mid level analyst hours which should perhaps be charged at a lower rate. But voters are definitely the ones who should judge the value for money so no points deducted for this reason. \n\nThis is a beautiful proposal, too bad it’s not timely too. And it isn’t, since it heavily depends on the finalization of the initial research stage, since they are not the type of projects that can be run in parallel. Indications that this proposal was a bit more “rushed” than the first one is also the fact that there is a “TBD” within it - a clear sign that more proofreading was necessary, if not even more planning. Also, the scope of this proposal might change significantly after digesting the findings from the first phase. Considering all this, I can only offer three stars since I believe that funding for this proposal should be requested when a clear picture emerges from stage 1 of their plan. ", "q1r": 3, "q2": "Given the research focus of this proposal, the team manages to come up with a comprehensive framework for understanding how to track the project as well as how to measure its success and put it in the right perspective. They aim to have good website sections in place for each of the project’s partners as well as to measure social media contributions. The project should also be finalized with clear deliverables in terms of an ICO, whitepaper, and deployment of 15 sharing agreements. \n\nThey also include very relevant repayment targets (similar to how banks would probably account for default rates) for repayments: 53% on track, 34% at risk, 13% off-track and a default rate of 20%. I will not be judging these numbers but I can spot an inconsistency: these income sharing agreements should be long term contracts, with repayments starting after finalizing studies (which should take a few good years). Is it not too early to put a figure on repayment rates without knowing yet what kind of model will be used in practice? \n\nWe have here a very strong joint venture of enterprises that are undoubtedly used to frequently reporting to their stakeholders and to offer transparency for their work, so there is no doubt that together they will be able to do a good job in ensuring full auditability for this project if implemented. However, there are many missing pieces in how this project will be rolled out, which are impossible to define before finalizing the research phase. In this respect and building on the default rates inconsistency from above, I think only four stars are appropriate at this stage.  ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Hi, \n\nThank you for the extensive and detailed review of the proposal. Much appreciated. We will clarify some of the concerns below and are happy to answer any clarifications / concerns further down the line. \n\nPRICING \nIndeed, the rates are on the higher end. This is mosly driven by the fact that projects staffed on rolling-out the proposal are all senior staff (most junior has previously launched 2 companies and managed the activities of Seedstars in 16 countries - Tiziana Bombassei).Most team mebers are either C-suite / founders of the organization themselves (e.g. Pierre Alain Masson, Michael Weber, Adrien Hubert, Nick Mason, Vincent Katchavenda, Batya Blankers). \n\nOther team members with very in depth expertise, especially tech. For example: \n- Viktor Radshenko has a 20+ years of R&D experience and full-stack, \n- Ruslan Shevshenko has 30yrs full stack experience additionally to being  the founder of several successful ventures (NBI, GradSoft, largest UA Scala Group) and having 10 publications in peer-reviewed journals. Also authored “Methods of Algebraic Programming” \n- Alexey Hodkof has 17 years of experience in Web backend and frontend solution architect and developer \n- Slava Sheblokov has 20 years experience in wide variety of IT areas, including with PlayTech and GlobalLogic.\n\nMoreover, Smart Chain and Cardashift are Paris (France) based, Seedstars is Geneva (Swtizerland) based and thesr are locations where human capital is relatively expensive. \n\nTIMELY PROPOSAL \n- \"Indications that this proposal was a bit more “rushed” than the first one is also the fact that there is a “TBD” within it\" -> We apologize for the misunderstanding here, the TBDs that are found in the workplan and the proposal are not linked to a lack of proofreading but more so to the fact that these are elemnts on which we do not have clarity at this point and for which we'll only gain clarity after the roll-out of the first part of the project (so the proposal on preliminary use case testing that can be found here: https://cardano.ideascale.com/c/idea/418255). For example \"TBD: creation of charitable stakepools\" can be found in our answer to the question asking for a detailed plan. The TBD here is linked to the deliverable \"Interviews with crypto investors\" and \"Intgration plan\" in the proposal \" Tokenizing Income Share - Use Cases\" (see worplan here: https://docs.google.com/spreadsheets/d/1uNajq4UyT0c-_tBXbBh0tb3psx3kZMOyB-nE-yUfK-Q/edit#gid=851358364). The same rational applies for all other TBDs to be found in the workplan (the hereinabove example is the only TBD to be found in the proposal). \n\nPROPOSAL BASED ON OUTCOMES OF THE FIRST ONE \nWe are completely aligned that the scope of this proposal might change significantly after digesting the findings from the first phase. However to mitigate material changes at all levels, our teams have already started and are continuing working on prior to the reception of the funding. \n- Tech -> initial mitigation captured in the workflow here: https://miro.com/app/board/uXjVOppf37M=/?share_link_id=825974830925\n- Operationalization -> initial miitgation captured by the Seedstars and Chancent Internaitonal teams through meetings with financers, talents, ISA providers, education providers to best capture on the ground challenges. Moreover Seedstars is currently launching and running education programs in two African countries and running experiments / gathering learnings that will inform the operationalization process.\n- Financial -> initial mitigation captured during a workshop held after the submission of the proposals of the Cardashift and Seedstars teams and discussions of the aforementioned and Chancen International with funders \n\nREPAYMENT RATES \nThank you again for the level of detail of your review! Impressive. You are totally right that it takes a long time to gather data on ISA recollection. This is why we have been operating and exploring the market in-depth (and will continue doing so). The numbers you have highlighted are based on the averages that we gathered from interviews with ISA providers were have been in touch with. Moreover, we have direct access to relevant datasets as one of the organizations co-submitting the proposal is Chancen International who has already been deploying income share agreements for 25 years catering to 1762 talents (https://chancen.international/). \n\nAGain, we thank you for your review and remain at your disposal to clarify further concerns / questions. \n\nKind regards, \n\nThe Seedstars, Proof Space, Cardashift and Chancen International Teams "}, {"id": 11936, "q0": "The proposal tries bring token system towards the existing income-sharing agreement. The proposal also aims to tackle a huge problem by tactically and in detailed manner build up the solution step-by-step on various proposed workplan (reference provided) so the whole great plan can be run smoothly when it is all fulfilled. Bringing ISA for graduates based on Cardano would increase the network value on an imaginable scale, keeping in mind that there are many students with different economy status that need financial support on their education. Opening their path of education through ISA, will then add new brilliant and productive people to Cardano environment, resulting in Cardano usage & development, also budget return from the ISA system.\n\nMeasuring from participating organizations experience, I believe the project can be implemented successfully. Risk are varying from traction to regulatory to technical aspects, with each of them attached with a well explained and logical plan of mitigation.", "q0r": 5, "q1": "Various measurable milestones included, mentioning each organization responsibility and working items in the project, resulting in great work management system in the proposal. The timelines are also provided on the attached google sheet link, presented in Gantt chart which is informative, easy to understand, logical and feasible to be done. Each member Linkedin profiles, related experience and project, and also their backgrounds has also been described fluently, which makes myself is certain that they will be able to finish the project as proposed.", "q1r": 5, "q2": "The proposers try to make the project as auditable as possible, by publishing through various media channels, providing monthly reports, updating on websites of all contributors and social media platforms. Several mentioned quantifiable KPIs are proportions of ISA repayments, number new users, new adoption number, and many more. I would suggest to add more metric for the project success measurement, such as quantifiable number of new users or the number of growth on PRISM credential as they will use the platform.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 15246, "q0": "The proposal raises the problem that the ability to access higher education to meet the needs of the labor market is still limited and lacks an appropriate financial mechanism. To improve this, it is proposed to implement proof-of-concept tokenized income-sharing arrangements in emerging markets. The plan is to get a talented ISA to agree to pay for their college education or part of their study expenses by making pre-determined payments after graduation based on a percentage of their income. , note that there are many students of different economic statuses who need financial support for their studies. Open their educational path through the ISA, which will then add new brilliant and productive people to the Cardano environment, leading to Cardano usage and development, as well as the payback budget from the ISA system. The problem statement and solution offered are directly relevant to the challenging question of bringing impact use cases to the Cardano ecosystem that help drive more adoption.\nAny project will face challenges and potential risks, this proposal has provided some of the risks they will face during project implementation, fortunately, they have contingency plans to can overcome them", "q0r": 5, "q1": "The team provided a blueprint via a google sheet page with actionable tasks and realistic timeframes.\nNext is the project development team, which is very well presented, we know their specialized roles (what areas they work in), as well as how they got involved in Cardano and a curriculum small help us based on their previous experience. Their affiliated profiles are also provided so that all information provided is verifiable and we can also know more directly what they have done so far and how they are established in the context of their professional scene. So, 100% confidence in the team will be passed.\nFinally, the required budget of $268,814 we know what the total amount will be divided into, as well as the number of work hours that will be spent in each of these areas and their cost per hour worked at $200 (according to receipts). In my personal opinion, $200/hr seems high compared to other projects). I think the understanding of how the amount will be used is very clear, the Cardano community will determine if the requested amount is reasonable or exorbitant", "q1r": 4, "q2": "Throughout the detailed process of the proposal, the proponent informs us of the KPIs, deliverables, and metrics that can determine the success of this initiative's progress. Therefore, we have a lot of documents on which to base our ability to audit progress. In other words, we know what the mini-goals are, what would be considered a partial success, and so on. The proponent also established well the ways the Cardano community can access this information such as: through all contributors' websites, contributors' social media platforms, and additional platforms like the Cardano Foundation and the IOG media team...\nThe success of the proposal is also very well defined:\n-Achieving efficiency and transparency in education funding through income-sharing agreements\n-Increasing Cardano adoption across emerging market education contexts both at the institutional and individual levels\n-When scaling the initiative, the creation of a new type of impactful content\n-Unlock crypto investments for education in emerging markets", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15370, "q0": "The proposal is very much similar to the other proposals (same submitters) https://cardano.ideascale.com/c/idea/421830 and https://cardano.ideascale.com/c/idea/418255. Therefore the identified problems are very much the same as the two other proposals. This proposal is the solution is the Proof of Concept and should be completed first before the other two can become to fruition. The Theory of Change and the ISA Tokenzation workplan is too small to be read.  The positive points are the impact alignment with the challenge settings and benefit a large community who will join the education financing and also get incentivization with the tokenization plan. Risks are well mentioned and mitigation actions are in place. Overall, this is a very well-rounded proposal. ", "q0r": 5, "q1": "As for the other 2 proposals, there is an attached workplan with all the details of workload and description for each task. The team is very well rounded with 4 institutions: Seedstars (lead) and the other 3 organizations ProofSpace / Smart Chain and Chancen International. The team is very much capable and reliable in the industry in mostly MENA regions. The proposal is also transparent about this fund 9 is only for research and what the PA understood out of the 3 submitted proposals, this is the fundamental one to have at least the PoC for the upcoming developments of the projects. The team will come back in Fund 10 Fund 11 and future funds. ", "q1r": 5, "q2": "The KPIs/ OKRs are very clearly defined and easy for the audience to track the project progress, with mostly SMAR '-T'goals. There should be a time-bound attached to each KPIs in these summarized answers instead of letting the PA/Voters check very details in the workplan. The success of this project is also clearly defined and mentioned with the impact of both quantifiable and qualitative metrics. Moreover, the project is well thought of as SDG 4 and focused on women and gender balance as a side impact of the project. ", "q2r": 4, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We will do a proof of concept for tokenizing income share agreements on emerging markets. ", "experience": "Seedstars has spent the past 9 years enabling emerging market entrepreneurs across 75 countries. The group has supported 37k+ entrepreneurs, delivered training for 2k+, and invested in 75 companies. Additionally, we have a relationship with the Cardano community through F7."}