{"id": 418217, "author": "digifarm", "title": "Agricultural sustainability index", "url": "https://cardano.ideascale.com/a/dtd/418217-48088", "category": 26595, "amount": 91200, "description": "Current problem is the lack of transparency and verification of in-field sustainability in the smallholder agricultural value chain.", "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 540, "q0": "The problem statement and solution in this proposal is a unique and impactful usecase that is directly aligned with the challenge of bringing impactful use cases to Cardano. The plan to onboard 2,500 registered smallholder farmers in Ethiopia is a small but significant step that can quickly scale up if successful. Farmers are crucial members of any community, and supporting them in making profitable and sustainable decisions with Digifarm and Cardano technology will have wide reaching impacts beyond the individual farms. The proposal is also aligned with several sustainable development goals, and the broader vision for Cardano to provide beneficial use cases in Africa. The software uses global satellite imagery, and is already providing data for farmers in various countries around the world. Therefore the technology can easily scale and provide valuable data to farmers not just in Africa but also other countries around the world. \n", "q0r": 5, "q1": "The proposal has included references for the team members, that showcases their relevant skills and experience, and they have extensive experience and are well qualified professionals in their respective fields. I would however recommend the team to include someone with extensive experience with the Cardano blockchain, development and integration. While it is apparent the team knows the digifarm software very well, it's not clear if they will have any difficulty, or if there are knowledge gaps, with integrating their digifarm software with the Cardano blockchain. I have removed one star rating for this uncertainty, as there may be a risk of unforseen issues with, as they say in the proposal; \"Develop blockchain technology for putting field boundaries and initial ledger on BC\" It is not clear who on the team has experience developing on Cardano, or if they plan to outsource this work. It may be challenging to find experienced Cardano developers if required, as experienced Cardano developers are currently in very high demand with so many Cardano projects currently being built. There is also mention of a digifarm initial stake pool offering, but no mention of who will be setting up, running, and maintaining the ISPO which will come with some additional technical challenges and risks that the digifarm team may not have experience with. \n\nThe Digifarm software is available and functioning today, with a free demo available on their website. The team has a proven trackrecord, and has successfully secured funding in Fund8 with Catalyst. Therefore, despite the potential challenges with Cardano integration and development, I am confident the professional team will be able to overcome any challenges faced with delivering this proposal. ", "q1r": 4, "q2": "The proposal provides a roadmap with monthly milestones and tasks that can be tracked by the community. The team has committed to monthly progress reports delivered to the catalyst community at each milestone. Their work will also be available for review on Github. The proposal includes clear KPI's and deliverables with specific delivery dates for each milestone. The success criteria has been clearly described with 5 key outcomes provided in the proposal. Therefore this proposal will be easy to audit by the community. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Great review and great question re DigiFarm's experience with BC and Cardano, and you're absolutely right as this is not our core competence we will be partnering with existing Cardano developers/IT ledger partner whom we have been introduced to through Yoram Ben-Zvi from Connectality. "}, {"id": 2832, "q0": "The goal of this proposal is to apply blockchain technology to geocoding, while managing and promoting agricultural productivity. allows farmers to tokenize their assets (the geographical boundaries of their land), in addition the proposed team states that this inspection is done through open access on mobile devices.\nAlong with that, there are many issues that need to be proposed in more detail by the team, such as the individual token distribution of farmers, I understand for this to raise capital with tokens for assets on the plot. that land to have more funds for replanting, sustainably. So what are the benefits of individuals or groups that buy back that token?, in addition to the climate offset that the group stated.\nalong with that, who will manage and track the relevant data according to the season, of that encrypted land? for the sake of protecting those who buy tokens of that land. The team needs to analyze and illustrate this action a bit more closely, so that it can attract interested investors when the proposal is successful.\nIn parallel with the supply documents, the proposal explains the activities with evidence, and provides a solution to the problem of the output risk of the products cultivated on the tokenized parcel of land.\nin general according to the statements and documents provided in this proposal are fully suitable for the challenge posed. but need to be more specific about the interests of investors so my assessment for this impact is 4 points.", "q0r": 4, "q1": "A roadmap plan for the implementation of this proposal was provided in full by the team, milestones were identified in each phase, and work in each phase was appropriate for implementation on schedule. In addition, important works have been registered such as: Document the technical architecture and have evidence for this action.\nalong with that a community approach has been planned and applied to popular social networking platforms such as: Linkedin, Facebook and YouTube.\nThe details of the spending budget for the proposed implementation are charged at $65/hour, the specific work contents and the number of hours performed are attached to ensure transparency and easy understanding.\n \nIn addition to the additional members, I identified 4 people in the core team developing the proposal, and the relevant information as well as the experience of each member is provided. Thus based on the presentations and documents provided as well as the meticulous plans, this proposal can easily succeed.", "q1r": 5, "q2": "The workloads will be reported by the committed team on Github every 4 weeks, along with a summary and reporting for important milestones in each phase to ensure absolute transparency.\nIn parallel, success is determined for 5 benefits that will bring to the community and user attractions for Cardano, benefits for farmers identified in the initial development area.\nBased on the indicators and documents of the offer proposal can easily measure the workload and determine the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "Great review and great question re tracking/buying back tokens; the purpose of this project is the ability to provide smallholder farmers and the agricultural value chain (multi-national food/beverage corporates)incentives for farming sustainably and for corporate the climate offset exactly as you've mentioned, DigiFarm will be the entity which will track and monitor the sustainability of individual polygons, this will happen through firstly delineating boundary, creating a baseline (based on historical biomass/vegetation EVI) and then monitoring the basic either increase or decrease in productivity based on sustainability (is the field depleting its natural resource or increasing them) on a quarterly basis according to the crop calendar (growth season) and this will be linked to the value creation. "}, {"id": 7846, "q0": "The problem is stated clearly; it fits the challenge category \"Environment\"\n\nThe proposal aim to add value to the ecosystem by creating a scaleble use case, using Cardano technology to improve outcomes in a domain that is in focus of the community and wider audience.\n\nThe intended impact on the ecosystem seems to be in promoting a positive image of Cardano in wider audience.\n\nThe KPI's of the proposal align with the challenge: number of users onboarded to Cardano, amount of awareness, potentially number of people changing their habits.", "q0r": 5, "q1": "The implementation plan is detailed with actionable tasks stated,  there is a budget breakdown, the team is clearly outlined with relevant skills and links to team members online presence. \n\nThe risk assessment is extensive.\n\nA realistic timeline is given, the details of the implementation are clearly explained. ", "q1r": 5, "q2": "Time line for implementation is provided, the KPI's make sense, they are quantifiable (number of commits, number of users, monthly reports) and can be used to measure the progress of the implementation,\nThe community can track the implementation of the proposal. ", "q2r": 5, "assessor": "z_assessor_2928", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 15239, "q0": "Digifarm, funded in Fund-8 for Tanzania agri land ledger to “enable smallholder farmers to easier access financing, agronomic advisory and build their credit profile” is back with an index product. This is a perfect direction for Dapps, Products and Integrations, if it makes clever use of the Cardano blockchain. The digital agricultural identity seems worth pursuing and integrating more with Cardano tokenization. Although the project mentions Charles Hoskinson and Nation Building, I feel it is a missed opportunity to pursue a slight pivot with the sustainability index instead of further pursuing DID and blockchain integration of their truly impressive flagship product.", "q0r": 4, "q1": "This is one of “Norway’s leading ag-tech startups” active in deep neural networks and satellite imagery. They work with super high profile clients like the World Wildlife Fund, German KWS who are the fourth largest seed producer worldwide and a Thai telcom giant. The profiles of the team are impressive and they have a working product, accolades and traction. They do not need Cardano but can achieve more research breakthroughs with the grant, and blockchain currently seems a small aspect of their tech solution. Success is highly likely in terms of product roll-out, the blockchain feasibility is middle of the road. Combined score 4/5.", "q1r": 4, "q2": "Business plans, sprints schedule, team profiles and public relations are top notch. This is a top-of-their-game startup keen to work with Catalyst, so the Auditability will be excellent. Let’s find a way to make it more attractive for these guys to use Cardano while doing their good work. I hope it benefits both sides. The main success goal that relates to Cardano is the ability to create the fundamental layer of agricultural digital identity for where scalable applications and products from the Cardano community can be built upon to provide additional value, assisting Cardano attracting users. It does sound complicated, and I hope it won't be. Whoever has a collab idea for these guys, let's make them a part of our world.", "q2r": 5, "assessor": "z_assessor_2761", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15245, "q0": "The value of the overall proposal becomes clear quickly: Expanding an already existing tool to further enable sustainable farming practices. While some of the parts of the proposal make it obvious that it was partially rewritten from an older proposal (Nation Building Challenge mentioned) it nevertheless still mostly aligns with the challenge it is posted in. It can definetely be said that it will provide value towards the Cardano ecosystem and general societey and should to some amount be scalable.", "q0r": 4, "q1": "The proposers are quite transparent about their qualifications and do not just show credibly that they are up to the challenge, but also that they have already done a lot of work: some early versions of their services are already available. Nevertheless a very decent implementation plan is presented with a monthly roadmap, sufficient description of various tasks and credible budgeting. Technical background is explained sufficiently as well. Good job.", "q1r": 5, "q2": "The overall description of the objective and how to obtain it is clear. The fine-grained, time-bound roadmap will allow auditing along the entire way of the proposal and the success metrics are set up sufficiently in order to monitor progress. Monitoring tools also exist, like the extensive documentation of what is currently existing of the project.", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15249, "q0": "The “Agricultural Sustainability Index” proposal addresses the Dapps, Products & Integration challenge by “Digifarm”. Digifarm will be able to detect if any agricultural field has been farmed sustainably and the tool can help to decentralized supply chain data. The team plans to start off in Ethiopia which is highly dependent on agriculture (40% GDP, 80% export). When asked to describe how the proposed solution will address the challenge, the team has mentioned about “property registration” in Ethiopia and the challenge brief of Nation Building Apps (one of fund 8 challenges). This causes a slight confusion as to this challenge fund 9 is about “What dapps, products and integrations can be implemented to bring impactful use cases to Cardano ecosystem that help drive more adoption?” However, given the solution is using satellite imagery to detect field boundary and create baseline for assessing sustainability and long term productivity powered by AI, the sustainability index has high potential to benefit the small farmers as they provide in-field analytics of crop production which is an impactful use case that fits the challenge well.", "q0r": 4, "q1": "The Digifarm project spans across 7 months with set of key milestones. The team also expand their task list post funded (month 9-12). The team has reasonable budget breakdown for the total requested budget of $91,200. The team track record in agricultural technology for crop monitoring using AI and Satellite data is very impressive. They were funded in fund 8 for the open ledger for agricultural land in Tanzania and have been receiving grants from various organizations throughout their operation (since 2018). With the clear roadmap, reasonable budget and strong team, it’s clear that the team knows their craft and that the project feasibility to completion is high. ", "q1r": 5, "q2": "The team views its success as the ability to create the fundamental layer for agricultural digital identity, reach target IoU accuracy, assess yield data accurately for farmers and secure 500+ farmers, 5 lending institutions and 2500 users within 12 months. For community members who are interested in their project, you can check their GitHub commits( every 4 weeks). They will also collect feedback from MVP and beta users and will keep an eye on the number of onboarded users and applications built on top of technology stack. The team has a roadmap with clear milestones. The Digifarm team has a clear understandable solution (satellite imagery and AI) to solve the transparency and verification of in-field sustainability in smallholder agriculture value chain.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Technology (AI) for automatic detection of in-season and historical (30+ years) sustainability of agricultural fields using super-high resolution Satellite Earth Observation data. ", "experience": "DigiFarm has developed deep neural network models for automatically detecting field boundaries using super-resolved Sentinel-2 (1m), successfully delineating over 200M hectares. DigiFarm has also received funding in Fund 8 for its “Open ledger for agricultural fields”."}