{"id": 418386, "author": "sebpereira33", "title": "Decentralized Newsletter Service", "url": "https://cardano.ideascale.com/a/dtd/418386-48088", "category": 26595, "amount": 85000, "description": "Newsletter services are centralized and beholden to parties who are interested in censuring certain information. This discourages independent media and open information.", "f6_no_assessments": 6, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 2013, "q0": "The idea behind this project is to bring freedom to journalists. In fact, both for journalists and readers, who are always in search of the truth, it hurts whoever it hurts.\n\nThe problem addressed here is press censorship, caused by several players in this world of news. Journalists and/or blogs are always under big companies, be they news, advertisements, payments, etc. Anyway, we live today in a centralized world and, therefore, it is said in the proposal that there is always a “filter” of some entity for the news to pass or not, or even if the reader can access that type of content or not. That's because the content can affect the company or the ideology it wants to promote, even because whoever controls the information is the one who has the real power.\nThis is much discussed in several places, whether on Netflix with “the social dilemma”, or in the book by the Italian Giuliano da Empoli “Les Ingénieurs du chaos“, saying that the power of information even has the power to change elections A country. Therefore, the treatment of this point is of paramount importance.\n\nThe project aligns with the challenge in several ways. The first is to solve a real-world problem with blockchain, improving the world, in a way. Second, it will attract people who would not initially use blockchain to use it. And third, it has the potential to greatly increase the volume of transactions within the blockchain.\n\nMetrics and goals are also correlated with the challenge at hand as they are measuring the amount of writers joining the platform, which increases potential new customers, and the sale of NFT, which would increase transaction volume.\n\nOnce the project is running and people are gaining confidence in the platform, of course with the help of marketing (present on the team), it will develop and scale quickly. Another important point is that, after this step, they have plans to be financially self-sustaining, not resorting to Catalyst.\n", "q0r": 5, "q1": "In order to verify its feasibility, we need to verify the following aspects:\n1 – roadmap: The roadmap is not ready yet, and the proposal says it will produce a complete document on all stages of development that will serve as a roadmap. However, although it is not so detailed, looking at the team and all the knowledge involved, it seems feasible (although the risk)\n\n2 – budget: In this aspect, it follows the same successes and errors of the roadmap. There is a definition of scope and, with it, associations of resources and macro tasks, however, there is still a need for a greater expansion of these expenses that, I imagine, will come along with the roadmap.\nWithin it there is a need to include all the necessary strategies, tools, etc.\n\n3 – team: The NFT-DAO team is very complete and mixed, with evidence of knowledge. Therefore, evaluating this aspect of security over the total development of the platform.\n\n4 – risk management: Although I have addressed the risks and associated actions to mitigate them, the suggested risk, the adoption of the writers to the platform since they have a little aversion to crypto, is very impactful, being definitive for the functioning or not of the platform. Therefore, you should add the presence of marketing to this strategy and always check if the strategy is working.\n\n5 – self-funding/scalability: Monetary self-sufficiency and scalability strategies were provided once the project is ready.\n", "q1r": 4, "q2": "In order to audit, we need:\n1 – roadmap w/ milestones: To audit this point, it would really be necessary to already have the roadmap with the milestones and verify that all the steps can be verified. Dependence on releasing a full roadmap post-fund is a risk.\n\n2 – Metrics and KPI: The chosen KPIs are perfect for checking the development/evolution of the platform, taking into account both writer and reader adoption.\n\n3 – Channel: It was not provided a channel to share all the information. Maybe it’ll be published in the NFT-DAO website provided, however it was not clear about it.\n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4569, "q0": "If the last 7 or so years have demonstrated anything, it's the vulnerability of legacy publishing platforms to censorship both through public pressure and through demonetization by payment processors. Nevertheless, the proposal does do a good job of laying out the problem for people who may not be as familiar with the issue. I especially appreciate the analysis of Substack's vulnerabilities, as the platform is generally touted as one of the main bulwarks against the censorship regime.\n\nWith that in mind, I think it's easy to argue that a platform of the type proposed is needed. The NFT-based subscription system is a novel use for them (which we need more of, quite frankly), and the ability to support existing payment processors through EZ-Pay will likely go a long way toward onboarding writers while slowly nudging them into the crypto ecoystem.\n\nThe one thing I think could improve the Impact statements is to discuss what the CMS might look like. Writers tend not to want to wrestle with technology if they don't have to. What kinds of features will it offer on the editorial side? What existing CMSes are being used for inspiration, user-experience wise? As the proposal notes, this project sinks or swims by adoption, so building something writers want to use--and don't just need to because they've run out of other options--is very important.\n\nI also would like to see some more said about the sustainability of the NFT subscription model. Will new ones need to be purchased periodically to help continue to fund to the platform? If so, will defunct NFTs effectively become worthless? ", "q0r": 4, "q1": "This project makes use of existing solutions, several of which are the product of previous Catalyst rounds (Ez Pay, NFT-based authentication), which limits the amount of functionality the team has to build from the ground up. More over, the team has a history of delivering working products that have been funded through Catalyst. For these reasons, there is little reason to doubt that the team will be able to deliver the product, even if the timeline does seem a tad on the ambitious side. \n\nThe budget breakdown is adequate, but it would be nice to see how the money is being assigned in terms of human resources. A little more information upfront about individual team members' skill sets beyond Sebastian would also help answer some questions about how much expertise is being brought to bear on this project.\n\n", "q1r": 5, "q2": "As noted earlier, adoption will be what makes this project sink or swim, so I believe the proposers are right to focus on the number of writers onboarded, as well as the number of NFT \"subscribers\" as KPIs. \n\nIdeally, I'd like to see some intermediate development KPIs so auditors could get a sense of how the project is coming along before it's ready to launch, but if the proposer is able to stick to the timeline outlined here, that may be extraneous. \n", "q2r": 5, "assessor": "z_assessor_2564", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6215, "q0": "This proposal seeks funding to create a decentralized newsletter service.\nThe problem is clearly defined, current newsletter services are centralized and therefore could be controlled.\nThe solution is clearly outlined, a decentralized newsletter service where journalists are able to do their job without fear of censorship.\nPayment: “Here the proposed solution is to use the Cardano ledger to process payments. NFT-DAO has developed Ez Pay which can connect to legacy payment processors. This can be used to bring subscribers to a newsletter that do not want to use crypto tokens. Additionally, stablecoins will also be included as a payment method.”\nSubscription: “Here another team has already created a solution that we can implement: https://github.com/Loxe-Inc/F7-NFT-based-authentication”.\nStorage: “The decentralized network of Arweave will prevent anyone from censoring the information or appropriating the content of the writers.”\nThis proposal being a development of a dapp is in line with the challenge goals and metrics.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "This proposer has not been funded in previous funds, however NFT-DAO as a co-proposer has been funded in many previous funds and have a proposal (EZ-Mint Open Source NFT minting API) in this fund. And the sole proposer Sebastian Pereira // Head of project is a developer in the NFT-DAO team.\nThe proposer foresees risk of adoption and provides a mitigation strategy for it.\nThe proposer presents a plan, however the technical plan will be developed in the first month after funding, so at the moment there is no detailed plan for the work.\nOverall the plan is more descriptive than concrete and detailed. The plan is for three months period.\nThe budget is not detailed by its financial compartments, however it is more detailed and provides concrete deliverables for the money. Unfortunately hourly wages and hours needed for the tasks are not presented.\nThe head of the project is presented with an active linkedin account and the credentials are impressive. The rest of the team is presented as the team of NFT-DAO. \nThe team is open for people to join and presents a discord server link where they could do that.\nThis proposal is for a complete dApp – it will not need further funding for this stage. After launch, the team will decide on best sources of funding for future development and expansion.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The proposer suggests that the number of writers using the platform are the clear metric to measure success and provides a number of 100 for the first month.\nAdoption by people will be measured by NFTs sold. The metric is 1000NFTs sold for the first month.\nUnfortunately these are success metrics for after the project is completed.\nThe proposer does not provide any metrics, milestones or timeline by which the progress of the development of the project could be audited. Related to that, he does not provide a timeline either. \nDear proposer, you have a good idea, please spend the time to read the PA Guide and improve your proposal in order for the PAs to be able to rate it higher.\nI neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 3, "assessor": "z_assessor_2795", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 15092, "q0": "- When the general decentralized market is being noticed by many people, upgrading the Decentralized Newsletter Services I think is a good idea. Here the group raised the issue that censorship of information for chronological parties discourages independent media and open information. I strongly agree with this reality. with solutions like Create a Decentralized Newsletter Service that separates payments, publishing, and subscriptions from centralized services. I believe the group will solve the difficulties in the challenge. Besides, the group has also foreseen the risks and has reasonable plans to reduce those risks, which shows that the group has prepared very carefully for this proposal.", "q0r": 4, "q1": "- Regarding the project's plan and progress, I see that the team has determined a specific milestone that will complete the work within a period of 13 months which has been divided into 3 phases to complete me. think with the timeline as stated is reasonable to complete the tasks set out. with a budget of $85,000 and has been broken down into various items such as design costs. communication or development costs I find such team allocations to be reasonable. and with member Sebastian Pereir, a famous economist, as the team leader, I believe the project will not be difficult.", "q1r": 4, "q2": "- Here the team has given very specific KPIs such as will attract at least 100 writers after 1 month of release and the number of NFTs sold will be clearly disclosed. I find the indicators so far enough. The success of the project has also been mentioned that it will replace a similar role and not rely on centralized services. I also see this as a huge success. This makes a new turning point for the general decentralized market. Since this is a new project, it has not been funded yet, but I believe in the success of the project.", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15223, "q0": "The problem presented in this proposal is wicked and involves conflicts of interest in different niches of society. Blockchain technology is a good tool to solve the problem and the proposal is within the scope of this challenge.\n\nWhen the internet emerged, it greatly expanded the ability to communicate between people, journalism became more distributed because the internet greatly reduced the technical requirements for communication and journalism, but over time, governments began to better understand the technology and created mechanisms to regulate and censor opposition. Assange and Snowden are good examples of people who played an important role in journalism and who are now hunted by governments. They exposed government and companies fraud and corruption, instead of becoming heroes, they became exiled fugitives. Assange is close to being sentenced to prison.\n\nIn the pandemic that we have been witnessing since 2019, we could also see a great control of big techs and governments over what can be said, they use financial and political power to take down opposition journalism, regardless of whether the opposition is reasonable or not. As the proposal describes, payment processors end up being bottlenecks and weaknesses, because by intimidating payment processors, the business model of companies that host content creators ends up being unfeasible and the content creators/journalists themselves have their sources of income. blocked.\n\nAnother good example to illustrate the importance of creating decentralized payment solutions/integrations was the truck drivers' protest in Canada, where several people participating in the protest had their accounts blocked and centralized crowdfunding platforms blocked the funds raised.\n\nhttps://www.coindesk.com/layer2/2022/02/15/humans-are-the-last-mile-problem-of-bitcoin-crowdfunding-for-canada-truck-protest/\n\nI cite these examples only to illustrate that there is a conflict of interest for the establishment to overturn harmful narratives to the status quo and that solutions to this problem are important not only for Cardano and this challenge but for society as a whole.\n\nA big problem I see with the concept of decentralized media is that the crypto community has been trying to come up with solutions for it for almost 10 years, but creating the technology is not the only work to achieve the goal.\n\nSteemit was an example, they had a cryptocurrency monetized blog model that didn’t get significant adoption.\n\nI can also mention LBRY as another promising platform that allows sharing files such as texts, audios and videos. LBRY has not yet reached mass adoption and has excellent service. Some journalists and content creators censored by centralized media and services also went to LBRY/Odysse.\n\nThere is an aspect of behavior that makes people create habits, platforms like Instagram, Twitter and YouTube are digital public squares, that's where most people are. Creating a successful alternative platform demands that there is a plan for people to be interested in migrating, journalists and content creators complain that a good platform is not enough, people need to be there, otherwise almost no one accesses the content and the purpose is lost. This situation is a dilemma and it has been difficult to launch a decentralized media platform because of this, so I would recommend that the proposer mention strategies to overcome this challenge.\n\nThis proposal intends to create a platform with crypto payment integration, registrations through NFTs and decentralized data storage (through Airwave). It is a platform designed to be censorship resistant and simple to use, therefore it meets the requirements of the challenge and seems to have planned the technical requirements to solve the problem.\n\nThe established KPIs are relevant, 100 writers and 1000 subscribers (counted through NFTs) at the end of the first month, this helps to see a positive and relevant impact.\n\nThe proposer/time expressed interest in expanding the dapp to allow the integration of other media formats such as videos and audio, which is positive because due to the complexity of the problem the solution will need more steps to become a successful product. I would have liked to have seen more information about future plans to understand the potential for impact in the future. There is an intention to create a model of financial sustainability in the future, but there is no information about this yet and the team has not made it clear whether it will request funding from Catalyst again.\n\nIt would be nice to set targets a little longer than just after 1 month. The impact of a dapp of this type depends on usability over months/years, measuring this in a time window of just 1 month is not ideal.", "q0r": 4, "q1": "The team seems to have the necessary expertise to develop the proposal. Sebastian participated in the first Plutus Pioneer cohort, is an instructor at EMURGO academy and creator of NFT content. The NFTDAO team has great expertise in the development of NFTs and has created several projects related to NFTs and integrations such as EZpay itself, which is intended to be used as a tool for this proposal.\n\nI would recommend including more information about the team's expertise in Plutus development, perhaps repositories. I suppose some part of the platform uses Plutus but that was not mentioned.\n\nThe roadmap of this proposal indicates that the deliverables will be conceptual (roadmap/documentation/technical specifications and metadata model) and technical software integration with Arweave. The 3 month timeline is reasonable for the steps mentioned, but I would like to see more details on what payment integration would look like and how it would be done in a decentralized enough way to ensure censorship resistance.\n\nThere is no information on how this platform will be promoted and considering the defined KPIs (100 writers and 1000 subscribers) it would be important to at least have some guidance on how the team intends to make the dapp popular.\n\nAs I said before, there are already technical solutions to the problem presented in this proposal, such as LBRY, the problem is to make the solution become used by content creators/consumers.\n\nIt may be that the team will focus on outreach marketing at a later stage, but as the KPIs have been established, it is understood that some marketing/outreach campaign will be required.\n\nThe proposal has a budget breakdown for each stage, but they are not detailed enough to say if they are adequate. It would be important to have at least estimates of the workload (hours) for the development of the stages in order to see if the budget is reasonable.\n\nRisks were considered and the solutions presented are positive but insufficient. As I mentioned before, the risk is that the dapp/integration will not become popular, the team intends to create a platform with a good UX to reduce user friction and smooth the technical and integration part with crypto, this is very well thought out, but as I mentioned above there are no details of the marketing/outreach plan, which makes this risk not fully addressed by the team.\n\nThere was also no consideration of legal issues. LBRY is being sued by the SEC in a dubious process, after all there is no clarity on what a security is. Even though LBRy is a decentralized platform, the devs are being pressured, the same could happen with this team if the proposal becomes successful.", "q1r": 3, "q2": "The definition of success is \"Create a decentralized alternative to Substack that can fill the same role and not rely on centralized services.\" It is important to note that this definition of success does not imply whether this alternative is popular or not. The team can create the platform and the platform not become popular and useful to solve the problem.\n\nMetrics/KPIs are adequate to assess the definition of success, but only two were defined and would only be checked after the first month.\n\nIt would be important that the metrics were checked over a longer period of time in order to verify the performance of the platform.\n\nThere is a 3-month roadmap with deliverables each month, this helps with auditability, but there is not enough information about marketing/outreach in the roadmap.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15391, "q0": "This proposal is about creating a descentrilized newsletter service to oppose to the current existing ones in newspappers and blogs, that use a centralized approach. Proposer does a very nice job on explaining why the deentrilized way would be better pointing out several existing issues that most of us face and could be solved using a tokenized background.\nProposal is also aligned with challenge as it create a new product (or service) based on Cardano blockchain, addressing challenge kpis as \"Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases\".\nThere's indeed a major challenge on making existing tradicional media vehicles to adopt solutions that use blockchain (much because of their lack of knowledge on how it works). It is appreciated that this blockchain technical part willl be kept to a minimum. Its also very imporant to have a very functional and nice UI/UX to enhance its adoption. It would be nice if solution could be built in partnership with these stakeholders (Selected users and writers) to get their perspective since the conception.\nIn a summary, its a nice project with a good potential to improve an existing way to share information, migrating to a decentrilized approach and embeding its advantages in the process.\n", "q0r": 5, "q1": "The plan is timeframed and divided into 3 stages of work. there's a good level of details in regard to the acitvities necesary in each stage, to deliver the final product. An agile life-cycle could be adopted here as it seems still to exist a certain level of uncertainty to its technology or paths to be taken.\nBudget breakdown makes sense and is divided into the main work packages of the project. I would just add more information on the amount of hours necessary for each of them to give more transparecy. I liked a budget for marketing and communication is considered, this is imporant to have a true adoption of the solution.\nIn regard to the team, there seems to have mainly the proposer himself (and possibly yhe NFT-DAO team but not clear how many people will be allocated to this project). Proposer has experience on Cardano but not much is said on wha his background on the technological aspects of blockchain, NFT is. it is also said that 2 UI/UX designes will be necessary but not clear if they need to be hired or if resources from NFT-DAO team will be leveraged.\nAll in all, I agree that this project is feasible but team part could be better ellaborted. My rate is 4\n\n", "q1r": 4, "q2": "The elements provided to audit the project are good: there are some milestones in the plan and proposer provides 2 main kpis with target, once product is made available. I'd try also to consider some feedback both from writers and users about the platform to measure their level of satiscation. Its also imporant to have an online place to share the schedule/milestones advances and the kpis numbers. If an agile framework is adopted, product backlog and sprint reports could aldo be part of this sharing material.\n\n", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a decentralized newsletter service that decouples payment, publishing, and subscription from centralized services. That way journalists are able to do their job without fear of censorship.", "experience": "EMURGO Academy instructor, Proposer Reviewer, Veteran Proposer Reviewer, Challenge Team Leader."}